
&НаКлиенте
Процедура Отобрать(Команда)
	Перем АргументЗакрытия;
	
    ИмяТекущегоРаздела	= ИмяТекущегоВариантаФильтра();
    ФильтрРезультат		= ЗначенияФильтровПоРазделу(ИмяТекущегоРаздела);

	Если		ИмяТекущегоРаздела = "ФормаГлавноеОкноНоменклатура" Тогда
		
		ФильтрРезультат.ФильтрНаименованиеНоменклатуры	= ПараметрПроизвольныйФильтр1;
		ФильтрРезультат.ФильтрНоменклатура1С			= ПараметрПроизвольныйФильтр2;
		ФильтрРезультат.ФильтрGTIN						= ПараметрПроизвольныйФильтр3;
		ФильтрРезультат.ФильтрКодКонтрагента			= ПараметрПроизвольныйФильтр4;
		
	ИначеЕсли	ИмяТекущегоРаздела = "ФормаСопоставитьСДокументами1С" Тогда
		
		ЗаполнитьЗначенияСвойств(ФильтрРезультат, ЭтаФорма);
		ФильтрРезультат.ФильтрДельта				= ПараметрПроизвольныйФильтр2;
		ФильтрРезультат.ФильтрСтатусСопоставления	= ПараметрПроизвольныйФильтр1;
		ФильтрРезультат.ФильтрНомер					= ФильтрМаска;

		АргументЗакрытия = ФильтрРезультат;
		
	Иначе
		
		ЗаполнитьЗначенияСвойств(ФильтрРезультат, ЭтаФорма, , "ФильтрСтраница");
		ЗаполнитьЗначенияСвойств(ВладелецФормы, ФильтрРезультат);
		
		АргументЗакрытия = Истина;
	
	КонецЕсли;
	ФормаЗакрытьУстановитьСтатусОк(АргументЗакрытия);	
	
	ЭтаФорма.Закрыть(АргументЗакрытия);
	
КонецПроцедуры

