
&НаКлиенте
Процедура Отобрать(Команда)
	Перем АргументЗакрытия;
	
	Если ФильтрПериод = "За период"
		И ЗначениеЗаполнено(ФильтрДатаКнц)
		И ФильтрДатаНач > ФильтрДатаКнц Тогда
		
		ИсключениеПримененияФильтра = МодульОбъектаКлиент().НовыйСбисИсключение(760,,,,"Дата начала периода больше даты окончания");
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИсключениеПримененияФильтра,);	
		
	Иначе
		
		Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
		ИмяТекущегоРаздела	= ИмяТекущегоВариантаФильтра();
		ФильтрРезультат		= ЗначенияФильтровПоРазделу(ИмяТекущегоРаздела);
		
		Если		ИмяТекущегоРаздела = "ФормаГлавноеОкноНоменклатура" Тогда
			
			ФильтрРезультат.ФильтрМаска						= ФильтрМаска; 
			ФильтрРезультат.ФильтрТипНоменклатуры			= ПараметрПроизвольныйФильтр1;
			ФильтрРезультат.ФильтрНоменклатура				= ПараметрПроизвольныйФильтр2;
			ФильтрРезультат.ФильтрGTIN						= ПараметрПроизвольныйФильтр3;
			ФильтрРезультат.ФильтрКодКонтрагента			= ПараметрПроизвольныйФильтр4;
			
			АргументЗакрытия = ФильтрРезультат;
			
		ИначеЕсли	ИмяТекущегоРаздела = "ФормаСопоставитьСДокументами1С" Тогда
			
			ЗаполнитьЗначенияСвойств(ФильтрРезультат, ЭтаФорма);
			ФильтрРезультат.ФильтрДельта				= ПараметрПроизвольныйФильтр2;
			ФильтрРезультат.ФильтрСтатусСопоставления	= ПараметрПроизвольныйФильтр1;
			ФильтрРезультат.ФильтрНомер					= ФильтрМаска;
			
			АргументЗакрытия = ФильтрРезультат;
			
		Иначе
			
			ФильтрРезультат = Кэш.Текущий.Фильтр;
			
			// Если пользовательского фильтра нет, то просто заполнить изменения в текущий фильтр
			ЗаполнитьЗначенияСвойств(ФильтрРезультат, ЭтаФорма);
			
			АргументЗакрытия = Истина;
			
		КонецЕсли;
		
		МодульОбъектаКлиент().ИзменитьПараметрСбис("ПараметрыФильтра", ФильтрРезультат);
		
		ФормаЗакрытьУстановитьСтатусОк(АргументЗакрытия, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

