
&НаКлиенте
Процедура Отобрать(Команда)
	Перем АргументЗакрытия;
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
    ИмяТекущегоРаздела	= ИмяТекущегоВариантаФильтра();
    ФильтрРезультат		= ЗначенияФильтровПоРазделу(ИмяТекущегоРаздела);

	Если		ИмяТекущегоРаздела = "ФормаГлавноеОкноНоменклатура" Тогда
		
		ФильтрРезультат.ФильтрМаска						= ФильтрМаска; 
		ФильтрРезультат.ФильтрТипНоменклатуры			= ПараметрПроизвольныйФильтр1;
		ФильтрРезультат.ФильтрНоменклатура				= ПараметрПроизвольныйФильтр2;
		ФильтрРезультат.ФильтрGTIN						= ПараметрПроизвольныйФильтр3;
		ФильтрРезультат.ФильтрКодКонтрагента			= ПараметрПроизвольныйФильтр4;
		
		МодульФормированияФильтра = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("СформироватьСтруктуруФильтра", Кэш.Текущий.ФормыРаздела);
		Если МодульФормированияФильтра <> Ложь Тогда
			МодульФормированияФильтра.СформироватьСтруктуруФильтра(Кэш, ФильтрРезультат);
		КонецЕсли;
		
		АргументЗакрытия = ФильтрРезультат;
	
		МодульОбъектаКлиент().ИзменитьПараметрСбис("ПараметрыТекущегоФильтра", ФильтрРезультат);
		
	ИначеЕсли	ИмяТекущегоРаздела = "ФормаСопоставитьСДокументами1С" Тогда
		
		ЗаполнитьЗначенияСвойств(ФильтрРезультат, ЭтаФорма);
		ФильтрРезультат.ФильтрДельта				= ПараметрПроизвольныйФильтр2;
		ФильтрРезультат.ФильтрСтатусСопоставления	= ПараметрПроизвольныйФильтр1;
		ФильтрРезультат.ФильтрНомер					= ФильтрМаска;

		АргументЗакрытия = ФильтрРезультат;
	
		МодульОбъектаКлиент().ИзменитьПараметрСбис("ПараметрыТекущегоФильтра", ФильтрРезультат);
		
	Иначе
		
		МодульФормированияФильтра = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("СформироватьСтруктуруФильтра", Кэш.Текущий.ФормыРаздела);
		Если МодульФормированияФильтра <> Ложь Тогда
			МодульФормированияФильтра.СформироватьСтруктуруФильтра(Кэш, ЭтаФорма);
		КонецЕсли;
		
		АргументЗакрытия = Истина;
	
	КонецЕсли;
	
	ФормаЗакрытьУстановитьСтатусОк(АргументЗакрытия);
	
	ЭтаФорма.Закрыть(АргументЗакрытия);
	
КонецПроцедуры

