
&НаКлиенте
Процедура Отобрать(Команда)
	Перем АргументЗакрытия;
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
    ИмяТекущегоРаздела	= ИмяТекущегоВариантаФильтра();
    ФильтрРезультат		= ЗначенияФильтровПоРазделу(ИмяТекущегоРаздела);

	Если		ИмяТекущегоРаздела = "ФормаГлавноеОкноНоменклатура" Тогда
		
		ФильтрРезультат.ФильтрМаска						= ФильтрМаска; 
		ФильтрРезультат.ФильтрТипНоменклатуры			= ПараметрПроизвольныйФильтр1;
		ФильтрРезультат.ФильтрНоменклатура				= ПараметрПроизвольныйФильтр2;
		ФильтрРезультат.ФильтрGTIN						= ПараметрПроизвольныйФильтр3;
		ФильтрРезультат.ФильтрКодКонтрагента			= ПараметрПроизвольныйФильтр4;
		
		МодульФормированияФильтра = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("СформироватьСтруктуруФильтра", Кэш.Текущий.ФормыРаздела);
		Если МодульФормированияФильтра <> Ложь Тогда
			МодульФормированияФильтра.СформироватьСтруктуруФильтра(Кэш, ФильтрРезультат);
		КонецЕсли;
		
		АргументЗакрытия = ФильтрРезультат;
		
	ИначеЕсли	ИмяТекущегоРаздела = "ФормаСопоставитьСДокументами1С" Тогда
		
		ЗаполнитьЗначенияСвойств(ФильтрРезультат, ЭтаФорма);
		ФильтрРезультат.ФильтрДельта				= ПараметрПроизвольныйФильтр2;
		ФильтрРезультат.ФильтрСтатусСопоставления	= ПараметрПроизвольныйФильтр1;
		ФильтрРезультат.ФильтрНомер					= ФильтрМаска;

		АргументЗакрытия = ФильтрРезультат;
		
	Иначе
		
		ФильтрРезультат = Кэш.Текущий.Фильтр;

		МодульФормированияФильтра = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("СформироватьСтруктуруФильтра", Кэш.Текущий.ФормыРаздела);
		Если МодульФормированияФильтра = Ложь Тогда
			
			// Если пользовательского фильтра нет, то просто заполнить изменения в текущий фильтр
			ЗаполнитьЗначенияСвойств(ФильтрРезультат, ЭтаФорма);
			
		Иначе
			
			// Для сохранения совместимости с ВФК передаём форму в функцию формирования фильтра, если есть старая функция формирования.
			МодульФормированияФильтра.СформироватьСтруктуруФильтра(Кэш, ЭтаФорма);
			РезультатФормирования = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПараметрыФильтра");
			ЗаполнитьЗначенияСвойств(ФильтрРезультат, РезультатФормирования);
			
		КонецЕсли;
		
		АргументЗакрытия = Истина;
	
	КонецЕсли;
	
	МодульОбъектаКлиент().ИзменитьПараметрСбис("ПараметрыФильтра", ФильтрРезультат);
	
	ФормаЗакрытьУстановитьСтатусОк(АргументЗакрытия);
	
	ЭтаФорма.Закрыть(АргументЗакрытия);
	
КонецПроцедуры

