
&НаКлиенте
Функция ИмяТекущегоВариантаФильтра()
	
	Возврат МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ВариантыФильтров").ТекущаяСтраница.Имя;
	
КонецФункции

// Функция - возвращает набор используемых фильтров по разделу формы
//
// Параметры:
//  ИмяРазделаФильтра	 - Строка	 - имя раздела из панели ВариантыФильтров
// 
// Возвращаемое значение:
//  Структура - поля со значениями по-умолчанию
//
&НаКлиенте
Функция ЗначенияФильтровПоРазделу(ИмяРазделаФильтра = Неопределено) Экспорт
	
	Если ИмяРазделаФильтра = Неопределено Тогда
		
		ИмяРазделаФильтра = ИмяТекущегоВариантаФильтра();
		
	КонецЕсли;
	
	ПутьЭлементов		= "ВариантыФильтров." + ИмяРазделаФильтра + ".";
	ТипыПолейФильтра	= МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолейФильтра");
	ФильтрПериодДефолт	= "За последний месяц";
	
	Если		ИмяРазделаФильтра = "ФормаСопоставитьСДокументами1С" Тогда
		
		ФильтрПериодДефолт	= "За весь период";
		ПараметрыФильтра = Новый Структура("ФильтрДатаНач, ФильтрДатаКнц, ФильтрНомер, ФильтрПериод, ФильтрДельта, ФильтрСтатусСопоставления", "", "", "");
		ПараметрыФильтра.ФильтрДельта				= 0;
		ПараметрыФильтра.ФильтрСтатусСопоставления	= 0;
		ПараметрыФильтра.ФильтрПериод				= ФильтрПериодДефолт;

	ИначеЕсли   ИмяРазделаФильтра = "ФормаГлавноеОкноНоменклатура" Тогда
				
		ЭлементНоменклатура		= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, ПутьЭлементов + "ФильтрНоменклатура");
		ЭлементТипНоменклатуры	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, ПутьЭлементов + "ФильтрТипНоменклатуры");
		
		ПараметрыФильтра = Новый Структура("ФильтрМаска, ФильтрКодКонтрагента, ФильтрGTIN", "", "", "");
		ПараметрыФильтра.Вставить("ФильтрНоменклатура",		ТипыПолейФильтра.ФильтрНоменклатура.ПривестиЗначение());
		ПараметрыФильтра.Вставить("ФильтрТипНоменклатуры",	ТипыПолейФильтра.ФильтрТипНоменклатуры.ПривестиЗначение());
		
	Иначе
		
		ПараметрыФильтра	= Новый Структура(
		"ФильтрПериод,		ФильтрОрганизация,		ФильтрКонтрагент,			ФильтрОтветственный,		ФильтрДатаНач,	ФильтрДатаКнц, 
		|ФильтрСостояние,	ФильтрТипыДокументов,	ФильтрКонтрагентПодключен,	ФильтрКонтрагентСФилиалами,	ФильтрСтраница,	ФильтрМаска,
		|ФильтрПоРасхождениям");
		
		Если ТипыПолейФильтра.Свойство("ФильтрОрганизация") Тогда
			
			ПараметрыФильтра.ФильтрОрганизация = ТипыПолейФильтра.ФильтрОрганизация.ПривестиЗначение();
			
		Иначе
			
			ПараметрыФильтра.ФильтрОрганизация = "";
			
		КонецЕсли;
		
		Если ТипыПолейФильтра.Свойство("ФильтрКонтрагент") Тогда
			
			ПараметрыФильтра.ФильтрКонтрагент = ТипыПолейФильтра.ФильтрКонтрагент.ПривестиЗначение();
			
		Иначе
			
			ПараметрыФильтра.ФильтрКонтрагент = "";
			
		КонецЕсли;
		
		Если ТипыПолейФильтра.Свойство("ФильтрОтветственный") Тогда
			
			ПараметрыФильтра.ФильтрОтветственный = ТипыПолейФильтра.ФильтрОтветственный.ПривестиЗначение();
			
		Иначе
			
			ПараметрыФильтра.ФильтрОтветственный = "";
			
		КонецЕсли;
		
		ПараметрыФильтра.ФильтрКонтрагентПодключен	= "";
		ПараметрыФильтра.ФильтрМаска				= "";
		ПараметрыФильтра.ФильтрТипыДокументов		= Новый СписокЗначений;
		ПараметрыФильтра.ФильтрКонтрагентСФилиалами	= Ложь;
		ПараметрыФильтра.ФильтрСтраница				= 1;
		ПараметрыФильтра.ФильтрПериод				= ФильтрПериодДефолт;  
		ПараметрыФильтра.ФильтрПоРасхождениям		= Ложь;
		
	КонецЕсли;
	
	ПараметрыДляФильтра = ЗначенияДляФильтрПериод(ПараметрыФильтра);
	ЗаполнитьЗначенияСвойств(ПараметрыФильтра, ПараметрыДляФильтра);

	Возврат ПараметрыФильтра;
	
КонецФункции

&НаКлиенте
Процедура ФильтрТипыДокументовНачалоВыбора_Общее(Элемент)
	
	Для Каждого ЭлементВыбора Из  Элемент.СписокВыбора цикл		
		
		Если ФильтрТипыДокументов.НайтиПоЗначению(элементВыбора.значение) = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ЭлементВыбора.Пометка = Истина;
		
	КонецЦикла;
	
	ОбработчикВыбораСписка		= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПослеОтметкиТиповДокументов", ЭтаФорма);
	ПараметрыВыбратьИзСписка	= Новый Структура("ОтметитьЭлементы, Заголовок, Обработчик", Истина, "Выберите типы", ОбработчикВыбораСписка);
	МодульОбъектаКлиент().СбисВыбратьИзСписка(Элемент.СписокВыбора, ПараметрыВыбратьИзСписка);

КонецПроцедуры

// Функция - Значения для фильтр период по представлению
//
// Параметры:
//  ЗначениеФильтр - Строка	 - представление фильтр период
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - ДатаНач, ДатаКнц
//
&НаКлиенте
Функция ЗначенияДляФильтрПериод(ЗначениеФильтр) Экспорт
	Перем ЗначениеФильтрПериод, ЗначениеДатаКнц, ЗначениеДатаНач;

	Если		ТипЗнч(ЗначениеФильтр) = Тип("Структура")
		И	Не	ЗначениеФильтр.Свойство("ФильтрПериод", ЗначениеФильтрПериод) Тогда
		
		Возврат Новый ФиксированнаяСтруктура;
		
	Иначе
		
		ЗначениеФильтрПериод = ЗначениеФильтр.ФильтрПериод;
		
	КонецЕсли;
		
	Если	ЗначениеФильтрПериод = "За сегодня" Тогда
		
		ЗначениеДатаКнц = ТекущаяДата();
		ЗначениеДатаНач = ТекущаяДата();
		
	ИначеЕсли	ЗначениеФильтрПериод = "За последний месяц" Тогда
		
		ЗначениеДатаКнц = ТекущаяДата();
		ЗначениеДатаНач = ДобавитьМесяц(ЗначениеДатаКнц, -1);
		
	ИначеЕсли	ЗначениеФильтрПериод = "За последние полгода" Тогда
		
		ЗначениеДатаКнц = ТекущаяДата();
		ЗначениеДатаНач = ДобавитьМесяц(ЗначениеДатаКнц, -6);
		
	ИначеЕсли	ЗначениеФильтрПериод = "За последний год" Тогда
		
		ЗначениеДатаКнц = ТекущаяДата();
		ЗначениеДатаНач = ДобавитьМесяц(ЗначениеДатаКнц, -12);
		
	Иначе
		
		ЗначениеДатаКнц = '0001.01.01';
		ЗначениеДатаНач = '0001.01.01';
		Если Не ЗначениеФильтрПериод = "За весь период" Тогда
		
			Если ЗначениеЗаполнено(ЗначениеФильтр.ФильтрДатаКнц) Тогда
			
				ЗначениеДатаКнц = ЗначениеФильтр.ФильтрДатаКнц;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЗначениеФильтр.ФильтрДатаНач) Тогда
			
				ЗначениеДатаНач = ЗначениеФильтр.ФильтрДатаНач;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура("ФильтрДатаНач, ФильтрДатаКнц", ЗначениеДатаНач, ЗначениеДатаКнц);
	
КонецФункции

// Процедура устанавливает значения фильтра по-умолчанию для текущего раздела	
&НаКлиенте
Функция  ЗначенияДляФильтрПоУмолчанию(СтруктураРаздела) Экспорт
	
	МодульТекущий	= МодульОбъектаКлиент();
	Кэш				= МодульТекущий.ПолучитьТекущийЛокальныйКэш();
	Результат		= ЗначенияФильтровПоРазделу("");
	
	// Определить фильтр состояние. Если есть модуль для определения, то взять от него, или от ГО, если там что-то есть.
	МодульСпискаСостояний = МодульТекущий.НайтиФункциюСеансаОбработки("СписокСостоянийДокумента", СтруктураРаздела.ОписаниеРаздела.ФормыРаздела);
	Если Не МодульСпискаСостояний = Ложь Тогда
		
		СписокСостояний				= МодульСпискаСостояний.СписокСостоянийДокумента();
		Результат.ФильтрСостояние	= СписокСостояний.НайтиПоИдентификатору(0).Значение;
		
	ИначеЕсли ЗначениеЗаполнено(Кэш.ГлавноеОкно.СписокСостояний) Тогда
		
		Результат.ФильтрСостояние	= Кэш.ГлавноеОкно.СписокСостояний.НайтиПоИдентификатору(0).Значение;
		
	КонецЕсли;
	
	МодульТекущий.РазделГО_ОбработчикиФильтра(СтруктураРаздела, Результат);
	
	Возврат Результат;
	
КонецФункции

