
&НаКлиенте
Процедура ФильтрПериодПриИзменении(Элемент)
	
	ФильтрУстановитьВидимость(ИмяТекущегоВариантаФильтра());
	
	ПараметрыДляФильтра = ЗначенияДляФильтрПериод(ЭтаФорма);
	
	ФильтрДатаНач = ПараметрыДляФильтра.ФильтрДатаНач;
	ФильтрДатаКнц = ПараметрыДляФильтра.ФильтрДатаКнц;
		
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОчистить(Элемент)
	
	ИмяТекущегоРаздела	= ИмяТекущегоВариантаФильтра();

	Если	ИмяТекущегоРаздела = "ФормаСопоставитьСДокументами1С" Тогда
		
		ФильтрПоУмолчанию	= ЗначенияФильтровПоРазделу(ИмяТекущегоРаздела);
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ФильтрПоУмолчанию);
		ПараметрПроизвольныйФильтр2	= ФильтрПоУмолчанию.ФильтрДельта;
		ПараметрПроизвольныйФильтр1	= ФильтрПоУмолчанию.ФильтрСтатусСопоставления;
		ФильтрМаска					= ФильтрПоУмолчанию.ФильтрНомер;
		
	Иначе
		
		ФильтрПоУмолчанию	= ЗначенияДляФильтрПоУмолчанию(ПараметрыФормы.Раздел);

		Если ИмяТекущегоРаздела = "ФормаГлавноеОкноНоменклатура" Тогда
		
			ФильтрМаска					= ФильтрПоУмолчанию.ФильтрМаска;
			ПараметрПроизвольныйФильтр1	= ФильтрПоУмолчанию.ФильтрТипНоменклатуры;
			ПараметрПроизвольныйФильтр2 = ФильтрПоУмолчанию.ФильтрНоменклатура;
			ПараметрПроизвольныйФильтр3 = ФильтрПоУмолчанию.ФильтрGTIN;
			ПараметрПроизвольныйФильтр4 = ФильтрПоУмолчанию.ФильтрКодКонтрагента;
			
		Иначе
		
			ЗаполнитьЗначенияСвойств(ЭтаФорма, ФильтрПоУмолчанию);
			
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеОтметкиТиповДокументов(Список, Параметры) Экспорт
	Если Список = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФильтрТипыДокументов.Очистить();
	Для Каждого ЭлементВыбора Из Список цикл
		Если ЭлементВыбора.Пометка Тогда
			
			ФильтрТипыДокументов.Добавить(ЭлементВыбора.Значение, ЭлементВыбора.Представление);
			
	    КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область include_local_Формы_ФормаУстановкиФильтра_Интерфейс_События
#КонецОбласти

