
&НаКлиенте
Процедура ФильтрПериодПриИзменении(Элемент)
	
	ФильтрУстановитьВидимость(ИмяТекущегоВариантаФильтра());
	
	Если	ФильтрПериод = "За сегодня" Тогда
		
		ФильтрДатаНач = ТекущаяДата();
		ФильтрДатаКнц = ТекущаяДата();
		
	ИначеЕсли	ФильтрПериод = "За последний месяц" Тогда
		
		ФильтрДатаКнц = ТекущаяДата();
		ФильтрДатаНач = ДобавитьМесяц(ФильтрДатаКнц,-1);
		
	ИначеЕсли	ФильтрПериод = "За последние полгода" Тогда
		
		ФильтрДатаКнц = ТекущаяДата();
		ФильтрДатаНач = ДобавитьМесяц(ФильтрДатаКнц,-6);
		
	ИначеЕсли	ФильтрПериод = "За последний год" Тогда
		
		ФильтрДатаКнц = ТекущаяДата();
		ФильтрДатаНач = ДобавитьМесяц(ФильтрДатаКнц, -12);
		
	Иначе//		ФильтрПериод = "За весь период"
		
		ФильтрДатаНач = "";
		ФильтрДатаКнц = "";

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОчистить(Элемент)
	
	ИмяТекущегоРаздела	= ИмяТекущегоВариантаФильтра();
	ФильтрПоУмолчанию	= ЗначенияФильтровПоРазделу(ИмяТекущегоРаздела);
	
	Если		ИмяТекущегоРаздела = "ФормаГлавноеОкноНоменклатура" Тогда
		
		ПараметрПроизвольныйФильтр1 = ФильтрПоУмолчанию.ФильтрНаименованиеНоменклатуры;
		ПараметрПроизвольныйФильтр2 = ФильтрПоУмолчанию.ФильтрНоменклатура1С;
		ПараметрПроизвольныйФильтр3 = ФильтрПоУмолчанию.ФильтрGTIN;
		ПараметрПроизвольныйФильтр4 = ФильтрПоУмолчанию.ФильтрКодКонтрагента;
		
	ИначеЕсли	ИмяТекущегоРаздела = "ФормаСопоставитьСДокументами1С" Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ФильтрПоУмолчанию);
		ПараметрПроизвольныйФильтр2	= ФильтрПоУмолчанию.ФильтрДельта;
		ПараметрПроизвольныйФильтр1	= ФильтрПоУмолчанию.ФильтрСтатусСопоставления;
		ФильтрМаска					= ФильтрПоУмолчанию.ФильтрНомер;
		
	Иначе
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ФильтрПоУмолчанию);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеОтметкиТиповДокументов(Список, Параметры) Экспорт
	Если Список = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФильтрТипыДокументов.Очистить();
	Для Каждого ЭлементВыбора Из Список цикл
		Если ЭлементВыбора.Пометка Тогда
			
			ФильтрТипыДокументов.Добавить(ЭлементВыбора.Значение, ЭлементВыбора.Представление);
			
	    КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрТипыДокументовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = ложь;
	
	Для Каждого ЭлементВыбора Из  Элемент.СписокВыбора цикл		
		
		Если ФильтрТипыДокументов.НайтиПоЗначению(элементВыбора.значение) = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ЭлементВыбора.Пометка=истина;
		
	КонецЦикла;
	
	ОбработчикВыбораСписка		= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПослеОтметкиТиповДокументов", ЭтаФорма);
	ПараметрыВыбратьИзСписка	= Новый Структура("ОтметитьЭлементы, Заголовок, Обработчик", Истина, "Выберите типы",ОбработчикВыбораСписка);
	МодульОбъектаКлиент().СбисВыбратьИзСписка(Элемент.СписокВыбора, ПараметрыВыбратьИзСписка);
	
КонецПроцедуры

