
&НаКлиенте
Процедура ФильтрПериодПриИзменении(Элемент)
	
	ФильтрУстановитьВидимость(ИмяТекущегоВариантаФильтра());
	
	ПараметрыДляФильтра = ЗначенияДляФильтрПериод(ЭтаФорма);
	
	ФильтрДатаНач = ПараметрыДляФильтра.ФильтрДатаНач;
	ФильтрДатаКнц = ПараметрыДляФильтра.ФильтрДатаКнц;
		
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОчистить(Элемент)
	
	ИмяТекущегоРаздела	= ИмяТекущегоВариантаФильтра();

	Если	ИмяТекущегоРаздела = "ФормаСопоставитьСДокументами1С" Тогда
		
		ФильтрПоУмолчанию	= ЗначенияФильтровПоРазделу(ИмяТекущегоРаздела);
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ФильтрПоУмолчанию);
		ПараметрПроизвольныйФильтр2	= ФильтрПоУмолчанию.ФильтрДельта;
		ПараметрПроизвольныйФильтр1	= ФильтрПоУмолчанию.ФильтрСтатусСопоставления;
		ФильтрМаска					= ФильтрПоУмолчанию.ФильтрНомер;
		
	Иначе
		
		ФормыРаздела		= МодульОбъектаКлиент().РазделГО_Получить(РазделГО, "ФормыРаздела");
		ФормаСбросаФильтра	= МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("УстановитьПараметрыРаздела", ФормыРаздела);
		
		Если ФормаСбросаФильтра = Ложь Тогда
			ФильтрПоУмолчанию	= ЗначенияДляФильтрПоУмолчанию(РазделГО);
		Иначе
			ФильтрПоУмолчанию	= ФормаСбросаФильтра.ЗначенияДляФильтрПоУмолчанию(РазделГО);
		КонецЕсли;

		Если ИмяТекущегоРаздела = "ФормаГлавноеОкноНоменклатура" Тогда
		
			ФильтрМаска					= ФильтрПоУмолчанию.ФильтрМаска;
			ПараметрПроизвольныйФильтр1	= ФильтрПоУмолчанию.ФильтрТипНоменклатуры;
			ПараметрПроизвольныйФильтр2 = ФильтрПоУмолчанию.ФильтрНоменклатура;
			ПараметрПроизвольныйФильтр3 = ФильтрПоУмолчанию.ФильтрGTIN;
			ПараметрПроизвольныйФильтр4 = ФильтрПоУмолчанию.ФильтрКодКонтрагента;
			
		Иначе
		
			ЗаполнитьЗначенияСвойств(ЭтаФорма, ФильтрПоУмолчанию);
			
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеОтметкиТиповДокументов(Список, Параметры) Экспорт
	Если Список = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФильтрТипыДокументов.Очистить();
	Для Каждого ЭлементВыбора Из Список цикл
		Если ЭлементВыбора.Пометка Тогда
			
			ФильтрТипыДокументов.Добавить(ЭлементВыбора.Значение, ЭлементВыбора.Представление);
			
	    КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрТСНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыДиалога = Новый Структура;
	ПараметрыДиалога.Вставить("FILTER_NAME", "ФильтрТС");
	ПараметрыДиалога.Вставить("INI", "ТорговаяСеть_list");
	ПараметрыДиалога.Вставить("MULTI", Ложь);
	
	ПараметрыОткрытия = Новый Структура("КэшироватьФорму, ПолучитьНовую, Владелец, Параметры", Ложь, Истина, ЭтаФорма, ПараметрыДиалога);
	Форма = МодульОбъектаКлиент().ПолучитьФормуОбработки("ДиалогВыбораИзСписка", ПараметрыОткрытия);
	
	Если Форма <> Ложь Тогда
		Форма.Открыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ЭтаФорма[ИсточникВыбора.FILTER_NAME] = ВыбранноеЗначение;
	
	ПолеФильтра = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, ИсточникВыбора.FILTER_NAME);
	ПолеФильтра.СписокВыбора.Очистить();
	ПолеФильтра.СписокВыбора.Добавить(ВыбранноеЗначение, ВыбранноеЗначение.Название);
	
КонецПроцедуры

#Область include_local_Формы_ФормаУстановкиФильтра_Интерфейс_События
#КонецОбласти

