
&НаКлиенте
Процедура ФильтрПериодПриИзменении(Элемент)
	
	ФильтрУстановитьВидимость(ИмяТекущегоВариантаФильтра());
	
	Если	ФильтрПериод = "За сегодня" Тогда
		
		ФильтрДатаНач = ТекущаяДата();
		ФильтрДатаКнц = ТекущаяДата();
		
	ИначеЕсли	ФильтрПериод = "За последний месяц" Тогда
		
		ФильтрДатаКнц = ТекущаяДата();
		ФильтрДатаНач = ДобавитьМесяц(ФильтрДатаКнц,-1);
		
	ИначеЕсли	ФильтрПериод = "За последние полгода" Тогда
		
		ФильтрДатаКнц = ТекущаяДата();
		ФильтрДатаНач = ДобавитьМесяц(ФильтрДатаКнц,-6);
		
	ИначеЕсли	ФильтрПериод = "За последний год" Тогда
		
		ФильтрДатаКнц = ТекущаяДата();
		ФильтрДатаНач = ДобавитьМесяц(ФильтрДатаКнц, -12);
		
	Иначе//		ФильтрПериод = "За весь период"
		
		ФильтрДатаНач = "";
		ФильтрДатаКнц = "";

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОчистить(Элемент)
	
	ИмяТекущегоРаздела	= ИмяТекущегоВариантаФильтра();
	ФильтрПоУмолчанию	= ЗначенияФильтровПоРазделу(ИмяТекущегоРаздела);
	
	Если		ИмяТекущегоРаздела = "ФормаГлавноеОкноНоменклатура" Тогда
		
		ФильтрМаска					= ФильтрПоУмолчанию.ФильтрМаска;
		ПараметрПроизвольныйФильтр1	= ФильтрПоУмолчанию.ФильтрТипНоменклатуры;
		ПараметрПроизвольныйФильтр2 = ФильтрПоУмолчанию.ФильтрНоменклатура;
		ПараметрПроизвольныйФильтр3 = ФильтрПоУмолчанию.ФильтрGTIN;
		ПараметрПроизвольныйФильтр4 = ФильтрПоУмолчанию.ФильтрКодКонтрагента;
		
	ИначеЕсли	ИмяТекущегоРаздела = "ФормаСопоставитьСДокументами1С" Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ФильтрПоУмолчанию);
		ПараметрПроизвольныйФильтр2	= ФильтрПоУмолчанию.ФильтрДельта;
		ПараметрПроизвольныйФильтр1	= ФильтрПоУмолчанию.ФильтрСтатусСопоставления;
		ФильтрМаска					= ФильтрПоУмолчанию.ФильтрНомер;
		
	Иначе
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ФильтрПоУмолчанию);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеОтметкиТиповДокументов(Список, Параметры) Экспорт
	Если Список = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФильтрТипыДокументов.Очистить();
	Для Каждого ЭлементВыбора Из Список цикл
		Если ЭлементВыбора.Пометка Тогда
			
			ФильтрТипыДокументов.Добавить(ЭлементВыбора.Значение, ЭлементВыбора.Представление);
			
	    КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область include_local_Формы_ФормаУстановкиФильтра_Интерфейс_События
#КонецОбласти

