
//DynamicDirective
Функция яКоннекшенSABY_Выгрузить_ЗаписьWriteConnection(КоннекшенSABY, КлючВыгрузкиЗаписи)
    Перем РасширениеВыгрузки;
	
	Если КлючВыгрузкиЗаписи = "полный" Тогда
		
		ТипНастроек				= КоннекшенSABY_Получить(КоннекшенSABY, "ТипНастроек");
		ЗаписьWriteConnection	= ИнтеграцияSABY_Выгрузить(КоннекшенSABY, "ЗаписьWriteConnection", КлючВыгрузкиЗаписи);
		ЗаписьWriteConnection.props.Удалить("for_all");
		// На случай не совпадения типов переделать ИД
		РодительПодключения = КоннекшенSABY_Получить(КоннекшенSABY, "ИдентификаторИнтеграции");
		Если ЗначениеЗаполнено(РодительПодключения) Тогда
		
			ЗаписьWriteConnection.props.Вставить("parent", РодительПодключения);
			
		КонецЕсли;
		ЗаписьWriteConnection.ini = яКоннекшенSABY_Выгрузить_ЗаписьWriteConnection_Ини(КоннекшенSABY, КлючВыгрузкиЗаписи);
		
	ИначеЕсли КлючВыгрузкиЗаписи = "параметры" Тогда
		
		ЗаписьWriteConnection = Новый Структура("ini, props", Новый Массив, Новый Структура("id"));
		
	Иначе 
		
		ВызватьИсключение NewExtException(	, МодульОбъектаКлиентСервер_Представление() + "КоннекшенSABY.Выгрузить.ЗаписьWriteConnection",
											, "Неизвестный тип выгрузки записи для WriteConnection",, Новый Структура("КлючВыгрузки", КлючВыгрузкиЗаписи));
		
	КонецЕсли;
	
	ЗаписьWriteConnection.props.id = КоннекшенSABY_Получить(КоннекшенSABY, "Идентификатор");
	ПараметрыКоннекшена = яКоннекшенSABY_Выгрузить_Запись_ПараметрыПодключения(КоннекшенSABY, КлючВыгрузкиЗаписи);

	ЗаписьWriteConnection.props.Вставить("json_connection", ПреобразоватьЗначениеВJSON(ПараметрыКоннекшена));
	
	Возврат ЗаписьWriteConnection;
	
КонецФункции

//DynamicDirective
Функция яКоннекшенSABY_Выгрузить_ЗаписьWriteConnection_Ини(КоннекшенSABY, ДопПараметры)
	
	ПараметрыСистемы				 = ГлобальныйКэш_Получить("ПараметрыСистемы");
	МодульУправленияНастройкамиSaby	 = ПараметрSABY("НастройкиСБИС");
	
	ПараметрыРаботыПодключения	= КоннекшенSABY_Получить(КоннекшенSABY, "ПараметрыРаботы");
	ДанныеИниПодключения		= КоннекшенSABY_Получить(КоннекшенSABY, "Ини");
	ДанныеМенюПодключения		= КоннекшенSABY_Получить(КоннекшенSABY, "Меню");
	ТипНастроек					= КоннекшенSABY_Получить(КоннекшенSABY, "ТипНастроек");

	ЕстьИниКЗаписи	= Булево(ПараметрыРаботыПодключения.СбисИни.СписокОтправить.Количество());
	ФормированиеМеню=		ПараметрыРаботыПодключения.СбисМеню.Обновить
						И	ПараметрыРаботыПодключения.СбисМеню.Отправлять;
							
	//Если это не запись сбиспараметров, то проверим необходимость обновить сбисменю. Если надо, то выполним запись 	
	ini_array = Новый Массив;
	
	Кэш				= ПолучитьТекущийЛокальныйКэш();
	ОшибкаГенерации	= Ложь;
	//Если надо апдейтнуть меню по данным, то делаем только если сразу отправим на БЛ
	Если ФормированиеМеню Тогда
		РезультатГенерацииМеню = МодульУправленияНастройкамиSaby.КлассIntegrationConnection_СформироватьСбисМеню(Кэш, КоннекшенSABY,, ОшибкаГенерации);
		Если ОшибкаГенерации Тогда
			ОшибкаВыгрузкиЗаписи = NewExtException(РезультатГенерацииМеню, МодульОбъектаКлиентСервер_Представление() + "КоннекшенSABY.Выгрузить.ЗаписьWriteConnection");
			ВызватьИсключение ExtException_Dump(ОшибкаВыгрузкиЗаписи);
		КонецЕсли;
	КонецЕсли;
	
	//Конвертнём и добавим в параметры ини к обновлению на сервисе
	Если ЕстьИниКЗаписи
		И (ТипНастроек = "Шаблон") Тогда // Ини только на шаблон!!!
		ДанныеСпискаИни = МодульУправленияНастройкамиSaby.КлассIntegrationConnection_СписокИни(Кэш, КоннекшенSABY,  Новый Структура("Включено", "01"), ОшибкаГенерации);
		КонвертированныеИни	= Новый Структура;
		Для Каждого ИмяИниВО Из  ПараметрыРаботыПодключения.СбисИни.СписокОтправить Цикл
			Если Не ДанныеИниПодключения.Свойство(ИмяИниВО) Тогда
				
				ОшибкаВыгрузкиЗаписи = NewExtException(,
											МодульОбъектаКлиентСервер_Представление() + "КоннекшенSABY.Выгрузить.ЗаписьWriteConnection",
											785,
											"Ошибка во входящих данных",
											"Отсутствует файл настроек " + ИмяИниВО + " в данных к отправке!");
				
				ВызватьИсключение ExtException_Dump(ОшибкаВыгрузкиЗаписи);
				
			КонецЕсли;
			КонвертированныеИни.Вставить(ИмяИниВО, ДанныеИниПодключения[ИмяИниВО]);
		КонецЦикла;
		КонвертированныеИни = МодульУправленияНастройкамиSaby.ПреобразованиеВОИни_JSONИни_ВыполнитьПреобразование(КонвертированныеИни);
		
		Для Каждого ИмяИниВО Из ПараметрыРаботыПодключения.СбисИни.СписокОтправить Цикл
			ЗаписьИни			= МодульУправленияНастройкамиSaby.СбисОписаниеИни(Кэш);
			ЗначениеИни			= КонвертированныеИни[ИмяИниВО];
			СписокКлючейОчистить= Новый Массив;
			Для Каждого КлючИЗначениеЗначениеИни Из ЗначениеИни Цикл
				Если Лев(КлючИЗначениеЗначениеИни.Ключ, 4) = "Сбис" Тогда
					СписокКлючейОчистить.Добавить(КлючИЗначениеЗначениеИни.Ключ);
				КонецЕсли;
			КонецЦикла;
			Для Каждого КлючОчистить Из СписокКлючейОчистить Цикл
				ЗначениеИни.Удалить(КлючОчистить);
			КонецЦикла;
			
			ИмяИниJson	= МодульУправленияНастройкамиSaby.ПолучитьИмяИни(Кэш.КэшНастроек.ПараметрыНастроек, ИмяИниВО, "во_json");
			ЭлементКарты= ДанныеСпискаИни.Карта.НайтиПоЗначению(НРег(ИмяИниJson));
			Если ЭлементКарты = Неопределено Тогда
				//Нет такой ини в карте. Неизвестно, что это. Пропускаем.
				Продолжить;
			КонецЕсли;
			ДанныеСписка= ДанныеСпискаИни.Данные[ДанныеСпискаИни.Карта.Индекс(ЭлементКарты)];
			ЗаполнитьЗначенияСвойств(ЗаписьИни, ДанныеСписка);
		
			ЗаписьИни.data = ПреобразоватьЗначениеВJSON(ЗначениеИни);
			ini_array.Добавить(ЗаписьИни);
		КонецЦикла;
	КонецЕсли;
	
	//Добавим меню в список отправляемых ини
	Если ФормированиеМеню Тогда
		ЗаписьИни = МодульУправленияНастройкамиSaby.СбисОписаниеИниМеню(Кэш, ПреобразоватьЗначениеВJSON(ДанныеМенюПодключения));
		ini_array.Добавить(ЗаписьИни);
	КонецЕсли;
	
	Возврат ini_array;
	
КонецФункции

//DynamicDirective
Функция яКоннекшенSABY_Выгрузить_Запись_ПараметрыПодключения(КоннекшенSABY, ДопПараметры = Неопределено)
	
	ПараметрыСистемы	 = ГлобальныйКэш_Получить("ПараметрыСистемы");
	МодульОбщихНастроек	 = ПараметрSABY("МодульУправленияНастройками");
	
	ПараметрыКоннекшена	 		= КоннекшенSABY_Получить(КоннекшенSABY, "ПараметрыSaby");
	ПараметрыКонфигурации		= КоннекшенSABY_Получить(КоннекшенSABY, "ПараметрыКонфигурации");
	ПараметрыРаботыПодключения	= КоннекшенSABY_Получить(КоннекшенSABY, "ПараметрыРаботы");
	
	ЭтоНовоеПодключение =	ПараметрыРаботыПодключения.Статус = "Удален"
						Или ПараметрыРаботыПодключения.Статус = "Новый";
	Если ЭтоНовоеПодключение Тогда 
		
		ПараметрыКоннекшена.Вставить("Service4Config",	ПараметрыСистемы.Платформа.Сервис + "82");
		ПараметрыКоннекшена.Вставить("nameSubsystem",	МодульОбщихНастроек.ОпределитьТипНастроекПоПрефиксу(, ПараметрыКонфигурации.subsystem));
		Если Не ПараметрыКоннекшена.Свойство("comment") Тогда
			
			ПараметрыКоннекшена.Вставить("comment", "Создано обработкой " + ПараметрыСистемы.Обработка.ПолнаяВерсия);
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если КоннекшенSABY_Получить(КоннекшенSABY, "ОтключеныДоработки") Тогда
		
		ПараметрыКоннекшена.Вставить("DisableCustomAlgorithms", Истина);
		
	Иначе
		
		ПараметрыКоннекшена.Вставить("DisableCustomAlgorithms", Ложь);
		
	КонецЕсли;
	
	Возврат ПараметрыКоннекшена;
	
КонецФункции

