
// Вызывает диалог формы
//
// Параметры:
//  ПараметрыВызова	 - Структура	 - 
//		Кэш	- Структура, передаваемый кэш. Если не указан, то берётся от владельца.
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Процедура Показать(ПараметрыВызова) Экспорт
	Перем Кэш;
	Если		ПараметрыВызова = Неопределено
		Или	Не	ПараметрыВызова.Свойство("Кэш", Кэш) Тогда
		Кэш  = ВладелецФормы.Кэш;
	КонецЕсли;
	
	Попытка
		СбисИнициироватьФорму(Кэш);
	Исключение
		ИнфоОбОшибке	= ИнформацияОбОшибке();
		СбисИсключение	= МодульОбъектаКлиент().НовыйСбисИсключение(ИнфоОбОшибке, "ФайлыНастроекОбщее.Показать");
		МодульОбъектаКлиент().СообщитьСбисИсключение(СбисИсключение);
		Возврат;
	КонецПопытки;
	СбисОбновитьОтображение();

	Если Открыта() Тогда
		Возврат;
	КонецЕсли;
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ЭтаФорма.ОткрытьМодально();
	#Иначе
		ЭтаФорма.Открыть();
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура СбисИнициироватьФорму(Кэш) Экспорт
	
	МестныйКэш				= Кэш;
	ПараметрыРаботы	= Новый Структура;
	ВыполнитьЗакрытиеФормы	= Ложь;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, МестныйКэш.Парам);
	МестныйКэш.ФормаНастроек.ПриЗапускеРедактораНастроек(Новый Структура("КэшироватьВсеПолучаемые", Истина), МестныйКэш);
	СбисОбновитьЭлементы_РазделНастроек();
	
КонецПроцедуры

#Область include_core_vo2_Настройки_Общее_Интерфейс_События
#КонецОбласти

#Область include_core_vo2_Настройки_Общее_Интерфейс_ОбработчикиСобытий
#КонецОбласти

