
&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыИницизации = Неопределено) Экспорт
	
	ПараметрыРаботы			= Новый Структура;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Кэш.Парам);
	Кэш.ФормаНастроек.ПриЗапускеРедактораНастроек(Новый Структура("КэшироватьВсеПолучаемые, ИсправитьПроблемыИни", Истина, Истина), Кэш);
	
	СбисОбновитьОтображение();
	
КонецПроцедуры

#Область include_core2_vo2_Настройки_Общее_Интерфейс_События
#КонецОбласти

#Область include_core2_vo2_Настройки_Общее_Интерфейс_ОбработчикиСобытий
#КонецОбласти

