///////////////////////////////////////////////////
///////////////////сбисПараметры///////////////////
///////////////////////////////////////////////////

&НаКлиенте
Процедура		УстановитьсбисПараметры(Кэш, СтруктураНастроек)	Экспорт
	
	ГлавноеОкно = Кэш.ГлавноеОкно;
	
	Если СтруктураНастроек = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		//перенесено из главного окна, работа с сбисПараметрами
		//Если СтруктураНастроек.Свойство("КоличествоПотоковОтправки") Тогда
		//	Кэш.Вставить("КоличествоПотоковОтправки", Число(СтруктураНастроек.КоличествоПотоковОтправки));
		//КонецЕсли;
		//
		//Если СтруктураНастроек.Свойство("ИспользоватьГенератор") Тогда
		//	МодульОбъектаКлиент().ИзменитьПараметрСбис("ИспользоватьГенератор", СтруктураНастроек.ИспользоватьГенератор);
		//КонецЕсли;
		
		Если СтруктураНастроек.Свойство("ВремяОжиданияОтвета_Отправка") Тогда
			
			МодульОбъектаКлиент().ИзменитьПараметрСбис("ИспользоватьГенератор", СтруктураНастроек.ИспользоватьГенератор);
			Попытка
				ВремяОжиданияОтвета_Отправка = Число(СтруктураНастроек.ВремяОжиданияОтвета_Отправка);     
				МодульОбъектаКлиент().ИзменитьПараметрСбис("ВремяОжиданияОтвета_Отправка",	ВремяОжиданияОтвета_Отправка);
			Исключение
			КонецПопытки; 
			
		КонецЕсли;
		
		Если СтруктураНастроек.Свойство("Филиалы_Отправитель") Тогда
			
			МодульОбъектаКлиент().ИзменитьПараметрСбис("Филиалы_Отправитель", СтруктураНастроек.Филиалы_Отправитель = Истина);
			
		КонецЕсли;

		Если СтруктураНастроек.Свойство("Филиалы_Получатель") Тогда
			
			МодульОбъектаКлиент().ИзменитьПараметрСбис("Филиалы_Получатель", СтруктураНастроек.Филиалы_Получатель = Истина);
			
		КонецЕсли;
		
		Если СтруктураНастроек.Свойство("РеквизитСопоставленияНоменклатуры") Тогда
			
			МодульОбъектаКлиент().ИзменитьПараметрСбис("РеквизитСопоставленияНоменклатуры", СтруктураНастроек.РеквизитСопоставленияНоменклатуры);
			
		КонецЕсли;   
		
		Если СтруктураНастроек.Свойство("НеОтображатьНовостьПриЗапуске") Тогда
			МодульОбъектаКлиент().ИзменитьПараметрСбис("НеОтображатьНовостьПриЗапуске", СтруктураНастроек.НеОтображатьНовостьПриЗапуске);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Кэш.Парам.ПредВерсия)И Кэш.ОбщиеФункции.ЭтоНоваяВерсия("2.49", Кэш.Парам.ПредВерсия) Тогда    // Если предыдущая версия обработки меньше 2.49 читаем настройки статусов из параметров пользователя
			
			МеткиСтатусов = МеткиСтатусовПоУмолчанию();
			ЗаполнитьЗначенияСвойств(МеткиСтатусов, СтруктураНастроек);
			ЗаполнитьЗначенияСвойств(ГлавноеОкно, МеткиСтатусов);
			МодульОбъектаКлиент().СохранитьМеткиСтатусов(Кэш);
			Для Каждого МеткаСтатусовДефолт Из МеткиСтатусов Цикл
				Если СтруктураНастроек.Свойство(МеткаСтатусовДефолт.Ключ) Тогда
					СтруктураНастроек.Удалить(МеткаСтатусовДефолт.Ключ);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	Исключение
		
		ИнфОбОшибке = ИнформацияОбОшибке();
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнфОбОшибке, "ФайлыНастроекОбщее.УстановитьСбисПараметры");
		
	КонецПопытки;
	
КонецПроцедуры

// Процедура - Дополнить параметры сбис
// Дозаполняет структуру СбисПараметры недостающими элементами
// Параметры:
//  СтруктураНастроек	 - Структура	 -  Данные, которые нам нужно дополнить, сейчас может иметь только РеквизитСопоставленияНоменклатуры
//  Кэш					 - Структура	 -  Кэш настроек обработки
//
&НаКлиенте
Процедура ДополнитьПараметрыСбис(СтруктураНастроек, Кэш) Экспорт
	
	Если СтруктураНастроек = Неопределено Тогда
		СтруктураНастроек = Новый Структура;
	КонецЕсли; 
	
	Если НЕ СтруктураНастроек.Свойство("РеквизитСопоставленияНоменклатуры") Тогда
		
		СтруктураСопоставления = ПолучитьПараметрыСопоставленияНаСервере(СтруктураНастроек);
		
		Для	Каждого	КлючИЗначение Из СтруктураСопоставления	Цикл
			СтруктураНастроек.Вставить(КлючИЗначение.Ключ,КлючИЗначение.Значение);
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция		ОбработатьСтруктуруПараметров(СтруктураНастроек) Экспорт 
	
	Для Каждого Элемент Из СтруктураНастроек Цикл//Преобразование к дате
		СтрокаПроверки	= Элемент.Значение;
		Если			ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
			ОбработатьСтруктуруПараметров(Элемент.Значение);
		ИначеЕсли Не	ТипЗнч(Элемент.Значение) = Тип("Строка") Тогда
			Продолжить;
		ИначеЕсли	Сред(СтрокаПроверки,3,1)="."
				И	Сред(СтрокаПроверки,6,1)="."
				И	(	СтрДлина(СтрокаПроверки)=10
					Или	СтрДлина(СтрокаПроверки)=19)	Тогда
			Попытка
				СтруктураНастроек.Вставить(Элемент.Ключ, Дата(СтрокаПроверки));
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	Возврат СтруктураНастроек;
	
КонецФункции

&НаКлиенте
Процедура	сбисОчиститьКэшНастроек(Кэш, ПараметрыОчистки) Экспорт
	
	КлючиУдалить = "СписокЭлементовФильтра,ДобавленыЭлементы";
	Если ПараметрыОчистки.Свойство("КлючиУдалить") Тогда
		КлючиУдалить = КлючиУдалить + "," + ПараметрыОчистки.КлючиУдалить;
	КонецЕсли;
	КлючиУдалить = СтрЗаменить(КлючиУдалить, ",", Символы.ПС);
	Для шаг = 1 По СтрЧислоСтрок(КлючиУдалить) Цикл
		ПутьДоЗначения = СтрЗаменить(СтрПолучитьСтроку(КлючиУдалить, шаг), ".", Символы.ПС);
		ЗначениеОткудаУдалить = Кэш.КэшНастроек;
		Для шагУдалить = 1 По СтрЧислоСтрок(ПутьДоЗначения)-1 Цикл 
			лПуть = СтрПолучитьСтроку(ПутьДоЗначения, шагУдалить);
			ЗначениеОткудаУдалить = ЗначениеОткудаУдалить[лПуть];
		КонецЦикла;
		ЗначениеОткудаУдалить.Удалить(СтрПолучитьСтроку(ПутьДоЗначения, шагУдалить));
	КонецЦикла;
	
КонецПроцедуры

//Функция определяет необходимость проверки по СБИС параметрам
&НаКлиенте                                  
Функция		СбисОпределитьНеобходимостьПроверки(Кэш, СтруктураПараметров, сбисДополнительныеПараметры=Неопределено) Экспорт
	
	сбисРезультат			= Истина;
	сбисВерсияКонфигурации	= Неопределено;
	сбисВерсияОбработки		= Неопределено;
	СтруктураПараметров.Свойство("ВерсияКонфигурации",	сбисВерсияКонфигурации);
	СтруктураПараметров.Свойство("ВерсияОбработки",		сбисВерсияОбработки);
	
	Если	сбисВерсияКонфигурации	= Кэш.ПараметрыСистемы.Конфигурация.Версия
		И	сбисВерсияОбработки		= Кэш.ПараметрыСистемы.Обработка.Версия Тогда
		сбисРезультат = Ложь;
	КонецЕсли;
	//TODO39 убрать параметр через форму.
	Если Кэш.ФормаНастроек.ПараметрыРаботы.Свойство("ВыполнитьПроверку")Тогда
		сбисРезультат = ?(сбисРезультат, сбисРезультат, Кэш.ФормаНастроек.ПараметрыРаботы.ВыполнитьПроверку);
		Кэш.ФормаНастроек.ПараметрыРаботы.Удалить("ВыполнитьПроверку");
	КонецЕсли;
	Если	СтруктураПараметров.Свойство("ВыполнитьПроверку")
		И	СтруктураПараметров.ВыполнитьПроверку Тогда
		СтруктураПараметров.ВыполнитьПроверку = Ложь;
		сбисРезультат = Истина;
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ВерсияКонфигурации",	Кэш.ПараметрыСистемы.Конфигурация.Версия);
	СтруктураПараметров.Вставить("ВерсияОбработки",		Кэш.ПараметрыСистемы.Обработка.Версия);

	Возврат сбисРезультат;
	
КонецФункции

