
&НаКлиенте
Процедура яВыгрузить_ОтладочнуюИнформацию(ПараметрыВыгрузки)
	
	ПараметрыВызова = Новый Структура("Кэш, КаталогНаКлиенте, ВариантОбработки, КаталогНаСервере, Распаковать", Кэш, ПараметрыВыгрузки.ПутьВыгрузки, 0, Кэш.Парам.ИдентификаторНастроек, Истина);
	РезультатВызова = Кэш.ФормаНастроек.СбисПолучитьНастройкиДляТП(ПараметрыВызова);
	
	СведенияОВФК	= МодульОбъектаКлиент().ПараметрSABY("ВФК", "Сеанс");
	Если Не СведенияОВФК.Заплатки = Ложь Тогда
		
		СохранитьОбработкуЗаплаток(СведенияОВФК,, ПараметрыВыгрузки.ПутьВыгрузки);
		
	КонецЕсли;
	
	Если МодульОбъектаКлиент().ЭтоТипСбис(РезультатВызова, "СбисИсключение") Тогда
		
		ПараметрыВыгрузки.Ошибки.Добавить(РезультатВызова, ПараметрыВыгрузки.ПутьВыгрузки);
		
	КонецЕсли;
	
КонецПроцедуры

