
&НаКлиенте
Процедура ДобавитьВложение(Команда)
	// Процедура добавляет внешний файл в кэш
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие); 
	ДиалогОткрытияФайла.МножественныйВыбор = Истина;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
		Для Каждого ИмяФайла Из МассивФайлов Цикл
			Файл = Новый Файл(ИмяФайла);
			МестныйКэш.ДопВложение.Добавить(Новый Структура("ПолноеИмяФайла,ИмяФайла,Название,XMLДокумента",Файл.ПолноеИмя, Файл.Имя, Файл.Имя,""));
		КонецЦикла;
		ЗаполнитьТаблицу(МестныйКэш);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВложение(Команда)
	//Процедура удаляет вложение из пакета
	Если сбисЭлементФормы(ЭтаФорма,"ДополнительныеВложения").ТекущиеДанные<>Неопределено Тогда
		МестныйКэш.ДопВложение.Удалить(сбисЭлементФормы(ЭтаФорма,"ДополнительныеВложения").ТекущиеДанные.НомерВложенияВПакете);
		ЗаполнитьТаблицу(МестныйКэш);
	КонецЕсли;
КонецПроцедуры

