
&НаКлиенте
Процедура ЗаполнитьТаблицу(МестныйКэш) 
	ДополнительныеВложения.Очистить();
	сч = 0;
	Для Каждого Вложение Из МестныйКэш.ДопВложение Цикл
		НоваяСтр = ДополнительныеВложения.Добавить();
		НоваяСтр.НомерВложенияВПакете = сч;
		Если Вложение.Свойство("Название") Тогда
			НоваяСтр.Название = Вложение.Название;
		КонецЕсли;
		сч = сч+1;
	КонецЦикла;		
КонецПроцедуры

&НаКлиенте
Функция сбисЭлементФормы(Форма,ИмяЭлемента)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Форма.Элементы.Найти(ИмяЭлемента);
	КонецЕсли;
	Возврат Форма.ЭлементыФормы.Найти(ИмяЭлемента);
КонецФункции

