
&НаКлиенте
Процедура ОбработкаВыбораАккаунта(ИдАккаунта) 
	
	ПараметрыЗакрытияФормы = Новый Структура("ИдАккаунта, АккаунтИзменился",
								ТекущийАккаунт,
								Ложь);
	
	Если Не ТекущийАккаунт = ИдАккаунта Тогда
		
		Попытка
			
	        ОбработчикПереключенияОрганизации(ИдАккаунта);
			
		Исключение
			
			СбисИсключение = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "ФормаСменыАккаунта.ОбработкаВыбораАккаунта");
			МодульОбъектаКлиент().СообщитьСбисИсключение(СбисИсключение);
			Возврат; 
			
		КонецПопытки; 
		
		ПараметрыЗакрытияФормы.АккаунтИзменился = Истина;
		
	КонецЕсли;
	
	ПараметрыЗакрытияФормы.Вставить("ИдСессии", МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ИдентификаторСессии"));
	
	ФормаЗакрытьУстановитьСтатусОк(ПараметрыЗакрытияФормы, Истина);
	
КонецПроцедуры

// Обработка выбора организации   
&НаКлиенте
Процедура ОбработчикПереключенияОрганизации(ИдАккаунта)
	
	ОшибкаИзмененияАккаунта = Ложь;
	НовыйИдСессии			= МодульОбъектаКлиент().СбисПереключитьАккаунт(Кэш, Новый Структура("НомерАккаунта", ИдАккаунта), Новый Структура, ОшибкаИзмененияАккаунта);
	Если ОшибкаИзмененияАккаунта Тогда
		
		СбисИсключение = МодульОбъектаКлиент().НовыйСбисИсключение(НовыйИдСессии, НазваниеКратко() + ".ОбработчикПереключенияОрганизации");
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_ВСтроку(СбисИсключение);
	
	КонецЕсли;	
		
	МодульОбъектаКлиент().ИзменитьПараметрСбис("ИдАккаунта",			ИдАккаунта);
	МодульОбъектаКлиент().ИзменитьПараметрСбис("ИдентиФикаторСессии",	НовыйИдСессии);
	
КонецПроцедуры 	

