
 &НаКлиенте
Процедура ВыходНажатие(Элемент)
	НажатиеВыполнено = Ложь;
	Закрыть(""); 
	ЛокальныйКэш.ГлавноеОкно.СбисВыйти();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ПараметрЗакрытия, ТекстПредупреждения="", СтандартнаяОбработка=Истина)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		//Для толстого клиента второй параметр - признак выполнения стандартной обработки
		Если Не НажатиеВыполнено Тогда
			ПараметрЗакрытия = Ложь;
			ЭтаФорма.Закрыть("");
		КонецЕсли;
	#Иначе
		//Для тонкого клиента второй параметр - признак завершения работы программы
		Если ПараметрЗакрытия = Истина Тогда
			Возврат;
		ИначеЕсли Не НажатиеВыполнено Тогда
			СтандартнаяОбработка = Ложь;
			ЭтаФорма.Закрыть("");
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры 	

&НаКлиенте
Процедура СписокОрганизацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  Экспорт

	ОбработкаВыбораАккаунта(Элемент.ТекущиеДанные.ИдАккаунта, ЛокальныйКэш);

КонецПроцедуры  

