
#Область include_core2_vo2_Настройки_ФайлыНастроек_Общее_Интерфейс  
#КонецОбласти

#Область include_core2_vo2_Настройки_ФайлыНастроек_Общее_ВФК
#КонецОбласти

#Область include_core2_vo2_Настройки_ФайлыНастроек_Общее_СбисПараметры
#КонецОбласти

#Область include_core2_vo2_Настройки_ФайлыНастроек_Общее_ЗаполнитьПередРасчетом
#КонецОбласти

#Область include_core2_vo2_Настройки_ФайлыНастроек_Общее_УстановитьНастройки
#КонецОбласти

#Область include_core2_vo2_Настройки_ФайлыНастроек_Общее_ОбновитьДанныеИни
#КонецОбласти


///////////////////////////////////////////////////
///////////////////////Общее///////////////////////
///////////////////////////////////////////////////

&НаКлиенте
Функция МеткиСтатусовПоУмолчанию()																	Экспорт
	
	МеткиСтатусовПоУмолчанию = Новый Структура;
	МеткиСтатусовПоУмолчанию.Вставить("ДатаПоследнегоЗапросаСтатусов", "");
	МеткиСтатусовПоУмолчанию.Вставить("ИдентификаторПоследнегоСобытия", "");
	МеткиСтатусовПоУмолчанию.Вставить("ДатНачЧтенияСтатусов", "");
	МеткиСтатусовПоУмолчанию.Вставить("ДатКнцЧтенияСтатусов", "");

	Возврат МеткиСтатусовПоУмолчанию;
	
КонецФункции

&НаСервереБезКонтекста
Процедура	сбисСкопироватьСтруктуру(СтруктураКуда, знач СтруктураОткуда)							Экспорт
	
	// Копирует СтруктураОткуда в СтруктураКуда	
	Для Каждого Элемент Из СтруктураОткуда Цикл	
		Если ТипЗнч(Элемент.Значение) = Тип("Массив") Тогда
			СтруктураКуда.Вставить(Элемент.Ключ, Новый	Массив);
			сбисСкопироватьМассив(СтруктураКуда[Элемент.Ключ], Элемент.Значение);
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
			Если Не СтруктураКуда.Свойство(Элемент.Ключ) Тогда
				СтруктураКуда.Вставить(Элемент.Ключ, Новый Структура);
			КонецЕсли;
			сбисСкопироватьСтруктуру(СтруктураКуда[Элемент.Ключ], Элемент.Значение);				
		ИначеЕсли Не СтруктураКуда.Свойство(Элемент.Ключ) Тогда
			СтруктураКуда.Вставить(Элемент.Ключ,Элемент.Значение);
		Иначе
			СтруктураКуда[Элемент.Ключ] = Элемент.Значение;			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура	сбисСкопироватьМассив(МассивКуда, знач МассивОткуда)									Экспорт
	
	//Копирует массив откуда в массив куда.
	Для Каждого Элемент Из МассивОткуда Цикл	
		Если ТипЗнч(Элемент) = Тип("Массив") Тогда
			МассивДобавить	= Новый	Массив;
			сбисСкопироватьМассив(МассивДобавить, Элемент);
			МассивКуда.Добавить(МассивДобавить);
		ИначеЕсли ТипЗнч(Элемент) = Тип("Структура") Тогда
			СтруктураДобавить	= Новый	Структура();
			сбисСкопироватьСтруктуру(СтруктураДобавить, Элемент);
			МассивКуда.Добавить(СтруктураДобавить);
		Иначе
			МассивКуда.Добавить(Элемент);			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Функция определяет тип настройки по префиксу файла настроек	
&НаСервереБезКонтекста
Функция		ОпределитьТипНастроекПоПрефиксу(ПрефиксСервис, ПрефиксПолный)							Экспорт

	Префикс				= СтрЗаменить(ПрефиксПолный, ПрефиксСервис, "");
	СбисКонфигурация	= "";
	
	Если		ВРег(Лев(Префикс,3))	= "БУХ" Тогда
		СбисКонфигурация	= "Бухгалтерия предприятия";
		Версия	= Сред(Префикс, 4);
		Если		Сред(Префикс, 4, 1)	= "1"	Тогда
			СбисКонфигурация	= СбисКонфигурация	+ ", редакция 1.6"
		Иначе
			СбисКонфигурация	= СбисКонфигурация	+ ", редакция " + Сред(Префикс, 4, 1) +".0";
		КонецЕсли;   
	ИначеЕсли ВРег(Лев(Префикс,4)) = "УТК3" Тогда
		СбисКонфигурация	= "Управление торговлей для Казахстана, редакция 3";
	ИначеЕсли	ВРег(Лев(Префикс,2))	= "УТ" Тогда	
		СбисКонфигурация	= "Управление торговлей";
		Версия	= Сред(Префикс, 3);
		Если	Сред(Префикс, 3, 2)	= "11"	Тогда
			СбисКонфигурация	= СбисКонфигурация	+ ", редакция 11";
			Если		Сред(Префикс, 5, 1)	= "2"	Тогда
				СбисКонфигурация	= СбисКонфигурация	+ ".2 (не обновляется)";
			ИначеЕсли	Сред(Префикс, 5, 2)	= "-2"	Тогда
				СбисКонфигурация	= СбисКонфигурация	+ ".2";
				Префикс	= Сред(Префикс, Найти(Префикс, "-")+1);
			КонецЕсли;
		Иначе
			СбисКонфигурация	= СбисКонфигурация	+ ", редакция 10.3";
		КонецЕсли;
	ИначеЕсли	ВРег(Лев(Префикс,3))	= "УПП" Тогда	
		СбисКонфигурация = "Управление производственным предприятием, редакция 1.3";
		Версия	= Сред(Префикс, 4);
	ИначеЕсли	ВРег(Лев(Префикс,2))	= "КА" Тогда	
		СбисКонфигурация = "Комплексная автоматизация";
		Версия	= Сред(Префикс, 3);
		Если	Сред(Префикс, 3, 1)	= "2"	Тогда
			СбисКонфигурация	= СбисКонфигурация	+ ", редакция 2.0";
		Иначе
			СбисКонфигурация	= СбисКонфигурация	+ ", редакция 1.1";
		КонецЕсли;
	ИначеЕсли ВРег(Лев(Префикс,3)) = "КЗП" Тогда
		СбисКонфигурация = СтрЗаменить("КАМИН:Зарплата. Версия {0}.0", "{0}", Сред(Префикс,4,1));	
	ИначеЕсли	ВРег(Лев(Префикс,3))	= "БГУ" Тогда	
		СбисКонфигурация = "Бухгалтерия государственного учреждения";
		Версия	= Сред(Префикс, 4);
		Если	Сред(Префикс, 4, 1)	= "2"	Тогда
			СбисКонфигурация	= СбисКонфигурация	+ ", редакция 2.0"
		Иначе
			СбисКонфигурация	= СбисКонфигурация	+ ", редакция 1.0"
		КонецЕсли;
	ИначеЕсли	ВРег(Лев(Префикс,4)) = "БСХП" Тогда 
		СбисКонфигурация = "Бухгалтерия сельскохозяйственного предприятия, редакция " + Сред(Префикс, 5, 1) + ".0";
		Версия	= Сред(Префикс, 5);
	ИначеЕсли	ВРег(Лев(Префикс,3)) = "УНФ" Тогда 
		СбисКонфигурация = "Управление небольшой фирмой, редакция " + СтрЗаменить(Сред(Префикс, 4, 3), "-", ".");
		Версия	= Сред(Префикс, 4);
		Если	Сред(Префикс, 4, 2)	= "15"	Тогда
			СбисКонфигурация	= СбисКонфигурация	+ " (не обновляется)";
		Иначе
			Префикс	= Сред(Префикс, Найти(Префикс, "-")+1);
		КонецЕсли;
	ИначеЕсли ВРег(Лев(Префикс,4)) = "РОЗН" Тогда 
		СбисКонфигурация = "Розница";
		Версия = Сред(Префикс, 5);
		Если Лев(Версия, 1)	= "1"	Тогда
			СбисКонфигурация	= СбисКонфигурация	+ ", редакция 1.0"
		Иначе
			СбисКонфигурация	= СбисКонфигурация	+ ", редакция " + СтрЗаменить(Лев(Версия, 3),"-",".");
		КонецЕсли;
	ИначеЕсли	ВРег(Лев(Префикс,3)) = "ЗУП" Тогда 
		СбисКонфигурация = "Зарплата и Управление Персоналом, редакция 2.5";
		Версия	= Сред(Префикс, 4);		
	ИначеЕсли	Не	ПустаяСтрока(ПрефиксСервис)
			И	ПрефиксСервис	= ПрефиксПолный	Тогда
		СбисКонфигурация = "Пользовательская конфигурация";
		Версия	= Сред(Префикс, Найти(Префикс, "-")+1);
	ИначеЕсли	ВРег(Лев(Префикс,3)) = "ERP" Тогда 
		СбисКонфигурация = "ERP управление предприятием, редакция 2";
		Версия	= Сред(Префикс, 4);	
	ИначеЕсли ВРег(Лев(Префикс, 4))  = "ШТП5" Тогда //d.ch 15.08.2019
		СбисКонфигурация = "Штрих-М: Торговое предприятие 5"; 
		Версия = Сред(Префикс, 4);
	ИначеЕсли ВРег(Лев(Префикс, 4)) = "ШТП7" Тогда //d.ch 13.01.2020
		СбисКонфигурация = "Штрих-М: Торговое предприятие 7";
		Версия = Сред(Префикс, 4);
	ИначеЕсли ВРег(Лев(Префикс, 2)) = "АА" Тогда //bav 11.09.2019
		СбисКонфигурация = "Альфа-Авто";
		НомерРедакции = Сред(Префикс, 3, 1);
		ПодверсияРедакции = "." + Сред(Префикс, 5, 1);
		СбисКонфигурация = СбисКонфигурация + ", редакция " + НомерРедакции + ПодверсияРедакции;
		Версия = Сред(Префикс, 3);         
	ИначеЕсли ВРег(Лев(Префикс,5)) = "ЗИКГУ" Тогда
		СбисКонфигурация = "Зарплата и кадры государственного учреждения";
		Версия = Сред(Префикс, 6);
	ИначеЕсли ВРег(Лев(Префикс,3)) = "УХ3" Тогда // alo 16.09.2019
		СбисКонфигурация = "Управление холдингом, редакция 3.0";
		Версия = Сред(Префикс, 3);
	ИначеЕсли ВРег(Лев(Префикс,3)) = "ДУМ" Тогда //rav 04.07.2020
		СбисКонфигурация = "ДАЛИОН: Управление магазином";
		Версия = Сред(Префикс, 4);
		Если Лев(Версия, 1)	= "2"	Тогда
			СбисКонфигурация	= СбисКонфигурация	+ ", редакция 2.0"
		Иначе
			СбисКонфигурация	= СбисКонфигурация	+ ", редакция 1.2"
		КонецЕсли;
	ИначеЕсли	ВРег(Лев(Префикс,6)) = "АУНБУХ" Тогда	
		СбисКонфигурация = "Аренда и управление недвижимостью для ""1С:Бухгалтерия 8""";
		Версия	= Сред(Префикс, 7);
	ИначеЕсли	ВРег(Лев(Префикс,4))	= "ПСУФ" Тогда
		СбисКонфигурация	= "Подрядчик строительства. Управление финансами, редакция " + Сред(Префикс, 5, 1) +".0";
		Версия	= Сред(Префикс, 5); 
	ИначеЕсли	ВРег(Лев(Префикс,4))	= "ТКПТ" Тогда	
		СбисКонфигурация = "1С-Рарус: ТКПТ v8";
	Иначе 
		СбисКонфигурация = "";
		Версия	= "";
	КонецЕсли;	
	
	Если	Булево(Найти(Версия, "-")) Тогда
		СбисКонфигурация	= СбисКонфигурация	+ ", версия "	+ СтрЗаменить(Версия,"-",".")+" и выше";
	КонецЕсли;
	
	Возврат	СбисКонфигурация;
	
КонецФункции	

// Получает список доступных настроек для текущей конфигурации
//
// Параметры:
//  СписокТиповНастроек	 - 	 - 
//  ПрефиксСервис		 - 	 - 
//  ДопПараметры		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаСервереБезКонтекста
Функция		ПолучитьМассивФайловДляКонфигурации(знач СписокТиповНастроек, ПрефиксСервис, ДопПараметры=Неопределено)	Экспорт
		
	Если Не ЗначениеЗаполнено(СписокТиповНастроек) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	ПрефиксТекущейКонфигурации	= ?(ДопПараметры.Свойство("ПрефиксТекущейКонфигурации"), ДопПараметры.ПрефиксТекущейКонфигурации, "");
	ВерсияТекущейКонфигурации	= ?(ДопПараметры.Свойство("ВерсияТекущейКонфигурации"), ДопПараметры.ВерсияТекущейКонфигурации, "");
	ЗначениеПредставление		= ?(ДопПараметры.Свойство("ЗначениеПредставление"), ДопПараметры.ЗначениеПредставление, "Значение");
	
	Если ПустаяСтрока(ПрефиксТекущейКонфигурации) Тогда
		ПрефиксТекущейКонфигурации = ОпределитьТипПодсистемы(Метаданные, Ложь);
	КонецЕсли;
	
	СписокТиповНастроекДляКонфигурации = Новый СписокЗначений;
	ПрефиксДляПоиска = ПрефиксСервис + ПрефиксТекущейКонфигурации;
	ДлинаПрефикса = СтрДлина(ПрефиксДляПоиска);
	Для Каждого Элемент Из СписокТиповНастроек Цикл
		Если Лев(Элемент.Представление,ДлинаПрефикса) = ПрефиксДляПоиска Тогда
			//Передаем представление версии конфигураций с клиента. В случае, если нет, пробуем определить
			СбисПредставлениеДляСортировки = Неопределено;
			Если Не Элемент.Значение.Свойство("ПредставлениеВерсии", СбисПредставлениеДляСортировки) Тогда
				СбисПредставлениеДляСортировки = Сред(Элемент.Представление,ДлинаПрефикса+1);
			КонецЕсли;
			СписокТиповНастроекДляКонфигурации.Добавить(Элемент.Представление, СбисЗаполнитьПрефиксНулями(СбисПредставлениеДляСортировки));
		КонецЕсли;
	КонецЦикла;
	
	Если ПустаяСтрока(ВерсияТекущейКонфигурации) Тогда
		ВерсияТекущейКонфигурации = СтрЗаменить(ОпределитьВерсиюСистемы(Метаданные.Версия),".","-"); 
	КонецЕсли;
	СписокТиповНастроекДляКонфигурации.Добавить("Текущая конфигурация", СбисЗаполнитьПрефиксНулями(ВерсияТекущейКонфигурации)+"-");
	СписокТиповНастроекДляКонфигурации.СортироватьПоПредставлению();
	ИндексТекущий = СписокТиповНастроекДляКонфигурации.Индекс(СписокТиповНастроекДляКонфигурации.НайтиПоЗначению("Текущая конфигурация"));
	Если ИндексТекущий>0 Тогда
		ПодходящаяВерсия = СписокТиповНастроекДляКонфигурации[ИндексТекущий-1].Значение;	
		Для Каждого Элемент Из СписокТиповНастроек Цикл
			Если Элемент.Представление = ПодходящаяВерсия Тогда
				Возврат Элемент[ЗначениеПредставление];
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ПрефиксСервис = "Com1C82" Тогда
		//Префикс - "Com1C82" и настроек нет. А значит что это пользовательская конфа. У неё должен быть пустой subsystem
		шаг = СписокТиповНастроек.Количество();
		Пока шаг <> 0 Цикл
			шаг = шаг - 1;
			Если СписокТиповНастроек[шаг].Значение.ПараметрыКонфигурации.subsystem = "" Тогда
				Возврат СписокТиповНастроек[шаг][ЗначениеПредставление];
			КонецЕсли;
		КонецЦикла;
		Возврат	СписокТиповНастроек[0][ЗначениеПредставление];
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
Функция		ПолучитьПрефиксФайловНовойВерсииНастроек(знач СписокТиповНастроек, ПрефиксСервис = "ВО82", ДопПараметры=Неопределено)	Экспорт
	// Работает так же, как и предыдущая функция, но возвращает только префикс актуальных настроек	
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	ПрефиксТекущейКонфигурации	= ?(ДопПараметры.Свойство("ПрефиксТекущейКонфигурации"), ДопПараметры.ПрефиксТекущейКонфигурации, "");
	ВерсияТекущейКонфигурации	= ?(ДопПараметры.Свойство("ВерсияТекущейКонфигурации"), ДопПараметры.ВерсияТекущейКонфигурации, "");
	ЗначениеПредставление		= ?(ДопПараметры.Свойство("ЗначениеПредставление"), ДопПараметры.ЗначениеПредставление, "Значение");
	
	Если Не ЗначениеЗаполнено(СписокТиповНастроек) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ПустаяСтрока(ПрефиксТекущейКонфигурации) Тогда
		ПредставлениеПодсистемы = ОпределитьТипПодсистемы(Метаданные, Ложь);
		ПрефиксТекущейКонфигурации = ПрефиксСервис + ПредставлениеПодсистемы;
	КонецЕсли;
	
	СписокТиповНастроекДляКонфигурации = Новый СписокЗначений;
	ДлинаПрефикса = СтрДлина(ПрефиксТекущейКонфигурации);
	Для Каждого Элемент Из СписокТиповНастроек Цикл
		Если Лев(Элемент.Представление,ДлинаПрефикса) = ПрефиксТекущейКонфигурации Тогда
			//Передаем представление версии конфигураций с клиента. В случае, если нет, пробуем определить
			СбисПредставлениеДляСортировки = Неопределено;
			Если Не Элемент.Значение.Свойство("ПредставлениеВерсии", СбисПредставлениеДляСортировки) Тогда
				СбисПредставлениеДляСортировки = Сред(Элемент.Представление,ДлинаПрефикса+1);
			КонецЕсли;
			СписокТиповНастроекДляКонфигурации.Добавить(Элемент.Представление, СбисЗаполнитьПрефиксНулями(СбисПредставлениеДляСортировки));
		КонецЕсли;
	КонецЦикла;
	
	Если ПустаяСтрока(ВерсияТекущейКонфигурации) Тогда
		ВерсияТекущейКонфигурации = СтрЗаменить(ОпределитьВерсиюСистемы(Метаданные.Версия),".","-"); 
	КонецЕсли;
	СписокТиповНастроекДляКонфигурации.Добавить("Текущая конфигурация", СбисЗаполнитьПрефиксНулями(ВерсияТекущейКонфигурации)+"-");
	СписокТиповНастроекДляКонфигурации.СортироватьПоПредставлению();
	ИндексТекущий = СписокТиповНастроекДляКонфигурации.Индекс(СписокТиповНастроекДляКонфигурации.НайтиПоЗначению("Текущая конфигурация"));
	Если ИндексТекущий>0 Тогда
		ПодходящаяВерсия = СписокТиповНастроекДляКонфигурации[ИндексТекущий-1].Значение;
		Возврат ПодходящаяВерсия;	
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
Функция		СбисЗаполнитьПрефиксНулями(Префикс, Разделитель="-")														Экспорт
	ФорматныйПрефикс = "";
	ВерсииКонф = РазбитьСтрокуВМассив(Префикс,Разделитель);
	Для Каждого Элемент Из ВерсииКонф Цикл
		ФорматныйПрефикс = ФорматныйПрефикс + сбисЗаполнитьСлева(Элемент, "0", 4)+"-";	
	КонецЦикла;
	ФорматныйПрефикс = Лев(ФорматныйПрефикс, СтрДлина(ФорматныйПрефикс)-1);
	Возврат ФорматныйПрефикс;
КонецФункции

&НаСервереБезКонтекста
функция		РазбитьСтрокуВМассив(знач Строка, Разделитель)											Экспорт
	// Функция разбивает строку по определенному разделителю и формирует массив из получившихся элементов	
	МассивЭлементов = Новый Массив();
	ЕстьРазделитель = Истина;
	Пока ЕстьРазделитель И Строка<>"" И Разделитель<>"" Цикл
		Если Найти(Строка,Разделитель)=0 Тогда
			Прервать;
		КонецЕсли;
		Элемент = Сред(Строка,1,Найти(Строка,Разделитель)-1);
		МассивЭлементов.Добавить(Элемент);
		Строка = Сред(Строка,Найти(Строка,Разделитель)+1);
	КонецЦикла;
	МассивЭлементов.Добавить(Строка);
	Возврат МассивЭлементов;
КонецФункции

&НаСервереБезКонтекста
функция		сбисЗаполнитьСлева(ИсходнаяСтрока, Заполнитель, Длина)									Экспорт
	// Функция заполняет строку слева указанным заполнителем до указанной длины	
	Результат = ИсходнаяСтрока;
	КолЗаполнителей = Длина-СтрДлина(ИсходнаяСтрока);
	Если КолЗаполнителей>0 Тогда
		Для сч = 1 По КолЗаполнителей Цикл
			Результат = строка(Заполнитель)+строка(Результат);	
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервере
Функция		ТабДоступныеИниФайлыОбновить(СбисКонфигурация, ФормаТабУстФайлы)						Экспорт
	// Функция возвращает массив доступных файлов настроек для выбранной конфигурации	
	МассивДоступныхИниФайлов = Новый Массив();
	
	Если СбисКонфигурация = Неопределено Тогда
		Возврат МассивДоступныхИниФайлов;	
	КонецЕсли;
	
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		ТабУстФайлы = ФормаТабУстФайлы.Выгрузить(, "ИмяФайла");
	Иначе
		ТабУстФайлы = ФормаТабУстФайлы;
	КонецЕсли;	
	СтруктураФайлов = СбисКонфигурация;
	
	Для Каждого Элемент Из СтруктураФайлов Цикл
		
		НайденнаяСтрока			= ТабУстФайлы.Найти(Элемент.Имя, "ИмяФайла"); 
		РазделительРасширения	= Найти(Элемент.Имя,".");
		Если	РазделительРасширения	= 0	Тогда
			ИмяФайлаБезРасширения	= Элемент.ИмяБезРасширения;
		Иначе
			ИмяФайлаБезРасширения	= Лев(Элемент.Имя,РазделительРасширения-1);
		КонецЕсли;
		НоваяСтрока = Новый Структура();
		НоваяСтрока.Вставить("Имяфайла",				Элемент.Имя);
		НоваяСтрока.Вставить("ИмяФайлаБезРасширения",	ИмяФайлаБезРасширения);
		НоваяСтрока.Вставить("ПолноеИмя",				Элемент.ПолноеИмя);
		Если НайденнаяСтрока<>Неопределено Тогда
			НоваяСтрока.Вставить("ЕстьФайлНастроек", Истина);
		Иначе
			НоваяСтрока.Вставить("ЕстьФайлНастроек", Ложь);
		КонецЕсли;	
		МассивДоступныхИниФайлов.Добавить(НоваяСтрока);	
		
	КонецЦикла;	
	
	Возврат МассивДоступныхИниФайлов;	
	
КонецФункции

&НаСервере
Функция		СформироватьМассивТабДоступныеИниФайлыОбновить(СбисКонфигурация, знач УстановленныеИни)	Экспорт
	// Функция возвращает массив доступных файлов настроек для выбранной конфигурации	
	
	Если СбисКонфигурация = Неопределено Тогда
		Возврат Новый Массив();
	КонецЕсли;
		
	МассивДоступныхИниФайлов = Новый Массив();
	
	Если	ТипЗнч(УстановленныеИни)= Тип("ДанныеФормыКоллекция")
		И	ТипЗнч(ЭтаФорма)		= Тип("УправляемаяФорма") Тогда
		ТабУстФайлы = УстановленныеИни.Выгрузить(, "ИмяФайла");
	Иначе
		ТабУстФайлы = сбисПростыеДанныеВТаблицу(УстановленныеИни);
	КонецЕсли;
	Если	ТабУстФайлы.Количество()	Тогда
		ИскатьСтроку	= Истина;
	Иначе
		ИскатьСтроку	= Ложь;
	КонецЕсли;
	СтруктураФайлов	= СбисКонфигурация;
	Для Каждого Элемент Из СтруктураФайлов Цикл			
		НоваяСтрока = Новый Структура();
		
		Если	ИскатьСтроку	Тогда
			НайденнаяСтрока = ТабУстФайлы.Найти(Элемент.Имя, "ИмяФайла");
			Если НайденнаяСтрока<>Неопределено Тогда
				НоваяСтрока.Вставить("ЕстьФайлНастроек", Истина);
			Иначе
				НоваяСтрока.Вставить("ЕстьФайлНастроек", Ложь);
			КонецЕсли;
		Иначе
			НоваяСтрока.Вставить("ЕстьФайлНастроек", Ложь);
		КонецЕсли;
			
		РазделительРасширения	= Найти(Элемент.Имя,".");
		Если Элемент.Свойство("ИмяФайлаБезРасширения") Тогда
			 ИмяФайлаБезРасширения	= Элемент.ИмяФайлаБезРасширения;
		ИначеЕсли	РазделительРасширения	= 0	Тогда
			ИмяФайлаБезРасширения	= Элемент.ИмяБезРасширения;
		Иначе
			ИмяФайлаБезРасширения	= Лев(Элемент.Имя,РазделительРасширения-1);
		КонецЕсли;
		НоваяСтрока.Вставить("Имяфайла",				Элемент.Имя);
		НоваяСтрока.Вставить("ИмяФайлаБезРасширения",	ИмяФайлаБезРасширения);
		НоваяСтрока.Вставить("ПолноеИмя",				Элемент.ПолноеИмя);
		МассивДоступныхИниФайлов.Добавить(НоваяСтрока);	
		
	КонецЦикла;	
	
	Возврат МассивДоступныхИниФайлов;	
	
КонецФункции

&НаКлиенте
Функция		НайтиВыбраннуюКонфигурациюНастроек(СтруктураКонфигураций, ЗначениеКонфигурации)			Экспорт
	
	//Пока так криво ищем выбранную конфу
	НашаКонфигурация = Неопределено;
	Для Каждого СтрокаСтруктур из СтруктураКонфигураций Цикл
		Если СтрокаСтруктур.Значение.НазываниеКонфигурации = ЗначениеКонфигурации Тогда
			НашаКонфигурация = СтрокаСтруктур.Значение;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат	НашаКонфигурация;
	
КонецФункции

// Функция - возвращает структуру стандартных настроек по переданным параметрам конфигурации.
//
// Параметры:
//  ПараметрыКонфигурацииВходящие	 - Структура	 - 
// 
// Возвращаемое значение:
//
&НаКлиенте
Функция		НайтиСтандартнуюКонфигурациюНастроек(ПараметрыКонфигурацииВходящие=Неопределено)		Экспорт
	
	Перем СписокДоступныхКонфигураций;
	
	Кэш = Кэш;
	Если Не Кэш.Свойство("Конфигурация", СписокДоступныхКонфигураций) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыКонфигурацииПоиск = ПараметрыКонфигурацииВходящие;
	Если ПараметрыКонфигурацииПоиск = Неопределено Тогда
		ПараметрыКонфигурацииПоиск = Кэш.КэшНастроек.ПараметрыКонфигурации;
	КонецЕсли;
	СписокТиповНастроекДляКонфигурации = Новый СписокЗначений;
	
	ПрефиксДляПоиска = ПараметрыКонфигурацииПоиск.subsystem;
	
	Для Каждого Элемент Из СписокДоступныхКонфигураций Цикл
		Если Не	Элемент.Значение.ПараметрыКонфигурации.subsystem = ПрефиксДляПоиска Тогда
			Продолжить;
		КонецЕсли;
		СписокТиповНастроекДляКонфигурации.Добавить(Элемент.Значение.ПараметрыКонфигурации, СбисЗаполнитьПрефиксНулями(Элемент.Значение.ПараметрыКонфигурации.version, "."));
	КонецЦикла;
	
	ВерсияВСписок = ПараметрыКонфигурацииВходящие.version;
	Если Не ЗначениеЗаполнено(ПараметрыКонфигурацииВходящие.subsystem) Тогда
		
		ВерсияВСписок = "0.0.0.1";
		
	КонецЕсли;
	
	СписокТиповНастроекДляКонфигурации.Добавить("Текущая конфигурация", СбисЗаполнитьПрефиксНулями(ВерсияВСписок, ".") + "-");
	СписокТиповНастроекДляКонфигурации.СортироватьПоПредставлению();
	ИндексТекущий = СписокТиповНастроекДляКонфигурации.Индекс(СписокТиповНастроекДляКонфигурации.НайтиПоЗначению("Текущая конфигурация"));
	Если ЗначениеЗаполнено(ИндексТекущий) Тогда
		Возврат СписокТиповНастроекДляКонфигурации[ИндексТекущий - 1].Значение;	
	КонецЕсли;
	Возврат Неопределено;
 
КонецФункции

&НаСервереБезКонтекста
Функция		сбисПростыеДанныеВТаблицу(ИсходныеДанные, ПередатьНаКлиент=Ложь)
	
	ДанныеВозврата = Новый ТаблицаЗначений();
	Если ТипЗнч(ИсходныеДанные) = Тип("Массив") Тогда
		Если	ИсходныеДанные.Количество()
			И	ТипЗнч(ИсходныеДанные[0]) = Тип("Структура") Тогда
			Для	Каждого	ЭлементМассива Из ИсходныеДанные Цикл
				НоваяСтрока	= ДанныеВозврата.Добавить();
				Для	Каждого КлючИЗначение Из ЭлементМассива Цикл
					Если ДанныеВозврата.Колонки.Найти(КлючИЗначение.Ключ) = Неопределено Тогда
						МассивТипов	= Новый	Массив;
						МассивТипов.Добавить(ТипЗнч(КлючИЗначение.Значение));
						ДанныеВозврата.Колонки.Добавить(КлючИЗначение.Ключ, Новый ОписаниеТипов(МассивТипов));
					КонецЕсли;
					НоваяСтрока[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	Иначе
		ДанныеВозврата = ИсходныеДанные;	
	КонецЕсли;
		
	Если ПередатьНаКлиент Тогда
		ДанныеВозврата = ЗначениеВСтрокуВнутр(ДанныеВозврата);
	КонецЕсли;
	
	Возврат ДанныеВозврата;
	
КонецФункции

&НаКлиенте
Функция		СформироватьСтруктуруКонфигураций(Кэш, СписокТиповНастроек)								Экспорт//Вынесено в общее, для возмности формирования списка конфигураций при получении настроек с сервера и установки конфигурации, которая указана как базовая
	
	СтруктураКонфигураций	= Новый Структура();
	СписокВыбора			= Новый	Массив();
	Для каждого СтрокаНастроек из СписокТиповНастроек Цикл
		НазываниеКонфигурации	= ОпределитьТипНастроекПоПрефиксу(Кэш.КэшНастроек.ПараметрыНастроек.ПрефиксСервис, СтрокаНастроек.Представление);
		СписокВыбора.Добавить(НазываниеКонфигурации);
		
		СтруктураОднойКонфигурации	= Новый Структура();
		СтруктураОднойКонфигурации.Вставить("НазываниеКонфигурации",	НазываниеКонфигурации);
		СтруктураОднойКонфигурации.Вставить("СтруктураКонфигурации",	СтрокаНастроек.Значение.МассивИни);
		СтруктураОднойКонфигурации.Вставить("ПараметрыКонфигурации",	СтрокаНастроек.Значение.ПараметрыКонфигурации);
		
		СтруктураКонфигураций.Вставить("Конфигурация" + Число(СписокТиповНастроек.Индекс(СтрокаНастроек) + 1),	СтруктураОднойКонфигурации);
	КонецЦикла;
	Результат	= Новый	Структура("СписокВыбора, СтруктураКонфигураций", СписокВыбора, СтруктураКонфигураций);
		
	Возврат	Результат
	
КонецФункции	
	
&НаКлиенте
Процедура	ОчиститьСобранныеНастройки(Кэш)															Экспорт 
	
	//Определяет данные в кэше, которые надо удалить при перезапуске, для повторного сбора
	КлючиКэшУдалить	= Новый	Структура("XSLT, Конфигурация");
	//Определяет данные в кэше, которые надо установить в значения по-умолчанию при перезапуске
	КлючиКэшОчистить= Новый Структура("ини", Новый Структура);
	
	Для	Каждого	КлючИЗначение	Из	КлючиКэшУдалить		Цикл
		Если Кэш.Свойство(КлючИЗначение.Ключ) Тогда
			Кэш.Удалить(КлючИЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	Для	Каждого	КлючИЗначение	Из	КлючиКэшОчистить	Цикл
		Кэш.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	Если	Кэш.Свойство("КэшНастроек")
		И	Кэш.КэшНастроек.Свойство("ВыбранныеНастройки") Тогда
		Кэш.КэшНастроек.Удалить("ВыбранныеНастройки");
	КонецЕсли;

	ДопПараметрыИзменить = Новый Структура("Кэш, Глобально", Кэш, Ложь);
	МодульОбъектаКлиент().ИзменитьПараметрСбис("ИниВПорядке", Ложь, ДопПараметрыИзменить);
	
КонецПроцедуры	

//Копирует и возвращает структуру файла(ов) настроек без системных и рассчитанных значений узлов
//Функция является дублем аналогичной функции из формы настроек каталога с добавлением проверки на флаг формата и рассчитанного значения
&НаКлиенте
Функция		ОчиститьСтруктуруИниОтСлужебныхЗначений(СлужебнаяСтруктура)		Экспорт
	НаборСлужебныхКлючей = Новый Массив;
	НаборСлужебныхКлючей.Добавить("ошибка");
	НаборСлужебныхКлючей.Добавить("формат2016");
	НаборСлужебныхКлючей.Добавить("формат2019");
	НаборСлужебныхКлючей.Добавить("форматукд2020");
	НаборСлужебныхКлючей.Добавить("входящийконтекст");
	НаборСлужебныхКлючей.Добавить("настройки");
	НаборСлужебныхКлючей.Добавить("использоватьштрихкодыноменклатурыконтрагентов");
	НаборСлужебныхКлючей.Добавить("рассчитанноезначение");
	НаборСлужебныхКлючей.Добавить("сбисавтообновление");
	НаборСлужебныхКлючей.Добавить("сбисестьизменения");
	НаборСлужебныхКлючей.Добавить("сбисестьтиповая");
	НаборСлужебныхКлючей.Добавить("сбисимяфайла");
	НаборСлужебныхКлючей.Добавить("сбисошибки");
	НаборСлужебныхКлючей.Добавить("сбисполноеимяфайла");
	НаборСлужебныхКлючей.Добавить("сбиспараметрыузла");
	НаборСлужебныхКлючей.Добавить("сбисстандартная");
	НаборСлужебныхКлючей.Добавить("сбиспользовательская");
	//1190111968
	НаборСлужебныхКлючей.Добавить("типини");

	Возврат ОчиститьСтруктуруИниОтСлужебныхЗначенийНаКлиенте(СлужебнаяСтруктура, НаборСлужебныхКлючей)
КонецФункции

&НаКлиенте
Функция		ОчиститьСтруктуруИниОтСлужебныхЗначенийНаКлиенте(СлужебнаяСтруктура, НаборСлужебныхКлючей)
	//Копирует и возвращает структуру файла(ов) настроек без системных и рассчитанных значений узлов
	//Функция является дублем аналогичной функции из формы настроек каталога с добавлением проверки на флаг формата и рассчитанного значения
	//1190111968	
	СбисИмяФайла = Неопределено;  
	МассивЧистыхИни = Новый Массив;
	МассивЧистыхИни.Добавить("конфигурация"); 
	
	НоваяСлужебнаяСтруктура	= Новый	Структура();
	Для Каждого Узел Из СлужебнаяСтруктура Цикл
		СбисКлюч = НРег(Узел.Ключ);  
		Если Не НаборСлужебныхКлючей.Найти(НРег(Узел.Ключ)) = Неопределено
			//1190111968
			И НЕ (СлужебнаяСтруктура.Свойство("СбисИмяФайла",СбисИмяФайла)
			И НЕ МассивЧистыхИни.Найти(НРег(СбисИмяФайла)) = Неопределено
			И СбисКлюч = "типини") Тогда	
			Продолжить; 		
		ИначеЕсли ТипЗнч(Узел.Значение) = Тип("Структура") Тогда
			НоваяСлужебнаяСтруктура.Вставить(Узел.Ключ, ОчиститьСтруктуруИниОтСлужебныхЗначений(Узел.Значение));
		Иначе
			НоваяСлужебнаяСтруктура.Вставить(Узел.Ключ, Узел.Значение);
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат НоваяСлужебнаяСтруктура;
	
КонецФункции

//Структура с параметрами для работы extSDK. Параметры получаются для переданных параметров конфы.
//Вынесено в общее для сбора всех данных на сервере
&НаСервереБезКонтекста
Функция		ОпределитьПараметрыКонфигурации(ПараметрыСистемы, Отказ)								Экспорт
	
	Если Отказ Тогда
		Возврат	Ложь;
	КонецЕсли;
	РазделительВерсии = ".";
	ВерсияСырая = ПараметрыСистемы.Конфигурация.Версия;
	Результат = Новый Структура("subsystem,version");
	Результат.Вставить("subsystem", ПолучитьПрефиксСистемыПоНазванию(ПараметрыСистемы.Конфигурация.КраткаяИнформация, ВерсияСырая, Отказ));
	Если ПустаяСтрока(Результат.subsystem) Тогда
		// Если не получили версию по описанию, попробуем по имени
		Результат.Вставить("subsystem", ПолучитьПрефиксСистемыПоНазванию(ПараметрыСистемы.Конфигурация.Имя, ВерсияСырая, Отказ));
	КонецЕсли;
	
	Если Найти(Результат.subsystem, "-") Тогда
		ВерсияСырая = Результат.subsystem;
		РазделительВерсии = "-";
		Результат.Вставить("subsystem", СтрПолучитьСтроку(СтрЗаменить(Результат.subsystem, "-", Символы.ПС),1));
	КонецЕсли;
	//Если это пользовательская конфа, то версию ставим от пользовательской.
	Если ПустаяСтрока(Результат.subsystem) Тогда
		Результат.Вставить("version",	"0.0.0.1");
	Иначе
		Результат.Вставить("version",	ОпределитьВерсиюСистемы(ВерсияСырая,Новый Структура("Разделитель", РазделительВерсии)));
	КонецЕсли;

	Возврат	Результат;	
	
КонецФункции

//Возвращает параметры системы, устанавливаемой по-умолчаению
&НаКлиентеНаСервереБезКонтекста
Функция		СистемаПо_Умолчанию()
	
	Возврат Новый Структура("subsystem,version","БУХ3","3.0.139.19");
	
КонецФункции

//Возвращает параметры системы, устанавливаемой по-умолчаению
&НаКлиенте
Функция		СистемаПо_УмолчаниюКлиент()																Экспорт
	
	Возврат СистемаПо_Умолчанию();
	
КонецФункции

//Формирует префикс системы, вида "service" + "subsystem" + остаток "version"
&НаКлиентеНаСервереБезКонтекста
Функция		СформироватьПрефиксСистемы(ПараметрыКонфигурации)
		
	ВерсияКПрефиксу	= "";
	
	Если Не ПустаяСтрока(ПараметрыКонфигурации.subsystem) Тогда
		МногоуровневыйПрефикс	= СтрЗаменить(ПараметрыКонфигурации.subsystem,	"-", Символы.ПС);
		МногоуровневаяВерсия	= ?(ПараметрыКонфигурации.Свойство("version"), СтрЗаменить(ПараметрыКонфигурации.version,	".", Символы.ПС), "");
		Для	шаг = 1		По СтрЧислоСтрок(МногоуровневыйПрефикс)	Цикл
			СтрокаВерсии = СтрПолучитьСтроку(МногоуровневаяВерсия, шаг);
			Если	СтрокаВерсии = Прав(СтрПолучитьСтроку(МногоуровневыйПрефикс,шаг), СтрДлина(СтрокаВерсии))	Тогда
				ВерсияКПрефиксу	= "-";
			Иначе
				Прервать;	
			КонецЕсли;
		КонецЦикла;
		Для	шаг = шаг	По СтрЧислоСтрок(МногоуровневаяВерсия)	Цикл
			ВерсияКПрефиксу	= ВерсияКПрефиксу	+ СтрПолучитьСтроку(МногоуровневаяВерсия, шаг) + "-";
		КонецЦикла;
	КонецЕсли;
	Префикс = Неопределено;
	Если Не ПараметрыКонфигурации.Свойство("service", Префикс) Тогда
		Префикс = "";
	КонецЕсли;
	Префикс = Префикс + ПараметрыКонфигурации.subsystem + Лев(ВерсияКПрефиксу, СтрДлина(ВерсияКПрефиксу)-1);
	Возврат	Префикс;

КонецФункции

//Формирует префикс системы, вида "service" + "subsystem" + остаток "version"
&НаКлиенте
Функция		СформироватьПрефиксСистемыКлиент(ПараметрыКонфигурации) 										Экспорт
		
	Возврат	СформироватьПрефиксСистемы(ПараметрыКонфигурации);

КонецФункции

//Функция отсеивает не числовые символы, приводит версию к стандарту 1С
&НаСервереБезКонтекста
Функция		ОпределитьВерсиюСистемы(ВерсияПоиск, ДополнительныеПараметры=Неопределено)
	//Убираем не числовые символы из версии системы, сохраняя разрядность
	ДопустимыеСимволы	= "0123456789";
	РазделительПоиск	= Неопределено;
	РазделительОсновной	= ".";
	РазделителиАльт		= ";/- _*,\:№";//Возможные разделители в версии, которые прописаны не по формату 1С. 
	ЧислоРазрядов		= 4;
	Заполнитель			= "0";
	ВерсияСистемы		= "";
	Если		ДополнительныеПараметры = Неопределено
		Или Не	ДополнительныеПараметры.Свойство("Разделитель", РазделительПоиск) Тогда
		РазделительПоиск = РазделительОсновной;
	КонецЕсли;
	
	МногоуровневаяВерсия = СтрЗаменить(ВерсияПоиск, РазделительПоиск, Символы.ПС);
	
	Для	шагстрок = 1 По ЧислоРазрядов Цикл
		СтрокаРазряда	= СтрПолучитьСтроку(МногоуровневаяВерсия, шагстрок);
		шаг				= 1;
		Пока шаг	<= СтрДлина(СтрокаРазряда)	Цикл
			ТестСимвол	= Сред(СтрокаРазряда, шаг, 1);
			Если		Булево(Найти(ДопустимыеСимволы,ТестСимвол)) Тогда//Если допустимый символ, то ничего не делаем
				шаг	= шаг + 1;
				Продолжить;
			ИначеЕсли	Булево(Найти(РазделителиАльт,ТестСимвол)) Тогда//Если это возможный разделитель, то как разряд берём все, чтоб было до него
				СтрокаРазряда = Лев(СтрокаРазряда, шаг - 1);
				Прервать;
			КонецЕсли;
			СтрокаРазряда	= Лев(СтрокаРазряда, шаг - 1)	+ Сред(СтрокаРазряда, шаг + 1);
		КонецЦикла;
		ВерсияСистемы	= ВерсияСистемы	+ ?(ПустаяСтрока(ВерсияСистемы), "", РазделительОсновной)	+ ?(ПустаяСтрока(СтрокаРазряда), Заполнитель, СтрокаРазряда);
	КонецЦикла;
	
	Возврат	ВерсияСистемы;
	
КонецФункции

//Префикс конфы по названию. Изменено для совместимости и универсализации поиска по полному и сокращенному наименованию метаданных.
&НаСервереБезКонтекста
Функция		ОпределитьТипПодсистемы(ПараметрыСистемыПараметр = Неопределено, Отказ = Ложь) Экспорт
	Если ПараметрыСистемыПараметр = Неопределено Тогда
		ПараметрыСистемы = Метаданные;
	Иначе
		ПараметрыСистемы = ПараметрыСистемыПараметр;
	КонецЕсли;
	
	ПредставлениеПодсистемы = ПолучитьПрефиксСистемыПоНазванию(ПараметрыСистемы.Имя, ПараметрыСистемы.Версия, Ложь);
	Если ПустаяСтрока(ПредставлениеПодсистемы) И Не ПустаяСтрока(ПараметрыСистемы.КраткаяИнформация) Тогда
		ПредставлениеПодсистемы = ПолучитьПрефиксСистемыПоНазванию(ПараметрыСистемы.КраткаяИнформация, ПараметрыСистемы.Версия, Ложь);
	КонецЕсли;
	Если ПустаяСтрока(ПредставлениеПодсистемы) И Не ПустаяСтрока(ПараметрыСистемы.ПодробнаяИнформация) Тогда
		ПредставлениеПодсистемы = ПолучитьПрефиксСистемыПоНазванию(ПараметрыСистемы.ПодробнаяИнформация, ПараметрыСистемы.Версия, Ложь);
	КонецЕсли;
	Если ПустаяСтрока(ПредставлениеПодсистемы) Тогда//Система по-умолчанию - БУХ3 последней версии.
		ПараметрыСистемыПо_Умолчанию = СистемаПо_Умолчанию();
		ПредставлениеПодсистемы = СформироватьПрефиксСистемы(ПараметрыСистемыПо_Умолчанию);
	КонецЕсли;
	Возврат ПредставлениеПодсистемы;
КонецФункции

//Функция по параметрам ини определяет её тип и направление обрабатываемого документа
&НаКлиенте                                  
Функция		ОпределитьПараметрыИни(Кэш, ЗначениеИни, КлючИни) Экспорт
	Перем НаправлениеИни;
	
	СбисОбщиеФункции = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции");
	ТипИни			 = СбисОбщиеФункции.РассчитатьЗначение("ТипИни", ЗначениеИни);
	ИмяИни			 = КлючИни;
	ТипВложения		 = КлючИни;
	НаправлениеИни	 = "";
	ФорматТипа		 = "";
	
	Если Не ТипИни = "Система" Тогда
		
		ЗначениеКлюча = СтрЗаменить(ИмяИни, "_", Символы.ПС);
		Если СтрЧислоСтрок(ЗначениеКлюча) = 5 Тогда
			
			//Всё описано в имени ини.
			ТипИни			= СтрПолучитьСтроку(ЗначениеКлюча, 1);
			НаправлениеИни	= СтрПолучитьСтроку(ЗначениеКлюча, 2);
			ИмяИни			= Сред(ИмяИни, СтрДлина(ТипИни + НаправлениеИни) + 3);
			
		ИначеЕсли Не	ЗначениеИни = Неопределено
				И		ЗначениеИни.Свойство("мДокумент") Тогда
				
			ТипИни			= "Загрузка";
			НаправлениеИни	= "Входящий";
			
		Иначе
			
			ТипИни			= "Выгрузка";
			НаправлениеИни	= "Исходящий";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипИни = "Загрузка" Тогда
		
		ИмяИниРазбить	 = СтрЗаменить(ИмяИни, "_", Символы.ПС);
		ТипВложения		 = СтрПолучитьСтроку(ИмяИниРазбить, 1);
		ФорматТипа		 = СтрЗаменить(Сред(ИмяИни, СтрДлина(ТипВложения) + 2), "_", ".");
		
	КонецЕсли;

	Результат = Новый Структура("Тип, Направление, Название, Формат, ТипВложенияSABY", ТипИни, НаправлениеИни, ИмяИни, ФорматТипа, ТипВложения);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция		ОтсеятьЧисла(Строка) Экспорт
	
	СимволыФильтра = "0123456789";
	Результат = Строка;
	шаг = 1;
	Пока шаг <= СтрДлина(Результат)	Цикл
		ТекСимвол = Сред(Результат, шаг, 1);
		Если Не	ПустаяСтрока(ТекСимвол)
			И	Булево(Найти(СимволыФильтра,ТекСимвол)) Тогда
			Результат = Лев(Результат, шаг-1) + Сред(Результат, шаг+1);
			Продолжить;
		КонецЕсли;
		шаг = шаг+1;
	КонецЦикла;
	Возврат	Результат;
	
КонецФункции

//Префикс конфы по названию. Изменено для совместимости и универсализации поиска по полному и сокращенному наименованию метаданных.
&НаСервереБезКонтекста
Функция		ПолучитьПрефиксСистемыПоНазванию(Название, Версия, Отказ)
	
	ТипПодсистемы			= "";
	НомерРедакции			= "";
	МногострочноеНазвание	= СтрЗаменить(Название, " ", Символы.ПС);
	Для Счетчик = 1 По СтрЧислоСтрок(МногострочноеНазвание) Цикл
		ТекСтрока = СтрПолучитьСтроку(МногострочноеНазвание, Счетчик);
		Если	ТекСтрока	= "редакция"  или ТекСтрока    = "ред."	Тогда
			НомерРедакции	= СтрПолучитьСтроку(МногострочноеНазвание, Счетчик	+ 1);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	НомерРедакции	= СтрЗаменить(НомерРедакции, ".", "");
	НазваниеАнализ	= НРег(Название);	
	Если		Лев(НазваниеАнализ, 11) = "бухгалтерия" Тогда
		Если		Найти(НазваниеАнализ, "государственного") Тогда
			ТипПодсистемы	= "БГУ"	+ ?(Лев(НомерРедакции,1)="1", "", Лев(НомерРедакции,1));
		ИначеЕсли		Найти(НазваниеАнализ, "сельскохозяйственного") Тогда
			ТипПодсистемы	= "БСХП"	+ ?(Лев(НомерРедакции,1)="1", "", Лев(НомерРедакции,1));	
		ИначеЕсли   Найти(НазваниеАнализ, "предприятия") Тогда
			ТипПодсистемы	= "БУХ";
			Если Не Лев(НомерРедакции,1) = "1" Тогда
				ТипПодсистемы = ТипПодсистемы + Лев(НомерРедакции,1);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Найти(НазваниеАнализ, "бухгалтерия сельскохозяйственного") Тогда //  НазваниеАнализ = 1с:предприятие 8. бухгалтерия сельскохозяйственного предприятия, редакция 3.0
		ТипПодсистемы	= "БСХП"+ Лев(НомерРедакции,1);
	ИначеЕсли Найти(НазваниеАнализ, "холдингом") Тогда // alo 16.09.2019
		ТипПодсистемы = "УХ" + Лев(НомерРедакции,1);
	ИначеЕсли	Найти(НазваниеАнализ, "управление") Тогда
		Если		Найти(НазваниеАнализ, "производственным") Тогда
			ТипПодсистемы	= "УПП";
		ИначеЕсли   Найти(НазваниеАнализ, "торговлей") Тогда
			Если Найти(НазваниеАнализ, "казахстан") Тогда
				ТипПодсистемы	= "УТК"	+ Лев(Версия,1); 	
			Иначе
				ТипПодсистемы	= "УТ"	+ Лев(НомерРедакции,2);  
			КонецЕсли; 
		ИначеЕсли	(	Найти(НазваниеАнализ, "небольшой")
					Или	Найти(НазваниеАнализ, "нашей"))
				И	Найти(НазваниеАнализ, "фирмой")	Тогда
			ТипПодсистемы	= "УНФ";//	+ Лев(НомерРедакции,2);
		ИначеЕсли	Найти(НазваниеАнализ, "предприятием")
				И	Найти(НазваниеАнализ, "erp")
				И	Лев(Версия,1) = "2" Тогда
			ТипПодсистемы	= "ERP";
		ИначеЕсли	Найти(НазваниеАнализ, "далион")
				И	Найти(НазваниеАнализ, "магазином") Тогда
			ТипПодсистемы = "ДУМ" + Лев(НомерРедакции,1);
		ИначеЕсли	Найти(НазваниеАнализ, "недвижимостью")
				И	Найти(НазваниеАнализ, "аренда") Тогда
			ТипПодсистемы = "АУНБУХ"+ Лев(НомерРедакции,1);
		ИначеЕсли	Найти(НазваниеАнализ, "подрядчик строительства") Тогда
			ТипПодсистемы = "ПСУФ"+ Лев(НомерРедакции,1);
		КонецЕсли;
	ИначеЕсли	Найти(НазваниеАнализ, "комплексная") Тогда
		НомерРедакции = Лев(Версия, 3);
		ТипПодсистемы	= "КА"	+ ?(Лев(НомерРедакции,1)="1", "", Лев(НомерРедакции,1));
	ИначеЕсли	Найти(НазваниеАнализ, "зарплата")
			И	Найти(НазваниеАнализ, "управление") Тогда
		ТипПодсистемы	= "ЗУП";
	ИначеЕсли	Найти(НазваниеАнализ, "розница") Тогда
		ТипПодсистемы	= "РОЗН"	+ Лев(НомерРедакции,1);
	ИначеЕсли Найти(НазваниеАнализ, "общепит1с") Тогда
		ТипПодсистемы = "БУХ" + Лев(НомерРедакции,1);
	ИначеЕсли Найти(НазваниеАнализ,"штрих-м: ") Тогда
		ТипПодсистемы = "ШТП" + Лев(НомерРедакции,1);
	ИначеЕсли Найти(НазваниеАнализ, "автосалон") Тогда //bav 11.09.2019
		ТипПодсистемы = "АА" + Лев(НомерРедакции,1);    
	ИначеЕсли Найти(НазваниеАнализ, "торговыйкомплекс")
		И Лев(Версия,2) = "08" Тогда 
		ТипПодсистемы = "ТКПТ";  
	Иначе
		ТипПодсистемы = "";
	КонецЕсли;
	
	//Если	ПустаяСтрока(ТипПодсистемы)	Тогда
	//	Сообщить("Не удалось определить префикс настроек для текущей конфигурации!",	СтатусСообщения.Важное);
	//	Отказ	= Истина;
	//КонецЕсли;
	
	Возврат	ТипПодсистемы;
	
КонецФункции

// Функция - Получить типы поля с описанием типов
//
// Параметры:
//  ИмяОбъекта	 - Строка - Имя объекта метаданных, как оно есть в ини
//  ДопПараметры	 - Структура - Расширение
// 
// Возвращаемое значение:
//   - Структура:	- ТипыМассивСтрок - Массив типов в строковом представлении
//					- ОписаниеТипа - описание типа (одинарного или составного)
//
&НаКлиенте
Функция	ПолучитьТипыПоляСОписаниемТипов(ИмяОбъекта, ДопПараметры = Неопределено)

	СтруктураТиповПоля = Новый Структура("ТипыМассивСтрок, ОписаниеТипа", Новый Массив, Новый ОписаниеТипов);
	
	Попытка
		
		ТипыМассивСтрок = МодульОбъектаКлиент().СбисРазложитьСтрокуВМассивПодстрок(ИмяОбъекта, ",");
		Для i = 0 По ТипыМассивСтрок.ВГраница() Цикл
			// Приводим к одному виду
			ТипыМассивСтрок.Установить(i, МодульОбъектаКлиент().СсылочныйТипСтрокой(ТипыМассивСтрок[i]));
		КонецЦикла;		
		
		ОписаниеТипа = МодульОбъектаКлиент().СоздатьОписаниеТипаПоОбъекту(ИмяОбъекта);
		СтруктураТиповПоля.ТипыМассивСтрок	= ТипыМассивСтрок;
		СтруктураТиповПоля.ОписаниеТипа		= ОписаниеТипа;
		                                                                        		                                                                     
	Исключение
		
		Если	ЗначениеЗаполнено(ДопПараметры)
			 И	ДопПараметры.Свойство("СообщениеПриОшибке") Тогда
			 
			Сообщение = ДопПараметры.СообщениеПриОшибке;
		Иначе
			Сообщение = Неопределено;
		КонецЕсли;

		ОшибкаФильтра = МодульОбъектаКлиент().НовыйСбисИсключение(
							ИнформацияОбОшибке(), 
							"ФайлыНастроекОбщее.ПолучитьТипыПоляСОписаниемТипов",
							,Сообщение);
		МодульОбъектаКлиент().СообщитьСбисИсключение(ОшибкаФильтра, Новый Структура("СтатусСообщения", "message"));
		
	КонецПопытки;
	
	Возврат СтруктураТиповПоля;
	
КонецФункции

&НаКлиенте
Функция ИмяРегистраСвойствОбъектов(ИниКонфигурация) Экспорт

	Если ИниКонфигурация.Свойство("ИмяРегистраСвойствОбъектов") Тогда
		
		Возврат СтрЗаменить(ИниКонфигурация.ИмяРегистраСвойствОбъектов.Значение,"'","");
		
	Иначе
		
		Возврат ОпределитьРегистрДопСведенийПоМетаданным();
		
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОпределитьРегистрДопСведенийПоМетаданным()
	
	Если Метаданные.РегистрыСведений.Найти("ДополнительныеСведения") = Неопределено Тогда
		Возврат "ЗначенияСвойствОбъектов";
	Иначе
		Возврат "ДополнительныеСведения";
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОпределитьИмяРеквизитаЕдиницИзмеренияНаСервере(ТипСправочникаНоменклатуры)
	
	ПустаяСсылкаНоменклатуры = Новый(ТипСправочникаНоменклатуры);
	
	МетаданныеНоменклатуры = ПустаяСсылкаНоменклатуры.Метаданные();
	
	Если МетаданныеНоменклатуры.Реквизиты.Найти("БазоваяЕдиницаИзмерения") = Неопределено Тогда
		Возврат "ЕдиницаИзмерения";
	Иначе
		Возврат "БазоваяЕдиницаИзмерения";
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокДокументовДляСчетаНаОплату(ИниКонфигурации, Кэш)
	
	СписокДокументовДляСчетаНаОплату = Кэш.ОбщиеФункции.РассчитатьЗначение("ДокументДляСчетаНаОплату", ИниКонфигурации);
	Если Не ЗначениеЗаполнено(СписокДокументовДляСчетаНаОплату) Тогда
		СписокДокументовДляСчетаНаОплату = Новый Массив;
	Иначе
		СписокДокументовДляСчетаНаОплату = МодульОбъектаКлиент().СбисРазложитьСтрокуВМассивПодстрок(СписокДокументовДляСчетаНаОплату, ",");
	КонецЕсли;
	
	Возврат СписокДокументовДляСчетаНаОплату;
	
КонецФункции

&НаКлиенте
Функция	РазделЗаполнить(Кэш, НазваниеРаздела, ДанныеРаздела, СтрРаздела)
	
	Реестр1С_Названия			= Новый СписокЗначений;
	сбисМенюРаздела				= Новый Структура;
	сбисПодразделы				= Новый Массив;
	МассивНазванийКнопок		= Новый Массив;
	Кэш.Разделы[НазваниеРаздела]= Новый Структура;
	Кэш.МенюРазделов.Вставить(НазваниеРаздела, сбисМенюРаздела);
		
	// Структура в массив
	Подразделы = Новый Массив;
	Для Каждого сбисТипДокумента Из ДанныеРаздела.Список Цикл
	
		// На СО Каталог нет подключений и справочник не работает
		Если СбисТипДокумента.Ключ = "КонтрагентыСБИС"
			И Кэш.Парам.СпособОбмена = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		Подразделы.Добавить(сбисТипДокумента);
		
	КонецЦикла;
	
	// Сортировка подразделов в разделах Продажа и Покупка в алфавитном порядке
	Для Индекс1 = 0 По Подразделы.ВГраница() Цикл
		
		МинИндекс = Индекс1;
		Для Индекс2 = Индекс1 + 1 По  Подразделы.ВГраница() Цикл
			
			Если Подразделы[МинИндекс].Значение.Реестр1С_Название > Подразделы[Индекс2].Значение.Реестр1С_Название Тогда
				МинИндекс = Индекс2;
			КонецЕсли;
			
		КонецЦикла;
		
		Если МинИндекс <> Индекс1 Тогда
			ВремЗнач = Подразделы[МинИндекс];
			Подразделы[МинИндекс] = Подразделы[Индекс1];
			Подразделы[Индекс1] = ВремЗнач;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого сбисТипДокумента Из Подразделы Цикл
		Если	Не(	сбисТипДокумента.Значение.ЕстьЗапросРеестра
				Или сбисТипДокумента.Значение.ЕстьСправочникТип) Тогда
			Продолжить;
		КонецЕсли;
		Если сбисТипДокумента.Значение.РеестрПоУмолчанию Тогда
			сбисПодразделы.Вставить(0,сбисТипДокумента.Ключ);	
		Иначе
			сбисПодразделы.Добавить(сбисТипДокумента.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	сбисИмяКнопки		= "Аккордеон" + НазваниеРаздела + "Док%сч%" + ДанныеРаздела.Параметры.Номер + ДанныеРаздела.Параметры.Номер;
	сбисСчетчикРазделов	= -1;
	
	ЭлементМеню = Кэш.ГлавноеОкно.СгенерироватьЭлементМеню("Аккордеон" + НазваниеРаздела + ДанныеРаздела.Параметры.Номер + ДанныеРаздела.Параметры.Номер, НазваниеРаздела);
	Родитель = ЭлементМеню.Родитель;
	ИдРаздела = "Аккордеон" + НазваниеРаздела + ДанныеРаздела.Параметры.Номер + ДанныеРаздела.Параметры.Номер;
	Если Не СтрРаздела.Свойство(ИдРаздела) Тогда
		СтрРаздела.Вставить(ИдРаздела, ЭлементМеню.СтруктураЭлемента);
	КонецЕсли;
	
	Для Каждого сбисПодраздел Из сбисПодразделы Цикл
		сбисТипДокумента	= ДанныеРаздела.Список[сбисПодраздел];
		сбисТекстКнопки		= сбисТипДокумента.Реестр1С_Название;
		сбисИмяМеню			= сбисТипДокумента.Реестр1С_Меню;
		сбисМетодАктивации	= сбисТипДокумента.Реестр1С_МетодНаАктивацию;
		сбисЗаголовокМеню	= Неопределено;//Совместимость со старыми коннекшенами, где нет заголовка меню
		Если Не сбисТипДокумента.Свойство("Реестр1С_МенюЗаголовок", сбисЗаголовокМеню) Тогда
			сбисЗаголовокМеню = сбисТекстКнопки;
		КонецЕсли;
		сбисМетодАктивации	= сбисТипДокумента.Реестр1С_МетодНаАктивацию;
		Если		Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение
			И	Не	МассивНазванийКнопок.Найти(сбисТекстКнопки) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		сбисСчетчикРазделов	= сбисСчетчикРазделов + 1;
		лИмяКнопки = СтрЗаменить(сбисИмяКнопки, "%сч%", сбисСчетчикРазделов);
		МассивНазванийКнопок.Добавить(сбисТекстКнопки);
		Реестр1С_Названия.Добавить(сбисТекстКнопки, сбисТекстКнопки);
		
		Кэш.Разделы[НазваниеРаздела].Вставить(лИмяКнопки, сбисПодраздел);
		
		СтрРаздела.Вставить(лИмяКнопки, Кэш.ГлавноеОкно.СгенерироватьКнопку(лИмяКнопки, сбисТекстКнопки, Родитель));
		
		сбисМенюРаздела.Вставить(лИмяКнопки, Новый Массив());
		//Иначе
		//	Продолжить;
		//	//лИмяКнопки = СтрЗаменить(сбисИмяКнопки, "%сч%", 0);
		//КонецЕсли;
		сбисМенюРаздела[лИмяКнопки].Добавить(Новый Структура("ИмяКнопки, ЗаголовокКнопки, МетодАктивации, ИмяИни", сбисИмяМеню, сбисЗаголовокМеню, сбисМетодАктивации, сбисПодраздел));
	КонецЦикла;
	
	Возврат СтрРаздела;
		
КонецФункции

//Процедура выполняет переключение способа хрнения настроек из каталога в СБИС
&НаКлиенте
Функция 	ПереключитьСпособХраненияНастроекВСбис(Аргумент, ДопПараметры) Экспорт
	Кэш = ДопПараметры.Кэш;
	Отказ = Ложь;
	Если Кэш.Парам.СпособХраненияНастроек = 1 Тогда
		//Облачные настройки уже активны
		Возврат "Не требуется";
	ИначеЕсли Не МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ДоступныСерверныеНастройки") Тогда
		Кэш.ОбщиеФункции.СбисВызватьИсключение(, "ФайлыНастроекОбщее.ПереключитьСпособХраненияНастроекВСбис", 735,,"Облачные настройки недоступны для настроенного способа обмена.");
	КонецЕсли;
	УидТекущейСистемы		= Кэш.ПараметрыСистемы.Конфигурация.УИДИнтеграции;
	СбисПараметрыКаталога	= Кэш.ФормаНастроек.ПолучитьПараметрыСБИС(Кэш, Кэш.Парам.ИдентификаторНастроек);
	СбисПараметрыПодключения= Новый Структура;
	Для Каждого СбисПараметрПодключения Из СбисПараметрыКаталога Цикл
		Если Лев(СбисПараметрПодключения.Ключ, 2) = "ВО" Тогда
			Продолжить;
		КонецЕсли;
		СбисПараметрыПодключения.Вставить(СбисПараметрПодключения.Ключ, СбисПараметрПодключения.Значение);
	КонецЦикла;
	//Создаём временный кэш с настройкой на облако
	ВременныйКэш = Кэш.ОбщиеФункции.СкопироватьОбъектСПараметрамиКлиент(Кэш,,Ложь);
	ВременныйКэш.Парам					= Кэш.ОбщиеФункции.СкопироватьОбъектСПараметрамиКлиент(Кэш.Парам,,Ложь);
	ВременныйКэш.ТихийРежим				= Истина;
	ВременныйКэш.Ини					= Новый Структура;
	ВременныйКэш.КэшНастроек			= Новый Структура;
	ВременныйКэш.ТекущийСеанс.Функции	= Новый Структура;
	ВременныйКэш.КэшЗначенийИни			= Новый Структура("ИниЗагрузки", Новый Структура);
	
	ВременныйКэш.Парам.Вставить("СпособХраненияНастроек",	1);
	ВременныйКэш.Парам.Вставить("ИдентификаторНастроек",	"");
	
	ПродолжитьВыполнение	= Истина;
	ВременныйКэш.ГлавноеОкно.ОпределитьФормуРаботыСНастройками(ВременныйКэш, ВременныйКэш.Парам.СпособОбмена, ВременныйКэш.Парам.СпособХраненияНастроек);
	ПараметрыПредустановки = Новый Структура("УИДИнтеграции, АвтоматическаяУстановка, СбисПараметры", УидТекущейСистемы, Истина, СбисПараметрыПодключения);
	
	РезультатПредустановки = ВременныйКэш.ФормаНастроек.СбисПрименитьПредустановленныеНастройки(ВременныйКэш, Отказ, ПродолжитьВыполнение, ПараметрыПредустановки);
	Если Отказ Тогда
		Кэш.ОбщиеФункции.СбисВызватьИсключение(РезультатПредустановки, "ФайлыНастроекОбщее.ПереключитьСпособХраненияНастроекВСбис");
	ИначеЕсли Не РезультатПредустановки = Неопределено Тогда
		//Предустановлен коннекшен.
		ВременныйКэш.ФормаНастроек.СохранитьПараметрыСБИС(ВременныйКэш, СбисПараметрыКаталога, РезультатПредустановки);
		ВременныйКэш.ТихийРежим = Кэш.ТихийРежим;
		ВременныйКэш.ГлавноеОкно.СпособХраненияНастроек = ВременныйКэш.Парам.СпособХраненияНастроек;
		ЗаполнитьЗначенияСвойств(Кэш, ВременныйКэш, "ФормаНастроек, Парам, КэшНастроек, Ини");
		Возврат "Применены Предустановленные настройки";
	КонецЕсли;
	СписокНастроек = Кэш.ФормаНастроек.СобратьСпискиНастроекНаСервере(Кэш.ОбщиеФункции.КэшДляСервера(Кэш), Кэш.Парам.ИдентификаторНастроек, Отказ);
	Если Отказ Тогда
		Кэш.ОбщиеФункции.СбисВызватьИсключение(РезультатПредустановки, "ФайлыНастроекОбщее.ПереключитьСпособХраненияНастроекВСбис");
	КонецЕсли;
	Если	СписокНастроек.XSLT.Количество()
		Или	СписокНастроек.EPF.Количество() Тогда 
		//Есть пользовательские xslt и внешние функции
		Кэш.ОбщиеФункции.СбисВызватьИсключение(, "ФайлыНастроекОбщее.ПереключитьСпособХраненияНастроекВСбис", 735,,"Имеются пользовательские изменения, которые невозможно перенести в облако.");
	КонецЕсли;
	Кэш.ФормаНастроек.СбисЗаполнитьНеполученныеНастройки(Кэш, Отказ);
	ВременныйКэш.Ини = Кэш.Ини;
	ВременныйКэш.Парам.ИдентификаторНастроек = "";
	//Создаем шаблон из текущих настроек	
	НовыйШаблонКоннекшена = ВременныйКэш.ФормаНастроек.СформироватьСтруктуруТекущихНастроек(ВременныйКэш, Новый Структура("ТипНастроек, СбисПараметры", "Шаблон", СбисПараметрыПодключения), Отказ);
	Если Отказ Тогда
		Кэш.ОбщиеФункции.СбисВызватьИсключение(НовыйШаблонКоннекшена, "ФайлыНастроекОбщее.ПереключитьСпособХраненияНастроекВСбис");
	КонецЕсли;
	НовыйШаблонКоннекшена.Идентификатор = УидТекущейСистемы;
	ВременныйКэш.КэшНастроек.Вставить("ВыбранныеНастройки", НовыйШаблонКоннекшена);
	НовыйШаблонКоннекшена.Данные.Параметры = Новый Структура("comment", "Создано обработкой при переводе настроек в Saby");
	НовыйШаблонКоннекшена.ПараметрыРаботы.СбисМеню.Обновить = Истина;
	НовыйШаблонКоннекшена.ПараметрыРаботы.Статус = "Новый";
	Для Каждого КлючИЗначениеИни Из НовыйШаблонКоннекшена.Данные.Ини Цикл
		НовыйШаблонКоннекшена.ПараметрыРаботы.СбисИни.СписокОтправить.Добавить(КлючИЗначениеИни.Ключ);
	КонецЦикла;
	//Сохраним шаблон
	ПараметрыЗаписи = Новый Структура("Отказ, ПродолжитьВыполнение", Отказ, Истина);
	НовыйШаблонКоннекшена.Название = Кэш.Парам.ИдентификаторНастроек;
	РезультатВыполнения = ВременныйКэш.ФормаНастроек.КлассIntegrationConnection_Установить(ВременныйКэш, НовыйШаблонКоннекшена, Новый Структура, Отказ);
	Если Отказ Тогда
		Кэш.ОбщиеФункции.СбисВызватьИсключение(РезультатВыполнения, "ФайлыНастроекОбщее.ПереключитьСпособХраненияНастроекВСбис");
	КонецЕсли;
	РезультатВыполнения = ВременныйКэш.ФормаНастроек.КлассIntegrationConnection_СохранитьПодключение(ВременныйКэш, НовыйШаблонКоннекшена, Новый Структура("ТихийРежим", ВременныйКэш.ТихийРежим), Отказ);
	Если Отказ Тогда
		Кэш.ОбщиеФункции.СбисВызватьИсключение(РезультатВыполнения, "ФайлыНастроекОбщее.ПереключитьСпособХраненияНастроекВСбис");
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Кэш.Парам, ВременныйКэш.Парам, "СпособХраненияНастроек,ИдентификаторНастроек,ИдентификаторыНастроекВСБИС");
	ВременныйКэш.ТихийРежим = Кэш.ТихийРежим;
	ВременныйКэш.ГлавноеОкно.СпособХраненияНастроек = ВременныйКэш.Парам.СпособХраненияНастроек;
	ЗаполнитьЗначенияСвойств(Кэш, ВременныйКэш);
	Если РезультатВыполнения.ЗаписьВыполнялась Тогда
		Возврат "Создан новый шаблон и подключение";
	КонецЕсли;
	Возврат "Настройки переключены, шаблон не записывался";
КонецФункции

&НаКлиенте
Функция ОписаниеТиповОснованийСвязанныхДокументов(ИниКонфигурации)   
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();	
	ТипыСвязанныхДокументов = Кэш.ОбщиеФункции.РассчитатьЗначение("ТипыСвязанныхДокументов", ИниКонфигурации);   
	СписокТиповСвязанныхДокументов = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ТипыСвязанныхДокументов) Тогда 
		
		Возврат СписокТиповСвязанныхДокументов;
		
	КонецЕсли;
		
	ТипыСвязанныхДокументов = МодульОбъектаКлиент().СбисРазложитьСтрокуВМассивПодстрок(ТипыСвязанныхДокументов, ",");  
	
	Для Каждого СвязанныйДокумент Из ТипыСвязанныхДокументов Цикл  
		
		Попытка
		
			СписокТиповСвязанныхДокументов.Добавить(Тип(СвязанныйДокумент));
			
		Исключение  
			
			ОшибкаУстановкиТипа = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), 
									"ФайлыНастроекОбщее.ОписаниеТиповОснованийСвязанныхДокументов");
			МодульОбъектаКлиент().СообщитьСбисИсключение(ОшибкаУстановкиТипа, Новый Структура("СтатусСообщения", "message"));
			
		КонецПопытки;
		
	КонецЦикла;			
	
	Возврат СписокТиповСвязанныхДокументов;
	
КонецФункции

///////////////////////////////////////////////////
///////////////////Протокол ошибок/////////////////
///////////////////////////////////////////////////

&НаСервере
Функция		ВывестиПротоколПроверкиИниФайлов(Знач Ини, Знач ОшибкиИни=Неопределено, Знач ПараметрыПротокола) Экспорт
		
	Если ОшибкиИни = Неопределено Тогда
		ОшибкиИни = Ини;
	КонецЕсли;	
	
	// Функция формирует табличный документ протокола проверки файлов настроек	
	КоличествоРекурсийДляВыводаТаблиц = 1;
	МакетПротоколПроверки = МодульОбъектаСервер().ПолучитьМакетОбработкиНаСервере("ПротоколПроверкиИниФайлов");

	ТаблицаМетаданных = Новый ТаблицаЗначений;
	ТаблицаМетаданных.Колонки.Добавить("Объект");
	ТаблицаМетаданных.Колонки.Добавить("ИмяОбъекта");
	ТаблицаМетаданных.Колонки.Добавить("Синоним");
	ТаблицаМетаданных.Колонки.Добавить("ТипОбъекта");
	
	Таб = Новый ТабличныйДокумент;
	ОбластьЗаголовок = МакетПротоколПроверки.ПолучитьОбласть("ЗаголовокПротокола");
	ОбластьЗаголовок.Параметры.ЗаголовокКаталог = ПараметрыПротокола.ЗаголовокКаталог;
	ОбластьЗаголовок.Параметры.КаталогНастроек = ПараметрыПротокола.КаталогНастроек;
	ОбластьЗаголовок.Параметры.ДатаВремя = формат(ТекущаяДата());
	ОбластьЗаголовок.Параметры.Конфигурация = Метаданные.Синоним+" ("+Метаданные.Версия+")";
	ОбластьЗаголовок.Параметры.Версия = ПараметрыПротокола.Версия;
	ОбластьЗаголовок.Параметры.КонфигурацияФайловНастроек = ПараметрыПротокола.КонфигурацияФайловНастроек;
	Таб.Вывести(ОбластьЗаголовок);	
	
	ЗаполнитьТаблицуМетаданныхДляПротокола(ТаблицаМетаданных, Ини);
	
	СписокКопия = ТаблицаМетаданных.Скопировать();
	Для Каждого Элемент Из СписокКопия Цикл
		Если ТипЗнч(Элемент.Объект) = Тип("Структура") Тогда
			Для Каждого ЭлементаСтр из Элемент Цикл
				ТаблицаМетаданных = сбисСформироватьСписокМетаданных(ТаблицаМетаданных,ЭлементаСтр.Значение,КоличествоРекурсийДляВыводаТаблиц);
			КонецЦикла;	
		Иначе	
			ТаблицаМетаданных = сбисСформироватьСписокМетаданных(ТаблицаМетаданных,Элемент.Объект,КоличествоРекурсийДляВыводаТаблиц);
		КонецЕсли;	
	КонецЦикла;	
	
	ВывестиОшибки(МакетПротоколПроверки,Таб, ОшибкиИни);
	
	Если ТаблицаМетаданных.Количество() <> 0 Тогда
		ОбластьСправочнаяИнформация = МакетПротоколПроверки.ПолучитьОбласть("СправочнаяИнформация");
		Таб.Вывести(ОбластьСправочнаяИнформация);
	КонецЕсли;	
	
	сбисВывестиИнформациюПоМетаданным(ТаблицаМетаданных,МакетПротоколПроверки,Таб);
	сбисВывестиИнформацияПоОрганизациям(МакетПротоколПроверки,Таб);
	сбисВывестиСправочнуюИнформацию(МакетПротоколПроверки,Таб);
	
	Таб.ТолькоПросмотр        = Истина;
	Таб.ОтображатьГруппировки = Ложь;
	Таб.ОтображатьЗаголовки   = Ложь;
	Таб.ОтображатьСетку       = Ложь;
	Таб.АвтоМасштаб           = Истина;
	
	Возврат Таб;
	
КонецФункции

//группа функций и процедур для проверки ини файлов
&НаСервереБезКонтекста
Процедура	ЗаполнитьТаблицуМетаданныхДляПротокола(ТаблицаМетаданных, СлужебнаяСтруктура)
	// Функция заполняет таблицу с метаданными, по которым есть ошибки в файлах настроек 	
	Если ТипЗнч(СлужебнаяСтруктура) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;	
	
	Для Каждого сбисФайл из СлужебнаяСтруктура Цикл		
		Если ТипЗнч(сбисФайл.Значение) = Тип("Структура") и (сбисФайл.Значение.Свойство("Ошибка")) Тогда
			Строка = сбисФайл.Значение.Ошибка;
			Если ТипЗнч(Строка.ИнформацияПоОбъекту) = Тип("Структура") Тогда
				Для каждого СтрокаИнфПоОб из Строка.ИнформацияПоОбъекту Цикл
					Если ТаблицаМетаданных.Найти(СтрокаИнфПоОб.Значение,"Объект")=Неопределено Тогда
						НоваяСтрока = ТаблицаМетаданных.Добавить();
						НоваяСтрока.Объект     = СтрокаИнфПоОб.Значение;
						НоваяСтрока.ИмяОбъекта = СтрокаИнфПоОб.Ключ;
						НоваяСтрока.ТипОбъекта = "";
					КонецЕсли;
				КонецЦикла;	
			Иначе	
				Если ТаблицаМетаданных.Найти(Строка.ИнформацияПоОбъекту,"Объект")=Неопределено и Строка.ИнформацияПоОбъекту<>Неопределено Тогда
					НоваяСтрока = ТаблицаМетаданных.Добавить();
					НоваяСтрока.Объект     = Строка.ИнформацияПоОбъекту;
					НоваяСтрока.ИмяОбъекта = Строка.ИмяОбъекта;
					НоваяСтрока.ТипОбъекта = "";
				КонецЕсли;
			КонецЕсли;					
		Иначе
			ЗаполнитьТаблицуМетаданныхДляПротокола(ТаблицаМетаданных, сбисФайл.Значение);
		КонецЕсли;	
	КонецЦикла;	 
	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура	ВывестиОшибку(МакетПротоколПроверки, Таб, Узлы, ини)
	// Процедура выводит строку в таблице ошибок в протоколе проверки	
	Если ТипЗнч(Узлы) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;	
	
	Если Узлы.Свойство("Ошибка") Тогда
		ОбластьСтрокаОшибки                             = МакетПротоколПроверки.ПолучитьОбласть("ОписаниеОшибки");
		ТекстОшибки 									= СтрЗаменить(Узлы.Ошибка.ТекстОшибки," |","");
		ОбластьСтрокаОшибки.Параметры.ТекстОшибки       = ТекстОшибки;
		ОбластьСтрокаОшибки.Параметры.ПолныйПуть 		= ?(Узлы.Ошибка.ПолныйПуть<>Неопределено,"("+Узлы.Ошибка.ПолныйПуть+")","");
		ОбластьСтрокаОшибки.Параметры.Таблица           = ?(Узлы.Ошибка.ИмяОбъекта<>Неопределено,"("+Узлы.Ошибка.ИмяОбъекта+")","");
		ОбластьСтрокаОшибки.Параметры.ЗначениеПараметра = Узлы.Ошибка.ЗначениеПараметра;
		Если Узлы.Ошибка.ИмяПараметра<>"" Тогда
			ОбластьСтрокаОшибки.Параметры.ИмяПараметра      = Узлы.Ошибка.ИмяПараметра;
			Если ини.Свойство(Узлы.Ошибка.ИмяПараметра) и ини[Узлы.Ошибка.ИмяПараметра].Свойство("Комментарий") Тогда
				ТекстКоммментария 								= ?(ЗначениеЗаполнено(ини[Узлы.Ошибка.ИмяПараметра]["Комментарий"]),ини[Узлы.Ошибка.ИмяПараметра]["Комментарий"],"");
				ОбластьСтрокаОшибки.Параметры.ОписаниеПараметра = ?(СокрЛП(ТекстКоммментария)<>"","("+ТекстКоммментария+")","");
				ОбластьСтрокаОшибки.Параметры.ЗначениеПараметра = ?(НРег(Узлы.Ошибка.ИмяПараметра)="текстзапроса","Смотрите значение параметра ""ТекстЗапроса"" в ini файле.",Узлы.Ошибка.ЗначениеПараметра);
			КонецЕсли;
		КонецЕсли;
		Таб.Вывести(ОбластьСтрокаОшибки);
	КонецЕсли;
	
	Если Узлы.Количество() <> 0 Тогда
		Для каждого Узел из Узлы Цикл
			ВывестиОшибку(МакетПротоколПроверки, Таб, Узел.Значение, ини);
		КонецЦикла; 
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура	ВывестиОшибки(МакетПротоколПроверки,Таб, Ини)
	// Процедура выводит строки в таблице ошибок в протоколе проверки файлов настроек	
	Для Каждого сбисФайл из ини Цикл
		
		Если сбисФайл.Значение.сбисОшибки.Количество() <> 0 Тогда //Есть системные ошибки
			ОбластьЗаголовокТаблицы = МакетПротоколПроверки.ПолучитьОбласть("ЗаголовокТаблицы");
			ОбластьЗаголовокТаблицы.Параметры.ИмяФайла = ини[сбисФайл.Ключ].сбисИмяФайла;
			Таб.Вывести(ОбластьЗаголовокТаблицы);
			Для каждого Ошибка из сбисФайл.Значение.сбисОшибки Цикл
				ОбластьСтрокаОшибки                             = МакетПротоколПроверки.ПолучитьОбласть("ОписаниеОшибки");
				ТекстОшибки 									= СтрЗаменить(Ошибка.ТекстОшибки," |","");
				ОбластьСтрокаОшибки.Параметры.ТекстОшибки       = ТекстОшибки;
				ОбластьСтрокаОшибки.Параметры.ПолныйПуть 		= Ошибка.ПолныйПуть;
				ОбластьСтрокаОшибки.Параметры.ИмяПараметра 		= Ошибка.ИмяПараметра;
				ОбластьСтрокаОшибки.Параметры.ОписаниеПараметра = "";
				ОбластьСтрокаОшибки.Параметры.ЗначениеПараметра = Ошибка.ЗначениеПараметра;
				Таб.Вывести(ОбластьСтрокаОшибки);
			КонецЦикла;	
		Иначе // если системных ошибок нет выводим ошибки ини
			Если ЕстьОшибкаВУзлеСлужебнойСтруктуры(сбисФайл.Значение) Тогда
				ОбластьЗаголовокТаблицы = МакетПротоколПроверки.ПолучитьОбласть("ЗаголовокТаблицы");
				ОбластьЗаголовокТаблицы.Параметры.ИмяФайла = ини[сбисФайл.Ключ].сбисИмяФайла;
				Таб.Вывести(ОбластьЗаголовокТаблицы);
			КонецЕсли;		
			ВывестиОшибку(МакетПротоколПроверки, Таб, сбисФайл.Значение, ини);
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция		сбисВывестиИнформациюПоМетаданнымСтрока(ТаблицаМетаданных,МакетПротоколПроверки,Таб, Идентификатор)
	// Функция выводит информацию о реквизитах тех метаданных, в которых были обнаружены ошибки
	Если Идентификатор="" Тогда
		Возврат Ложь;
	КонецЕсли;
	Док = Метаданные.НайтиПоПолномуИмени(Идентификатор);
	
	Попытка
		Для Каждого Реквизит Из Док.Реквизиты Цикл //перебор реквизитов объекта
			Если Найти(Реквизит.Тип,",")=0 Тогда
				ОбъектМ = Метаданные.НайтиПоТипу(Реквизит.Тип.Типы()[0]);
				Если ОбъектМ<>Неопределено Тогда
					НайденнаяСтрока = ТаблицаМетаданных.Найти(ОбъектМ.ПолноеИмя(),"Объект");
				Иначе
					НайденнаяСтрока = Неопределено;
				КонецЕсли;
			Иначе
				НайденнаяСтрока = ТаблицаМетаданных.Найти(Реквизит.Синоним, "Объект");
			КонецЕсли;	
			ДопИнф = ?(НайденнаяСтрока<>Неопределено,НайденнаяСтрока.ИмяОбъекта,"");
			ДопИнф = ?(ДопИнф<>"","("+ДопИнф+")","");
			Если ДопИнф<>"" Тогда
				СтрокаРеквизита = МакетПротоколПроверки.ПолучитьОбласть("СтрокаРеквизита1");
				СтрокаРеквизита.Параметры.ИмяРеквизита     = Реквизит.Имя;
				СтрокаРеквизита.Параметры.СинонимРеквизита = Реквизит.Синоним;
				СтрокаРеквизита.Параметры.СинонимТаблица = ДопИнф;
				Таб.Вывести(СтрокаРеквизита);
			Иначе
				СтрокаРеквизита = МакетПротоколПроверки.ПолучитьОбласть("СтрокаРеквизита");
				СтрокаРеквизита.Параметры.ИмяРеквизита     = Реквизит.Имя;
				СтрокаРеквизита.Параметры.СинонимРеквизита = Реквизит.Синоним;
				Таб.Вывести(СтрокаРеквизита);
			КонецЕсли;	
		КонецЦикла;
		Попытка
			Для Каждого Реквизит Из Док.СтандартныеРеквизиты Цикл //перебор реквизитов объекта
				СтрокаРеквизита = МакетПротоколПроверки.ПолучитьОбласть("СтрокаРеквизита");
				СтрокаРеквизита.Параметры.ИмяРеквизита     = Реквизит.Имя;
				СтрокаРеквизита.Параметры.СинонимРеквизита = Реквизит.Синоним;				
				Таб.Вывести(СтрокаРеквизита);
			КонецЦикла;
		Исключение
		КонецПопытки;
		Попытка
			Если Док.ТабличныеЧасти.Количество()>0 Тогда
				ГруппаРеквизитов = МакетПротоколПроверки.ПолучитьОбласть("ГруппаРеквизитов");
				ГруппаРеквизитов.Параметры.ГруппаРеквизитов     = "Табличные части";
				Таб.Вывести(ГруппаРеквизитов);
			КонецЕсли;
			Для Каждого Реквизит Из Док.ТабличныеЧасти Цикл //перебор реквизитов объекта
				СтрокаРеквизита = МакетПротоколПроверки.ПолучитьОбласть("СтрокаРеквизита");
				СтрокаРеквизита.Параметры.ИмяРеквизита     = Реквизит.Имя;
				СтрокаРеквизита.Параметры.СинонимРеквизита = Реквизит.Синоним;				
				Таб.Вывести(СтрокаРеквизита);
			КонецЦикла;
		Исключение
		КонецПопытки;
		
	Исключение
		Попытка
			Для Каждого ЗначенияЭлементаМетаданных Из Док Цикл //перебор доступных объектов из списка объектов
				СтрокаРеквизита = МакетПротоколПроверки.ПолучитьОбласть("СтрокаРеквизита");
				СтрокаРеквизита.Параметры.ИмяРеквизита     = ЗначенияЭлементаМетаданных.Имя;
				СтрокаРеквизита.Параметры.СинонимРеквизита = ЗначенияЭлементаМетаданных.Синоним;				
				Таб.Вывести(СтрокаРеквизита);
			КонецЦикла;	
		Исключение
			Попытка
				Если Найти(Нрег(Док.ПолноеИмя()),"перечисление")>0 Тогда
					Для Каждого ЗначениеПеречисления из Док.Объект.ЗначенияПеречисления Цикл
						СтрокаРеквизита = МакетПротоколПроверки.ПолучитьОбласть("СтрокаРеквизита");
						СтрокаРеквизита.Параметры.ИмяРеквизита     = Строка(Док.ИмяОбъекта + "."+ЗначениеПеречисления.Имя);
						СтрокаРеквизита.Параметры.СинонимРеквизита = Строка(ЗначениеПеречисления.Синоним);				
						Таб.Вывести(СтрокаРеквизита);	
					КонецЦикла;	
				Иначе	
					СтрокаРеквизита = МакетПротоколПроверки.ПолучитьОбласть("СтрокаРеквизита");
					СтрокаРеквизита.Параметры.ИмяРеквизита     = Строка(Док.ИмяОбъекта);
					СтрокаРеквизита.Параметры.СинонимРеквизита = Строка(Док.Синоним);				
					Таб.Вывести(СтрокаРеквизита);
				КонецЕсли;
			Исключение
				//Для Каждого Строка из Строка.Объект Цикл
				//Док = Метаданные.НайтиПоПолномуИмени(Строка.Значение);
				Если Найти(Док.ПолноеИмя(),"ТабличнаяЧасть")>0 Тогда
					НайденнаяСтрока = ТаблицаМетаданных.Найти(Док.ПолноеИмя(),"Объект");
					ДопИнф = ?(НайденнаяСтрока<>Неопределено,НайденнаяСтрока.ИмяОбъекта,"");
					ДопИнф = ?(ДопИнф<>"","("+ДопИнф+")","");
					Если ДопИнф<>"" Тогда
						СтрокаРеквизита = МакетПротоколПроверки.ПолучитьОбласть("СтрокаРеквизита1");
						СтрокаРеквизита.Параметры.ИмяРеквизита     = Док.Имя;
						СтрокаРеквизита.Параметры.СинонимРеквизита = Док.Синоним;
						СтрокаРеквизита.Параметры.СинонимТаблица = ДопИнф;
						Таб.Вывести(СтрокаРеквизита);
					Иначе
						СтрокаРеквизита = МакетПротоколПроверки.ПолучитьОбласть("СтрокаРеквизита");
						СтрокаРеквизита.Параметры.ИмяРеквизита     = Док.Имя;
						СтрокаРеквизита.Параметры.СинонимРеквизита = Док.Синоним;
						Таб.Вывести(СтрокаРеквизита);
					КонецЕсли;	
				Иначе	
					СтрокаРеквизита = МакетПротоколПроверки.ПолучитьОбласть("СтрокаРеквизита");
					СтрокаРеквизита.Параметры.ИмяРеквизита     = Строка(Док.Имя);
					СтрокаРеквизита.Параметры.СинонимРеквизита = Строка(Док.Синоним);				
					Таб.Вывести(СтрокаРеквизита);
				КонецЕсли;
				
				//КонецЦикла;
			КонецПопытки
			
		КонецПопытки;	
	КонецПопытки;	
	
КонецФункции	

&НаСервереБезКонтекста
Процедура	сбисВывестиИнформациюПоМетаданным(ТаблицаМетаданных,МакетПротоколПроверки,Таб)
	// Процедура перебирает таблицу метаданных, в которых были обнаружены ошибки и выводит информацию о реквизитах этих метаданных в табличный документ	
	Если ТаблицаМетаданных.Количество()<>0 Тогда
		
		Для Каждого Строка Из ТаблицаМетаданных Цикл
			ОбластьЗаголовокМетаданных                              = МакетПротоколПроверки.ПолучитьОбласть("ЗаголовокМетаданных");
			ОбластьЗаголовокМетаданных.Параметры.ИмяМетаданных      = Строка.ИмяОбъекта;
			Таб.Вывести(ОбластьЗаголовокМетаданных);
			
			Если ТипЗнч(Строка.Объект) = Тип("Структура") Тогда
				Для каждого СтрокаСтр из Строка.Объект Цикл
					сбисВывестиИнформациюПоМетаданнымСтрока(ТаблицаМетаданных, МакетПротоколПроверки, Таб, СтрокаСтр.Значение);
				КонецЦикла;
			Иначе
				сбисВывестиИнформациюПоМетаданнымСтрока(ТаблицаМетаданных, МакетПротоколПроверки, Таб, Строка.Объект);
			КонецЕсли;	
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция		сбисСформироватьСписокМетаданных(ТаблицаМетаданных,Идентификатор=Неопределено,УровеньВложенности)
	// Функция формирует таблицу с реквизитами метаданных для вывода в протоколе проверки	
	Если УровеньВложенности <> 0 Тогда
		Попытка
			ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(Идентификатор);
			Для Каждого Реквизит из ОбъектМетаданных.Реквизиты Цикл
				Если Найти(Реквизит.Тип,",")=0 Тогда //тип один
					ОбъектМ = Метаданные.НайтиПоТипу(Реквизит.Тип.Типы()[0]);
					Если ОбъектМ<>Неопределено и ТаблицаМетаданных.Найти(ОбъектМ.Полноеимя(),"Объект")=Неопределено Тогда
						Попытка                     
							НоваяСтрока = ТаблицаМетаданных.Добавить();
							НоваяСтрока.Объект=ОбъектМ.ПолноеИмя();
							НоваяСтрока.ИмяОбъекта=ОбъектМ.Имя;
							НоваяСтрока.Синоним = ОбъектМ.Синоним;
							НоваяСтрока.ТипОбъекта = "";
							сбисСформироватьСписокМетаданных(ТаблицаМетаданных,ОбъектМ.ПолноеИмя(),УровеньВложенности-1);
						Исключение
							Ошибка = описаниеОшибки();
							Сообщить(Ошибка);
							Сообщить(строка(ОбъектМ));
						КонецПопытки;
					Иначе	
					КонецЕсли;	                
				Иначе	 //несколько типов
					НоваяСтрока = ТаблицаМетаданных.Добавить();
					НоваяСтрока.Объект=Реквизит.ПолноеИмя();
					НоваяСтрока.ИмяОбъекта = Реквизит.Имя;
					НоваяСтрока.ТипОбъекта = Реквизит.Синоним;
					ТекстДляВывода= "Составной реквизит.";
					НоваяСтрока.Синоним = ТекстДляВывода;
				КонецЕсли;	 
			КонецЦикла;
			
		Исключение
			Попытка
				//если табличные части
				Для Каждого ТабличнаяЧасть из ОбъектМетаданных Цикл
					НоваяСтрока = ТаблицаМетаданных.Добавить();
					НоваяСтрока.Объект=ТабличнаяЧасть;
					НоваяСтрока.ИмяОбъекта=ТабличнаяЧасть.ПолноеИмя();
					НоваяСтрока.Синоним = ТабличнаяЧасть.Синоним;
					НоваяСтрока.ТипОбъекта = ТабличнаяЧасть;
					сбисСформироватьСписокМетаданных(ТаблицаМетаданных,ТабличнаяЧасть,УровеньВложенности-1);
				КонецЦикла;	
			Исключение
			КонецПопытки;	
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат ТаблицаМетаданных;	
КОнецФункции

&НаСервереБезКонтекста
Процедура	сбисВывестиИнформацияПоОрганизациям(МакетПротоколПроверки,Таб)
	// Выводит информацию по организации в протокол проверки	
	Попытка
		Выборка = Справочники.Организации.Выбрать();
		ОбластьШапкаОрганизации = МакетПротоколПроверки.ПолучитьОбласть("ШапкаОрганизации");
		Таб.Вывести(ОбластьШапкаОрганизации);	
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;
			ОбластьСтрокаОрганизации = МакетПротоколПроверки.ПолучитьОбласть("СтрокаОрганизации");
			ОбластьСтрокаОрганизации.Параметры.НаименованиеОрганизации = ?(ЗначениеЗаполнено(Выборка.НаименованиеПолное),Выборка.НаименованиеПолное,Выборка.Наименование);
			ОбластьСтрокаОрганизации.Параметры.ИНН_КПП = Выборка.ИНН+" / "+Выборка.КПП;
			Таб.Вывести(ОбластьСтрокаОрганизации);	
		КонецЦикла;	
	Исключение	
	КонецПопытки	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура	сбисВывестиСправочнуюИнформацию(МакетПротоколПроверки,Таб)
	// Выводит справочную информацию в протокол проверки	
	ОбластьДокументация = МакетПротоколПроверки.ПолучитьОбласть("СсылкаДокументация");
	ОбластьДокументация.Параметры.ТекстСообщения = "Для исправления ошибок передайте протокол проверки техническому специалисту через Вашего менеджера.";
	Таб.Вывести(ОбластьДокументация);	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция	ЕстьОшибкаВУзлеСлужебнойСтруктуры(Узел)
	// Рекурсивно проверяет, есть ли в узле структуры ошибка, чтобы понимать какую структуру узлов надо создавать в пользовательском файле настроек	
	ЕстьОшибка = Ложь;
	Если ТипЗнч(Узел) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Узел.Свойство("Ошибка") Тогда
		Возврат Истина;
	КонецЕсли;	
	Для каждого ЭлементУзла из Узел Цикл		
		Если ТипЗнч(ЭлементУзла.Значение) = Тип("Структура") Тогда	
			Если ЭлементУзла.Значение.Свойство("Ошибка") Тогда
				Возврат Истина;
			КонецЕсли;	
			Если ЕстьОшибкаВУзлеСлужебнойСтруктуры(ЭлементУзла.Значение) Тогда //Проверяем вложенный узел
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;	
	
	Возврат ЕстьОшибка;
	
КонецФункции

///////////////////////////////////////////////////
//////////////////Проверка настроек////////////////
///////////////////////////////////////////////////

//Вызывает проверку структуры установленных файлов настроек	
&НаКлиенте
Функция		СбисПроверитьУстановленныеНастройки(Кэш, ПараметрыУстановкиВходящие, СтруктураИни, СтруктураПараметров, ИдентификаторНастроек=Неопределено) Экспорт
	
	СтруктураПараметров.Вставить("ДатаПоследнейПроверки", ТекущаяДата());									
    ГлавноеОкно = Кэш.ГлавноеОкно;
	Отказ = Ложь;
	ГлавноеОкно.сбисПоказатьСостояние("Установка пользовательских фильтров", ГлавноеОкно);
	//Перед проверкой установим пользовательские фильтры для запросов
	ПараметрыУстановкиФильтров = Новый Структура("СформироватьРазделыПоДанным, Ини", Истина, СтруктураИни);	
	РезультатЗаполнения = СбисЗаполнитьДополнительныеПараметрыФильтра(Кэш, ПараметрыУстановкиФильтров, Отказ);
	Если Отказ Тогда
		//TODO42 сделать проброску исключения на верхний уровень
		РезультатЗаполнения = Кэш.ОбщиеФункции.СбисИсключение(РезультатЗаполнения, "ФайлыНастроекОбщее.сбисПроверитьУстановленныеНастройки");
		ГлавноеОкно.СбисСообщитьОбОшибке(Кэш, РезультатЗаполнения, Новый Структура("ФормаВладелец", Кэш.ФормаНастроекОбщее));
		Кэш.КэшНастроек.ИниВПорядке = Ложь;
		Возврат Неопределено;
	КонецЕсли;
	
	ГлавноеОкно.сбисПоказатьСостояние("Проверка файлов настроек", ГлавноеОкно);
	УстановленныеИниФайлы = ПроверитьИниФайлы(Кэш, ПараметрыУстановкиВходящие, СтруктураИни, СтруктураПараметров);
	Если	УстановленныеИниФайлы.Количество()
		И	Кэш.КэшНастроек.ИниВПорядке Тогда
		Сообщить("Ошибок в ini файлах не обнаружено.");
	КонецЕсли;
	
	ГлавноеОкно.сбисСпрятатьСостояние(ГлавноеОкно);
	
	Возврат УстановленныеИниФайлы;
	
КонецФункции

// Проверяет структуру установленных файлов настроек	
&НаКлиенте
Функция		ПроверитьИниФайлы(Кэш, ПараметрыУстановкиВходящие, СтруктураИни, СтруктураПараметров)
	
	СписокИниФайловДляПроверки = ПараметрыУстановкиВходящие.СписокИни;

	//Формируется структура инишек, идентичная оригинальной, но в которой только ошибки, или узлы с ошибками. Дальше просто передать вместо инишек эту.
	СтруктураОшибокИни	= ПроверитьСтруктуруИниФайлов(СписокИниФайловДляПроверки, СтруктураИни, Кэш.ПараметрыФильтра); 
	ПоказатьПротокол	= Не Кэш.ТихийРежим И	(		СтруктураОшибокИни.Количество()
													Или	СтруктураИни.Количество())
												Или	(	ПараметрыУстановкиВходящие.Свойство("ПринудительнаяПроверка")
													И	ПараметрыУстановкиВходящие.ПринудительнаяПроверка);
	
	// файл настроек Конфигурация обязательно должен быть, иначе выдаем ошибку
	Если Не Кэш.Ини.Свойство("Конфигурация") Тогда
		СтруктураОшибокИни.Вставить("Конфигурация", Новый Структура("сбисОшибки, сбисИмяФайла", Новый Массив, "Конфигурация.sbis3.xml"));
		НоваяОшибка = Новый Структура();
		НоваяОшибка.Вставить("ИмяПараметра",		"Файл настройки");
		НоваяОшибка.Вставить("ЗначениеПараметра",	"Конфигурация");
		НоваяОшибка.Вставить("ТекстОшибки",			"Не установлен файл настроек конфигурации. ");
		НоваяОшибка.Вставить("ИнформацияПоОбъекту",	"");
		НоваяОшибка.Вставить("ИмяОбъекта",			"");
		НоваяОшибка.Вставить("ПолныйПуть",			"");
		СтруктураОшибокИни.Конфигурация.сбисОшибки.Добавить(НоваяОшибка);
	КонецЕсли;
	
	Если СтруктураОшибокИни.Количество() Тогда//Были ошибки, сформировать протокол и пользовательские файлы на соответствующей форме.
		Кэш.КэшНастроек.ИниВПорядке = Ложь;
		Если ПоказатьПротокол Тогда 
			ПараметрыПротокола = Кэш.ФормаНастроек.сбисПолучитьШапкуПротоколаОбОшибках(Кэш, СписокИниФайловДляПроверки);
			ПараметрыПротокола.Вставить("УправляемоеПриложение", Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение);
			//Показать протокол об ошибках
			ТабПротокол	= ВывестиПротоколПроверкиИниФайлов(Кэш.Ини, СтруктураОшибокИни, ПараметрыПротокола);
			ТабПротокол.Показать("Протокол проверки ini файлов");
		КонецЕсли;
		//Формируем пользовательские инишки на соответствующей форме
		Кэш.ФормаНастроек.сбисСформироватьИниФайлыКлиента(Кэш, СписокИниФайловДляПроверки, СтруктураОшибокИни);
	Иначе//Не было ошибок, сообщить что все ок
		Кэш.КэшНастроек.ИниВПорядке	= Истина;
		//Сохраняем параметры по завершении всех операций
		//Режим = Неопределено;
		//Если	Кэш.Свойство("ДополнительныеПараметры",Режим)//Сохраняем параметры, но только если это не загрузка из каталога. 
		//	И	Режим.Свойство("РежимРаботы", Режим)
		//	И	Режим = "ЗагрузкаИзКаталога" Тогда
		//	Кэш.КэшНастроек.Вставить("сбисПараметры", СтруктураПараметров);
		//Иначе
		//	Кэш.ФормаНастроек.СохранитьПараметрыСБИС(Кэш, СтруктураПараметров, ИдентификаторНастроек);//сохранить сбис параметры
		//КонецЕсли;
	КонецЕсли;
	
	СписокУстановленныхИниФайлов = Кэш.ФормаНастроек.сбисОбновитьМассивУстановленныхИниФайлов(Кэш, СписокИниФайловДляПроверки);
	
	Возврат СписокУстановленныхИниФайлов;
	
КонецФункции

&НаСервереБезКонтекста
Функция		ПроверитьСтруктуруИниФайлов(СписокИниФайловДляПроверки, СтруктураИни, ПараметрыФильтра)
	
	СтруктураОшибок	= Новый	Структура();
	
	КлючСистемныхОшибок	= "сбисОшибки";
	КлючСвойствЗаполнить= "сбисИмяФайла,сбисПолноеИмяФайла";
	КэшПроверок = Новый Структура("Метаданные", Новый Соответствие);
	
	Для Каждого ИниФайл Из СписокИниФайловДляПроверки Цикл
		
		Если	ИниФайл.Свойство("НужноПроверять")
			И	НЕ ИниФайл.НужноПроверять Тогда
			Продолжить;
		КонецЕсли;
		
		Ошибки				= Ложь;
		ИмяБезРасширения	= ИниФайл.Ини_ИмяБезРасширения;
		ИмяИни				= ИниФайл.Ини_ИмяИни;
		сбисФайл			= СтруктураИни[ИмяИни];
		
		ПроверитьСтруктуруИни(сбисФайл, ИмяБезРасширения, ПараметрыФильтра, КэшПроверок);//Проверяет инишки, формирует и заполняет ошибки в структуре узлов
		
		//Формируются только структуры с инишками и узлами, где есть ошибки. Пока сделано так. В проверке параметров - черт ногу сломит.
		Если сбисФайл[КлючСистемныхОшибок].Количество() <> 0 Тогда //Есть системные ошибки
			СтруктураОшибкиВставка	= Новый	Структура(КлючСвойствЗаполнить);
			ЗаполнитьЗначенияСвойств(СтруктураОшибкиВставка,сбисФайл,КлючСвойствЗаполнить);
			СтруктураОшибкиВставка.Вставить(КлючСистемныхОшибок,	сбисФайл[КлючСистемныхОшибок]);
			Ошибки	= Истина;
		Иначе //Нет системных ошибок, строим узлы с ошибками
			СтруктураОшибкиВставка	= СформироватьСтруктуруОшибкиУзла(сбисФайл);
			Если	СтруктураОшибкиВставка.Количество()	Тогда
				КлючМногострочный	= СтрЗаменить(КлючСвойствЗаполнить	+ ","	+ КлючСистемныхОшибок,",",Символы.ПС);
				Для	шаг	= 1	По	СтрЧислоСтрок(КлючМногострочный)	Цикл
					СтруктураОшибкиВставка.Вставить(СтрПолучитьСтроку(КлючМногострочный,шаг),	сбисФайл[СтрПолучитьСтроку(КлючМногострочный,шаг)]);
				КонецЦикла;
				Ошибки	= Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если	Ошибки	Тогда//Добавить в ошибки готовую структуру
			СтруктураОшибок.Вставить(ИмяИни,	СтруктураОшибкиВставка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат	СтруктураОшибок;
	
КонецФункции

&НаСервереБезКонтекста
Функция		ПроверитьСтруктуруИни(СтруктураИниФайла, ИмяБезРасширения, ПараметрыФильтра, КэшПроверок)
	
	// Проверяет структуру файла настроек	
	Для Каждого Стр Из СтруктураИниФайла Цикл
		//не проверяем элементы структуры в имени которых есть слово "сбис"
		//так как это служебные элементы, которые мы добавили вручную
		Если Найти(Стр.Ключ,"сбис")>0 Тогда
			Продолжить
		КонецЕсли;
		ГрязнаяИни	= Новый Структура;
		сбисСкопироватьСтруктуру(ГрязнаяИни, СтруктураИниФайла);
		Попытка
			ПроверитьЗначениеПараметра(Стр.Ключ, Стр.Значение, ГрязнаяИни, СтруктураИниФайла[Стр.Ключ],ПараметрыФильтра, КэшПроверок);
		Исключение
			СбисОписаниеОшибки = СтрЗаменить(ИнформацияОбОшибке().Описание, "%Замена%", Символы.ПС);
			СбисТекстОшибки = "Неизвестная структура ини файла" + Символы.ПС + "Детальная информация: " + СтрПолучитьСтроку(СбисОписаниеОшибки, 1);
			СбисСтруктураОшибки = СбисОшибкаПроверки(Стр.Ключ, "Узел ини файла", СбисТекстОшибки,,,СтрПолучитьСтроку(СбисОписаниеОшибки, 2));
			СтруктураИниФайла.сбисОшибки.Добавить(СбисСтруктураОшибки);
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
КонецФункции

&НаСервереБезКонтекста
Функция		ПроверитьЗначениеПараметра(знач ИмяПараметра, знач ЗначениеПараметра, СтруктураИниФайла, СлужебнаяСтруктура, ПараметрыФильтра, КэшПроверок)
	Перем ЗначениеПроверить;
	
	// Проверяет значение параметра в файле настроек	
	Если	ТипЗнч(ЗначениеПараметра) = Тип("Структура") Тогда
		
		Если ЗначениеПараметра.Свойство("Данные", ЗначениеПроверить)	Тогда
			
			ПроверитьЗначениеПараметра_Данные(ИмяПараметра, ЗначениеПроверить, СтруктураИниФайла, СлужебнаяСтруктура, ПараметрыФильтра);
			
		КонецЕсли;
			
		Если	ЗначениеПараметра.Свойство("Тип", ЗначениеПроверить)
			И	ТипЗнч(ЗначениеПроверить) = Тип("Строка") Тогда
			
			ПроверитьЗначениеПараметра_Тип(ИмяПараметра, ЗначениеПроверить, СтруктураИниФайла, СлужебнаяСтруктура, ПараметрыФильтра, КэшПроверок);
			
		КонецЕсли;	
			
		Если Не ЗначениеПараметра.Свойство("Значение", ЗначениеПроверить) Тогда
			
			ЗначениеПроверить = ЗначениеПараметра;	
			
		КонецЕсли;
		
	Иначе
		
		ЗначениеПроверить = ЗначениеПараметра;
		
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеПроверить)=Тип("Структура")  Тогда
		сбисСкопироватьСтруктуру(СтруктураИниФайла, ЗначениеПроверить);
		Для Каждого Элемент Из ЗначениеПараметра Цикл //перебираем структуру - там не может быть запроса и массива
			Попытка
				ПроверитьЗначениеПараметра(Элемент.Ключ, Элемент.Значение, СтруктураИниФайла, СлужебнаяСтруктура[Элемент.Ключ], ПараметрыФильтра, КэшПроверок);
			Исключение
				ВызватьИсключение(СбисТекстИсключениеПриПроверке(Элемент.Ключ, Элемент.Значение, ИнформацияОбОшибке().Описание));
			КонецПопытки;
		КонецЦикла;
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат ПроверитьЗначениеПараметра_Значение(ИмяПараметра, ЗначениеПроверить, СтруктураИниФайла, СлужебнаяСтруктура, ПараметрыФильтра, КэшПроверок)	
			
КонецФункции

&НаСервереБезКонтекста
Процедура	ПроверитьЗначениеПараметра_Тип(ИмяПараметра, ЗначениеПараметра, СтруктураИниФайла, СлужебнаяСтруктура, ПараметрыФильтра, КэшПроверок)
	Перем ТекстОшибки;

	
	ЗначениеПроверить = "," + СокрЛП(НРег(ЗначениеПараметра)) + ",";
	Если	Найти(",,дата,строка,число,булево,таблицазначений,табличнаячасть,массив,запрос,описаниетипов,выборка,объект,", ЗначениеПроверить) Тогда
			
		Возврат;
		
	ИначеЕсли Найти(ЗначениеПараметра, ",") Тогда
		
		// Сперва скопом проверить все описанные типы. Если не удалось, то каждый по отдельности.
		Попытка

			ОписаниеТиповТест = Новый ОписаниеТипов(ЗначениеПараметра);
			
		Исключение
			
			МножественныйТипПроверить = СтрЗаменить(ЗначениеПараметра, ",", Символы.ПС);
			Для НомерСтрокиПроверка = 1 По СтрЧислоСтрок(МножественныйТипПроверить) Цикл
				
				ПроверитьЗначениеПараметра_Тип1С(ИмяПараметра, СтрПолучитьСтроку(МножественныйТипПроверить, НомерСтрокиПроверка), СтруктураИниФайла, СлужебнаяСтруктура, КэшПроверок);
				
			КонецЦикла;

		КонецПопытки;
		
		Возврат;
		
	Иначе
				
		Тип1С = ПроверитьЗначениеПараметра_Тип1С(ИмяПараметра, ЗначениеПараметра, СтруктураИниФайла, СлужебнаяСтруктура, КэшПроверок);
		Если Не Тип1С = Неопределено Тогда
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстОшибки = "Нарушение правила записи типа данных.";
	сбисЗаписатьОшибкуИниФайла(ИмяПараметра, ЗначениеПараметра, ТекстОшибки, СтруктураИниФайла, СлужебнаяСтруктура);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура	ПроверитьЗначениеПараметра_Данные(ИмяПараметра, ЗначениеПараметра, СтруктураИниФайла, СлужебнаяСтруктура, ПараметрыФильтра)
	
	ЗначениеПроверить = СокрЛП(ЗначениеПараметра);
	
	Если 	Найти(ЗначениеПроверить, "[") Тогда
		
		НаборДанныеПроверить			 = СтрЗаменить(ЗначениеПроверить, "[", Символы.ПС);
		// Допускается обращение к данным через "[]" если это массив, либо это сравнение, тогда запись может быть "[0,0]"
		ДопустимыеСимволыДляОбращения	 = "0123456789,";
		НеправильноеОбращение			 = Ложь;
		Для НомерСтроки = 2 По СтрЧислоСтрок(НаборДанныеПроверить) Цикл
			
			ТекущаяСтрокаАнализ  = СтрПолучитьСтроку(НаборДанныеПроверить, НомерСтроки);
			ОтветныйЗнакНомер	 = Найти(ТекущаяСтрокаАнализ, "]");
			Если Не ОтветныйЗнакНомер Тогда
				
				НеправильноеОбращение = Истина;
				Прервать;
				
			КонецЕсли;
			СрезДляПроверки		 = Сред(ТекущаяСтрокаАнализ, 1, ОтветныйЗнакНомер - 1);
			Для НомерСимвола = 1 По СтрДлина(СрезДляПроверки) Цикл
				
				Если Найти(ДопустимыеСимволыДляОбращения, Сред(СрезДляПроверки, НомерСимвола, 1)) Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				НеправильноеОбращение = Истина;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если Не НеправильноеОбращение Тогда
			
			Возврат;
			
		КонецЕсли;
		
			
	ИначеЕсли	Не	(	Найти(ЗначениеПроверить, "{")
					Или	Найти(ЗначениеПроверить, "&")
					Или	Найти(ЗначениеПроверить, "^")
					Или	Найти(ЗначениеПроверить, "\")
					Или	Найти(ЗначениеПроверить, "*")
					Или	Найти(ЗначениеПроверить, " ")) Тогда
				
		Возврат;
		
	КонецЕсли;
				
	ТекстОшибки = "Нарушение правила записи пути к данным.";
	//сбисЗаписатьОшибкуИниФайла(ИмяПараметра, ЗначениеПараметра, ТекстОшибки, СтруктураИниФайла, СлужебнаяСтруктура);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция		ПроверитьЗначениеПараметра_Значение(ИмяПараметра, ЗначениеПараметра, СтруктураИниФайла, СлужебнаяСтруктура, ПараметрыФильтра, КэшПроверок)
	
	Если ТипЗнч(ЗначениеПараметра) = Тип("Строка")  Тогда
		ЗначениеПараметра = СокрЛП(ЗначениеПараметра);
	КонецЕсли;
	
	Если ИмяПараметра = "ЗапросСпискаДокументов" Тогда
		Попытка
			Запрос = Новый Запрос;
			Запрос.Текст = Сред(ЗначениеПараметра,2,СтрДлина(ЗначениеПараметра)-2);
			Если ЗначениеЗаполнено(Запрос.Текст) Тогда
				Запрос.УстановитьПараметр("ДатаНач", ТекущаяДата());
				Запрос.УстановитьПараметр("ДатаКон", ТекущаяДата());	
				Запрос.УстановитьПараметр("ЗначениеДатаКонЗаполнено", Ложь);	
				Запрос.УстановитьПараметр("Контрагент", "");
				Запрос.УстановитьПараметр("КонтрагентПодключен", "");
				Запрос.УстановитьПараметр("ТекущаяОрганизация", "");
				Запрос.УстановитьПараметр("ЗначениеТекущаяОрганизацияЗаполнено", Ложь);
				Запрос.УстановитьПараметр("ЗначениеКонтрагентЗаполнено", Ложь);
				Запрос.УстановитьПараметр("ТекущийДокумент", "");
				Запрос.УстановитьПараметр("ЗначениеТекущийДокументЗаполнено", Ложь);
				Запрос.УстановитьПараметр("Ответственный", "");
				Запрос.УстановитьПараметр("Маска", ""); // alo СтатусГос
				Для каждого ПараметрФильтра из ПараметрыФильтра Цикл
					Запрос.УстановитьПараметр(ПараметрФильтра.Ключ, "");
					Запрос.УстановитьПараметр("Значение" + ПараметрФильтра.Ключ + "Заполнено", Ложь);
				КонецЦикла;	
				Запрос.Выполнить().Выбрать();
			КонецЕсли;
		Исключение
			ТекстОшибки = ИнформацияОбОшибке();
			ТекстОшибки = "Неправильный текст запроса."+Символы.ПС+"("+ТекстОшибки.Причина.Описание+")";
			сбисЗаписатьОшибкуИниФайла(ИмяПараметра,ЗначениеПараметра,ТекстОшибки,СтруктураИниФайла, СлужебнаяСтруктура);
			Возврат Ложь;
		КонецПопытки;
		Возврат Истина;
	КонецЕсли;
	Если	ТипЗнч(СтруктураИниФайла[ИмяПараметра])	= Тип("Структура")
		И	СтруктураИниФайла[ИмяПараметра].Свойство("Вычислить")
		И	Найти(СтруктураИниФайла[ИмяПараметра].Вычислить,"{") = 1 Тогда
			Если ПроверитьЗначениеПараметраНаВычисление(СтруктураИниФайла[ИмяПараметра].Вычислить) Тогда
				Возврат сбисЗаписатьОшибкуИниФайла(ИмяПараметра,СтруктураИниФайла[ИмяПараметра].Вычислить,"Нарушение правила вызова функции.",СтруктураИниФайла, СлужебнаяСтруктура);
			КонецЕсли;	
	КонецЕсли;	
	
	Если Найти(ЗначениеПараметра,"{") > 0  Тогда	
		//значение параметра вычисляется функцией, проверим что за функция
		Если ПроверитьЗначениеПараметраНаВычисление(ЗначениеПараметра) и Найти(ЗначениеПараметра,"{") = 1 Тогда
			Возврат сбисЗаписатьОшибкуИниФайла(ИмяПараметра,ЗначениеПараметра,"Нарушение правила вызова функции.",СтруктураИниФайла, СлужебнаяСтруктура);
		Иначе
			Возврат Ложь;
		КонецЕсли;	
		
	ИначеЕсли Найти(ЗначениеПараметра,"[")=1 Тогда
		СтрОбъекта=Сред(ЗначениеПараметра,2,Найти(ЗначениеПараметра,"]")-2);
		// << alo Меркурий
		Если	СтрОбъекта = "Парам"
			Или	НРег(СтрОбъекта) = "входящийконтекст" Тогда
			Возврат Ложь;
		КонецЕсли;// alo Меркурий >>
		Попытка
			ЗначениеОбъекта = СтруктураИниФайла[СтрОбъекта];
			Если ТипЗнч(ЗначениеПараметра)= Тип("Строка") или ТипЗнч(ЗначениеПараметра)= Тип("Булево") или ТипЗнч(ЗначениеПараметра)= Тип("Число") Тогда
				Попытка
					Объект1С = ПроверитьЗначениеПараметра(СтрОбъекта,ЗначениеОбъекта,СтруктураИниФайла, СлужебнаяСтруктура,ПараметрыФильтра, КэшПроверок);
				Исключение
					ВызватьИсключение(СбисТекстИсключениеПриПроверке(СтрОбъекта, ЗначениеОбъекта, ИнформацияОбОшибке().Описание));
				КонецПопытки;
			Иначе	  
				Объект1С =  ЗначениеОбъекта;
			КонецЕсли;	
		Исключение
			ТекстОшибки = "Значение параметра ссылается на несуществующий параметр: """+СтрОбъекта+"""."+Символы.ПС;
			ТекстОшибки = ТекстОшибки + "1. Возможно в слове """+СтрОбъекта+""" опечатка. Исправьте её."+Символы.ПС;
			ТекстОшибки = ТекстОшибки + "2. Определите значение параметра """+СтрОбъекта+""" в виде: "+СтрОбъекта+" = ЗначениеПараметра // комментарий";
			Возврат сбисЗаписатьОшибкуИниФайла(ИмяПараметра,ЗначениеПараметра,ТекстОшибки,СтруктураИниФайла, СлужебнаяСтруктура);
		КонецПопытки;
		
		Если Объект1С<>Ложь Тогда
			ИмяРек=ЗначениеПараметра;
			Если Не Найти(ИмяРек,".") Тогда
				Возврат Ложь;//Переадресация на другой атрибут
			КонецЕсли;
			Пока Найти(ИмяРек,".")>0 Цикл 
				ИмяРек=прав(ИмяРек,СтрДлина(ИмяРек)-Найти(ИмяРек,"."));
			КонецЦикла;	
			Если ИмяРек = "УникальныйИдентификатор" Тогда
				Возврат Ложь;
			КонецЕсли;
			Попытка
				Объект1СПолноеИмя = Объект1С.ПолноеИмя();
			Исключение
				Объект1СПолноеИмя = "";
			КонецПопытки;
			Попытка
				Объект1СТип = Объект1С.Тип;
			Исключение
				Объект1СТип = "";
			КонецПопытки;
			Попытка
				Если (Найти(Объект1СПолноеИмя,"ТабличнаяЧасть")>0 или Найти(Объект1СПолноеИмя,"TabularSection")>0) Тогда
					Попытка
						Попытка
							Возврат Объект1С.Реквизиты[ИмяРек];
						Исключение
							Попытка 
								Возврат Объект1С.СтандартныеРеквизиты[ИмяРек];									
							Исключение
								ТипСравочника=ВернутьТипСправочника(Объект1СТип);
								Попытка
									Возврат ТипСравочника.Реквизиты[ИмяРек];
								Исключение
									Попытка 
										Возврат ТипСравочника.СтандартныеРеквизиты[ИмяРек];									
									Исключение	
										Возврат ТипСравочника.ТабличныеЧасти[ИмяРек];								
									КонецПопытки;	
								КонецПопытки;
							КонецПопытки;	
						КонецПопытки;
					Исключение
						Попытка
							Если (Найти(Объект1СТип,",")=0) Тогда //не составной объект, имеет 1 тип
								ОбъектМетаданных =Метаданные.НайтиПоТипу(Объект1СТип.Типы()[0]); // ищем по типу метаданных, так как тип у объекта один то по нему и ищем
								Попытка
									Возврат ОбъектМетаданных.Реквизиты[ИмяРек];
								Исключение
									Попытка 
										Возврат ОбъектМетаданных.СтандартныеРеквизиты[ИмяРек];									
									Исключение
										Возврат сбисЗаписатьОшибкуИниФайла(ИмяПараметра,ЗначениеПараметра,"Не найден реквизит """+ИмяРек+""".",СтруктураИниФайла, СлужебнаяСтруктура, ОбъектМетаданных,Объект1С.Имя,Объект1СПолноеИмя+"."+ИмяРек);
									КонецПопытки;
								КонецПопытки;
							ИначеЕсли (Найти(Объект1СТип,",")>0) Тогда
								//составной тип реквизита, невозможно проверить
								Возврат Ложь;
							КонецЕсли;	
						Исключение
							//ЗначениеПараметраТабличнойЧасти = СтруктураИниФайла[СтрОбъекта];
							//ИмяПараметраДокумента           = Сред(ЗначениеПараметраТабличнойЧасти,2,Найти(ЗначениеПараметраТабличнойЧасти,"]")-2);
							//ЗначениеПараметраДокумента      = СтруктураИниФайла[ИмяПараметраДокумента];
							//не найден реквизит табличной части
							Возврат     сбисЗаписатьОшибкуИниФайла(ИмяПараметра,ЗначениеПараметра,"Не найден реквизит """+ИмяРек+""".",СтруктураИниФайла, СлужебнаяСтруктура, Объект1С,Объект1С.Имя,Объект1СПолноеИмя+"."+ИмяРек);
						КонецПопытки;
					КонецПопытки;
					
				Иначе
					
					Если Объект1СТип <> "" Тогда 
					
						Если Найти(Объект1СТип, ",") Тогда
							
							// составной объект
							Возврат Ложь;
							
						КонецЕсли;
							
						ОбъектМетаданных = Метаданные.НайтиПоТипу(Объект1СТип.Типы()[0]);
												
					ИначеЕсли Не Объект1С = Неопределено Тогда
						
						ОбъектМетаданных = Объект1С;
						
					Иначе
						
						Возврат сбисЗаписатьОшибкуИниФайла(ИмяПараметра,ЗначениеПараметра, "Составной тип реквизита: """+Объект1С.Имя+""". Невозможно проверить правильность параметра.",СтруктураИниФайла, СлужебнаяСтруктура);
						
					КонецЕсли;
					
					Попытка
						
						ТестОбъект1С = ПроверитьЗначениеПараметра_Объект1С(ОбъектМетаданных, ИмяРек, КэшПроверок);
						
					Исключение
						
						ОшибкаПроверки = ИнформацияОбОшибке();
						ТекстОшибки = "Ошибка проверки свойства """ + ИмяРек + """. " + ОшибкаПроверки.Причина;
						Возврат сбисЗаписатьОшибкуИниФайла(	ИмяПараметра,
															ЗначениеПараметра,
															ТекстОшибки,
															СтруктураИниФайла,
															СлужебнаяСтруктура,
															Объект1С,
															Объект1С.Имя,
															Объект1СПолноеИмя + "." + ИмяРек);
						
					КонецПопытки;
					
					Если Не ТестОбъект1С = Неопределено Тогда
						
						Возврат ТестОбъект1С;
						
					ИначеЕсли (Найти(Объект1СТип, ",")) Тогда
						
						Возврат Ложь;
						
					Иначе
						
						Возврат сбисЗаписатьОшибкуИниФайла(ИмяПараметра, ЗначениеПараметра, "Не найдено свойство """ + ИмяРек + """.", СтруктураИниФайла, СлужебнаяСтруктура, Объект1С,Объект1С.Имя,Объект1СПолноеИмя+"."+ИмяРек);
						
					КонецЕсли;
					
				КонецЕсли;
				
			Исключение
				
				Возврат сбисЗаписатьОшибкуИниФайла(ИмяПараметра, ЗначениеПараметра, "Не найден реквизит """+ИмяРек+""".",СтруктураИниФайла, СлужебнаяСтруктура, Объект1С,Объект1С.Имя,Объект1С.Имя+"."+ИмяРек);
				
			КонецПопытки;
		иначе
			Возврат ложь;
		КонецЕсли;
		
	ИначеЕсли ЗначениеПараметра = "Структура" Тогда
			
		Возврат Ложь;
			
	ИначеЕсли Найти(ЗначениеПараметра, "^") Тогда	
		
		//значение параметра  - формула
		Возврат Ложь;
		
	Иначе
		
		РезультатПроверкиОбъекта = ПроверитьЗначениеПараметра_Тип1С(ИмяПараметра, ЗначениеПараметра, СтруктураИниФайла, СлужебнаяСтруктура, КэшПроверок);
		Если Не РезультатПроверкиОбъекта = Неопределено Тогда
			
			Возврат РезультатПроверкиОбъекта;
			
		КонецЕсли;

	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция		ПроверитьЗначениеПараметра_Тип1С(ИмяПараметра, ЗначениеПараметра, СтруктураИниФайла, СлужебнаяСтруктура, КэшПроверок)
	
	КлючПроверить		=	НРег(ЗначениеПараметра); 
	ЭтоПростоеЗначение	= 	Лев(КлючПроверить, 1) = "'"
						Или	Лев(КлючПроверить, 1) = """"
						Или	КлючПроверить = "истина"
						Или КлючПроверить = "ложь";
						
	Если ЭтоПростоеЗначение Тогда
							
		Возврат Ложь;
	
	КонецЕсли;
	
	ОбъектИтог = КэшПроверок.Метаданные.Получить(КлючПроверить);
	Если Не ОбъектИтог = Неопределено Тогда
		
		Возврат ОбъектИтог;
		
	КонецЕсли;
							
	ЗначениеПроверить = СтрЗаменить(КлючПроверить, "'", "");
	ЗначениеПроверить = СтрЗаменить(ЗначениеПроверить, ".", Символы.ПС);
	Если Не СтрЧислоСтрок(ЗначениеПроверить) = 2 Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ЗначениеПроверитьМета = СтрПолучитьСтроку(ЗначениеПроверить, 1);
	Если Найти(ЗначениеПроверитьМета, "константа") Тогда
		
		СтрокаЗамена	 = "а константа";
		КлючМетаданных	 = "Константы";
		
	ИначеЕсли Найти(ЗначениеПроверитьМета, "перечисление") Тогда	

		СтрокаЗамена	 = "о перечисление";
		КлючМетаданных	 = "Перечисления";

	ИначеЕсли	Найти(ЗначениеПроверитьМета,"справочник")
			Или	Найти(ЗначениеПроверитьМета,"записьсправочника") Тогда	
		
		СтрокаЗамена	 = " справочник";
		КлючМетаданных	 = "Справочники";
		
	ИначеЕсли Найти(ЗначениеПроверитьМета,"документ") Тогда	

		СтрокаЗамена	 = " реестр документа";
		КлючМетаданных	 = "Документы";
		
	ИначеЕсли Найти(ЗначениеПроверитьМета,"регистрысведений") Тогда	

		СтрокаЗамена	 = " регистр сведений";
		КлючМетаданных	 = "РегистрыСведений";
		
	ИначеЕсли Найти(ЗначениеПроверитьМета,"регистрынакопления") Тогда	

		СтрокаЗамена	 = " регистр накопления";
		КлючМетаданных	 = "РегистрыНакопления";

	ИначеЕсли Найти(ЗначениеПроверитьМета,"планысчетов") Тогда

		СтрокаЗамена	 = " план счетов";
		КлючМетаданных	 = "ПланыСчетов";
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;

	ИмяРек				 = СтрПолучитьСтроку(ЗначениеПроверить, 2);
	МетаданныеПроверки	 = Метаданные[КлючМетаданных];
	ОбъектИтог			 = МетаданныеПроверки.Найти(ИмяРек);
	
	Если ОбъектИтог = Неопределено Тогда
		
		СтрокаПроблема = СтрЗаменить("Не найден{Замена}: """ + ЗначениеПараметра + """", "{Замена}", СтрокаЗамена);
		Возврат сбисЗаписатьОшибкуИниФайла(ИмяПараметра,ЗначениеПараметра, СтрокаПроблема, СтруктураИниФайла, СлужебнаяСтруктура, МетаданныеПроверки, КлючМетаданных);
		
	КонецЕсли;
	
	КэшПроверок.Метаданные.Вставить(КлючПроверить, ОбъектИтог);
	
	Возврат ОбъектИтог;
	
КонецФункции

&НаСервереБезКонтекста
Функция		ПроверитьЗначениеПараметра_Объект1С(Объект1С, ИмяРеквизита, КэшПроверки)
	
	ПараметрыПоиска			= КэшПроверки.Метаданные.Получить(Объект1С);
	КлючРеквизитаПроверка	= НРег(ИмяРеквизита);
	Если ПараметрыПоиска = Неопределено Тогда
		
		ПараметрыПоиска = Новый Структура("ОбщиеРеквизиты, Предопределенный, Места", Ложь, Ложь, Новый Массив);
		ПараметрыПоиска.Вставить("Проверено",				Новый Соответствие);
		ПараметрыПоиска.Вставить("СтандартныеРеквизиты",	Новый Массив);
		КэшПроверки.Метаданные.Вставить(Объект1С, ПараметрыПоиска);
		
		Если		Метаданные.Документы.Содержит(Объект1С) Тогда
			
			Для Каждого СтандартныйРеквизит Из Объект1С.СтандартныеРеквизиты Цикл 
				
				ПараметрыПоиска.СтандартныеРеквизиты.Добавить(НРег(СтандартныйРеквизит.Имя));
				
			КонецЦикла;

			ПараметрыПоиска.Места.Добавить(Объект1С.Реквизиты);
			ПараметрыПоиска.Места.Добавить(Объект1С.ТабличныеЧасти);
			
			СлужебныеРеквизиты = Новый Массив;
			СлужебныеРеквизиты.Добавить("уникальныйидентификатор");
			СлужебныеРеквизиты.Добавить("режимзаписидокумента");
			СлужебныеРеквизиты.Добавить("режимпроведениядокумента");
			СлужебныеРеквизиты.Добавить("отказотобработкидокумента");
			
			ПараметрыПоиска.Места.Добавить(СлужебныеРеквизиты);
			ПараметрыПоиска.ОбщиеРеквизиты = Истина;

		ИначеЕсли	Метаданные.Справочники.Содержит(Объект1С) Тогда
			
			Для Каждого СтандартныйРеквизит Из Объект1С.СтандартныеРеквизиты Цикл 
				
				ПараметрыПоиска.СтандартныеРеквизиты.Добавить(НРег(СтандартныйРеквизит.Имя));
				
			КонецЦикла;

			ПараметрыПоиска.Места.Добавить(Объект1С.Реквизиты);
			ПараметрыПоиска.Места.Добавить(Объект1С.ТабличныеЧасти);
			ПараметрыПоиска.Места.Добавить(Метаданные.ОбщиеРеквизиты);
			
			СлужебныеРеквизиты = Новый Массив;
			СлужебныеРеквизиты.Добавить("этогруппа");

			ПараметрыПоиска.Места.Добавить(СлужебныеРеквизиты);
			ПараметрыПоиска.ОбщиеРеквизиты		= Истина;
			ПараметрыПоиска.Предопределенный	= Истина;

		ИначеЕсли	Метаданные.РегистрыСведений.Содержит(Объект1С)
				Или	Метаданные.РегистрыНакопления.Содержит(Объект1С) Тогда
			
			ПараметрыПоиска.Места.Добавить(Объект1С.Реквизиты);
			ПараметрыПоиска.Места.Добавить(Объект1С.Ресурсы);
			ПараметрыПоиска.Места.Добавить(Объект1С.Измерения);

		ИначеЕсли	Метаданные.Перечисления.Содержит(Объект1С) Тогда
			
			ПараметрыПоиска.Места.Добавить(Объект1С.ЗначенияПеречисления);
			ПараметрыПоиска.Предопределенный = Истина;
			
		Иначе
			
			ВызватьИсключение "Неизвестный тип параметра.";
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТестПоиск = ПараметрыПоиска.Проверено.Получить(КлючРеквизитаПроверка);
	Если Не ТестПоиск = Неопределено Тогда
		
		Возврат ТестПоиск;
		
	КонецЕсли;
	
	ТестПоиск = ПараметрыПоиска.СтандартныеРеквизиты.Найти(КлючРеквизитаПроверка);
	Если Не ТестПоиск = Неопределено Тогда
		
		ТестПоиск = Объект1С.СтандартныеРеквизиты[ТестПоиск];
		
	КонецЕсли;
	
	Если	ТестПоиск = Неопределено Тогда

		Для Каждого МестоПоиска Из ПараметрыПоиска.Места Цикл
			
			ТестПоиск = МестоПоиска.Найти(КлючРеквизитаПроверка);
			Если Не ТестПоиск = Неопределено Тогда
				
				Прервать;
				
			КонецЕсли;
					
		КонецЦикла;
		
	КонецЕсли;
	
	Если	ТестПоиск = Неопределено
		И	ПараметрыПоиска.ОбщиеРеквизиты Тогда
		
		ОбщийРеквизит = Метаданные.ОбщиеРеквизиты.Найти(КлючРеквизитаПроверка);
		Если Не ОбщийРеквизит = Неопределено Тогда
			
			СоставОбщийРеквизит		= ОбщийРеквизит.Состав;
			ОбъектНайденВРеквизитах = СоставОбщийРеквизит.Найти(Объект1С);
			
			Если Не ОбъектНайденВРеквизитах = Неопределено
				И	(	ОбъектНайденВРеквизитах.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать
	            	Или (	СоставОбщийРеквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Авто
						И	ОбщийРеквизит.АвтоИспользование = Метаданные.СвойстваОбъектов.АвтоИспользованиеОбщегоРеквизита.Использовать)) Тогда
						
				ТестПоиск = ОбщийРеквизит;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если	ТестПоиск = Неопределено
		И	ПараметрыПоиска.Предопределенный Тогда
		
		Попытка 
			
			// После 8.3.18 вызывается исключение
			ТестПоиск = ПредопределенноеЗначение(Объект1С.ПолноеИмя() + "." + КлючРеквизитаПроверка);
			Если Не ЗначениеЗаполнено(ТестПоиск) Тогда
				
				ТестПоиск = Неопределено;
				
			КонецЕсли;
			
		Исключение
			
			ТестПоиск = Неопределено;
			
		КонецПопытки;
		
	КонецЕсли;
	
	ПараметрыПоиска.Проверено.Вставить(КлючРеквизитаПроверка, ТестПоиск);

	Возврат ТестПоиск;
	
КонецФункции

&НаСервереБезКонтекста
Функция		СбисТекстИсключениеПриПроверке(ИмяПараметра=Неопределено, ЗначениеПараметра=Неопределено, ТекстИсключения)
	СбисШаблонЗамены = "%Замена%";
	Если Найти(ТекстИсключения, СбисШаблонЗамены) Тогда
		Если ИмяПараметра = Неопределено Тогда
			Возврат (СтрЗаменить(ТекстИсключения, СбисШаблонЗамены, ""));			
		Иначе
			Возврат (СтрЗаменить(ТекстИсключения, СбисШаблонЗамены, СбисШаблонЗамены + ИмяПараметра + "."));
		КонецЕсли;
	Иначе
		//Возврат ("При обработке узла " + СбисШаблонЗамены + ИмяПараметра + " произошла неизвестная ошибка: " + ТекстИсключения);
		Возврат (ТекстИсключения + СбисШаблонЗамены + ИмяПараметра);
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция		СбисОшибкаПроверки(ИмяПараметра,ЗначениеПараметра,ТекстОшибки, Объект=Неопределено,ИмяОбъекта=Неопределено,ПолныйПуть = Неопределено)
	НоваяСтруктура = Новый Структура();
	НоваяСтруктура.Вставить("ИмяПараметра",			ИмяПараметра);
	НоваяСтруктура.Вставить("ЗначениеПараметра",	ЗначениеПараметра);
	НоваяСтруктура.Вставить("ТекстОшибки",			ТекстОшибки);
	НоваяСтруктура.Вставить("ИмяОбъекта",			ИмяОбъекта);
	НоваяСтруктура.Вставить("ПолныйПуть",			ПолныйПуть);
	
	Если Объект = Неопределено Тогда
		НоваяСтруктура.Вставить("ИнформацияПоОбъекту", Объект);
	ИначеЕсли ТипЗнч(Объект) = Тип("ОбъектМетаданных") Тогда				
		НоваяСтруктура.Вставить("ИнформацияПоОбъекту", Объект.ПолноеИмя());
	ИначеЕсли ТипЗнч(Объект) = Тип("КоллекцияОбъектовМетаданных") Тогда	
		СтруктураОбъект = Новый Структура();		
		Для СчМет = 0 по Объект.Количество()-1 Цикл
			СтруктураОбъект.Вставить(Объект.Получить(СчМет).Имя, Объект.Получить(СчМет).ПолноеИмя());
		КонецЦикла;	
		НоваяСтруктура.Вставить("ИнформацияПоОбъекту", СтруктураОбъект);
	КонецЕсли;
	Возврат НоваяСтруктура;	
КонецФункции

&НаСервереБезКонтекста
Функция		сбисЗаписатьОшибкуИниФайла(ИмяПараметра,ЗначениеПараметра,ТекстОшибки,СтруктураИниФайла, СлужебнаяСтруктура, Объект=Неопределено,ИмяОбъекта=Неопределено,ПолныйПуть = Неопределено)
	// добавляет в структуру файла настроек структуру с информацией об ошибке	
	
	НоваяСтруктура = СбисОшибкаПроверки(ИмяПараметра,ЗначениеПараметра,ТекстОшибки, Объект, ИмяОбъекта, ПолныйПуть);
	//СтруктураИниФайла.сбисОшибки.Добавить(НоваяСтруктура);
	Если ТипЗнч(СтруктураИниФайла[ИмяПараметра]) = Тип("Структура")
		И не СтруктураИниФайла[ИмяПараметра].Свойство("Ошибка") Тогда
		СлужебнаяСтруктура.Вставить("Ошибка", НоваяСтруктура);		
		СтруктураИниФайла[ИмяПараметра].Вставить("Ошибка", НоваяСтруктура);		
	КонецЕсли;
	Возврат Ложь;
КонецФункции	

&НаСервереБезКонтекста
Функция		ПроверитьЗначениеПараметраНаВычисление(ЗначениеПараметра)
	
	// Функция проверяет значение параметра, вычисляемого с помощью функции	
	ЗначениеПараметра = Сред(ЗначениеПараметра, 2, СтрДлина(ЗначениеПараметра) - 2);
	ПозицияТочки = Найти(ЗначениеПараметра, ".");
	Если  Найти(ЗначениеПараметра, ";") > 0 Тогда
		//В строке на вычисление не может быть ";"
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция		ВернутьТипСправочника(ОбъектТип) 
	// Получает объект метаданных справочника по типу	
	ид=0;
	Пока 1=1 Цикл
		Попытка
			ОбъектСпр=Метаданные.Справочники[ид];
		Исключение
			прервать;
		КонецПопытки;	
		темпСтр=ОбъектСпр.ПолноеИмя();
		ИмяРек=прав(темпСтр,СтрДлина(темпСтр)-11);
		ТипСтр=Тип("СправочникСсылка."+ИмяРек);
		Если ОбъектТип.СодержитТип(ТипСтр) Тогда
			возврат ОбъектСпр;
		КонецЕсли;	
		ид=ид+1;
	КонецЦикла;
	возврат Неопределено;
КонецФункции

&НаСервереБезКонтекста
Функция		СформироватьСтруктуруОшибкиУзла(Узел)
	// Рекурсивно проверяет, есть ли в узле структуры ошибка, формирует только структуру узлов, в которых есть ошибки	
	СтруктураОшибки	= Новый	Структура();
	ЕстьОшибка		= Ложь;
	
	Если ТипЗнч(Узел) <> Тип("Структура") Тогда
		Возврат СтруктураОшибки;
		//Возврат Ложь;
	КонецЕсли;
	
	Если Узел.Свойство("Ошибка") Тогда//ошибка, вернуть ошибочный узел
		Возврат	Узел;
		//Возврат Истина;
	КонецЕсли;	
	Для каждого ЭлементУзла из Узел Цикл		
		Если ТипЗнч(ЭлементУзла.Значение) = Тип("Структура") Тогда	
			Если ЭлементУзла.Значение.Свойство("Ошибка") Тогда
				СтруктураОшибки.Вставить(ЭлементУзла.Ключ, ЭлементУзла.Значение);
				Продолжить;
				//Возврат Истина;
			КонецЕсли;
			ВложенныеОшибки	=  СформироватьСтруктуруОшибкиУзла(ЭлементУзла.Значение);//Проверяем вложенный узел
			Если	ВложенныеОшибки.Количество()	Тогда 
				СтруктураОшибки.Вставить(ЭлементУзла.Ключ, ВложенныеОшибки);
				Если ЭлементУзла.Значение.Свойство("сбисПараметрыУзла") Тогда
					СтруктураОшибки[ЭлементУзла.Ключ].Вставить("сбисПараметрыУзла", ЭлементУзла.Значение.сбисПараметрыУзла);					
				КонецЕсли;
			КонецЕсли;
			//Если СформироватьСтруктуруОшибкиУзла(ЭлементУзла.Значение) Тогда //Проверяем вложенный узел
			//	Возврат Истина;
			//КонецЕсли;
		КонецЕсли;		
	КонецЦикла;	
	
	Возврат	СтруктураОшибки;
	
	//Возврат ЕстьОшибка;
	
КонецФункции

///////////////////////////////////////////////////
/////////////////Установка настроек////////////////
///////////////////////////////////////////////////

//Выполняет установку настроек, запускает проверку при необходимости
//ПараметрыУстановкиВходящие - Структура
//										СписокИни				- Устанавливаемые настройки
//										ПринудительнаяПроверка	- вычитывать и проверять всё, не смотря на флаги изменений.
//										ПродолжитьУстановку		- флаг того, что ошибок не было, но продолжать операции на ГО нет необходимости
//										ИдентификаторНастроек	- ИД настроек, по которому проводится установка
//										СтруктураНастроек		- СБИС параметры устанавливаемых настроек
&НаКлиенте
Процедура ВыполнитьУстановкуНастроек(ПараметрыУстановкиВходящие, ЛокальныйКэш) Экспорт
	Перем СтруктураПараметровСбис, СтруктураПараметровСбисИсходная, СказатьЧтоВсеХорошо, СбисДополнительныеПараметры, ИдентификаторНастроек;
	УстановленныеИниФайлы = ПараметрыУстановкиВходящие.СписокИни;
	Отказ = Ложь;
	Если УстановленныеИниФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//Признак принудительной проверкеи
	Если Не ПараметрыУстановкиВходящие.Свойство("ПринудительнаяПроверка", СказатьЧтоВсеХорошо) Тогда
		СказатьЧтоВсеХорошо = Ложь;
	КонецЕсли;
	//Пробрасываемый ИД настроек
	Если	Не	ПараметрыУстановкиВходящие.Свойство("ИдентификаторНастроек",	ИдентификаторНастроек)
		Или		ИдентификаторНастроек = Неопределено Тогда
		ИдентификаторНастроек = ЛокальныйКэш.Парам.ИдентификаторНастроек;
	КонецЕсли;
	//Пробрасываемые СБИС параметры
	Если	Не	ПараметрыУстановкиВходящие.Свойство("СтруктураНастроек", СтруктураПараметровСбис)
		Или		СтруктураПараметровСбис = Неопределено Тогда
		СтруктураПараметровСбис = ЛокальныйКэш.ФормаНастроек.ПолучитьПараметрыСБИС(ЛокальныйКэш, ИдентификаторНастроек, Отказ);
		Если Отказ Тогда
			МодульОбъектаКлиент().ВызватьСбисИсключение(СтруктураПараметровСбис, "ФайлыНастроекОбщее.ВыполнитьУстановкуНастроек");
		КонецЕсли;
	КонецЕсли;
	ПараметрыУстановкиВходящие.Свойство("ДополнительныеПараметры", СбисДополнительныеПараметры); 
	 
	НужнаПроверкаПоИзменениям	=	ЛокальныйКэш.ФормаНастроек.СбисОпределитьНеобходимостьПроверки(ЛокальныйКэш, УстановленныеИниФайлы, СтруктураПараметровСбис)
								Или	СказатьЧтоВсеХорошо;
	НеобходимоОбновление		=	ПараметрыУстановкиВходящие.Свойство("НеобходимоОбновление")
								И	ПараметрыУстановкиВходящие.НеобходимоОбновление
								Или	НужнаПроверкаПоИзменениям;
	
	ПараметрыУстановки = Новый Структура("НеобходимоОбновление", НеобходимоОбновление);
	Если НужнаПроверкаПоИзменениям Тогда  
		УстановленныеИниФайлы = ЛокальныйКэш.ФормаНастроек.сбисПроверитьУстановленныеНастройки(ЛокальныйКэш, ПараметрыУстановкиВходящие, ЛокальныйКэш.Ини, СтруктураПараметровСбис, ИдентификаторНастроек);
	ИначеЕсли УстановленныеИниФайлы.Количество() Тогда// если не проверяем, то считаем, что с ини все хорошо
		ЛокальныйКэш.КэшНастроек.ИниВПорядке = Истина;
	Иначе
		ЛокальныйКэш.КэшНастроек.ИниВПорядке = Ложь; 
	КонецЕсли;
	
	ЛокальныйКэш.ФормаНастроек.УстановитьПараметрыИнтеграции_УстановкаНастроек(ЛокальныйКэш, СтруктураПараметровСбис, СбисДополнительныеПараметры, Отказ);
	Если Не ЛокальныйКэш.КэшНастроек.ИниВПорядке Тогда
		Возврат;
	КонецЕсли;	
	Результат = СбисУстановитьВыбранныеНастройки(ЛокальныйКэш, ПараметрыУстановки, СбисДополнительныеПараметры, Отказ);
	Если Отказ Тогда
		ЛокальныйКэш.КэшНастроек.ИниВПорядке = Ложь;
		МодульОбъектаКлиент().ВызватьСбисИсключение(Результат, "ФайлыНастроекОбщее.ВыполнитьУстановкуНастроек");
	Иначе
		ЛокальныйКэш.ФормаНастроек.СбисУстановитьПараметры(ЛокальныйКэш,,СтруктураПараметровСбис);	
		ЛокальныйКэш.ФормаНастроек.СохранитьПараметрыСБИС(ЛокальныйКэш, СтруктураПараметровСбис, ИдентификаторНастроек);
		ЛокальныйКэш.Интеграция.УстановитьВидимостьОбновитьСтатусы(ЛокальныйКэш);
	КонецЕсли;
	
КонецПроцедуры

//Вызов получения и установки настроек
//ПараметрыУстановкиВходящие - Структура
//										ПринудительнаяПроверка	- вычитывать и проверять всё, не смотря на флаги изменений.
//										ПродолжитьУстановку		- флаг того, что ошибок не было, но продолжать операции на ГО нет необходимости
&НаКлиенте
Процедура СбисПолучитьИУстановитьНастройкиВКэш(ПараметрыУстановкиВходящие, ЛокальныйКэш) Экспорт
	Перем  ПринудительнаяПроверка;
	Попытка
		Если Не ПараметрыУстановкиВходящие.Свойство("ПродолжитьУстановку") Тогда
			ПараметрыУстановкиВходящие.Вставить("ПродолжитьУстановку", Истина);//Флаг для отслеживания необходимости установки ини и обновления окна. Для того, чтобы в некоторых случаях не выполнялось повторно.
		КонецЕсли;
		Если Не ПараметрыУстановкиВходящие.Свойство("ПринудительнаяПроверка", ПринудительнаяПроверка) Тогда
			ПринудительнаяПроверка = Ложь;
		КонецЕсли;
		Отказ = Ложь;
		//Настройки устанавливаются если ещё не были применены, либо если изменились параметры работы обработки. В остальных случаях, настройки не переустанавливаются
		УстановленныеИниФайлы = ЛокальныйКэш.ФормаНастроек.сбисПолучитьНастройки(ЛокальныйКэш, Отказ, ПараметрыУстановкиВходящие.ПродолжитьУстановку);
		Если Отказ Тогда
			Если УстановленныеИниФайлы = Неопределено Тогда
				Отказ = Ложь;
				УстановленныеИниФайлы = Новый СписокЗначений;
			Иначе
				//Если об ошибке не сообщили ранее.
				МодульОбъектаКлиент().ВызватьСбисИсключение(УстановленныеИниФайлы, "ФормаНастроек.СбисПолучитьНастройки");
			КонецЕсли;
		КонецЕсли;
		ПараметрыУстановкиНастроек = Новый Структура("ПринудительнаяПроверка, СписокИни", ПринудительнаяПроверка);
		Если Не УстановленныеИниФайлы = Неопределено Тогда
			
			ПараметрыУстановкиНастроек.СписокИни = УстановленныеИниФайлы.СписокФайлов;
			
		КонецЕсли;
		Если	ПринудительнаяПроверка
			Или	ПараметрыУстановкиВходящие.ПродолжитьУстановку  Тогда
			СбисУстановитьНастройки(ПараметрыУстановкиНастроек, ЛокальныйКэш);
		Иначе
			ЛокальныйКэш.ГлавноеОкно.СбисОбновитьИнформациюНастроекНаГлавномОкне(ЛокальныйКэш, ПараметрыУстановкиНастроек.СписокИни, Отказ);		
		КонецЕсли;
		МодульОбъектаКлиент().ОбновитьМеткиСтатусов(, ЛокальныйКэш);
	Исключение
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнформацияОбОшибке(), "ФайлНастроекОбщее.СбисПолучитьИУстановитьНастройкиВКэш");
	КонецПопытки;
КонецПроцедуры

// Обновление файлов настроек без поднятия версии под текущую конфигурацию
&НаКлиенте
Функция ОсвежитьФайлыНастроек(Кэш, Отказ) Экспорт

	ПараметрыОбновления = Новый Структура();
	ПараметрыОбновления.Вставить("КаталогНастроек",		Кэш.Парам.КаталогНастроек);
	ПараметрыОбновления.Вставить("Режим",				"Стандартный");
	ПараметрыОбновления.Вставить("Разделитель",			Кэш.ОбщиеФункции.СбисФорматРазделителя(Кэш.ПараметрыСистемы.Сервер));
	ПараметрыОбновления.Вставить("ВременныйКаталог",	Кэш.ОбщиеФункции.СбисФорматКаталога(Кэш.ОбщиеФункции.СбисКаталогВременныхФайловНаСервере(), Кэш.ПараметрыСистемы.Сервер));
	ПараметрыОбновления.Вставить("Конфигурация",		Кэш.ПараметрыСистемы.Конфигурация);
	ПараметрыОбновления.Вставить("ПродолжитьУстановку",	Истина);
	
	// Обновим файлы настроек без поднятия версии под текущую конфигурацию
	УстановленныеИниФайлы = Кэш.ФормаНастроек.ПолучитьОсвеженныеФайлыНастроек(Кэш, ПараметрыОбновления, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.СбисИсключение(УстановленныеИниФайлы, "ФормаНастроекОбщее.ОсвежитьФайлыНастроек");
	ИначеЕсли УстановленныеИниФайлы = Неопределено Тогда
		Возврат Истина;	
	КонецЕсли;
	
	ПараметрыУстановкиНастроек = Новый Структура("СписокИни", УстановленныеИниФайлы);
	
	// Проверяем (при необходимости) и устанавливаем настройки в кэш со всеми вытекающими
	Если	ПараметрыОбновления.ПродолжитьУстановку  Тогда
		СбисУстановитьНастройки(ПараметрыУстановкиНастроек, Кэш);
	Иначе
		Кэш.ГлавноеОкно.СбисОбновитьИнформациюНастроекНаГлавномОкне(Кэш, ПараметрыУстановкиНастроек.СписокИни, Отказ);		
	КонецЕсли;
	МодульОбъектаКлиент().ОбновитьМеткиСтатусов(, Кэш);
	
	Возврат Истина;
	
КонецФункции

//ПараметрыУстановкиВходящие - Структура
//										СписокИни				- Устанавливаемые настройки
//										ПринудительнаяПроверка	- вычитывать и проверять всё, не смотря на флаги изменений.
//										ПродолжитьУстановку		- флаг того, что ошибок не было, но продолжать операции на ГО нет необходимости
//										ИдентификаторНастроек	- ИД настроек, по которому проводится установка
//										СтруктураНастроек		- СБИС параметры устанавливаемых настроек
&НаКлиенте
Процедура СбисУстановитьНастройки(ПараметрыУстановкиВходящие, ЛокальныйКэш)  Экспорт
	Попытка
		ЛокальныйКэш.ГлавноеОкно.СбисПоказатьСостояние("Установка настроек");
		ВыполнитьУстановкуНастроек(ПараметрыУстановкиВходящие, ЛокальныйКэш);
		ЛокальныйКэш.ГлавноеОкно.СбисСпрятатьСостояние();
	Исключение
		ЛокальныйКэш.ГлавноеОкно.СбисСпрятатьСостояние();
		ЛокальныйКэш.КэшНастроек.ИниВПорядке = Ложь;
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнформацияОбОшибке(), "ФайлыНастроекОбщее.СбисУстановитьНастройки");		
	КонецПопытки;
КонецПроцедуры

//Вызывает установку настроек в кэше. Если все установлено, истина, если не устанавливалось, ложь. При ошибке - СбисИсключение
&НаКлиенте
Функция СбисУстановитьВыбранныеНастройки(Кэш, ПараметрыУстановки, ДополнительныеПараметры, Отказ) Экспорт
	Если Не Кэш.КэшНастроек.ИниВПорядке Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РезультатУстановки = Неопределено;
	//Проверка пройдена успешно, установим настройки.
	Если ПараметрыУстановки.НеобходимоОбновление Тогда
		//Надо обновить данные. Перезаполним меню аккордеона, параметры главного окна, изменим печатные формы
		РезультатУстановки = Кэш.ФормаНастроек.СбисОбновитьДанныеПоНастройкам(Кэш, ДополнительныеПараметры, Отказ);
		Если Отказ Тогда
			Возврат Кэш.ОбщиеФункции.СбисИсключение(РезультатУстановки, "ФормаНастроекОбщее.СбисУстановитьВыбранныеНастройки");
		КонецЕсли;
		РезультатУстановки = ОбновитьДанныеИни(Кэш.Ини, Отказ);
		Если Отказ Тогда
			МодульОбъектаКлиент().СбисСообщить(РезультатУстановки);
			Отказ = Ложь;
		КонецЕсли;
		
	КонецЕсли;

	Если Отказ Тогда
		//Не удалось создать ини для формирования аккордеона и параметров главного окна
		Возврат Кэш.ОбщиеФункции.СбисИсключение(РезультатУстановки, "ФормаНастроекОбщее.СбисУстановитьВыбранныеНастройки");
	КонецЕсли;
	
	Попытка
		
		РезультатУстановки = Кэш.ФормаНастроек.УстановитьИниКонфигурации(Кэш, ДополнительныеПараметры, Отказ);
		
	Исключение
		
		Отказ = Истина;
		Возврат МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "ФайлыНастроекОбщее.СбисУстановитьВыбранныеНастройки", 608);
		
	КонецПопытки;
	
	Если ПараметрыУстановки.Свойство("ИниСтруктурыРазделов") Тогда
		
		РезультатУстановки = УстановитьИниРазделов(Кэш, ПараметрыУстановки.ИниСтруктурыРазделов, ДополнительныеПараметры, Отказ);
		
	Иначе
		
		РезультатУстановки = Кэш.ФормаНастроек.УстановитьИниРазделов(Кэш, ДополнительныеПараметры, Отказ);
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.СбисИсключение(РезультатУстановки, "ФормаНастроекОбщее.СбисУстановитьВыбранныеНастройки");
	КонецЕсли;
	Если Кэш.ини.Свойство("ДополнительныеСведения") Тогда
		
		Если Кэш.ини.ДополнительныеСведения = Неопределено Тогда
			РезультатУстановки = Кэш.ФормаНастроек.Ини(Кэш, "ДополнительныеСведения",,Отказ);
			
			Если Отказ Тогда
				Возврат Кэш.ОбщиеФункции.СбисИсключение(РезультатУстановки, "ФормаНастроекОбщее.УстановитьИниДопСведений");
			КонецЕсли;
			
		Иначе
			РезультатУстановки = Кэш.ини.ДополнительныеСведения;
		КонецЕсли;

		РезультатУстановки = УстановитьИниДопСведений(Кэш, РезультатУстановки, Отказ);
		
		Если Отказ Тогда
			МодульОбъектаКлиент().СбисСообщить(РезультатУстановки);
			Отказ = Ложь;
			//Возврат Кэш.ОбщиеФункции.СбисИсключение(РезультатУстановки, "ФормаНастроекОбщее.УстановитьИниДопСведений");
		КонецЕсли;
		
	КонецЕсли;    
	
	ПараметрыBlockly = Новый Структура("Доступно_ТорговаяСеть_list");
	
	Попытка
		
		ФункцииДокументов = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
		ПараметрыВызоваBlockly = ФункцииДокументов.СкопироватьОбъектСПараметрамиКлиент(Кэш.ГлавноеОкно.context_params);
		ПараметрыВызоваBlockly.Вставить("params", ФункцииДокументов.СкопироватьОбъектСПараметрамиКлиент(Кэш.ГлавноеОкно.context_params));
		Ини_ТорговаяСеть_list = Кэш.ГлавноеОкно.BlocklyExecutor.Load_ini("ТорговаяСеть_list", ПараметрыВызоваBlockly);
		ПараметрыBlockly.Доступно_ТорговаяСеть_list = Истина;
	
	Исключение
		ПараметрыBlockly.Доступно_ТорговаяСеть_list = Ложь;
	КонецПопытки;
	
	МодульОбъектаКлиент().ИзменитьПараметрТекущегоСеанса("ПараметрыBlockly", ПараметрыBlockly);
	
	Возврат Истина;
	
КонецФункции

//Дополниетльные свойства

///////////////////////////////////////////////////
/////////////////Включение настроек////////////////
///////////////////////////////////////////////////

// Процедура проверяет наличие отмеченных файлов и при необходимости задает вопрос о замене 	
&НаКлиенте
Процедура	сбисУстановитьФайлыНастроек(Кэш)												Экспорт
	
	ПараметрыОтбора	= Новый Структура();
	ПараметрыОтбора.Вставить("Фл",				Истина);
	Если	Не	ТабДоступныеИниФайлы.НайтиСтроки(ПараметрыОтбора).Количество()	Тогда//Отмеченных для переноса ини нет
		ПараметрыОтбора.Удалить("Фл");
	КонецЕсли;
	ПараметрыОтбора.Вставить("ЕстьФайлНастроек",	Истина);
	
	СтрокиОтмеченыУстановлены	= ТабДоступныеИниФайлы.НайтиСтроки(ПараметрыОтбора);
	
	ПараметрыОтбора.Вставить("ЕстьФайлНастроек",	Ложь);
	СтрокиОтмеченыНеУстановлены	= ТабДоступныеИниФайлы.НайтиСтроки(ПараметрыОтбора);
				
	ДопПараметры	= Новый	Структура();
	ДопПараметры.Вставить("СтрокиОтмеченыУстановлены",		СтрокиОтмеченыУстановлены);
	ДопПараметры.Вставить("СтрокиОтмеченыНеУстановлены",	СтрокиОтмеченыНеУстановлены);
	ДопПараметры.Вставить("Кэш",					Кэш);
	Если СтрокиОтмеченыУстановлены.Количество() Тогда
		ТекстВопроса	= "Заменить установленные файлы?";
		Кнопки			= РежимДиалогаВопрос.ДаНетОтмена;
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Ответ	= Вопрос(ТекстВопроса, Кнопки);
			сбисУстановитьФайлыНастроекЗавершение(Ответ, ДопПараметры);
		#Иначе
			ПоказатьВопрос(Новый ОписаниеОповещения("сбисУстановитьФайлыНастроекЗавершение",ЭтаФорма,ДопПараметры),ТекстВопроса, Кнопки, 0);
		#КонецЕсли
	Иначе
		сбисУстановитьФайлыНастроекЗавершение(КодВозвратаДиалога.ДА, ДопПараметры)
	КонецЕсли;
	
КонецПроцедуры

// Процедура формирует структуру файлов для установки и вызывает серверную процедуру установки настроек 	
&НаКлиенте
Процедура	сбисУстановитьФайлыНастроекЗавершение(Ответ, ДопПараметры)								Экспорт
	
	Отказ	= Ложь;
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиОтмеченыУстановлены	= ДопПараметры.СтрокиОтмеченыУстановлены;
	СтрокиОтмеченыНеУстановлены	= ДопПараметры.СтрокиОтмеченыНеУстановлены;
	
	МассивФайловДляУстановки = Новый Массив;
	
	Для Каждого строка Из	СтрокиОтмеченыНеУстановлены	Цикл
		СтруктураДанныхДляУстановки = Новый Структура;
		СтруктураДанныхДляУстановки.Вставить("ИмяФайлаИсточника",	Строка.ПолноеИмя);
		СтруктураДанныхДляУстановки.Вставить("ИмяФайлаПриемника",	Строка.ИмяФайла);
		СтруктураДанныхДляУстановки.Вставить("ДобавлятьВАрхив",		Ложь);
		МассивФайловДляУстановки.Добавить(СтруктураДанныхДляУстановки);
	КонецЦикла;
	
	Если Ответ = КодВозвратаДиалога.Да	Тогда
		Для Каждого строка Из	СтрокиОтмеченыУстановлены	Цикл
			СтруктураДанныхДляУстановки = Новый Структура;
			СтруктураДанныхДляУстановки.Вставить("ИмяФайлаИсточника",	Строка.ПолноеИмя);
			СтруктураДанныхДляУстановки.Вставить("ИмяФайлаПриемника",	Строка.ИмяФайла);
			СтруктураДанныхДляУстановки.Вставить("ДобавлятьВАрхив",		Истина);
			МассивФайловДляУстановки.Добавить(СтруктураДанныхДляУстановки);
		КонецЦикла;
	КонецЕсли;	     

	Кэш.ФормаНастроек.сбисУстановитьВыбранныеФайлыНастроек(МассивФайловДляУстановки, Кэш, Кэш.Парам.ИдентификаторНастроек, Отказ);
	СбисОбновитьТаблицыИниФайлов(, Отказ); 
	Оповестить("ИзменилсяСоставФайловИни");
	
КонецПроцедуры

//Процедура формирует структуру для формирования аккордеона и заполнения фильтров
&НаКлиенте
Функция		сбисСформироватьСтруктуруРазделов(Кэш, СтруктураНастроек, сбисДополнительныеПараметры) Экспорт
	Перем ВложениеТип;
	
	СтруктураРезультат = Новый Структура;
	
	ОбработатьТипы		= Ложь;
	КлючиДляТипов		= Новый Массив;
	ПараметрыДляТипов	= Новый Массив;
	КлючиДляТипов.Добавить(Неопределено);
	ПараметрыДляТипов.Добавить(Новый Структура("Значение", ""));
	Если сбисДополнительныеПараметры.Свойство("ОбработкаТипов") Тогда
		Для Каждого КлючИЗначение Из сбисДополнительныеПараметры.ОбработкаТипов Цикл
			КлючиДляТипов.Добавить(Тип(КлючИЗначение.Ключ));
			ПараметрыДляТипов.Добавить(КлючИЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	НаборПакетовДляЗаполнить	= МодульОбъектаКлиент().НовыйНаборПакетов(Новый Структура);
	СоответсвиеКнопкиПоИни		= Новый Соответствие;
	Для Каждого ТипДокумента Из СтруктураНастроек Цикл
		НазваниеРазделаВИни = Кэш.ОбщиеФункции.РассчитатьЗначение("ДокументРаздел", ТипДокумента.Значение);
		ТипВложенийРеестра			= "";
		НаправлениеВложенийРеестра	= "";
		ТипИниРеестра				= "";

		СтруктураКнопкиРаздела = Новый Структура;
		СтруктураКнопкиРаздела.Вставить("Реестр1С_Тип",									Кэш.ОбщиеФункции.РассчитатьЗначение("Реестр1С_Тип",				ТипДокумента.Значение));
		СтруктураКнопкиРаздела.Вставить("Реестр1С_Название",							Кэш.ОбщиеФункции.РассчитатьЗначение("Реестр1С_Название",		ТипДокумента.Значение));
		СтруктураКнопкиРаздела.Вставить("Реестр1С_Меню",								Кэш.ОбщиеФункции.РассчитатьЗначение("Реестр1С_Меню",			ТипДокумента.Значение));
		СтруктураКнопкиРаздела.Вставить("Реестр1С_МенюЗаголовок",						Кэш.ОбщиеФункции.РассчитатьЗначение("Реестр1С_МенюЗаголовок",	ТипДокумента.Значение));
		СтруктураКнопкиРаздела.Вставить("Реестр1С_МетодНаАктивацию",					Кэш.ОбщиеФункции.РассчитатьЗначение("Реестр1С_МетодНаАктивацию",ТипДокумента.Значение));
		СтруктураКнопкиРаздела.Вставить("РеестрПоУмолчанию",							Кэш.ОбщиеФункции.РассчитатьЗначение("РеестрПоУмолчанию",		ТипДокумента.Значение)="1");
		СтруктураКнопкиРаздела.Вставить("РеестрСБИС_Тип",								Кэш.ОбщиеФункции.РассчитатьЗначение("РеестрСБИС_Тип",			ТипДокумента.Значение));
		СтруктураКнопкиРаздела.Вставить("Документ",										Кэш.ОбщиеФункции.РассчитатьЗначение("Документ",					ТипДокумента.Значение));
		СтруктураКнопкиРаздела.Вставить("ЕстьЗапросРеестра",		ЗначениеЗаполнено(	Кэш.ОбщиеФункции.РассчитатьЗначение("ЗапросСпискаДокументов",	ТипДокумента.Значение)));
		СтруктураКнопкиРаздела.Вставить("ЕстьСправочникТип",		ЗначениеЗаполнено(	Кэш.ОбщиеФункции.РассчитатьЗначение("СправочникТип",			ТипДокумента.Значение)));
		
		//Для настроек без раздела (на загрузку), собрать список поддерживаемых типов 1С
		ПараметрыИни				= ОпределитьПараметрыИни(Кэш, ТипДокумента.Значение, ТипДокумента.Ключ);
		ТипИниРеестра				= ПараметрыИни.Тип;
		НаправлениеВложенийРеестра	= ПараметрыИни.Направление;
			
		Если	ТипДокумента.Значение.Свойство("мФайл") Тогда
			
			// Для ини выгрузки потребуется сделать расчет как по документу, чтобы сработали опции переключений форматов
			ИниДляОпределенияТипа	= Новый Структура("мФайл", Новый Структура);
			Для Каждого КлючИЗначение Из ТипДокумента.Значение.мФайл Цикл
				
				Если Не КлючИЗначение.Значение.Свойство("Вложение_Тип", ВложениеТип) Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				УзелИниДляРасчета = Новый Структура("Вложение_Тип", ВложениеТип);
				ИниДляОпределенияТипа.мФайл.Вставить(КлючИЗначение.Ключ, УзелИниДляРасчета);
				
			КонецЦикла;
			
			Если ИниДляОпределенияТипа.Количество() Тогда
				
				ЗначениеВставить = Новый ФиксированнаяСтруктура("Объект, Ини", ТипДокумента.Ключ, ИниДляОпределенияТипа);
				МодульОбъектаКлиент().НаборПакетов_Вставить(НаборПакетовДляЗаполнить, ЗначениеВставить, "ОбъектРассчитать");
				СоответсвиеКнопкиПоИни.Вставить(ТипДокумента.Ключ, СтруктураКнопкиРаздела);
				
			КонецЕсли;
				
		КонецЕсли;
				
		Если	НазваниеРазделаВИни = Неопределено Тогда
				НазваниеРазделаВИни = "БезРаздела";
				
			Если	СтруктураКнопкиРаздела.Реестр1С_Тип = Неопределено
				И	ТипДокумента.Значение.Свойство("мДокумент") Тогда
				
				СтруктураКнопкиРаздела.Реестр1С_Тип = ",";
				Для Каждого мДокументКлючИЗначение Из ТипДокумента.Значение.мДокумент Цикл
					ДокументТип = Кэш.ОбщиеФункции.РассчитатьЗначение("Документ", мДокументКлючИЗначение.Значение);
					ДокументТип = Сред(ДокументТип, Найти(ДокументТип, ".") + 1) + ",";
					Если Не Найти(СтруктураКнопкиРаздела.Реестр1С_Тип, "," + ДокументТип) Тогда
						СтруктураКнопкиРаздела.Реестр1С_Тип = СтруктураКнопкиРаздела.Реестр1С_Тип + ДокументТип;
					КонецЕсли;
				КонецЦикла;
				СтруктураКнопкиРаздела.Реестр1С_Тип = Сред(СтруктураКнопкиРаздела.Реестр1С_Тип, 2, СтрДлина(СтруктураКнопкиРаздела.Реестр1С_Тип) - 2);
				
			КонецЕсли;
			
			Если ПараметрыИни.Тип = "Загрузка" Тогда
				
				ТипВложенийРеестра = ПараметрыИни.ТипВложенияSABY;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СтруктураКнопкиРаздела.Вставить("РеестрСБИС_ТипВложений",			ТипВложенийРеестра);		
		СтруктураКнопкиРаздела.Вставить("РеестрСБИС_ТипИниРеестра",			ТипИниРеестра);		
		СтруктураКнопкиРаздела.Вставить("РеестрСБИС_НаправлениеВложений",	НаправлениеВложенийРеестра);		
		
		Для Каждого ЭлементРаздела Из СтруктураКнопкиРаздела Цикл
			сбисИндекс = КлючиДляТипов.Найти(ЭлементРаздела.Значение);
			Если сбисИндекс = Неопределено Тогда
				сбисИндекс = КлючиДляТипов.Найти(ТипЗнч(ЭлементРаздела.Значение));
			КонецЕсли;
			Если сбисИндекс = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ПараметрЗамены = Неопределено;
			Если		ПараметрыДляТипов[сбисИндекс].Свойство("Значение", ПараметрЗамены) Тогда
				СтруктураКнопкиРаздела[ЭлементРаздела.Ключ] = ПараметрЗамены;
			ИначеЕсли	ПараметрыДляТипов[сбисИндекс].Свойство("Формат", ПараметрЗамены) Тогда
				СтруктураКнопкиРаздела[ЭлементРаздела.Ключ] = Формат(ЭлементРаздела.Значение, ПараметрЗамены);
			КонецЕсли;
		КонецЦикла;
				
		МассивРазделов = СтрЗаменить(НазваниеРазделаВИни,",", Символы.ПС);			
		Для НомерСтрокиРазделов = 1 По СтрЧислоСтрок(МассивРазделов) Цикл
			сбисИмяРаздела		= СокрЛП(СтрПолучитьСтроку(МассивРазделов, НомерСтрокиРазделов));
			сбисЗначениеРаздела	= Неопределено;
			Если Не СтруктураРезультат.Свойство(сбисИмяРаздела, сбисЗначениеРаздела) Тогда
				сбисЗначениеРаздела = Новый Структура("Параметры, Список", Новый Структура, Новый Структура);
				СтруктураРезультат.Вставить(сбисИмяРаздела, сбисЗначениеРаздела);
			КонецЕсли;
			сбисЗначениеРаздела.Список.Вставить(ТипДокумента.Ключ, СтруктураКнопкиРаздела);
		КонецЦикла;
	КонецЦикла;
	
	МодульФункций		= МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	СоответствиеДанные	= МодульОбъектаКлиент().НаборПакетов_СоответствиеДанных(НаборПакетовДляЗаполнить);
	
	// получаем на сервере все данные по документам пакета по файлам настроек
	МодульФункций.ПолучитьДанныеДокументов1С(	СоответствиеДанные,
												Новый Структура,
												НаборПакетовДляЗаполнить.Данные.ФорматныеФайлы);
												
	Для Каждого КлючИЗначениеПрочитано Из СоответствиеДанные Цикл											
		
		КнопкаЗначение	= СоответсвиеКнопкиПоИни.Получить(КлючИЗначениеПрочитано.Ключ);
		
		ТипВложенийСБИС = "";
		
		Для Каждого мФайлПосчитан Из КлючИЗначениеПрочитано.Значение.ДокументДанные.мФайл Цикл
			
			ТипВложенийСБИС = ТипВложенийСБИС + "," + МодульФункций.РассчитатьЗначение("Вложение_Тип", мФайлПосчитан.Значение);
			
		КонецЦикла;
		
		КнопкаЗначение.РеестрСБИС_ТипВложений = Сред(ТипВложенийСБИС, 2);
		
	КонецЦикла;
		
	Возврат СтруктураРезультат;
	
КонецФункции

&НаКлиенте
Функция		УстановитьПараметрыИнтеграции_УстановкаНастроек(Кэш, СтруктурасбисПараметров, ДополнительныеПараметры, Отказ) Экспорт
	
	//_ВремяОжидания = Кэш.ОбщиеФункции.РассчитатьЗначение("ВремяОжиданияОтвета", СтруктурасбисПараметров, Кэш);
	//Если ЗначениеЗаполнено(_ВремяОжидания) Тогда
	//	Если Не ТипЗнч(_ВремяОжидания) = Тип("Число") Тогда//Пробуем привести к числу
	//		Попытка
	//			_ВремяОжидания = Число(_ВремяОжидания);
	//		Исключение
	//			_ВремяОжидания = Неопределено;
	//		КонецПопытки;
	//	КонецЕсли;
	//	Если ТипЗнч(_ВремяОжидания) = Тип("Число") Тогда
	//		Кэш.Интеграция.сбисУстановитьВремяОжидания(Кэш, _ВремяОжидания);
	//	КонецЕсли;
	//КонецЕсли;
	Возврат Истина;
	
КонецФункции

///////////////////////////////////////////////////
////////////////Отключение настроек////////////////
///////////////////////////////////////////////////

&НаКлиенте
Процедура УдалитьИниФайлы(Элемент)

	сбисОтключитьФайлыНастроек();

КонецПроцедуры

&НаКлиенте
Функция	сбисОтключитьФайлыНастроек(ФайлыУдалить = Неопределено) Экспорт
	
	// Удаляет выбранные файлы настроек	
	Отказ			= Ложь;
	ПараметрыОтбора	= Новый Структура("Фл", Истина);
	
	Если ФайлыУдалить = Неопределено Тогда
		ФайлыУдалить = ТабУстановленныеИниФайлы.НайтиСтроки(ПараметрыОтбора);
	КонецЕсли;       
	
	Если Не ФайлыУдалить.Количество() Тогда
		ФайлыУдалить = ТабУстановленныеИниФайлы;
	КонецЕсли;
	
	СписокИниКОтключению = Новый СписокЗначений;
	Для Каждого ИниФайл Из ФайлыУдалить Цикл
		СписокИниКОтключению.Добавить(ИниФайл.ИмяФайла, "sbis3");
		Если	ИниФайл.ЕстьИзменения
			И	Кэш.Парам.СпособХраненияНастроек = 0 Тогда
			СписокИниКОтключению.Добавить(СтрЗаменить(СтрЗаменить(ИниФайл.ИмяФайла, ".sbis3", ""), ".0", ""));
		КонецЕсли;							
	КонецЦикла;
	
	УстановленныеИни = Кэш.ФормаНастроек.сбисОтключитьВыбранныеФайлыНастроек(СписокИниКОтключению, Кэш, Кэш.Парам.ИдентификаторНастроек, Отказ);
	
	Попытка
		СбисУстановитьНастройки(Новый Структура("ПринудительнаяПроверка, НеобходимоОбновление, СписокИни", Ложь, Истина, УстановленныеИни), Кэш);
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		Кэш.ГлавноеОкно.СбисСообщитьОбОшибке(Кэш, МодульОбъектаКлиент().НовыйСбисИсключение(ИнфоОбОшибке, "ФайлыНастроекСервер.сбисОтключитьФайлыНастроек"), Новый Структура("ФормаВладелец", Кэш.ФормаНастроекОбщее));		
	КонецПопытки;
	
	сбисОбновитьТаблицыИниФайлов(УстановленныеИни, Отказ); 
	Оповестить("ИзменилсяСоставФайловИни");
	
КонецФункции

///////////////////////////////////////////////////
////////////Сопоставление номенклатуры/////////////
///////////////////////////////////////////////////

&НаСервереБезКонтекста
Функция		ПолучитьПараметрыСопоставленияНаСервере(СтруктураСБИСПараметров)
	
	Если	Метаданные.Константы.Найти("ИспользоватьХарактеристикиНоменклатуры")<>Неопределено
		И	Константы.ИспользоватьХарактеристикиНоменклатуры.Получить() = Истина Тогда 
		Возврат Новый Структура();
	КонецЕсли;
	
	Возврат	Новый Структура("РеквизитСопоставленияНоменклатуры", "Код");
	
КонецФункции

