
&НаКлиенте
Функция ЗаписьЛогаSABY_Выгрузить(ЗаписьЛогаSABY, ВариантыВыгрузки = Неопределено)
	
	СбисФорматЛога		= "{Время}{Тип} {Вызов} {Идентификатор} {Сообщение}";
	СбисИмяВызова		= ЗаписьЛогаSABY.Вызов;
	СбисВремяЛога		= ЗаписьЛогаSABY.Время;
	ОбъектСообщенияЛога	= ЗаписьЛогаSABY.Сообщение;
	СбисТипСообщения	= ЗаписьЛогаSABY.Тип;
	СбисИдЛога			= ЗаписьЛогаSABY.Идентификатор;
	
	СтрокаНаВывод = СтрЗаменить(СтрЗаменить(СтрЗаменить(СбисФорматЛога, 
		"{Время}",		яЗаписьЛогаSABY_МетодКласса_ДополнитьСтроку(Формат(СбисВремяЛога, "ДФ=HH:mm:ss"),10)),
		"{Тип}",		яЗаписьЛогаSABY_МетодКласса_ДополнитьСтроку(СбисТипСообщения, 15)),
		"{Сообщение}",	СбисРаботаСJSON.ПреобразоватьЗначениеВJSON(ОбъектСообщенияЛога, Новый Структура("Режим", "Лог")));
	Если ЗначениеЗаполнено(СбисИдЛога) Тогда
		
		СтрокаНаВывод = СтрЗаменить(СтрЗаменить(СтрокаНаВывод, 
		"{Вызов}",			яЗаписьЛогаSABY_МетодКласса_ДополнитьСтроку(СбисИмяВызова, 40)),
		"{Идентификатор}",	яЗаписьЛогаSABY_МетодКласса_ДополнитьСтроку(СбисИдЛога, 50));
		
	Иначе
		
		СтрокаНаВывод = СтрЗаменить(СтрЗаменить(СтрокаНаВывод, 
		"{Вызов}",			яЗаписьЛогаSABY_МетодКласса_ДополнитьСтроку(СбисИмяВызова, 90)),
		"{Идентификатор}",	"");
		
	КонецЕсли;
	
	Возврат СтрокаНаВывод;
	
КонецФункции

