
&НаКлиенте
Процедура яЗаписьЛогаSABY_Заполнить(ЗаписьЛогаSABY, ЗаписьПараметра)
	
	СкрытьДанные = Ложь;
	
	Если ТипЗнч(ЗаписьПараметра) = Тип("ФиксированнаяСтруктура") Тогда
		
		ЗаписьЛогаSABY.Модуль = ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя"); 
		ЗаполнитьЗначенияСвойств(ЗаписьЛогаSABY, ЗаписьПараметра);
		
		Если		ЗаписьПараметра.Свойство("Команда")
			И	Не	ЗаписьПараметра.Команда = Неопределено Тогда
			
			яЗаписьЛогаSABY_Заполнить(ЗаписьЛогаSABY, ЗаписьПараметра.Команда);
			СкрытьДанные = АсинхроннаяСбисКоманда_Получить(ЗаписьПараметра.Команда, "СкрытьДанные");
			
		КонецЕсли;
		
		Если ЗаписьПараметра.Свойство("Событие") Тогда
			
			яЗаписьЛогаSABY_Заполнить(ЗаписьЛогаSABY, ЗаписьПараметра.Событие);

		КонецЕсли;
		
		Если		СкрытьДанные
			И НЕ	НРег(ЗаписьЛогаSABY.Тип) = "criticalerror" Тогда
			
			ЗаписьЛогаSABY.Сообщение = Неопределено;
			
		КонецЕсли;
				 
	ИначеЕсли	ЗаписьПараметра.Свойство("Исключение") Тогда
		
		яЗаписьЛогаSABY_Заполнить(ЗаписьЛогаSABY, ЗаписьПараметра.Исключение);
		Если	ЗаписьПараметра.Свойство("Идентификатор")
			И	ЗначениеЗаполнено(ЗаписьПараметра.Идентификатор) Тогда
			
			// По-умолчанию, ид в логе для исключения - код ошибки.
			ЗаписьЛогаSABY.Идентификатор = ЗаписьПараметра.Идентификатор;
			
		КонецЕсли;
		
	ИначеЕсли	ЭтоТипСбис(ЗаписьПараметра, "АсинхроннаяСбисКоманда") Тогда
		
		// Если просто вызов команды, заполнить все что есть по данным команды.
		ЗаписьЛогаSABY.Модуль		 = ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		ЗаписьЛогаSABY.Вызов		 = АсинхроннаяСбисКоманда_Получить(ЗаписьПараметра, "ИмяВызова");
		ЗаписьЛогаSABY.Идентификатор = АсинхроннаяСбисКоманда_Получить(ЗаписьПараметра, "Идентификатор");
		ЗаписьЛогаSABY.Сообщение	 = АсинхроннаяСбисКоманда_Получить(ЗаписьПараметра, "АргументВызова");
		ЗаписьЛогаSABY.Время		 = АсинхроннаяСбисКоманда_Получить(ЗаписьПараметра, "ВремяВызова");
		ЗаписьЛогаSABY.Тип			 = "CALL";
		
	ИначеЕсли	ЭтоТипСбис(ЗаписьПараметра, "АсинхронноеСбисСобытие") Тогда
		
		// Если просто запись события, заполнить все что есть по данным события.
		ЗаписьЛогаSABY.Модуль		 = ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		ЗаписьЛогаSABY.Идентификатор = АсинхронноеСбисСобытие_Получить(ЗаписьПараметра, "Идентификатор");
		ЗаписьЛогаSABY.Сообщение	 = АсинхронноеСбисСобытие_Получить(ЗаписьПараметра, "Данные");
		ЗаписьЛогаSABY.Время		 = АсинхронноеСбисСобытие_Получить(ЗаписьПараметра, "Получено");
		ЗаписьЛогаSABY.Тип			 = АсинхронноеСбисСобытие_Получить(ЗаписьПараметра, "Тип");

	ИначеЕсли	ЭтоТипСбис(ЗаписьПараметра, "СбисИсключение") Тогда
		
		Если ЗаписьПараметра.methodName = Неопределено Тогда
			
			Если ЗначениеЗаполнено(ЗаписьПараметра.stack) Тогда
				
				СбисПолноеИмяМетода = ЗаписьПараметра.stack[0].methodName;
				
			Иначе
				
				СбисПолноеИмяМетода = "НеизвестныйМодуль.НеизвестныйМетод"
				
			КонецЕсли;	
			
		Иначе
			
			СбисПолноеИмяМетода = ЗаписьПараметра.methodName;
				
		КонецЕсли;
			
		ЗаписьЛогаSABY.Модуль		 = СтрПолучитьСтроку(СтрЗаменить(СбисПолноеИмяМетода, ".", Символы.ПС), 1);
		ЗаписьЛогаSABY.Вызов		 = Сред(СбисПолноеИмяМетода, СтрДлина(ЗаписьЛогаSABY.Модуль) + 2);
		ЗаписьЛогаSABY.Сообщение	 = ЗаписьПараметра;
		ЗаписьЛогаSABY.Тип			 = "ERROR";
		ЗаписьЛогаSABY.Идентификатор = Строка(ЗаписьПараметра.code) + Строка(ЗаписьПараметра.extCode);
		
	Иначе
		
		ЗаполнитьЗначенияСвойств(ЗаписьЛогаSABY, ЗаписьПараметра);  
		
		СкрытьДанные = ЗаписьПараметра.Свойство("ПараметрыСобытия")
			И ЗаписьПараметра.ПараметрыСобытия.Свойство("ОчиститьПараметры", СкрытьДанные)
			И СкрытьДанные;		
				
		Если СкрытьДанные
			И НЕ НРег(ЗаписьЛогаSABY.Тип) = "criticalerror" Тогда
			
			ЗаписьЛогаSABY.Сообщение = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

