
&НаКлиенте
Процедура МассоваяОперация_БазоваяОтправка_УстановитьСценарий(РезультатОтправки, ПараметрыДляШаблон) Экспорт
    Перем ПараметрыДополнительно, ПараметрЗначение, СоставПакетаГотовый;
	
	ЦепочкаКомандОбработки	= ПараметрыДляШаблон.ЦепочкаКомандОбработки;
	ПараметрыСценария		= ПараметрыДляШаблон.ПараметрыСценария;     
	
	// Готовый документ не требуется перечитывать. Отправить его как он есть.
	Если	ПараметрыСценария.Свойство("СоставПакета", СоставПакетаГотовый)
		И	ЭтоТипСбис(СоставПакетаГотовый, "СоставПакета") Тогда
		
		ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "СоставПакета", СоставПакетаГотовый);
		ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "МассоваяОперация_Асинх_ПодготовитьОтправку", СоставПакетаГотовый);
		Возврат;
		
	КонецЕсли;
	
	ПараметрыВходящие = ПараметрыДляШаблон.ПараметрыВходящие;
	
	// Подготовим запуск команды на Подготовить структуру. В случае, если это черновик команда удалится
	ПараметрыПодготовить = МассоваяОперация_ПодготовитьСтруктуруДокумента_Параметры(РезультатОтправки, ПараметрыСценария);
	
	// Установить основание генерации, может потребоваться при обработке ошибок и пр.
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "ОснованиеГенерацииСоставПакета", ПараметрыПодготовить.Аргумент.СоставПакета);
	ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "МассоваяОперация_Асинх_ПодготовитьСтруктуруДокумента", ПараметрыПодготовить);
	// Цепочку на отправку не устанавливаем, т.к. в процессе генерации может быть сформировано больше одного пакета и по каждому будет своя отправка

КонецПроцедуры

&НаКлиенте
Функция МассоваяОперация_ПодготовитьСтруктуруДокумента_Параметры(РезультатОтправки, ПараметрыВходящие)
	Перем ПараметрыДополнительно;
	
	// Это не готовый документ, проверить запуск подготовки документа
	ПараметрыПодготовить	= Новый Структура("МодульПодготовки, ИмяПослеФормирования");
	АргументДляПодготовить	= Новый Структура("ВерсияФормирования, СоставПакета, НеЗапускатьВДокументооборот", 2);
	ЗаполнитьЗначенияСвойств(ПараметрыПодготовить,		ПараметрыВходящие);
	ЗаполнитьЗначенияСвойств(АргументДляПодготовить,	ПараметрыВходящие);
	
	ПараметрыПодготовить.Вставить("Аргумент", АргументДляПодготовить);
	
	Если ПараметрыПодготовить.МодульПодготовки = Неопределено Тогда
		
		ПараметрыПодготовить.МодульПодготовки = РезультатОтправки.ПараметрыОтправки.МодульПодготовки;
		
	КонецЕсли;
	
	Если ПараметрыПодготовить.ИмяПослеФормирования = Неопределено Тогда
	
		ПараметрыПодготовить.ИмяПослеФормирования = РезультатОтправки.ПараметрыОтправки.ИмяРазделаОтправки;
		
	КонецЕсли;
	
	Если АргументДляПодготовить.НеЗапускатьВДокументооборот = Неопределено Тогда
		
		АргументДляПодготовить.НеЗапускатьВДокументооборот = РезультатОтправки.ПараметрыОтправки.НеЗапускатьВДокументооборот;
		
	КонецЕсли;

	Если	Не	ПараметрыВходящие = Неопределено
		И		ПараметрыВходящие.Свойство("Дополнительно", ПараметрыДополнительно) Тогда
		
		АргументДляПодготовить.Вставить("Дополнительно", ПараметрыДополнительно);
		
	КонецЕсли;

	Возврат ПараметрыПодготовить;
	
КонецФункции

