
&НаКлиенте
Процедура МассоваяОперация_ВыполнитьДействие_УстановитьСценарий(РезультатОтправки, ПараметрыДляШаблон) Экспорт
    Перем ПараметрыДополнительно, ПараметрЗначение;
	
	// Надо прочитать состав пакета и проверить, не является ли он черновиком
	ЦепочкаКомандОбработки	= ПараметрыДляШаблон.ЦепочкаКомандОбработки;
	//ПараметрыВходящие		= ПараметрыДляШаблон.ПараметрыВходящие;
	ПараметрыСценария		= ПараметрыДляШаблон.ПараметрыСценария;
	
	ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "МассоваяОперация_Асинх_ВыполнитьДействие", ПараметрыСценария);
	
	
КонецПроцедуры

&НаКлиенте
Функция МассоваяОперация_ВыполнитьДействие_Параметры(РезультатОтправки, СоставПакета, ПараметрыВходящие = Неопределено)
	Перем ПараметрыДополнительно;
	
	ИдентификаторПакета = СоставПакета_Идентификатор(СоставПакета, "СБИС");
	
	Если   Не	ПараметрыВходящие = Неопределено
		И		ПараметрыВходящие.Свойство("ИмяКоманды") Тогда
		
		// Задана команда для ВыполнитьДействие
		ПараметрыВыполнить	= Новый Структура("ИмяКоманды", ПараметрыВходящие.ИмяКоманды);
		
	ИначеЕсли СоставПакета_Получить(СоставПакета, "ЭтоЧерновик") Тогда			
		
		// Черновик запускаем по регламенту запуска в ДО
		ПараметрыВыполнить	= Новый Структура("ИмяКоманды", "Отправить");
			
	Иначе
		
		// Запустить первое (основное) действие
		ПараметрыВыполнить	= Новый Структура;
		
	КонецЕсли;
	
	Если	Не	ПараметрыВходящие = Неопределено
		И		ПараметрыВходящие.Свойство("Дополнительно", ПараметрыДополнительно)
		И		ПараметрыДополнительно.Свойство("ВыполнитьДействие", ПараметрыДополнительно) Тогда
		
		//// Прокинуть дополнительные признаки для команд
		//ПараметрыПрочитать.Вставить("Дополнительно", ПараметрыДополнительно);
		//
	КонецЕсли;
	
	Возврат ПараметрыВыполнить;
	
КонецФункции
	
