
&НаКлиенте
Процедура МассоваяОперация_ПрочитатьДокумент_УстановитьСценарий(РезультатОтправки, ПараметрыДляШаблон) Экспорт
    Перем ПараметрыДополнительно, ПараметрЗначение, ДопПараметрыВызова;
	
	// Надо прочитать состав пакета и проверить, не является ли он черновиком
	ЦепочкаКомандОбработки	= ПараметрыДляШаблон.ЦепочкаКомандОбработки;
	ПараметрыВходящие		= ПараметрыДляШаблон.ПараметрыВходящие;
	ПараметрыСценария		= ПараметрыДляШаблон.ПараметрыСценария;
	
	ПараметрыДляОтвет = Новый Структура;
	Если	ПараметрыСценария.Свойство("НужныСлужебные")
		И	ПараметрыСценария.НужныСлужебные Тогда
		
		ПараметрыДляОтвет.Вставить("НужныСлужебные", Истина);
		
	КонецЕсли;
	
	ПараметрыСценария.Свойство("ДопПараметрыВызова", ДопПараметрыВызова);

	Если	ПараметрыСценария.Свойство("СоставПакета", ПараметрЗначение)
		И	ЭтоТипСбис(ПараметрЗначение, "СоставПакета")	Тогда
		
		ПараметрыДокумет = СоставПакета_Получить(ПараметрЗначение, "Параметры");
		Если	ПараметрыДокумет.Свойство("Прочитан")
			И	ПараметрыДокумет.Прочитан Тогда
			
			// Уже прочитано.
			Возврат;

		КонецЕсли;	
			
	Иначе	
		
		ПараметрЗначение = ПараметрыВходящие.ИдентификаторСБИС;
		
	КонецЕсли;
	
	ПараметрыПрочитать	= МассоваяОперация_ПрочитатьДокумент_ПараметрыВызова(РезультатОтправки, ПараметрЗначение, ДопПараметрыВызова);
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "ПрочитатьДокумент_Операция",					ПараметрыСценария.Операция);
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "ПрочитатьДокумент_Ответ_Дополнительно",		ПараметрыДляОтвет);
	ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "МассоваяОперация_Асинх_ПрочитатьДокумент",	ПараметрыПрочитать);
		
КонецПроцедуры

&НаКлиенте
Функция МассоваяОперация_ПрочитатьДокумент_Подписки(РезультатОтправки)

	ДанныеПодписок				= МассоваяОперация_Получить(РезультатОтправки, "ПодпискиДляКоманд");
	ПодпискиПрочитатьДокумент	= ДанныеПодписок.Получить("ПрочитатьДокумент");
	Если ПодпискиПрочитатьДокумент = Неопределено Тогда
		// Установить подписки ПрочитатьДокумент
		
		МодульПодписок = НайтиФункциюСеансаОбработки("ПрочитатьДокумент_Подписки", РезультатОтправки.ПараметрыОтправки.ИмяМодуляИнтеграции);
		Если МодульПодписок = Ложь Тогда
			ПодпискаОтвет	= Новый Структура("Функция, ФункцияОшибки, Модуль",
							"МассоваяОперация_Асинх_ПрочитатьДокумент_Ответ",
							"МассоваяОперация_Асинх_ПрочитатьДокумент_Ошибка",
							МодульОбъектаКлиент());
			ПодпискаОшибка	= Новый Структура("Функция, ФункцияОшибки, Модуль",
							ПодпискаОтвет.ФункцияОшибки,
							РезультатОтправки.ПараметрыОтправки.ИмяОбработчикаФатальныхОшибок,
							МодульОбъектаКлиент());
			ПодпискиПрочитатьДокумент	= Новый Структура;
			ПодпискиПрочитатьДокумент.Вставить("Message",	ПодпискаОтвет);
			ПодпискиПрочитатьДокумент.Вставить("Error",		ПодпискаОшибка);
		Иначе
			ПодпискиПрочитатьДокумент = МодульПодписок.ПрочитатьДокумент_Подписки(РезультатОтправки);
		КонецЕсли;
		
		ДанныеПодписок.Вставить("ПрочитатьДокумент", ПодпискиПрочитатьДокумент);
		
	КонецЕсли;
	
	Возврат ПодпискиПрочитатьДокумент;
	
КонецФункции

&НаКлиенте
Функция МассоваяОперация_ПрочитатьДокумент_ПараметрыВызова(РезультатОтправки, СоставПакета, ДопПараметры = Неопределено)
	Перем ПараметрыДополнительно;
	
	Если ТипЗнч(СоставПакета) = Тип("Строка") Тогда
		
		// Это ИД СБИС документа
		ПараметрыПрочитать	=  ПрочитатьДокументСБИС_Параметры(СоставПакета, ДопПараметры);
	
	Иначе
		
		ПараметрыПакета = СоставПакета_Получить(СоставПакета, "Параметры");
		ЭтоПолныйПакет	=	Не	ПараметрыПакета = Неопределено
							И	(	ПараметрыПакета.Свойство("Разобран")
								И	ПараметрыПакета.Разобран
							Или (	ПараметрыПакета.Свойство("Прочитан")
								И	ПараметрыПакета.Прочитан));
								
		Если ЭтоПолныйПакет Тогда
			
			// Состав пакета - прочитанный документ
			ПараметрыПрочитать	= СоставПакета;
			
		Иначе
			
			// Надо прочитать состав пакета
			ИдентификаторПакета = СоставПакета_Идентификатор(СоставПакета, "СБИС");
			ПараметрыПрочитать	=  ПрочитатьДокументСБИС_Параметры(ИдентификаторПакета, ДопПараметры);
			
		КонецЕсли;
		
	КонецЕсли;	

	Возврат ПараметрыПрочитать;
	
КонецФункции

