
// Процедура - Управление флагом документа ДокументРасширение.Изменен, 
// что позволяет вызывать перегенерацию документа при вызове метода СБИС.ПодготовитьДействие
//
// Параметры:
//  РезультатОтправки	 - РезультатОтправки		 - структура массовой операции
//  ПараметрыДляШаблон	 - ФиксированнаяСтруктура	 - структура параметров сценария
//		ЦепочкаКомандОбработки	 - ЦепочкаКомандОбработки, на которую устанавливается сценарий
//		ПараметрыВходящие		 - Структура входных параметров для цепочки в целом
//		ПараметрыСценария		 - Струкутра входные параметры для сценария
//
&НаКлиенте
Процедура МассоваяОперация_УстановитьФлагДокументаИзменен_УстановитьСценарий(РезультатОтправки, ПараметрыДляШаблон) Экспорт  
	
	ЦепочкаКомандОбработки	= ПараметрыДляШаблон.ЦепочкаКомандОбработки;
	ПараметрыСценария		= ПараметрыДляШаблон.ПараметрыСценария;
	
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "УстановитьФлагДокументаИзменен_ДопПараметры", ПараметрыСценария.ДопПараметрыВызова);
	ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "МассоваяОперация_Асинх_УстановитьФлагДокументаИзменен");
	
КонецПроцедуры 

// Процедура - Управление флагом документа ДокументРасширение.Изменен, 
// что позволяет вызывать перегенерацию документа при вызове метода СБИС.ПодготовитьДействие
//
// Параметры:
//  РезультатОтправки	- Структура		 - структура параметров отправки
//  ПараметрыКоманды	- Структура		 - структура параметров команды
//
&НаКлиенте
Процедура МассоваяОперация_Асинх_УстановитьФлагДокументаИзменен(РезультатОтправки, ПараметрыКоманды) Экспорт 
	
	ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;
	ДокументСБИС			= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "ДокументСБИС");     
	
	ПараметрыУстановить = ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "УстановитьФлагДокументаИзменен_ДопПараметры");
	
	Кэш = ГлавноеОкно.Кэш;  
	
	СбисМодульИнтеграции = ПараметрSABY("Интеграция", "Сеанс");
	
	ПараметрыВызова = Новый Структура;  
	ПараметрыВызова.Вставить("ИдДок", СоставПакета_Получить(ДокументСБИС, "ИдентификаторСБИС"));      
	ПараметрыВызова.Вставить("ФлагИзменен", ПараметрыУстановить.ФлагИзменен);
	 
	ФлагОшибки = Ложь;  
	
	РезультатВызова = СбисМодульИнтеграции.ExtSysDocument_Changed(ПараметрыВызова, Новый Структура("Кэш", Кэш), ФлагОшибки); 
	
	Если ФлагОшибки Тогда
		ВызватьСбисИсключение(РезультатВызова, "МодульОбъектаКлиент.УстановитьФлагДокументаИзменен");
	КонецЕсли;  
	
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску")
		
КонецПроцедуры  

