
// Процедура - управляет флагом документа ДокументРасширение.Состояние.ЕстьРасхождения. 
//
// Параметры:
//  РезультатОтправки	 - РезультатОтправки		 - структура массовой операции
//  ПараметрыДляШаблон	 - ФиксированнаяСтруктура	 - структура параметров сценария
//		ЦепочкаКомандОбработки	 - ЦепочкаКомандОбработки, на которую устанавливается сценарий
//		ПараметрыВходящие		 - Структура входных параметров для цепочки в целом
//		ПараметрыСценария		 - Струкутра входные параметры для сценария
//
&НаКлиенте
Процедура МассоваяОперация_УстановитьФлагЕстьРасхождения_УстановитьСценарий(РезультатОтправки, ПараметрыДляШаблон) Экспорт  
	
	ЦепочкаКомандОбработки	= ПараметрыДляШаблон.ЦепочкаКомандОбработки;
	ПараметрыСценария		= ПараметрыДляШаблон.ПараметрыСценария;
	
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "УстановитьФлагЕстьРасхождения_ДопПараметры", ПараметрыСценария.ДопПараметрыВызова);
	ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "МассоваяОперация_Асинх_УстановитьФлагЕстьРасхождения");
	
КонецПроцедуры 

// Процедура - управляет флагом документа ДокументРасширение.Состояние.ЕстьРасхождения.
//
// Параметры:
//  РезультатОтправки	- Структура		 - структура параметров отправки
//  ПараметрыКоманды	- Структура		 - структура параметров команды
//
&НаКлиенте
Процедура МассоваяОперация_Асинх_УстановитьФлагЕстьРасхождения(РезультатОтправки, ПараметрыКоманды) Экспорт 
	
	ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;  
	
	ПараметрыУстановить = ЦепочкаКомандОбработки.ДанныеКоманд.Получить("УстановитьФлагЕстьРасхождения_ДопПараметры");
	
	Кэш = ГлавноеОкно.Кэш;  
	
	СбисМодульИнтеграции = ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция");
	
	ПараметрыВызова = Новый Структура;  
	ПараметрыВызова.Вставить("ИдДок", ПараметрыУстановить.ИдентификаторПакета);      
	ПараметрыВызова.Вставить("ФлагРасхождения", ПараметрыУстановить.ФлагРасхождения);
	 
	ФлагОшибки = Ложь;  
	
	РезультатВызова = СбисМодульИнтеграции.ExtSysDocument_SetDevStatus(ПараметрыВызова, Новый Структура("Кэш", Кэш), ФлагОшибки); 
	
	Если ФлагОшибки Тогда
		ВызватьСбисИсключение(РезультатВызова, "МодульОбъектаКлиент.УстановитьФлагЕстьРасхождения");
	КонецЕсли;  
	
	РезультатОтправки.Отправлено		= РезультатОтправки.Отправлено + 1;
	РезультатОтправки.ПолученоОтветов	= РезультатОтправки.ПолученоОтветов + 1;
	
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "Завершено");
		
КонецПроцедуры

