
//DynamicDirective

// Функция получаяет значение по ключу от данных стороны
//
// Параметры:
//  ДанныеСтороны	- Структура	 - Экземпляр, от которого надо получить значение
//  КлючПолучить	- Строка	 - Что хотим получить из стороны
//  ДопПараметры	- Структура	 - Расширение
// 
// Возвращаемое значение:
//  Произвольный - Найденное значение или Неопределено
//
Функция СторонаSABY_Получить(СторонаSABY, КлючПолучить, ДопПараметры = Неопределено) Экспорт
	Перем Результат; 
	
	Если КлючПолучить = "ИдентификаторЛица" Тогда 
	
		ПлоскиеДанныеСтороны = СторонаSABY_Выгрузить(СторонаSABY);
		Возврат ПлоскиеДанныеСтороны.ИдентификаторЛица;
		
	ИначеЕсли КлючПолучить = "ИдентификаторДокументооборота" Тогда
		
		// ИД стороны для конверта saby.
		Если	СторонаSABY.Свойство("Идентификатор", Результат)
			И	ЗначениеЗаполнено(Результат) Тогда
			
			// Старая совместимость.
			Возврат Результат;
			
		КонецЕсли;
		
		Результат = СторонаSABY_Получить(СторонаSABY, "КодОператораАбонентскогоЯщика");
		Если ЗначениеЗаполнено(Результат) Тогда
			
			Возврат Результат;
			
		КонецЕсли;
		
		Если ОбъектSABY_ЭтоТип(СторонаSABY, "ПрикладнойОбъектSABY") Тогда
			
			Возврат ПрикладнойОбъектSABY_Получить(СторонаSABY, "ПрикладнойИдентификатор");
			
		КонецЕсли;

	ИначеЕсли КлючПолучить = "КлючИдентификатора" Тогда 
		
		Результат = Сторона_КлючИдентификатора(СторонаSABY);  
		
	ИначеЕсли КлючПолучить = "Название" Тогда
		
		Результат = Сторона_НазваниеСтороны(СторонаSABY);
		
	ИначеЕсли КлючПолучить = "Адрес" Тогда
		
		Результат = Сторона_АдресСтороны(СторонаSABY);
		
	ИначеЕсли КлючПолучить = "КлючСертификата" Тогда
		
		КлючИдентификатора	= Сторона_КлючИдентификатора(СторонаSABY);
		ПлоскиеДанные		= СторонаSABY_Выгрузить(СторонаSABY);
		Возврат ПлоскиеДанные[КлючИдентификатора];
		
	ИначеЕсли ОбъектSABY_ЭтоТип(СторонаSABY, "ПрикладнойОбъектSABY") Тогда
		
		Результат = ПрикладнойОбъектSABY_Получить(СторонаSABY, КлючПолучить); 
	
	ИначеЕсли КлючПолучить = "Вид" Тогда 
					
		//Проверка СвФЛ(с инн, и без Инн) СфЮЛ СвИн
		Если СторонаSABY.Свойство("СвФЛ")
			И СторонаSABY.Свойство("ИНН") Тогда
			
			Возврат "Ип";
			
		ИначеЕсли СторонаSABY.Свойство("СвФЛ") Тогда
				 
			Возврат "Фл";
			
		ИначеЕсли СторонаSABY.Свойство("СвЮЛ") Тогда
			
			Возврат "Юл";
			
		ИначеЕсли СторонаSABY.Свойство("СвИН") Тогда
			
			Возврат "Ин";
				
		КонецЕсли;

	Иначе 
		
		Если Не СторонаSABY.Свойство(КлючПолучить, Результат) Тогда
				
			// Если это не прикладной объект, то доп. параметр берется по старому пути.
			Результат = яСторонаSABY_Static_ПрочитатьПараметрСтороныВСеансе(СторонаSABY, КлючПолучить);
			
		КонецЕсли;
		
		Если	КлючПолучить = "ЗапретРедакций"
			Или	КлючПолучить = "ИностраннаяОрганизация" Тогда
			
			Результат = Результат = Истина;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

//DynamicDirective

// Функция - выгружает данные стороны в определенном формате 
//
// Параметры:
//  ДанныеСтороны	 - экземпляр класса сторона	 - Структура СфЮл/СвФЛ
// 
// Возвращаемое значение:
//  Структура - формат с полями "ИНН, КПП, КодФилиала". Если чего-то не хватает, то ""
//
Функция СторонаSABY_Выгрузить(ДанныеСтороны, КлючВыгрузки = "") Экспорт
	Перем СвЮлФлСтороны;
	
	Если ДанныеСтороны = Неопределено Тогда
		
		Возврат Новый Структура;
	
	ИначеЕсли КлючВыгрузки = "3.01" Тогда
		
		// Режим выгрузки стороны для добавления в структуру данных
		ДанныеСтороныВыгружены = СоздатьКопиюОбъекта(ДанныеСтороны);
		ДанныеСтороныВыгружены.Удалить("_тип");
		ДанныеСтороныВыгружены.Удалить("_ид");
		ДанныеСтороныВыгружены.Удалить("_параметры");
		ДанныеСтороныВыгружены.Удалить("_данные");
		ДанныеСтороныВыгружены.Удалить("ДополнительныеДанные");
		ДанныеСтороныВыгружены.Удалить("Роль");
		
	ИначеЕсли КлючВыгрузки = "3.03" Тогда
		
		ДанныеСтороныВыгружены = СторонаSABY_Выгрузить(ДанныеСтороны, "3.01");
		Если ДанныеСтороныВыгружены.Свойство("Адрес") Тогда
			КопияСторонаАдрес = СоздатьКопиюОбъекта(ДанныеСтороныВыгружены.Адрес, Новый ФиксированнаяСтруктура("ГлубокаяКопия", Истина)); 
			Для Каждого адресТип из КопияСторонаАдрес Цикл 
				Если	адресТип.свойство("Тип")
					И	ЗначениеЗаполнено(адресТип.Тип) Тогда
					тип = адресТип.Тип;
					адресТип.Удалить("Тип");
				Иначе
					тип = "Юридический";
				КонецЕсли;
				Если Не адресТип.свойство(тип) Тогда
					адресТип.Вставить(тип, Новый структура());
					Если адресТип.свойство("АдрТекст") Тогда
						Если Не адресТип.свойство("АдрИно") И Не адресТип.свойство("АдрРФ") Тогда
							адресТип[тип].вставить("АдрТекст",адресТип.АдрТекст);
						КонецЕсли;
						адресТип.Удалить("АдрТекст");
					КонецЕсли;
					Если адресТип.свойство("АдрИно") Тогда
						адресТип[тип].вставить("АдрИно",адресТип.АдрИно);
						адресТип.Удалить("АдрИно");
					КонецЕсли;
					Если адресТип.свойство("АдрРФ") Тогда
						адресТип[тип].вставить("АдрРФ",адресТип.АдрРФ);
						адресТип.Удалить("АдрРФ");
					КонецЕсли;
				КонецЕсли;
			Конеццикла;
			ДанныеСтороныВыгружены.Вставить("Адрес", КопияСторонаАдрес);
		КонецЕсли;
		
		ДанныеСтороныВыгружены.Удалить("Представители");

	ИначеЕсли Лев(КлючВыгрузки, 3) = "3.0" Тогда
		
		Возврат СторонаSABY_Выгрузить(ДанныеСтороны, "3.03");

	ИначеЕсли КлючВыгрузки = "объект" Тогда
		
		ДанныеСтороныВыгружены = ПрикладнойОбъектSABY_Выгрузить(ДанныеСтороны, КлючВыгрузки);
		
	ИначеЕсли КлючВыгрузки = "лог" Тогда
		
		Возврат ДанныеСтороны;

	ИначеЕсли КлючВыгрузки = "УникальныйКлючСтороны" Тогда
		
		СторонаПлоская	= СторонаSABY_Выгрузить(ДанныеСтороны);
		Результат		= "";
		Для Каждого КлючИЗначение Из СторонаПлоская Цикл
			
			Результат = Результат + "_" + КлючИЗначение.Ключ + "_" + КлючИЗначение.Значение;
			
		КонецЦикла;
				
		Возврат Результат;

	Иначе
		
		ДанныеСтороныВыгружены = Новый Структура("ИНН, КПП, КодФилиала, БИН, ИИН, ИдентификаторЛица, ИностраннаяОрганизация, Наименование, GLN", 
												"", "", "", "", "", "", Ложь);
		Если		ДанныеСтороны = Неопределено Тогда
			
			Возврат ДанныеСтороныВыгружены;
			
		ИначеЕсли	ДанныеСтороны.Свойство("СвЮЛ", СвЮлФлСтороны) Тогда
						
			Если СвЮлФлСтороны.Свойство("КПП") Тогда
				
				ДанныеСтороныВыгружены.КПП = СвЮлФлСтороны.КПП;
				
			КонецЕсли;
					
		ИначеЕсли 	ДанныеСтороны.Свойство("СвИн", СвЮлФлСтороны) Тогда
			
			ДанныеСтороныВыгружены.ИностраннаяОрганизация = Истина;
			
			Если СвЮлФлСтороны.Свойство("КПП") Тогда
				
				ДанныеСтороныВыгружены.КПП = СвЮлФлСтороны.КПП;
				
			КонецЕсли;   
			
		ИначеЕсли	ДанныеСтороны.Свойство("СвФЛ", СвЮлФлСтороны) Тогда 
			
			//Есть СвФЛ 
			
		ИначеЕсли	ДанныеСтороны.Свойство("СвИП", СвЮлФлСтороны) Тогда 
			
			//Есть СвИП
			
		Иначе
			
			//Нет данных стороны
			ОшибкаНетДанных = НовыйСбисИсключение(, "РаботаСДокументами1С.СгенерироватьПакет", 724, "Сторона не определена", "Отсутствует ИНН/КПП");
			ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаНетДанных);
			
		КонецЕсли;
		
		Если		СвЮлФлСтороны.Свойство("ИНН") Тогда 
			
			ДанныеСтороныВыгружены.ИНН				= СвЮлФлСтороны.ИНН;
			ДанныеСтороныВыгружены.ИдентификаторЛица	= СвЮлФлСтороны.ИНН;
			
		ИначеЕсли	СвЮлФлСтороны.Свойство("БИН") Тогда 
			
			ДанныеСтороныВыгружены.БИН				= СвЮлФлСтороны.БИН;
			ДанныеСтороныВыгружены.ИдентификаторЛица	= СвЮлФлСтороны.БИН;
			
		ИначеЕсли	СвЮлФлСтороны.Свойство("ИИН") Тогда 
			
			ДанныеСтороныВыгружены.ИИН				= СвЮлФлСтороны.ИИН;
			ДанныеСтороныВыгружены.ИдентификаторЛица	= СвЮлФлСтороны.ИИН;
			
		ИначеЕсли	СвЮлФлСтороны.Свойство("ИдентификационныйНомер") Тогда
			
			// СвИн
			ДанныеСтороныВыгружены.ИдентификаторЛица	= СвЮлФлСтороны.ИдентификационныйНомер;
			
		Иначе
			
			//Нет данных стороны
			ДанныеСтороныВыгружены.ИдентификаторЛица	= Неопределено
			//ВызватьСбисИсключение(724, "РаботаСДокументами1С.СгенерироватьПакет",, "Сторона не определена", "Отсутствует идентификатор лица");  
			
		КонецЕсли;
		
		Если Не СвЮлФлСтороны.Свойство("Название", ДанныеСтороныВыгружены.Наименование) Тогда
			
			НаименованиеСформировать = "";
			Если СвЮлФлСтороны.Свойство("Фамилия") Тогда
				
				НаименованиеСформировать = НаименованиеСформировать + СвЮлФлСтороны.Фамилия		+ " ";
				
			КонецЕсли;
				
			Если СвЮлФлСтороны.Свойство("Имя") Тогда
				
				НаименованиеСформировать = НаименованиеСформировать + СвЮлФлСтороны.Имя			+ " ";
				
			КонецЕсли;

			Если СвЮлФлСтороны.Свойство("Отчество") Тогда
				
				НаименованиеСформировать = НаименованиеСформировать + СвЮлФлСтороны.Отчество	+ " ";
				
			КонецЕсли;
			
			ДанныеСтороныВыгружены.Наименование = СокрЛП(НаименованиеСформировать);
			
		КонецЕсли;

		Если	СвЮлФлСтороны.Свойство("КодФилиала")
			И	ЗначениеЗаполнено(СвЮлФлСтороны.КодФилиала) Тогда
			
			ДанныеСтороныВыгружены.КодФилиала = СвЮлФлСтороны.КодФилиала;
			
		КонецЕсли;

		СвЮлФлСтороны.Свойство("GLN", ДанныеСтороныВыгружены.GLN);
		
	КонецЕсли;
	
	Возврат ДанныеСтороныВыгружены;
	
КонецФункции

//DynamicDirective

Процедура СторонаSABY_Установить(СторонаSABY, КлючВставки, ЗначениеВставки, ДопПараметры = Неопределено) Экспорт
	
	Если КлючВставки = "ДополнительныеДанные" Тогда
		
		Если ОбъектSABY_ЭтоТип(СторонаSABY, "ПрикладнойОбъектSABY") Тогда
			
			Для Каждого КлючИЗначение Из ЗначениеВставки Цикл 
				
				ПрикладнойОбъектSABY_Установить(СторонаSABY, КлючИЗначение.Ключ, КлючИЗначение.Значение, ДопПараметры);
				
			КонецЦикла;
			
		Иначе
			
			Для Каждого КлючИЗначение Из ЗначениеВставки Цикл 
				
				яСторонаSABY_Static_СохранитьПараметрСтороныВСеансе(СторонаSABY, КлючИЗначение.Ключ, КлючИЗначение.Значение)
				
			КонецЦикла;
				
		КонецЕсли;	

		Возврат;

	ИначеЕсли ОбъектSABY_ЭтоТип(СторонаSABY, "ПрикладнойОбъектSABY") Тогда
		
		ПрикладнойОбъектSABY_Установить(СторонаSABY, КлючВставки, ЗначениеВставки, ДопПараметры);
		
	ИначеЕсли КлючВставки = "ЗапретРедакций" Тогда
		
		яСторонаSABY_Static_СохранитьПараметрСтороныВСеансе(СторонаSABY, КлючВставки, ЗначениеВставки);
		
	КонецЕсли;
		
	
КонецПроцедуры

//DynamicDirective

Функция СторонаSABY_Пустая(СторонаSABY, ДопПараметры = Неопределено) Экспорт
	
	Если СторонаSABY = Неопределено Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
 	ИдентификационныйНомер = СторонаSABY_Получить(СторонаSABY, "ИдентификационныйНомер");
	ВидСтороны = СторонаSABY_Получить(СторонаSABY, "Вид");
	
	Если Не ЗначениеЗаполнено(ИдентификационныйНомер) 
		И НЕ ВидСтороны = "Фл"
		И Не ВидСтороны = "Ин" Тогда
	
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
	
КонецФункции

// Процедура - Сохраняет посчитанные дополнительные параметры стороны когда сторона не оъект Сторона
//
// Параметры:
//  ДанныеУчастник		 - Структура	 - содержит СвЮл/СвФЛ
//  ПараметрКлюч		 - Строка		 - ключ
//  ДопПараметрыСтороны	 - Произвольный	 - устанавливаемый параметр
//
//DynamicDirective
Процедура яСторонаSABY_Static_СохранитьПараметрСтороныВСеансе(ДанныеУчастник, ПараметрКлюч, ПараметрЗначение)
    Перем Результат;
	
	// TODO 3100 спилить хранение свойств в рассчитанных значениях.
	Если Не ДанныеУчастник.Свойство("ДополнительныеДанные", Результат) Тогда
		
		// Спилить хранение в расчитанных значениях
		КлючДляДопПараметров = СторонаSABY_Выгрузить(ДанныеУчастник, "УникальныйКлючСтороны");
		ОписаниеКэшируемогоЗначения = Новый Структура("Тип, Ключ", "РассчитанныеЗначения.мСторона", КлючДляДопПараметров); 
		Результат = ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции").СбисПолучитьЗначениеРассчитанногоОбъекта(ПолучитьТекущийЛокальныйКэш(), ОписаниеКэшируемогоЗначения);
		
		Если Результат = Неопределено Тогда
			
			Возврат;
			
		КонецЕсли;

	КонецЕсли;
	
	Если ПараметрКлюч = "ДополнительныеДанные" Тогда
		
		Для Каждого КлючИНачениеПараметр Из ПараметрЗначение Цикл
			
			Результат.Вставить(КлючИНачениеПараметр.Ключ, КлючИНачениеПараметр.Значение);
			
		КонецЦикла;
		
	Иначе
		
		Результат.Вставить(ПараметрКлюч, ПараметрЗначение);
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - Сохраняет посчитанные дополнительные параметры стороны когда сторона не оъект Сторона
//
// Параметры:
//  ДанныеУчастник		 - Структура	 - содержит СвЮл/СвФЛ
//  ПараметрКлюч		 - Строка		 - ключ
//  ДопПараметрыСтороны	 - Произвольный	 - устанавливаемый параметр
//
//DynamicDirective
Функция яСторонаSABY_Static_ПрочитатьПараметрСтороныВСеансе(ДанныеУчастник, КлючПараметры)
	Перем Результат;
	
	Если Не ДанныеУчастник.Свойство("ДополнительныеДанные", Результат) Тогда
		
		// TODO 3100. Спилить хранение в расчитанных значениях
		КлючДляДопПараметров = СторонаSABY_Выгрузить(ДанныеУчастник, "УникальныйКлючСтороны");
		
		Результат = ГлобальныйКэш.ТекущийСеанс.РасчитанныеЗначения.Получить("мСторона");
		Если Результат = Неопределено Тогда
			
			Возврат Неопределено;
			
		КонецЕсли;

		Результат = Результат.Получить(КлючДляДопПараметров);
			
	КонецЕсли;
	
	Если	Результат		= Неопределено
		Или	КлючПараметры	= Неопределено Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Возврат Результат.Получить(КлючПараметры);
	
КонецФункции

