
&НаКлиенте
Функция сбисЭлементФормы(Форма,ИмяЭлемента) Экспорт
	
	Возврат МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, ИмяЭлемента);
	
КонецФункции

&НаКлиенте
Функция СбисПолучитьЭлементФормы(ОтЭлемента, ПутьКЭлементу) Экспорт
	
	Возврат МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ОтЭлемента, ПутьКЭлементу);
	
КонецФункции

&НаКлиенте
Функция сбисПолучитьСтраницу(Элемент, ИмяСтраницы) Экспорт

	Возврат МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Элемент, ИмяСтраницы);

КонецФункции

//Определяет, какую форму необходимо использовать при вызове определенной функции	
&НаКлиенте
Функция сбисНайтиФормуФункции(сбисИмяФункции, сбисИмяОсновнойФормы, сбисИмяДополнительнойФормы="",ВходящийКэш="", сбисВладелецФормы = Неопределено) Экспорт
	//Если Не ВходящийКэш = "" Тогда
	//	Кэш = ВходящийКэш;
	//КонецЕсли;	
	//
	НаборФункцийТест = Новый Массив;
	НаборФункцийТест.Добавить(сбисИмяОсновнойФормы);
	НаборФункцийТест.Добавить(сбисИмяДополнительнойФормы);
	
	Попытка
		Возврат МодульОбъектаКлиент().НайтиФункциюСеансаОбработки(сбисИмяФункции, НаборФункцийТест);
	Исключение
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), Новый Структура("ИмяКоманды", "ГлавноеОкно.сбисНайтиФормуФункции"));	
		Возврат Ложь;
	КонецПопытки;

КонецФункции

//Определяет, какую форму необходимо использовать при вызове определенной функции. Работает на Фреш. Постепенно перевести получение форм на новые функции.
//Возможные параметры:
//	ВспомогательныеФормы	- массив строк с именами форм для поиска функции в порядке их приоритета.
//  КэшироватьФункцию		- определяет необходимость кэширования найденной формы за определяемой функцией. Если не указано, то включено.
//	ПроверятьВФК			- определяет необходимость проверки наличия функции в внешних функциях. Если не указано, то включено.
//	ПроверятьВО				- определяет необходимость проверки наличия функции в основной обработке. Если не указано, то включено. 
&НаКлиенте
Функция СбисНайтиФормуФункцииСеанса(ЛокальныйКэш, СбисИмяФункции, СбисОсновныеФормы, СбисДополнительныеПараметры, Отказ) Экспорт

	Попытка
		Результат = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки(СбисИмяФункции, СбисОсновныеФормы, СбисДополнительныеПараметры);
	Исключение
		Отказ = Истина;
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "ГлавноеОкно.СбисНайтиФормуФункцииСеанса");
	КонецПопытки;
	Если Не Результат = Ложь Тогда 
		Возврат Результат;
	КонецЕсли;
	
	Если СбисДополнительныеПараметры.Свойство("ВспомогательныеФормы") Тогда
		Попытка
			Результат = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки(Новый Структура("ИмяПроцедуры, ИмяМодулей", СбисИмяФункции, СбисДополнительныеПараметры.ВспомогательныеФормы), СбисДополнительныеПараметры);
		Исключение
			Отказ = Истина;
			Результат = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "ГлавноеОкно.СбисНайтиФормуФункцииСеанса");
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

//Возвращает запрашиваемую форму при успехе, структуру ошибки при неудаче Ложь, если форма нет найдено.
&НаКлиенте
Функция СбисПолучитьФормуОбработки(ЛокальныйКэш, ИмяФормы, СбисДополнительныеПараметры, Отказ) Экспорт 
	
	Попытка
		Возврат МодульОбъектаКлиент().ПолучитьФормуОбработки(ИмяФормы, СбисДополнительныеПараметры);
	Исключение
		Отказ		= Истина;
		ИнфоОбОшибке= ИнформацияОбОшибке();
		Возврат МодульОбъектаКлиент().НовыйСбисИсключение(ИнфоОбОшибке, "ФормаГлавноеОкно.СбисПолучитьФормуОбработки");
	КонецПопытки;
	
КонецФункции

