
// Процедура - Авторизуется В SABY, открывает интерфейсный модуль авторизации при ошибке
//
// Параметры:
//  ПараметрыАвторизацииВходщие	 - Структура	 - параметры авторизаци
//		Режим:				 Строка	 - ПоТокену/ПоСертификату/ПоЛогинуПаролю. Если не передан, определяется автоматически
//		ВходПоТокену:		 Булево	 - Авторизация настроенным пользователем 1С. Самый высокий приоритет
//		ВходПоСертификату:	 Булево	 - Авторизация по сертификату. Если Ложь, то логин/пароль.
//		Сертификат:			 Строка	 - Отпечаток для авторизации
//		Логин, Пароль:		 Строка	 - Пара Логин/пароль для авторизации
//  ДопПараметры				 - Структура/ФиксированнаяСтруктура	 - расширение
//		ПоказатьИнтерфейс:		 Булево					 - При ошибке авторизации показать форму авторизации
//		ОбработчикПродолжить:	 СбисОписаниеОповещения	 - Если ПоказатьИнтерфейс, то при ошибке обработчик будет вызван после работы формы авторизации.
//			В противном случае ошибка приходит как первый аргумент. При успехе, форма не открывается. Аргументом будет токен авторизации
//
&НаКлиенте
Процедура АвторизоватьсяВSABY(ПараметрыАвторизацииВходщие = Неопределено, ДопПараметры = Неопределено) Экспорт
	Перем РезультатАвторизации, ОбработчикПродолжить;
	
	Если Не ДопПараметры = Неопределено Тогда
		
		ДопПараметры.Свойство("ОбработчикПродолжить", ОбработчикПродолжить);
		ПоказатьФормуАвторизации =	ДопПараметры.Свойство("ПоказатьИнтерфейс")
								И	ДопПараметры.ПоказатьИнтерфейс;
								
	Иначе
		
		ПоказатьФормуАвторизации = Ложь
								
	КонецЕсли;
	
	ОтказАвторизации = Ложь;
	РезультатАвторизации = ВыполнитьАвторизациюSABY(ПараметрыАвторизацииВходщие, ОтказАвторизации);
	
	Если ОтказАвторизации Тогда
		
		Если ПоказатьФормуАвторизации Тогда
					
			ПараметрыПоказать = Новый Структура("Режим, Ошибка", "Старт", РезультатАвторизации);

			формаАвторизации = ПолучитьФормуОбработки("ФормаАвторизация");
			формаАвторизации.ОписаниеОповещенияОЗакрытии = ОбработчикПродолжить;
			формаАвторизации.ПоказатьПоверх(ПараметрыПоказать);
			
			Возврат;
					
		КонецЕсли;
		
		Если ОбработчикПродолжить = Неопределено Тогда
			
			ВызватьИсключение СбисИсключение_ВСтроку(РезультатАвторизации);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ИзменитьПараметрСбис("ИдентификаторСессии", РезультатАвторизации);

	Если Не ОбработчикПродолжить = Неопределено Тогда 
		
		ВыполнитьСбисОписаниеОповещения(РезультатАвторизации, ОбработчикПродолжить);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВыполнитьАвторизациюSABY(ПараметрыАвторизацииВходщие = Неопределено, Отказ)
	Перем РежимАвторизации, АвторизацияПоТокену, АвторизацияПоСертфиикату, 
		ИсточникПолейАвторизации, ОбработчикПродолжить, ОшибкаАвторизации,
		ЛогинЗначение, ПарольЗначение;
	
	Если Не ГлобальныйКэш.СБИС.ОбменВключен Тогда
		
		ОшибкаАвторизации = НовыйСбисИсключение("Не включен обмен с Saby", 
			"МодульОбъектаКлиент.АвторизоватьсяВSABY",
			412,
			,
			"Измените способ обмена в настройках соединения.");
		Отказ = Истина;
		Возврат ОшибкаАвторизации;
		
	КонецЕсли;

	АвторизацияПоТокенуАвто			= ПолучитьПараметрПользователя("ВходПоТокену");
	АвторизацияПоСертификатуАвто	= ПолучитьПараметрПользователя("ЗапомнитьСертификат");
	АвторизацияПоЛогинПарольАвто	= ПолучитьПараметрПользователя("ЗапомнитьПароль");

	Если ПараметрыАвторизацииВходщие = Неопределено Тогда
		
		АвторизацияПоТокену			= АвторизацияПоТокенуАвто;
		АвторизацияПоСертфиикату	= ПолучитьПараметрПользователя("ВходПоСертификату");
		ИсточникПолейАвторизации	= Новый ФиксированнаяСтруктура;
		
	Иначе
		
		ПараметрыАвторизацииВходщие.Свойство("Режим",				РежимАвторизации);
		ПараметрыАвторизацииВходщие.Свойство("ВходПоТокену",		АвторизацияПоТокену);
		ПараметрыАвторизацииВходщие.Свойство("ВходПоСертификату",	АвторизацияПоСертфиикату);
		ИсточникПолейАвторизации	= ПараметрыАвторизацииВходщие;

	КонецЕсли;
	
	Если РежимАвторизации = Неопределено Тогда
		
		// Определить режим для авторизации
		ОписаниеБулево = Новый ОписаниеТипов("Булево");
		Если ОписаниеБулево.ПривестиЗначение(АвторизацияПоТокену) Тогда
			
			РежимАвторизации = "ПоТокену";
			
		ИначеЕсли ОписаниеБулево.ПривестиЗначение(АвторизацияПоСертфиикату)  Тогда
			
			РежимАвторизации = "ПоСертификату";
			
		Иначе
			
			РежимАвторизации = "ПоЛогинуПаролю";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Кэш						= ПолучитьТекущийЛокальныйКэш();
	СбисМодульИнтеграции	= ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция");
	РежимАвторизации		= НРег(РежимАвторизации);
	
	Отказ = Ложь;
	
	Если		РежимАвторизации = "потокену"			Тогда
		
		Результат = СбисМодульИнтеграции.АвторизоватьсяПоТокену(Кэш, Отказ);
		
	ИначеЕсли	РежимАвторизации = "посертификату"		Тогда
		
		Если ИсточникПолейАвторизации.Свойство("Сертификат") Тогда
		
			СертификатАвторизации = ИсточникПолейАвторизации.Сертификат;
			
		ИначеЕсли АвторизацияПоСертификатуАвто Тогда
			
			// Берем сохраненный сертификат только при активной опции "Запомнить сертификат"
			СертификатАвторизации = ПолучитьПараметрПользователя("Сертификат");
			
		Иначе
			
			ОшибкаАвторизации = НовыйСбисИсключение(785, "МодульОбъектаКлиент.АвторизоватьсяВSABY",,"Не указан сертификат для авторизации");
			Отказ = Истина;
			Возврат ОшибкаАвторизации;
			
		КонецЕсли;
		
		Результат = СбисМодульИнтеграции.АвторизоватьсяПоСертификату(Кэш, СертификатАвторизации, Отказ);
		
	ИначеЕсли	РежимАвторизации = "пологинупаролю"	Тогда
		
		Если	ИсточникПолейАвторизации.Свойство("Логин")
			И	ИсточникПолейАвторизации.Свойство("Пароль") Тогда
		
			ЛогинЗначение	= ИсточникПолейАвторизации.Логин;
			ПарольЗначение	= ИсточникПолейАвторизации.Пароль;
			
		ИначеЕсли АвторизацияПоЛогинПарольАвто Тогда
			
			ЛогинЗначение	= ПолучитьПараметрПользователя("Логин");
			ПарольЗначение	= ПолучитьПараметрПользователя("Пароль");
			
		Иначе
			
			//Может быть авторизация без логина пароля на каталоге
			
		КонецЕсли;
		
		Результат		= СбисМодульИнтеграции.АвторизоватьсяПоЛогинуПаролю(Кэш, ЛогинЗначение, ПарольЗначение, Отказ);
		
		ЛогинЗначение	= "";
		ПарольЗначение	= "";
		
	Иначе
		
		ОшибкаАвторизации = НовыйСбисИсключение("Неизвестный способ авторизации в Saby",
			"МодульОбъектаКлиент.АвторизоватьсяВSABY",,,,
			Новый Структура("Режим", РежимАвторизации)); 
			
		Отказ = Истина;
		Возврат ОшибкаАвторизации;
		
	КонецЕсли;
	
	Возврат Результат;
			
КонецФункции

// Функция - выполняет расшировку токена авторизации средствами 1С
//
// Параметры:
//  ДвоичныеДанныеТокена - Строка(ДвоичныеДанные) - результат авторизации по сертификату/подтверждение авторизации по сертификату
// 
// Возвращаемое значение:
//  Строка(УИД) - полученный ИД сессии в готовом виде
//
&НаКлиенте
Функция РасшироватьТокенАвторизации(ДвоичныеДанныеТокена) Экспорт
	
	ДвоичныеДанные		= Base64Значение(ДвоичныеДанныеТокена);  
	ИмяВрФ				= НовыйВременныйФайлКлиент(,"txt");
	МодульКриптографии	= ПолучитьЗначениеПараметраТекущегоСеанса("Криптография1С");
	
	Попытка
		
		МодульКриптографии.сбисРасшифровать(ПолучитьТекущийЛокальныйКэш(), ДвоичныеДанные, ИмяВрФ);
		
	Исключение
		
		ОшибкаРасшифровать = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.РасшироватьТокенАвторизации", 785);
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаРасшифровать);
		
	КонецПопытки;
	
	ЧтениеОтвета	= Новый ЧтениеТекста(ИмяВрФ, КодировкаТекста.UTF8, Символы.ПС);
	Результат		= ЧтениеОтвета.Прочитать();
	ЧтениеОтвета.Закрыть();
	
	ОсвободитьВременныйФайл(ИмяВрФ, Истина);
	
	Возврат Результат;
	
КонецФункции

// Функция - проверка результата авторизации
//
// Параметры:
//  ПараметрыРезультата	 - Структура	 - Параметры оценки
//		Результат:			Строка/СбисИсключение	- результат выполнения методов авторизации - по логину/сертификату/токену/подтверждение и пр.
//		РасшифроватьТокен:	Булево					- необходимость выполнить расшифровку токена криптографией 1С
//  Отказ				 - Булево		 - признак наличия ошибки
// 
// Возвращаемое значение:
//  ИдСессии/СбисИсключение - результат авторизации
//
&НаКлиенте
Функция ОценитьРезультатАвторизации(ПараметрыРезультата, Отказ) Экспорт
	
	РезультатАвторизации	= ПараметрыРезультата.Результат;
	РасшифроватьТокен		=	ПараметрыРезультата.Свойство("РасшифроватьТокен")
							И	ПараметрыРезультата.РасшифроватьТокен;

	Если Не Отказ Тогда
		
		Если РасшифроватьТокен Тогда
			
			Попытка
			
				РезультатАвторизации = РасшироватьТокенАвторизации(РезультатАвторизации);
				
			Исключение
				
				Отказ = Истина;
				Возврат НовыйСбисИсключение(ИнформацияОбОшибке(),
											"API.АвторизоватьсяПоСертификату",
											785,
											"Ошибка 1С при выполнении метода ""Расшифровать""")
				
			КонецПопытки;
			
		КонецЕсли;
		
		ИзменитьПараметрСбис("Авторизован",	Истина);
		
		Возврат РезультатАвторизации;
		
	ИначеЕсли РезультатАвторизации.code = 303 Тогда
		
		РезультатАвторизации.data.addinfo.Вставить("РасшифроватьТокен", РасшифроватьТокен);
	
	ИначеЕсли РезультатАвторизации.details = "Для входа введите полученный код подтверждения." Тогда
		
		РезультатАвторизации.message= "Требуется подтверждение действия";
		РезультатАвторизации.code	= 303;
		
	ИначеЕсли РезультатАвторизации.code = 775 Тогда
		
		РезультатАвторизации.details = "Не удалось авторизоваться по " + ?(ПараметрыРезультата.Параметры.Свойство("Логин"), "логину/паролю.", "сертификату.");
				
	КонецЕсли;
	
	Возврат РезультатАвторизации;
	
КонецФункции

