
// Процедура - Авторизуется В SABY, открывает интерфейсный модуль авторизации при ошибке
//
// Параметры:
//  ПараметрыАвторизацииВходщие	 - Структура	 - параметры авторизаци
//		Режим:				 Строка	 - ПоТокену/ПоСертификату/ПоЛогинуПаролю. Если не передан, определяется автоматически
//		ВходПоТокену:		 Булево	 - Авторизация настроенным пользователем 1С. Самый высокий приоритет
//		ВходПоСертификату:	 Булево	 - Авторизация по сертификату. Если Ложь, то логин/пароль.
//		Сертификат:			 Строка	 - Отпечаток для авторизации
//		Логин, Пароль:		 Строка	 - Пара Логин/пароль для авторизации
//  ДопПараметры				 - Структура/ФиксированнаяСтруктура	 - расширение
//		ПоказатьИнтерфейс:		 Булево					 - При ошибке авторизации показать форму авторизации
//		ОбработчикПродолжить:	 СбисОписаниеОповещения	 - Если ПоказатьИнтерфейс, то при ошибке обработчик будет вызван после работы формы авторизации.
//			В противном случае ошибка приходит как первый аргумент. При успехе, форма не открывается. Аргументом будет токен авторизации
//
&НаКлиенте
Процедура АвторизоватьсяВSABY(ПараметрыАвторизацииВходщие = Неопределено, ДопПараметры = Неопределено) Экспорт
	Перем РезультатАвторизации, ОбработчикПродолжить;
	
	Если Не ДопПараметры = Неопределено Тогда
		
		ДопПараметры.Свойство("ОбработчикПродолжить", ОбработчикПродолжить);
		ПоказатьФормуАвторизации =	ДопПараметры.Свойство("ПоказатьИнтерфейс")
								И	ДопПараметры.ПоказатьИнтерфейс;
								
	Иначе
		
		ПоказатьФормуАвторизации = Ложь
								
	КонецЕсли;
	
	ОтказАвторизации = Ложь;
	РезультатАвторизации = ВыполнитьАвторизациюSABY(ПараметрыАвторизацииВходщие, ОтказАвторизации);
	
	Если ОтказАвторизации Тогда
		
		Если ПоказатьФормуАвторизации Тогда
					
			ПараметрыПоказать = Новый Структура("Режим, Ошибка", "Старт", РезультатАвторизации);
			ОткрытьФормуОбработки("Вход", ,ГлавноеОкно , , ОбработчикПродолжить);
			
			Возврат;
					
		КонецЕсли;
		
		Если ОбработчикПродолжить = Неопределено Тогда
			
			ВызватьИсключение СбисИсключение_ВСтроку(РезультатАвторизации);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ИзменитьПараметрСбис("ИдентификаторСессии", РезультатАвторизации);

	Если Не ОбработчикПродолжить = Неопределено Тогда 
		
		ВыполнитьСбисОписаниеОповещения(РезультатАвторизации, ОбработчикПродолжить);
		
	КонецЕсли;
	
КонецПроцедуры

