
// Процедура - завершает работу обработки
//
&НаКлиенте
Процедура ЗавершитьРаботуSABY(ПараметрЗавершения = Неопределено) Экспорт
	
	КоннекшенSaby = ПараметрSABY("ВыбранныеНастройки", "Настройки");
	Если Не КоннекшенSaby = Неопределено Тогда
		
		Попытка
			
			КоннекшенSABY_Очистить(КоннекшенSaby, "ЗавершитьРаботуSABY");
			
		Исключение
			
			ОшибкаЗавершенияПодключения = NewExtException(ИнформацияОбОшибке(), МодульОбъектаКлиентСервер_Представление() + "ЗавершитьРаботуSABY");
			СбисСообщить(ExtException_Dump(ОшибкаЗавершенияПодключения, "ПолныйТекст"));
			
		КонецПопытки;
		
	КонецЕсли;

	ОшибкаЗавершения = Ложь;
	Попытка
		
		Если ПараметрSABY("Авторизован") Тогда
			
			СохранитьМеткиСтатусов(ГлавноеОкно.Кэш);
			
		КонецЕсли;
		
		СбисСтатистика_ОтправитьЗаписи();
		ПроверитьОчиститьВременныеФайлы(Истина);
		
	Исключение
		
		ИнфоОбОшибке	= ИнформацияОбОшибке();
		СбисИсключение	= НовыйСбисИсключение(ИнфоОбОшибке, "МодульОбъектаКлиент.ЗавершитьРаботуSABY");  
		СообщитьСбисИсключение(СбисИсключение, Новый Структура("СтатусСообщения", "platform_warning"));
		ОшибкаЗавершения = Истина;
				
	КонецПопытки;
	
	Оповестить("SABY.ПриЗавершенииРаботы", ,МодульОбъектаКлиент());
	
	Если ОшибкаЗавершения Тогда
		
		ЗавершитьРаботуSABY_ЗакрытьФормы();
		ЗавершитьРаботуSABY_ОчиститьКэш();
		Возврат;
		
	КонецЕсли;

	Попытка
		
		ОбработчикПослеЗавершения = НовыйСбисОписаниеОповещения("ЗавершитьРаботуSABY_ПослеЗавершения", МодульОбъектаКлиент());
		ПодключитьОтложенноеДействие(ОбработчикПослеЗавершения, ПараметрЗавершения);
		
	Исключение
		
		// Не удалось сделать отложенно, вызвать завершение вручную
		ЗавершитьРаботуSABY_ПослеЗавершения(ПараметрЗавершения);
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРаботуSABY_ЗакрытьФормы()
	
	Оповестить("ЗакрытьСБИС", ,МодульОбъектаКлиент());
	
	Если Не ГлавноеОкно = Неопределено Тогда
		
		// Принудительное закрытие ГО, на случай ошибок
		ГлавноеОкно.ЗавершитьРаботу = Истина;
		
		Если ГлавноеОкно.Открыта() Тогда
			
			ГлавноеОкно.Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - после завершения работы, очистка кэша и параметров.
//
// Параметры:
//  АргументЗакрытия - Булево		 - завершить
//  ДопПараметры	 - Неопределено	 - расширение
//
&НаКлиенте
Процедура ЗавершитьРаботуSABY_ПослеЗавершения(АргументЗакрытия = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	ЛокальныйКэш_ОчиститьОбъект(ГлавноеОкно.Кэш);
	
	ОбновитьПараметрГлобальногоМодуляДляСервера("ОчиститьГлобальныйКэш");
	
	ЗавершитьРаботуSABY_ЗакрытьФормы();
	ЗавершитьРаботуSABY_ОчиститьКэш();
	
	Если АргументЗакрытия = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
		
	Если	АргументЗакрытия.Свойство("ЗавершитьРаботуПредприятия")
		И	АргументЗакрытия.ЗавершитьРаботуПредприятия Тогда
		
		лПерезапуститьПредприятие =	АргументЗакрытия.Свойство("ПерезапуститьПредприятие")
								И	АргументЗакрытия.ПерезапуститьПредприятие;
		ЗавершитьРаботуСистемы(Истина, лПерезапуститьПредприятие);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - окончательно грохает глобальный кэш и главное окно
//
&НаКлиенте
Процедура ЗавершитьРаботуSABY_ОчиститьКэш()
	
	Если Не ГлобальныйКэш = Неопределено Тогда
		
		ГлобальныйКэш.Очистить();
		
	КонецЕсли;
	
	ГлобальныйКэш	= Неопределено;
	ГлавноеОкно		= Неопределено;
	
КонецПроцедуры

