
// Функция описывает список доступных типов для метода СБИС.СписокДокументов https://saby.ru/help/integration/catalog/guide#1
// 
// Возвращаемое значение: СписокЗначений
//
&НаКлиенте
Функция ФильтрТипыДокументовСписок() Экспорт

	ФильтрТипыДокументовСписок = Новый СписокЗначений;
	ФильтрТипыДокументовСписок.Добавить("ЭДОНакл",				"Накладные");
    ФильтрТипыДокументовСписок.Добавить("АктВР",				"Акты (услуги, работы, права)");
    ФильтрТипыДокументовСписок.Добавить("СчФктр,УпдСчфДоп",		"Счета-фактуры (вкл.в составе УПД)");
    ФильтрТипыДокументовСписок.Добавить("УпдДоп",				"Передаточные документы");
    ФильтрТипыДокументовСписок.Добавить("счФактКор,УкдКсчфДис",	"Счета-фактуры корректировочные (вкл. в составе УКД)");
	ФильтрТипыДокументовСписок.Добавить("УкдДис",				"УКД");
    ФильтрТипыДокументовСписок.Добавить("АктСвер",				"Акты сверки");
    ФильтрТипыДокументовСписок.Добавить("Договор",				"Договоры");
    ФильтрТипыДокументовСписок.Добавить("ЭДОСч",				"Счета");
	ФильтрТипыДокументовСписок.Добавить("АктПриемки",			"Акты о приемке");
	ФильтрТипыДокументовСписок.Добавить("Заказ",				"Заказы поставщикам"); 
	ФильтрТипыДокументовСписок.Добавить("ТОРГ-2",				"Акт о расхождении при приемке ТМЦ (ТОРГ-2)");
 	ФильтрТипыДокументовСписок.СортироватьПоПредставлению();
	
	Возврат ФильтрТипыДокументовСписок;
	
КонецФункции

// Процедура - Показать состояние
//
// Параметры:
//  ТекстСостояния	 - Строка/Неопределено		 - выводит состояние длительной операции. Неопределено - скрыть состояние длительной операции.
//  ДопПараметры	 - Структура/Неопределено	 - расширение
//		Интерфейс: форма главного окна/ другая форма, куда выводить состояние. 
//		Индикатор: число 1-100 прогресс бар.
//		Пояснение: дополнительная информация в скобках
//
&НаКлиенте
Процедура ПоказатьСостояниеSABY(ТекстСостояния = Неопределено, ДопПараметры = Неопределено) Экспорт
	Перем лИнтерфейсВывода, лПояснение, лИндикатор;
	
	Если Не ДопПараметры = Неопределено Тогда
	
		Если Не ДопПараметры.Свойство("Интерфейс", лИнтерфейсВывода) Тогда
			
			лИнтерфейсВывода = ПолучитьТекущийЛокальныйКэш().ГлавноеОкно;
			
		КонецЕсли;
		
		ДопПараметры.Свойство("Пояснение", лПояснение);
		ДопПараметры.Свойство("Индикатор", лИндикатор);
		
	КонецЕсли;

	ВидимостьСостояния = Не ТекстСостояния = Неопределено;

	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Если лИнтерфейсВывода = Неопределено Тогда
			
			лИнтерфейсВывода = ГлавноеОкно;
			
		КонецЕсли;
		
		ЭлементВывода		= ПолучитьЭлементФормыОбработки(лИнтерфейсВывода, "ПанельОжидания");
		ЭлементИндикатор	= ПолучитьЭлементФормыОбработки(лИнтерфейсВывода, "Индикатор");
		Если ВидимостьСостояния Тогда
			
			ЭлементВывода.Видимость = Истина;
			лИнтерфейсВывода.НадписьОжидания	= Символы.ПС + ТекстСостояния;
			лИнтерфейсВывода.НадписьПояснение	= лПояснение;
			
			Если лИндикатор = Неопределено Тогда
				
				Возврат;
				
			КонецЕсли;
			
			ЭлементИндикатор.Видимость	= Истина;
			ЭлементИндикатор.Значение	= лИндикатор;
			
		Иначе
			
			ЭлементВывода.Видимость		= Ложь;
			ЭлементИндикатор.Видимость	= Ложь;
			
		КонецЕсли;
		
	#Иначе
		
		Состояние(ТекстСостояния, лИндикатор, лПояснение);
		
	#КонецЕсли
	
КонецПроцедуры

#Область include_core2_vo2_МодульОбъекта_Клиент_Интерфейс_Диалоги
#КонецОбласти

