
&НаКлиенте
Функция НовыйСторонаSABY(ДанныеСтороны) Экспорт
	
	// Пока конструктор как прослойка новый функционал-старый
	ФункцииДокументов = ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции");
	ДанныеСтороны.Вставить("РежимФормированияСтороны", "Полный");
	
	Результат = ФункцииДокументов.ПолучитьСторону(ПолучитьТекущийЛокальныйКэш(), ДанныеСтороны);
	Если Не Результат = Неопределено Тогда
	
		Результат.Вставить("_класс", "СторонаSABY");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
	
#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_Сторона
#КонецОбласти

