
&НаКлиенте
Функция ИнформацияОЛицензиях(ПараметрыОтбора, ДопПараметры = Неопределено) Экспорт
	Перем ЗначениеПоля;
	
	СбисМодульИнтеграции = ПараметрSABY("Интеграция", "Сеанс");

	// Перекладываем из ошибки в параметры получения информации о лицензии
	СоответствиеПолей = Новый Структура("Accrual,	Contractor,		LicenseParameterExt",
										"accrual", "contractorId", "licenseParameterExt");
	
	ПараметрыВызова = Новый Структура;
	
	Для каждого ПолеСоответствия Из СоответствиеПолей Цикл
		
		ПараметрыОтбора.Свойство(ПолеСоответствия.Значение, ЗначениеПоля);
		ПараметрыВызова.Вставить(ПолеСоответствия.Ключ, ЗначениеПоля);
	
	КонецЦикла;
	
	ПараметрыВызова.Вставить("State", 3);
	
	ИнфоОЛицензии = СбисМодульИнтеграции.ExtSysLicense_GetInfo(ПараметрыВызова, Новый Структура);
	
	ПараметрыСсылкиПлатежа = Новый Структура("Accruals, Tab", ИнфоОЛицензии.AccrualsId, "edo");
	
	ФотоКонтакта = "";

	Если ЗначениеЗаполнено(ИнфоОЛицензии.Contacts.Manager_PhotoUUID) Тогда
		ФотоКонтакта = СбисМодульИнтеграции.ExtSysPerson_GetStaffPhoto(ИнфоОЛицензии.Contacts.Manager_PhotoUUID, Новый Структура);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Заголовок", ПараметрыОтбора.title);
	Результат.Вставить("Причина",	ПараметрыОтбора.reason);
	Результат.Вставить("Сообщение",	ПараметрыОтбора.message);
	Результат.Вставить("Сумма",		ИнфоОЛицензии.DebtSum);
	Результат.Вставить("Контакт",	Новый Структура);
	
	Результат.Контакт.Вставить("ПолноеИмя",		ИнфоОЛицензии.Contacts.Manager_LastName
										+ " " + ИнфоОЛицензии.Contacts.Manager_FirstName);
	Результат.Контакт.Вставить("Телефон",		ИнфоОЛицензии.Contacts.Phones_Set[0]);
	Результат.Контакт.Вставить("Фото",			ФотоКонтакта);
	Результат.Контакт.Вставить("Видеозвонок",	"https://"
												+ ПолучитьЗначениеПараметраСбис("АдресСервера")
												+ "/meet/user/"
												+ ИнфоОЛицензии.Contacts.Manager_UUID);
	Результат.Контакт.Вставить("Ссылка",		"https://"
												+ ПолучитьЗначениеПараметраСбис("АдресСервера")
												+ "/person/"
												+ ИнфоОЛицензии.Contacts.Manager_UUID);
	
	Результат.Вставить("Логотип",	СбисМодульИнтеграции.ExtSys_GetImageByLink(ПараметрыОтбора.logoLink, Новый Структура));
	Результат.Вставить("Ссылка",	СбисМодульИнтеграции.ExtSysLicense_GetPaymentLink(ПараметрыСсылкиПлатежа, Новый Структура));
	
	
	Возврат Результат;

КонецФункции

