
// Функция - выполняет разбор УПЛ адреса сервера SABY на составляющие
//
// Параметры:
//  АдресСервера - Строка	 - АдресСервера
// 
// Возвращаемое значение:
//  Структура - Протокол, Поддомен, Домен, Зона, Путь, Шифрование.
//
&НаКлиенте
Функция СбисРазобратьАдресСервера(АдресСервераВходящий) Экспорт
	
	Перем АдресСервера;
	
	АдресСервера = АдресСервераВходящий;
	
	Результат = Новый Структура("Протокол, Поддомен, Домен, Зона, Путь, Шифрование");

    // Убираем протокол
    Если Найти(АдресСервера, "https://")  = 1 Тогда
        Результат.Протокол = "https";
        АдресСервера = Сред(АдресСервера, 9);
    Иначе
        Результат.Протокол = "";
    КонецЕсли;

    Результат.Шифрование = Ложь;

    // Разделяем на домен и путь
    ЧастиURL = МодульОбъектаКлиент().СбисРазложитьСтрокуВМассивПодстрок(АдресСервера, "/");
    Результат.Домен = ЧастиURL[0];

    Путь = "";
    Для i = 1 По ЧастиURL.Количество() - 1 Цикл
        Путь = Путь + "/" + ЧастиURL[i];
    КонецЦикла;
    Результат.Путь = Путь;

    // Разбираем домен на части
    ЧастиДомена = МодульОбъектаКлиент().СбисРазложитьСтрокуВМассивПодстрок(Результат.Домен, ".");
    КоличествоЧастей = ЧастиДомена.Количество();

    Если КоличествоЧастей >= 2 Тогда
        Результат.Зона = ЧастиДомена[КоличествоЧастей - 1];
        Результат.Домен = ЧастиДомена[КоличествоЧастей - 2];

        // Переход на saby
        Если Результат.Домен = "sbis" Тогда
            Результат.Домен = "saby";
        КонецЕсли;

        // Формируем поддомен
        Поддомены = "";
        Для i = 0 По КоличествоЧастей - 3 Цикл
            Часть = ЧастиДомена[i];

            // Обработка -online
            ПозицияOnline = Найти(Часть, "-online");
            Если ПозицияOnline <> 0 Тогда
                Часть = СтрЗаменить(Часть, "-online", "");
            КонецЕсли;

            // Обработка -g
            ПозицияG = Найти(Часть, "-g");
            Если Не ПозицияG = 0 Тогда
                Часть = СтрЗаменить(Часть, "-g", "");
                Результат.Шифрование = Истина;
			КонецЕсли;
			
            ПозицияG2 = Найти(Часть, "g");
            Если Не ПозицияG2 = 0 Тогда
                Часть = СтрЗаменить(Часть, "g", "");
                Результат.Шифрование = Истина;
            КонецЕсли;

            // Формируем поддомен
            Если i > 0 Тогда
                Поддомены = Поддомены + "." + Часть;
            Иначе
                Поддомены = Часть;
            КонецЕсли;
        КонецЦикла;

        Результат.Поддомен = Поддомены;

    Иначе
        Результат.Зона = "";
        Результат.Домен = "";
        Результат.Поддомен = "";
    КонецЕсли;

    Возврат Результат;
КонецФункции

// Функция - собирает строку адреса по параметрам.
//
// Параметры:
//  РазобранныйАдрес - Структура	 - с полями ГОСТTLS, Стенд, Домен, Страна
// 
// Возвращаемое значение:
//  Строка - АдресСервера
//
&НаКлиенте
Функция СбисСобратьАдресСервера(РазобранныйАдрес) Экспорт
    // Сборка доменной части
	Если РазобранныйАдрес.ГОСТTLS И РазобранныйАдрес.Стенд = "online" Тогда
        АдресСервера = "g.saby.ru";
		Возврат АдресСервера;
	ИначеЕсли РазобранныйАдрес.ГОСТTLS Тогда
		АдресСервера = РазобранныйАдрес.Стенд + "-g.saby.ru";
		Возврат АдресСервера;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РазобранныйАдрес.Домен) 
		И ЗначениеЗаполнено(РазобранныйАдрес.Стенд) 
		И ЗначениеЗаполнено(РазобранныйАдрес.Страна) Тогда
		Если РазобранныйАдрес.Стенд = "online" Тогда
			АдресСервера = РазобранныйАдрес.Стенд + "." + РазобранныйАдрес.Домен + "." + НРег(РазобранныйАдрес.Страна);
		Иначе
        	АдресСервера = РазобранныйАдрес.Стенд + "-online." + РазобранныйАдрес.Домен + "." + НРег(РазобранныйАдрес.Страна);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(РазобранныйАдрес.Домен) 
		И ЗначениеЗаполнено(РазобранныйАдрес.Страна) Тогда 
        АдресСервера = "online" + "." + РазобранныйАдрес.Домен + "." + НРег(РазобранныйАдрес.Страна);
    Иначе 
        Возврат АдресСервера;
	КонецЕсли;
	
	Возврат АдресСервера;
	
КонецФункции 

// Функция - проверить доступность элементов адреса сервера
//
// Параметры:
//  РазобранныйАдрес - Структура	 - с полями Протокол, Поддомен, Домен, Зона, Путь, Шифрование
// 
// Возвращаемое значение:
//  Структура - со значениями СтруктураДоменов, ГОСТTLS.
//
&НаКлиенте
Функция СбисПроверитьДоступностьЭлементовАдресаСервера(РазобранныйАдрес) Экспорт
	
	СтруктураЭлементов = Новый Структура;
	СтруктураДоменов = Новый Структура;
    Если РазобранныйАдрес.Свойство("Страна") И НРег(РазобранныйАдрес.Страна) = "ru" Тогда
        СтруктураДоменов.Вставить("saby", "saby");
        СтруктураДоменов.Вставить("sabytest", "sabytest");
        СтруктураЭлементов.Вставить("ГОСТTLS", Истина);
    ИначеЕсли РазобранныйАдрес.Свойство("Страна") И НРег(РазобранныйАдрес.Страна) = "kz" Тогда
        СтруктураДоменов.Вставить("setty", "setty");
        СтруктураЭлементов.Вставить("ГОСТTLS", Ложь);
	Иначе
		Возврат СтруктураЭлементов;
	КонецЕсли;
	СтруктураЭлементов.Вставить("СтруктураДоменов", СтруктураДоменов);
	
	Возврат СтруктураЭлементов;
    
КонецФункции  

// Функция - получить список доступных стендов
// 
// Возвращаемое значение:
//  Структура - Набор доступных стендов
//
&НаКлиенте
Функция СбисПолучитьСписокДоступныхСтендов() Экспорт
    
	СтруктураСтендов = Новый Структура;
	СтруктураСтендов.Вставить("fix", "fix");
	СтруктураСтендов.Вставить("test", "test");
	СтруктураСтендов.Вставить("pre_test", "pre-test");
	
	Возврат СтруктураСтендов;
    
КонецФункции

// Функция - Получить список доступных стран
// 
// Возвращаемое значение:
//  Структура - список стран
//
&НаКлиенте
Функция СбисПолучитьСписокДоступныхСтран() Экспорт
    
	СтруктураСтран = Новый Структура;
	СтруктураСтран.Вставить("RU", "RU");
	СтруктураСтран.Вставить("KZ", "KZ");
	
	Возврат СтруктураСтран;
    
КонецФункции

