
&НаКлиенте
Функция Реестры1С_ПодготовитьКВыполнению(ТекстЗапроса, ПараметрыФильтра) Экспорт
	
	МодульСтатусов = ПолучитьЗначениеПараметраТекущегоСеанса("МодульХраненияСтатусов");
	МодульСтатусов.Реестры1С_ХранениеСтатусов_ДополнитьТекстЗапроса(ТекстЗапроса);
	
	Если НЕ		ПараметрыФильтра.ВсеДокументы
			И	ПараметрыФильтра.РазмерСтраницы <> "все"
			И	ЗначениеЗаполнено(ПараметрыФильтра.РазмерСтраницы)
			И	ПараметрыФильтра.Страница <> 0
			И	Найти(нрег(ТекстЗапроса), "выбрать разрешенные") = 1
			И	ПараметрыФильтра.ФильтрСостояние = "Все документы" Тогда 
		ТекстЗапроса = Лев(ТекстЗапроса, 19) +" ПЕРВЫЕ "+Формат(Число(ПараметрыФильтра.РазмерСтраницы)*ПараметрыФильтра.Страница+1,"ЧН=0; ЧГ=0")+ Сред(ТекстЗапроса, 20);
		// добавляем упорядочивание только в случае выбора "ПЕРВЫЕ", т.к. иначе нельзя упорядочивать временную таблицу.
		// Без упорядочивания временной таблицы документы некорректно распределяются по страницам.
		ПозТчЗпт = Найти(ТекстЗапроса, ";");
		Если ПозТчЗпт>0 Тогда
			ТекстВТ = Лев(ТекстЗапроса, ПозТчЗпт-1);
			Если Найти(ВРег(ТекстВТ), "ПОМЕСТИТЬ")>0 и Найти(ВРег(ТекстВТ), ".ДАТА КАК ДАТА,")>0 и Найти(ВРег(ТекстВТ), ".НОМЕР КАК НОМЕР,")>0 Тогда
				Если ВРег(Прав(ТекстЗапроса, 39)) = "ДАТАДОКУМЕНТА УБЫВ, НОМЕРДОКУМЕНТА УБЫВ" Тогда
					ТекстЗапроса = ТекстВТ+" УПОРЯДОЧИТЬ ПО Дата УБЫВ, Номер УБЫВ"+Сред(ТекстЗапроса, ПозТчЗпт)	
				Иначе
					ТекстЗапроса = ТекстВТ+" УПОРЯДОЧИТЬ ПО Дата, Номер"+Сред(ТекстЗапроса, ПозТчЗпт);
				КонецЕсли
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеЗапроса = Новый Структура("Текст, Параметры, Формат", ТекстЗапроса, Реестры1С_ПараметрыВЗапрос(ПараметрыФильтра));
	
	Возврат ОписаниеЗапроса;
	
КонецФункции

&НаКлиенте
Функция Реестры1С_ПараметрыВЗапрос(ПараметрыФильтра) Экспорт 
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ТекущийДокумент",						ПараметрыФильтра.ФильтрДокумент);
	ПараметрыЗапроса.Вставить("ДатаНач",								НачалоДня(ПараметрыФильтра.ФильтрДатаНач));
	ПараметрыЗапроса.Вставить("ДатаКон",								КонецДня(ПараметрыФильтра.ФильтрДатаКнц));	
	ПараметрыЗапроса.Вставить("Контрагент",								ПараметрыФильтра.ФильтрКонтрагент);
	ПараметрыЗапроса.Вставить("КонтрагентПодключен",					ПараметрыФильтра.ФильтрКонтрагентПодключен);
	ПараметрыЗапроса.Вставить("ТекущаяОрганизация",						ПараметрыФильтра.ФильтрОрганизация);
	ПараметрыЗапроса.Вставить("Ответственный",							ПараметрыФильтра.ФильтрОтветственный);
	ПараметрыЗапроса.Вставить("ЗначениеТекущийДокументЗаполнено",		ЗначениеЗаполнено(ПараметрыФильтра.ФильтрДокумент));
	ПараметрыЗапроса.Вставить("ЗначениеДатаКонЗаполнено",				ЗначениеЗаполнено(ПараметрыФильтра.ФильтрДатаКнц));
	ПараметрыЗапроса.Вставить("ЗначениеКонтрагентЗаполнено",			ЗначениеЗаполнено(ПараметрыФильтра.ФильтрКонтрагент));
	ПараметрыЗапроса.Вставить("ЗначениеТекущаяОрганизацияЗаполнено",	ЗначениеЗаполнено(ПараметрыФильтра.ФильтрОрганизация));
	ПараметрыЗапроса.Вставить("Маска",									СокрЛП(ПараметрыФильтра.ФильтрМаска));

	Если ПараметрыФильтра.Свойство("Пользовательские") Тогда
		Для Каждого Элемент Из ПараметрыФильтра.Пользовательские Цикл
			ПараметрыЗапроса.Вставить(Элемент.Ключ, Элемент.Значение);	
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

