
&НаКлиенте
Процедура НачатьСборТехИнформации(ПараметрыСбора = Неопределено) Экспорт
	Перем ОбработчикЗавершить;
	
	ПараметрыСбораТИ = Новый Структура("Модули, Объекты, Папки", Новый Массив, Новый Массив, Новый Массив);
	ПараметрыСбораТИ.Модули.Добавить(ПараметрSABY("ФормаГлавноеОкно",				"Сеанс"));
	ПараметрыСбораТИ.Модули.Добавить(ПараметрSaby("ФункцииДокументов",				"Сеанс"));
	ПараметрыСбораТИ.Модули.Добавить(ПараметрSaby("МодульУправленияНастройками",	"Сеанс"));
	
	КаталогОтладки = ПараметрSaby("КаталогОтладки");
	Если ЗначениеЗаполнено(КаталогОтладки) Тогда
		
		ПараметрыСистемы = ГлобальныйКэш_Получить("ПараметрыСистемы"); 
		ПараметрыСбораТИ.Папки.Добавить(ПрименитьФорматКСтроке(КаталогОтладки, ПараметрыСистемы.Обработка.Версия, "Каталог"))
		
	КонецЕсли;

	Если Не ПараметрыСбора = Неопределено  Тогда
		
		ПараметрыСбора.Свойство("ОбработчикЗавершить", ОбработчикЗавершить);
		Если ПараметрыСбора.Свойство("Модули") Тогда
			
			Для Каждого СобираемыйМодуль Из ПараметрыСбора.Модули Цикл
				
				Если ПараметрыСбораТИ.Модули.Найти(СобираемыйМодуль) = Неопределено Тогда
					
					ПараметрыСбораТИ.Модули.Добавить(СобираемыйМодуль);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ПараметрыСбора.Свойство("Объекты") Тогда
			
			Для Каждого СобираемыйОбъект Из ПараметрыСбора.Объекты Цикл
				
				Если ПараметрыСбораТИ.Объекты.Найти(СобираемыйОбъект) = Неопределено Тогда
					
					ПараметрыСбораТИ.Объекты.Добавить(СобираемыйОбъект);
					
				КонецЕсли;
				
			КонецЦикла;

		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбработчикЗавершить = Неопределено Тогда
		
		ОбработчикЗавершить = НовыйСбисОписаниеОповещения("яИнформацияДляТП_Результат", МодульОбъектаКлиент());
		
	КонецЕсли;
 	ПараметрыСбораТИ.Вставить("ОбработчикРезультата", ОбработчикЗавершить);
	ОбработчикПродолжить	= НовыйСбисОписаниеОповещения("SABYСохранитьОтладочнуюИнформацию",	МодульОбъектаКлиент(), ПараметрыСбораТИ);

	ПараметрыВыбораКаталога	= Новый Структура("Заголовок", "Сохранить информацию для техподдержки в:");
	ДопПараметрыВыбрать		= Новый Структура("Режим, Обработчик", "Каталог", ОбработчикПродолжить);
	SABYВыбратьЗначение(ПараметрыВыбораКаталога, ДопПараметрыВыбрать);

КонецПроцедуры

&НаКлиенте
Процедура ТехИнформация_ВыгрузитьОбъект(ОбъектьСобратьТИ, ПутьДляОбъектов) Экспорт
	Перем ИмяОбъекта;
	
	Если ОбъектSABY_ЭтоТип(ОбъектьСобратьТИ, "ПрикладнойОбъектSaby") Тогда
		
		ИмяОбъекта = ПрикладнойОбъектSABY_Получить(ОбъектьСобратьТИ, "Название");
		
	Иначе
		
		Если ОбъектSABY_ЭтоТип(ОбъектьСобратьТИ, "ОбъектSaby") Тогда
			
			ИмяОбъекта = "Объект " + Строка(ОбъектSABY_Получить(ОбъектьСобратьТИ, "Тип"));
			
		Иначе	
			
			ИмяОбъекта = "Неивестный Объект " + Строка(ОбъектьСобратьТИ);
			
		КонецЕсли;
		
	КонецЕсли;
	ИмяОбъекта		= ПрименитьФорматКСтроке(ИмяОбъекта, , "файл") + ".json";
	ЗаписьДляФайла	= ПреобразоватьЗначениеВJSON(ОбъектьСобратьТИ, Новый Структура("Режим", "Лог"));
	
	ТекстДок		= Новый ТекстовыйДокумент;
	ФайлТест		= Новый Файл(ПутьДляОбъектов + ИмяОбъекта);
	
	Если ФайлТест.Существует() Тогда
		
		ТекстДок.Прочитать(ПутьДляОбъектов + ИмяОбъекта);
		
	КонецЕсли;

	ТекстДок.ДобавитьСтроку(ЗаписьДляФайла);
	ТекстДок.Записать(ПутьДляОбъектов + ИмяОбъекта);
	
КонецПроцедуры

// Процедура - приватный метод для обработки сбора информация.
//
// Параметры:
//  РезультатСбораТИ - СбисИсключение, Файл	 - результат сбора.
//  ДопПараметры	 - Неопределено			 - расширение
//
&НаКлиенте
Процедура яИнформацияДляТП_Результат(РезультатСбораТИ, ДопПараметры) Экспорт
	
	Если ОбъектSABY_ЭтоТип(РезультатСбораТИ, "СбисИсключение") Тогда
		
		СбисСообщить(РезультатСбораТИ);
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(РезультатСбораТИ) = Тип("Файл") Тогда
		
		ЗапуститьПриложение(РезультатСбораТИ.Путь)
		
	КонецЕсли;

КонецПроцедуры

// Процедура - собрирает отладочную информацию
//
// Параметры:
//  ПараметрыСбора	 - Структура	 - что и куда собираем
//		Каталог: Строка(О) Путь к каталогу куда выгрузить сведения ТИ
//		Модули: Массив(О) Набор модулей от которых запрашивается ТИ
//		Объекты: Массив(О) Набор объектов, которые необходимо записать
// 
&НаКлиенте
Процедура СобратьОтладочнуюИнформацию(ПараметрыСбора, ДопПараметры)
	Перем ОбъектыСбораТИ, МодулиСбораТИ;
	
	Если	Не	ПараметрыСбора.Свойство("Модули")
		Или		ПараметрыСбора.Модули = Неопределено Тогда
		
		ПараметрыСбора.Вставить("Модули", Новый Массив);
		
	КонецЕсли;
	Если	Не	ПараметрыСбора.Свойство("Объекты")
		Или		ПараметрыСбора.Объекты = Неопределено Тогда
		
		ПараметрыСбора.Вставить("Объекты", Новый Массив);
		
	КонецЕсли;

	ДопПараметры.Вставить("ПутьВыгрузки");
  	ДопПараметры.Вставить("ОбработчикПродолжить",	НовыйСбисОписаниеОповещения("яСобратьОтладочнуюИнформацию_Продолжить", МодульОбъектаКлиент(), ДопПараметры));
	
	ПараметрыСбора.Вставить("Ошибки",		Новый СписокЗначений);
	ПараметрыСбора.Вставить("ИмяФайла",		НовыйВременныйФайл(ПараметрыСбора, "zip"));
 	ПараметрыСбора.Вставить("ЗаписьZIP",	Новый ЗаписьZipФайла(ПараметрыСбора.ИмяФайла));
	
	яСобратьОтладочнуюИнформацию_Продолжить(ПараметрыСбора, ДопПараметры);

КонецПроцедуры

&НаКлиенте
Процедура яСобратьОтладочнуюИнформацию_Продолжить(ПараметрыСбора, ДопПараметры) Экспорт
	
	яСобратьОтладочнуюИнформацию_Ошибки(ПараметрыСбора, ДопПараметры);

	Если ПараметрыСбора.Свойство("Модули") Тогда
		
		яСобратьОтладочнуюИнформацию_Модули(ПараметрыСбора, ДопПараметры);
		Возврат;
		
	КонецЕсли;

	Если ПараметрыСбора.Свойство("Объекты") Тогда
		
		яСобратьОтладочнуюИнформацию_Объекты(ПараметрыСбора, ДопПараметры);
		Возврат;
		
	КонецЕсли;
	
	Если ПараметрыСбора.Свойство("Папки") Тогда
		
		яСобратьОтладочнуюИнформацию_Папки(ПараметрыСбора, ДопПараметры);
		Возврат;
		
	КонецЕсли;

	яСобратьОтладочнуюИнформацию_Ошибки(ПараметрыСбора, ДопПараметры);
 	ПараметрыСбора.Удалить("Ошибки");

	Попытка

		ПараметрыСбора.ЗаписьZIP.Записать();
		РезультатСбораТИ = Новый Файл(ПараметрыСбора.ИмяФайла);
		
	Исключение
		
		РезультатСбораТИ = НовыйСбисИсключение(ИнформацияОбОшибке(), МодульОбъектаКлиентСервер_Представление() + "СобратьОтладочнуюИнформацию.Продолжить");
		
	КонецПопытки;
	
	КаталогОчистить = ПрименитьФорматКСтроке(ПараметрыСбора.Каталог, ПараметрыСбора.Имя, "Каталог");
	Попытка

		УдалитьФайлы(КаталогОчистить);
		
	Исключение
		
		СбисСообщить("Не удалось удалить временные файлы. Требуется удалить каталог " + КаталогОчистить + " вручную"); 
		
	КонецПопытки;
	
	ВыполнитьСбисОписаниеОповещения(РезультатСбораТИ, ДопПараметры.ОбработчикЗавершить);
	
КонецПроцедуры

&НаКлиенте
Процедура яСобратьОтладочнуюИнформацию_Объекты(ПараметрыСбора, ДопПараметры)
	Перем МодулиСбораТИ;
		
	ПутьККаталогу	= ПрименитьФорматКСтроке(ПараметрыСбора.Каталог, ПараметрыСбора.Имя, "Каталог");
	ПутьДляОбъектов	= ПрименитьФорматКСтроке(ПутьККаталогу, "Объекты", "Каталог");
	
	СоздатьКаталог(ПутьДляОбъектов);

	Для Каждого ОбъектьСобратьТИ Из ПараметрыСбора.Объекты Цикл
		
		ТехИнформация_ВыгрузитьОбъект(ОбъектьСобратьТИ, ПутьДляОбъектов);
						
	КонецЦикла;
	ПараметрыСбора.ЗаписьZIP.Добавить(ПутьДляОбъектов, РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	
	ПараметрыСбора.Удалить("Объекты");
	ВыполнитьСбисОписаниеОповещения(ПараметрыСбора, ДопПараметры.ОбработчикПродолжить);
	
КонецПроцедуры

&НаКлиенте
Процедура яСобратьОтладочнуюИнформацию_Папки(ПараметрыСбора, ДопПараметры)
	Перем МодулиСбораТИ;
		
	Для Каждого ОбъектьСобратьТИ Из ПараметрыСбора.Папки Цикл
		
		Файл = Новый Файл(ОбъектьСобратьТИ);
		Если Файл.Существует() Тогда
			
			ПараметрыСбора.ЗаписьZIP.Добавить(ОбъектьСобратьТИ, РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
			
		КонецЕсли;
					
	КонецЦикла;
	
	ПараметрыСбора.Удалить("Папки");
	ВыполнитьСбисОписаниеОповещения(ПараметрыСбора, ДопПараметры.ОбработчикПродолжить);
	
КонецПроцедуры

&НаКлиенте
Процедура яСобратьОтладочнуюИнформацию_Ошибки(ПараметрыСбора, ДопПараметры)
	Перем МодулиСбораТИ;
	
	Если Не ЗначениеЗаполнено(ПараметрыСбора.Ошибки) Тогда
		
		Возврат;
		
	КонецЕсли;

	ПутьККаталогу	= ПрименитьФорматКСтроке(ПараметрыСбора.Каталог, ПараметрыСбора.Имя, "Каталог");
	ПутьДляОбъектов	= ПрименитьФорматКСтроке(ПутьККаталогу, "Ошибки", "Каталог");
	
	СоздатьКаталог(ПутьДляОбъектов);

	Для Каждого ОбъектьСобратьТИ Из ПараметрыСбора.Ошибки Цикл
		
		ЗаписьПараметра = НовыйЗаписьЛогаSABY(ОбъектьСобратьТИ, "СобратьОтладочнуюИнформацию",,,,МодульОбъектаКлиентСервер_Представление());
		ПутьДляВывода = ОбъектьСобратьТИ.Представление;
		Если Не ЗначениеЗаполнено(ПутьДляВывода) Тогда
			
			ПутьДляВывода = ПутьДляОбъектов;
			
		КонецЕсли;
		
		СохранитьОтладочныеДанныеСБИС_ВывестиЗапись(ЗаписьПараметра, ПутьДляВывода);
					
	КонецЦикла;
	
	ПараметрыСбора.ЗаписьZIP.Добавить(ПутьДляОбъектов, РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	ВыполнитьСбисОписаниеОповещения(ПараметрыСбора, ДопПараметры.ОбработчикПродолжить);
	
КонецПроцедуры

&НаКлиенте
Процедура яСобратьОтладочнуюИнформацию_Модули(ПараметрыСбора, ДопПараметры)
	Перем МодулиСбораТИ;
	
	ПутьККаталогу = ПрименитьФорматКСтроке(ПараметрыСбора.Каталог, ПараметрыСбора.Имя, "Каталог");
	ПутьККаталогу = ПрименитьФорматКСтроке(ПутьККаталогу, "Модули", "Каталог");
	
	СоздатьКаталог(ПутьККаталогу);
	
	Для Каждого МодульСобратьТИ Из ПараметрыСбора.Модули Цикл
		
		Попытка
			
			// Если у модуля есть краткое название, то выгрузка данных должна идти по нему
			ДопПараметры.ПутьВыгрузки = ПрименитьФорматКСтроке(ПутьККаталогу, МодульСобратьТИ.НазваниеКратко(), "Каталог");
			
		Исключение
			
			ДопПараметры.ПутьВыгрузки = ПутьККаталогу;
			
 		КонецПопытки;

		Попытка
			
			СоздатьКаталог(ДопПараметры.ПутьВыгрузки);
			МодульСобратьТИ.МодульОбработки_Выгрузить("ТехническаяИнформация", ДопПараметры);
			
		Исключение
			
			ОшибкаСбораТИ = НовыйСбисИсключение(ИнформацияОбОшибке(), МодульОбъектаКлиентСервер_Представление() + "СобратьОтладочнуюИнформацию");
			ПараметрыСбора.Ошибки.Добавить(ОшибкаСбораТИ, ПутьККаталогу);
			
		КонецПопытки;
		
	КонецЦикла;
	ПараметрыСбора.ЗаписьZIP.Добавить(ПутьККаталогу, РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	ПараметрыСбора.Удалить("Модули");
	
	ВыполнитьСбисОписаниеОповещения(ПараметрыСбора, ДопПараметры.ОбработчикПродолжить);
	
КонецПроцедуры

