
// Процедура собирает статистику и отправляет на сервис.
//
// Параметры:
//  ПараметрыСтатистики	 - Структура				 - Действие
//  ДопПараметры		 - Структура/Неопределено	 - расширение
//
&НаКлиенте
Процедура СбисСтатистика_СформироватьИЗаписать(ПараметрыСтатистики, ДопПараметры = Неопределено) Экспорт
	                                                                                                                
	// При отключенном обмене или без авторизации записать ничего не сможем.
	Если Не (ПолучитьЗначениеПараметраСбис("ОбменВключен") И ПолучитьЗначениеПараметраСбис("Авторизован")) Тогда
		Возврат;
	КонецЕсли; 
	
	Попытка 
		
		ДанныеСтатистики	= СтатистикаSABY_СформироватьДанныеСообщений(ПараметрыСтатистики, ДопПараметры);
		ИнтеграцияМодуль	= ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция");
		
		Отказ = Ложь; 
		
		Для Каждого СообщениеСтатистики Из ДанныеСтатистики.Сообщения Цикл 
			
			РезультатОтправки = ИнтеграцияМодуль.СбисОтправитьСообщениеСтатистики(ГлавноеОкно.Кэш, СообщениеСтатистики, Отказ); 
			
			Если Отказ Тогда
				ВызватьСбисИсключение(РезультатОтправки, ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".СбисОтправитьСообщениеСтатистики");;
			КонецЕсли;  
			
		КонецЦикла;
		
		Для Каждого СообщениеОбОшибке Из ДанныеСтатистики.Ошибки Цикл
			
			РезультатОтправки = ИнтеграцияМодуль.СбисОтправитьСообщениеОшибки(ГлавноеОкно.Кэш, СообщениеОбОшибке, Отказ);
			
			Если Отказ Тогда
				ВызватьСбисИсключение(РезультатОтправки, ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".СбисОтправитьСообщениеОшибки");;
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СообщениеСтатистики Из ДанныеСтатистики.Прикладная Цикл 
			
			ДопПараметрыОтправки = Новый Структура("Кэш", ГлавноеОкно.Кэш);
			РезультатОтправки = ИнтеграцияМодуль.ExtSysMarking_SendStatisticData(СообщениеСтатистики, ДопПараметрыОтправки, Отказ);
			
			Если Отказ Тогда
				ВызватьСбисИсключение(РезультатОтправки, ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".ExtSysMarking_SendStatisticData");;
			КонецЕсли;    
			
		КонецЦикла;    
		
	Исключение   
		
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ВызватьСбисИсключение(ИнфоОбОшибке, "МодульОбъектКлиент.СбисСтатистика_СформироватьИЗаписать");
		
	КонецПопытки;           
	
КонецПроцедуры

#Область include_core2_vo2_МодульОбъекта_Клиент_СтатистикаSABY_СформироватьДанные
#КонецОбласти

