// Процедура сохраняет статистику и запускает отправку на сервис при определенных условиях.
//
// Параметры:
//  ДанныеСтатистики	 - Структура				 - статистика по группам 
//  ДопПараметры		 - Структура/Неопределено	 - расширение
//
&НаКлиенте
Процедура СбисСтатистика_ОтправитьЗаписи(ДанныеСтатистики = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Отказ = Ложь;
	ИнтеграцияМодуль	= ПараметрSABY("Интеграция", "Сеанс");
	ДопПараметрыОтправки = Новый Структура("Кэш", ГлавноеОкно.Кэш);
	ТекСеансГлобальногоКэша = ГлобальныйКэш().ТекущийСеанс;
	
	Если НЕ ТекСеансГлобальногоКэша.Свойство("Статистика") Тогда 
		
		ТекСеансГлобальногоКэша.Вставить("Статистика", Новый Структура);
		ТекСеансГлобальногоКэша.Статистика.Вставить("Сообщения", Новый Массив);
		ТекСеансГлобальногоКэша.Статистика.Вставить("Ошибки", Новый Массив);
		ТекСеансГлобальногоКэша.Статистика.Вставить("Прикладная", Новый Массив);
		
	КонецЕсли;   
	
	Если ЗначениеЗаполнено(ДанныеСтатистики) Тогда
		
		Для Каждого СообщениеСтатистики Из ДанныеСтатистики.Сообщения Цикл 
			
			ТекСеансГлобальногоКэша.Статистика.Сообщения.Добавить(СообщениеСтатистики);
			
		КонецЦикла;  
		
		Для Каждого СообщениеОбОшибке Из ДанныеСтатистики.Ошибки Цикл 
			
			ТекСеансГлобальногоКэша.Статистика.Ошибки.Добавить(СообщениеОбОшибке);	
			
		КонецЦикла;  
		
		Для Каждого СообщениеСтатистики Из ДанныеСтатистики.Прикладная Цикл 
			
			ТекСеансГлобальногоКэша.Статистика.Прикладная.Добавить(СообщениеСтатистики); 
			
		КонецЦикла; 
		
		Если ТекСеансГлобальногоКэша.Статистика.Сообщения.Количество() > 9 ИЛИ
				ТекСеансГлобальногоКэша.Статистика.Ошибки.Количество() > 9 ИЛИ
				ТекСеансГлобальногоКэша.Статистика.Прикладная.Количество() > 9 Тогда
			
			// При отключенном обмене или без авторизации записать ничего не сможем.  
			Если Не (ПолучитьЗначениеПараметраСбис("ОбменВключен") И ПолучитьЗначениеПараметраСбис("Авторизован")) Тогда
				Возврат;
			КонецЕсли; 
		
			СбисСтатистика_ОтправитьЗаписи();
			
		КонецЕсли;		 
		
		//подключение функции самой себя отложенным     
		КлючДействия		= "СбисСтатистика_ОтправитьЗаписи";
		ОтложенноеДействие	= ПолучитьОтложенноеДействие(КлючДействия);
		Если ОтложенноеДействие = Неопределено Тогда
			
			ОбработчикДействия = НовыйСбисОписаниеОповещения("СбисСтатистика_ОтправитьЗаписи", ГлавноеОкно.МодульОбъектаКлиент(), ДопПараметры);
			ПодключитьОтложенноеДействие(НовыйОтложенноеДействие(Новый Структура("Периодичность, ОписаниеОповещения, ЧислоВызовов, ИдентификаторДействия", 600, ОбработчикДействия,,КлючДействия)));
			
		КонецЕсли;	
		
	Иначе   
		
		//отправка сообщений статистики
		Для каждого Сообщение ИЗ ТекСеансГлобальногоКэша.Статистика.Сообщения Цикл
			
			РезультатОтправки = ИнтеграцияМодуль.СбисОтправитьСообщениеСтатистики(ГлавноеОкно.Кэш, Сообщение, Отказ); 
			
			Если Отказ Тогда
				ВызватьСбисИсключение(РезультатОтправки, ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".СбисОтправитьСообщениеСтатистики");
			КонецЕсли;  
			
		КонецЦикла; 
		
		ТекСеансГлобальногоКэша.Статистика.Сообщения.Очистить();
		
		Для каждого Сообщение ИЗ ТекСеансГлобальногоКэша.Статистика.Ошибки Цикл
			
			РезультатОтправки = ИнтеграцияМодуль.СбисОтправитьСообщениеОшибки(ГлавноеОкно.Кэш, Сообщение, Отказ);
			
			Если Отказ Тогда  
				
				ВызватьСбисИсключение(РезультатОтправки, ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".СбисОтправитьСообщениеОшибки");
				
			КонецЕсли;   
			
		КонецЦикла; 
		
		ТекСеансГлобальногоКэша.Статистика.Ошибки.Очистить();
		
		Для каждого Сообщение ИЗ ТекСеансГлобальногоКэша.Статистика.Прикладная Цикл
			
			РезультатОтправки = ИнтеграцияМодуль.ExtSysMarking_SendStatisticData(Сообщение, ДопПараметрыОтправки, Отказ);
			
			Если Отказ Тогда
				
				ВызватьСбисИсключение(РезультатОтправки, ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".ExtSysMarking_SendStatisticData");
				
			КонецЕсли; 
			
		КонецЦикла;     
		
		ТекСеансГлобальногоКэша.Статистика.Прикладная.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура собирает статистику и запускает отправку на сервис.
//
// Параметры:
//  ПараметрыСтатистики	 - Структура				 - Действие
//  ДопПараметры		 - Структура/Неопределено	 - расширение
//
&НаКлиенте
Процедура СбисСтатистика_СформироватьИЗаписать(ПараметрыСтатистики, ДопПараметры = Неопределено) Экспорт
	                                                                                                                
	Попытка 
		
		ДанныеСтатистики	= СтатистикаSABY_СформироватьДанныеСообщений(ПараметрыСтатистики, ДопПараметры);
		СбисСтатистика_ОтправитьЗаписи(ДанныеСтатистики);
		
	Исключение   
		
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ВызватьСбисИсключение(ИнфоОбОшибке, "МодульОбъектКлиент.СбисСтатистика_СформироватьИЗаписать");
		
	КонецПопытки;               
	
КонецПроцедуры

#Область include_core2_vo2_МодульОбъекта_Клиент_СтатистикаSABY_СформироватьДанные
#КонецОбласти

