
// Процедура - изменяет элемент формы обработки
//
// Параметры:
//  ОписаниеИзменитьВходящее - Структура	 - Что меняем - 
//		Форма - Форма/ФормаКлиентскогоПриложения, где меняем
//		Реквизит или Путь - Строка, что меняем
//  ИзмененияВходящие		 - Структура	 - что меняем
//		HTML - установить HTML на соответствующий элемент.
//
&НаКлиенте
Процедура ИзменитьЭлементФормыОбработки(ОписаниеИзменитьВходящее, ИзмененияВходящие)	Экспорт
	Перем МодульИзменить, ЭлементИзменитьОригинал;
	
	Если	ТипЗнч(ОписаниеИзменитьВходящее) = Тип("Структура")
		Или	ТипЗнч(ОписаниеИзменитьВходящее) = Тип("ФиксированнаяСтруктура") Тогда
		
		МодульИзменить	= ОписаниеИзменитьВходящее.Форма;
		ИмяПоляИзменить = ОписаниеИзменитьВходящее.Реквизит;
		ЭлементИзменить	= ПолучитьЭлементФормыОбработки(МодульИзменить, ИмяПоляИзменить);
		
	Иначе
		
		ЭлементИзменить = ОписаниеИзменитьВходящее;
		ИмяПоляИзменить	= ЭлементИзменить.Имя;
		ИзмененияВходящие.Свойство("Форма", МодульИзменить);
		
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если ТипЗнч(ЭлементИзменить) = Тип("КолонкаТабличногоПоля") Тогда
			ЭлементИзменитьОригинал	= ЭлементИзменить;
			ЭлементИзменить			= ЭлементИзменить.ЭлементУправления;
		КонецЕсли;	
	#КонецЕсли
	
	Если ИзмененияВходящие.Свойство("HTML") Тогда
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ПолучитьЭлементФормыОбработки(МодульИзменить, ИмяПоляИзменить).УстановитьТекст(ИзмененияВходящие.HTML);
		#Иначе
			МодульИзменить[ИмяПоляИзменить] = ИзмененияВходящие.HTML;
		#КонецЕсли
		
	КонецЕсли;
		
	Если ИзмененияВходящие.Свойство("УстановитьОграничениеТипа") Тогда
		
		ТипУстановить = ИзмененияВходящие.УстановитьОграничениеТипа;
		Если ТипУстановить = Неопределено Тогда
			
			// Снять ограничение типа
			ТипУстановить = Новый ОписаниеТипов(Неопределено);
			
		ИначеЕсли ТипЗнч(ТипУстановить) = Тип("Тип") Тогда
			
			НаборТипов = Новый Массив;
			НаборТипов.Добавить(ТипУстановить);
			ТипУстановить = Новый ОписаниеТипов(НаборТипов);
			
		КонецЕсли;

		ЭлементИзменить.ОграничениеТипа = ТипУстановить;
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Если	ТипЗнч(ЭлементИзменитьОригинал) = Тип("КолонкаТабличногоПоля")
				И Не ЭлементИзменить.ТипЗначения = ТипУстановить Тогда
				
				ДействияСобытийУстановить		= ПолучитьСтруктуруДействийЭлемента(ЭлементИзменить);
				ИмяКолонкиУстановить			= ЭлементИзменитьОригинал.Имя;
				ДанныеКолонкиУстановить			= ЭлементИзменитьОригинал.Данные;
				ТекстШапкиУстановить			= ЭлементИзменитьОригинал.ТекстШапки;
				ТолькоПросмотрУстановить		= ЭлементИзменитьОригинал.ТолькоПросмотр;
				ДоступростьУстановить			= ЭлементИзменитьОригинал.Доступность;
				ВидимостьУстановить				= ЭлементИзменитьОригинал.Видимость;
				КнопкаВыбораУстановить			= ЭлементИзменить.КнопкаВыбора;
				КнопкаОчисткиУстановить			= ЭлементИзменить.КнопкаОчистки;
				РежимВыбораИзСпискаУстановить	= ЭлементИзменить.РежимВыбораИзСписка;
				КнопкаСпискаВыбораУстановить	= ЭлементИзменить.КнопкаСпискаВыбора;
				
				ИмяПоляРазбить		= СтрЗаменить(ИмяПоляИзменить, ".", Символы.ПС);
				ИмяРодителяКолонки	= СтрПолучитьСтроку(ИмяПоляРазбить, 1);
				
				ЭлементРодителя		= ПолучитьЭлементФормыОбработки(МодульИзменить, ИмяРодителяКолонки);
				
				РеквизитИзменить		= МодульИзменить[ЭлементРодителя.Данные].Колонки;
				КолонкаУдалитьДанные	= РеквизитИзменить[ДанныеКолонкиУстановить];
				ИндексКолонкиДанные		= РеквизитИзменить.Индекс(КолонкаУдалитьДанные);
				РеквизитИзменить.Удалить(ИндексКолонкиДанные);
				РеквизитИзменить.Вставить(ИндексКолонкиДанные, ДанныеКолонкиУстановить, ТипУстановить);
				
				ИндексКолонкиЭлемента = ЭлементРодителя.Колонки.Индекс(ЭлементИзменитьОригинал); 
				ЭлементРодителя.Колонки.Удалить(ИндексКолонкиЭлемента);
				
				НоваяКолонкаЭлемента				= ЭлементРодителя.Колонки.Вставить(ИндексКолонкиЭлемента, ИмяКолонкиУстановить);
				НоваяКолонкаЭлемента.Имя			= ИмяКолонкиУстановить;
				НоваяКолонкаЭлемента.Данные			= ДанныеКолонкиУстановить;
				НоваяКолонкаЭлемента.ТекстШапки		= ТекстШапкиУстановить;
				НоваяКолонкаЭлемента.ТолькоПросмотр	= ТолькоПросмотрУстановить;
				НоваяКолонкаЭлемента.Доступность	= ДоступростьУстановить;
				НоваяКолонкаЭлемента.Видимость		= ВидимостьУстановить;
				
				ЭлементИзменить = НоваяКолонкаЭлемента.ЭлементУправления;
				ЭлементИзменить.КнопкаВыбора		= КнопкаВыбораУстановить;
				ЭлементИзменить.КнопкаОчистки		= КнопкаОчисткиУстановить;
				ЭлементИзменить.РежимВыбораИзСписка	= РежимВыбораИзСпискаУстановить;
				ЭлементИзменить.КнопкаСпискаВыбора	= КнопкаСпискаВыбораУстановить;
				ЭлементИзменить.ОграничениеТипа		= ТипУстановить;
				УстановитьДействияЭлементу(ЭлементИзменить, ДействияСобытийУстановить);
			КонецЕсли;
		#КонецЕсли
		
		Если ТипУстановить.Типы().Количество() > 1 Тогда
			ЭлементИзменить.ВыбиратьТип = Истина;
		Иначе
			ЭлементИзменить.ВыбиратьТип = Ложь;
		КонецЕсли;
		
	КонецЕсли;
		
	Если ИзмененияВходящие.Свойство("СписокВыбора") Тогда
		
		ЭлементИзменить.СписокВыбора.Очистить();
		
		СписокВыбораУстановить	= ИзмененияВходящие.СписокВыбора;
		ВыборИзСписка			= Истина;
		
		Если СписокВыбораУстановить = Ложь Тогда
			
			ВыборИзСписка = Ложь;
			
		КонецЕсли;
		
		#Если Не ТолстыйКлиентОбычноеПриложение Тогда
			
			ЭлементИзменить.РежимВыбораИзСписка = ВыборИзСписка;
			
		#КонецЕсли
		
		Если ВыборИзСписка Тогда
			
			Для Каждого ЭлементСписка Из СписокВыбораУстановить Цикл
				
				Если ТипЗнч(СписокВыбораУстановить) = Тип("СписокЗначений") Тогда
					ЭлементИзменить.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
				ИначеЕсли ТипЗнч(СписокВыбораУстановить) = Тип("Структура") Тогда
					ЭлементИзменить.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Ключ);
				Иначе
					// Предполагается массив строк
					ЭлементИзменить.СписокВыбора.Добавить(ЭлементСписка, ЭлементСписка);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если ИзмененияВходящие.Свойство("Подсказка") Тогда
		
		ЭлементИзменить.Подсказка = ИзмененияВходящие.Подсказка;
		
	КонецЕсли;
		
	Если ИзмененияВходящие.Свойство("ЦветФона") Тогда
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Если ТипЗнч(ЭлементИзменить) = Тип("ПолеВвода") Тогда
				ЭлементИзменить.ЦветФонаПоля = ИзмененияВходящие.ЦветФона;
			КонецЕсли;	
		#КонецЕсли
		
		ЭлементИзменить.ЦветФона = ИзмененияВходящие.ЦветФона;
		
	КонецЕсли;

	Если ИзмененияВходящие.Свойство("Заголовок") Тогда
		
		ЭлементФормы = ПолучитьЭлементФормыОбработки(МодульИзменить, ИмяПоляИзменить);
		
		Если ТипЗнч(ЭлементФормы) = Тип("КолонкаТабличногоПоля") Тогда
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				ЭлементФормы.ТекстШапки = ИзмененияВходящие.Заголовок;
			#Иначе
				ЭлементФормы.Заголовок = ИзмененияВходящие.Заголовок;
			#КонецЕсли
		Иначе
			ЭлементФормы.Заголовок = ИзмененияВходящие.Заголовок;
		КонецЕсли;
		
	КонецЕсли;

	Если ИзмененияВходящие.Свойство("ВыборГруппИЭлементов") Тогда
		
		ЭлементФормы = ПолучитьЭлементФормыОбработки(МодульИзменить, ИмяПоляИзменить);
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ЭлементФормы.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов[ИзмененияВходящие.ВыборГруппИЭлементов];
		#Иначе
			ЭлементФормы.ВыборГруппИЭлементов = ГруппыИЭлементы[ИзмененияВходящие.ВыборГруппИЭлементов];
		#КонецЕсли
		
	КонецЕсли;
	
	Если ИзмененияВходящие.Свойство("Картинка") Тогда
	
		ЭлементФормы = ПолучитьЭлементФормыОбработки(МодульИзменить, ИмяПоляИзменить);
		
		Если ТипЗнч(ИзмененияВходящие.Картинка) = Тип("Строка") Тогда
			ДвоичныеДанные = Base64Значение(ИзмененияВходящие.Картинка);
			Картинка = Новый Картинка(ДвоичныеДанные);
		ИначеЕсли ТипЗнч(ИзмененияВходящие.Картинка) = Тип("ДвоичныеДанные") Тогда
			Картинка = Новый Картинка(ИзмененияВходящие.Картинка);
		ИначеЕсли ТипЗнч(ИзмененияВходящие.Картинка) = Тип("Картинка") Тогда
			Картинка = ИзмененияВходящие.Картинка;
		КонецЕсли;
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ЭлементФормы.Картинка = Картинка;
		#Иначе
			МодульИзменить[ЭлементФормы.Имя] = ПоместитьВоВременноеХранилище(Картинка.ПолучитьДвоичныеДанные());
		#КонецЕсли
	
	КонецЕсли;
	
	Если ИзмененияВходящие.Свойство("Видимость") Тогда
	
		ЭлементИзменить.Видимость = ИзмененияВходящие.Видимость;
		
		ЭлементФормыЗаголовок = ПолучитьЭлементФормыОбработки(МодульИзменить, "Надпись" + ИмяПоляИзменить);
		Если НЕ ЭлементФормыЗаголовок = Неопределено Тогда
			ЭлементФормыЗаголовок.Видимость = ИзмененияВходящие.Видимость;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

//Функция - возвращает элемент формы по родителю и пути
&НаКлиенте
Функция ПолучитьЭлементФормыОбработки(ОтЭлемента, ПутьКЭлементу) Экспорт
	Перем лИмяТаблицы;
	
	ИмяЭлементаРазбивка = СтрЗаменить(ПутьКЭлементу, ".", Символы.ПС);
	Результат = ОтЭлемента; 
	
	ИсточникиПроверкиОбщие = Новый Массив;
	Для СчетчикРазбивки = 1 По СтрЧислоСтрок(ИмяЭлементаРазбивка) Цикл
		Если Результат = Неопределено Тогда
			
			Прервать;
			
		КонецЕсли;
		
		КлючПути = СокрЛП(СтрПолучитьСтроку(ИмяЭлементаРазбивка, СчетчикРазбивки));
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			Если		ТипЗнч(Результат) = Тип("Форма") Тогда
				
				ИсточникиПроверкиОбщие.Добавить(Результат.ЭлементыФормы);
				Результат = Неопределено;
				
			ИначеЕсли	ТипЗнч(Результат) = Тип("СтраницаПанели") Тогда
				// В случае страницы, поиск должен быть от формы
				
				Результат = Неопределено;
				
			ИначеЕсли	ТипЗнч(Результат) = Тип("ТаблицаЗначений")
				Или	ТипЗнч(Результат) = Тип("ТабличноеПоле") Тогда
				
				Результат = Результат["Колонки"];
				
			ИначеЕсли	ТипЗнч(Результат) = Тип("Панель") Тогда
				
				Результат = Результат["Страницы"];
				
			ИначеЕсли	ТипЗнч(Результат) = Тип("КоманднаяПанель")
					Или	ТипЗнч(Результат) = Тип("Кнопка") Тогда 
					
				Результат = Результат.Кнопки; 
				
			ИначеЕсли	ТипЗнч(Результат) = Тип("ДеревоЗначений")
					Или	ТипЗнч(Результат) = Тип("СтрокаДереваЗначений") Тогда
					
				Результат = Результат[КлючПути];
					
			Иначе
				
				// неизвестный элемент, может быть поиск от другого родительского элемента
				Результат = Неопределено; 
				
			КонецЕсли;
			
		#Иначе
			
			Если ТипЗнч(Результат) = Тип("УправляемаяФорма") Тогда
				
				Результат = Результат.Элементы; 
				
			ИначеЕсли	ТипЗнч(Результат) = Тип("ДанныеФормыДерево")
			    Или		ТипЗнч(Результат) = Тип("ДанныеФормыЭлементДерева") Тогда
				
				Результат = Результат.ПолучитьЭлементы();
				Продолжить;
				
			ИначеЕсли КлючПути = "Надпись" Тогда
				
				Продолжить;
				
			Иначе
				
				Результат = Результат["ПодчиненныеЭлементы"];
				
			КонецЕсли;
		#КонецЕсли
		
		Если КлючПути = "Страницы" Или КлючПути = "Строки" Тогда //1189641556
			
			Продолжить;
			
		КонецЕсли;
		
		ИменаДляПоиска = Новый Массив;
		ИменаДляПоиска.Добавить(КлючПути);
        Если	Не	лИмяТаблицы = Неопределено
            И	Не	Лев(КлючПути, СтрДлина(лИмяТаблицы)) = лИмяТаблицы Тогда
            // Это колонка ТЧ. В пути может уже быть прописано название колонки, либо надо поискать с дополнением имени ТЧ к колонке
			// Пример: Таблица_РеестрДокументов.ТекущийЭтап = Таблица_РеестрДокументов.Таблица_РеестрДокументовТекущийЭтап
            ИменаДляПоиска.Добавить(ОпределитьПолноеИмяКолонки(лИмяТаблицы, КлючПути));
			
		ИначеЕсли КлючПути = "Надпись" Тогда
			
			// Требуется поле надписи элемента.
			// У элемента на ОФ должно быть одноименное поле Надпись{ПолеЭлемента}. У УФ сам элемент им и является
			// Пример: Контент.Загрузка.Документ1С.Надпись
			ИменаДляПоиска.Вставить(0, КлючПути + СокрЛП(СтрПолучитьСтроку(ИмяЭлементаРазбивка, СчетчикРазбивки - 1)));
			
		КонецЕсли;
		
		ПараметрыНайти = Новый СписокЗначений;
		ПараметрыНайти.ЗагрузитьЗначения(ИсточникиПроверкиОбщие);
		Если Не Результат = Неопределено Тогда
			ПараметрыНайти.Вставить(0, Результат);
		КонецЕсли;
		
		Результат = ПолучитьЭлементФормыОбработки_Найти(ПараметрыНайти, ИменаДляПоиска);

        лИмяТаблицы = Неопределено;
		
		#Если Не ТолстыйКлиентОбычноеПриложение Тогда
			Если ТипЗнч(Результат) = Тип("ТаблицаФормы") Тогда
					
	            //Для хардкодных таблиц на УФ требуется дописать имя ТЧ в колонку
	            лИмяТаблицы = КлючПути;
				
			КонецЕсли;
		#КонецЕсли
		
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

// Функция - возвращает признак того, является ли поле полем ввода, которое изменяет данные, или нет
//
// Параметры:
//  ЭлементФормы - ЭлементФормы	 - тип, который надо проверить
// 
// Возвращаемое значение:
//  Булево - Истина если меняет
//
&НаКлиенте
Функция ЭлементМеняетДанные(ЭлементФормы) Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Возврат			ТипЗнч(ЭлементФормы) = Тип("ПолеВвода")
					Или ТипЗнч(ЭлементФормы) = Тип("ПолеВыбора")
					Или ТипЗнч(ЭлементФормы) = Тип("Флажок")	
		
	#КонецЕсли
	
КонецФункции

&НаКлиенте
Функция ПолучитьЭлементФормыОбработки_Найти(ИсточникиПоиска, ИменаПоиска)
	Перем Результат;
	
	Для Каждого ИмяПоиска Из ИменаПоиска Цикл
		
		Для Каждого ИсточникПоиска Из ИсточникиПоиска Цикл
			
			Результат = ИсточникПоиска.Значение.Найти(ИмяПоиска);
			
			Если Не Результат = Неопределено Тогда
				
				Возврат Результат;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

