
// Процедура записывает значение параметра по имени в кэш ГО и Глобальный кэш
//
// Параметры:
//  ИмяПараметраСбис		 - Строка					 - Ключ параметра
//  ЗначениеПараметраСбис	 - Произвольное значение	 - Значение параметра установить
//  ДопПараметры			 - Структура				 - 
//		Кэш			- экземпляр ЛокальныйКэш, куда установить параметр
//		Глобально	- Булево (Истина), определяет необходимость обновить параметр глобально, или изменение касается только класса ЛокальныйКэш
//		Параметры	- Стуркутра, доп. параметры для изменения
//		Адрес		- Строка, путь в кэше для установки параметра
//
Процедура ИзменитьПараметрСбис(ИмяПараметраСбис, ЗначениеПараметраСбис, ДопПараметры = Неопределено) Экспорт
	
	ЗначениеКэшПрописать	= ПолучитьГлобальныйКэшНаСервере();
	ТекущийСеансОбъект		= ЗначениеКэшПрописать.ТекущийСеанс;
	ЭтоГлобальныйПараметр	= Истина;
	
	Если	ИмяПараметраСбис = "Интеграция" Тогда
		
		ТранспортИнтеграции = ЭтотОбъект;
				
	ИначеЕсли	ТекущийСеансОбъект.Свойство(ИмяПараметраСбис) Тогда
		
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли	ТекущийСеансОбъект.Интерфейс.Свойство(ИмяПараметраСбис) Тогда
		
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Интерфейс." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

	ИначеЕсли	ТекущийСеансОбъект.ОписаниеКонфигурации.Свойство(ИмяПараметраСбис) Тогда

		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.ОписаниеКонфигурации." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

	ИначеЕсли	ТекущийСеансОбъект.Модули.Свойство(ИмяПараметраСбис) Тогда
		
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Модули." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли	ЗначениеКэшПрописать.СБИС.Свойство(ИмяПараметраСбис) Тогда
		
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

	ИначеЕсли	ЗначениеКэшПрописать.Парам.Свойство(ИмяПараметраСбис) Тогда

		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "Парам." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

	Иначе
		
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Параметры." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	КонецЕсли;
	
	СохранитьГлобальныйКэшНаСервере();
	
КонецПроцедуры

