
// Функция - читает общие настройки на стороне сервера
//
// Параметры:
//  КлючНастройки	 - Строка Необязательный	 - При необходимости получить не все настройки, а конкретное значение
// 
// Возвращаемое значение:
//  Значение настроек/настройки по ключу - Соответствие/Произвольный
//
Функция ПрочитатьПараметрыSABYИзХранилищаНастроек(КлючНастройки = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	КлючНастроекСохранить = ПараметрыКлючаОбщихНастроек();
	
	УстановитьПривилегированныйРежим(Истина);

	Если Не ДопПараметры = Неопределено
		И	ДопПараметры.Общее Тогда

		Результат = ХранилищеОбщихНастроек.Загрузить(	КлючНастроекСохранить.КлючОбъекта,
														КлючНастроекСохранить.КлючНастроек,
														,
														КлючНастроекСохранить.КлючОбъекта);
		
	Иначе
		
		Результат = ХранилищеОбщихНастроек.Загрузить(	КлючНастроекСохранить.КлючОбъекта,
														КлючНастроекСохранить.КлючНастроек);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Результат = Неопределено Тогда
		
		Результат = Новый Структура;
		
	КонецЕсли;
	
	Если Не КлючНастройки = Неопределено Тогда
		
		Если ТипЗнч(Результат) = Тип("Соответствие") Тогда
			
			Результат = Результат.Получить(КлючНастройки);
			
		ИначеЕсли ТипЗнч(Результат) = Тип("Структура") Тогда
			
			Результат.Свойство(КлючНастройки, Результат);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СохранитьПараметрыSABYВХранилищеНастроек(ЗначенияОбновить, ДопПараметры = Неопределено) Экспорт
	
	ОбщиеНастройки = ПрочитатьПараметрыSABYИзХранилищаНастроек(, ДопПараметры);													
	
	Для Каждого Элемент Из ЗначенияОбновить Цикл
		
		Если Элемент.Значение = Неопределено Тогда
			
			ОбщиеНастройки.Удалить(Элемент.Ключ);
			
		Иначе

			ОбщиеНастройки.Вставить(Элемент.Ключ, Элемент.Значение);
			
		КонецЕсли;
		
	КонецЦикла;

	КлючНастроекСохранить = ПараметрыКлючаОбщихНастроек();

	УстановитьПривилегированныйРежим(Истина);

	Если Не ДопПараметры = Неопределено
		И	ДопПараметры.Общее Тогда

		ХранилищеОбщихНастроек.Сохранить(	КлючНастроекСохранить.КлючОбъекта,
											КлючНастроекСохранить.КлючНастроек,
											ОбщиеНастройки,
											,
											КлючНастроекСохранить.КлючОбъекта);
											
	Иначе										
		
		ХранилищеОбщихНастроек.Сохранить(	КлючНастроекСохранить.КлючОбъекта,
											КлючНастроекСохранить.КлючНастроек,
											ОбщиеНастройки);

	КонецЕсли;
										
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

