
// Процедура - Сохранить в файл на диск
//
// Параметры:
//  ЧтоСохранить		 - Строка, Структура	 - описание что сохранить
//  ИмяФайлаДляЗаписи	 - Строка				 - полное имяфайла для записи
//
&НаКлиенте
Функция яСохранитьВФайлНаДиск(ЧтоСохранить, ДопПараметры) Экспорт
	Перем ИмяФайлаДляЗаписи;
		
	Если ДопПараметры = Неопределено Тогда
		
		ИмяФайлаДляЗаписи = НовыйВременныйФайлКлиент();
		
	ИначеЕсли Не ДопПараметры.Свойство("ПолноеИмяФайла", ИмяФайлаДляЗаписи) Тогда
		
		ПараметрыФайла = Новый Структура("Имя, Расширение, Каталог");
		ЗаполнитьЗначенияСвойств(ПараметрыФайла, ДопПараметры);
		ИмяФайлаДляЗаписи = НовыйВременныйФайлКлиент(ПараметрыФайла);
		
	КонецЕсли;
	
	ЧтоСохранить.Вставить("ПолноеИмяФайла", ИмяФайлаДляЗаписи);

	Если		ЧтоСохранить.Тип = "текст" Тогда 
		
		Возврат яСохранитьВФайлНаДиск_Текст(ЧтоСохранить, ДопПараметры);
		
	ИначеЕсли	ЧтоСохранить.Тип = "url" Тогда
		
		Возврат яСохранитьВФайлНаДиск_URL(ЧтоСохранить, ДопПараметры);
		
	Иначе	
		
		Возврат НовыйСбисИсключение("Неизвестный тип для записи на локальный диск (" + ЧтоСохранить.Тип + ")!", МодульОбъектаКлиентСервер_Представление() + "СохранитьВФайлНаДиск")
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция яСохранитьВФайлНаДиск_Текст(ЧтоЗаписать, ДопПараметры)
	
	Попытка
		
		ИмяФайлаДляЗаписи	= ЧтоЗаписать.ПолноеИмяФайла;
		СтрокаДляЗаписи		= ЧтоЗаписать.Значение;
		ДанныеФайлаРазбить	= Saby_СтрРазделить82(ИмяФайлаДляЗаписи, ".");
		РасширениеФайла		= ДанныеФайлаРазбить[ДанныеФайлаРазбить.ВГраница()];
		Если РасширениеФайла = "xml" Тогда
			
			ВременныйФайлТекст = Новый ЗаписьТекста(ИмяФайлаДляЗаписи, ОпределитьКодировкуФайлаXML(СтрокаДляЗаписи));
			
		Иначе
			
			ВременныйФайлТекст = Новый ЗаписьТекста(ИмяФайлаДляЗаписи);
			
		КонецЕсли;	
		
		ВременныйФайлТекст.Записать(СтрокаДляЗаписи);
		ВременныйФайлТекст.Закрыть();
		
	Исключение
		
		ОшибкаЗаписи = НовыйСбисИсключение(ИнформацияОбОшибке(), МодульОбъектаКлиентСервер_Представление() + "СохранитьВФайлНаДиск.Текст");
		ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаЗаписи);
		
	КонецПопытки;
	
	Возврат ИмяФайлаДляЗаписи;
	
КонецФункции

&НаКлиенте
Функция яСохранитьВФайлНаДиск_URL(ЧтоЗаписать, ДопПараметры)
	
	ИмяФайлаДляЗаписи	= ЧтоЗаписать.ПолноеИмяФайла;
	СтрокаДляЗаписи		= ЧтоЗаписать.Значение;

	ПараметрыДляСкачать = Новый Структура("Ссылка, ИмяФайла", СтрокаДляЗаписи, ИмяФайлаДляЗаписи);
	МодульСкачивания	= ПараметрSABY("Интеграция", "Сеанс");
	Кэш					= ПолучитьТекущийЛокальныйКэш();
	ОшибкаСкачивания	= Ложь;
	
	РезультатСкачивания = МодульСкачивания.СБИС_СохранитьПоСсылкеВФайл(Кэш, ПараметрыДляСкачать, Новый Структура, ОшибкаСкачивания);
	
	Если ОшибкаСкачивания Тогда
		
		ОшибкаСкачивания = НовыйСбисИсключение(РезультатСкачивания, МодульОбъектаКлиентСервер_Представление() + ".СохранитьВФайлНаДиск");
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаСкачивания);
		
	КонецЕсли;
	
	Возврат РезультатСкачивания;
	
КонецФункции

&НаКлиенте
Функция яОтправитьФайлНаДиск(ЧтоСохранить, ДопПараметры)
	
	context_params			= ПараметрSABY("context_params", "vo3");
	МодульТранспортVO3		= ПараметрSABY("ТранспортИнтеграции", "vo3");
	
	Если ТипЗнч(ЧтоСохранить.Значение) = Тип("Файл") Тогда
		
		ОписаниеФайлаДляЗаписи	= ЧтоСохранить.Значение;
		
	Иначе
		
		ОписаниеФайлаДляЗаписи = Новый Файл(ЧтоСохранить.Значение);
		
	КонецЕсли;
	
	РасширениеФайла = СтрЗаменить(ОписаниеФайлаДляЗаписи.Расширение, ".", "");
	
	ФайлОтправить = Новый Структура("ДвоичныеДанные, Имя, ContentType"); 
	ФайлОтправить.Имя				= ОписаниеФайлаДляЗаписи.Имя;
	ФайлОтправить.ДвоичныеДанные	= ПолучитьBASE64ПоИмениФайлаКлиент(ОписаниеФайлаДляЗаписи.ПолноеИмя);
	ФайлОтправить.ContentType		= "application/" + РасширениеФайла;
	
	Попытка

		РезультатОтправки = МодульТранспортVO3.ЗагрузитьВременныеФайлыНаДискСБИС(context_params, Новый Структура("Файл", ФайлОтправить));
		Возврат РезультатОтправки.Файл.Ссылка;
		
	Исключение
		
		ОшибкаВызова = НовыйСбисИсключение(ИнформацияОбОшибке(), МодульОбъектаСервер() + "яОтправитьФайлНаДиск");
		ВызватьИсключение СбисИсключение_Выгрузить(РезультатОтправки);
		
	КонецПопытки;	
		
КонецФункции

