
///////////////////////////////////////////////////
//////////////////Внешние функции//////////////////
///////////////////////////////////////////////////

&НаКлиенте
Процедура	сбисПодключитьЗаплатки(Кэш, ДопПараметры) Экспорт
	Перем МестаПоискаВФК;
	
	// Подключает внешнюю обработку с пользовательскими функциями
	ПоследниеСвенденияВФК	= МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ВФК");
	ПараметрыФункций		= Новый Структура("ИмяВнешнихФункций, СведенияПоследнемЗапускеВФК", "ВнешниеФункции_Клиент");
	Если Не ПоследниеСвенденияВФК = Неопределено Тогда
		
		// ВФК запущены с отладкой. Поиск не проводится.
		Если	ПоследниеСвенденияВФК.СведенияОЗапуске.Свойство("Отладка")
			И	ПоследниеСвенденияВФК.СведенияОЗапуске.Отладка Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ПараметрыФункций.СведенияПоследнемЗапускеВФК = ПоследниеСвенденияВФК.СведенияОЗапуске;
		
	КонецЕсли;
	
	ДопПараметры.Свойство("МестаПоиска", МестаПоискаВФК);
	
	Попытка
		
		ДанныеЗаписи = ПолучитьАдресВнешнихФункций(ПараметрыФункций, МестаПоискаВФК, Кэш.ПараметрыСистемы);
		
	Исключение
		
		ОшибкаВФК = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "ФайлыНастроекОбщее.сбисПодключитьЗаплатки");
		МодульОбъектаКлиент().СбисСообщить(ОшибкаВФК);
		
		Возврат;
		
	КонецПопытки;
	
	Если Не	ДанныеЗаписи.Заплатки = "без изменений" Тогда
		
		МодульОбъектаКлиент().ИзменитьПараметрТекущегоСеанса("ВФК", ДанныеЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресВнешнихФункций(Знач ПараметрыФункций, МестаПоискаОбработки, ПараметрыСистемы)	Экспорт
	
	МодульОбъектаСервер			= МодульОбъектаСервер();
	ПараметрыПоискаОбработок	= Новый Структура("ИмяФайла", "ВнешниеФункции_Клиент");
	
	Если МестаПоискаОбработки = Неопределено Тогда
		
		МестаПоискаОбработки = МодульОбъектаСервер.ВнешняяОбработка_МестаПоискаПоУмолчанию();
		
	КонецЕсли;
	
	ДанныеВФК = МодульОбъектаСервер.ВнешняяОбработка_НайтиДанные(МестаПоискаОбработки, ПараметрыПоискаОбработок);
	
	Если ТипЗнч(МестаПоискаОбработки) = Тип("Массив") Тогда
		
		Для Каждого МестоПоиска Из МестаПоискаОбработки Цикл
			
			ЗаписьМестаПоиска = ПолучитьАдресВнешнихФункций_ПоискПоДанным(ДанныеВФК, МестоПоиска, ПараметрыФункций, ПараметрыСистемы);
			Если ЗаписьМестаПоиска.Заплатки = Ложь Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Прервать;
				
		КонецЦикла;
		
	Иначе
		
		ЗаписьМестаПоиска = ПолучитьАдресВнешнихФункций_ПоискПоДанным(ДанныеВФК, МестаПоискаОбработки, ПараметрыФункций, ПараметрыСистемы);
		
	КонецЕсли;
	
	Возврат ЗаписьМестаПоиска;
	
КонецФункции

&НаСервере
Функция ПолучитьАдресВнешнихФункций_ПоискПоДанным(ДанныеВФК, МестоПоиска, ПараметрыФункций, ПараметрыСистемы)
	
	МодульОбъектаСервер = МодульОбъектаСервер();
	ЗаписьМестаПоиска	= Новый Структура("СведенияОЗапуске, СписокКлиентскихФорм, Заплатки", Новый Структура, Новый СписокЗначений, Ложь);
	
	УправляемоеПриложение		= ПараметрыСистемы.Клиент.УправляемоеПриложение; 
	КодЯзыка					= ПараметрыСистемы.Конфигурация.ВстроенныйЯзык;
	ИмяВнешнихФункций			= ПараметрыФункций.ИмяВнешнихФункций;
	
	ДанныеДляЗаплаток = ДанныеВФК.Получить(МестоПоиска.Путь);
	
	Если ДанныеДляЗаплаток.Значение = Неопределено Тогда
		
		Возврат ЗаписьМестаПоиска;
	
	КонецЕсли;
	
	ДанныеЗаплаток = МодульОбъектаСервер.ВнешняяОбработка_Данные(ДанныеДляЗаплаток.Значение);
	
	Если 	ЗначениеЗаполнено(ПараметрыФункций.СведенияПоследнемЗапускеВФК)
		И	ПараметрыФункций.СведенияПоследнемЗапускеВФК.ИД			= ДанныеДляЗаплаток.ИД
		И	ПараметрыФункций.СведенияПоследнемЗапускеВФК.ХешСумма	= ДанныеЗаплаток.ХешСумма Тогда
		
		ЗаписьМестаПоиска.Заплатки = "без изменений";
		Возврат ЗаписьМестаПоиска;
		
	КонецЕсли;
	
	Если		МестоПоиска.Свойство("ХешСумма")
		И Не	МестоПоиска.ХешСумма = ДанныеЗаплаток.ХешСумма Тогда
		
		// Был указан хеш для сравнения и он не совпал. 
		Возврат ЗаписьМестаПоиска;
		
	КонецЕсли;
	
	ВнешняяОбработкаДанные	= МодульОбъектаСервер.ВнешняяОбработка_Создать(ДанныеЗаплаток, ПараметрыФункций.СведенияПоследнемЗапускеВФК);
		
	// Сразу, пока на сервере, определим клиентские формы
	Для Каждого Фрм Из ВнешняяОбработкаДанные.Значение.Метаданные().Формы Цикл
		
		ЗаписьМестаПоиска.СписокКлиентскихФорм.Добавить(Фрм.Имя);
		
	КонецЦикла;

	Если УправляемоеПриложение Тогда
		
		Если ВнешняяОбработкаДанные.Тип = "ОбработкаОбъект" Тогда
			
			ВнешняяОбработка = СтрЗаменить(НСтр("ru = 'Обработка.%func%.Форма.'; en = 'DataProcessor.%func%.Form.'",КодЯзыка), "%func%", ИмяВнешнихФункций);
			
		Иначе
			
			ЗарегистрированоИмяВФК	= ВнешняяОбработкаДанные.Значение.Метаданные().Имя;
			ВнешняяОбработка = СтрЗаменить(НСтр("ru = 'ВнешняяОбработка.%func%.Форма.'; en = 'ExternalDataProcessor.%func%.Form.'",КодЯзыка), "%func%", ЗарегистрированоИмяВФК);
			
		КонецЕсли;
		
	Иначе
		
		ВнешняяОбработка = ВнешняяОбработкаДанные.Значение;
		
	КонецЕсли;
	
	ЗаписьМестаПоиска.Заплатки = ВнешняяОбработка;
	ЗаписьМестаПоиска.СведенияОЗапуске.Вставить("ХешСумма",		ДанныеЗаплаток.ХешСумма);
	ЗаписьМестаПоиска.СведенияОЗапуске.Вставить("ИД",			ДанныеДляЗаплаток.ИД);
	ЗаписьМестаПоиска.СведенияОЗапуске.Вставить("Поиск",		ДанныеДляЗаплаток.Поиск);
	Если ДанныеДляЗаплаток.Свойство("Отладка") Тогда
		
		ЗаписьМестаПоиска.СведенияОЗапуске.Вставить("Отладка", ДанныеДляЗаплаток.Отладка);
		
	КонецЕсли;
	
	Возврат ЗаписьМестаПоиска;
	
КонецФункции

&НаКлиенте
Процедура ПереключитьЗаплаткиДляОтладки_Отложенно(Параметр1, ПоследниеСвенденияВФК) Экспорт
	
	МодульОбъектаКлиент = МодульОбъектаКлиент();

	РежимОтладки = МодульОбъектаКлиент.ПараметрSABY("РежимОтладки", "Пользователь");
	СведенияоВФК = МодульОбъектаКлиент.ПараметрSABY("ВФК",			"Сеанс");
	
	Если	Не СведенияоВФК = Неопределено Тогда

		Если РежимОтладки Тогда
			
			Если	Не	СведенияоВФК.Заплатки = Ложь
					И	СведенияоВФК.СведенияОЗапуске.Поиск.Алгоритм = "Запрос" Тогда
				
				ИзменитьПараметрОтложенно = МодульОбъектаКлиент.НовыйСбисОписаниеОповещения("ПодключитьЗаплаткиДляОтладки_Диалог", ЭтаФорма, СведенияоВФК);
						
				#Если ТолстыйКлиентОбычноеПриложение Тогда
						
					МодульОбъектаКлиент.ВыполнитьСбисОписаниеОповещения(ИзменитьПараметрОтложенно, КодВозвратаДиалога.Да);
					
				#Иначе
					
					МодульОбъектаКлиент.СбисПоказатьВопрос(
						ИзменитьПараметрОтложенно,
						"Установить внешние функции из справочника в режим отладки? Для продолжения потребуется перезапустить обработку!", 
						РежимДиалогаВопрос.ДаНет);
					
				#КонецЕсли
						
			КонецЕсли;
			
		ИначеЕсли	СведенияоВФК.СведенияОЗапуске.Свойство("Отладка")
				И	СведенияоВФК.СведенияОЗапуске.Отладка Тогда
				
			ИзменитьПараметрОтложенно = МодульОбъектаКлиент.НовыйСбисОписаниеОповещения("ПодключитьЗаплаткиДляОтладки_Диалог", ЭтаФорма, СведенияоВФК);
					
			#Если ТолстыйКлиентОбычноеПриложение Тогда
					
				МодульОбъектаКлиент.ВыполнитьСбисОписаниеОповещения(ИзменитьПараметрОтложенно, КодВозвратаДиалога.Да);
				
			#Иначе
				
				МодульОбъектаКлиент.СбисПоказатьВопрос(
					ИзменитьПараметрОтложенно,
					"Для отключения отладки внешних функций потребуется перезапустить обработку! Завершить работу обработки?", 
					РежимДиалогаВопрос.ДаНет);
				
			#КонецЕсли
		
		КонецЕсли;		
			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура	ПодключитьЗаплаткиДляОтладки_Диалог(РезультатДиалога, СведенияОВФК) Экспорт
	
	Если Не РезультатДиалога = КодВозвратаДиалога.Да Тогда
		
		Возврат;
		
	КонецЕсли;
	МодульОбъектаКлиент = МодульОбъектаКлиент();
	
	ПараметрыПоискаОбработок = Новый Структура("ИмяФайла, НаКлиент", "ВнешниеФункции_Клиент_Отладка", Истина);

	Если	СведенияоВФК.СведенияОЗапуске.Свойство("Отладка")
		И	СведенияоВФК.СведенияОЗапуске.Отладка Тогда
		
		МодульОбъектаКлиент.ИзменитьПараметрSABY("ВФКДляПерезапуска",,"Технический");
		СведенияоВФК.СведенияОЗапуске.Отладка = Ложь;
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			ФормаНастройки = МодульОбъектаКлиент.ПараметрSABY("Настройки", "Сеанс");
			ФормаНастройки.СбисПодключитьЗаплатки(Кэш, Новый Структура("КаталогНастроек", МодульОбъектаКлиент.ПараметрSABY("КаталогНастроек")));
			Возврат;
			
		#КонецЕсли	
			
	Иначе
		
		// Сохранить файл из справочника в каталог отладки и запустить оттуда
		ФайлВФКНаСервере	= МодульОбъектаКлиентСервер().ВнешняяОбработка_Сохранить(СведенияоВФК.СведенияОЗапуске.Поиск, ПараметрыПоискаОбработок);
		КататалогДляФайла	= МодульОбъектаКлиент.ПараметрSABY("КаталогОтладки");
		ИмяФайлаНаКлиенте	= МодульОбъектаКлиент.НовыйВременныйФайлКлиент(КататалогДляФайла + ПараметрыПоискаОбработок.ИмяФайла, "epf", "постоянно");
		
		СбисДанныеФайла		= ПолучитьИзВременногоХранилища(ФайлВФКНаСервере);
		СбисДанныеФайла.Записать(ИмяФайлаНаКлиенте);
		
		ХешФайлаВФК = МодульОбъектаКлиентСервер().ХешСуммаЗначенияSABY(Новый Файл(ИмяФайлаНаКлиенте));
		
		МестаПоискаОбработки = Новый Структура(
			"Путь,				Алгоритм,	Имя,								ХешСумма",
			КататалогДляФайла,	"Отладка",	ПараметрыПоискаОбработок.ИмяФайла,	ХешФайлаВФК);
			
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			ДопПараметры = Новый Структура("МестаПоиска", МестаПоискаОбработки);		
			сбисПодключитьЗаплатки(Кэш, ДопПараметры);	
			Возврат;
			
		#КонецЕсли	
			
		МодульОбъектаКлиент.ИзменитьПараметрSABY("ВФКДляПерезапуска", МестаПоискаОбработки,	"Технический");
		МодульОбъектаКлиент.ИзменитьПараметрSABY("УстановитьОтладку", Истина,				"Технический");
	КонецЕсли;
	
	МодульОбъектаКлиент.ЗавершитьРаботуSABY();
		
КонецПроцедуры

#Область include_core2_vo2_Настройки_ФайлыНастроек_Общее_ВФК_Фильтры
#КонецОбласти

