
//Функция определяет ини на выгрузку
&НаКлиенте
Процедура Ини_ЗаполнитьПараметрыПередРасчетом(ИниЗначение) Экспорт
	
	МодульОбъектаКлиент		= МодульОбъектаКлиент();
	_ИспользоватьШтрихкоды	= МодульОбъектаКлиент.ПолучитьПараметрПользователя("ИспользоватьШтрихкодыНоменклатурыКонтрагентов");
	
	ВходящийКонтекстРасчета = Новый Структура;
	ВходящийКонтекстРасчета.Вставить("ИспользоватьНовыйФорматАктаСверки",	МодульОбъектаКлиент.ПолучитьПараметрПользователя("ИспользоватьНовыйФорматАктаСверки"));
	ВходящийКонтекстРасчета.Вставить("РеквизитКодаНоменклатуры",			МодульОбъектаКлиент.ПолучитьЗначениеПараметраСбис("РеквизитКодаНоменклатуры"));
	ВходящийКонтекстРасчета.Вставить("УПД24",								Истина);
	
	НастройкиЭДОДляРасчета = Новый Структура;
	НастройкиЭДОДляРасчета.Вставить("РеквизитКодаНоменклатуры", 	ВходящийКонтекстРасчета.РеквизитКодаНоменклатуры);
	НастройкиЭДОДляРасчета.Вставить("АктивныАктыИНакладные",		МодульОбъектаКлиент.ПолучитьЗначениеФичи("1c_oldformatactnacl"));
	НастройкиЭДОДляРасчета.Вставить("ОтображениеАктовИНакладных",	МодульОбъектаКлиент.ПолучитьПараметрПользователя("ОтображениеАктовИНакладных"));
	
	НастройкиДляРасчета = Новый Структура("ЭДО", НастройкиЭДОДляРасчета);
	Если МодульОбъектаКлиент.ПолучитьЗначениеПараметраСбис("ПрикреплятьСчетНаОплатуКДокументуУПД") Тогда
		
		ДокументДляСчетаНаОплату = МодульОбъектаКлиент.ПолучитьЗначениеПараметраСбис("ДокументДляСчетаНаОплату");
		
	Иначе
		
		ДокументДляСчетаНаОплату = "";
		
	КонецЕсли;
	
	ВходящийКонтекстРасчета.Вставить("ДокументДляСчетаНаОплату", ДокументДляСчетаНаОплату);
	
	ИниЗначение.Вставить("Формат2016",										Новый Структура("Значение, РассчитанноеЗначение", Истина, Истина));
	ИниЗначение.Вставить("Формат2019",										Новый Структура("Значение, РассчитанноеЗначение", Истина, Истина));
	ИниЗначение.Вставить("ФорматУКД2020",									Новый Структура("Значение, РассчитанноеЗначение", Истина, Истина));
	ИниЗначение.Вставить("ВходящийКонтекст",								Новый Структура("Значение, РассчитанноеЗначение", "", ВходящийКонтекстРасчета));
	ИниЗначение.Вставить("Настройки",										Новый Структура("Значение, РассчитанноеЗначение", "", НастройкиДляРасчета));
	ИниЗначение.Вставить("ИспользоватьШтрихкодыНоменклатурыКонтрагентов",	Новый Структура("Значение, РассчитанноеЗначение", _ИспользоватьШтрихкоды, _ИспользоватьШтрихкоды));	
	
КонецПроцедуры

