
&НаКлиенте
Функция ОбновитьДанныеИни(СтруктураИни, Отказ) Экспорт

	Попытка
		
		ПараметрыФормированияКомандПечати = МодульОбъектаКлиент().ПараметрыДляРегистрацииПечатнойФормы();
		ПараметрыФормированияКомандПечати.Вставить("СписокДокументов", СтруктураИни_СписокДокументовДляПечатныхФорм(СтруктураИни));
		
		ПараметрыПередатьНаСервер = Новый Структура("Ини, КомандыПФ", СтруктураИни, ПараметрыФормированияКомандПечати);
		

		ОбновитьДанныеИни_ВызовСервера(ПараметрыПередатьНаСервер, Отказ);
		
	Исключение
		
		Отказ = Истина;
		Возврат МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "ФайлыНастроекОбщее.ОбновитьДанныеИни");
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ОбновитьДанныеИни_ВызовСервера(Знач ПараметрыПередать, Отказ) Экспорт
	
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
		МодульОбъектаСервер().ОбновитьПараметрГлобальногоМодуляНаСервере("КэшИни");
		МодульОбъектаСервер().ОбновитьПараметрГлобальногоМодуляНаСервере("Ини", ПараметрыПередать.Ини);
	#КонецЕсли

	Попытка

		ДобавитьКомандыПечатиНаФормыНаСервере(ПараметрыПередать.КомандыПФ);
		
	Исключение
		
		ОшибкаПФ = МодульОбъектаСервер().НовыйСбисИсключение(ИнформацияОбОшибке(), "ФайлыНастроекОбщее.ДобавитьКомандыПечатиНаФормыНаСервере");
		ВызватьИсключение МодульОбъектаСервер().СбисИсключение_ВСтроку(ОшибкаПФ);
		
	КонецПопытки;
	
КонецФункции

#Область include_core2_vo2_Настройки_ФайлыНастроек_Общее_ОбновитьДанныеИни_ПечатныеФормы
#КонецОбласти

