
// Функция - Собирает отладочную информацию главного окна
//
// Параметры:
//  ПараметрыВходящие	 - 	 - 
//  Отказ				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Функция МодульОбработки_Выгрузить(РежимВыгрузки, ДопПараметры) Экспорт
	
	Если РежимВыгрузки = "ТехническаяИнформация" Тогда
		
		СбисСформироватьОбщуюИнформациюДляТП(МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш(), ДопПараметры);
		
	Иначе
		
		ВызватьИсключение "Неизвестный формат выгрузки для модуля ""ФормаГлавноеОкно"": """ + РежимВыгрузки + """.";
		
	КонецЕсли;
	
КонецФункции

