
&НаКлиенте
Процедура WriteDocumentEx(АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт
	
	ОшибкаВызова		= Ложь;
	АргументДляВызова	= АсинхроннаяСБИСКоманда.АргументВызова;
	
	КомандаПлагина	= НовыйКомандаСБИСПлагин(ДопПараметры.Кэш, АсинхроннаяСБИСКоманда, Новый Структура("Метод", "WriteDocumentEx"));
	КомандаПлагина.Параметры = Новый Структура("Document", АргументДляВызова);
	РезультатВызова	= СБИС_ОтправитьКомандуБезОбработки(ДопПараметры.Кэш, КомандаПлагина, Новый Структура, ОшибкаВызова);
	
	АсинхроннаяСБИСКоманда.ВремяВызова = КомандаПлагина.ВремяВызова;
	
	Если ОшибкаВызова Тогда
		МодульОбъектаКлиент().ВызватьСбисИсключение(РезультатВызова, ДопПараметры.Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ". ");
	КонецЕсли;
		
КонецПроцедуры 

//Обработка успешной отправки пакета
&НаКлиенте
Процедура WriteDocumentEx2_Message(РезультатВызова, ПараметрыОбработки) Экспорт
	
	WriteDocumentEx2_ОбработатьВременныеФайлы(РезультатВызова, ПараметрыОбработки);
	МодульОбъектаКлиент().МассоваяОперация_Асинх_Ответ(РезультатВызова, ПараметрыОбработки);
	
КонецПроцедуры

//Обработка ошибки отправки
&НаКлиенте
Процедура WriteDocumentEx2_Error(РезультатВызова, ПараметрыОбработки) Экспорт
	
	WriteDocumentEx2_ОбработатьВременныеФайлы(РезультатВызова, ПараметрыОбработки);
	МодульОбъектаКлиент().МассоваяОперация_Асинх_Ошибка(РезультатВызова, ПараметрыОбработки)
	
КонецПроцедуры

//Вспомогательная функция, чисто под способ обмена.
&НаКлиенте
Процедура WriteDocumentEx2_ОбработатьВременныеФайлы(РезультатВызова, ПараметрыОбработки)
	
	Попытка
		ОтправкаДокументаСБИС	= ПараметрыОбработки.Команда.АргументВызова;
		ВложенияОбработаны		= МодульОбъектаКлиент().ОтправкаДокументаСБИС_Получить(ОтправкаДокументаСБИС, "ДокументОтправить").Вложение;
		Для Каждого ВложениеПакета Из ВложенияОбработаны Цикл
			КлючВременногоФайла = ВложениеПакета;
			Если	Не КлючВременногоФайла.Свойство("Файл",			КлючВременногоФайла)
				Или Не КлючВременногоФайла.Свойство("ПутьКФайлу",	КлючВременногоФайла) Тогда
				Продолжить;
			КонецЕсли;
			
			МодульОбъектаКлиент().ОсвободитьВременныйФайл(КлючВременногоФайла);

		КонецЦикла;
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура WriteDocumentEx_УстановитьПодпискиСобытий(АсинхроннаяСбис3Команда, ДопПараметры=Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Error",		Новый Структура("Функция",					"WriteDocumentEx2_Error"));
	Результат.Вставить("Message",	Новый Структура("Функция, ФункцияОшибки",	"WriteDocumentEx2_Message", "WriteDocumentEx2_Error"));
	
	МодульОбъектаКлиент().АсинхроннаяСбисКоманда_Установить(АсинхроннаяСбис3Команда, "События", Результат);
				
КонецПроцедуры
