 
&НаКлиенте
Функция НовыйКомандаСБИСПлагин(Кэш, АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт
	Перем СбисАккаунт;

	Результат = Новый Структура("Метод,	Параметры, Модуль, ВремяВызова, Идентификатор, Аккаунт, Контракт");
	ЗаполнитьЗначенияСвойств(Результат, АсинхроннаяСБИСКоманда);
	ЗаполнитьЗначенияСвойств(Результат, ДопПараметры);
	
	Результат.Параметры	= АсинхроннаяСБИСКоманда.АргументВызова;
	Если Результат.Модуль = Неопределено Тогда
		Результат.Модуль	= "ExtSdk2";
	КонецЕсли;
	Если Результат.Аккаунт = Неопределено Тогда
		Результат.Аккаунт	= СбисИдАккаунта(Кэш);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

