
//DynamicDirective

Функция _СбисОписаниеОповещения_СоздатьСтруктуру(СбисПроцедура, СбисМодуль, СбисДопПараметры = Неопределено, СбисПроцедураИсключения = Неопределено, СбисМодульИсключения = Неопределено)
	
	// Для теста вызова надо снизить падения при тесте метода и обернуть все вызовы на "SabyТестВызова"
	//ТестФункции = НайтиФункциюСеансаОбработки(СбисПроцедура, СбисМодуль);
	//Если ТестФункции = Ложь Тогда
	//	
	//	ВызватьИсключение "Ошибка при вызове конструктора ""(СбисОписаниеОповещения)"". Метод не найден.";
	//	
	//КонецЕсли;
	ОписаниеОповещенияРезультат = НовыйОбъектSABY("СбисОписаниеОповещения");
	ОписаниеОповещенияРезультат.Вставить("ИмяПроцедуры", СбисПроцедура);
	ОписаниеОповещенияРезультат.Вставить("Модуль", СбисМодуль);
	ОписаниеОповещенияРезультат.Вставить("ДополнительныеПараметры", СбисДопПараметры);
	ОписаниеОповещенияРезультат.Вставить("ИмяПроцедурыОбработкиОшибки", СбисПроцедураИсключения);
	ОписаниеОповещенияРезультат.Вставить("МодульОбработкиОшибки", СбисМодульИсключения);
	
	Возврат ОписаниеОповещенияРезультат;
	
КонецФункции

//DynamicDirective

Процедура _СбисОписаниеОповещения_Выполнить_Струкутра(РезультатВызова, СбисОписаниеОповещения)
	
	Попытка
		
		Выполнить("СбисОписаниеОповещения.Модуль." + СбисОписаниеОповещения.ИмяПроцедуры + "(РезультатВызова, СбисОписаниеОповещения.ДополнительныеПараметры)");
		
	Исключение
		
		СтандартнаяОбработка = Истина;
		Если ЗначениеЗаполнено(СбисОписаниеОповещения.ИмяПроцедурыОбработкиОшибки) Тогда
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Выполнить("СбисОписаниеОповещения.МодульОбработкиОшибки." + СбисОписаниеОповещения.ИмяПроцедурыОбработкиОшибки + "(ИнформацияОбОшибке, СтандартнаяОбработка, СбисОписаниеОповещения.ДополнительныеПараметры)");
			
		КонецЕсли;
		
		Если СтандартнаяОбработка Тогда
			
			ВызватьИсключение;
			
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры

