
//DynamicDirective

// Функция - Проверка типа в упрощенном виде.
//
// Параметры:
//  ПрикладнойОбъектSABY	 - ПрикладнойОбъектSABY	 - Структура, с преопределенными полями
//  ТипПроверить		 - Строка				 - Имя типа SABY
// 
// Возвращаемое значение:
//  Произвольный - уданенное свойство класса
//
Функция ПрикладнойОбъектSABY_Выгрузить(ПрикладнойОбъектSABY, ФорматВыгрузкиОбъекта = "объект") Экспорт 

	Если Не ОбъектSABY_ЭтоТип(ПрикладнойОбъектSABY, "ПрикладнойОбъектSABY") Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	ФорматВыгрузкиТест = НРег(ФорматВыгрузкиОбъекта);
	
	Если ФорматВыгрузкиТест = "объект" Тогда
		
		// Выгрузка без формата. Убираем все приватные свойства объекта.
		СтруктураСвойств = Новый Структура;
		Для Каждого КлючИЗначение Из ПрикладнойОбъектSABY Цикл
			
			Если Лев(КлючИЗначение.Ключ, 1) = "_" Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			СтруктураСвойств.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			
		КонецЦикла;
		
		Возврат СтруктураСвойств;
		
	ИначеЕсли	ФорматВыгрузкиТест = "json" Тогда
		
		Возврат ПреобразоватьЗначениеВJSON(ПрикладнойОбъектSABY);
		
	ИначеЕсли	ФорматВыгрузкиТест = "цикл" Тогда
		
		// Реализация объекта для перебора свойств класса, без служебных
		Результат = СоздатьКопиюОбъекта(ПрикладнойОбъектSABY);
		Результат.Удалить("_ид");
		Результат.Удалить("_тип");
		Результат.Удалить("_параметры");
		Результат.Удалить("_данные");
		
		Возврат Результат;
		
	Иначе
		
		ВызватьИсключение "Неизвестный формат выгрузки прикладного объекта!";
		
	КонецЕсли;
	
КонецФункции
	
//DynamicDirective

// Процедура - Базовый set-метод
//
// Параметры:
//  ПрикладнойОбъектSABY	 - ПрикладнойОбъектSABY	 - 
//  КлючДобавить		 - Строка				 - 
//  ЗначениеДобавить	 - Произвольный			 - 
//  ТипДобавить			 - Строка				 - Данные/Параметр/Тип
//
Процедура ПрикладнойОбъектSABY_Установить(ПрикладнойОбъектSABY, КлючДобавить = Неопределено, ЗначениеДобавить = Неопределено, ТипДобавить = Неопределено) Экспорт 

	Если Не ОбъектSABY_ЭтоТип(ПрикладнойОбъектSABY, "ПрикладнойОбъектSABY") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	КлючДляПроверки		= КлючДобавить;
	ИсточникПараметры	= Ложь;
	ТипПроверить		= НРег(ТипДобавить);
	Если		КлючДляПроверки = "Идентификатор" Тогда
		
		КлючДляПроверки		= "ПрикладнойИд";
		ИсточникПараметры	= Истина;
		
	ИначеЕсли	ТипПроверить = "параметр" Тогда
		
		ИсточникПараметры	= Истина;
		
	ИначеЕсли	ТипПроверить = "тип" Тогда
		
		ОбъектSABY_Установить(ПрикладнойОбъектSABY, "Тип", ЗначениеДобавить);
		Возврат;
		
	ИначеЕсли	ТипПроверить = "ид" Тогда
		
		КлючДляПроверки = "ПрикладнойИд";
		
	ИначеЕсли	ТипПроверить = "данные" Тогда
		
		Если ТипЗнч(КлючДляПроверки) = Тип("Строка") Тогда
			
			КлючДляПроверки = НРег(КлючДляПроверки);
			
		КонецЕсли;

	ИначеЕсли	ТипПроверить = "" Тогда
		
		Если ТипЗнч(КлючДляПроверки) = Тип("Строка") Тогда
		
			ИсточникПараметры = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если ИсточникПараметры Тогда
	
		ПриемникЗначения = ПрикладнойОбъектSABY._параметры;
		
	Иначе
		
		ПриемникЗначения = ПрикладнойОбъектSABY._данные;
		
	КонецЕсли;
	
	ПриемникЗначения.Вставить(КлючДляПроверки, ЗначениеДобавить);
	
КонецПроцедуры

//DynamicDirective

// Функция - Базовый get-метод
//
// Параметры:
//  ПрикладнойОбъектSABY	 - ПрикладнойОбъектSABY	 - Структура, с преопределенными полями
//  КлючПолучить		 - Строка				 - Ключ свойства
//  ТипПолучить			 - Строка/Неопределено	 - Данные/Параметр/Тип/Ид
// 
// Возвращаемое значение:
//  Произвольный - свойство класса
//
Функция ПрикладнойОбъектSABY_Получить(ПрикладнойОбъектSABY, КлючПолучить = Неопределено, ТипПолучить = Неопределено) Экспорт 
    Перем РезультатПолучить;
	
	//Если Не ОбъектSABY_ЭтоТип(ПрикладнойОбъектSABY, "ПрикладнойОбъектSABY") Тогда
	//	
	//	ВызватьИсключение "Переданный объект не является типом SABY!";
	//	
	//КонецЕсли;
	
	КлючДляПроверки		= КлючПолучить;
	ИсточникПараметры	= Ложь;
	ТипПроверить		= НРег(ТипПолучить);
	Если		КлючДляПроверки = "Идентификатор" Тогда
		
		Если ПрикладнойОбъектSABY._параметры.Свойство("ПрикладнойИд", РезультатПолучить) Тогда
			
			Возврат РезультатПолучить;
			
		КонецЕсли;

		Возврат Строка(ОбъектSABY_Получить(ПрикладнойОбъектSABY, "ид"));
		
	ИначеЕсли	ТипПроверить = "" Тогда
		
		Если ТипЗнч(КлючДляПроверки) = Тип("Строка") Тогда
			
			Если ПрикладнойОбъектSABY.Свойство(КлючДляПроверки, РезультатПолучить) Тогда
				
				Возврат РезультатПолучить;
				
			КонецЕсли;
			ИсточникПараметры	= Истина;
			
		КонецЕсли;
		
	ИначеЕсли	ТипПроверить = "параметр" Тогда
		
		ИсточникПараметры = Истина;
		
	ИначеЕсли	ТипПроверить = "тип" Тогда
		
		Возврат ОбъектSABY_Получить(ПрикладнойОбъектSABY, ТипПроверить);
		
	ИначеЕсли	ТипПроверить = "ид" Тогда
		
		РезультатПолучить = ПрикладнойОбъектSABY_Получить(ПрикладнойОбъектSABY, "ПрикладнойИд");
		Если РезультатПолучить = Неопределено Тогда
			
			Возврат Строка(ПрикладнойОбъектSABY._ид);
			
		КонецЕсли;
		
		Возврат РезультатПолучить;
		
	ИначеЕсли	ТипПроверить = "данные" Тогда
		
		Если ТипЗнч(КлючДляПроверки) = Тип("Строка") Тогда
			
			КлючДляПроверки = НРег(КлючДляПроверки);
			
		КонецЕсли;

	КонецЕсли;
	
	Если ИсточникПараметры Тогда
		
		ПрикладнойОбъектSABY._параметры.Свойство(КлючДляПроверки, РезультатПолучить);
		Возврат РезультатПолучить;
		
	КонецЕсли;
	
	Возврат ПрикладнойОбъектSABY._данные.Получить(КлючДляПроверки);

КонецФункции	

//DynamicDirective

// Функция - Базовый pop-метод.
//
// Параметры:
//  ПрикладнойОбъектSABY	 - ПрикладнойОбъектSABY	 - Структура, с преопределенными полями
//  КлючУдалить			 - Строка				 - Ключ свойства
//  ТипУдалить			 - Строка/Неопределено	 - Данные/Параметр
// 
// Возвращаемое значение:
//  Произвольный - уданенное свойство класса
//
Функция ПрикладнойОбъектSABY_Очистить(ПрикладнойОбъектSABY, КлючУдалить, ТипУдалить = Неопределено) Экспорт 
	Перем РезультатПолучить;
	
	Если Не ОбъектSABY_ЭтоТип(ПрикладнойОбъектSABY, "ПрикладнойОбъектSABY") Тогда
		
		ВызватьИсключение "Переданный объект не является типом SABY!";
		
	КонецЕсли;
	
	КлючДляПроверки		= КлючУдалить;
	ИсточникПараметры	= Ложь;
	ТипПроверить		= НРег(ТипУдалить);
	Если		КлючДляПроверки = "Идентификатор" Тогда
		
		КлючДляПроверки		= "ПрикладнойИд";
		ИсточникПараметры	= Истина;
		
	ИначеЕсли	ТипПроверить = "параметр" Тогда
		
		ИсточникПараметры = Истина;
		
	ИначеЕсли	ТипПроверить = "данные" Тогда
		
		Если ТипЗнч(КлючДляПроверки) = Тип("Строка") Тогда
			
			КлючДляПроверки = НРег(КлючДляПроверки);
			
		КонецЕсли;

	ИначеЕсли	ТипПроверить = "" Тогда
			
		Если		ТипЗнч(КлючДляПроверки) = Тип("Строка") Тогда
			
			ИсточникПараметры = Истина;
			
		ИначеЕсли	ТипЗнч(КлючДляПроверки) = Тип("Массив") Тогда
			
			Для Каждого КлючДанныеУдалить Из КлючДляПроверки Цикл
				
				ПрикладнойОбъектSABY_Очистить(ПрикладнойОбъектSABY, КлючДанныеУдалить, ТипУдалить);
				
			КонецЦикла;
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИсточникПараметры Тогда
		
		ПрикладнойОбъектSABY._параметры.Свойство(КлючДляПроверки, РезультатПОлучить);
		ПрикладнойОбъектSABY._параметры.Удалить(КлючУдалить);
		
		Возврат РезультатПОлучить;
		
	КонецЕсли;
	
	РезультатПолучить = ПрикладнойОбъектSABY._данные.Получить(КлючДляПроверки);
	ПрикладнойОбъектSABY._данные.Удалить(КлючДляПроверки);
	Возврат РезультатПолучить;

КонецФункции

