
&НаКлиенте
Функция УстановитьПараметрыМодуля(ПараметрыУстановки=Неопределено, Кэш) Экспорт
	Перем СбисКаталогСопоставления, Тип1С;

	ЛокальныйКэш = Кэш;
	
	Если		ПараметрыУстановки = Неопределено
		Или Не	ПараметрыУстановки.Свойство("Каталог", СбисКаталогСопоставления)
		Или	Не	ЗначениеЗаполнено(СбисКаталогСопоставления) Тогда
		СбисКаталогСопоставления = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("КаталогПоУмолчанию_Сервер") + "НоменклатураПоставщика";
	КонецЕсли;
	СбисКаталогСопоставления	= Кэш.ОбщиеФункции.СбисФорматКаталога(СбисКаталогСопоставления, Кэш.ПараметрыСистемы.Сервер);
	ПараметрыУстановкиИсходящие = МодульОбъектаКлиент().СформироватьПараметрыУстановкиДБФ(Новый Структура("Тип, Каталог", "СопоставлениеНоменклатуры", СбисКаталогСопоставления));
	
	СформироватьПодключениеДБФ(ПараметрыУстановкиИсходящие);
	
	ИниКонфигурация = Кэш.ФормаНастроек.Ини(Кэш, "Конфигурация");
	
	
	// Получаем типы полей 1С
	ТипыПолей1С = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолей1С");
	
	Если ТипыПолей1С.Свойство("Номенклатура", Тип1С) Тогда
		ТипСправочникаНоменклатура = СокрЛП(Сред(Тип1С.ТипыМассивСтрок[0], Найти(Тип1С.ТипыМассивСтрок[0], ".") + 1));
	Иначе
		ТипСправочникаНоменклатура = "Номенклатура";
	КонецЕсли;
	
	Если ТипыПолей1С.Свойство("Характеристика", Тип1С) Тогда
		ТипСправочникаХарактеристики = СокрЛП(Сред(Тип1С.ТипыМассивСтрок[0], Найти(Тип1С.ТипыМассивСтрок[0], ".") + 1));
	Иначе
		ТипСправочникаХарактеристики = "ХарактеристикиНоменклатуры";
	КонецЕсли;

	Если ТипыПолей1С.Свойство("КлассификаторЕдиницИзмерения", Тип1С) Тогда
		ТипСправочникаЕдиницы = СокрЛП(Сред(Тип1С.ТипыМассивСтрок[0], Найти(Тип1С.ТипыМассивСтрок[0], ".") + 1));
	Иначе
		ТипСправочникаЕдиницы = "КлассификаторЕдиницИзмерения";
	КонецЕсли;
	
	
	// Для XBase
	ИспользоватьXBaseДляКонвертацииDBF = Кэш.ОбщиеФункции.РассчитатьЗначение("ИспользоватьXBaseДляКонвертацииDBF", ИниКонфигурация) = Истина;
	ПараметрыСоединения.Вставить("ИспользоватьXBaseДляКонвертацииDBF", ИспользоватьXBaseДляКонвертацииDBF);
	
	ПараметрыСоединений = Новый Структура("Путь");
	ПараметрыСоединений.Вставить("Файлы",								Новый Соответствие);
	ПараметрыСоединений.Вставить("Каталог",								ПараметрыУстановкиИсходящие.Путь);
	ПараметрыСоединений.Вставить("Тип",									ПараметрыУстановкиИсходящие.Тип);
	ПараметрыСоединений.Файлы.Вставить("НоменклатураСБИС",		"Nom_SBIS.dbf");
	ПараметрыСоединений.Файлы.Вставить("Номенклатура1С",		"Nom_1С.dbf");
	ПараметрыСоединений.Файлы.Вставить("СтароеСопоставление",	"NOMPOST.dbf");
	ПараметрыСоединений.Файлы.Вставить("Единицы",				"Nom_UNIT.dbf");
	
	ПараметрыСоединения.Вставить("ПараметрыСоединений", 				ПараметрыСоединений);
	НовоеСопоставление = (МодульОбъектаКлиент().ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры") ИЛИ МодульОбъектаКлиент().ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры4100"));
	ПараметрыСоединения.Вставить("НовоеСопоставление",					НовоеСопоставление);
	ПараметрыСоединения.Вставить("Типы", 								Новый Структура);
	ПараметрыСоединения.Вставить("ПереключениеДляСтарогоСопоставления",	Новый Соответствие);
	ПараметрыСоединения.Типы.Вставить("Номенклатура",				ТипСправочникаНоменклатура);
	ПараметрыСоединения.Типы.Вставить("ХарактеристикиНоменклатуры",	ТипСправочникаХарактеристики);
	ПараметрыСоединения.Типы.Вставить("Единицы",					ТипСправочникаЕдиницы);
	
КонецФункции

#Область include_core2_vo2_Сопоставление_Номенклатура_DBF_ВнешнийВызов
#КонецОбласти

#Область include_core2_vo2_Сопоставление_Номенклатура_DBF_Внутренние
#КонецОбласти

