
// --> 12123099
&НаКлиенте
Процедура УстановитьПараметрыМодуля(Кэш, ПараметрыУстановки = Неопределено) Экспорт
	
	ТекМодуль                     = МодульОбъектаКлиент();
	Кэш			                  = ВладелецФормы.Кэш;
	ИниКонфигурации               = ТекМодуль.ИниПоПараметрам("Конфигурация");
	КаталогСопоставлениеНаСервере = Кэш.ОбщиеФункции.РассчитатьЗначение("ФормаРаботыСНоменклатуройПоставщика_КаталогНаСервере", Кэш.Ини.Конфигурация);
	//ТекМодуль = МодульОбъектаКлиент();
	
	ФормаРаботыСНоменклатуройOLD = Кэш.ОбщиеФункции.РассчитатьЗначение("НоменклатураПоставщиков", ИниКонфигурации);
	
	Если Лев(ФормаРаботыСНоменклатуройOLD, 10) = "Справочник" Тогда
		ФормаРаботыСНоменклатуройOLD = "СопоставлениеНоменклатуры_Справочники"; 
	ИначеЕсли Лев(ФормаРаботыСНоменклатуройOLD, 7) = "Регистр" Тогда
		ФормаРаботыСНоменклатуройOLD = "СопоставлениеНоменклатуры_Регистры"; 
	КонецЕсли;   
	
	Отказ = Ложь;
	ФормаРаботыСоСопоставлениемOLD	= Кэш.ГлавноеОкно.СбисПолучитьФормуОбработки(Кэш,ФормаРаботыСНоменклатуройOLD, Новый Структура, Отказ); 
	Попытка
		ФормаРаботыСоСопоставлениемOLD.УстановитьПараметрыМодуля(Кэш, Новый Структура("Каталог", КаталогСопоставлениеНаСервере));
	Исключение
		//Ничего не делаем
	КонецПопытки;
	
	ТекМодуль.ИзменитьПараметрТекущегоСеанса("ФормаРаботыСНоменклатуройOLD", ФормаРаботыСоСопоставлениемOLD);
	ТекМодуль.ИзменитьПараметрСбис("ЕстьЕдиницыНаФормеПросмотра",		Истина); 
	
КонецПроцедуры
// <-- 12123099

#Область include_core2_vo2_Сопоставление_Номенклатура_СБИС_ВнешнийВызов
#КонецОбласти
#Область include_core2_vo2_Сопоставление_Номенклатура_СБИС_ВнутреннийВызов
#КонецОбласти 

