
//Функция вызова формирования настроек из каталога.
&НаКлиенте
Функция СобратьНастройкиВКаталогеНаКлиенте(КаталогНастроекНаКлиенте, ДопПараметры = Неопределено)	Экспорт
	
	КаталогНастроекНаКлиентеДляЧтения = МодульОбъектаКлиент().ПрименитьФорматКСтроке(КаталогНастроекНаКлиенте,, "Каталог");		
	РезультатУстановки = ПолучитьМассивУстановленныхИниФайловВКонтекстеКлиента(КаталогНастроекНаКлиентеДляЧтения);
		
	Если РезультатУстановки.Количество() Тогда
		
		СтруктураИни = СформироватьСтруктуруИниВКонтекстеКлиента(РезультатУстановки);
		
	Иначе
		
		СтруктураИни = Неопределено;
		
	КонецЕсли;

	Возврат	Новый Структура("СписокФайлов, Ини", РезультатУстановки, СтруктураИни);
		
КонецФункции

