
// Функция - старая функция формирования каталога настроек. Не использовать
//
// Параметры:
//  Кэш						 - 	 - 
//  КаталогНастроекНазвание	 - 	 - 
//  Отказ					 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Функция СформироватьКаталогНастроек(Кэш, КаталогНастроекНазвание, Отказ) Экспорт
	
	Если КаталогНастроекНазвание = "" Тогда//устанавливаем каталог по умолчанию
		
		ПараметрыКонфигурации	= Кэш.ФормаНастроекОбщее.ОпределитьПараметрыКонфигурации(Кэш.ПараметрыСистемы, Отказ);
		ПараметрыКаталога		= Новый Структура(
			"КаталогНастроек,			ПрефиксСистемы,						ПараметрыСистемы", 
			КаталогНастроекНазвание,	ПараметрыКонфигурации.subsystem,	Кэш.ПараметрыСистемы);	
		ТестКаталогНастроек = СбисСформироватьКаталогПоУмолчанию(ПараметрыКаталога, Отказ);
	Иначе
		ТестКаталогНастроек = Кэш.ОбщиеФункции.СбисФорматКаталога(КаталогНастроекНазвание, Кэш.ПараметрыСистемы.Сервер);
		ТестКаталогНастроек = СбисСоздатьКаталогНаСервере(ТестКаталогНастроек, Кэш.ПараметрыСистемы, Отказ);
	КонецЕсли;
	Возврат ТестКаталогНастроек;
КонецФункции

