
&НаКлиенте
Функция яКаталогНастроекПоУмолчаниюНаСервере()
	
	Отказ = Ложь;
	
	ПараметрыСистемы 		= МодульОбъектаКлиент().ГлобальныйКэш_Получить("ПараметрыСистемы");
	ПараметрыКонфигурации	= МодульОбъектаКлиент().ПараметрSaby("МодульУправленияНастройками").ОпределитьПараметрыКонфигурации(ПараметрыСистемы, Отказ);
	
	Если Отказ Тогда
		
		ВызватьИсключение МодульОбъектаСервер().СбисИсключение_Выгрузить(ПараметрыКонфигурации);
		
	КонецЕсли;
	
	ПараметрыКаталога = Новый Структура("ПрефиксСистемы, ПараметрыСистемы", ПараметрыКонфигурации.subsystem, ПараметрыСистемы);
	ТестКаталогНастроек = СбисСформироватьКаталогПоУмолчанию(ПараметрыКаталога, Отказ);
	
	Если Отказ Тогда
		
		ВызватьИсключение МодульОбъектаСервер().СбисИсключение_Выгрузить(ТестКаталогНастроек);
		
	КонецЕсли;
	
	Возврат ТестКаталогНастроек;
	
КонецФункции

#Область include_core2_vo2_Настройки_Каталог_Клиент_ПриватныеМетоды_ОписаниеИниФайлов
#КонецОбласти

