
//1189641556 Функция получает складские параметры документа
&НаКлиенте
Функция ExtSysMarking_GetParams(params, ДопПараметры, Отказ=Ложь) Экспорт 
	Кэш = ДопПараметры.Кэш;
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	ПараметрыКоманды = Новый Массив();  
	ПараметрыКоманды.Добавить(params.ИдДок);  
	ПараметрыКоманды.Добавить(params.paramsList);
	Возврат СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, "ExtSysMarking.GetParams", ПараметрыКоманды, ДопПараметрыВызова, Отказ);
КонецФункции 

//1189641556 Функция формирует данные о проверке кодов маркировки документа
&НаКлиенте
Функция ExtSysMarking_CheckState(params, ДопПараметры, Отказ=Ложь) Экспорт 
	Кэш = ДопПараметры.Кэш;
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	ПараметрыКоманды = Новый Массив();  
	ПараметрыКоманды.Добавить(params.ИдДок);
	Возврат СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, "ExtSysMarking.CheckState", ПараметрыКоманды, ДопПараметрыВызова, Отказ);
КонецФункции     

//1189641556 Функция возвращает данные маркировки (номенклатур/параметров документа и т.п.)
&НаКлиенте
Функция ExtSysMarking_NumList(params, ДопПараметры, Отказ=Ложь) Экспорт 
	
	Кэш = ДопПараметры.Кэш;
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить(Новый Массив());
	ПараметрыКоманды.Добавить(params.Фильтр); 
	ПараметрыКоманды.Добавить(Новый Массив());
	ПараметрыКоманды.Добавить(Новый Массив());

	Возврат СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, "ExtSysMarking.NumList", ПараметрыКоманды, ДопПараметрыВызова, Отказ);
КонецФункции   

// Функция получеяет параметры из SerialNumber.CustomList
//
// Параметры:
//  params  - Структура - Параметры фильтрации метода
//  ДопПараметры  - Структура - Набор полей, работа с которыми может расширить результат работы функции.
//
// Возвращаемое значение:
//   Структура   - Результат вызова.
//
&НаКлиенте
Функция ExtSysMarking_NomCheckState(params, ДопПараметры, Отказ=Ложь) Экспорт    
	
	Кэш = ДопПараметры.Кэш;
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	ПараметрыКоманды = Новый Массив();  
	ПараметрыКоманды.Добавить(params.ИдДок);  
	ПараметрыКоманды.Добавить(params.КодНоменклатуры); 
	
	Результат = СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, "ExtSysMarking.NomCheckState", ПараметрыКоманды, ДопПараметрыВызова, Отказ);    
	Если Отказ Тогда
		Возврат МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".ExtSysMarking_NomCheckState");
	КонецЕсли;
	Возврат Результат; 
	
КонецФункции  

// Функция получяет параметры из SerialNumber.CustomList. В отличии от ExtSysMarking_NomCheckState по первичному ключу номенклатуры документа
//
// Параметры:
//  params  - Структура - Параметры фильтрации метода
//  ДопПараметры  - Структура - Набор полей, работа с которыми может расширить результат работы функции.
//
// Возвращаемое значение:
//   Структура   - Результат вызова.
//
&НаКлиенте
Функция ExtSysMarking_NomCheckStateByNomDoc(params, ДопПараметры, Отказ=Ложь) Экспорт 
	Кэш = ДопПараметры.Кэш;
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	ПараметрыКоманды = Новый Массив();  
	ПараметрыКоманды.Добавить(params.ИдДок);  
	ПараметрыКоманды.Добавить(params.КодНоменклатуры);
		
	Результат = СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, "ExtSysMarking.NomCheckStateByNomDoc", ПараметрыКоманды, ДопПараметрыВызова, Отказ);    
	Если Отказ Тогда
		Возврат МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".ExtSysMarking.NomCheckStateByNomDoc");
	КонецЕсли;
	Возврат Результат;
	
КонецФункции 

//1189641556 Функция устанавливает параметры выбытия кодов маркировки ExtSysMarking.SetParamt
&НаКлиенте
Функция ExtSysMarking_SetParam(params, ДопПараметры, Отказ=Ложь) Экспорт 
	Кэш = ДопПараметры.Кэш;
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	ПараметрыКоманды = Новый Массив();  
	ПараметрыКоманды.Добавить(params.ИдДок);  
	ПараметрыКоманды.Добавить(params.name); 
	ПараметрыКоманды.Добавить(params.value);
	Возврат СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, "ExtSysMarking.SetParam", ПараметрыКоманды, ДопПараметрыВызова, Отказ);
КонецФункции 

//1189641556 Функция проверяет наличие токена в ГИС МТ
&НаКлиенте
Функция ExtSysMarking_CheckGisSetting(params, ДопПараметры, Отказ=Ложь) Экспорт 
	Кэш = ДопПараметры.Кэш;
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	ПараметрыКоманды = Новый Массив();  
	ПараметрыКоманды.Добавить(params.ИдДок);
	Возврат СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, "ExtSysMarking.CheckGisSetting", ПараметрыКоманды, ДопПараметрыВызова, Отказ);
КонецФункции  

//1189641556 Функция запуск проверку кодов маркировки в ГИС МТ
&НаКлиенте
Функция ExtSysMarking_CheckSnCRPT(params, ДопПараметры, Отказ=Ложь) Экспорт 
	Кэш = ДопПараметры.Кэш;
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	ПараметрыКоманды = Новый Массив();  
	ПараметрыКоманды.Добавить(params.ИдДок);
	Возврат СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, "ExtSysMarking.CheckSnCRPT", ПараметрыКоманды, ДопПараметрыВызова, Отказ);
КонецФункции  

//1189641556 Функция ищет сертификат по отпечатку после чего разбирает его
&НаКлиенте
Функция Сертификат_ПрочитатьПоОтпечатку(params, ДопПараметры, Отказ=Ложь) Экспорт 
	Кэш = ДопПараметры.Кэш;
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	ПараметрыКоманды = Новый Массив();  
	ПараметрыКоманды.Добавить(params.Отпечаток);
	Возврат СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, "Сертификат.ПрочитатьПоОтпечатку", ПараметрыКоманды, ДопПараметрыВызова, Отказ);
КонецФункции    

//1189641556 Функция получает информацию по созданию токена ГИС МТ
&НаКлиенте
Функция ExtSysMarking_CheckGisTask(params, ДопПараметры, Отказ=Ложь) Экспорт 
	Кэш = ДопПараметры.Кэш;
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	ПараметрыКоманды = Новый Массив();  
	ПараметрыКоманды.Добавить(params.ИдДок);
	Возврат СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, "ExtSysMarking.CheckGisTask", ПараметрыКоманды, ДопПараметрыВызова, Отказ);
КонецФункции    

//1189641556 Функция получает статус проверки документа ГИС МТ
&НаКлиенте
Функция ExtSysMarking_GetResendingConfigForGIS(params, ДопПараметры, Отказ=Ложь) Экспорт 
	Кэш = ДопПараметры.Кэш;
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	ПараметрыКоманды = Новый Массив();  
	ПараметрыКоманды.Добавить(params.ИдДок);
	Возврат СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, "ExtSysMarking.GetResendingConfigForGIS", ПараметрыКоманды, ДопПараметрыВызова, Отказ);
КонецФункции

// Функция получает статус проверки документа ГИС МТ
//
// Параметры:  
//	Кэш						- Структура	- Кэш обработки
//  ВходящийПараметрМетода  - Структура - Параметры фильтрации метода
//  ДопПараметры  			- Структура - Набор полей, работа с которыми может расширить результат работы функции 
//  Отказ					- Булево	- Признак отказа.
//
// Возвращаемое значение:
//   Структура   - Результат вызова. Список объектов или ошибка
//
&НаКлиенте
Функция GisTransport_GetResendingFixationConfigVI(Кэш, ВходящийПараметрМетода,  ДопПараметры, Отказ) Экспорт 
	
	ПараметрыКоманды	= Новый Массив();  
	ПараметрыКоманды.Добавить(ВходящийПараметрМетода.docflow_id);  
	
	Результат = СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш
					, "GisTransport.GetResendingFixationConfigVI", ПараметрыКоманды, ДопПараметры, Отказ);
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя	= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат		= МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".GisTransport_GetResendingFixationConfigVI"); 
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

//1189641556 Функция отправляет коды маркировки в ГИС МТ
&НаКлиенте
Функция ExtSysMarking_SendToGIS(params, ДопПараметры, Отказ=Ложь) Экспорт 
	Кэш = ДопПараметры.Кэш;
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	ПараметрыКоманды = Новый Массив();  
	ПараметрыКоманды.Добавить(params.ИдДок);
	Возврат СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, "ExtSysMarking.SendToGIS", ПараметрыКоманды, ДопПараметрыВызова, Отказ);
КонецФункции

// Функция вызывает создание токена в СБИС, для взаимодействия с ГИС МТ ExtSysMarking.CreateGisSetting
//
// Параметры:
//  params  - Структура - Параметры фильтрации метода
//  ДопПараметры  - Структура - Набор полей, работа с которыми может расширить результат работы функции.
//
// Возвращаемое значение:
//   Строка   - Результат вызова. Дата/время вызова или ошибка
//
&НаКлиенте
Функция ExtSysMarking_CreateGisSetting(params, ДопПараметры, Отказ=Ложь) Экспорт 
	Кэш = ДопПараметры.Кэш;
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);    
	
	ПараметрыКоманды = Новый Массив(); 
	ПараметрыКоманды.Добавить(params);
	
	Результат = СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, "ExtSysMarking.CreateGisSetting", ПараметрыКоманды, ДопПараметрыВызова, Отказ);
	
КонецФункции

// Функция запускает проверку проверку прослеживаемых позиций через обертку метода RNPT.SendDoc
//
// Параметры:
//  params  - Структура - Параметры фильтрации метода
//  ДопПараметры  - Структура - Набор полей, работа с которыми может расширить результат работы функции.
//
// Возвращаемое значение:
//   Структура   - Результат вызова. Список объектов или ошибка
//
&НаКлиенте
Функция ExtSysMarking_SendDocumentRNPT(params, ДопПараметры, Отказ=Ложь) Экспорт  
	
	Кэш = ДопПараметры.Кэш;
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	ПараметрыКоманды = Новый Массив();  
	ПараметрыКоманды.Добавить(params.ИдДок);
	
	Результат = СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, "ExtSysMarking.SendDocumentRNPT", ПараметрыКоманды, ДопПараметрыВызова, Отказ);    
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".ExtSysMarking_SendDocumentRNPT");
	КонецЕсли;
	Возврат Результат;
	
КонецФункции 

