	Для Каждого оДокумент Из СписокИзменений.Документ Цикл
		ДействиеОбновления.Параметры.СчетчикСобытий = ДействиеОбновления.Параметры.СчетчикСобытий + 1;
		ГлавноеОкно.сбисПоказатьСостояние(СтрЗаменить(ДействиеОбновления.Параметры.СтрокаСостояния, "{счетчик}", ДействиеОбновления.Параметры.СчетчикСобытий),,, "(прервать -  Ctrl+Break)");
		МассивДокументов.Добавить(оДокумент);
		Если оДокумент.Свойство("Событие", ПоследнееСобытие) Тогда
			ПоследнееСобытие = ПоследнееСобытие[ПоследнееСобытие.Количество() -1];
			Если	ПоследнееСобытие.Свойство("Идентификатор")
				И	ПоследнееСобытие.Свойство("ДатаВремя") Тогда
				ПоследнееСобытиеСИД = ПоследнееСобытие;
			КонецЕсли;
		КонецЕсли;
		Если Не Кэш.ИспользоватьОбработчикиСобытий = Истина Тогда
			//Может быть неопределено
			Продолжить;
		КонецЕсли;
		ИмяОбработчика = СтрЗаменить("сбис" + оДокумент.Регламент.Название + "_" + оДокумент.Событие[0].Название, " ", "_");
		фрмОбработчика = ГлавноеОкно.СбисНайтиФормуФункции(ИмяОбработчика, "РаботаСДокументами1С", "", Кэш);
		Если фрмОбработчика = Ложь Тогда
			Продолжить;
		КонецЕсли;
		//Переписать на ОписаниеОповещения.
		Контекст = Новый структура("Док, Кэш", оДокумент, Кэш);
		Результат= Вычислить("фрмОбработчика." + ИмяОбработчика + "(Контекст)");
	КонецЦикла;
