	Для Каждого оДокумент Из СписокИзменений.Документ Цикл
	
		ДействиеОбновления.Параметры.СчетчикСобытий = ДействиеОбновления.Параметры.СчетчикСобытий + 1;
		ГлавноеОкно.сбисПоказатьСостояние(СтрЗаменить(ДействиеОбновления.Параметры.СтрокаСостояния, "{счетчик}", ДействиеОбновления.Параметры.СчетчикСобытий),,, "(прервать -  Ctrl+Break)");
		МассивДокументов.Добавить(оДокумент);
		Если оДокумент.Свойство("Событие", ПоследнееСобытие) Тогда
			
			// Берем событие, у которого есть ИД или ДатаВремя для отслеживания цепочки и чтения следующей пачки.
			// Так у нас всегда будет от чего оттолкнуться для чтения следующей пачки.
			ПоследнееСобытие = ПоследнееСобытие[ПоследнееСобытие.Количество() -1];
			Если	Не (	ПоследнееСобытие.Свойство("Идентификатор", ИдСобытияДляНавигации)
						И	ЗначениеЗаполнено(ИдСобытияДляНавигации)) Тогда
						
				ИдСобытияДляНавигации = "";		
						
			КонецЕсли;
			
			Если	Не	(	ПоследнееСобытие.Свойство("ДатаВремя", ДатаСобытияДляНавигации)
						И	ЗначениеЗаполнено(ДатаСобытияДляНавигации)) Тогда
				
				ДатаСобытияДляНавигации = "";
				
			КонецЕсли;
			
		КонецЕсли;
		Если Не Кэш.ИспользоватьОбработчикиСобытий = Истина Тогда
			//Может быть неопределено
			Продолжить;
		КонецЕсли;
		ИмяОбработчика = СтрЗаменить("сбис" + оДокумент.Регламент.Название + "_" + оДокумент.Событие[0].Название, " ", "_");
		фрмОбработчика = ГлавноеОкно.СбисНайтиФормуФункции(ИмяОбработчика, "РаботаСДокументами1С", "", Кэш);
		Если фрмОбработчика = Ложь Тогда
			Продолжить;
		КонецЕсли;
		//Переписать на ОписаниеОповещения.
		Контекст = Новый структура("Док, Кэш", оДокумент, Кэш);
		Результат= Вычислить("фрмОбработчика." + ИмяОбработчика + "(Контекст)");
	КонецЦикла;
