
&НаКлиенте
Функция СформироватьПараметрыУстановкиДБФ(ПараметрыУстановкиВходящие) Экспорт
	Перем КаталогНастроекНаСервере;
	
	Если Не ПараметрыУстановкиВходящие.Свойство("Каталог", КаталогНастроекНаСервере) Тогда
		ВызватьСбисИсключение(784, "МодульОбъектаКлиент.СформироватьПараметрыУстановкиДБФ",,,"Не определен каталог для работы с DBF");
	КонецЕсли;  
	ПараметрыDBF_Исходящие = Новый Структура("Путь, Тип", КаталогНастроекНаСервере, ПараметрыУстановкиВходящие.Тип);
	
	СтрокаПодключения = ПолучитьЗначениеПараметраСбис("СтрокаПодключенияDBF");
	
	Если Не СтрокаПодключения = Неопределено Тогда
		Если Не Найти(СтрокаПодключения, "{СБИСКаталогDBF}") Тогда
			СтрокаПодключения = СтрокаПодключения + "{СБИСКаталогDBF}";
		КонецЕсли;
		ПараметрыDBF_Исходящие.Вставить("СтрокаСтатусы", СтрокаПодключения);
	КонецЕсли;
	Возврат ПараметрыDBF_Исходящие;
	
КонецФункции

&НаКлиенте
Процедура СообщитьИсключениеДБФ(ПараметрыИсключения) Экспорт
	СбисИсключение = ОбработатьИсключениеДБФ(ПараметрыИсключения);
	Если СбисИсключение.code = 717 Тогда
		СбисСообщить(Новый Структура("Текст", СбисИсключение.details));
	Иначе
		СообщитьСбисИсключение(СбисИсключение);
	КонецЕсли;
КонецПроцедуры

//Обработка ошибки при работе с DBF
&НаКлиенте
Функция  ОбработатьИсключениеДБФ(ПараметрыИсключения) Экспорт
	Перем СбисХелп, СбисСообщение;
	ИнформацияОбОшибке	= ПараметрыИсключения.ИнформацияОбОшибке;
	СбисИсключение		= НовыйСбисИсключение(ИнформацияОбОшибке, "МодульОбъектаКлиент.ОбработатьИсключениеДБФ");
	СбисДитейл			= СбисИсключение.details;
	Пока ИнформацияОбОшибке.Причина <> Неопределено Цикл
		ИнформацияОбОшибке = ИнформацияОбОшибке.Причина;
	КонецЦикла;
    
	Если Найти(ИнформацияОбОшибке.Описание, "ODBC") Тогда
		СбисКод			= 776; 
		СбисХелп		= "https://sbis.ru/help/integration/catalog/driver_not_found";
		СбисСообщение	= СбисДитейл;
		СбисДитейл		= ИнформацияОбОшибке.Описание;
	ИначеЕсли ИнформацияОбОшибке.Описание = "Не подключен файл статусов DBF." Тогда
		СбисКод			= 717;
		СбисДитейл		= ИнформацияОбОшибке.Описание + " " + СбисДитейл;
	Иначе
		Возврат НовыйСбисИсключение(ИнформацияОбОшибке, "Статусы_ДБФ.ОбработатьИсключениеДБФ", 773);
		//СбисКод			= 773;
		//СбисСообщение	= СбисДитейл;
		//СбисДитейл		= ИнформацияОбОшибке.Описание
	КонецЕсли; 
	Возврат НовыйСбисИсключение(,"Статусы_ДБФ.ОбработатьИсключениеДБФ", 
								СбисКод, СбисСообщение, СбисДитейл,, СбисХелп);	
КонецФункции

//Обработка ошибки при работе с DBF
&НаКлиенте
Функция  НовыйСбисИсключениеДБФ(ПараметрыИсключения) Экспорт
	Перем СбисХелп, СбисСообщение;
	ИнформацияОбОшибке	= ПараметрыИсключения.ИнформацияОбОшибке;
	СбисДитейл			= ПараметрыИсключения.Сообщение;
	Пока ИнформацияОбОшибке.Причина <> Неопределено Цикл
		ИнформацияОбОшибке = ИнформацияОбОшибке.Причина;
	КонецЦикла;
    
	Если Найти(ИнформацияОбОшибке.Описание, "ODBC") Тогда
		СбисКод			= 776; 
		СбисХелп		= "https://sbis.ru/help/integration/catalog/driver_not_found";
		СбисСообщение	= СбисДитейл;
		СбисДитейл		= ИнформацияОбОшибке.Описание;
	ИначеЕсли ИнформацияОбОшибке.Описание = "Не подключен файл статусов DBF." Тогда
		СбисКод			= 717;
		СбисДитейл		= ИнформацияОбОшибке.Описание + " " + СбисДитейл;
	Иначе
		Возврат НовыйСбисИсключение(ИнформацияОбОшибке, "Статусы_ДБФ.ОбработатьИсключениеДБФ", 773);
		//СбисКод			= 773;
		//СбисСообщение	= СбисДитейл;
		//СбисДитейл		= ИнформацияОбОшибке.Описание
	КонецЕсли; 
	Возврат НовыйСбисИсключение(,"Статусы_ДБФ.ОбработатьИсключениеДБФ", 
								СбисКод, СбисСообщение, СбисДитейл,, СбисХелп);	
КонецФункции

