
&НаКлиенте
Процедура ВыполнитьАвторизациюВСбис(ПараметрыАвторизацииВходщие, ДопПараметры) Экспорт
	
	Если Не ГлобальныйКэш.СБИС.ОбменВключен Тогда
		ВызватьСбисИсключение(, "МодульОбъектаКлиент.ВыполнитьАвторизациюВСбис", 100, "Не включен обмен со СБИС", "Измените способ обмена в настройках соединения.");
	КонецЕсли;
	РежимАвторизации = НРег(ПараметрыАвторизацииВходщие.Режим);
	
	Отказ = Ложь;
	Если		ГлобальныйКэш.Парам.СпособОбмена = 1 Тогда
		//Интеграция через каталог
		Результат = "Ok";
	ИначеЕсли	ПараметрыАвторизацииВходщие.Режим = "потокену"			Тогда
		Результат = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.АвторизоватьсяПоТокену(ГлавноеОкно.Кэш, Отказ);
	ИначеЕсли	ПараметрыАвторизацииВходщие.Режим = "посертификату"		Тогда
		ИзменитьПараметрСбис("Сертификат", ПараметрыАвторизацииВходщие.Сертификат);
		Результат = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.АвторизоватьсяПоСертификату(ГлавноеОкно.Кэш, ПараметрыАвторизацииВходщие.Сертификат,Отказ);		
	ИначеЕсли	ПараметрыАвторизацииВходщие.Режим = "пологинупаролю"	Тогда
		Результат = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.АвторизоватьсяПоЛогинуПаролю(ГлавноеОкно.Кэш,ПараметрыАвторизацииВходщие.Логин,ПараметрыАвторизацииВходщие.Пароль,Отказ);
	Иначе
		ВызватьСбисИсключение(, "МодульОбъектаКлиент.ВыполнитьАвторизациюВСбис", 100, "Неизвестный способ авторизации в СБИС");
	КонецЕсли;
	//Сюда возвращается ошибка, если нужно, сообщаем.   
	Если Отказ Тогда
		ВызватьСбисИсключение(Результат, "МодульОбъектаКлиент.ВыполнитьАвторизациюВСбис");
	КонецЕсли;
	ИзменитьПараметрСбис("ИдентификаторСессии", Результат);
	
КонецПроцедуры

