
&НаКлиенте
Процедура ВыполнитьАвторизациюВСбис(ПараметрыАвторизацииВходщие, ДопПараметры) Экспорт
	
	Если Не ГлобальныйКэш.СБИС.ОбменВключен Тогда
		ВызватьСбисИсключение(, "МодульОбъектаКлиент.ВыполнитьАвторизациюВСбис", 100, "Не включен обмен с Saby", "Измените способ обмена в настройках соединения.");
	КонецЕсли;
	РежимАвторизации = НРег(ПараметрыАвторизацииВходщие.Режим);
	
	Отказ = Ложь;
	Если		ГлобальныйКэш.Парам.СпособОбмена = 1 Тогда
		//Интеграция через каталог
		Результат = "Ok";
	ИначеЕсли	ПараметрыАвторизацииВходщие.Режим = "потокену"			Тогда
		Результат = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.АвторизоватьсяПоТокену(ГлавноеОкно.Кэш, Отказ);
	ИначеЕсли	ПараметрыАвторизацииВходщие.Режим = "посертификату"		Тогда
		ИзменитьПараметрСбис("Сертификат", ПараметрыАвторизацииВходщие.Сертификат);
		Результат = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.АвторизоватьсяПоСертификату(ГлавноеОкно.Кэш, ПараметрыАвторизацииВходщие.Сертификат,Отказ);		
	ИначеЕсли	ПараметрыАвторизацииВходщие.Режим = "пологинупаролю"	Тогда
		Результат = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.АвторизоватьсяПоЛогинуПаролю(ГлавноеОкно.Кэш,ПараметрыАвторизацииВходщие.Логин,ПараметрыАвторизацииВходщие.Пароль,Отказ);
	Иначе
		ВызватьСбисИсключение(, "МодульОбъектаКлиент.ВыполнитьАвторизациюВСбис", 100, "Неизвестный способ авторизации в Saby");
	КонецЕсли;
	//Сюда возвращается ошибка, если нужно, сообщаем.   
	Если Отказ Тогда
		ВызватьСбисИсключение(Результат, "МодульОбъектаКлиент.ВыполнитьАвторизациюВСбис");
	КонецЕсли;
	ИзменитьПараметрСбис("ИдентификаторСессии", Результат);
	
КонецПроцедуры

// Функция - выполняет расшировку токена авторизации средствами 1С
//
// Параметры:
//  ДвоичныеДанныеТокена - Строка(ДвоичныеДанные) - результат авторизации по сертификату/подтверждение авторизации по сертификату
// 
// Возвращаемое значение:
//  Строка(УИД) - полученный ИД сессии в готовом виде
//
&НаКлиенте
Функция РасшироватьТокенАвторизации(ДвоичныеДанныеТокена) Экспорт
	
	ДвоичныеДанные		= Base64Значение(ДвоичныеДанныеТокена);  
	ИмяВрФ				= НовыйВременныйФайлКлиент(,"txt");
	МодульКриптографии	= ПолучитьЗначениеПараметраТекущегоСеанса("Криптография1С");
	
	Попытка
		
		МодульКриптографии.сбисРасшифровать(ПолучитьТекущийЛокальныйКэш(), ДвоичныеДанные, ИмяВрФ);
		
	Исключение
		
		ОшибкаРасшифровать = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.РасшироватьТокенАвторизации", 785);
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаРасшифровать);
		
	КонецПопытки;
	
	ЧтениеОтвета	= Новый ЧтениеТекста(ИмяВрФ, КодировкаТекста.UTF8, Символы.ПС);
	Результат		= ЧтениеОтвета.Прочитать();
	ЧтениеОтвета.Закрыть();
	
	ОсвободитьВременныйФайл(ИмяВрФ, Истина);
	
	Возврат Результат;
	
КонецФункции

// Функция - проверка результата авторизации
//
// Параметры:
//  ПараметрыРезультата	 - Структура	 - Параметры оценки
//		Результат:			Строка/СбисИсключение	- результат выполнения методов авторизации - по логину/сертификату/токену/подтверждение и пр.
//		РасшифроватьТокен:	Булево					- необходимость выполнить расшифровку токена криптографией 1С
//  Отказ				 - Булево		 - признак наличия ошибки
// 
// Возвращаемое значение:
//  ИдСессии/СбисИсключение - результат авторизации
//
&НаКлиенте
Функция ОценитьРезультатАвторизации(ПараметрыРезультата, Отказ) Экспорт
	
	РезультатАвторизации	= ПараметрыРезультата.Результат;
	РасшифроватьТокен		=	ПараметрыРезультата.Свойство("РасшифроватьТокен")
							И	ПараметрыРезультата.РасшифроватьТокен;

	Если Не Отказ Тогда
		
		Если РасшифроватьТокен Тогда
			
			Попытка
			
				РезультатАвторизации = РасшироватьТокенАвторизации(РезультатАвторизации);
				
			Исключение
				
				Отказ = Истина;
				Возврат НовыйСбисИсключение(ИнформацияОбОшибке(),
											"API.АвторизоватьсяПоСертификату",
											785,
											"Ошибка 1С при выполнении метода ""Расшифровать""")
				
			КонецПопытки;
			
		КонецЕсли;
		
		ИзменитьПараметрСбис("Авторизован",	Истина);
		
		Возврат РезультатАвторизации;
		
	ИначеЕсли РезультатАвторизации.code = 303 Тогда
		
		РезультатАвторизации.data.addinfo.Вставить("РасшифроватьТокен", РасшифроватьТокен);
	
	ИначеЕсли РезультатАвторизации.details = "Для входа введите полученный код подтверждения." Тогда
		
		РезультатАвторизации.message= "Требуется подтверждение действия";
		РезультатАвторизации.code	= 303;
		
	ИначеЕсли РезультатАвторизации.code = 775 Тогда
		
		РезультатАвторизации.details = "Не удалось авторизоваться по " + ?(ПараметрыРезультата.Параметры.Свойство("Логин"), "логину/паролю.", "сертификату.");
		
	ИначеЕсли РезультатАвторизации.code = 759 Тогда
		
		//Переключимся на альтернативный домен и повторим авторизацию
		МодульИнтеграции	= ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция");
		Кэш					= ПолучитьТекущийЛокальныйКэш();
		Возврат МодульИнтеграции.сбисПереключитьДомен(Кэш, ПараметрыРезультата, Отказ)
		
	КонецЕсли;
	
	Возврат РезультатАвторизации;
	
КонецФункции

