
&НаКлиенте
Процедура ДействияПриСтарте(ПараметрыЗапуска, Кэш) Экспорт
	Попытка
		Если Кэш.ПараметрыСистемы.Обработка.ПервыйЗапуск Тогда
			СбисДействияПриПервомЗапуске(ПараметрыЗапуска, Кэш);
		КонецЕсли;
		Если Кэш.ПараметрыСистемы.Обработка.НоваяВерсия Тогда
			РезультатДействия = СбисДействияПриОбновленииВерсии(Кэш, ПараметрыЗапуска.СтараяВерсия, ПараметрыЗапуска.АктивнаяВерсия);
			СбисСтатистика_СформироватьИЗаписать(Новый Структура("Действие, Результат, ИмяРеестра", "Обновление", РезультатДействия, Кэш.Текущий.ТипДок), Новый Структура);
			ГлавноеОкно.ПредВерсия	= ПараметрыЗапуска.АктивнаяВерсия;
			Кэш.Парам.ПредВерсия		= ПараметрыЗапуска.АктивнаяВерсия;
			Кэш.ПараметрыСистемы.Обработка.НоваяВерсия = Ложь;
		КонецЕсли;

		//Установить отложенные операции после запуска
		ОбработчикДействия = НовыйСбисОписаниеОповещения("СбисПроверитьПоследнююВерсию", ГлавноеОкно, Кэш);
		ОтложенноеДействиеОбновления = НовыйОтложенноеДействие(
		Новый Структура("Аргумент, ОписаниеОповещения", ПараметрыЗапуска, ОбработчикДействия));
  		ПодключитьОтложенноеДействие(ОтложенноеДействиеОбновления);

		ОбработчикДействия = НовыйСбисОписаниеОповещения("СбисПроверитьНаличиеОбновлений", ГлавноеОкно, Кэш);
		ПодключитьОтложенноеДействие(НовыйОтложенноеДействие(
		Новый Структура("Периодичность,	Аргумент,							ОписаниеОповещения, ЧислоВызовов", 
						60*60*8,		Новый Структура("Режим", "Авто"),	ОбработчикДействия)));
		
		ОбработчикДействия = НовыйСбисОписаниеОповещения("ОбновитьМеткиСтатусов", ГлавноеОкно.МодульОбъектаКлиент(), Кэш);
		ПодключитьОтложенноеДействие(НовыйОтложенноеДействие(
		Новый Структура("Периодичность, ОписаниеОповещения, ЧислоВызовов", 600, ОбработчикДействия)));

		Если 	НЕ ПараметрыЗапуска.сбисПараметры.Свойство("НеОтображатьНовостьПриЗапуске")
			ИЛИ НЕ ПараметрыЗапуска.сбисПараметры.НеОтображатьНовостьПриЗапуске Тогда
			АргументПоказаНовости = Новый Структура("ВерсияПрочитана, АктивнаяВерсия", ГлавноеОкно.ПрочитаннаяНовость, ПараметрыЗапуска.АктивнаяВерсия);
			ОтложенноеДействиеОбновления = НовыйОтложенноеДействие(Новый Структура(
			"Аргумент,				ИмяПроцедуры,			Модуль,			ДополнительныеПараметры", 
			АргументПоказаНовости,	"СбисПроверитьНовость",	ГлавноеОкно,	Кэш));
			ПодключитьОтложенноеДействие( ОтложенноеДействиеОбновления);
		КонецЕсли;
		
		Если	ЗначениеЗаполнено(Кэш.Парам.ОжидаемаяВерсия) 
			И	Кэш.ОбщиеФункции.ЭтоНоваяВерсия(Кэш.Парам.ОжидаемаяВерсия, ПараметрыЗапуска.АктивнаяВерсия) Тогда
			ОтложенноеДействиеОбновления = НовыйОтложенноеДействие(Новый Структура(
			"Аргумент,				Периодичность,	ИмяПроцедуры,									Модуль", 
			"Предложить перезапуск",60*15,			"сбисУстановитьОформлениеГиперссылокОбновления",ГлавноеОкно));
			ПодключитьОтложенноеДействие(ОтложенноеДействиеОбновления);
		Иначе	
			Кэш.Парам.ОжидаемаяВерсия = "";
		КонецЕсли;
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ВызватьСбисИсключение(ИнфоОбОшибке, "МодульОбъектаКлиент.ДействияПриСтарте");
	КонецПопытки;	
КонецПроцедуры
		
//При изменении версии внешней обработки со старой на новую
&НаКлиенте
Функция  СбисДействияПриОбновленииВерсии(Кэш, СтараяВерсия, НоваяВерсия) Экспорт
	РезультатДействия = Кэш.ОбщиеФункции.РезультатДействия_Новый(Кэш, Новый Структура("ПредставлениеОперации, ФормаВызова", "Обновление", ГлавноеОкно));
	
	Если НоваяВерсияБольшеКлиент(СтараяВерсия, "24.1100") Тогда
		//Если версия ДО 24.1100 то выставить опцию подразделений в "Не создавать ответственных и подразделения"
		ИзменитьПараметрСбис("ВариантВыгрузкиОтвПодр", 2);
	КонецЕсли;
	
	Если НоваяВерсияБольшеКлиент(СтараяВерсия, "24.2132")
		И НЕ ГлавноеОкно.РежимЗапускаГлавногоОкна = "ВнешнийИнтерфейс" Тогда
		
		ИзменитьПараметрСБИС("ИспользоватьНовуюОтправку", Истина);			
		
	КонецЕсли;
	
	Если НоваяВерсияБольшеКлиент(СтараяВерсия, "24.2162")
		И МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ЗаписейНаСтранице") > 50 Тогда

		ИзменитьПараметрСбис("ЗаписейНаСтранице", 50);
		ГлавноеОкно.ЗаписейНаСтранице = 50;

	КонецЕсли;
	
	// Обновим файлы настроек без поднятия версии к текущей версии конфигурации
	Если НЕ ПолучитьЗначениеПараметраСбис("НастройкиАвтообновление") Тогда
		Отказ = Ложь;
		СтрокаДетализации = Кэш.ОбщиеФункции.РезультатДействия_СформироватьСтрокуДетализации(Кэш,,Новый Структура("Название", "Освежение файлов настроек"));
		РезультатОсвеженияФайловНастроек = Кэш.ФормаНастроекОбщее.ОсвежитьФайлыНастроек(Кэш, Отказ);
		Если Отказ Тогда
			Кэш.ОбщиеФункции.РезультатДействия_ДобавитьОшибку(Кэш, РезультатДействия, СтрокаДетализации, РезультатОсвеженияФайловНастроек);
			Отказ = Ложь;
		Иначе
			Кэш.ОбщиеФункции.РезультатДействия_ДобавитьРезультат(Кэш, РезультатДействия, СтрокаДетализации, Новый Структура("Выполнено, КлючГруппировки", Истина, "Файлы настроек освежены"));
		КонецЕсли;	
	КонецЕсли;
		
	Отказ = Ложь;
	СтрокаДетализации = Кэш.ОбщиеФункции.РезультатДействия_СформироватьСтрокуДетализации(Кэш,,Новый Структура("Название", "Добавление печатных форм"));
	РезультатДобавленияПФ = Кэш.ФормаНастроекОбщее.СбисДобавитьПечатныеФормы(Кэш, Отказ);
	Если Отказ Тогда
		Кэш.ОбщиеФункции.РезультатДействия_ДобавитьОшибку(Кэш, РезультатДействия, СтрокаДетализации, РезультатДобавленияПФ);
		Отказ = Ложь;
	Иначе
		Кэш.ОбщиеФункции.РезультатДействия_ДобавитьРезультат(Кэш, РезультатДействия, СтрокаДетализации, Новый Структура("Выполнено, КлючГруппировки", Истина, "Добавлены печатные формы"));
	КонецЕсли;
	Возврат РезультатДействия;
КонецФункции

//Выполняется при первом запуске обработки
&НаКлиенте
Процедура СбисДействияПриПервомЗапуске(ПараметрыЗапуска, Кэш) Экспорт
	Попытка
		Отказ = Ложь;
		РезультатДобавленияПФ = Кэш.ФормаНастроекОбщее.СбисДобавитьПечатныеФормы(Кэш, Отказ);
		Если Отказ Тогда
			СбисПараметрыСтатистики = Новый Структура("Действие, Ошибка, ИмяРеестра", "Запись ошибки", РезультатДобавленияПФ, Кэш.Текущий.ТипДок);
			СбисСтатистика_СформироватьИЗаписать(СбисПараметрыСтатистики, Новый Структура);
		КонецЕсли;
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ВызватьСбисИсключение(ИнфоОбОшибке, "МодульОбъектаКлиент.СбисДействияПриПервомЗапуске");
	КонецПопытки;
КонецПроцедуры

