
&НаКлиенте
Процедура ДействияПриСтарте(ПараметрыЗапуска) Экспорт
	
	Кэш = ПолучитьТекущийЛокальныйКэш();
	
	Попытка
		
		УспешноеОбновление = Ложь;
		Если		ПолучитьЗначениеПараметраТекущегоСеанса("ПервыйЗапуск") Тогда
			
			СбисДействияПриПервомЗапуске(ПараметрыЗапуска, Кэш);
			УспешноеОбновление = Истина;
			
		КонецЕсли;
			
		Если   ПолучитьЗначениеПараметраТекущегоСеанса("НоваяВерсия") Тогда
			
			РезультатДействия = СбисДействияПриОбновленииВерсии(Кэш, ПараметрыЗапуска.СтараяВерсия, ПараметрыЗапуска.АктивнаяВерсия);
			СбисСтатистика_СформироватьИЗаписать(Новый Структура("Действие, Результат, ИмяРеестра", "Обновление", РезультатДействия, Кэш.Текущий.ТипДок), Новый Структура);
 			УспешноеОбновление = Истина;
			
		КонецЕсли;
		
		ДействияПриСтарте_Общее(ПараметрыЗапуска);
		
		Если УспешноеОбновление Тогда
						
			// После обновления, обновить последнюю запущенную версию
	        ИзменитьПараметрСбис("ПредВерсия", ПараметрыЗапуска.АктивнаяВерсия);
			
		КонецЕсли;
		
	Исключение
		
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ВызватьСбисИсключение(ИнфоОбОшибке, "МодульОбъектаКлиент.ДействияПриСтарте");
		
	КонецПопытки;
	
КонецПроцедуры

// Процедура - Действия при старте общее
// Выполняет независимо общие действия при старте обработки
// BSLLS:CyclomaticComplexity-off
// BSLLS:CognitiveComplexity-off
&НаКлиенте
Процедура ДействияПриСтарте_Общее(ПараметрыЗапуска)
	
	Кэш = ПолучитьТекущийЛокальныйКэш();
	
	// Записываем статистику по конфе после запуска
	ПолнаяВерсия = Кэш.ФормаНастроек.СформироватьПрефиксНабораНастроек(Кэш);
	ПрикладнаяСтатистика = НовыйПрикладнаяСтатистика();
	ЗаписьПрикладнойСтатистики = НовыйЗаписьПрикладнойСтатистики(ПолнаяВерсия, "Запуск внешней обработки");
	ПрикладнаяСтатистика_Добавить(ПрикладнаяСтатистика, ЗаписьПрикладнойСтатистики);
	ПараметрыОтправкиСтатистики = Новый Структура("Контекст", "Запуск внешней обработки");
	ПрикладнаяСтатистика_Отправить(ПрикладнаяСтатистика, ПараметрыОтправкиСтатистики);
	
	// Записываем статистику по платформе клиента
	Если Saby_СтрНачинаетсяС82(Кэш.ПараметрыСистемы.Клиент.ВерсияПриложения, "8.2.") Тогда
		ПоколениеПлатформы = "8.2";
	ИначеЕсли Saby_СтрНачинаетсяС82(Кэш.ПараметрыСистемы.Клиент.ВерсияПриложения, "8.3.") Тогда
		ПоколениеПлатформы = "8.3";
	ИначеЕсли Saby_СтрНачинаетсяС82(Кэш.ПараметрыСистемы.Клиент.ВерсияПриложения, "8.5.") Тогда
		ПоколениеПлатформы = "8.5";
	// На случай непонятных ситуаций
	Иначе
		ПоколениеПлатформы = "";
	КонецЕсли;
	ПрикладнаяСтатистика = НовыйПрикладнаяСтатистика();
	ЗаписьПрикладнойСтатистики = НовыйЗаписьПрикладнойСтатистики(ПоколениеПлатформы, "Версия платформы");
	ПрикладнаяСтатистика_Добавить(ПрикладнаяСтатистика, ЗаписьПрикладнойСтатистики);
	ПараметрыОтправкиСтатистики = Новый Структура("Контекст", "Версия платформы");
	ПрикладнаяСтатистика_Отправить(ПрикладнаяСтатистика, ПараметрыОтправкиСтатистики);
	
	// Установить отложенные операции после запуска
	ОбработчикДействия = НовыйСбисОписаниеОповещения("СбисПроверитьПоследнююВерсию", ГлавноеОкно, Кэш);
  	ПодключитьОтложенноеДействие(ОбработчикДействия, ПараметрыЗапуска);

	ОбработчикДействия = НовыйСбисОписаниеОповещения("СбисПроверитьНаличиеОбновлений", ГлавноеОкно, Кэш);
	ПодключитьОтложенноеДействие(НовыйОтложенноеДействие(
	Новый Структура("Периодичность,	Аргумент,							ОписаниеОповещения, ЧислоВызовов", 
					60*60*8,		Новый Структура("Режим", "Авто"),	ОбработчикДействия)));
	
	ОбработчикДействия = НовыйСбисОписаниеОповещения("ОбновитьМеткиСтатусов", ГлавноеОкно.МодульОбъектаКлиент(), Кэш);
	ПодключитьОтложенноеДействие(НовыйОтложенноеДействие(Новый Структура("Периодичность, ОписаниеОповещения, ЧислоВызовов", 600, ОбработчикДействия)));

	//отображать новости
	ВерсияПрочитанная = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПредВерсия"); 
	АктивнаяВерсия = ГлобальныйКэш.ПараметрыСистемы.Обработка.Версия;
	ЭтоОбновлениеМажор = СбисНоваяВерсия(АктивнаяВерсия, ВерсияПрочитанная, Новый Структура("КоличествоСимволовДляСравнения",5));

	//получить значение если неопределено в истину     
	ОтображатьНовость = ПараметрSABY("ОтображатьНовость", "Технический"); 
	
	Если ОтображатьНовость = Неопределено Тогда
		
		ИзменитьПараметрSABY("ОтображатьНовость", Истина, "Технический"); 
		
	КонецЕсли;
	
	Если ЭтоОбновлениеМажор Тогда 
		
		ИзменитьПараметрSABY("ОтображатьНовость", Истина, "Технический");
		
    КонецЕсли;
			
	Если (НЕ ПараметрыЗапуска.сбисПараметры.Свойство("НеОтображатьНовостьПриЗапуске")
		ИЛИ НЕ ПараметрыЗапуска.сбисПараметры.НеОтображатьНовостьПриЗапуске) 
		И ПараметрSABY("ОтображатьНовость", "Технический") Тогда  
		
		АргументПоказаНовости = Новый Структура("ВерсияПрочитана, АктивнаяВерсия", ВерсияПрочитанная, АктивнаяВерсия); 
		ОтложенноеДействиеОбновления = НовыйОтложенноеДействие(Новый Структура(
		"Аргумент,				ИмяПроцедуры,			Модуль,			ДополнительныеПараметры", 
		АргументПоказаНовости,	"СбисПроверитьНовость",	ГлавноеОкно,	Кэш));
		ПодключитьОтложенноеДействие( ОтложенноеДействиеОбновления); 
		
	КонецЕсли;
	
	ОжидаемаяВерсия = ПолучитьЗначениеПараметраСбис("ОжидаемаяВерсия");
	Если	ЗначениеЗаполнено(ОжидаемаяВерсия) 
		И	Кэш.ОбщиеФункции.ЭтоНоваяВерсия(ОжидаемаяВерсия, ПараметрыЗапуска.АктивнаяВерсия) Тогда
		ОтложенноеДействиеОбновления = НовыйОтложенноеДействие(Новый Структура(
		"Аргумент,				Периодичность,	ИмяПроцедуры,									Модуль", 
		"Предложить перезапуск",60*15,			"сбисУстановитьОформлениеГиперссылокОбновления",ГлавноеОкно));
		ПодключитьОтложенноеДействие(ОтложенноеДействиеОбновления);
	Иначе
		
		ИзменитьПараметрСбис("ОжидаемаяВерсия", "");
		
	КонецЕсли;
	
	// Принудительная активация ГенераторФЭД.
	Если ПолучитьЗначениеФичи("1c_fed_activate") Тогда
		
		ИзменитьПараметрПользователя("ИспользоватьГенератор", Истина);
		
	КонецЕсли;
	
	// На случай кривых настроек в Кэш.Парам
	Если	ПолучитьЗначениеПараметраСбис("ЗаполнениеКонтрагента1С") = "ГрузополучательСБИС"
		И	ПолучитьЗначениеПараметраСбис("ТипГрузополучателя") = "ГрузополучательНеВедется" Тогда
	
		ИзменитьПараметрПользователя("ТипГрузополучателя", "ГрузополучательКонтрагент");
	
	КонецЕсли;
	
	// На случай, если в фильтр по непонятным причинам попал ФильтрДокумент и ломает построение списка
	Фильтры = ПолучитьЗначениеПараметраСбис("ФильтрыПоРазделам");
	
	Если ЗначениеЗаполнено(Фильтры) Тогда
	
		Если Фильтры.Свойство("Продажа")
			И Фильтры.Продажа.Свойство("ФильтрДокумент") Тогда
		
			Фильтры.Продажа.Удалить("ФильтрДокумент")
		
		КонецЕсли;
	
		Если Фильтры.Свойство("Покупка")
			И Фильтры.Покупка.Свойство("ФильтрДокумент") Тогда
		
			Фильтры.Покупка.Удалить("ФильтрДокумент")
		
		КонецЕсли;
	
	КонецЕсли;
		
КонецПроцедуры
// BSLLS:CognitiveComplexity-on
// BSLLS:CyclomaticComplexity-on

//При изменении версии внешней обработки со старой на новую
&НаКлиенте
Функция  СбисДействияПриОбновленииВерсии(Кэш, СтараяВерсия, НоваяВерсия) Экспорт
	РезультатДействия = Кэш.ОбщиеФункции.РезультатДействия_Новый(Кэш, Новый Структура("ПредставлениеОперации, ФормаВызова", "Обновление", ГлавноеОкно));
	
	Если НоваяВерсияБольшеКлиент(СтараяВерсия, "24.1100") Тогда
		//Если версия ДО 24.1100 то выставить опцию подразделений в "Не создавать ответственных и подразделения"
		ИзменитьПараметрСбис("ВариантВыгрузкиОтвПодр", 2);
	КонецЕсли;
	
	Если НоваяВерсияБольшеКлиент(СтараяВерсия, "24.2132")
		И НЕ ГлавноеОкно.РежимЗапускаГлавногоОкна = "ВнешнийИнтерфейс" Тогда
		
		ИзменитьПараметрСБИС("ИспользоватьНовуюОтправку", Истина);			
		
	КонецЕсли;
	
	Если НоваяВерсияБольшеКлиент(СтараяВерсия, "24.2162")
		И МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ЗаписейНаСтранице") > 50 Тогда

		ИзменитьПараметрСбис("ЗаписейНаСтранице", 50);
		ГлавноеОкно.ЗаписейНаСтранице = 50;

	КонецЕсли;
	
	// Повторим для устранения аварии
	// https://dev.saby.ru/opendoc.html?guid=1da1ff88-6203-407d-a51d-31dd7a45e78e&client=3
	Если НоваяВерсияБольшеКлиент(СтараяВерсия, "24.3205")
		И (МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ЗаписейНаСтранице") > 50
			ИЛИ ГлавноеОкно.ЗаписейНаСтранице > 50 ) Тогда

		ИзменитьПараметрСбис("ЗаписейНаСтранице", 50);
		ГлавноеОкно.ЗаписейНаСтранице = 50;

	КонецЕсли;
	
	Если НоваяВерсияБольшеКлиент(СтараяВерсия, "24.5100") Тогда
		
		ПараметрыСбисПоУмолчанию = ПараметрыСбисПоУмолчанию();
		
		Если ПустаяСтрока(ПолучитьЗначениеПараметраСбис("ЗаполнениеКонтрагента1С")) Тогда
			ИзменитьПараметрСбис("ЗаполнениеКонтрагента1С",	ПараметрыСбисПоУмолчанию["ЗаполнениеКонтрагента1С"]);
		КонецЕсли;
		
		Если ПустаяСтрока(ПолучитьЗначениеПараметраСбис("ТипГрузополучателя")) Тогда
			ИзменитьПараметрСбис("ТипГрузополучателя",	ПараметрыСбисПоУмолчанию["ТипГрузополучателя"]);
		КонецЕсли;
		
    КонецЕсли;
	
	Если НоваяВерсияБольшеКлиент(СтараяВерсия, "24.5200") Тогда
		
		// для бухгалтерии с с версии настроек АУНБУХЗ-0-105-45 нунужно перейти на новый справочник с испоставления номенклатуры
		Если Нрег(Кэш.ПараметрыСистемы.Конфигурация.Имя) = "арендаиуправлениенедвижимостью" 
			И НоваяВерсияБольшеКлиент("3.0.105.45", Кэш.ПараметрыСистемы.Конфигурация.Версия) Тогда
			
			Кэш.ОбщиеФункции.сбисПереносНоменклатурыПоставщиковВНоменклатуруКонтрагентовНаСервере();
			
		КонецЕсли;
		
    КонецЕсли;
	
	Если НоваяВерсияБольшеКлиент(СтараяВерсия, "24.6200") Тогда

		Для Каждого ФильтрРаздела Из Кэш.Парам.ФильтрыПоРазделам Цикл
			Если НЕ ФильтрРаздела.Значение.Свойство("ФильтрПериод") Тогда
				Продолжить;
			ИначеЕсли ФильтрРаздела.Значение.ФильтрПериод = -1 Тогда
				ФильтрРаздела.Значение.ФильтрПериод = "За период";
			ИначеЕсли ФильтрРаздела.Значение.ФильтрПериод = 0.1 Тогда
				ФильтрРаздела.Значение.ФильтрПериод = "За сегодня";
			ИначеЕсли ФильтрРаздела.Значение.ФильтрПериод = 1 Тогда
				ФильтрРаздела.Значение.ФильтрПериод = "За последний месяц";
			ИначеЕсли ФильтрРаздела.Значение.ФильтрПериод = 6 Тогда
				ФильтрРаздела.Значение.ФильтрПериод = "За последние полгода";
			ИначеЕсли ФильтрРаздела.Значение.ФильтрПериод = 12 Тогда
				ФильтрРаздела.Значение.ФильтрПериод = "За последний год";
			Иначе
				ФильтрРаздела.Значение.ФильтрПериод = "За весь период";
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если НоваяВерсияБольшеКлиент(СтараяВерсия, "25.1100") Тогда
		
		ЗначениеСопоставлениеДатаДок	= ПолучитьЗначениеПараметраСбис("СопоставлениеПоДате");
		ЗначениеСопоставлениеПериодДок	= ПолучитьЗначениеПараметраСбис("СопоставлениеПериод");
		
		Если		ЗначениеСопоставлениеПериодДок = "Дата документа" Тогда
			
			// Поиск период на дату документа это отлонение в 0 дней, т.е. за ту же дату
			ИзменитьПараметрСбис("ПоискПоДате",				2);			
			ИзменитьПараметрСбис("ПоискПоДате_Отклонение",	"Дата");			
			
		ИначеЕсли	ЗначениеСопоставлениеПериодДок = "Месяц с даты документа" Тогда
			
			ИзменитьПараметрСбис("ПоискПоДате",				2);			
			ИзменитьПараметрСбис("ПоискПоДате_Отклонение",	30);			
			
		ИначеЕсли	ЗначениеСопоставлениеПериодДок = "Календарный месяц документа" Тогда

			ИзменитьПараметрСбис("ПоискПоДате",				2);			
			ИзменитьПараметрСбис("ПоискПоДате_Отклонение",	"Месяц");			

		ИначеЕсли	ЗначениеСопоставлениеПериодДок = "Не использовать" Тогда
			
			ИзменитьПараметрСбис("ПоискПоДате",				0);			
			
		ИначеЕсли	ЗначениеСопоставлениеДатаДок = "Не использовать" Тогда
			
			ИзменитьПараметрСбис("ПоискПоДате",			0);
			ИзменитьПараметрСбис("ПоискВходящаяДата",	0);
			
		ИначеЕсли	ЗначениеСопоставлениеДатаДок = "Отклонение 1 день" Тогда
			
			ИзменитьПараметрСбис("ПоискПоДате",						2);			
			ИзменитьПараметрСбис("ПоискПоДате_Отклонение",			1);			
			ИзменитьПараметрСбис("ПоискВходящаяДата",				2);
			ИзменитьПараметрСбис("ПоискВходящаяДата_Отклонение",	1);
			
		ИначеЕсли	ЗначениеСопоставлениеДатаДок = "Точное совпадение" Тогда
			
			ИзменитьПараметрСбис("ПоискПоДате",			1);
			ИзменитьПараметрСбис("ПоискВходящаяДата",	1);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НоваяВерсияБольшеКлиент(СтараяВерсия, "25.3100") Тогда
		
		// Устанавливаем реквизит для КодТов первый из доступных в ини Конфигурации (не всегда Код, есть Артикул)
		СписокИменРеквизитов = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("РеквизитыКодаНоменклатуры");
		ИмяПоУмолчанию = ?(ЗначениеЗаполнено(СписокИменРеквизитов), СписокИменРеквизитов[0], "Код");
		ИзменитьПараметрСбис("РеквизитКодаНоменклатуры", ИмяПоУмолчанию);
		
	КонецЕсли;
	
	Если НоваяВерсияБольшеКлиент(СтараяВерсия, "25.4127") Тогда
		
		// Устанавливаем значения по умолчанию порядка автоматического сопоставления, т.к. этот порядок клияет на само сопоставление
		ПорядокАвтоматическогоСопоставления = ПорядокАвтоматическогоСопоставленияПоУмолчаниюКлиент();
		ПорядокСтрока = "";
		Для Каждого Строка Из ПорядокАвтоматическогоСопоставления Цикл
			ПорядокСтрока = ПорядокСтрока + Строка + ",";
		КонецЦикла;
		ПорядокСтрока = Лев(ПорядокСтрока, СтрДлина(ПорядокСтрока) - 1);
		
		ИзменитьПараметрСбис("ПорядокАвтоматическогоСопоставления", ПорядокСтрока);
		
	КонецЕсли;
	
	Если НоваяВерсияБольшеКлиент(СтараяВерсия, "25.5200") Тогда
		ИзменитьПараметрСбис("СтатусыВГосСистеме", Истина);
	КонецЕсли;

	Если НоваяВерсияБольшеКлиент(СтараяВерсия, "25.6113") Тогда
		
		ИзменитьПараметрПользователя("ОтображениеАктовИНакладных", Ложь);
		
	КонецЕсли;

	// Обновим файлы настроек без поднятия версии к текущей версии конфигурации
	Если НЕ ПолучитьЗначениеПараметраСбис("НастройкиАвтообновление") Тогда
		Отказ = Ложь;
		СтрокаДетализации = Кэш.ОбщиеФункции.РезультатДействия_СформироватьСтрокуДетализации(Кэш,,Новый Структура("Название", "Освежение файлов настроек"));
		РезультатОсвеженияФайловНастроек = Кэш.ФормаНастроекОбщее.ОсвежитьФайлыНастроек(Кэш, Отказ);
		Если Отказ Тогда
			Кэш.ОбщиеФункции.РезультатДействия_ДобавитьОшибку(Кэш, РезультатДействия, СтрокаДетализации, РезультатОсвеженияФайловНастроек);
			Отказ = Ложь;
		Иначе
			Кэш.ОбщиеФункции.РезультатДействия_ДобавитьРезультат(Кэш, РезультатДействия, СтрокаДетализации, Новый Структура("Выполнено, КлючГруппировки", Истина, "Файлы настроек освежены"));
		КонецЕсли;	
	КонецЕсли;
	
	Если НоваяВерсияБольшеКлиент(СтараяВерсия, "26.1100") Тогда
		
		// Вычищаем старый адрес из кэша
		АдресСервиса = ПолучитьПараметрПользователя("АдресСервера");
		АдресСервисаSaby = СтрЗаменить(АдресСервиса, "sbis", "saby");
		ИзменитьПараметрПользователя("АдресСервиса", АдресСервисаSaby);
				
	КонецЕсли;
	
	Если НоваяВерсияБольшеКлиент(СтараяВерсия, "26.4100") Тогда
		
		ТихийРежим = ПараметрSABY("ТихийРежим");
		Если Не ТихийРежим Тогда 
			ИзменитьПараметрПользователя("ИспользоватьНовуюОтправку", Истина);
		КонецЕсли;
				
	КонецЕсли;

	
	Возврат РезультатДействия;
	
КонецФункции

//Выполняется при первом запуске обработки
&НаКлиенте
Процедура СбисДействияПриПервомЗапуске(ПараметрыЗапуска, Кэш) Экспорт

	// Пока оставлена заглушка. По факту, она не нужна, т.к. при старте параметры мы ставим при помощи изменения параметров.

КонецПроцедуры

// Функция - Параметры сбис по умолчанию
// 
// Возвращаемое значение:
//  Структура - 
//				Ключ		- название параметра
//				Значение	- значение параметра
//
&НаКлиенте
Функция ПараметрыСбисПоУмолчанию() Экспорт
	
	#Если ВебКлиент Тогда
		
		// HTTP запросы
		СпособОбменаПоУмолчанию = 3;
		
	#Иначе
		
		// ExtSDK2
		СпособОбменаПоУмолчанию = 6;
		
	#КонецЕсли

	ЗначПоУмолчанию = Новый Структура;

	ЗначПоУмолчанию.Вставить("ТехническиеПараметры", Новый Структура);
	ЗначПоУмолчанию.Вставить("Логин", "");
	ЗначПоУмолчанию.Вставить("Пароль", "");
	ЗначПоУмолчанию.Вставить("Сертификат", "");
	ЗначПоУмолчанию.Вставить("ТипПрокси", "Автоматически");
	ЗначПоУмолчанию.Вставить("ПроксиЛогин", "");
	ЗначПоУмолчанию.Вставить("ПроксиПароль", "");
	ЗначПоУмолчанию.Вставить("ПроксиПорт", "");
	ЗначПоУмолчанию.Вставить("ПроксиСервер", "");
	ЗначПоУмолчанию.Вставить("ЗапомнитьПароль", Ложь);
	ЗначПоУмолчанию.Вставить("ЗапомнитьСертификат", Ложь);
	ЗначПоУмолчанию.Вставить("ВходПоСертификату", Ложь);
	ЗначПоУмолчанию.Вставить("ЗаписейНаСтранице", 50);
	ЗначПоУмолчанию.Вставить("ЗаписейНаСтранице1С", 50);
	ЗначПоУмолчанию.Вставить("РежимСопоставления", 1);
	ЗначПоУмолчанию.Вставить("СопоставлениеПоСумме", 0);
	ЗначПоУмолчанию.Вставить("СопоставлениеПоНомеру", "Точное совпадение");
	ЗначПоУмолчанию.Вставить("СопоставлениеПоДате", "Точное совпадение");
	ЗначПоУмолчанию.Вставить("СопоставлениеПоКонтрагенту", "По ИНН/КПП");
	ЗначПоУмолчанию.Вставить("СопоставлениеПоОрганизации", "Не использовать");
	ЗначПоУмолчанию.Вставить("СопоставлениеПериод", "Дата документа");
	ЗначПоУмолчанию.Вставить("ПоискПоДате",			1);
	ЗначПоУмолчанию.Вставить("ПоискВходящаяДата",	1);
	ЗначПоУмолчанию.Вставить("ПоискПоДате_Отклонение");
	ЗначПоУмолчанию.Вставить("ПоискВходящаяДата_Отклонение");
	
	ЗначПоУмолчанию.Вставить("СопоставлятьПередЗагрузкой", Ложь);
	ЗначПоУмолчанию.Вставить("УстанавливатьОбновленияАвтоматически", Истина);
	ЗначПоУмолчанию.Вставить("КаталогОтладки", "");
	ЗначПоУмолчанию.Вставить("ОжидаемаяВерсия", "");
	ЗначПоУмолчанию.Вставить("ВариантВыгрузкиОтвПодр", 2);// Значение по-умолчанию - 2, не создавать отв. и подразделения
	ЗначПоУмолчанию.Вставить("КолПакетовВОтправке", 0);
	ЗначПоУмолчанию.Вставить("КаталогНастроек", "");
	ЗначПоУмолчанию.Вставить("ИдентификаторыНастроекВСБИС", Новый СписокЗначений);
	ЗначПоУмолчанию.Вставить("ИдентификаторНастроек", "");

	ЗначПоУмолчанию.Вставить("СпособОбмена",			СпособОбменаПоУмолчанию); 
	ЗначПоУмолчанию.Вставить("СпособХраненияНастроек",	1); // Файлы настроек в СБИС
	
	ЗначПоУмолчанию.Вставить("КаталогОбмена", ""); 
	ЗначПоУмолчанию.Вставить("УдалятьПрефиксИнформационнойБазы", Ложь);
	ЗначПоУмолчанию.Вставить("УдалятьПользовательскийПрефикс", Ложь);
	ЗначПоУмолчанию.Вставить("РазделПоУмолчанию", "Полученные");
	ЗначПоУмолчанию.Вставить("ОтправлятьНоменклатуруСДокументами", Ложь);
	ЗначПоУмолчанию.Вставить("ПересчитыватьЦеныПоДанным1С", 0);
	ЗначПоУмолчанию.Вставить("ПересчитыватьНДСПоДанным1С", 0);
	ЗначПоУмолчанию.Вставить("СпособЗагрузки", 0); 
	ЗначПоУмолчанию.Вставить("ПерезаполнятьТолькоНепроведенные", Ложь);
	ЗначПоУмолчанию.Вставить("ИдентификаторСессии", "");
	ЗначПоУмолчанию.Вставить("СостояниеЭД", Ложь);	// alo
	ЗначПоУмолчанию.Вставить("Меркурий", Ложь);	// alo Меркурий
	ЗначПоУмолчанию.Вставить("ШифроватьВыборочно", Ложь);
	ЗначПоУмолчанию.Вставить("АдресСервера", "https://online.saby.ru/");
	ЗначПоУмолчанию.Вставить("НастройкиАвтообновление", Истина);
	ЗначПоУмолчанию.Вставить("ИнтеграцияAPIВызовыНаКлиенте", Ложь);
	ЗначПоУмолчанию.Вставить("СтатусыВГосСистеме", Истина);
	ЗначПоУмолчанию.Вставить("ВремяОжиданияОтвета", 60); // Время ожидания ответа (для плагина)
	ЗначПоУмолчанию.Вставить("ИспользоватьШтрихкодыНоменклатурыКонтрагентов", Ложь);
	ЗначПоУмолчанию.Вставить("РежимЗагрузки", 3); // Загружать только несопоставленные документы 1С
	ЗначПоУмолчанию.Вставить("СпособХраненияМетокСтатусов", 0); // Обновлять статусы в разрезе пользователя СБИС
	ЗначПоУмолчанию.Вставить("СоздаватьШтрихкодыНоменклатуры", Ложь);
	ЗначПоУмолчанию.Вставить("СохранятьРасхождения", Ложь);
	ЗначПоУмолчанию.Вставить("ПрикреплятьСчетНаОплатуКДокументуУПД", Ложь);
	ЗначПоУмолчанию.Вставить("ДокументДляСчетаНаОплату", "");
	ЗначПоУмолчанию.Вставить("ОтображениеАктовИНакладных", Ложь);
	ЗначПоУмолчанию.Вставить("УКД2026", Ложь);
	
	ЗначПоУмолчанию.Вставить("ПредВерсия", Неопределено);
	
	ФильтрыПоРазд = Новый Структура();
	ФильтрыПоРазд.Вставить("Полученные",		Новый Структура);
	ФильтрыПоРазд.Вставить("Отправленные",		Новый Структура);
	ФильтрыПоРазд.Вставить("Полученные_ЭТрН",	Новый Структура);
	ФильтрыПоРазд.Вставить("Отправленные_ЭТрН", Новый Структура);
	ФильтрыПоРазд.Вставить("Продажа",			Новый Структура);
	ФильтрыПоРазд.Вставить("Покупка",			Новый Структура);
	ФильтрыПоРазд.Вставить("Задачи",			Новый Структура);
	ФильтрыПоРазд.Вставить("Учет",				Новый Структура);
	
	ЗначПоУмолчанию.Вставить("ФильтрыПоРазделам", ФильтрыПоРазд);
	ЗначПоУмолчанию.Вставить("ИспользоватьГенератор",				Истина); 
	ЗначПоУмолчанию.Вставить("ИспользоватьНовыйФорматАктаСверки",	Ложь);  
	ЗначПоУмолчанию.Вставить("ФорматЭДОСч2025",						Ложь);  
	ЗначПоУмолчанию.Вставить("ИспользоватьНовуюОтправку",			Истина);  
	ЗначПоУмолчанию.Вставить("РеквизитСопоставленияНоменклатуры",	РеквизитСопоставленияНоменклатурыПоУмолчанию());
	ЗначПоУмолчанию.Вставить("ПоддержкаОбменаЕИС",					Ложь);
	
	// Проект Контрагенты 1С в обработке
	ЗначПоУмолчанию.Вставить("СкладПоУмолчанию",		Неопределено);
	ЗначПоУмолчанию.Вставить("РасСчетПоУмолчанию",		Неопределено);
	ЗначПоУмолчанию.Вставить("ЗаполнениеКонтрагента1С",	"ПокупательСБИС");
	ЗначПоУмолчанию.Вставить("ТипГрузополучателя",		"ГрузополучательНеВедется");
	
	// Проект БыстроеВнедрение
	ЗначПоУмолчанию.Вставить("АвтоматическоеПроведениеЗаказов", Ложь);
	ЗначПоУмолчанию.Вставить("ИскатьВДополнительныхИсточниках", Ложь);
	
	// Проект Расширение функционала сопоставления номенклатуры  
	ЗначПоУмолчанию.Вставить("ИспользоватьНовоеСопоставлениеНоменклатуры",			Ложь);
	ПорядокАвтоматическогоСопоставленияПоУмолчанию = "Артикул,КодПоставщика,КодПокупателя,GTIN,Идентификатор";
	ЗначПоУмолчанию.Вставить("ПорядокАвтоматическогоСопоставления",					ПорядокАвтоматическогоСопоставленияПоУмолчанию);
	ЗначПоУмолчанию.Вставить("ПараметрыСохраненияСопоставлений",					Неопределено);
	ЗначПоУмолчанию.Вставить("СпособСопоставленияНоменклатуры",						Неопределено);	           
	ЗначПоУмолчанию.Вставить("ИспользоватьАвтоматическоеСопоставлениеНоменклатуры", Ложь); 
	ЗначПоУмолчанию.Вставить("ИспользоватьОбратноеСопоставление", 					Ложь);
	ЗначПоУмолчанию.Вставить("ВключенПереносСтарогоСопоставления", 					Истина);
	
	ЗначПоУмолчанию.Вставить("ПараметрыПереносаСопоставлений_Контрагент",			"");
	ЗначПоУмолчанию.Вставить("ПараметрыПереносаСопоставлений_Начат",				Ложь);
	ЗначПоУмолчанию.Вставить("ПараметрыПереносаСопоставлений_Страница",				1);
	ЗначПоУмолчанию.Вставить("ПараметрыПереносаСопоставлений_Форма",				"");
	ЗначПоУмолчанию.Вставить("ПараметрыПереносаСопоставлений_Завершен",				Ложь);

	//1189641556
	ЗначПоУмолчанию.Вставить("СоздаватьЧерновик", Ложь);
	ЗначПоУмолчанию.Вставить("ОтложенныйЗапуск", Ложь);
	
	ЗначПоУмолчанию.Вставить("Филиалы_Получатель",	Истина);
	ЗначПоУмолчанию.Вставить("Филиалы_Отправитель", Ложь);
	
	НастройкиКрипто = Новый Структура();
	НастройкиКрипто.Вставить("ИмяПрограммы", "");
	НастройкиКрипто.Вставить("ПутьКПрограмме", "");
	НастройкиКрипто.Вставить("ТипПрограммы", 0);
	НастройкиКрипто.Вставить("ПодписьНаСервере", Ложь);
	ЗначПоУмолчанию.Вставить("НастройкиКриптографии", НастройкиКрипто); 

	ЗначПоУмолчанию.Вставить("ЧтениеНастроекПоТребованию",	Истина);
	ЗначПоУмолчанию.Вставить("РежимОтладки",				Ложь);
	ЗначПоУмолчанию.Вставить("ПолнаяВерсияПродукта",		ГлобальныйКэш.ПараметрыСистемы.Обработка.ПолнаяВерсия);
	ЗначПоУмолчанию.Вставить("UserAgent",					ГлобальныйКэш.ПараметрыСистемы.Обработка.UserAgent);
	
	ЗначПоУмолчанию.Вставить("РеквизитКодаНоменклатуры", "Код");
	
	Возврат ЗначПоУмолчанию;
	
КонецФункции

