
&НаКлиенте
Функция ПрочитатьДокументСБИС(ОписаниеДокументаСБИС, ДопПараметры) Экспорт
	Перем НаборВложенийРазбор;
	
	ИдДок	= ОписаниеДокументаСБИС.Идентификатор;
	
	Если ДопПараметры.Свойство("ПерегенерироватьВложения") И ДопПараметры.ПерегенерироватьВложения Тогда
		ПараметрыЧтения = Новый Структура("Идентификатор, ДопПоля", Строка(ИдДок), "ЭтапВернутьВсеСертификаты,Лицо2,Лицо3");	
	Иначе
		ПараметрыЧтения = Новый Структура("Идентификатор, ДопПоля", Строка(ИдДок), "ЭтапВернутьВсеСертификаты,Лицо2,Лицо3,НеПерегенерироватьВложения");
	КонецЕсли;
	
	Если ДопПараметры.Свойство("Этап") Тогда
		
		ПараметрыЧтения.Вставить("Этап", ДопПараметры.Этап);
		
	КонецЕсли;
	
	ДопПараметры.Вставить("ЕстьРезультат", Истина);
	
	Если	ПолучитьЗначениеПараметраСБИС("ПоддержкаОбменаЕИС")
		И	ДопПараметры.Свойство("РеализацияЕИС")
		И	ДопПараметры.РеализацияЕИС Тогда
		
		ПараметрыЧтения.ДопПоля = ПараметрыЧтения.ДопПоля + ",Расширение,ЕИС";
		ДопПараметры.Удалить("РеализацияЕИС");
		
	КонецЕсли;
	
	ИнтеграцияМодуль	= ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция");
	ОшибкаЧтения		= Ложь;
	
	оДокумент			= ИнтеграцияМодуль.СБИС_ПрочитатьДокумент(ПолучитьТекущийЛокальныйКэш(), ПараметрыЧтения, ДопПараметры, ОшибкаЧтения);
	Если	ОшибкаЧтения Тогда
		
		ОшибкаПолученияДокумента = НовыйСбисИсключение(оДокумент, "МодульОбъектаКлиент.ПрочитатьДокументСБИС");
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаПолученияДокумента);;
		
	КонецЕсли;
	
	НужныСлужебные =	ДопПараметры.Свойство("НужныСлужебные")
					И	ДопПараметры.НужныСлужебные;
							
	МассивВложений	= Новый Массив;
	МассивСлужебных	= Новый Массив;
	
	Если	оДокумент.Свойство("Вложение", НаборВложенийРазбор)
		И	ЗначениеЗаполнено(НаборВложенийРазбор) Тогда
		
		Для Каждого ВложениеПроверить Из НаборВложенийРазбор Цикл
			
			Если	Не	ВложениеПроверить.Свойство("Служебный") 
				Или 	ВложениеПроверить.Служебный = "Нет" Тогда
				
				МассивВложений.Добавить(ВложениеПроверить);
				
			Иначе	
				
				МассивСлужебных.Добавить(ВложениеПроверить);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	оДокумент.Вставить("Вложение", МассивВложений);
							
	Если НужныСлужебные Тогда
		
		оДокумент.Вставить("ВложениеСлужебные", МассивСлужебных);
	
	КонецЕсли;
	
	Возврат оДокумент;
	
КонецФункции

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Документы_Генератор
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Документы_Загрузка
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Документы_Выгрузка
#КонецОбласти 

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Документы_Просмотр
#КонецОбласти

