
// Функция - возвращает модуль интеграции СБИС по его ИД
//
// Параметры:
//  ИДМодуляИнтеграции	 - Строка, Число	 - идентификатор способа обмена в виде его номера, либо значение свойства ИнтеграцияИмя
// 
// Возвращаемое значение:
//  Форма/Управляемая форма - модуль, в котором описана интеграция. ВЫЗОВЫ МОГУТ БЫТЬ В ДРУГОЙ ФОРМЕ
//
&НаКлиенте
Функция МодульИнтеграцииСБИС(ИДМодуляИнтеграции) Экспорт
	Перем ИмяМодуляИнтеграции;
	
	СписокДоступныхСпособовОбмена = СписокИнтеграцийСБИС();
	
	Если ТипЗнч(ИДМодуляИнтеграции) = Тип("Число") Тогда
		
		ИмяМодуляИнтеграции = СписокДоступныхСпособовОбмена.НайтиПоЗначению(ИДМодуляИнтеграции);
		
		Если Не ИмяМодуляИнтеграции = Неопределено Тогда
			
			ИмяМодуляИнтеграции = ИмяМодуляИнтеграции.Представление;
			
		КонецЕсли;
		
	Иначе
		
		Для Каждого ЭлементСписка Из СписокДоступныхСпособовОбмена Цикл
			Если НРег(ЭлементСписка.Представление) = НРег(ИДМодуляИнтеграции) Тогда
				
				ИмяМодуляИнтеграции = ЭлементСписка.Представление;
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ИмяМодуляИнтеграции = Неопределено Тогда
		
		Возврат ИмяМодуляИнтеграции;
		
	КонецЕсли;
	
	Возврат ПолучитьФормуОбработки(ИмяМодуляИнтеграции);
	
КонецФункции

&НаКлиенте
Функция СписокИнтеграцийСБИС() Экспорт
	
	СписокИтог = Новый СписокЗначений;
	СписокИтог.Добавить(0, "SDK2");
	СписокИтог.Добавить(1, "ИнтеграцияКаталог");
	СписокИтог.Добавить(2, "SDK2Шифрование");
	СписокИтог.Добавить(3, "API");
	СписокИтог.Добавить(4, "ExtSDK2");
	СписокИтог.Добавить(5, "ExtSDK2Crypto");
	СписокИтог.Добавить(6, "ExtSDK2");
	СписокИтог.Добавить(7, "ExtSDK2Crypto");
	СписокИтог.Добавить(8, "SabyPluginConnector");
	СписокИтог.Добавить(9, "SabyHttpsClient");
	
	Возврат СписокИтог;
	
КонецФункции
	
