
//Для определенных ИБ нельзя хранить настройки в хранилище из-за ограничения прав. Используем СБИС параметры для такого.
&НаКлиенте
Функция		ИспользоватьСбисПараметрыДляХраненияОбщихНастроек() Экспорт
	Результат = 	ГлобальныйКэш.ПараметрыСистемы.Клиент.РежимЗапускаПриложения = "ТолстыйКлиентОбычноеПриложение"
			И	Не	ГлобальныйКэш.ПараметрыСистемы.Конфигурация.Файловая
			Или	Не	ГлобальныйКэш.ПараметрыСистемы.Пользователь.ДоступноОбщееХранилище;
			
	Если	Результат
		И	ГлобальныйКэш.Парам.СпособХраненияМетокСтатусов = 2 Тогда
		ИзменитьПараметрСбис("СпособХраненияМетокСтатусов", 1);
		МеткиСтатусов = ГлобальныйКэш.ТекущийСеанс.Модули.Настройки.СбисПрочитатьМеткиСтатусов(ГлавноеОкно.Кэш);
		ЗаполнитьЗначенияСвойств(ГлавноеОкно, МеткиСтатусов);
		ГлобальныйКэш.ТекущийСеанс.Модули.Настройки.ИнициализироватьКэшНастроек(ГлавноеОкно.Кэш, Новый Структура("Обновить, Параметр", Истина, "status_marks")); //для способа хранения меток в разрезе аккаунта добавим status_marks в список параметров, хранящихся на шаблоне	
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

// Функция - читает общие настройки Saby
//
// Параметры:
//  КлючНастройки	 - Строка Необязательный	 - При необходимости получить не все настройки, а конкретное значение
// 
// Возвращаемое значение:
//  Значение настроек/настройки по ключу - Соответствие/Произвольный
//
&НаКлиенте
Функция ПрочитатьОбщиеНастройки(КлючНастройки=Неопределено, ДопПараметры=Неопределено) Экспорт
	
	Попытка
		
		Если ИспользоватьСбисПараметрыДляХраненияОбщихНастроек() Тогда
			
			Возврат СбисОбщиеПараметрыИзПодключения(КлючНастройки);
			
		Иначе
			
			ПараметрыПрочитать = Новый ФиксированнаяСтруктура("Общее", Истина);
			Возврат ПрочитатьПараметрыSABYИзХранилищаНастроек(КлючНастройки, ПараметрыПрочитать);
			
		КонецЕсли;
		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ВызватьСбисИсключение(ИнфоОбОшибке, "МодульОбъектаКлиент.ПрочитатьОбщиеНастройки");
	КонецПопытки;
	
КонецФункции

// Функция - читает общие настройки на стороне сервера
//
// Параметры:
//  КлючНастройки	 - Строка Необязательный	 - При необходимости получить не все настройки, а конкретное значение
// 
// Возвращаемое значение:
//  Значение настроек/настройки по ключу - Соответствие/Произвольный
//
&НаКлиенте
Функция СбисОбщиеПараметрыИзПодключения(КлючНастройки=Неопределено)
	Перем СбисПараметрыПользователей, ЗначениеНастройки;
	
	СбисКлючи			= ПараметрыКлючаОбщихНастроек();
	СбисКлючНастроек	= СбисКлючи.КлючОбъекта + "_" + СбисКлючи.КлючНастроек;
	
	Попытка
		ПараметрыЧтения		= Новый Структура("Ключ, КлючНастройки", СбисКлючНастроек, КлючНастройки);
		ЗначениеНастройки	= ГлобальныйКэш.ТекущийСеанс.Модули.Настройки.ПрочитатьОбщуюНастройкуПодключения(ПараметрыЧтения, ГлавноеОкно.Кэш);
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ВызватьСбисИсключение(ИнфоОбОшибке, "МодульОбъектаКлиент.СбисОбщиеПараметрыИзПодключения");
	КонецПопытки;
	Если	КлючНастройки		= Неопределено
		И	ЗначениеНастройки	= Неопределено Тогда 
		ЗначениеНастройки = Новый Структура
	КонецЕсли;
	
	Возврат ЗначениеНастройки;
	
КонецФункции

// Процедура - сохраняет общую настройку Saby
//
// Параметры:
//  КлючНастройки		 - Строка	- Ключ записи
//  ЗначениеНастройки	 - Произвольный	 - Значение для записи
//
&НаКлиенте
Процедура СохранитьОбщуюНастройку(КлючНастройки, ЗначениеНастройки) Экспорт
	Попытка
		ПараметрыОбновитьДляСервера = Новый Структура;
		ПараметрыОбновитьДляСервера.Вставить(КлючНастройки, ЗначениеНастройки);
		СохранитьОбщиеНастройки(ПараметрыОбновитьДляСервера)
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ВызватьСбисИсключение(ИнфоОбОшибке, "МодульОбъектаКлиент.СохранитьОбщуюНастройку");
	КонецПопытки;	
КонецПроцедуры

// Процедура - сохраняет общие настройки Saby
//
// Параметры:
//  КлючНастройки		 - Строка	- Ключ записи
//  ЗначениеНастройки	 - Произвольный	 - Значение для записи
//
&НаКлиенте
Процедура СохранитьОбщиеНастройки(НастройкиЗаписать, ДопПараметры=Неопределено) Экспорт
	
	Попытка
		Если ИспользоватьСбисПараметрыДляХраненияОбщихНастроек() Тогда
			
			СбисСохранитьОбщиеНастройкиВПодключение(НастройкиЗаписать, ДопПараметры);
			
		Иначе
			
			ПараметрыЗаписать = Новый ФиксированнаяСтруктура("Общее", Истина);
			СохранитьПараметрыSABYВХранилищеНастроек(НастройкиЗаписать, ПараметрыЗаписать);
			
		КонецЕсли;
		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ВызватьСбисИсключение(ИнфоОбОшибке, "МодульОбъектаКлиент.СохранитьОбщиеНастройки");
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СбисСохранитьОбщиеНастройкиВПодключение(ЗначенияОбновить, ДопПараметры)
	
	Перем СбисПараметрыПользователей, ЗначениеПараметраВШаблоне;
	
	Отказ						= Ложь;
	СбисКлючи					= ПараметрыКлючаОбщихНастроек();
	СбисКлючНастроек			= СбисКлючи.КлючОбъекта + "_" + СбисКлючи.КлючНастроек;
	Попытка
		СбисПараметрыПользователей	= СбисОбщиеПараметрыИзПодключения();
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ВызватьСбисИсключение(ИнфоОбОшибке, "МодульОбъектаКлиент.СбисСохранитьОбщиеНастройкиВПодключение");
	КонецПопытки;
	лЗаменитьЗначение = ДопПараметры.Свойство("Заменить") И ДопПараметры.Заменить;
	
	//Дополнить текущую структуру параметров новыми значениями
	Для Каждого Элемент Из ЗначенияОбновить Цикл
		Если Не СбисПараметрыПользователей.Свойство(Элемент.Ключ, ЗначениеПараметраВШаблоне)
			Или	лЗаменитьЗначение Тогда
			СбисПараметрыПользователей.Вставить(Элемент.Ключ, Элемент.Значение);
		ИначеЕсли	ТипЗнч(ЗначениеПараметраВШаблоне)	= Тип("Структура")
				И	ТипЗнч(Элемент.Значение)			= Тип("Структура") Тогда
			ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.СбисСкопироватьСтруктуруНаКлиенте(ЗначениеПараметраВШаблоне, Элемент.Значение);
			СбисПараметрыПользователей.Вставить(Элемент.Ключ, ЗначениеПараметраВШаблоне);
		Иначе
			СбисПараметрыПользователей.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыЗаписи = Новый Структура("Настройка",  Новый Структура(СбисКлючНастроек, СбисПараметрыПользователей));
	Попытка
		ГлобальныйКэш.ТекущийСеанс.Модули.Настройки.ЗаписатьОбщуюНастройкуПодключения(ПараметрыЗаписи, ГлавноеОкно.Кэш);
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ВызватьСбисИсключение(ИнфоОбОшибке, "МодульОбъектаКлиент.СбисСохранитьОбщиеНастройкиВПодключение");
	КонецПопытки;
	
КонецПроцедуры

