
Функция ВыбратьДокументыПоТипамВызовСервера(Документы1С, ТипДокумента)
	
	Возврат МодульОбъектаСервер().ВыбратьДокументыПоТипам(Документы1С, ТипДокумента);
	
КонецФункции

// Функция - сравнивает две версии по разрядно и сообщает, больше ли новая версия старой, или нет	
//
// Параметры:
//  ВерсияДляСравнения	 - Строка	 - формат 1.1.1.1 старая версия, с которой проводится сравнение
//  ВерсияНоваяСравнить	 - Строка	 - формат 1.1.1.1 новая версия для сравнения
// 
// Возвращаемое значение:
//  Булево - Истина если ВерсияНоваяСравнить больше ВерсияДляСравнения
//
&НаКлиенте
Функция НоваяВерсияБольшеКлиент(ВерсияДляСравнения, ВерсияНоваяСравнить) Экспорт

	Возврат СравнитьВерсииБольшеМеньше(ВерсияДляСравнения, ВерсияНоваяСравнить);
	
КонецФункции

// Функция - сравнивает две версии по разрядно и сообщает, больше ли новая версия старой, или нет	
//
// Параметры:
//  ВерсияДляСравнения	 - Строка	 - формат 1.1.1.1 старая версия, с которой проводится сравнение
//  ВерсияНоваяСравнить	 - Строка	 - формат 1.1.1.1 новая версия для сравнения
// 
// Возвращаемое значение:
//  Булево - Истина если ВерсияНоваяСравнить больше ВерсияДляСравнения
//
&НаКлиентеНаСервереБезКонтекста
Функция СравнитьВерсииБольшеМеньше(ВерсияДляСравнения, ВерсияНоваяСравнить) 
	
	Если		Не ЗначениеЗаполнено(ВерсияДляСравнения) Тогда
		Возврат Истина;
	ИначеЕсли	Не ЗначениеЗаполнено(ВерсияНоваяСравнить) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Версия1Разделить	= СтрЗаменить(ВерсияДляСравнения, ".", Символы.ПС);
	Версия2Разделить	= СтрЗаменить(ВерсияНоваяСравнить, ".", Символы.ПС);
	сЧислоРазрядов		= Макс(СтрЧислоСтрок(Версия1Разделить), СтрЧислоСтрок(Версия2Разделить));
	ОписаниеЧисло		= Новый ОписаниеТипов("Число");
	Для Индекс = 1 По сЧислоРазрядов Цикл
		Если СтрЧислоСтрок(Версия1Разделить) >= Индекс Тогда
			Число1Сравнить = ОписаниеЧисло.ПривестиЗначение(СтрПолучитьСтроку(Версия1Разделить, Индекс));
		Иначе
			Число1Сравнить = 0;
		КонецЕсли;
		
		Если СтрЧислоСтрок(Версия2Разделить) >= Индекс Тогда
			Число2Сравнить = ОписаниеЧисло.ПривестиЗначение(СтрПолучитьСтроку(Версия2Разделить, Индекс));
		Иначе
			Число2Сравнить = 0;
		КонецЕсли;
		
		Если		Число1Сравнить = Число2Сравнить		Тогда
			Продолжить;
		ИначеЕсли	Число2Сравнить > Число1Сравнить		Тогда
			Возврат Истина;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
	
КонецФункции	

// Функция заполняет реквизиты объекта 1С из одноименных полей структуры. Поддерживаемые типы: Документ, Справочник	
//
// Параметры:
//  СтруктураДокОбъект		 - Структура	 - поля, идентичные создаваемому/перезаполняемому объекту
//  ДопПараметры			 - Струкутра	 - Расширение для объекта
//  Отказ					 - Булево		 - Истина если в качестве результата вернулась ошибка
// 
// Возвращаемое значение:
//   - 
//
&НаСервере
Функция СоздатьОбъектИзСтруктуры(Знач СтруктураДокОбъект, Знач ДопПараметры, Отказ) Экспорт
	
	Возврат МодульОбъектаСервер().СоздатьОбъект1СИзСтруктурыНаСервере(СтруктураДокОбъект, ДопПараметры, Отказ);

КонецФункции 

//Функция сериализует версию из формата 1С в формат Число и обратно. Пример в 1С: 3.0.40.40, пример в число: 3 0000 0040 0040
&НаКлиенте                                  
Функция ПривестиВерсию(Версия, ПараметрыПриведения) Экспорт
		
	ВариантПриведения	= ?(ПараметрыПриведения.Свойство("ВариантПриведения"),	ПараметрыПриведения.ВариантПриведения,	"ЧислоВСтроку");
	Разделитель			= ?(ПараметрыПриведения.Свойство("Разделитель"),		ПараметрыПриведения.Разделитель,		".");
	Заполнитель			= ?(ПараметрыПриведения.Свойство("Заполнитель"),		ПараметрыПриведения.Заполнитель,		"0");
	Разрядность			= ?(ПараметрыПриведения.Свойство("Разрядность"),		ПараметрыПриведения.Разрядность,		4);
	ЧислоРазрядов		= ?(ПараметрыПриведения.Свойство("ЧислоРазрядов"),		ПараметрыПриведения.ЧислоРазрядов,		4);
	Результат			= "";
	
	СтрокаВерсии	= СокрЛП(СтрЗаменить(Формат(Версия, "ЧН=0; ЧГ=0"), Символы.НПП, ""));
	
	Если		ВариантПриведения	= "СтрокуВЧисло" Тогда//Переводит из формата 1.1.1.1 в число 1 0001 0001 0001
		МногоуровневаяСтрока = СтрЗаменить(СтрокаВерсии, Разделитель, Символы.ПС);
		Для шаг = 2 По СтрЧислоСтрок(МногоуровневаяСтрока) Цикл
			СтрокаРазряда = СтрПолучитьСтроку(МногоуровневаяСтрока, шаг);
			Пока СтрДлина(СтрокаРазряда) < Разрядность Цикл
				СтрокаРазряда = Заполнитель + СтрокаРазряда;
			КонецЦикла;
			Результат = Результат + СтрокаРазряда;
		КонецЦикла;
		Результат = СтрПолучитьСтроку(МногоуровневаяСтрока, 1)	+ Результат;
		Результат = Число(Результат);
	ИначеЕсли	ВариантПриведения	= "ЧислоВСтроку" Тогда//Переводит из формата числа 1 0001 0001 0001 в 1.1.1.1
		Если СтрЧислоВхождений(СтрокаВерсии, Разделитель) = ЧислоРазрядов - 1 Тогда//версия уже сериализована.
			Возврат	СтрокаВерсии;
		КонецЕсли;
		ДробЧислоРазрядов	= СтрДлина(СтрокаВерсии) / Разрядность;
		ЦелЧислоРазрядов	= ?(Цел(ДробЧислоРазрядов) = ДробЧислоРазрядов, ДробЧислоРазрядов, Цел(ДробЧислоРазрядов)	+ 1);
		
		Для шаг = 1 По ЦелЧислоРазрядов Цикл
			Если СтрДлина(СтрокаВерсии) > Разрядность * шаг Тогда 
				СтрокаРазряда	= Сред(СтрокаВерсии, (СтрДлина(СтрокаВерсии)	- Разрядность*шаг)+1, Разрядность);
			Иначе
				СтрокаРазряда	= Сред(СтрокаВерсии, 1, Разрядность-(Разрядность*шаг-СтрДлина(СтрокаВерсии)));
			КонецЕсли;
			Пока	Лев(СтрокаРазряда, 1) = Заполнитель
				И	СтрДлина(СтрокаРазряда) > 1	Цикл
				СтрокаРазряда	= Сред(СтрокаРазряда, 2);
			КонецЦикла;
			Результат	= Разделитель	+ СтрокаРазряда	+ Результат;
		КонецЦикла;
		Если ЧислоРазрядов > ЦелЧислоРазрядов Тогда
			Для	шаг = 1 По ЧислоРазрядов - ЦелЧислоРазрядов	Цикл
				Результат = Разделитель	+ Заполнитель + Результат;
			КонецЦикла;
		КонецЕсли;
		Если Лев(Результат, 1) = Разделитель Тогда
			Результат = Сред(Результат, 2);
		КонецЕсли;
	ИначеЕсли	ВариантПриведения	= "Дозаполнить"	Тогда//дозаполнение версии до стандарта. Пример: версия 1.1.1 станет 1.1.1.0
		ВспомогательныйРазделитель	= ?(ПараметрыПриведения.Свойство("ВспомогательныйРазделитель"), ПараметрыПриведения.ВспомогательныйРазделитель, "-");
		шаг = 0;
		Если Не ПустаяСтрока(СтрокаВерсии) Тогда
			МногоСтрочнаяЗапись = СтрЗаменить(СтрокаВерсии, ВспомогательныйРазделитель, Символы.ПС);
			Пока шаг < СтрЧислоСтрок(МногоСтрочнаяЗапись) Цикл
				шаг = шаг + 1;
				Результат = Результат + СтрПолучитьСтроку(МногоСтрочнаяЗапись, шаг)	+ Разделитель;
			КонецЦикла;
		КонецЕсли;
		Пока шаг < ЧислоРазрядов Цикл//Дозаполнить недостающие разряды
			шаг = шаг + 1;
			Результат = Результат + "0" + Разделитель;
		КонецЦикла;
		Результат = Лев(Результат, СтрДлина(Результат) - СтрДлина(Разделитель));
	КонецЕсли;
	
	Возврат	Результат;
	
КонецФункции

&НаКлиенте
Процедура СбисОткрытьДокументы(ОписаниеДокументовОткрыть, ДопПараметры=Неопределено) Экспорт
    Перем ДокументыОткрыть;
	
	Если ОписаниеДокументовОткрыть.Свойство("СписокСсылок", ДокументыОткрыть) Тогда	
		
		Для Каждого Документ1С Из ДокументыОткрыть Цикл
			
			СбисОткрытьКарточку1С(Документ1С.Значение);
			
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СбисОткрытьКарточку1С(КарточкаСсылка, ДопПараметры=Неопределено) Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		ОткрытьЗначение(КарточкаСсылка);
		
	#Иначе
		
		ПоказатьЗначение(, КарточкаСсылка);
	
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Функция ЗапуститьМассовуюОтправкуДокументов(МассивПакетов, ДопПараметры) Экспорт
    Перем ОбработчикРезультатОтправки, РеестрОтправки;
	
	ИспользоватьНовуюОтправку = ПолучитьЗначениеПараметраСбис("ИспользоватьНовуюОтправку") 
							Или (ДопПараметры.Свойство("ИспользоватьНовуюОтправку") И ДопПараметры.ИспользоватьНовуюОтправку);
							
	Если Не ДопПараметры.Свойство("Реестр", РеестрОтправки) Тогда
		
		РеестрОтправки = ПолучитьТекущийЛокальныйКэш().Текущий;
		
	КонецЕсли;

	Если ИспользоватьНовуюОтправку Тогда	
		ГлавноеОкно.Кэш.СписокНоменклатуры.Очистить();
		
		Если Не ДопПараметры.Свойство("ОбработчикРезультата", ОбработчикРезультатОтправки) Тогда
			
			ОбработчикРезультатОтправки	= НовыйСбисОписаниеОповещения("ЗапуститьМассовуюОтправкуДокументов_Завершение", МодульОбъектаКлиент());
			
		КонецЕсли;
		
		ПараметрыОтправки = Новый Структура;
		ПараметрыОтправки.Вставить("ДанныеКОтправке",		Новый Структура("СписокПакетов", МассивПакетов));
		ПараметрыОтправки.Вставить("ОбработчикРезультата",	ОбработчикРезультатОтправки);
		ПараметрыОтправки.Вставить("ВерсияОтправки",		2);
		ПараметрыОтправки.Вставить("Реестр",				РеестрОтправки);
		
		Если ДопПараметры.Свойство("МодульПодготовки") Тогда
			
			ПараметрыОтправки.Вставить("МодульПодготовки",	ДопПараметры.МодульПодготовки);
			
		КонецЕсли;
		
		РезультатОтправки = НовыйМассоваяОперация(ПараметрыОтправки);
		ГлавноеОкно.Кэш.Вставить("РезультатОтправки", РезультатОтправки);
		
		МассоваяОперация_МассоваяОтправка(РезультатОтправки);
		
	Иначе
		
		ДопПараметры.Вставить("ВерсияОтправки", 1);
		КлассОтправки = НовыйМассоваяОперация(ДопПараметры);
		ГлавноеОкно.Кэш.Вставить("РезультатОтправки", КлассОтправки);
		
		ФормыПоискаОтправки = Новый Массив;
		ФормыПоискаОтправки.Добавить("Документ_" + РеестрОтправки.ОписаниеРаздела.Ини);
		ФормыПоискаОтправки.Добавить("Документ_Шаблон");
		фрм = НайтиФункциюСеансаОбработки("ОтправитьДокументы", ФормыПоискаОтправки);
		фрм.ОтправитьДокументы(ГлавноеОкно.Кэш, МассивПакетов);
		
	КонецЕсли;
	
КонецФункции

// Процедура - завершение отправки и обработка результата
//
// Параметры:
//  РезультатОтправки	 - Структура РезультатОтправки в старом формате
//  ДопПараметры		 - 	 - 
//
&НаКлиенте
Процедура ЗапуститьМассовуюОтправкуДокументов_Завершение(РезультатОтправки, ДопПараметры = Неопределено) Экспорт
	
	Кэш = ПолучитьТекущийЛокальныйКэш();
	
	МассоваяОперация_Показать(РезультатОтправки, Новый ФиксированнаяСтруктура("Владелец", ГлавноеОкно));

	Если РезультатОтправки.Свойство("ОтправкаИзПересылки") Тогда
		
		Кэш.Вставить("РезультатОтправки", РезультатОтправки);
		ПолучитьФормуОбработки("ФормаПересылкаПакетов").ПослеОтправки(Кэш);
		
	КонецЕсли;
	
	// Результат показали, теперь ощищаем из Кэша
	Кэш.Удалить("РезультатОтправки");
	
КонецПроцедуры

// Процедура - запускает редактор файлов настроек
//
// Параметры:
//  ПараметрыЗапускаВходящие - 	 - 
//
&НаКлиенте
Процедура ЗапуститьРедакторИни(ПараметрыЗапускаВходящие=Неопределено) Экспорт
	
	Кэш = ПолучитьТекущийЛокальныйКэш();
	фрм = Кэш.ФормаНастроекОбщее;
    фрм.ЗакрыватьПриЗакрытииВладельца = Истина;
	фрм.Показать(ПараметрыЗапускаВходящие);

КонецПроцедуры

// Функция - сериализует входящие данные в таблицу значений. Расширять типы.
//
// Параметры:
//  ЗначениеВходящее - Произвольный	 - что сериализуем. Пока поддежан только массив
// 
// Возвращаемое значение:
// ТаблицаЗначений  - результат сериализации
//
&НаСервере
Функция СериализоватьЗначениеВТаблицуЗначений(Знач ЗначениеВходящее) Экспорт
	
	Если ТипЗнч(ЗначениеВходящее) = Тип("Массив") Тогда
		
		Возврат МодульОбъектаСервер().МассивВТаблицуЗначений(ЗначениеВходящее);
		
	КонецЕсли;
	
	Возврат Неопределено
	
КонецФункции

&НаКлиенте
Функция СоздатьОписаниеТипаПоОбъекту(ОбъектТипов) Экспорт

	МассивТипов = Новый Массив;
	Если ТипЗнч(ОбъектТипов) = Тип("Строка") Тогда
		
		СтрокаТиповРазбит	= СтрЗаменить(ОбъектТипов, ",", Символы.ПС);
	
		Попытка
			
			Для НомерСТроки = 1 ПО СтрЧислоСтрок(СтрокаТиповРазбит) Цикл
				
				ТекущийТип = СтрПолучитьСтроку(СтрокаТиповРазбит, НомерСТроки);
				ТекущийТип = СсылочныйТипСтрокой(ТекущийТип);
				МассивТипов.Добавить(Тип(ТекущийТип));
				
			КонецЦикла;
		
			
		Исключение
			
			ОшибкаУстановкиФильтра = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.СоздатьОписаниеТипаПоОбъекту");
			ВызватьИсключение(СбисИсключение_Представление(ОшибкаУстановкиФильтра));
			
		КонецПопытки;
		
	Иначе
		
		МассивТипов.Добавить(ТипЗнч(ОбъектТипов));
		
	КонецЕсли;
		
	ОписаниеТипаНовый = Новый ОписаниеТипов(МассивТипов);
 	Возврат ОписаниеТипаНовый;
	
КонецФункции

//Процедура выполняет выбранное действие с пакетом (документом СБИС)
//ПараметрыДействия:
// СоставПакета			- Структура,	обрабатываемый пакет (документ)
// Этап					- Структура,	активный этап
// Действие				- Структура,	действие, которое требуется выполнить
// Сертификат			- Структура,	сертификат, с которым выполняется действие
// Комментарий(необяз)	- Строка,		коммментарий этапа
//ДопПараметры: пока не требуется
&НаКлиенте
Функция ВыполнитьДействиеСДокументомСБИС(ПараметрыДействия, ДопПараметры = Неопределено) Экспорт 
	Перем ИмяФайла, ПакетВложения, Сертификат, СертификатДляПодписания;
	
	Отказ				= Ложь;
 	ДопПараметрыЗапроса	= Новый Структура("СообщатьПриОшибке, ВернутьОшибку", Ложь, Истина);

	СоставПакета= ПараметрыДействия.СоставПакета;
	Этап		= ПараметрыДействия.Этап;
	Действие	= ПараметрыДействия.Действие;
	
	action = Новый Структура("Название", Действие.Название);
	
	Если ПараметрыДействия.Свойство("Сертификат", Сертификат) Тогда
		
		// Назначение действие на этап
		Если Не Сертификат = Неопределено Тогда
			
			action.Вставить("Сертификат", Сертификат);
			
			Если Не Действие.Свойство("Сертификат") Тогда
				
				Действие.Вставить("Сертификат", Сертификат);
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		// Сертификат должен быть указан даже если его нет
		ПараметрыДействия.Вставить("Сертификат");
		
	КонецЕсли;
	
	Если		ПараметрыДействия.Свойство("Комментарий")
		И Не	ПараметрыДействия.Комментарий = "" Тогда
		
		action.Вставить("Комментарий", ПараметрыДействия.Комментарий);
		
	КонецЕсли;	
		
	// Назначение этапа
	stage		= Новый Структура("Название, Идентификатор, Действие", Этап.Название, Этап.Идентификатор, action);
	document_in	= Новый Структура("Этап, Идентификатор", stage, СоставПакета.Идентификатор);
	
	СоставПакета_Записать(СоставПакета, Новый Структура("Этап", stage));
		
	ПараметрыДействия.Вставить("ДокументПодготовлен",document_in);
	ИмяФункции = ГлавноеОкно.Кэш.ОбщиеФункции.СбисЗаменитьНедопустимыеСимволы("ПодготовитьДействие" + "_" + Действие.Название + "_" +СоставПакета.Тип);
	
	Если  СоставПакета.Свойство("Вложение") Тогда
		фрм = ГлавноеОкно.СбисНайтиФормуФункции(ИмяФункции, 
					"Файл_" + СоставПакета.Тип + "_" + СтрЗаменить(СоставПакета.Вложение[0].ВерсияФормата, ".", "_"), "РаботаСДокументами1С");
	Иначе
		фрм = ГлавноеОкно.СбисНайтиФормуФункции(ИмяФункции, "РаботаСДокументами1С");
	КонецЕсли;
		
	Если не фрм = ложь Тогда
		//фрм.ПодготовитьДействие_Утвердить_ДокОтгрВх(ПараметрыДействия,ГлавноеОкно.Кэш);
		ОбработчикПодготовитьДействие = НовыйСбисОписаниеОповещения(ИмяФункции, фрм);
		ВыполнитьСбисОписаниеОповещения(ПараметрыДействия, ОбработчикПодготовитьДействие);
	КонецЕсли;
	
	// Подготовка этапа
	prepared_document = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.СБИС_ПодготовитьДействие(ГлавноеОкно.Кэш, ПараметрыДействия.ДокументПодготовлен, ДопПараметрыЗапроса, Отказ);
	Если Отказ Тогда
		ВызватьСбисИсключение(prepared_document, "МодульОбъектаКлиент.ВыполнитьОперациюСДокументомСБИС");
	КонецЕсли;
	
	attachmentListPrepared = ?(prepared_document.Этап[0].Свойство("Вложение"),prepared_document.Этап[0].Вложение,Новый Массив);
	
	//UAA формирование титулов
	сбисПараметрыТитулов = Новый Структура("РезультатПодготовки, Шифрование", prepared_document, ПолучитьЗначениеПараметраСбис("Шифрование"));
	РезультатФормирования = ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.СбисСформироватьТитулы(ГлавноеОкно.Кэш, СоставПакета, Действие, СбисПараметрыТитулов, Отказ);
	Если Отказ Тогда
		ВызватьСбисИсключение(РезультатФормирования, "МодульОбъектаКлиент.ВыполнитьОперациюСДокументомСБИС");
	КонецЕсли;

	ДопПараметрыСформировать = Новый Структура("ВложениеДокументВходящие, ВложениеПодготовитьДействие, Шифрование", ПакетВложения, attachmentListPrepared, сбисПараметрыТитулов.Шифрование);
	attachmentList = ВыполнитьДействиеСДокументомСБИС_НаборВложенийДляВыполнитьДействие(ПараметрыДействия, ДопПараметрыСформировать);
	
	Если ЭтоТипСбис(attachmentList, "СбисИсключение") Тогда
		
		ОшибкаВыполнить = НовыйСбисИсключение(attachmentList, "МодульОбъектаКлиент.ВыполнитьДействиеСДокументомСБИС");
		ВызватьИсключение СбисИсключение_ВСтроку(attachmentList);
		
	КонецЕсли;
	
	Если Сертификат <> Неопределено Тогда
		ПараметрыПодписанияВложения = Новый Структура("СертификатДляПодписания, Алгоритм");
		Если ПараметрыДействия.Свойство("СертификатДляПодписания",СертификатДляПодписания) Тогда
			ЗаполнитьЗначенияСвойств(ПараметрыПодписанияВложения, ПараметрыДействия);          
		ИначеЕсли Сертификат.Свойство("Доверенность") Тогда
			ПараметрыПодписанияВложения.СертификатДляПодписания = Сертификат;
		КонецЕсли;
		ПараметрыДействия.Вставить("ПараметрыПодписанияВложения", ПараметрыПодписанияВложения);
		
		Если ПараметрыДействия.Свойство("ПараметрыПодписанияВложения",ПараметрыПодписанияВложения) Тогда
			РезультатПодписания = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.сбисПодписатьВложения(ГлавноеОкно.Кэш, attachmentList, ПараметрыДействия, Отказ);
			Если Отказ Тогда 
				ВызватьСбисИсключение(РезультатПодписания, "ОбщиеФункции.СбисВыполнитьДействие");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	prepared_stage = prepared_document.Этап[0];
	prepared_action = prepared_document.Этап[0].Действие[0];
	prepared_certificates = ?(prepared_action.Свойство("Сертификат"),prepared_action.Сертификат,Неопределено);
	certificates = Новый Массив;
	Если prepared_certificates<>Неопределено Тогда
		КолСерт = prepared_certificates.Количество();
		Для сч=0 По КолСерт-1 Цикл
			certificate = Новый Структура;
			certificate.Вставить( "Отпечаток", prepared_certificates[сч].Отпечаток );
			certificate.Вставить( "Ключ", Новый Структура("Тип", prepared_certificates[сч]["Ключ"]["Тип"]));
			certificates.Добавить( certificate );
		КонецЦикла;
	КонецЕсли;

	// Действие
	action = Новый Структура("Комментарий, Название, Идентификатор", prepared_action.Комментарий, prepared_action.Название, "");
	Если prepared_action.Свойство("Идентификатор") Тогда
		action.Идентификатор = prepared_action.Идентификатор;
	КонецЕсли;
	Если ЗначениеЗаполнено(certificates) Тогда
		action.Вставить("Сертификат", certificates);
	КонецЕсли;
	Если Действие.Свойство("СледующийЭтап") Тогда
		action.Вставить("СледующийЭтап", Действие.СледующийЭтап);   
	КонецЕсли;
	action.Вставить("ТребуетПодписания", prepared_action.ТребуетПодписания);

	// Этап
	stage = Новый Структура("Действие, Вложение, Идентификатор, Название", action, attachmentList, prepared_stage.Идентификатор, prepared_stage.Название);
	Если Этап.Свойство("Исполнитель") Тогда
		stage.Вставить("Исполнитель", Этап.Исполнитель);
	КонецЕсли;
	
	prepared_redact = prepared_document.Редакция;
	redactions = Новый Массив;
	КолРедакций = prepared_redact.Количество();
	Для сч = 0 По КолРедакций - 1 Цикл
		redaction = Новый Структура;
		redaction.Вставить( "Идентификатор", prepared_redact[сч].Идентификатор );
		redactions.Добавить( redaction );
	КонецЦикла;
	
	document_in = Новый Структура("Идентификатор, Редакция, Этап", prepared_document.Идентификатор, redactions, stage);
	// добавляем на случай шифрования
	Если СоставПакета.Свойство("НашаОрганизация") Тогда
		document_in.Вставить( "НашаОрганизация", СоставПакета.НашаОрганизация );
	КонецЕсли;
	Если СоставПакета.Свойство("Контрагент") Тогда
		document_in.Вставить( "Контрагент", СоставПакета.Контрагент);
	КонецЕсли;
	
	// Завершение этапа
	РезультатДействия = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.СБИС_ВыполнитьДействие(ГлавноеОкно.Кэш, document_in, ДопПараметрыЗапроса, Отказ);
	
	Если Отказ Тогда
		ВызватьСбисИсключение(РезультатДействия, "МодульОбъектаКлиент.ВыполнитьОперациюСДокументомСБИС");
	КонецЕсли;
	
	Возврат РезультатДействия;
	
КонецФункции 

&НаКлиенте
Функция ВыполнитьДействиеСДокументомСБИС_НаборВложенийДляВыполнитьДействие(ПараметрыДействия, ДопПараметры)
    Перем ИмяФайла;
	
	ОписаниеТипаБулевоПриведение = Новый ОписаниеТипов("Булево");

	СоставПакета= ПараметрыДействия.СоставПакета;
	Этап		= ПараметрыДействия.Этап;
	Действие	= ПараметрыДействия.Действие;
	Сертификат	= ПараметрыДействия.Сертификат;
	
	attachmentListPrepared	= ДопПараметры.ВложениеПодготовитьДействие;
	ПакетВложения			= ДопПараметры.ВложениеДокументВходящие;
	Шифрование				= ДопПараметры.Шифрование;
	
	Размер					= attachmentListPrepared.Количество();
	
	// если ключ клиентский, то надо передать все вложения в ExecuteAction для подписания
	attachmentList = Новый Массив;  // вложения, которые будем передавать в ВыполнитьДействие
	ТребуетсяПередачаВложений =	ЗначениеЗаполнено(Сертификат)
							И	Сертификат.Ключ.Тип = "Клиентский"
							И	Действие.ТребуетПодписания = "Да";
	
	// ищем подтверждение заказа, чтобы проставить подтверждению, сформированному в 1С, тот же идентификатор
	ИдПодтвЗаказа	= "";
	НомПодтвЗаказа	= 0;
	
	СоответствиеЗамены = Новый Соответствие;
	СоответствиеЗамены.Вставить(" ", "");
	СоответствиеЗамены.Вставить("-", "_");
	СоответствиеЗамены.Вставить(".", "_");

	СтруктураПодготовленныхВложенийПоТипам = Новый Структура;
	Для сч = 0 По Размер - 1 Цикл
		
		Запись = attachmentListPrepared[сч];
		
		ТипВложение = ВложениеСБИС_Получить(Запись, "Тип");
		
		Если ЗначениеЗаполнено(ТипВложение) Тогда
			
			ПолныйТип = ПрименитьФорматКСтроке(ТипВложение + Запись.Подтип + Запись.ВерсияФормата + Запись.ПодверсияФормата,
												СоответствиеЗамены,
												"СтрЗаменить");
					
			СтруктураПодготовленныхВложенийПоТипам.Вставить(ПолныйТип, Новый Структура("Идентификатор, сч", Запись.Идентификатор, сч));	
			
			Если	ТипВложение = "ПодтверждениеЗаказа"
				И	ИдПодтвЗаказа = "" Тогда
				
				ИдПодтвЗаказа	= Запись.Идентификатор;
				НомПодтвЗаказа	= сч;
				
			КонецЕсли;
		
		КонецЕсли;
		
		ВложениеНадоПодписать = 	Не	Запись.Свойство("ТребуемоеДействие")
								Или		Запись.ТребуемоеДействие = "Подписать";	
		
		Если	Не ТребуетсяПередачаВложений 
			Или	Не ВложениеНадоПодписать Тогда
			
			// Если это служебное вложение, которое нет необходимости подписывать
			Продолжить;
			
		КонецЕсли;
		
		attachment = Новый Структура;
		attachment.Вставить("Идентификатор", Запись.Идентификатор);
		file = Новый Структура;
		file.Вставить("Имя", Запись.Файл.Имя);
		file.Вставить("Хеш", Запись.Файл.Хеш);
		file.Вставить( "Ссылка", Запись.Файл.Ссылка );
		Если Запись.Свойство("Зашифрован") И Запись.Зашифрован = "Да" Тогда
			
			//Для зашифрованных вложений передаем ссылку, чтобы в ExecuteAction получить данные, расшифровать и подписать
			attachment.Вставить( "Зашифрован",  "Да");	
			file.Вставить("Ссылка", Запись.Файл.Ссылка);
			
		КонецЕсли;
		attachment.Вставить("Файл", file);
		attachmentList.Добавить(attachment);
		
	КонецЦикла;	
	
	Если Не СоставПакета.Свойство("Вложение", ПакетВложения) Тогда
		
		Возврат attachmentList;
		
	КонецЕсли;
		
	Для Каждого Вложение Из ПакетВложения Цикл
		
		Если Вложение.Свойство("Идентификатор")
			И ЗначениеЗаполнено(Вложение.Идентификатор) Тогда
			//Если есть ИД, то вложение уже готово
			Продолжить;
		КонецЕсли;
		
		Если Не Вложение.Свойство("ИмяФайла", ИмяФайла) Тогда
			//Генерируем имя файла, если не указано
			ИмяФайла = Вложение.СтруктураФайла.Файл.Имя + "__" + Формат(ТекущаяДата(), "ДФ=yyyyMMdd") + "_" + Строка(Новый УникальныйИдентификатор()) + ".xml";
		КонецЕсли;
		
		ОшибкаСериализации = Ложь;
		ДвоичныеДанныеXMLДокумента = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.СБИС_СериализоватьСтрокуВBase64(ГлавноеОкно.Кэш, Новый Структура("Строка", Вложение.XMLДокумента), Новый Структура, ОшибкаСериализации);
		Если ОшибкаСериализации Тогда
			
			Возврат НовыйСбисИсключение(ДвоичныеДанныеXMLДокумента, "МодульОбъектаКлиент.ВыполнитьДействиеСДокументомСБИС.НаборВложенийДляВыполнитьДействие");
			
		КонецЕсли;
			
		file		= Новый Структура("Имя, ДвоичныеДанные", ИмяФайла, ДвоичныеДанныеXMLДокумента);
		attachment	= Новый Структура("Файл", file);
		Если Вложение.Название = "Подтверждение заказа" И ЗначениеЗаполнено(ИдПодтвЗаказа) Тогда 
			ИдВложения = ИдПодтвЗаказа; 
			Если ТребуетсяПередачаВложений Тогда  // если ключ клиентский, значит подтверждение, сформированное онлайном, нужно удалить из списка вложений и добавить наше подтверждение
				attachmentList.Удалить(НомПодтвЗаказа);
			КонецЕсли;
		Иначе 
			Попытка
				// Проверяем нет ли такого же вложения, сформированного онлайном и если есть, то берем его идентификатор, чтобы заменить своим вложением
				ПолныйТип =  СтрЗаменить(СтрЗаменить(Вложение.Тип + Вложение.Подтип+Вложение.ВерсияФормата + ?(Вложение.Свойство("ПодверсияФормата"),Вложение.ПодверсияФормата, ""), " ", ""), ".", "_");
				Если СтруктураПодготовленныхВложенийПоТипам.Свойство(ПолныйТип) Тогда
					ИдВложения = СтруктураПодготовленныхВложенийПоТипам[ПолныйТип].Идентификатор; 
					Если ТребуетсяПередачаВложений Тогда  // если ключ клиентский, значит подтверждение, сформированное онлайном, нужно удалить из списка вложений и добавить наше подтверждение
						attachmentList.Удалить(СтруктураПодготовленныхВложенийПоТипам[ПолныйТип].сч);
					КонецЕсли;
				Иначе
					ИдВложения = строка(Новый УникальныйИдентификатор());
				КонецЕсли;
			Исключение
				ИдВложения = строка(Новый УникальныйИдентификатор());
			КонецПопытки;
		КонецЕсли;
		attachment.Вставить( "Идентификатор",  ИдВложения);
		Если Шифрование Тогда      // если входящие документы зашифрованы, то и ответ шифруем
			attachment.Вставить( "ТребуетШифрования",  "Да");
			Если Вложение.Свойство("Тип") и ЗначениеЗаполнено(Вложение.Тип) и ЗначениеЗаполнено(Вложение.ВерсияФормата) Тогда
				attachment.Вставить( "Тип",  Вложение.Тип);
				attachment.Вставить( "Подтип",  Вложение.ПодТип);
				attachment.Вставить( "ВерсияФормата",  Вложение.ВерсияФормата);
			КонецЕсли;
			Если Вложение.Свойство("Дата") и ЗначениеЗаполнено(Вложение.Дата) Тогда
				attachment.Вставить( "Дата",  Вложение.Дата);
			КонецЕсли;
			Если Вложение.Свойство("Название") и ЗначениеЗаполнено(Вложение.Название) Тогда
				attachment.Вставить( "Название",  Вложение.Название);
			КонецЕсли;
		КонецЕсли;
		
		attachment.Вставить( "Служебный",  ?(Вложение.Свойство("Служебный"),Вложение.Служебный,"Нет"));
		attachmentList.Добавить( attachment );
	КонецЦикла;
	
	Возврат attachmentList;
	
КонецФункции

// Функция - формирует параметры для метода СБИС.ПрочитатьДокумент
// 
// Возвращаемое значение:
//  Структура - 
//
&НаКлиенте
Функция ПрочитатьДокументСБИС_Параметры(ИдДок, ДопПараметры = Неопределено) Экспорт
	
	ПараметрыЧтения = Новый Структура("Идентификатор, ДопПоля", Строка(ИдДок), "ЭтапВернутьВсеСертификаты,Лицо2,Лицо3");	
	
	Если ДопПараметры = Неопределено Тогда
		
		Возврат ПараметрыЧтения;
		
	КонецЕсли;
	
	Если	Не ДопПараметры.Свойство("ПерегенерироватьВложения")
		Или Не ДопПараметры.ПерегенерироватьВложения Тогда
		
		ПараметрыЧтения.ДопПоля = ПараметрыЧтения.ДопПоля + ",НеПерегенерироватьВложения";
		
	КонецЕсли;
	
	Если ДопПараметры.Свойство("Этап") Тогда
		
		ПараметрыЧтения.Вставить("Этап", ДопПараметры.Этап);
		
	КонецЕсли;
		
	ДопПараметры.Вставить("ЕстьРезультат", Истина);

	Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ПоддержкаОбменаЕИС")
		И ДопПараметры.Свойство("РеализацияЕИС")
		И ДопПараметры.РеализацияЕИС Тогда
		
		ПараметрыЧтения.ДопПоля = ПараметрыЧтения.ДопПоля + ",Расширение,ЕИС";
		ДопПараметры.Удалить("РеализацияЕИС");
		
	КонецЕсли;
	
	Возврат ПараметрыЧтения;
	
КонецФункции

//Процедура выполняет выбранное действие с пакетом (документом СБИС)
//ПараметрыДействия:
// СоставПакета			- Структура,	обрабатываемый пакет (документ)
// Этап					- Структура,	активный этап
// Действие				- Структура,	действие, которое требуется выполнить
// Сертификат			- Структура,	сертификат, с которым выполняется действие
// Комментарий(необяз)	- Строка,		коммментарий этапа
//ДопПараметры: пока не требуется
&НаКлиенте
Процедура НачатьФормироватьРасхождениеСДокументомСБИС(СписокДляРасхождения, ДопПараметры) Экспорт 
	
	ОбработчикПродолжить = НовыйСбисОписаниеОповещения("СформироватьРасхождениеСДокументомСБИС", МодульОбъектаКлиент(), ДопПараметры);
	Если Не ЗначениеЗаполнено(СписокДляРасхождения) Тогда
		
		Возврат;
		
	ИначеЕсли СписокДляРасхождения.Количество() = 1 Тогда
		
		ВыполнитьСбисОписаниеОповещения(СписокДляРасхождения[0], ОбработчикПродолжить);
		
	Иначе
		
		СбисВыбратьИзСписка(СписокДляРасхождения, Новый Структура("Обработчик, Заголовок", ОбработчикПродолжить, "Выберите документ расхождения"));
		
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура СформироватьРасхождениеСДокументомСБИС(ПараметрыВходящие, ДопПараметры) Экспорт 
	Перем ВложениеРасхождение, ИниВычиткиРасхождения, ОшибкаФормирования, МФайлОтклонение;
	
	Если		ПараметрыВходящие = Неопределено Тогда
		
		Возврат;
		
	ИначеЕсли	ТипЗнч(ПараметрыВходящие) = Тип("ЭлементСпискаЗначений") Тогда
		
		ПараметрыРасхождения = ПараметрыВходящие.Значение;
		
	Иначе
		
		ПараметрыРасхождения = ПараметрыВходящие;
		Вложение = ПараметрыРасхождения.Вложение;
		
	КонецЕсли;   
	МодульФункцийДок	= ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов;
	ДокументОтклонения	= ПараметрыРасхождения.ИмяОтклонения;
	ИмяИниДокумента		= ПараметрыРасхождения.ИмяИниДокумента;
	ИниДокумента		= ИниПоПараметрам(ИмяИниДокумента);
	
	Если Не ПараметрыРасхождения.Свойство("МФайлОтклонение", МФайлОтклонение) Тогда
		
		МФайлОтклонение = СтрЗаменить(ДокументОтклонения, "_", Символы.ПС);
		МФайлОтклонение = СтрПолучитьСтроку(МФайлОтклонение, 1);
		
	КонецЕсли;
	
	//Грязный ини
	МассивФормПоиска	= Новый Массив;
	МассивФормПоиска.Добавить("Файл_" + ДокументОтклонения);
	МассивФормПоиска.Добавить("Файл_Шаблон");
	
	МодульКонтекст_Расхождение = НайтиФункциюСеансаОбработки("ПолучитьКонтекст_Расхождение", МассивФормПоиска);
	
	Если	ИниДокумента.Свойство("мФайл", ИниВычиткиРасхождения)
		И	ИниВычиткиРасхождения.Свойство(МФайлОтклонение, ИниВычиткиРасхождения) Тогда
		
		//Если есть совпадение с мФайл по отклонению, то берем только этот мФайл.
		ЗначениеИни = Новый Структура("мФайл", Новый Структура(МФайлОтклонение, ИниВычиткиРасхождения));
		
	Иначе
		
		//Считается вся ини для вычитки документа. Медленно и не рекомендуется
		ЗначениеИни = ИниДокумента;
		
	КонецЕсли;
	
	ОписаниеРасхождения = Новый Структура("СоставПакета, Документ1С, ЗначениеИни", ДопПараметры.СоставПакета, ПараметрыРасхождения.Документ1С, ЗначениеИни); 
	КонтекстРасхождение	= МодульКонтекст_Расхождение.ПолучитьКонтекст_Расхождение(ОписаниеРасхождения, Новый Структура("Кэш", ГлавноеОкно.Кэш));
	
	Если Не КонтекстРасхождение.ДокументДанные.Свойство("мФайл") Тогда
		
		ИсключениеОшибки = НовыйСбисИсключение(726, "МодульОбъектаКлиент.СформироватьРасхождениеСДокументомСБИС",,, "Документ по настройке " + ИмяИниДокумента + ".мФайл." + МФайлОтклонение + " не рассчитан!");
		ВыполнитьСбисОписаниеОповещения(ИсключениеОшибки, ДопПараметры.ОбработчикРезультата);
		Возврат;
		
	КонецЕсли;
	
	ДопПараметры.Вставить("КонтекстРасхождение",	КонтекстРасхождение);
	ДопПараметры.Вставить("мФайлОтклонение",		мФайлОтклонение);
	ДопПараметры.Вставить("ФормыПоиска",			МассивФормПоиска);
	
	КонтекстРасхождение		= ДопПараметры.КонтекстРасхождение;
	мФайлОтклонение			= ДопПараметры.мФайлОтклонение;
	МассивФормПоиска		= ДопПараметры.ФормыПоиска;
	ОбработчикРезультата	= ДопПараметры.ОбработчикРезультата;
	ИмяИниДокумента			= ПараметрыРасхождения.ИмяИниДокумента;
	
	Если ПараметрыРасхождения.Свойство("ДокументДанные") Тогда
		КонтекстРасхождение.Вставить("ДокументДанные", ПараметрыРасхождения.ДокументДанные);
	КонецЕсли;
	
	//ПрочитатьДокумент
	МассивФормПоискаПрочитать	= Новый Массив;
	МассивФормПоискаПрочитать.Добавить("Документ_" + ИмяИниДокумента);
	МассивФормПоискаПрочитать.Добавить("Документ_Шаблон");

	МодульКонтекст_Расхождение = НайтиФункциюСеансаОбработки("ПрочитатьДокумент", МассивФормПоискаПрочитать);
	
	ИдентификаторДокумента = СоставПакета_Получить(ДопПараметры.СоставПакета, "ИдентификаторСБИС");
	Если ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
		КонтекстРасхождение.Вставить("ИдОснования", ИдентификаторДокумента);
		КонтекстРасхождение.Вставить("НеИскатьПоДокументу", Ложь);
	КонецЕсли;
	
	КонтекстРасхождение.Вставить("ПустаяТаблицаДоступна", Истина);
	
	Если	Не МодульКонтекст_Расхождение.ПрочитатьДокумент(ГлавноеОкно.Кэш, КонтекстРасхождение)
		Или	Не КонтекстРасхождение.СоставПакета.Вложение.Количество() Тогда
		
		Если КонтекстРасхождение.СоставПакета.Свойство("Ошибка") Тогда
			ИсключениеРасхождения = НовыйСбисИсключение(КонтекстРасхождение.СоставПакета.Ошибка, "МодульОбъектаКлиент.СформироватьРасхождениеСДокументомСБИС");
		Иначе	
			ИсключениеРасхождения = НовыйСбисИсключение(726, "МодульОбъектаКлиент.СформироватьРасхождениеСДокументомСБИС",,, "Документ по настройке " + ИмяИниДокумента + ".мФайл." + МФайлОтклонение + " не сформирован!");
		КонецЕсли;
		ВыполнитьСбисОписаниеОповещения(ИсключениеРасхождения, ДопПараметры.ОбработчикРезультата);
		Возврат;
		
	КонецЕсли;
	
	ВложениеПоДанным1С		= КонтекстРасхождение.СоставПакета.Вложение[0];
	ВложениеСБИС			= ПараметрыРасхождения.Вложение;
	ИспользоватьОбратноеСопоставление = ВложениеПоДанным1С.Параметры.ИспользоватьСопоставлениеНоменклатуры
									И	ЗначениеЗаполнено(ИдентификаторДокумента)
									И	(ВложениеПоДанным1С.Свойство("НоменклатураСопоставлена") И НЕ ВложениеПоДанным1С.НоменклатураСопоставлена
											ИЛИ ВложениеПоДанным1С.Параметры.Свойство("НоменклатураСопоставлена") И НЕ ВложениеПоДанным1С.Параметры.НоменклатураСопоставлена);
	
	Если ИспользоватьОбратноеСопоставление Тогда
		 // Получить классы с вложения
		 // Вызвать форму обратного сопоставления
		ФормаОбратногоСопоставления = ПолучитьФормуОбработки("ФормаОбратногоСопоставления");
		ЗаголовокФормы = "Сопоставление номенклатуры по документу " + Строка(ПараметрыРасхождения.Документ1С);
		
		ПараметрыСопоставления = Новый Структура();
		ПараметрыСопоставления.Вставить("ДокументДанные",			КонтекстРасхождение.ДокументДанные);
		ПараметрыСопоставления.Вставить("Контрагент",				КонтекстРасхождение.Контрагент);
		ПараметрыСопоставления.Вставить("ЗаголовокФормы",			ЗаголовокФормы);
		ПараметрыСопоставления.Вставить("ИдентификаторДокумента",	ИдентификаторДокумента);
		ПараметрыСопоставления.Вставить("ПараметрыРасхождения",		ПараметрыРасхождения);
		ПараметрыСопоставления.Вставить("Вложение1С",				ВложениеПоДанным1С);
		ПараметрыСопоставления.Вставить("ВложениеСБИС",				ПараметрыРасхождения.Вложение);
		
		ОбработчикПосле = НовыйСбисОписаниеОповещения("СформироватьРасхождениеСДокументомСБИС_ПослеСопоставления", МодульОбъектаКлиент(), ДопПараметры);
		ФормаОбратногоСопоставления.ОписаниеОповещенияОЗакрытии = ОбработчикПосле;
		ФормаОбратногоСопоставления.Показать(ПараметрыСопоставления);
		
		Возврат;

	КонецЕсли;
	
	Если Не КонтекстРасхождение.ДокументДанные.Свойство("мФайл") Тогда
		
		ИсключениеОшибки = НовыйСбисИсключение(726, "МодульОбъектаКлиент.СформироватьРасхождениеСДокументомСБИС",,, "Документ по настройке " + ИмяИниДокумента + ".мФайл." + МФайлОтклонение + " не рассчитан!");
		ВыполнитьСбисОписаниеОповещения(ИсключениеОшибки, ДопПараметры.ОбработчикРезультата);
		Возврат;

	КонецЕсли;

	ПараметрыНоменклатуры = ВложениеСБИС_Получить(ВложениеСБИС, "ПараметрыНоменклатуры");
	
	Если НЕ ПараметрыНоменклатуры.Сопоставлено
		И ПараметрыНоменклатуры.НадоСопоставлять Тогда
		
		МодульФункцийДок.ЗаполнитьДанныеДляЗагрузкиПоУмолчанию_ТаблДок(ВложениеСБИС, ДопПараметры);
	
	КонецЕсли;

	ДопПараметры.Вставить("КонтекстРасхождение",	КонтекстРасхождение);
	ДопПараметры.Вставить("мФайлОтклонение",		мФайлОтклонение);
	ДопПараметры.Вставить("ФормыПоиска",			МассивФормПоиска);
	
	ОбработчикПосле = НовыйСбисОписаниеОповещения("СформироватьРасхождениеСДокументомСБИС_ПослеСопоставления", МодульОбъектаКлиент(), ДопПараметры);
	
	ВыполнитьСбисОписаниеОповещения(ПараметрыРасхождения, ОбработчикПосле);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьРасхождениеСДокументомСБИС_ПослеСопоставления(ПараметрыРасхождения, ДопПараметры) Экспорт
	
	// Все закоментированное вынести на уровень выше
	
	Если ПараметрыРасхождения = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	КонтекстРасхождение		= ДопПараметры.КонтекстРасхождение;
	мФайлОтклонение			= ДопПараметры.мФайлОтклонение;
	МассивФормПоиска		= ДопПараметры.ФормыПоиска;
	//ОбработчикРезультата	= ДопПараметры.ОбработчикРезультата;
	//ИмяИниДокумента			= ПараметрыРасхождения.ИмяИниДокумента;
	//
	//Если ПараметрыРасхождения.Свойство("ДокументДанные") Тогда
	//	КонтекстРасхождение.Вставить("ДокументДанные", ПараметрыРасхождения.ДокументДанные);
	//КонецЕсли;
	//
	////ПрочитатьДокумент
	//МассивФормПоискаПрочитать	= Новый Массив;
	//МассивФормПоискаПрочитать.Добавить("Документ_" + ИмяИниДокумента);
	//МассивФормПоискаПрочитать.Добавить("Документ_Шаблон");

	//МодульКонтекст_Расхождение = НайтиФункциюСеансаОбработки("ПрочитатьДокумент", МассивФормПоискаПрочитать);
	//Если	Не МодульКонтекст_Расхождение.ПрочитатьДокумент(ГлавноеОкно.Кэш, КонтекстРасхождение)
	//	Или	Не КонтекстРасхождение.СоставПакета.Вложение.Количество() Тогда
	//	
	//	Если КонтекстРасхождение.СоставПакета.Свойство("Ошибка") Тогда
	//		ИсключениеРасхождения = НовыйСбисИсключение(КонтекстРасхождение.СоставПакета.Ошибка, "МодульОбъектаКлиент.СформироватьРасхождениеСДокументомСБИС");
	//	Иначе	
	//		ИсключениеРасхождения = НовыйСбисИсключение(726, "МодульОбъектаКлиент.СформироватьРасхождениеСДокументомСБИС",,, "Документ по настройке " + ИмяИниДокумента + ".мФайл." + МФайлОтклонение + " не сформирован!");
	//	КонецЕсли;
	//	ВыполнитьСбисОписаниеОповещения(ИсключениеРасхождения, ДопПараметры.ОбработчикРезультата);
	//	Возврат;
	//	
	//КонецЕсли;
	
	//Если Вложение.Свойство("НоменклатураСопоставлена") И НЕ Вложение.НоменклатураСопоставлена Тогда
	//	 Получить классы с вложения
	//	 Вызвать форму обратного сопоставления                                             
	//КонецЕсли	
	
	// Аргументами вызова формы обратного расхождения нужно передавать Вложение основным аргументом
	
	ВложениеРасхождения	= КонтекстРасхождение.СоставПакета.Вложение[0];
	
	МодульСформироватьРасхождение	= НайтиФункциюСеансаОбработки("СформироватьРасхождение", МассивФормПоиска);
	РасхождениеСформировано			= Ложь;
	
	Попытка
		
		СтруктураФайлаНаша				= ВложениеСБИС_Получить(ВложениеРасхождения, "СтруктураДокумента");
		
		ПараметрыСформироватьасхождение	= Новый Структура(
		"СтруктураФайлаКонтрагента,				ВложениеНаше, Пакет", 
		ПараметрыРасхождения.СтруктураФайла,	КонтекстРасхождение.СоставПакета.Вложение[0],  КонтекстРасхождение.СоставПакета);
		ВложениеРасхождение		= МодульСформироватьРасхождение.СформироватьРасхождение(ПараметрыСформироватьасхождение, ГлавноеОкно.Кэш);
		РасхождениеСформировано = Истина;
		
	Исключение
		// ветка для тех, у кого вынесено формирование расхождения во внешние функции
		
		ОшибкаФормирования = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.СформироватьРасхождениеНажатие");
		
	КонецПопытки;
	
	Если Не РасхождениеСформировано Тогда
		
		Попытка
			
			ВложениеРасхождение = МодульСформироватьРасхождение.СформироватьРасхождение(ПараметрыРасхождения.СтруктураФайла, СтруктураФайлаНаша, ГлавноеОкно.Кэш);
			ОшибкаФормирования	= Неопределено;
			
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Если Не Найти(ИнформацияОбОшибке.Описание, "Слишком много фактических параметров") Тогда
				//Вызов был, перегенерируем ошибку, если свалилось
				ОшибкаФормирования = НовыйСбисИсключение(ИнформацияОбОшибке, "МодульОбъектаКлиент.СформироватьРасхождениеНажатие");
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЕсли;
	
	Если Не ОшибкаФормирования = Неопределено Тогда
		
		ВыполнитьСбисОписаниеОповещения(ОшибкаФормирования, ДопПараметры.ОбработчикРезультата);
		Возврат;

	КонецЕсли;

	ВыполнитьСбисОписаниеОповещения(ВложениеРасхождение, ДопПараметры.ОбработчикРезультата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПропатчитьВложенияНовымСопоставлением (ПакетыКОтправке, МестныйКэш) Экспорт		
	
	Для Каждого СоставПакета Из ПакетыКОтправке Цикл 
		
		КонтрагентДляСопоставления = СоставПакета_СтруктураКонтрагентаДляОтправки(СоставПакета);
		
		Для Каждого Вложение Из СоставПакета.Вложение Цикл							
			
			Если Вложение.Свойство("КлассыСопоставленияНоменклатур") 
				И Вложение.НоменклатураСопоставлена Тогда
				ОбогащенныеДанныеНоменклатурыДляСопоставления = Вложение.КлассыСопоставленияНоменклатур;
			Иначе
				// 1. Получим ТаблДоки в исходном виде из вложений и сформируем от них набор классов сопоставления номенклатуры. По возможности попытаемся их обогатить через "Массовый поиск"
				////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
				ФормыПоиска = Новый Массив;
				ФормыПоиска.Добавить("Файл_Шаблон");
				
				фрм = НайтиФункциюСеансаОбработки("СформироватьНаборСопоставленийНоменклатурыПоТабличнойЧасти", ФормыПоиска);
				
				ВложениеСБИС_Заполнить(Вложение, КонтрагентДляСопоставления, "КонтрагентДляСопоставления"); 
				Если НЕ фрм = Ложь Тогда  
					НаборСопоставлений = фрм.СформироватьНаборСопоставленийНоменклатурыПоТабличнойЧасти(Вложение, МестныйКэш);
				Иначе
					ВызватьСбисИсключение(, "МодульОбъектаКлиент.ПропатчитьВложенияНовымСопоставлением",,,"Не найдена форма работы с форматом документа");
				КонецЕсли;
				
				ПараметрыДляОбогащения = Новый Структура("Контрагент, Номенклатура, ПоискПо1С");
				
				Если Вложение.Свойство("ГоловнойКонтрагент") Тогда
					ИсточникЗапросаСопоставления = Вложение.ГоловнаяОрганизация;
				Иначе
					ИсточникЗапросаСопоставления = Вложение.Отправитель;
				КонецЕсли;                                                            
				
				ПараметрыДляОбогащения.Вставить("Контрагент",	ИсточникЗапросаСопоставления);
				ПараметрыДляОбогащения.Вставить("Номенклатура",	НаборСопоставлений);
				ПараметрыДляОбогащения.Вставить("ПоискПо1С",	Истина);
				
				СпособСопоставления = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("СпособСопоставленияНоменклатуры"); 
				Если СпособСопоставления = 1 Тогда
					ИмяФормыРаботыСНоменклатурой = "СопоставлениеНоменклатуры_ДБФ"; 
				Иначе
					ИмяФормыРаботыСНоменклатурой = "СопоставлениеНоменклатуры_СБИС";
				КонецЕсли;
				
				ФормаРаботыСНоменклатурой = ГлавноеОкно.сбисНайтиФормуФункции("НоменклатураПоставщика_МассовыйПоиск", ИмяФормыРаботыСНоменклатурой,"", МестныйКэш);
				
				ДопПараметры = Новый Структура("Кэш", МестныйКэш);
				Попытка
					ОбогащенныеДанныеНоменклатурыДляСопоставления =	ФормаРаботыСНоменклатурой.НоменклатураПоставщика_МассовыйПоиск(ПараметрыДляОбогащения, ДопПараметры); 
				Исключение          
					ОбогащенныеДанныеНоменклатурыДляСопоставления = НаборСопоставлений;
					МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ФормаРаботыСНоменклатурой.НоменклатураПоставщика_МассовыйПоиск");
				КонецПопытки;
				
				Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("РежимОтладки") Тогда
					
					ДанныеЛогирования = Новый Структура;
					ДанныеЛогирования.Вставить("Тип", 			"СопоставлениеНоменклатуры");
					ДанныеЛогирования.Вставить("Идентификатор", МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "Название"));
					ДанныеЛогирования.Вставить("Вызов", 		ОбогащенныеДанныеНоменклатурыДляСопоставления);
					ДанныеЛогирования.Вставить("Модуль", 		"Файл_Шаблон");
					
					МодульОбъектаКлиент().СохранитьОтладочныеДанныеСБИС(ДанныеЛогирования);
					
				КонецЕсли;
				
			КонецЕсли;   
			
			// 2. В полученных классах произведем пересчет по коэффициенту единиц измерения
			////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
			МестныйКэш.ОбщиеФункции.ПересчетПоКоэффициентамЕдиницИзмерения(ОбогащенныеДанныеНоменклатурыДляСопоставления);
			МестныйКэш.ОбщиеФункции.ПересчетНДСПоДаннымСтрокиСопоставления(ОбогащенныеДанныеНоменклатурыДляСопоставления);
			Вложение.Вставить("КлассыСопоставленияНоменклатур", ОбогащенныеДанныеНоменклатурыДляСопоставления); 
			НоменклатураСопоставлена = СопоставлениеНоменклатуры_ВсеНоменклатурыСопоставлены(НаборСопоставлений);
			Вложение.Вставить("НоменклатураСопоставлена", НоменклатураСопоставлена);
			
			// 3. Обновленные данные выгрузим в ТаблДок и запишем его на вложение. ПутьТаблДок тоже подменим
			////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
			ТаблДокНаОсновеКлассов = ВложениеСБИС_Выгрузить(Вложение, "ТабличнаяЧасть");
			Вложение.СтруктураФайла.Файл.Документ.ТаблДок.Вставить("СтрТабл", ТаблДокНаОсновеКлассов);
			
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры 

&НаКлиенте
Функция СформироватьСписокДляВызоваРасхождений(СтрокиОтмеченные, ДопПараметры) Экспорт
	Перем Документ1ССсылка, УзелДокументОтклонения, ИмяДокумента;
	
	ИниКонфигурации		= ИниПоПараметрам("Конфигурация");
	МодульФункцийДок	= ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов;	//Для рассчитать значение от ини выгрузки
	МодульШаблонДок		= ПолучитьФормуОбработки("Документ_Шаблон");			//Для рассчитать значени от ини загрузки
	РезультатСписок		= Новый СписокЗначений;
	СоставПакета		= ДопПараметры.СоставПакета;
	
	Для Каждого СтрокаТаблДок Из СтрокиОтмеченные Цикл
		
		Если Не СтрокаТаблДок.Документы1С.Количество() Тогда
			Продолжить;
		КонецЕсли;
		ВложениеСБИС		= СтрокаТаблДок.Вложение[0].Значение;
		Документ1ССсылка	= СтрокаТаблДок.Документы1С[0].Значение;
		
		СтруктураФайлаКонтрагента	= ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
		СтруктураИниВложения		= ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураИниФайла");

		Если	СтруктураИниВложения		= Неопределено
			Или	СтруктураФайлаКонтрагента	= Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяДокумента	= МодульФункцийДок.ПолучитьРеквизитМетаданныхОбъекта(Документ1ССсылка, "Имя");
		
		Если СтруктураИниВложения.Свойство("ФайлНастроекРасхождения") Тогда
			
			Контекст = Новый Структура("Ини, Документ, Переменные, СтруктураФайла, СоставПакета, ИниКонфигурация");
			Контекст.Ини			= СтруктураИниВложения;
			Контекст.Документ		= Документ1ССсылка;
			Контекст.Переменные		= Новый Структура;
			Контекст.СтруктураФайла	= СтруктураФайлаКонтрагента;
			Контекст.СоставПакета	= СоставПакета;
			Контекст.ИниКонфигурация= ИниКонфигурации;
			
			ИмяИниДокумента = МодульШаблонДок.РассчитатьЗначение("ФайлНастроекРасхождения", Контекст);
			Если Не ИмяИниДокумента = Неопределено Тогда
				
				ИмяДокумента = ИмяИниДокумента;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ИниДокумента = ИниПоПараметрам(ИмяДокумента);
		
		Если ИниДокумента = Неопределено Тогда
			
			//Нет файла настроек
			Продолжить;
			
		КонецЕсли;
		
		УзелДокументОтклонения = МодульФункцийДок.РассчитатьЗначение("ДокументОтклонения", ИниДокумента);
		
		Если Не ЗначениеЗаполнено(УзелДокументОтклонения) Тогда
			
			//Не указан файл настройки отклонения
			Продолжить;
			
		КонецЕсли;
		
		МассивОтклонений = СтрЗаменить(УзелДокументОтклонения, ",", Символы.ПС);
		
		Для НомерОтклонения = 1 По СтрЧислоСтрок(МассивОтклонений) Цикл
			
			ДокументОтклонения = СтрПолучитьСтроку(МассивОтклонений, НомерОтклонения);
			Если		Лев(ДокументОтклонения, 19) = "ПодтверждениеЗаказа" Тогда
				
				//Костыль для подтверждения заказа - формируется без прямого указания ини отклонения
				
			Иначе
				
				Если	НРег(ДокументОтклонения) = "актрасхождение" Тогда
				
					//Костыль для акта расхождения - нельзя указывать ини с версией.
					ДокументОтклонения	= "АктРасхождение_3_03";
					
				КонецЕсли;
				
				ИниОтклонения = ИниПоПараметрам(ДокументОтклонения);
				
				Если ИниОтклонения = Неопределено Тогда  
					
					ДокументОтклоненияСервер = "Загрузка_Входящий_" + ДокументОтклонения; 
					ИниОтклонения = ИниПоПараметрам(ДокументОтклоненияСервер); 
										
				КонецЕсли; 
				
				Если ИниОтклонения = Неопределено Тогда 
					
					Продолжить;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ПараметрыСписок = Новый Структура("Документ1С, Вложение, СтруктураФайла, ИмяИниДокумента, ИмяОтклонения");
			ПараметрыСписок.Документ1С		= Документ1ССсылка;
			ПараметрыСписок.Вложение		= ВложениеСБИС;
			ПараметрыСписок.СтруктураФайла	= СтруктураФайлаКонтрагента;
			ПараметрыСписок.ИмяИниДокумента	= ИмяДокумента;
			ПараметрыСписок.ИмяОтклонения	= ДокументОтклонения;
			
			НазваниеРеестра = МодульФункцийДок.РассчитатьЗначение("Реестр1С_Название", ИниОтклонения);

			Если НазваниеРеестра = Неопределено Тогда
				
				НазваниеРеестра = ДокументОтклонения;
				
			КонецЕсли;
			
			РезультатСписок.Добавить(ПараметрыСписок, НазваниеРеестра);
			
		КонецЦикла;
		
		Прервать;
		
	КонецЦикла;

	Если Документ1ССсылка = Неопределено Тогда	
		// нет сопоставление с вложениями - проверим сопоставление с пакетом
		МодульДокументаПоИд = НайтиФункциюСеансаОбработки("ДокументыПоИдПакета", ПолучитьЗначениеПараметраСбис("ИмяМодуляРаботыСоСтатусами"));
		
		Если МодульДокументаПоИд = Ложь Тогда
			Возврат РезультатСписок;
		КонецЕсли;
		
		СписокДокументы1С = МодульДокументаПоИд.ДокументыПоИдПакета(ДопПараметры.СоставПакета.Идентификатор, ИниКонфигурации);
		
		Если Не списокДокументы1С.Количество() Тогда
			Возврат РезультатСписок;
		КонецЕсли;	
		
		Для  Каждого Документ1С Из СписокДокументы1С Цикл
			ИмяДокумента = МодульФункцийДок.ПолучитьРеквизитМетаданныхОбъекта(Документ1С, "Имя");
			ИниДокумента = ИниПоПараметрам(ИмяДокумента);
			
			Если ИниДокумента = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			УзелДокументОтклонения		= МодульФункцийДок.РассчитатьЗначение("ДокументОтклонения", ИниДокумента);
			Если Не ЗначениеЗаполнено(УзелДокументОтклонения) Тогда
				
				//Не указан файл настройки отклонения
				Продолжить;
				
			КонецЕсли;
			
			МассивОтклонений			= СтрЗаменить(УзелДокументОтклонения, ",", Символы.ПС);
			СтруктураФайлаКонтрагента	= ПолучитьФормуОбработки("Файл_Шаблон").НовыйСтруктураФайла(ДопПараметры.СоставПакета);
			ВложениеСБИС				= НовыйВложениеСБИС();
			
			Для НомерОтклонения = 1 По СтрЧислоСтрок(МассивОтклонений) Цикл
				
				ДокументОтклонения = СтрПолучитьСтроку(МассивОтклонений, НомерОтклонения);
				Если Лев(ДокументОтклонения, 19) = "ПодтверждениеЗаказа" Тогда
					
					//Костыль для подтверждения заказа - формируется без прямого указания ини отклонения
					
				Иначе
					
					ИниОтклонения = ИниПоПараметрам(ДокументОтклонения); 
					
					Если ИниОтклонения = Неопределено Тогда  
						
						ДокументОтклоненияСервер = "Загрузка_Входящий_" + ДокументОтклонения; 
						ИниОтклонения = ИниПоПараметрам(ДокументОтклоненияСервер); 
											
					КонецЕсли; 
					
					Если ИниОтклонения = Неопределено Тогда 
						
						Продолжить;
						
					КонецЕсли;
					
				КонецЕсли;
				
				ПараметрыСписок = Новый Структура("Документ1С, Вложение, СтруктураФайла, ИмяИниДокумента, ИмяОтклонения");
				ПараметрыСписок.Документ1С		= Документ1ССсылка;
				ПараметрыСписок.Вложение		= ВложениеСБИС;
				ПараметрыСписок.СтруктураФайла	= СтруктураФайлаКонтрагента;
				ПараметрыСписок.ИмяИниДокумента	= ИмяДокумента;
				ПараметрыСписок.ИмяОтклонения	= ДокументОтклонения;
				
				НазваниеРеестра = МодульФункцийДок.РассчитатьЗначение("Реестр1С_Название", ИниОтклонения);
				
				Если НазваниеРеестра = Неопределено Тогда
					
					НазваниеРеестра = ДокументОтклонения;
					
				КонецЕсли;
				
				РезультатСписок.Добавить(ПараметрыСписок, НазваниеРеестра);
			КонецЦикла;

		КонецЦикла;
	КонецЕсли;
	
	Если Не РезультатСписок.Количество() Тогда
		Если		Не УзелДокументОтклонения = Неопределено Тогда
			
			СообщениеДетализации = "Для формирования расхождения требуется подключить файл настроек: " + УзелДокументОтклонения;
			ВызватьСбисИсключение(610, "МодульОбъектаКлиент.СформироватьСписокДляВызоваРасхождений",,, СообщениеДетализации);
			
		ИначеЕсли	Не ИмяДокумента = Неопределено Тогда
			
			Если ИниДокумента = Неопределено Тогда
				
				СообщениеДетализации = "Для формирования расхождения требуется подключить файл настроек: " + ИмяДокумента;
				ВызватьСбисИсключение(610, "МодульОбъектаКлиент.СформироватьСписокДляВызоваРасхождений",,, СообщениеДетализации);
				
			Иначе
				
				СообщениеДетализации = "Для формирования расхождения требуется задать опцию ""ДокументОтклонения"" в настройке " + ИмяДокумента + ".";
				ВызватьСбисИсключение(735, "МодульОбъектаКлиент.СформироватьСписокДляВызоваРасхождений",,, СообщениеДетализации);
				
			КонецЕсли;	
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатСписок;
	
КонецФункции

&НаКлиенте
Процедура УдалитьУзелИзСтруктурыДанных(Текущийузел, Путь) Экспорт
	
	ПутьНовый = Новый СписокЗначений;
	ПутьНовый.ЗагрузитьЗначения(Путь.ВыгрузитьЗначения());
	Если ТипЗнч(Текущийузел) = Тип("Массив") Тогда
		
		Для Каждого СтрокаУзла Из Текущийузел Цикл
			
			УдалитьУзелИзСтруктурыДанных(СтрокаУзла, ПутьНовый);
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Текущийузел) = Тип("Структура") Тогда
		
		КлючПути = ПутьНовый[0].Значение;
		Если	ПутьНовый.Количество() = 1
				И ТекущийУзел.Свойство(КлючПути) Тогда
			
			Текущийузел.Удалить(КлючПути); 
			
		Иначе
			
			УзелПродолжить = Неопределено;
			ПутьНовый.Удалить(0);
			Если ТекущийУзел.Свойство(КлючПути, УзелПродолжить) Тогда
				
				УдалитьУзелИзСтруктурыДанных(УзелПродолжить, ПутьНовый);
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает запрашиваемую форму при успехе, вызывает СбисИсключение при неудаче, Ложь, если формы нет.
//
// Параметры:
//  ИмяФормы	 - 	 - 
//  ДопПараметры - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Функция ПолучитьФормуОбработки(СбисИмяФормы, ДопПараметры=Неопределено) Экспорт 
	Перем СбисОбъект1С, СбисПараметрыФормы, СбисВладелецФормы, СбисОписаниеОшибки, ПолноеИмяФормы, КэшироватьПолученную, ПолучитьНовую, Результат;

	Если Не ДопПараметры = Неопределено Тогда
		
		ДопПараметры.Свойство("КэшироватьФорму",	КэшироватьПолученную);
		ДопПараметры.Свойство("ПолучитьНовую",		ПолучитьНовую);
		ДопПараметры.Свойство("Владелец",			СбисВладелецФормы);
		ДопПараметры.Свойство("ОбработкаОбъект",	СбисОбъект1С);
		ДопПараметры.Свойство("Параметры",			СбисПараметрыФормы);
		
	КонецЕсли;

	Стандартная				= СбисОбъект1С = Неопределено;
	ПолноеИмяФормы			= ПолучитьФормуОбработки_ПолноеИмяФормы(СбисИмяФормы, СбисОбъект1С);
	БезопасноеИмяФормы		= ПолучитьФормуОбработки_БезопасноеИмяФормы(ПолноеИмяФормы, СбисОбъект1С);
	ЭтоГлавноеОкно			= СбисИмяФормы = "ФормаГлавноеОкно" И Стандартная;
	ЭтоИнтерфейсныйМодуль	= Истина;
	
	Если ЭтоГлавноеОкно Тогда
		
		//Если ГО установлено, то отдаем его. Иначе требуется получить.
		Если Не ГлавноеОкно = Неопределено Тогда
			
			Возврат ГлавноеОкно;
			
		КонецЕсли;
		
	Иначе
		
		Если	СбисВладелецФормы = Неопределено Тогда
		
			СбисВладелецФормы = ГлавноеОкно;
			
		КонецЕсли;
		
		ЭтоИнтерфейсныйМодуль = Не ГлобальныйКэш.ТекущийСеанс.Формы.Интерфейсные.НайтиПоЗначению(СбисИмяФормы) = Неопределено;
		
	КонецЕсли;

	
	//Взять форму из кэш
	Если Не ГлобальныйКэш = Неопределено Тогда
		
		// Для старых платформ УФ отключить кэширование интерфейсных модулей
		Если		КэшироватьПолученную = Неопределено
			И		ЭтоИнтерфейсныйМодуль
			И	Не	ПолучитьЗначениеПараметраТекущегоСеанса("КэшироватьИнтерфейсныеФормы") Тогда
			
			КэшироватьПолученную	= Ложь;
			ПолучитьНовую			= Истина;
			
		Иначе
			
			Результат = ГлобальныйКэш.ТекущийСеанс.Формы.Получены.Получить(БезопасноеИмяФормы);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если КэшироватьПолученную = Неопределено Тогда
		
		КэшироватьПолученную = Истина;
		
	КонецЕсли;
	
	Если ПолучитьНовую = Неопределено Тогда
		
		ПолучитьНовую = Ложь;
		
	КонецЕсли;	
	
	Если		ПолучитьНовую
		Или		ЭтоГлавноеОкно
		Или		Результат = Неопределено Тогда
		
		ЕстьТакаяФормаВОбработках =		ЭтоГлавноеОкно		
								Или		Стандартная И ГлобальныйКэш.ТекущийСеанс.Формы.Стандартные.НайтиПоЗначению(СбисИмяФормы)	<> Неопределено
								Или	Не	Стандартная И ГлобальныйКэш.ТекущийСеанс.Формы.Клиентские.НайтиПоЗначению(СбисИмяФормы)		<> Неопределено;
								
		Если ЕстьТакаяФормаВОбработках Тогда
			
			//Не должно быть исключения при получении формы, это считаем ошибкой. Отсеиваем несуществующие формы по списку форм.
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				
				Если Стандартная Тогда
					
					СбисОбъект1С = ЭтотОбъект;
					
				КонецЕсли;
				
				Попытка
					
					Если ПолучитьНовую Тогда
						Результат = СбисОбъект1С.ПолучитьФорму(СбисИмяФормы, СбисВладелецФормы, Новый УникальныйИдентификатор());
					Иначе
						Результат = СбисОбъект1С.ПолучитьФорму(СбисИмяФормы, СбисВладелецФормы);
					КонецЕсли;
					
				Исключение
					
					ОшибкаПолучения = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.СбисПолучитьФормуОбработки",767,, "Форма обработки """ + СбисИмяФормы + """ не получена!");
					ВызватьИсключение СбисИсключение_Представление(ОшибкаПолучения);
					
				КонецПопытки;
				
				ПараметрыЗаполнитьНаФорму = Новый ФиксированнаяСтруктура("Параметры, ИмяФормы", СбисПараметрыФормы, СбисИмяФормы);
				ЗаполнитьЗначенияСвойств(Результат, ПараметрыЗаполнитьНаФорму);
				
			#Иначе
				
				Попытка
					
					Если ПолучитьНовую Тогда
						
						Результат = ПолучитьФорму(ПолноеИмяФормы, СбисПараметрыФормы, СбисВладелецФормы, Новый УникальныйИдентификатор());
						
					Иначе
						
						Результат = ПолучитьФорму(ПолноеИмяФормы, СбисПараметрыФормы, СбисВладелецФормы);
						
					КонецЕсли;
					
					Если Результат = Неопределено Тогда
						
						ОшибкаПолучения = НовыйСбисИсключение(773, "МодульОбъектаКлиент.СбисПолучитьФормуОбработки",,,"Неизвестная ошибка события формы " + ПолноеИмяФормы + " ПриСозданииНаСервере.");
						ВызватьИсключение СбисИсключение_Представление(ОшибкаПолучения);
						
					КонецЕсли;
					
				Исключение
					
					ОшибкаПолучения = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.СбисПолучитьФормуОбработки",767,, "Форма обработки """ + СбисИмяФормы + """ не получена!");
					ВызватьИсключение СбисИсключение_Представление(ОшибкаПолучения);
					
				КонецПопытки;
			#КонецЕсли
			
			// Установка связи кэша для модулей интерфейса
			Если ЭтоИнтерфейсныйМодуль Тогда
				
				Попытка
					
					Результат.Кэш = ПолучитьТекущийЛокальныйКэш();
					
				Исключение
					
					// Игнорировать исключение, кэша нет
					
				КонецПопытки;
				
			КонецЕсли;
			
		Иначе
			
			//Нет такой формы
			Результат = Ложь;
			
		КонецЕсли;
		
	ИначеЕсли Не Результат = Ложь Тогда
		
		Результат.ВладелецФормы = СбисВладелецФормы;
		
	Иначе
		
		//Совместимость со старыми проверками
		Результат = Ложь;
		
	КонецЕсли;
	
	Если		ЭтоГлавноеОкно Тогда
		
		ОбновитьПараметрГлобальногоМодуля("ГлавноеОкно", Результат);
		
	ИначеЕсли	КэшироватьПолученную Тогда
		
		ПолучитьФормуОбработки_ЗакэшироватьФорму(Результат, БезопасноеИмяФормы);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьМакетОбработки(ИмяМакета, ДопПараметры) Экспорт 
	
	Возврат МодульОбъектаСервер().ПолучитьМакетОбработкиНаСервере(ИмяМакета, ДопПараметры);
	
КонецФункции

// Функция - Возвращает дату в миллисекундах
//
// Параметры:
//  ДатаЗначение - Дата	 - Дата, которую надо получить в миллисекундах. Если не указано, то текущая.
// 
// Возвращаемое значение:
//  Число - миллисекунды
//
&НаКлиенте
Функция ПолучитьДатуВМиллисекундах(ДатаЗначение = Неопределено) Экспорт 

	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Если ДатаЗначение = Неопределено Тогда
		
			ДатаЗначение = ТекущаяДата();
			
		КонецЕсли;
		
	#Иначе
		
		Если ДатаЗначение = Неопределено Тогда
			
			Возврат ТекущаяУниверсальнаяДатаВМиллисекундах();
			
		КонецЕсли;
				
	#КонецЕсли
	
	Возврат (ДатаЗначение - '0001.01.01') * 1000 - 10800000;
	

КонецФункции
	
&НаКлиенте
Функция ОпределитьКодировкуФайлаXML(Знач ОписаниеФайлаXML, ДопПараметры = Неопределено) Экспорт
	
	ЛокальныйКэш = ПолучитьТекущийЛокальныйКэш();
	
	СтрокаКодировка = ЛокальныйКэш.КэшЗначенийИни.КодировкиЧтенияФайлов.ПоУмолчанию.ДляВсех;
	
	Если ТипЗнч(ОписаниеФайлаXML) = Тип("Строка") Тогда
		СтрокаТекст = ОписаниеФайлаXML;
	Иначе
		Возврат СтрокаКодировка;
	КонецЕсли; 
	
	//Проверим кодировки для принудительного чтения.	
	Для Каждого КодировкаДляЧтения Из ЛокальныйКэш.КэшЗначенийИни.КодировкиЧтенияФайлов.Определять Цикл
		ПозицияКодировки = Найти(СтрокаТекст, "encoding");
		Если ПозицияКодировки И Найти(Сред(НРег(СтрокаТекст), ПозицияКодировки), КодировкаДляЧтения) Тогда
			СтрокаКодировка = КодировкаДляЧтения;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрокаКодировка;
	
КонецФункции

&НаКлиенте
Процедура ПослеОбратногоСопоставления(Результат, ДопПарам) Экспорт 
	
	ВложениеСБИС = Результат;
	ПризнакОбновления = ДопПарам.ПризнакОбновления;                         
	
	ВложениеСБИС_Обновить(ВложениеСБИС, ПризнакОбновления, ДопПарам);
	
	
КонецПроцедуры 

#Область include_core_base_Настройки_ОбновитьНастройки
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_ЭлементыФормы
#КонецОбласти

// Функция возвращает все установленные действия на события элемента формы
// Функция дорабатывается по мере необходимости.
//
// Параметры
//  ЭлементФормы  - *тип элемента формы* - элемент формы обработки 
//
// Возвращаемое значение:
//   Структура   - структура установленных дейсвтий на события элемента формы
//			- Ключ		- имя события
//			- Значение	- действие
//
&НаКлиенте
Функция ПолучитьСтруктуруДействийЭлемента(ЭлементФормы)
	
	СтруктураДействий = Новый Структура();
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если ТипЗнч(ЭлементФормы) = Тип("ПолеВвода") Тогда
			СтруктураДействий.Вставить("ПриИзменении",			ЭлементФормы.ПолучитьДействие("ПриИзменении"));
			СтруктураДействий.Вставить("НачалоВыбора",			ЭлементФормы.ПолучитьДействие("НачалоВыбора"));
			СтруктураДействий.Вставить("НачалоВыбораИзСписка",	ЭлементФормы.ПолучитьДействие("НачалоВыбораИзСписка"));
			СтруктураДействий.Вставить("Очистка",				ЭлементФормы.ПолучитьДействие("Очистка"));
			СтруктураДействий.Вставить("Регулирование",			ЭлементФормы.ПолучитьДействие("Регулирование"));
			СтруктураДействий.Вставить("Открытие",				ЭлементФормы.ПолучитьДействие("Открытие"));
			СтруктураДействий.Вставить("ОбработкаВыбора",		ЭлементФормы.ПолучитьДействие("ОбработкаВыбора"));
			СтруктураДействий.Вставить("АвтоПодборТекста",		ЭлементФормы.ПолучитьДействие("АвтоПодборТекста"));
			СтруктураДействий.Вставить("ОкончаниеВводаТекста",	ЭлементФормы.ПолучитьДействие("ОкончаниеВводаТекста"));
		КонецЕсли;
	#КонецЕсли
	
	Возврат СтруктураДействий;

КонецФункции

// Процедура устанавливает действия элементу формы из структуры
//
// Параметры
//  ЭлементФормы  - *тип элемента формы* - элемент формы обработки
//                 
//  СтруктураДействий  - Структура - структура установленных дейсвтий на события элемента формы
//                	- Ключ		- имя события
//					- Значение	- действие 
//
&НаКлиенте
Процедура УстановитьДействияЭлементу(ЭлементФормы, СтруктураДействий)

	Для каждого Действие Из СтруктураДействий Цикл
		ЭлементФормы.УстановитьДействие(Действие.Ключ, Действие.Значение);
	КонецЦикла; 

КонецПроцедуры
 
// Функция - формирует двоичные данные по имени файла в папке на клиенте
//
// Параметры:
//  ПутьКФайлуКлиент - Строка	 - полный путь к файлу, ДД которого требуется получить
// 
// Возвращаемое значение:
//  ДвоичныеДанные - полученные ДД файла по пути. Вызывает СБИС исключение при ошибке
//
&НаКлиенте
Функция ПолучитьBASE64ПоИмениФайлаКлиент(ПутьКФайлуКлиент) Экспорт
	
	# Если ТолстыйКлиентОбычноеПриложение Тогда
		
		ФайлыПреобразовать = Новый Массив;
		Попытка
			
			ФайлыПреобразовать.Добавить(Новый ДвоичныеДанные(ПутьКФайлуКлиент));
			Возврат ФайлыВBASE64Сервер(ФайлыПреобразовать)[0];
			
		Исключение
			
			ОшибкаПреобразования = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ПолучитьBASE64ПоИмениФайлаКлиент");
			ВызватьИсключение (СбисИсключение_Представление(ОшибкаПреобразования));
			
		КонецПопытки;
		
	# Иначе
		
		ПомещаемыеФайлы = Новый Массив;
		ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ПутьКФайлуКлиент));
		ПомещенныеФайлы = Новый Массив;
		
		Попытка
			
			ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы, ,Ложь);
			Возврат ДвоичныеДанныеВBASE64ВызовСервера(ПомещенныеФайлы)[0];
			
		Исключение
			
			ОшибкаПреобразования = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ПолучитьBASE64ПоИмениФайлаКлиент");
			ВызватьИсключение (СбисИсключение_Представление(ОшибкаПреобразования));
			
		КонецПопытки;
		
	# КонецЕсли
	
КонецФункции

&НаКлиенте
Функция ПрочитатьЗначениеПоBase64Клиент(ДвоичныеДанныеBase64, ДопПараметры = Неопределено) Экспорт 
	Перем РасширениеДляBase64;
	
	Если Не ДопПараметры = Неопределено Тогда
		
		ДопПараметры.Свойство("Расширение", РасширениеДляBase64);
		
	КонецЕсли;
	
	Если РасширениеДляBase64 = Неопределено Тогда
		
		РасширениеДляBase64 = "xml";
		
	КонецЕсли;

	ИмяВремФайла		= НовыйВременныйФайлКлиент(, РасширениеДляBase64);
	ДвоичныеДанныеФайла	= Base64Значение(ДвоичныеДанныеBase64);
	Попытка
		
		ДвоичныеДанныеФайла.Записать(ИмяВремФайла);
		
	Исключение
		
		ОшибкаФС = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ПрочитатьЗначениеПоBase64Клиент");
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаФС);
		
	КонецПопытки;
	
	Возврат ПрочитатьФайлКлиент(ИмяВремФайла, Новый ФиксированнаяСтруктура("Расширение", РасширениеДляBase64));

КонецФункции 

// Функция - Читает файл на Клиенте как XML, либо TXT. Определяет кодировку
//
// Параметры:
//  ИмяФайла	 - Ссылка			 - Имя файла, который читаем.
//  ДопПараметры - Структура(необяз) - Расширение метода 
//		Расширение: Строка					 - расширение файла
//		Кодировка:	Строка/кодировка файла	 - кодировка для чтения
// 
// Возвращаемое значение:
//  Строка - прочитанные данные
//
&НаКлиенте
Функция ПрочитатьФайлКлиент(ИмяФайла, ДопПараметры = Неопределено) Экспорт
	Перем РасширениеФайла, КодировкаФайла;

	Если Не ДопПараметры = Неопределено Тогда
		
		ДопПараметры.Свойство("Расширение",	РасширениеФайла);
		ДопПараметры.Свойство("Кодировка",	КодировкаФайла);
		
	КонецЕсли;
	
	Если РасширениеФайла = Неопределено Тогда
		
		РасширениеФайла = СтрЗаменить(ИмяФайла, ".", Символы.ПС);
		РасширениеФайла = СтрПолучитьСтроку(РасширениеФайла, СтрЧислоСтрок(РасширениеФайла));
		
	КонецЕсли;
		
	Если РасширениеФайла = "xml" Тогда
		
		Если КодировкаФайла = Неопределено Тогда
			
			ТекстДок		= Новый ЧтениеТекста(ИмяФайла);
			СтрокаТекст		= СтрЗаменить(НРег(ТекстДок.ПрочитатьСтроку()),"'","""");
			КодировкаФайла	= ОпределитьКодировкуФайлаXML(СтрокаТекст);
			
		КонецЕсли;
		
		ТекстДок.Открыть(ИмяФайла, КодировкаФайла);
		Результат		= ТекстДок.Прочитать();
		
		Если		Результат		= Неопределено
			Или	Лев(Результат, 4)	= "%PDF" Тогда
			
			// для PDF-файла иногда возвращается крокозябра, которая потом вызывает ошибку передачи данных между клиентом и сервером, несмотря на то, что это строка
			Результат = "";
			
		КонецЕсли;
		
	Иначе
		
		ТекстДок	= Новый ЧтениеТекста(ИмяФайла, КодировкаФайла);
		Результат	= ТекстДок.Прочитать();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДвоичныеДанныеВBASE64ВызовСервера(ПомещенныеНаСерверФайлы)
	
	Возврат МодульОбъектаСервер().ФайлыВBASE64Сервер(ПомещенныеНаСерверФайлы);
	
КонецФункции

&НаКлиенте
Функция ОпределитьПолноеИмяКолонки(ТчИмя, КолонкаИмя)
    
    Перем ИмяКолонкиШаблон;
    Если Не ГлобальныйКэш.ТекущийСеанс.Интерфейс.Свойство("ИмяРеквзитаКолонок",    ИмяКолонкиШаблон) Тогда
        ИмяКолонкиШаблон = "{ИмяКолонки}";
        Если ГлобальныйКэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
            ИмяКолонкиШаблон = "{ТЧ}" + ИмяКолонкиШаблон;
        КонецЕсли;
        ГлобальныйКэш.ТекущийСеанс.Интерфейс.Вставить("ИмяРеквзитаКолонок",    ИмяКолонкиШаблон);
    КонецЕсли;

    Возврат СтрЗаменить(СтрЗаменить(ИмяКолонкиШаблон, "{ИмяКолонки}", КолонкаИмя), "{ТЧ}", ТчИмя);
    
КонецФункции

// Функция отдает параметры сервера из его полного представления - код и представление для интерфейса
// Параметры:
//  СбисАдресСервера - online.saby.ru
// 
// Возвращаемое значение:
//  Структура - параметры сервиса СБИС
//
&НаКлиенте
Функция ПараметрыАдресаСервераСБИС(СбисАдресСервера) Экспорт
	
	СбисПредставлениеСервера	= СтрЗаменить(СтрЗаменить(СокрЛП(сбисАдресСервера), "https:", ""), "/", "");
    РазобранныйАдрес			= СбисРазобратьАдресСервера(СбисАдресСервера);
	
	Если	РазобранныйАдрес.Поддомен = "online" Тогда
		
		КодСервиса = "";
		
	ИначеЕсли	РазобранныйАдрес.Поддомен = "fix"
			Или	РазобранныйАдрес.Поддомен = "test" Тогда
			
		КодСервиса = РазобранныйАдрес.Поддомен;
		
	Иначе
		
		КодСервиса = "undefine";
		
	КонецЕсли;
	
	Возврат Новый Структура("КодСервиса, ПредставлениеСервера", КодСервиса, СбисПредставлениеСервера)
	
КонецФункции

&НаКлиенте
Процедура СбисУстановитьБлокировкуФормы(Форма, ПараметрыБлокировкиУстановить) Экспорт
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИдКоннекшена(Отказ = Ложь) Экспорт

	Если Не ПолучитьЗначениеПараметраСбис("ДоступныСерверныеНастройки") Тогда
		// Если интеграция каталог
		Возврат Неопределено;
	КонецЕсли;
	Если ГлобальныйКэш.КэшНастроек.Свойство("ВыбранныеНастройки")
		И ГлобальныйКэш.КэшНастроек.ВыбранныеНастройки.Свойство("Идентификатор") Тогда
		
		Возврат ГлобальныйКэш.КэшНастроек.ВыбранныеНастройки.Идентификатор;
	Иначе
		
		РезультатПодключения = ГлобальныйКэш.ТекущийСеанс.Модули.Настройки.СбисПолучитьНастройкиСБИС(ГлавноеОкно.Кэш, Отказ);
		
		Если Отказ = Ложь Тогда
			Возврат ГлобальныйКэш.КэшНастроек.ВыбранныеНастройки.Идентификатор;
		Иначе
			Возврат РезультатПодключения;
		КонецЕсли;
	КонецЕсли;

КонецФункции // ПолучитьИдКоннекшена()

&НаКлиенте
Функция ПолучитьИдИнтеграции(Отказ = Ложь) Экспорт

	Если Не ПолучитьЗначениеПараметраСбис("ДоступныСерверныеНастройки") Тогда
		// Если интеграция каталог
		Возврат Неопределено;
	КонецЕсли;
	Если ГлобальныйКэш.КэшНастроек.Свойство("ВыбранныеНастройки")
		И ГлобальныйКэш.КэшНастроек.ВыбранныеНастройки.Свойство("Интеграция") Тогда
		
		Возврат ГлобальныйКэш.КэшНастроек.ВыбранныеНастройки.Интеграция;
	Иначе
		
		РезультатПодключения = ГлобальныйКэш.ТекущийСеанс.Модули.Настройки.СбисПолучитьНастройкиСБИС(ГлавноеОкно.Кэш, Отказ);
		
		Если Отказ = Ложь Тогда
			Возврат ГлобальныйКэш.КэшНастроек.ВыбранныеНастройки.Интеграция;
		Иначе
			Возврат РезультатПодключения;
		КонецЕсли;
	КонецЕсли;

КонецФункции // ПолучитьИдИнтеграции()

// Проверяет строку на GUID
//
// Параметры:
//  Значение  - Строка - Проверяемая строка
//
// Возвращаемое значение:
//   Булево   - Результат провеки
//
&НаКлиенте
Функция SabyЭтоУникальныйИдентификатор(Знач Значение) Экспорт
	
	Шаблон = "XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX";
	
	Если СтрДлина(Шаблон) <> СтрДлина(Значение) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Позиция = 1 По СтрДлина(Значение) Цикл

		НарушеноУсловиеУИ = Сред(Шаблон, Позиция, 1) = "X" И НЕ Найти("0123456789ABCDEFabcdef", Сред(Значение, Позиция, 1)) // 0..9, a..f, A..F
						Или Сред(Шаблон, Позиция, 1) = "-" И Сред(Значение, Позиция, 1) <> "-";								// -
		
		Если НарушеноУсловиеУИ Тогда
				Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Разбор параметрок сбис в виде строки фората
// ключ=>значение,...
//
// Параметры:
//   СтрокаПараметров - Строка - Строка параметров
//
// Возвращаемое значение:
//   Соответствие - Параметры в виде соответствия
&НаКлиенте
Функция РазобратьСтрокуПараметровСбис(СтрокаПараметров) Экспорт 

	СтрокаПараметровПС = СтрЗаменить(СтрокаПараметров, ",", Символы.ПС);
	ПараметрыСоответствием = Новый Соответствие;
	
	Для НомерПараметра = 1 По СтрЧислоСтрок(СтрокаПараметровПС) Цикл

		КлючЗначение = СтрЗаменить(СокрЛП(СтрПолучитьСтроку(СтрокаПараметровПС, НомерПараметра)), "=>", Символы.ПС);
		Ключ = СтрПолучитьСтроку(КлючЗначение, 1);
		Значение = СтрПолучитьСтроку(КлючЗначение, 2);
		ПараметрыСоответствием.Вставить(Сред(Ключ, 2, СтрДлина(Ключ) - 2), Сред(Значение, 2, СтрДлина(Значение) - 2));

	КонецЦикла;
	
	Возврат ПараметрыСоответствием;

КонецФункции

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_ОбщиеФункцииИПроцедуры_ТипыИМетаданные
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_РаботаСПараметрами
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_ОбщиеФункцииИПроцедуры_ПолучитьФормуОбработки 
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_ОбщиеФункцииИПроцедуры_НайтиФункциюСеансаОбработки 
#КонецОбласти
 
#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_ОбщиеФункцииИПроцедуры_РаботаСФичами
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_ОбщиеФункцииИПроцедуры_Интерфейс
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_ОбщиеФункцииИПроцедуры_РаботаСИниИXSLT
#КонецОбласти

