
&НаКлиенте
Процедура СохранитьОтладочныеДанныеСБИС(ДанныеЗаписать, ДопПараметры=Неопределено) Экспорт
	Перем ПараметрКЗаписи;	
	
	ОбщиеФункцииДокументов	= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	сбисПутьЗаписиОсновной	= ПолучитьПараметрПользователя("КаталогОтладки");
	
	Попытка
		
		ПараметрыВерсии	= ГлобальныйКэш.ПараметрыСистемы.Обработка.Версия;		
		
	Исключение
		
		ПараметрыВерсии = "Неизвестная сборка";
		// Не удалось прописать версию орбаботки
		
	КонецПопытки;
	
	сбисПутьЗаписиОсновной	= ПрименитьФорматКСтроке(сбисПутьЗаписиОсновной, ПараметрыВерсии, "Каталог");
	
	Если ДанныеЗаписать.Свойство("XML", ПараметрКЗаписи) Тогда
		Для Каждого ЗаписьПараметра Из ПараметрКЗаписи Цикл
			ШаблонXML = ЗаписьПараметра.Данные;
			Если ЗаписьПараметра.Отказ Тогда
				ШаблонXML = СбисРаботаСJson.ПреобразоватьЗначениеВJson(ШаблонXML);
			КонецЕсли;
			ОшибкаЗаписи	= Ложь;
			Если	ЗаписьПараметра.Свойство("Папка")
				И	ЗначениеЗаполнено(ЗаписьПараметра.Папка) Тогда
				сбисПутьЗаписи = сбисПутьЗаписиОсновной + ЗаписьПараметра.Папка;
			Иначе
				сбисПутьЗаписи = сбисПутьЗаписиОсновной
			КонецЕсли;
			сбисПутьЗаписи = ПрименитьФорматКСтроке(сбисПутьЗаписи,,"Каталог");
			
			РезультатЗаписи = ОбщиеФункцииДокументов.сбисЗаписатьФайл_Клиент(ГлобальныйКэш, Новый Структура("Путь, Имя, Расширение, Данные, Кодировка", сбисПутьЗаписи, ЗаписьПараметра.Имя, "xml", ШаблонXML, "windows-1251"), ОшибкаЗаписи);
			Если ОшибкаЗаписи Тогда
				СообщитьСбисИсключение(РезультатЗаписи);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ДанныеЗаписать.Свойство("XSLT", ПараметрКЗаписи) Тогда
		Для Каждого ЗаписьПараметра Из ПараметрКЗаписи Цикл
			ОшибкаЗаписи	= Ложь;
			Если	ЗаписьПараметра.Свойство("Папка")
				И	ЗначениеЗаполнено(ЗаписьПараметра.Папка) Тогда
				сбисПутьЗаписи = сбисПутьЗаписиОсновной + ЗаписьПараметра.Папка;
			Иначе
				сбисПутьЗаписи = сбисПутьЗаписиОсновной
			КонецЕсли;
			сбисПутьЗаписи = ПрименитьФорматКСтроке(сбисПутьЗаписи,,"Каталог");
			
			РезультатЗаписи = ОбщиеФункцииДокументов.СбисЗаписатьФайл_Клиент(ГлобальныйКэш, Новый Структура("Путь, Имя, Расширение, Данные, Кодировка", сбисПутьЗаписи, ЗаписьПараметра.Имя, "xslt", ЗаписьПараметра.Данные,  КодировкаТекста.UTF8), ОшибкаЗаписи);
			Если ОшибкаЗаписи Тогда
				СообщитьСбисИсключение(РезультатЗаписи);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ДанныеЗаписать.Свойство("Log", ПараметрКЗаписи) Тогда
		
		СбисИмяМодуля	= Неопределено;
		ОшибкаЗаписи	= Ложь;
		
		ПутьДоЛога = Новый Массив;
		ПутьДоЛога.Добавить("Log");
		ПутьДоЛога.Добавить(Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));
		
		СбисПутьЗаписи	= ПрименитьФорматКСтроке(сбисПутьЗаписиОсновной, ПутьДоЛога, "Каталог");
		ФайлТест		= Новый Файл(СбисПутьЗаписи);
		Если	Не ФайлТест.Существует()
			Или	Не ФайлТест.ЭтоКаталог() Тогда 
			Попытка
				СоздатьКаталог(СбисПутьЗаписи);
			Исключение
				ИзменитьПараметрSABY("РежимОтладки", Ложь);
				СтруктураОшибки = НовыйСбисИсключение(
					ИнформацияОбОшибке(),
					МодульОбъектаКлиентСервер_Представление() + "СбисСохранитьОтладочныеДанные",
					772,, 
					"Ошибка доступа к каталогу записи логов " + СбисПутьЗаписи + ".");
				СообщитьСбисИсключение(СтруктураОшибки);
				Возврат;
			КонецПопытки;
		КонецЕсли;
		
		Если ТипЗнч(ПараметрКЗаписи) = Тип("Массив") Тогда
			
			Для Каждого ЗаписьПараметра Из ПараметрКЗаписи Цикл
				
				СохранитьОтладочныеДанныеСБИС_ВывестиЗапись(ЗаписьПараметра, СбисПутьЗаписи);
				
			КонецЦикла;
			
		Иначе
			
			СохранитьОтладочныеДанныеСБИС_ВывестиЗапись(ПараметрКЗаписи, СбисПутьЗаписи);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СохранитьОтладочныеДанныеСБИС_ВывестиЗапись(ЗаписьПараметра, СбисПутьЗаписи) Экспорт

	лОтладочныеДанные = НовыйЗаписьЛогаSABY(ЗаписьПараметра);

	СбисИмяМодуля	= лОтладочныеДанные.Модуль + ".txt";
	ТекстДок		= Новый ТекстовыйДокумент;
	ФайлТест		= Новый Файл(СбисПутьЗаписи + СбисИмяМодуля);
	
	Если ФайлТест.Существует() Тогда
		
		ТекстДок.Прочитать(СбисПутьЗаписи + СбисИмяМодуля);
		
	КонецЕсли;
	
	ТекстДок.ДобавитьСтроку(ЗаписьЛогаSABY_Выгрузить(лОтладочныеДанные));
	ТекстДок.Записать(СбисПутьЗаписи + СбисИмяМодуля);

КонецПроцедуры

