
&НаКлиенте
Процедура СохранитьОтладочныеДанныеСБИС(ДанныеЗаписать, ДопПараметры=Неопределено) Экспорт
	Перем ПараметрКЗаписи;	
	
	ОбщиеФункцииДокументов	= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	сбисПутьЗаписиОсновной	= ПолучитьПараметрПользователя("КаталогОтладки");
	
	Попытка
		
		ПараметрыВерсии	= ГлобальныйКэш.ПараметрыСистемы.Обработка.Версия;		
		
	Исключение
		
		ПараметрыВерсии = "Неизвестная сборка";
		// Не удалось прописать версию орбаботки
		
	КонецПопытки;
	
	сбисПутьЗаписиОсновной	= ПрименитьФорматКСтроке(сбисПутьЗаписиОсновной, ПараметрыВерсии, "Каталог");
	
	Если ДанныеЗаписать.Свойство("XML", ПараметрКЗаписи) Тогда
		Для Каждого ЗаписьПараметра Из ПараметрКЗаписи Цикл
			ШаблонXML = ЗаписьПараметра.Данные;
			Если ЗаписьПараметра.Отказ Тогда
				ШаблонXML = СбисРаботаСJson.ПреобразоватьЗначениеВJson(ШаблонXML);
			КонецЕсли;
			ОшибкаЗаписи	= Ложь;
			Если	ЗаписьПараметра.Свойство("Папка")
				И	ЗначениеЗаполнено(ЗаписьПараметра.Папка) Тогда
				сбисПутьЗаписи = сбисПутьЗаписиОсновной + ЗаписьПараметра.Папка;
			Иначе
				сбисПутьЗаписи = сбисПутьЗаписиОсновной
			КонецЕсли;
			сбисПутьЗаписи = ПрименитьФорматКСтроке(сбисПутьЗаписи,,"Каталог");
			
			РезультатЗаписи = ОбщиеФункцииДокументов.сбисЗаписатьФайл_Клиент(ГлобальныйКэш, Новый Структура("Путь, Имя, Расширение, Данные, Кодировка", сбисПутьЗаписи, ЗаписьПараметра.Имя, "xml", ШаблонXML, "windows-1251"), ОшибкаЗаписи);
			Если ОшибкаЗаписи Тогда
				СообщитьСбисИсключение(РезультатЗаписи);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ДанныеЗаписать.Свойство("XSLT", ПараметрКЗаписи) Тогда
		Для Каждого ЗаписьПараметра Из ПараметрКЗаписи Цикл
			ОшибкаЗаписи	= Ложь;
			Если	ЗаписьПараметра.Свойство("Папка")
				И	ЗначениеЗаполнено(ЗаписьПараметра.Папка) Тогда
				сбисПутьЗаписи = сбисПутьЗаписиОсновной + ЗаписьПараметра.Папка;
			Иначе
				сбисПутьЗаписи = сбисПутьЗаписиОсновной
			КонецЕсли;
			сбисПутьЗаписи = ПрименитьФорматКСтроке(сбисПутьЗаписи,,"Каталог");
			
			РезультатЗаписи = ОбщиеФункцииДокументов.СбисЗаписатьФайл_Клиент(ГлобальныйКэш, Новый Структура("Путь, Имя, Расширение, Данные, Кодировка", сбисПутьЗаписи, ЗаписьПараметра.Имя, "xslt", ЗаписьПараметра.Данные,  КодировкаТекста.UTF8), ОшибкаЗаписи);
			Если ОшибкаЗаписи Тогда
				СообщитьСбисИсключение(РезультатЗаписи);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ДанныеЗаписать.Свойство("Log", ПараметрКЗаписи) Тогда
		
		СбисИмяМодуля	= Неопределено;
		ОшибкаЗаписи	= Ложь;
		
		ПутьДоЛога = Новый Массив;
		ПутьДоЛога.Добавить("Log");
		ПутьДоЛога.Добавить(Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));
		
		СбисПутьЗаписи	= ПрименитьФорматКСтроке(сбисПутьЗаписиОсновной, ПутьДоЛога, "Каталог");
		ФайлТест		= Новый Файл(СбисПутьЗаписи);
		Если	Не ФайлТест.Существует()
			Или	Не ФайлТест.ЭтоКаталог() Тогда 
			Попытка
				СоздатьКаталог(СбисПутьЗаписи);
			Исключение
				ГлобальныйКэш.Парам.РежимОтладки = Ложь;
				СтруктураОшибки = НовыйСбисИсключение(,"МодульОбъектаКлиент.СбисСохранитьОтладочныеДанные", 772, "Ошибка работы с файловой системой", "Ошибка доступа к каталогу записи логов " + СбисПутьЗаписи + ". Детально: " + ИнформацияОбОшибке().Описание);
				СообщитьСбисИсключение(СтруктураОшибки);
				Возврат;
			КонецПопытки;
		КонецЕсли;
	
		СбисФорматЛога = "{Время}{Тип} {Вызов} {Идентификатор} {Сообщение}";
		Для Каждого ЗаписьПараметра Из ПараметрКЗаписи Цикл
			
			лОтладочныеДанные	= СохранитьОтладочныеДанныеСБИС_ЗаписьДляЛога(ЗаписьПараметра);
			СбисИмяМодуля		= лОтладочныеДанные.Модуль;
			СбисИмяВызова		= лОтладочныеДанные.Вызов;
			СбисВремяЛога		= лОтладочныеДанные.Время;
			ОбъектСообщенияЛога	= лОтладочныеДанные.Сообщение;
			СбисТипСообщения	= лОтладочныеДанные.Тип;
			СбисИдЛога			= лОтладочныеДанные.Идентификатор;
			
			СбисИмяМодуля = СбисИмяМодуля + ".txt";
			СтрокаНаВывод = СтрЗаменить(СтрЗаменить(СтрЗаменить(СбисФорматЛога, 
			"{Время}",		СбисДополнитьСтроку(Формат(СбисВремяЛога, "ДФ=HH:mm:ss"),10)),
			"{Тип}",		СбисДополнитьСтроку(СбисТипСообщения, 15)),
			"{Сообщение}",	СбисРаботаСJSON.ПреобразоватьЗначениеВJSON(ОбъектСообщенияЛога, Новый Структура("Режим", "Лог")));
			Если ЗначениеЗаполнено(СбисИдЛога) Тогда
				
				СтрокаНаВывод = СтрЗаменить(СтрЗаменить(СтрокаНаВывод, 
				"{Вызов}",			СбисДополнитьСтроку(СбисИмяВызова, 40)),
				"{Идентификатор}",	СбисДополнитьСтроку(СбисИдЛога, 50));
				
			Иначе
				
				СтрокаНаВывод = СтрЗаменить(СтрЗаменить(СтрокаНаВывод, 
				"{Вызов}",			СбисДополнитьСтроку(СбисИмяВызова, 90)),
				"{Идентификатор}",	"");
				
			КонецЕсли;
			ТекстДок = Новый ТекстовыйДокумент;
			ФайлТест = Новый Файл(СбисПутьЗаписи + СбисИмяМодуля);
			Если ФайлТест.Существует() Тогда
				ТекстДок.Прочитать(СбисПутьЗаписи + СбисИмяМодуля);
			КонецЕсли;							
			ТекстДок.ДобавитьСтроку(СтрокаНаВывод);
			ТекстДок.Записать(СбисПутьЗаписи + СбисИмяМодуля);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция СохранитьОтладочныеДанныеСБИС_ЗаписьДляЛога(ЗаписьПараметра)
	
	лОтладочныеДанные = Новый Структура("Тип, Вызов, Время, Сообщение, Идентификатор, Модуль");
	
	Если ТипЗнч(ЗаписьПараметра) = Тип("ФиксированнаяСтруктура") Тогда
		
		лОтладочныеДанные.Модуль = ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя"); 
		ЗаполнитьЗначенияСвойств(лОтладочныеДанные, ЗаписьПараметра);
		
		ВывестиДанные = Истина;
		Если ЗаписьПараметра.Свойство("Команда") Тогда
			
			// Если режим отладки, то выгрузим для освобождаемого потока ответ в лог.
			лОтладочныеДанные.Вызов			= АсинхроннаяСбисКоманда_Получить(ЗаписьПараметра.Команда, "ИмяВызова");
			лОтладочныеДанные.Идентификатор	= АсинхроннаяСбисКоманда_Получить(ЗаписьПараметра.Команда, "Идентификатор");
			ВывестиДанные					= Не АсинхроннаяСбисКоманда_Получить(ЗаписьПараметра.Команда, "СкрытьДанные");
			
		КонецЕсли;
		
		Если ЗаписьПараметра.Свойство("Событие") Тогда
			
			лОтладочныеДанные.Тип = АсинхронноеСбисСобытие_Получить(ЗаписьПараметра.Событие, "Тип");
			Если	НРег(лОтладочныеДанные.Тип) = "criticalerror"
				Или	ВывестиДанные Тогда
				
				лОтладочныеДанные.Сообщение = АсинхронноеСбисСобытие_Получить(ЗаписьПараметра.Событие, "Данные");
				
			КонецЕсли;
			
		КонецЕсли;
				 
	ИначеЕсли ЭтоТипСбис(ЗаписьПараметра, "АсинхроннаяСбисКоманда") Тогда
		
		Если	ТипЗнч(ЗаписьПараметра.АргументВызова) = Тип("Структура")
			И	ЗаписьПараметра.АргументВызова.Свойство("Метод")
			И	ЗаписьПараметра.АргументВызова.Свойство("ПараметрыМетода") Тогда
			//В команде прописан вызов метода 
			лОтладочныеДанные.Вызов		= ЗаписьПараметра.АргументВызова.Метод;
			лОтладочныеДанные.Сообщение	= ЗаписьПараметра.АргументВызова.ПараметрыМетода;
		Иначе
			лОтладочныеДанные.Вызов		= ЗаписьПараметра.ОбработчикВызова.ИмяПроцедуры;
			лОтладочныеДанные.Сообщение	= ЗаписьПараметра.АргументВызова;
		КонецЕсли;
		Если ЗаписьПараметра.Ответ = Неопределено Тогда
			//Пишется вызов команды
			лОтладочныеДанные.Тип	= "CALL";
			лОтладочныеДанные.Время	= ЗаписьПараметра.ВремяВызова;
		Иначе
			лОтладочныеДанные.Тип		= ВРег(ЗаписьПараметра.Ответ.Тип);
			лОтладочныеДанные.Сообщение	= ЗаписьПараметра.Ответ.Данные;
			лОтладочныеДанные.Время		= ЗаписьПараметра.Ответ.Получено;
		КонецЕсли;	
		лОтладочныеДанные.Модуль		= ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		лОтладочныеДанные.Идентификатор	= АсинхроннаяСбисКоманда_Получить(ЗаписьПараметра, "Идентификатор");
		
	ИначеЕсли ЗаписьПараметра.Свойство("Исключение") Тогда
		СбисИсключение = ЗаписьПараметра.Исключение;
		
		Если СбисИсключение.methodName = Неопределено Тогда
			
			Если ЗначениеЗаполнено(СбисИсключение.stack) Тогда
				
				СбисПолноеИмяМетода = СбисИсключение.stack[0].methodName;
				
			Иначе
				
				СбисПолноеИмяМетода = "НеизвестныйМодуль.НеизвестныйМетод"
				
			КонецЕсли;	
			
		Иначе
			
			СбисПолноеИмяМетода = СбисИсключение.methodName;
				
		КонецЕсли;
			
		лОтладочныеДанные.Модуль	= СтрПолучитьСтроку(СтрЗаменить(СбисПолноеИмяМетода, ".", Символы.ПС), 1);
		лОтладочныеДанные.Вызов		= Сред(СбисПолноеИмяМетода, СтрДлина(лОтладочныеДанные.Модуль) + 2);
		лОтладочныеДанные.Сообщение = СбисИсключение;
		лОтладочныеДанные.Тип		= "ERROR";
		
		Если СбисИсключение.Свойство("code") Тогда
			
			лОтладочныеДанные.Идентификатор = СбисИсключение.code;
			
		КонецЕсли; 
		
	Иначе
		
		ЗаполнитьЗначенияСвойств(лОтладочныеДанные, ЗаписьПараметра);
		
	КонецЕсли;
	
	Если лОтладочныеДанные.Время = Неопределено Тогда
		
		 лОтладочныеДанные.Время = ТекущаяДата();
		
	 КонецЕсли;
	 
	 Возврат лОтладочныеДанные;
	
КонецФункции

&НаКлиенте
Функция СбисДополнитьСтроку(СтрокаИсх, ДлинаСтрокиДополнить, СимволДополнить = " ")
	СтрокаРезультат = Лев(СтрокаИсх, ДлинаСтрокиДополнить);
	Пока  СтрДлина(СтрокаРезультат) < ДлинаСтрокиДополнить Цикл
		СтрокаРезультат = СтрокаРезультат + СимволДополнить;
	КонецЦикла;
	Возврат СтрокаРезультат;
КонецФункции

