
&НаКлиенте
Процедура ЗаписатьВложенияСБИС(СоставПакета, Вложение, ПараметрыЗаписи, ДопПараметры) Экспорт
	
	Кэш = ГлавноеОкно.Кэш;
	
	Если Не (СоставПакета.Свойство("Идентификатор") и ЗначениеЗаполнено(СоставПакета.Идентификатор)) Тогда 
		ВызватьСбисИсключение("Не указан документ для записи", "МодульОбъектаКлиент.ЗаписатьВложенияСБИС");
	КонецЕсли;
	
	Если Вложение.Свойство("ПолноеИмяФайла") Тогда // внешний файл добавлен в пакет
		Имя= Вложение.ИмяФайла;
		ДвоичныеДанные=Кэш.Интеграция.СБИС_СериализоватьФайлВBase64(Кэш, Новый Структура("ПолноеИмяФайла", Вложение.ПолноеИмяФайла), Новый Структура, Ложь); 
	Иначе  // сформирован xml
		Если Вложение.Свойство("СтруктураФайла") Тогда
			Имя= Вложение.СтруктураФайла.Файл.Имя+".xml";
		Иначе
			Имя= Вложение.Файл.Имя+".xml";
		КонецЕсли;
		Если Вложение.Свойство("XMLДокумента") Тогда
			ДвоичныеДанные=Кэш.Интеграция.СБИС_СериализоватьСтрокуВBase64(Кэш, Новый Структура("Строка", Вложение.XMLДокумента), Новый Структура, Ложь);
		Иначе
			ДвоичныеДанные="";
		КонецЕсли
	КонецЕсли;

	Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
		document = Новый Структура;
		document.Вставить( "Идентификатор", СоставПакета.Идентификатор ); 
		attachmentList = Новый Массив;
		attachment = Новый Структура; 
		file = Новый Структура;
		file.Вставить( "Имя", Имя);
		file.Вставить( "ДвоичныеДанные", ДвоичныеДанные);
		attachment.Вставить( "Файл", file );
		Если Не( Вложение.Свойство("Идентификатор") и ЗначениеЗаполнено(Вложение.Идентификатор)) Тогда
			ИдВложения = Строка(Новый УникальныйИдентификатор());
			Вложение.Вставить("Идентификатор", ИдВложения);
		КонецЕсли;
		attachment.Вставить( "Идентификатор",  Вложение.Идентификатор);
		attachmentList.Добавить( attachment );
		document.Вставить( "Вложение", attachmentList );
		
		Отказ = Ложь;
		ДопПараметрыЗапроса	= Новый Структура("СообщатьПриОшибке, ВернутьОшибку, ЖдатьОтвета, ЕстьРезультат", Ложь, Истина, Истина, Истина);
		Результат = Кэш.Интеграция.СБИС_ЗаписатьВложение(Кэш, document, ДопПараметрыЗапроса, Отказ);
		Если Отказ Тогда   
			ВызватьСбисИсключение(Результат, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_ЗаписатьВложение");
		КонецЕсли;
	Иначе    
		ВызватьСбисИсключение("Нет файла для записи", "МодульОбъектаКлиент.ЗаписатьВложенияСБИС");
	КонецЕсли; 
	
КонецПроцедуры		// alo Меркурий >>

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Отправка_СоставПакета
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Отправка_Сторона
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Отправка_РезультатОтправки
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Отправка_Проверки 
#КонецОбласти
