
&НаКлиенте
Процедура ЗаписатьВложенияСБИС(СоставПакета, Вложение, ПараметрыЗаписи, ДопПараметры) Экспорт
	
	Кэш					= ПолучитьТекущийЛокальныйКэш();
	СбисМодульИнтеграции	= ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция");
	
	Если Не (СоставПакета.Свойство("Идентификатор") И ЗначениеЗаполнено(СоставПакета.Идентификатор)) Тогда 
		ВызватьСбисИсключение("Не указан документ для записи", "МодульОбъектаКлиент.ЗаписатьВложенияСБИС");
	КонецЕсли;
	
	document = Новый Структура;
	document.Вставить("Идентификатор", СоставПакета.Идентификатор);
	
	Если ПараметрыЗаписи.Свойство("Этап") Тогда
		
		document.Вставить("Этап", ПараметрыЗаписи.Этап);
		
	КонецЕсли;
	
	ПараметрыПодготовки = Новый Структура("СоставПакета", СоставПакета);
	
	ПараметрыВложения = Новый Структура;
	ПараметрыВложения.Вставить("Тип",				ВложениеСБИС_Получить(Вложение, "Тип"));
	ПараметрыВложения.Вставить("ПодТип",			ВложениеСБИС_Получить(Вложение, "ПодТип"));
	ПараметрыВложения.Вставить("ВерсияФормата",		ВложениеСБИС_Получить(Вложение, "ВерсияФормата"));
	ПараметрыВложения.Вставить("Дата",				ПривестиТипСбис(ВложениеСБИС_Получить(Вложение, "Дата"), Тип("Дата")));
	ПараметрыВложения.Вставить("Номер",				ВложениеСБИС_Получить(Вложение, "Номер"));
	
	ОбновляемоеВложение = СоставПакета_НайтиВложение(СоставПакета, ПараметрыВложения);
	Если   		ЗначениеЗаполнено(ОбновляемоеВложение)
		И	Не	ОбновляемоеВложение = Вложение Тогда
		
		ПараметрыПодготовки.Вставить("ИдентификаторВложения", ВложениеСбис_Получить(ОбновляемоеВложение, "Идентификатор"));
			
	КонецЕсли;

	document.Вставить("Вложение", Новый Массив);
	document.Вложение.Добавить(ВложениеСБИС_Выгрузить(Вложение, "ЗаписьНаБЛ", ПараметрыПодготовки));
	
	Отказ = Ложь;
	ДопПараметрыЗапроса	= Новый Структура("СообщатьПриОшибке, ВернутьОшибку, ЖдатьОтвета, ЕстьРезультат", Ложь, Истина, Истина, Истина);
	Результат = СбисМодульИнтеграции.СБИС_ЗаписатьВложение(Кэш, document, ДопПараметрыЗапроса, Отказ);
	
	Если Отказ Тогда
		
		ВызватьСбисИсключение(Результат, "МодульОбъектаКлиент.ЗаписатьВложенияСБИС");
		
	КонецЕсли;
	
КонецПроцедуры		// alo Меркурий >>

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Отправка_СоставПакета
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_МассоваяОперация
#КонецОбласти

