
////////////////////////////////////////////////////
//////////////////Параметры системы/////////////////
////////////////////////////////////////////////////

//Структура с описанием текущей системы. Параметры получаются для текущей конфы.
//Вынесено в общее для сбора сразу всех данных на сервере
&НаКлиенте
Функция ПолучитьПараметрыСистемы() Экспорт
	
	СистемнаяИнформацияКлиент = Новый СистемнаяИнформация;
	ПараметрыСистемы = Новый Структура("Сервер,Клиент,Конфигурация,Обработка",Новый Структура, Новый Структура, Новый Структура, Новый Структура);
	ЭтотМодульОбъект = МодульОбъектаКлиент();
		
	Попытка
		//Данные о клиенте
		ПараметрыСистемы.Клиент.Вставить("УправляемоеПриложение",	ТипЗнч(ЭтотМодульОбъект) = Тип("УправляемаяФорма"));
		ПараметрыСистемы.Клиент.Вставить("ВерсияПриложения",		СистемнаяИнформацияКлиент.ВерсияПриложения);
		ПараметрыСистемы.Клиент.Вставить("ТипОС", 					ТипПлатфтормыКлиент(СистемнаяИнформацияКлиент));
		ПараметрыСистемы.Клиент.Вставить("ЭтоLinux",				НРег(Лев(ПараметрыСистемы.Клиент.ТипОС, 5)) = "linux");
		ПараметрыСистемы.Клиент.Вставить("РежимЗапускаПриложения",	РежимЗапускаПриложения());
		//Данные о конфигурации
		ПараметрыСистемы.Конфигурация.Вставить("URL",		СтрокаСоединенияИнформационнойБазы());
		ПараметрыСистемы.Конфигурация.Вставить("Файловая",	Булево(Найти(ПараметрыСистемы.Конфигурация.URL, "File=")));
		//Данные об обработке
		
#Область include_sys_version
#КонецОбласти
		
		ВерсияОбработкиКратко = СтрЗаменить(СбисВерсия, ".", Символы.ПС);
		ВерсияОбработкиКратко = СтрПолучитьСтроку(ВерсияОбработкиКратко, 1) + "." + СтрПолучитьСтроку(ВерсияОбработкиКратко, 2);
		ВерсияПлатформыКратко = СтрЗаменить(ПараметрыСистемы.Клиент.ВерсияПриложения, ".", Символы.ПС);
		ВерсияПлатформыКратко = СтрПолучитьСтроку(ВерсияПлатформыКратко, 1) + СтрПолучитьСтроку(ВерсияПлатформыКратко, 2);
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ПараметрыСистемы.Клиент.Вставить("УправляемоеПриложение",	Ложь);
			ИмяПродуктаСБИС	= "vo2_1c_82_of";
			СбисИмяОбработки = Строка(ЭтотМодульОбъект);
			СбисПутьКФормам = "";
		#Иначе
			ПараметрыСистемы.Клиент.Вставить("УправляемоеПриложение",	Истина);
			ИмяПродуктаСБИС	= "vo2_1c_83_uf";
			СбисИмяФормы = СтрЗаменить(ЭтотМодульОбъект.ИмяФормы, ".", Символы.ПС);
			СбисИмяОбработки = СтрПолучитьСтроку(СбисИмяФормы, 1) + ".";
			Шаг = 2;
			Пока Шаг < СтрЧислоСтрок(СбисИмяФормы) - 1 Цикл
				СбисИмяОбработки = СбисИмяОбработки + СтрПолучитьСтроку(СбисИмяФормы, Шаг) + ".";
				Шаг = Шаг + 1;
			КонецЦикла;
			СбисПутьКФормам = СтрПолучитьСтроку(СбисИмяФормы, Шаг) + ".";
		#КонецЕсли
		ПараметрыСистемы.Обработка.Вставить("Версия",		СбисВерсия);
		ПараметрыСистемы.Обработка.Вставить("ПолноеИмя",	СбисИмяОбработки);
		ПараметрыСистемы.Обработка.Вставить("ИмяПродукта",	ИмяПродуктаСБИС);
		ПараметрыСистемы.Обработка.Вставить("КлючФорм",		СбисПутьКФормам);
		ПараметрыСистемы.Обработка.Вставить("КраткаяВерсия","VO" + ВерсияПлатформыКратко + ?(ПараметрыСистемы.Клиент.УправляемоеПриложение, "UF", "OF") + ВерсияОбработкиКратко);

		//Данные о сервере
		ЗаполнитьПараметрыСистемыНаСервере(ПараметрыСистемы);
		ПараметрыСистемы.Обработка.Вставить("ПолнаяВерсия",	"1C" + ПараметрыСистемы.Сервер.ВерсияПриложения + "_VO" + ВерсияОбработкиКратко);  
		
		//Данные по UserAgent для API методов
		ПараметрыСистемы.Обработка.Вставить("UserAgent",	"Saby1C" + "VO2" + ?(ПараметрыСистемы.Клиент.УправляемоеПриложение, "83UF", "82OF") + "/" + ВерсияОбработкиКратко);
	Исключение
		
		ОшибкаПолученияПараметров = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ПолучитьПараметрыСистемы");
		ВызватьИсключение СбисИсключение_Представление(ОшибкаПолученияПараметров);
		
	КонецПопытки;
	
	// Убрать в 25.2100
	ВстроенныйЯзыкКонфигурации = "ru";
	Попытка
		
		// Для определения встроенного языка, сделаем заведомо ошибочный вызов и проверим исключение
		// Свойства метаданных не всегда совпадают с фактически присылаемым языком системых сообщений, поэтому делаем наверняка
		СбисТестИсключение = Новый Структура("1");
		
	Исключение
		
		СбисОшибка = ОписаниеОшибки();
		Если Найти(СбисОшибка, "calling constructor") Тогда
			
			//Локализация//
			// Пока проверить только на английский. Расширить при необходимости.
			ВстроенныйЯзыкКонфигурации = "en";
			
		КонецЕсли;
		
	Конецпопытки;
	ПараметрыСистемы.Конфигурация.Вставить("ВстроенныйЯзык", ВстроенныйЯзыкКонфигурации);
		
	Возврат	ПараметрыСистемы;	
	
КонецФункции

&НаСервере
Процедура ПереложитьПараметрыСистемыВОбщееХранилище(ИмяПродукта)
	
	ПараметрыИнтеграции = ХранилищеОбщихНастроек.Загрузить("Integration", "Integration", "Integration", "СБИС");
	Если ПараметрыИнтеграции = Неопределено Тогда
		Возврат;
	КонецЕсли;
	УидСистемы = ПараметрыИнтеграции.Получить("integration_uuid");
	ОбщиеНастройки = ХранилищеОбщихНастроек.Загрузить(ИмяПродукта, "params",,ИмяПродукта);
	Если ТипЗнч(ОбщиеНастройки) <> Тип("Структура") Тогда
		ОбщиеНастройки = Новый Структура;
	КонецЕсли;
	ОбщиеНастройкиСтарые = ХранилищеОбщихНастроек.Загрузить("SABY", "params",,"SABY");
	// Переложим ExtSysUid ВО3 в ExtSysUidOld
	Если ОбщиеНастройки.Свойство("ExtSysUid") И Не ОбщиеНастройки.Свойство("ExtSysUidOld") Тогда
		ExtSysUidOld = ОбщиеНастройки.ExtSysUid;
		Если ТипЗнч(ОбщиеНастройкиСтарые) = Тип("Структура") И ОбщиеНастройкиСтарые.Свойство("ExtSysUid")
			И ОбщиеНастройки.ExtSysUid <> ОбщиеНастройкиСтарые.ExtSysUid Тогда
			ExtSysUidOld = ExtSysUidOld + "," + ОбщиеНастройкиСтарые.ExtSysUid;
		КонецЕсли;
		ОбщиеНастройки.Вставить("ExtSysUidOld", ExtSysUidOld);
	КонецЕсли;         
	
	ОбщиеНастройки.Вставить("ExtSysUid", УидСистемы);
	ХранилищеОбщихНастроек.Сохранить(ИмяПродукта, "params", ОбщиеНастройки,,ИмяПродукта);
	ХранилищеОбщихНастроек.Удалить("Integration", "Integration", "СБИС");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыСистемыНаСервере(ПараметрыСистемы)
	
	СистемнаяИнформация = Новый СистемнаяИнформация;

	ВстроенныйЯзыкКонфигурации = "ru";
	//Для анлгоязычных систем переопределим язык для проверки функций
	Если Найти(Строка(Метаданные), "Metadata") Тогда
		
		//Локализация//
		// Пока проверить только на английский. Расширить при необходимости.
		ВстроенныйЯзыкКонфигурации = "en";
		
	КонецЕсли;	
	
	РежимСовместимостиСтрокой = Строка(Метаданные.РежимСовместимости);
	Если РежимСовместимостиСтрокой = НСтр("ru = 'Не использовать'", ВстроенныйЯзыкКонфигурации) Тогда
		
		РежимСовместимостиВерсия = Метаданные.Версия;
		
	Иначе
		
		РежимСовместимостиРазбит	= СтрЗаменить(РежимСовместимостиСтрокой, "_", Символы.ПС);
		РежимСовместимостиВерсия			= "";
		СимволыВерсии				= "0123456789";
		Для СтрНомерСтроки = 1 По СтрЧислоСтрок(РежимСовместимостиРазбит) Цикл
			
			РазрядВерсии				= СтрПолучитьСтроку(РежимСовместимостиРазбит, СтрНомерСтроки);
			РежимСовместимостиВерсия	= РежимСовместимостиВерсия + "." + МодульОбъектаСервер().ПрименитьФорматКСтроке(РазрядВерсии, СимволыВерсии, "Оставить");
			
		КонецЦикла;
		РежимСовместимостиВерсия = Сред(РежимСовместимостиВерсия, 2);

	КонецЕсли;
	
	//На толстом клиенте пока берем системную информацию клиента.
	ПараметрыСистемы.Сервер.Вставить("ТипОС", 				ТипПлатфтормыСервер(СистемнаяИнформация));
	ПараметрыСистемы.Сервер.Вставить("ВерсияПриложения",	СистемнаяИнформация.ВерсияПриложения);
	ПараметрыСистемы.Сервер.Вставить("ЭтоLinux",			НРег(Лев(ПараметрыСистемы.Сервер.ТипОС, 5)) = "linux");
	//Получаем системные параметры файла обработки	
	ПараметрыСистемы.Обработка.Вставить("ПолноеИмяОбработки",		сбисПолноеИмяФайла(ПараметрыСистемы));
	ПараметрыСистемы.Обработка.Вставить("РежимИспользования",		ПолучитьРежимИспользованияОбработки(ПараметрыСистемы.Обработка.ПолноеИмяОбработки));
	//УидСистемыСтарый = "";
	
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		//ИмяПродукта = МодульОбъекта().ИмяПродукта();
		//ПереложитьПараметрыСистемыВОбщееХранилище(ИмяПродукта);
		//
		//ПараметрыИнтеграции = ХранилищеОбщихНастроек.Загрузить(ИмяПродукта, "params",,ИмяПродукта);
		//Если ПараметрыИнтеграции = Неопределено Тогда
		//	ПараметрыИнтеграции = Новый Структура;
		//КонецЕсли;
		//Если ПараметрыИнтеграции.Свойство("ExtSysUid") Тогда
		//	УидСистемы = ПараметрыИнтеграции.ExtSysUid;
		//Иначе
		//	УидСистемы = Строка(Новый УникальныйИдентификатор);
		//	ПараметрыИнтеграции.Вставить("ExtSysUid", УидСистемы);
		//	ХранилищеОбщихНастроек.Сохранить(ИмяПродукта, "params",, ПараметрыИнтеграции,,ИмяПродукта);
		//КонецЕсли;
		//Если ПараметрыИнтеграции.Свойство("ExtSysUidOld") Тогда
		//	УидСистемыСтарый = ПараметрыИнтеграции.ExtSysUidOld;
		//КонецЕсли;
		ЗаписатьПараметрыИнтеграции = Ложь;
		ПараметрыИнтеграции = ХранилищеОбщихНастроек.Загрузить("Integration", "Integration", "Integration", "СБИС");
		Если ПараметрыИнтеграции = Неопределено Тогда
			ПараметрыИнтеграции = Новый Соответствие;
		КонецЕсли;
		УидСистемы = ПараметрыИнтеграции.Получить("integration_uuid");
		Если УидСистемы = Неопределено Тогда
			ЗаписатьПараметрыИнтеграции = Истина;
			УидСистемы = Строка(Новый УникальныйИдентификатор);
			ПараметрыИнтеграции.Вставить("integration_uuid", УидСистемы);
		КонецЕсли;
		Если ЗаписатьПараметрыИнтеграции Тогда
			ХранилищеОбщихНастроек.Сохранить("Integration", "Integration", ПараметрыИнтеграции, "Integration", "СБИС")
		КонецЕсли;
	    УстановитьПривилегированныйРежим(Ложь);
	Исключение
		УидСистемы = "";
	КонецПопытки;
	
	ПараметрыСистемы.Конфигурация.Вставить("Имя",					Метаданные.Имя);
	ПараметрыСистемы.Конфигурация.Вставить("КраткаяИнформация",		Метаданные.КраткаяИнформация);
	ПараметрыСистемы.Конфигурация.Вставить("ПодробнаяИнформация",	Метаданные.ПодробнаяИнформация);
	ПараметрыСистемы.Конфигурация.Вставить("ВстроенныйЯзык",		ВстроенныйЯзыкКонфигурации);
	ПараметрыСистемы.Конфигурация.Вставить("РежимСовместимости",	РежимСовместимостиВерсия);
	ПараметрыСистемы.Конфигурация.Вставить("Версия",				Метаданные.Версия);
	ПараметрыСистемы.Конфигурация.Вставить("УИДИнтеграции",			УидСистемы);
	//Если ЗначениеЗаполнено(УидСистемыСтарый) Тогда
	//	ПараметрыСистемы.Конфигурация.Вставить("УИДИнтеграцииСтарый",	УидСистемыСтарый);
	//КонецЕсли;
	ПолучитьСведенияОРасширениях(ПараметрыСистемы);

	//Для возможности записи в ИдПользователя для способов интеграции SDK2 и Каталог
	ПараметрыСистемы.Клиент.Вставить("ИдПользователяИБ", 	ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);

КонецПроцедуры

&НаСервере
Процедура ПолучитьСведенияОРасширениях(ПараметрыСистемы) Экспорт
	
	СтруктураРасширений = Новый Структура;
	МассивПоискаРасширений = Новый Массив;  
	
	Попытка
	
		#Если Не ТолстыйКлиентОбычноеПриложение Тогда	
			СписокРасширенийКонфигурации = РасширенияКонфигурации.Получить();
			Для Каждого ЭлементРасширение Из СписокРасширенийКонфигурации Цикл
				
				СтруктураРасширения = СбисПолучитьПустоеСведениеОРасширении();
				СтруктураРасширения.Вставить("Имя", ЭлементРасширение.Имя);
				СтруктураРасширения.Вставить("Версия", ЭлементРасширение.Версия);
				СтруктураРасширения.Вставить("Активно", ЭлементРасширение.Активно);
				СтруктураРасширения.Вставить("Назначение", Строка(ЭлементРасширение.Назначение));
				СтруктураРасширения.Вставить("БезопасныйРежим", ЭлементРасширение.БезопасныйРежим);
				СтруктураРасширения.Вставить("ОбластьДействия", Строка(ЭлементРасширение.ОбластьДействия));
				СтруктураРасширения.Вставить("ЗащитаОтОпасныхДействий", ЭлементРасширение.Имя);
				СтруктураРасширения.Вставить("ИспользуетсяВРаспределеннойИБ", ЭлементРасширение.ИспользуетсяВРаспределеннойИнформационнойБазе);
				СтруктураРасширения.Вставить("ИспользоватьОсновныеРолиДляВсехПользователей", ЭлементРасширение.ИспользоватьОсновныеРолиДляВсехПользователей);
				СтруктураРасширений.Вставить(ЭлементРасширение.Имя, СтруктураРасширения);
				
			КонецЦикла; 
		
		#Иначе
			
			МассивПоискаРасширений.Добавить("Подсистема.КонтурEDI");
			
			Для Каждого Элемент Из МассивПоискаРасширений Цикл
				
				ОбъектРасширения = Метаданные.НайтиПоПолномуИмени(Элемент);
				Если ОбъектРасширения <> Неопределено Тогда
					
					СтруктураРасширения = СбисПолучитьПустоеСведениеОРасширении();
					СтруктураРасширения.Вставить("Имя", ОбъектРасширения.Имя);
					СтруктураРасширений.Вставить(ОбъектРасширения.Имя, СтруктураРасширения);
					
				КонецЕсли; 
				
			КонецЦикла;
			
		#КонецЕсли    
		
	Исключение 
		
		// Обработка исключения
		
	КонецПопытки;
	
	ПараметрыСистемы.Конфигурация.Вставить("Расширение", СтруктураРасширений);	

КонецПроцедуры  


&НаСервере
Функция СбисПолучитьПустоеСведениеОРасширении() Экспорт
	
	СтруктураСведения = Новый Структура();
	СтруктураСведения.Вставить("Имя");
	СтруктураСведения.Вставить("Версия");
	СтруктураСведения.Вставить("Назначение");
	СтруктураСведения.Вставить("Активно");
	СтруктураСведения.Вставить("БезопасныйРежим");
	СтруктураСведения.Вставить("ЗащитаОтОпасныхДействий");
	СтруктураСведения.Вставить("ИспользуетсяВРаспределеннойИБ");
	СтруктураСведения.Вставить("ОбластьДействия");
	СтруктураСведения.Вставить("ИспользоватьОсновныеРолиДляВсехПользователей");
	
	Возврат СтруктураСведения;

КонецФункции

//Возвращает режим использования обработки: Во внешнем файле или в справочнике
&НаСервере
Функция ПолучитьРежимИспользованияОбработки(ПолноеИмяОбработки) Экспорт
		
	Если Прав(ПолноеИмяОбработки, 3) = "epf" Тогда
		РежимИспользования = "Файл внешней обработки";
	Иначе
		РежимИспользования = "Обработка в справочнике внешних обработок";
	КонецЕсли;
	Возврат РежимИспользования;
	
КонецФункции

//Возвращает полное имя файла обработки.
&НаСервере
Функция сбисПолноеИмяФайла(сбисПараметрыСистемы) Экспорт

	ОбработкаОбъектМодуль = МодульОбъектаСервер();
	Попытка
		Возврат ОбработкаОбъектМодуль.ИспользуемоеИмяФайла;	//Для файла
	Исключение
		Возврат Строка(ТипЗнч(ОбработкаОбъектМодуль));		//Для встройки в конфу
	КонецПопытки;

КонецФункции

//Возвращает строковое представление типа платформы сервера.
&НаСервере
Функция ТипПлатфтормыСервер(Знач СистемнаяИнформация)
	
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда
		Возврат "Linux_x86";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда
		Возврат "Linux_x86_64";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
		Возврат "Windows_x86";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		Возврат "Windows_x86_64";
	Иначе//Смотрим версию. Если ниже 8.3.7.1845, то маков нет
		Если сбисНоваяВерсия(СистемнаяИнформация.ВерсияПриложения, "8.3.7.1844") Тогда
			Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86 Тогда
				Возврат "MacOS_x86";
			ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86_64 Тогда
				Возврат "MacOS_x86_64";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат "";
	
КонецФункции

&НаКлиенте
Функция РежимЗапускаПриложения()
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Возврат "ТолстыйКлиентОбычноеПриложение";
	#ИначеЕсли ВебКлиент Тогда
		Возврат "ВебКлиент";
	#ИначеЕсли ТонкийКлиент Тогда
		Возврат "ТонкийКлиент";
	#ИначеЕсли ТолстыйКлиентУправляемоеПриложение Тогда
		Возврат "ТолстыйКлиентУправляемоеПриложение";
	#ИначеЕсли Сервер Тогда
		Возврат "Сервер";	
	#ИначеЕсли ВнешнееСоединение Тогда
		Возврат "ВнешнееСоединение";
	#КонецЕсли
КонецФункции

&НаСервере
Функция СбисНоваяВерсия(Знач ВерсияНовая, Знач ВерсияТекущая, Знач ДопПараметры = Неопределено) Экспорт 
	
	Возврат СравнитьВерсииБольшеМеньше(ВерсияТекущая, ВерсияНовая);

КонецФункции	

//Возвращает строковое представление типа платформы клиента.
&НаКлиенте
Функция ТипПлатфтормыКлиент(СистемнаяИнформация)
	
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда
		Возврат "Linux_x86";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда
		Возврат "Linux_x86_64";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
		Возврат "Windows_x86";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		Возврат "Windows_x86_64";
	Иначе//Смотрим версию. Если ниже 8.3.7.1845, то маков нет
		Если сбисНоваяВерсия(СистемнаяИнформация.ВерсияПриложения, "8.3.7.1844") Тогда
			Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86 Тогда
				Возврат "MacOS_x86";
			ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86_64 Тогда
				Возврат "MacOS_x86_64";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат "";
	
КонецФункции

