
////////////////////////////////////////////////////
//////////////////Параметры системы/////////////////
////////////////////////////////////////////////////

//Структура с описанием текущей системы. Параметры получаются для текущей конфы.
//Вынесено в общее для сбора сразу всех данных на сервере
&НаКлиенте
Функция ПолучитьПараметрыСистемы() Экспорт
	
	СистемнаяИнформацияКлиент = Новый СистемнаяИнформация;
	ПараметрыСистемы = Новый Структура(
		 "Сервер,			 Клиент,			 Конфигурация,		 Обработка,			 Пользователь",
		 Новый Структура,	 Новый Структура,	 Новый Структура,	 Новый Структура,	 Новый Структура);
	ЭтотМодульОбъект = МодульОбъектаКлиент();
		
	Попытка
		//Данные о клиенте
		ПараметрыСистемы.Клиент.Вставить("УправляемоеПриложение",	ТипЗнч(ЭтотМодульОбъект) = Тип("УправляемаяФорма"));
		ПараметрыСистемы.Клиент.Вставить("ВерсияПриложения",		СистемнаяИнформацияКлиент.ВерсияПриложения);
		ПараметрыСистемы.Клиент.Вставить("ТипОС", 					ТипПлатфтормыКлиент(СистемнаяИнформацияКлиент));
		ПараметрыСистемы.Клиент.Вставить("ЭтоLinux",				НРег(Лев(ПараметрыСистемы.Клиент.ТипОС, 5)) = "linux");
		ПараметрыСистемы.Клиент.Вставить("РежимЗапускаПриложения",	РежимЗапускаПриложения());
		//Данные о конфигурации
		ПараметрыСистемы.Конфигурация.Вставить("URL",		СтрокаСоединенияИнформационнойБазы());
		ПараметрыСистемы.Конфигурация.Вставить("Файловая",	Булево(Найти(ПараметрыСистемы.Конфигурация.URL, "File=")));
		//Данные об обработке
		
#Область include_sys_version
#КонецОбласти
		
		ВерсияОбработкиКратко = СтрЗаменить(СбисВерсия, ".", Символы.ПС);
		ВерсияОбработкиКратко = СтрПолучитьСтроку(ВерсияОбработкиКратко, 1) + "." + СтрПолучитьСтроку(ВерсияОбработкиКратко, 2);
		ВерсияПлатформыКратко = СтрЗаменить(ПараметрыСистемы.Клиент.ВерсияПриложения, ".", Символы.ПС);
		ВерсияПлатформыКратко = СтрПолучитьСтроку(ВерсияПлатформыКратко, 1) + СтрПолучитьСтроку(ВерсияПлатформыКратко, 2);
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ПараметрыСистемы.Клиент.Вставить("УправляемоеПриложение",	Ложь);
			ИмяПродуктаСБИС	= "vo2_1c_82_of";
			СбисИмяОбработки = Строка(ЭтотМодульОбъект);
			СбисПутьКФормам = "";
		#Иначе
			ПараметрыСистемы.Клиент.Вставить("УправляемоеПриложение",	Истина);
			ИмяПродуктаСБИС	= "vo2_1c_83_uf";
			СбисИмяФормы = СтрЗаменить(ЭтотМодульОбъект.ИмяФормы, ".", Символы.ПС);
			СбисИмяОбработки = СтрПолучитьСтроку(СбисИмяФормы, 1) + ".";
			Шаг = 2;
			Пока Шаг < СтрЧислоСтрок(СбисИмяФормы) - 1 Цикл
				СбисИмяОбработки = СбисИмяОбработки + СтрПолучитьСтроку(СбисИмяФормы, Шаг) + ".";
				Шаг = Шаг + 1;
			КонецЦикла;
			СбисПутьКФормам = СтрПолучитьСтроку(СбисИмяФормы, Шаг) + ".";
		#КонецЕсли
		ПараметрыСистемы.Обработка.Вставить("Версия",		СбисВерсия);
		ПараметрыСистемы.Обработка.Вставить("ПолноеИмя",	СбисИмяОбработки);
		ПараметрыСистемы.Обработка.Вставить("ИмяПродукта",	ИмяПродуктаСБИС);
		ПараметрыСистемы.Обработка.Вставить("КлючФорм",		СбисПутьКФормам);
		ПараметрыСистемы.Обработка.Вставить("КраткаяВерсия","VO" + ВерсияПлатформыКратко + ?(ПараметрыСистемы.Клиент.УправляемоеПриложение, "UF", "OF") + ВерсияОбработкиКратко);

		//Данные о сервере
		ЗаполнитьПараметрыСистемыНаСервере(ПараметрыСистемы);
		ПараметрыСистемы.Обработка.Вставить("ПолнаяВерсия",	"1C" + ПараметрыСистемы.Сервер.ВерсияПриложения + "_VO" + ВерсияОбработкиКратко);  
		
		//Данные по UserAgent для API методов
		ПараметрыСистемы.Обработка.Вставить("UserAgent",	"Saby1C" + "VO2" + ?(ПараметрыСистемы.Клиент.УправляемоеПриложение, "83UF", "82OF") + "/" + ВерсияОбработкиКратко);
	Исключение
		
		ОшибкаПолученияПараметров = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ПолучитьПараметрыСистемы");
		ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаПолученияПараметров);
		
	КонецПопытки;
			
	Возврат	ПараметрыСистемы;	
	
КонецФункции

&НаСервере
Функция ОпределитьУИДСистемы()
	Перем УидСистемыСтарый;
	
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		ИмяПродукта = МодульОбъекта().ИмяПродукта();
		
		// Если есть по старому пути, то переместить
		ПараметрыИнтеграцииПоСтаромуПути = ХранилищеОбщихНастроек.Загрузить("Integration", "Integration", "Integration", "СБИС");
		Если Не  ПараметрыИнтеграцииПоСтаромуПути = Неопределено Тогда
			УидСистемы = ПараметрыИнтеграцииПоСтаромуПути.Получить("integration_uuid");
			ОбщиеНастройки = ХранилищеОбщихНастроек.Загрузить(ИмяПродукта, "params",,ИмяПродукта);
			Если ТипЗнч(ОбщиеНастройки) <> Тип("Структура") Тогда
				ОбщиеНастройки = Новый Структура;
			КонецЕсли;
			ОбщиеНастройкиСтарые = ХранилищеОбщихНастроек.Загрузить("SABY", "params",,"SABY");
			// Переложим ExtSysUid ВО3 в ExtSysUidOld
			Если ОбщиеНастройки.Свойство("ExtSysUid") И Не ОбщиеНастройки.Свойство("ExtSysUidOld") Тогда
				ExtSysUidOld = ОбщиеНастройки.ExtSysUid;
				Если ТипЗнч(ОбщиеНастройкиСтарые) = Тип("Структура") И ОбщиеНастройкиСтарые.Свойство("ExtSysUid")
					И ОбщиеНастройки.ExtSysUid <> ОбщиеНастройкиСтарые.ExtSysUid Тогда
					ExtSysUidOld = ExtSysUidOld + "," + ОбщиеНастройкиСтарые.ExtSysUid;
				КонецЕсли;
				ОбщиеНастройки.Вставить("ExtSysUidOld", ExtSysUidOld);
			КонецЕсли;         
			
			ОбщиеНастройки.Вставить("ExtSysUid", УидСистемы);
			ХранилищеОбщихНастроек.Сохранить(ИмяПродукта, "params", ОбщиеНастройки,,ИмяПродукта);
			ХранилищеОбщихНастроек.Удалить("Integration", "Integration", "СБИС");
			
		КонецЕсли;
		
		ПараметрыИнтеграции = ХранилищеОбщихНастроек.Загрузить(ИмяПродукта, "params",,ИмяПродукта);
		Если ПараметрыИнтеграции = Неопределено Тогда
			ПараметрыИнтеграции = Новый Структура;
		КонецЕсли;
		Если ПараметрыИнтеграции.Свойство("ExtSysUid") Тогда
			УидСистемы = ПараметрыИнтеграции.ExtSysUid;
		Иначе
			УидСистемы = Строка(Новый УникальныйИдентификатор);
			ПараметрыИнтеграции.Вставить("ExtSysUid", УидСистемы);
			ХранилищеОбщихНастроек.Сохранить(ИмяПродукта, "params",, ПараметрыИнтеграции,,ИмяПродукта);
		КонецЕсли;
		Если ПараметрыИнтеграции.Свойство("ExtSysUidOld") Тогда
			УидСистемыСтарый = ПараметрыИнтеграции.ExtSysUidOld;
		КонецЕсли;
	    УстановитьПривилегированныйРежим(Ложь);
	Исключение
		УидСистемы = "";
	КонецПопытки;
	
	Возврат Новый ФиксированнаяСтруктура("УидСистемы, УидСистемыСтарый", УидСистемы, УидСистемыСтарый);
			
КонецФункции

&НаСервере
Процедура ЗаполнитьПараметрыСистемыНаСервере(ПараметрыСистемы)
	Перем УидСистемы, УидСистемыСтарый;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;

	ВстроенныйЯзыкКонфигурации = "ru";
	//Для анлгоязычных систем переопределим язык для проверки функций
	Если    Найти(Строка(Метаданные), "Metadata")
		Или	Найти(Истина, "Yes") Тогда
		
		//Локализация//
		// Пока проверить только на английский. Расширить при необходимости.
		ВстроенныйЯзыкКонфигурации = "en";
		
	КонецЕсли;	
	ПараметрыСистемы.Конфигурация.Вставить("ВстроенныйЯзык", ВстроенныйЯзыкКонфигурации);
	
	РежимСовместимостиСтрокой = Строка(Метаданные.РежимСовместимости);
	Если РежимСовместимостиСтрокой = НСтр("ru=НеИспользовать; en=DontUse", ВстроенныйЯзыкКонфигурации) Тогда
		
		РежимСовместимостиВерсия = СистемнаяИнформация.ВерсияПриложения;
		
	Иначе
		
		РежимСовместимостиРазбит	= СтрЗаменить(РежимСовместимостиСтрокой, "_", Символы.ПС);
		РежимСовместимостиВерсия	= "";
		СимволыВерсии				= "0123456789";
		Для СтрНомерСтроки = 1 По СтрЧислоСтрок(РежимСовместимостиРазбит) Цикл
			
			РазрядВерсии				= СтрПолучитьСтроку(РежимСовместимостиРазбит, СтрНомерСтроки);
			РежимСовместимостиВерсия	= РежимСовместимостиВерсия + "." + МодульОбъектаСервер().ПрименитьФорматКСтроке(РазрядВерсии, СимволыВерсии, "Оставить");
			
		КонецЦикла;
		РежимСовместимостиВерсия = Сред(РежимСовместимостиВерсия, 2);

	КонецЕсли;
	
	//На толстом клиенте пока берем системную информацию клиента.
	ПараметрыСистемы.Сервер.Вставить("ТипОС", 				ТипПлатфтормыСервер(СистемнаяИнформация));
	ПараметрыСистемы.Сервер.Вставить("ВерсияПриложения",	СистемнаяИнформация.ВерсияПриложения);
	ПараметрыСистемы.Сервер.Вставить("ЭтоLinux",			НРег(Лев(ПараметрыСистемы.Сервер.ТипОС, 5)) = "linux");
	
	Попытка
		
		ПрочитатьПараметрыSABYИзХранилищаНастроек("Тест");
		ЕстьДоступКОбщемуХранилищу = Истина;
		
	Исключение
		
		ОшибкаЧтения = МодульОбъектаСервер().НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ПрочитатьПараметрыSABYИзХранилищаНастроек", 501);
		ЕстьДоступКОбщемуХранилищу = Ложь;
		
	КонецПопытки;
	ПараметрыСистемы.Пользователь.Вставить("ДоступноОбщееХранилище", ЕстьДоступКОбщемуХранилищу);
	
	//Получаем системные параметры файла обработки	
	ОбработкаОбъектМодуль	= МодульОбъектаСервер();
	МетаданныеОбработки		= ОбработкаОбъектМодуль.Метаданные();
	
	ИмяФайлаДляПолучить		= Новый Структура("ИспользуемоеИмяФайла");
	ЗаполнитьЗначенияСвойств(ИмяФайлаДляПолучить, ОбработкаОбъектМодуль);
	Если ИмяФайлаДляПолучить.ИспользуемоеИмяФайла = Неопределено Тогда
		
		ПолноеИмяОбработки	= Строка(ОбработкаОбъектМодуль);
		Если Найти(ПолноеИмяОбработки, НСтр("ru=Объект; en=Object", ПараметрыСистемы.Конфигурация.ВстроенныйЯзык)) Тогда
			
			РежимИспользования = "Конфигурация";
			
		Иначе
			
			РежимИспользования = "Справочник";

		КонецЕсли;

	ИначеЕсли	Лев(ИмяФайлаДляПолучить.ИспользуемоеИмяФайла, 5) = "e1cib"
			Или	Прав(ИмяФайлаДляПолучить.ИспользуемоеИмяФайла, 4) = ".tmp" Тогда
		
		РежимИспользования	= "Справочник";
		ПолноеИмяОбработки	= Строка(ОбработкаОбъектМодуль);
		
	Иначе
		
		РежимИспользования	= "Файл";
		ПолноеИмяОбработки	= ИмяФайлаДляПолучить.ИспользуемоеИмяФайла;

	КонецЕсли;
	
	ПараметрыСистемы.Обработка.Вставить("Имя",						МетаданныеОбработки.Имя);
	ПараметрыСистемы.Обработка.Вставить("Синином",					МетаданныеОбработки.Синоним);
	ПараметрыСистемы.Обработка.Вставить("ПолноеИмяОбработки",		ПолноеИмяОбработки);
	ПараметрыСистемы.Обработка.Вставить("РежимИспользования",		РежимИспользования);
	
	ДанныеУИДСИстемы = ОпределитьУИДСистемы();
		
	ПараметрыСистемы.Конфигурация.Вставить("Имя",					Метаданные.Имя);
	ПараметрыСистемы.Конфигурация.Вставить("КраткаяИнформация",		Метаданные.КраткаяИнформация);
	ПараметрыСистемы.Конфигурация.Вставить("ПодробнаяИнформация",	Метаданные.ПодробнаяИнформация);
	ПараметрыСистемы.Конфигурация.Вставить("ВстроенныйЯзык",		ВстроенныйЯзыкКонфигурации);
	ПараметрыСистемы.Конфигурация.Вставить("РежимСовместимости",	РежимСовместимостиВерсия);
	ПараметрыСистемы.Конфигурация.Вставить("Версия",				Метаданные.Версия);
	ПараметрыСистемы.Конфигурация.Вставить("УИДИнтеграции",			ДанныеУИДСИстемы.УидСистемы);
	
	Если ЗначениеЗаполнено(ДанныеУИДСИстемы.УидСистемыСтарый) Тогда
		
		ПараметрыСистемы.Конфигурация.Вставить("УИДИнтеграцииСтарый", ДанныеУИДСИстемы.УидСистемыСтарый);
		
	КонецЕсли;
	ПолучитьСведенияОРасширениях(ПараметрыСистемы);

	//Для возможности записи в ИдПользователя для способов интеграции SDK2 и Каталог
	ПараметрыСистемы.Клиент.Вставить("ИдПользователяИБ", 	ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);

КонецПроцедуры

&НаСервере
Процедура ПолучитьСведенияОРасширениях(ПараметрыСистемы) Экспорт
	
	СтруктураРасширений = Новый Структура;
	МассивПоискаРасширений = Новый Массив;  
			
	МассивПоискаРасширений.Добавить("Подсистема.КонтурEDI");
	
	Для Каждого Элемент Из МассивПоискаРасширений Цикл
		
		ОбъектРасширения = Метаданные.НайтиПоПолномуИмени(Элемент);
		Если Не ОбъектРасширения = Неопределено Тогда
			
			СтруктураРасширения = СбисПолучитьПустоеСведениеОРасширении();
			СтруктураРасширения.Вставить("Имя", ОбъектРасширения.Имя);
			СтруктураРасширений.Вставить(ОбъектРасширения.Имя, СтруктураРасширения);
			
		КонецЕсли; 
		
	КонецЦикла;

	
	ПараметрыСистемы.Конфигурация.Вставить("Расширение", СтруктураРасширений);	

КонецПроцедуры  

&НаСервере
Функция СбисПолучитьПустоеСведениеОРасширении() Экспорт
	
	СтруктураСведения = Новый Структура();
	СтруктураСведения.Вставить("Имя");
	СтруктураСведения.Вставить("Версия");
	СтруктураСведения.Вставить("Назначение");
	СтруктураСведения.Вставить("Активно");
	СтруктураСведения.Вставить("БезопасныйРежим");
	СтруктураСведения.Вставить("ЗащитаОтОпасныхДействий");
	СтруктураСведения.Вставить("ИспользуетсяВРаспределеннойИБ");
	СтруктураСведения.Вставить("ОбластьДействия");
	СтруктураСведения.Вставить("ИспользоватьОсновныеРолиДляВсехПользователей");
	
	Возврат СтруктураСведения;

КонецФункции

//Возвращает строковое представление типа платформы сервера.
&НаСервере
Функция ТипПлатфтормыСервер(Знач СистемнаяИнформация)
	
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда
		Возврат "Linux_x86";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда
		Возврат "Linux_x86_64";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
		Возврат "Windows_x86";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		Возврат "Windows_x86_64";
	Иначе//Смотрим версию. Если ниже 8.3.7.1845, то маков нет
		Если сбисНоваяВерсия(СистемнаяИнформация.ВерсияПриложения, "8.3.7.1844") Тогда
			Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86 Тогда
				Возврат "MacOS_x86";
			ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86_64 Тогда
				Возврат "MacOS_x86_64";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат "";
	
КонецФункции

&НаКлиенте
Функция РежимЗапускаПриложения()
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Возврат "ТолстыйКлиентОбычноеПриложение";
	#ИначеЕсли ВебКлиент Тогда
		Возврат "ВебКлиент";
	#ИначеЕсли ТонкийКлиент Тогда
		Возврат "ТонкийКлиент";
	#ИначеЕсли ТолстыйКлиентУправляемоеПриложение Тогда
		Возврат "ТолстыйКлиентУправляемоеПриложение";
	#ИначеЕсли Сервер Тогда
		Возврат "Сервер";	
	#ИначеЕсли ВнешнееСоединение Тогда
		Возврат "ВнешнееСоединение";
	#КонецЕсли
КонецФункции

&НаСервере
Функция СбисНоваяВерсия(Знач ВерсияНовая, Знач ВерсияТекущая, Знач ДопПараметры = Неопределено) Экспорт 
	
	Если ТипЗнч(ДопПараметры) =  Тип("Структура") Тогда
		
		Если ДопПараметры.Свойство("КоличествоСимволовДляСравнения") Тогда 
			
			КоличествоСимволов = ДопПараметры.КоличествоСимволовДляСравнения; 
			ВерсияТекущая 	= Лев(ВерсияТекущая, КоличествоСимволов);
			ВерсияНовая 	= Лев(ВерсияНовая, КоличествоСимволов);
			
		КонецЕсли;
		
	КонецЕсли;	
	Возврат СравнитьВерсииБольшеМеньше(ВерсияТекущая, ВерсияНовая);

КонецФункции	

//Возвращает строковое представление типа платформы клиента.
&НаКлиенте
Функция ТипПлатфтормыКлиент(СистемнаяИнформация)
	
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда
		Возврат "Linux_x86";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда
		Возврат "Linux_x86_64";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
		Возврат "Windows_x86";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		Возврат "Windows_x86_64";
	Иначе//Смотрим версию. Если ниже 8.3.7.1845, то маков нет
		Если сбисНоваяВерсия(СистемнаяИнформация.ВерсияПриложения, "8.3.7.1844") Тогда
			Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86 Тогда
				Возврат "MacOS_x86";
			ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86_64 Тогда
				Возврат "MacOS_x86_64";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат "";
	
КонецФункции

