
//НЕ РАБОТА ПО РАСПИСАНИЮ. Это обработчик периодических операций - раз в пару минут, +-10 секунд. Гарантированной точности в промежутках нет
&НаКлиенте
Процедура ВыполнитьОтложенныеПроцедуры() Экспорт
	Перем ЦепочкаКомандОбработки;
	
	сбисОтложенныеОперации	= ГлобальныйКэш.ТекущийСеанс.сбисОтложенныеОперации;
	ОтложенныеПроцедуры		= сбисОтложенныеОперации.Процедуры;
	РежимОтладки			= ПолучитьЗначениеПараметраСбис("РежимОтладки");
	ФункцииДокументов		= ПолучитьЗначениеПараметраСбис("ФункцииДокументов");
	
	Если Не сбисОтложенныеОперации.Запущено Тогда
		
		Возврат;
		
	КонецЕсли;
	//Начало обработки
	сбисОтложенныеОперации.ПоследнийВызовМС = ПолучитьДатуВМиллисекундах(); 
	Если РежимОтладки Тогда
		лОтладочныеДанные = Новый Структура(
		"Тип,		Модуль,					Вызов,							Время,			Идентификатор,	Сообщение", 
		"START",	"МодульОбъектаКлиент",	"ВыполнитьОтложенныеПроцедуры",	ТекущаяДата(),	"Begin",		"");
		ДанныеВЛог = Новый Массив;
		ДанныеВЛог.Добавить(лОтладочныеДанные);
		СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ДанныеВЛог));
	КонецЕсли;
	ОтложенныеПроцедурыОчистить = Новый Массив;
	СледующийВызов = сбисОтложенныеОперации.МаксимальныйПериод;
	//Выполним что можно
	Для Каждого КлючИЗначение Из ОтложенныеПроцедуры Цикл
		ВыполняемаяОперация = КлючИЗначение.Значение;
		ИдТекущейОперации	= ОтложенноеДействие_Получить(ВыполняемаяОперация, "Идентификатор");
		
		Если	ВыполняемаяОперация.Запущен // Операция уже выполняется
			Или	ОтложенноеДействие_Получить(ВыполняемаяОперация, "СледующийВызовМС") > сбисОтложенныеОперации.ПоследнийВызовМС Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Попытка
			ВремяНачала			= ТекущаяДата();
			ПоследнийВызовМС	= ПолучитьДатуВМиллисекундах();
			ОтложенноеДействие_Установить(ВыполняемаяОперация, "ПоследнийВызовМС", ПоследнийВызовМС);
			
			ЦепочкаКомандОбработки	= ОтложенноеДействие_Получить(ВыполняемаяОперация, "ЦепочкаКомандОбработки");
			Если Не ЦепочкаКомандОбработки = Неопределено Тогда
				
				// Это обработчик отложенной цепочки команд. Установить запуск команде
				ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Запуск");
				
			КонецЕсли;
			ВыполняемаяОперация.Запущен = Истина;
			ВыполнитьСбисОписаниеОповещения(ВыполняемаяОперация.Аргумент, ВыполняемаяОперация.ОписаниеОповещения);
			ВыполняемаяОперация.Запущен = Ложь;
			
			Если ГлобальныйКэш = Неопределено Тогда
				
				// Глобальный кэш очищен, остановить выполнение операций.
				Возврат;
				
			КонецЕсли;
			
		Исключение
			
			Если ГлобальныйКэш = Неопределено Тогда
				
				// Глобальный кэш очищен, остановить выполнение операций.
				Возврат;
				
			КонецЕсли;
			
			ИнфоОбОшибке = ИнформацияОбОшибке();
			РезультатОшибка = НовыйСбисИсключение(ИнфоОбОшибке, "МодульОбъектаКлиент.ВыполнитьОтложенныеПроцедуры");
			Если сбисОтложенныеОперации.СообщатьПриОшибке Тогда
				СообщитьСбисИсключение(РезультатОшибка, Новый Структура("ФормаВладелец", ГлавноеОкно));
			КонецЕсли;
			Если РежимОтладки Тогда
				лОтладочныеДанные = Новый Структура(
				"Тип,		Модуль,					Вызов,												Время,			Идентификатор,		Сообщение", 
				"ERROR",	"МодульОбъектаКлиент",	ВыполняемаяОперация.ОписаниеОповещения.ИмяПроцедуры,ТекущаяДата(),	ИдТекущейОперации,	РезультатОшибка);
				ДанныеВЛог = Новый Массив;
				ДанныеВЛог.Добавить(лОтладочныеДанные);
				СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ДанныеВЛог));
			КонецЕсли;
			
			//В случае ошибки - падения выполнения кода, удалить обработчик
			ОтложенныеПроцедурыОчистить.Добавить(КлючИЗначение.Ключ);
			Продолжить;
			
		КонецПопытки;
		
		ЧислоВызовов = ОтложенноеДействие_Получить(ВыполняемаяОперация, "ЧислоВызовов");
		Если Не ЧислоВызовов = Неопределено Тогда
			ЧислоВызовов = ЧислоВызовов - 1;
		КонецЕсли;

		Если РежимОтладки Тогда
			
			ТекстСообщенияЛог = "Время выполнения: " + Окр(((ПолучитьДатуВМиллисекундах() - ПоследнийВызовМС)/1000), 2) + ".";
			Если ЧислоВызовов = Неопределено Тогда
				ТекстСообщенияЛог = ТекстСообщенияЛог + " Выполняется бесконечно.";
			Иначе
				ТекстСообщенияЛог = ТекстСообщенияЛог + " Осталось вызовов: " + ЧислоВызовов;
			КонецЕсли;
			лОтладочныеДанные = Новый Структура(
			"Тип,		Модуль,					Вызов,												Время,			Идентификатор,		Сообщение", 
			"SUСCESS",	"МодульОбъектаКлиент",	ВыполняемаяОперация.ОписаниеОповещения.ИмяПроцедуры,ВремяНачала,	ИдТекущейОперации,	ТекстСообщенияЛог);
			ДанныеВЛог = Новый Массив;
			ДанныеВЛог.Добавить(лОтладочныеДанные);
			СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ДанныеВЛог));
			
		КонецЕсли;
		
		Если	Не	ЧислоВызовов = Неопределено
			И		ЧислоВызовов < 1 Тогда

			ОтложенныеПроцедурыОчистить.Добавить(КлючИЗначение.Ключ);
			ВыполняемаяОперация.Завершен = Истина;

		КонецЕсли;
		ОтложенноеДействие_Установить(ВыполняемаяОперация, "ЧислоВызовов", ЧислоВызовов);
		
	КонецЦикла;
	
	//Очистим те, что уже отработали, либо упали с ошибкой
	Для Каждого КлючОчистить Из ОтложенныеПроцедурыОчистить Цикл
		ЗавершеннаяОперация = ОтложенныеПроцедуры.Получить(КлючОчистить);
		// Если операция продлевала/перезапускала саму себя, то операция по ключу и завершенная не совпадут
		Если Не ЗавершеннаяОперация = Неопределено
			И	ЗавершеннаяОперация.Завершен Тогда 
			ОтложенныеПроцедуры.Удалить(КлючОчистить);
		КонецЕсли;
	КонецЦикла;
	
	//Обновить сроки вызова с учетом задержки выполнения
	//сбисОтложенныеОперации.ПоследнийВызовМС = ПолучитьДатуВМиллисекундах(); 
	Если ОтложенныеПроцедуры.Количество() Тогда
		//Операции могли в процессе появится. Обновим периоды с их учетом
		Для Каждого КлючИЗначение Из ОтложенныеПроцедуры Цикл
			ВыполняемаяОперация			= КлючИЗначение.Значение;
			СледующийВызовМСОперации	= ПрикладнойОбъектSABY_Получить(ВыполняемаяОперация, "СледующийВызовМС");
			ПоследнийВызовМС			= ПрикладнойОбъектSABY_Получить(ВыполняемаяОперация, "ПоследнийВызовМС");
			
			Если 	ВыполняемаяОперация.Запущен
				Или ВыполняемаяОперация.Завершен Тогда
				
				Продолжить; // Если операция запущена, то она не учитывается в рассчете периода запуска
				
			КонецЕсли;
			Если СледующийВызовМСОперации > сбисОтложенныеОперации.ПоследнийВызовМС Тогда
				
				ОбновитьПериодСледующегоВызова(СледующийВызов, ВыполняемаяОперация, сбисОтложенныеОперации);
				Продолжить;
				
			КонецЕсли;
			
			Если ПоследнийВызовМС = Неопределено Тогда
				
				//Сразу вызываем, т.к. есть команда, которая еще не обрабатывалась
				СледующийВызов = 0;
				Прервать;
				
			КонецЕсли;
			
			//Операция требуется еще, определим время следующего вызова, но не более максимального срока.
			СледующийВызовМСОперации	= ПоследнийВызовМС
										+ ПрикладнойОбъектSABY_Получить(ВыполняемаяОперация, "ПериодичностьМС");
			ПрикладнойОбъектSABY_Установить(ВыполняемаяОперация, "СледующийВызовМС", СледующийВызовМСОперации);
			ОбновитьПериодСледующегоВызова(СледующийВызов, ВыполняемаяОперация, сбисОтложенныеОперации);
		КонецЦикла;
	
		ВремяОбработки = Окр((ПолучитьДатуВМиллисекундах() - сбисОтложенныеОперации.ПоследнийВызовМС)/1000, 2);
		СледующийВызов = СледующийВызов - ВремяОбработки;
		
		Если СледующийВызов <= 0 Тогда
			
			СледующийВызов = 0.1;
			
		КонецЕсли;
		
		ГлавноеОкно.ПодключитьОбработчикОжидания("ВыполнениеОтложенныхПроцедур", СледующийВызов, Истина);
		
		Если РежимОтладки Тогда
			
			лОтладочныеДанные = Новый Структура(
			"Тип,	Модуль,					Вызов,							Время,			Идентификатор,		Сообщение", 
			"END",	"МодульОбъектаКлиент",	"ВыполнитьОтложенныеПроцедуры",	ТекущаяДата(),	"That's all folks",	"Следующий вызов: " + СледующийВызов);
			ДанныеВЛог = Новый Массив;
			ДанныеВЛог.Добавить(лОтладочныеДанные);
			СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ДанныеВЛог));
			
		КонецЕсли;
		
	Иначе
	
		сбисОтложенныеОперации.Запущено = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПериодСледующегоВызова(СледующийВызов, ВыполняемаяОперация, сбисОтложенныеОперации)
	
	СледующийВызовМС = ПрикладнойОбъектSABY_Получить(ВыполняемаяОперация, "СледующийВызовМС");
	СледующийВызовДляОперацииПотребуется = Окр((СледующийВызовМС - сбисОтложенныеОперации.ПоследнийВызовМС)/1000, 2);
	Если СледующийВызов > СледующийВызовДляОперацииПотребуется Тогда
		
		СледующийВызов = СледующийВызовДляОперацииПотребуется;
		
	КонецЕсли;
	
КонецПроцедуры

