
&НаКлиенте
Функция СбисПолучитьТикетДляАккаунта(Кэш, ПараметрыПолученияТикета, Отказ) Экспорт

	ИдДокумента = ПараметрыПолученияТикета.ИдДокумента;
	ИдАккаунта = ПараметрыПолученияТикета.ИдАккаунта;

	СтарыйИдСессии = Кэш.Парам.ИдентификаторСессии;

	Попытка		
		ЗаписанныеСессии = Кэш.СБИС.Сессии;
		КлючПользователя =  Кэш.СБИС.ПараметрыИнтеграции.КодСервиса+"_"+Кэш.СБИС.ПараметрыИнтеграции.ИдПользователя;
		СессииПользователя = ЗаписанныеСессии.Получить(КлючПользователя);
		СессияПользователяПоАккаунту = СессииПользователя.accounts.Получить(ИдАккаунта); 
		Если СессияПользователяПоАккаунту = Неопределено Тогда
			СписокАккаунтов = СбисПолучитьСписокАккаунтов();
			АккаунтПользователя = Ложь;
			Для каждого Аккаунт Из СписокАккаунтов Цикл
				Если Аккаунт.НомерАккаунта = ИдАккаунта Тогда
					АккаунтПользователя = Истина;
					Прервать;
				КонецЕсли;	
			КонецЦикла;

			Если Не АккаунтПользователя Тогда
				ВызватьСбисИсключение("Аккаунт документа не подключен для данного пользователя", "МодульОбъектаКлиент.СбисПолучитьТикетДляАккаунта");
			КонецЕсли; 

			СессияПользователяПоАккаунту = СбисПереключитьАккаунт(Кэш, Новый Структура("НомерАккаунта", ИдАккаунта), Новый Структура(), Ложь); 
			Если СессияПользователяПоАккаунту = Неопределено Тогда 
				ВызватьСбисИсключение("Не удалось получить сессию для аккаунта документа", "МодульОбъектаКлиент.СбисПолучитьТикетДляАккаунта"); 
			КонецЕсли;
			Кэш.Парам.ИдентификаторСессии = СессияПользователяПоАккаунту;
		Иначе
			Кэш.Парам.ИдентификаторСессии = СессияПользователяПоАккаунту;
			СессияДействительна = Кэш.Интеграция.сбисСессияДействительна(Кэш) = 1;
			Если Не СессияДействительна Тогда
				СессияПользователяПоАккаунту = СбисПереключитьАккаунт(Кэш, Новый Структура("НомерАккаунта", ИдАккаунта), Новый Структура(), Ложь); 
				Если СессияПользователяПоАккаунту = Неопределено Тогда 
					ВызватьСбисИсключение("Не удалось получить сессию для аккаунта документа", "МодульОбъектаКлиент.СбисПолучитьТикетДляАккаунта");
				КонецЕсли;
				Кэш.Парам.ИдентификаторСессии = СессияПользователяПоАккаунту;
			КонецЕсли;
		КонецЕсли;	

		Тикет = Кэш.Интеграция.ПолучитьТикетДляТекущегоПользователя(Кэш);

		//Кэш.Парам.ИдентиФикаторСессии = СтарыйИдСессии;
	Исключение
		Кэш.Парам.ИдентиФикаторСессии = СтарыйИдСессии;
		ИнфоОбОбшибке = ИнформацияОбОшибке();
		ВызватьСбисИсключение(ИнфоОбОбшибке, "МодульОбъектаКлиент.СбисПолучитьТикетДляАккаунта");	 
	КонецПопытки;
	Возврат Новый Структура("Тикет, СтарыйИдСессии", Тикет, СтарыйИдСессии);
КонецФункции	

&НаКлиенте
Процедура КомандаОткрытьДокументОнлайн (ОписаниеДокумента, ДопПараметры) Экспорт
	Кэш = ДопПараметры.Кэш;
	Результат = Новый Структура("Ссылка, Пакет", "");
	Попытка
		ПараметрыДокумента = Кэш.Интеграция.СБИС_ПолучитьПараметрыПакетаДляОткрытияОнлайн(ОписаниеДокумента.ПараметрыПакетаСБИС, Новый Структура("Кэш", Кэш));
		Если ЗначениеЗаполнено(ПараметрыДокумента.ИдДокумента) Тогда
			ДопПарам = Новый Структура("СообщатьПриОшибке, ВернутьОшибку", Ложь, Истина);
			СоставПакета = Кэш.Интеграция.ПрочитатьДокумент(Кэш, ПараметрыДокумента.ИдДокумента, ДопПарам);
			Если типЗнч(СоставПакета)= тип("Структура") И СоставПакета.Свойство("СсылкаДляНашаОрганизация") Тогда // alo
				Результат.Ссылка = СоставПакета.СсылкаДляНашаОрганизация;			
				Если ЗначениеЗаполнено(Результат.Ссылка) И Не ПараметрыДокумента.Тикет = "" Тогда
					Результат.Ссылка = Результат.Ссылка + "&ticket=" + ПараметрыДокумента.Тикет + "&nocheck=1";
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Кэш.Парам.СпособОбмена <> 1 
			И (НЕ Кэш.Парам.СоздаватьЧерновик ИЛИ ДопПараметры.Свойство("ОткрытьОнлайн")
			И ДопПараметры.ОткрытьОнлайн) Тогда //1189641556
			// загружаем пакет в кабинет без отправки << alo Меркурий 
			лРежимДиалога = РежимДиалогаВопрос.ДаНет;
			лТекстДиалога = "Документ не сопоставлен с Saby. Создать черновик?";
			сбисПараметрыСоздания= Новый Структура("Кэш, ОписаниеДокумента, Результат, ОбработчикРезультата", Кэш, ОписаниеДокумента, Результат, ДопПараметры.ОбработчикРезультата);
			ОбработчикДиалога = НовыйСбисОписаниеОповещения("КомандаОткрытьДокументОнлайн_ПослеДиалога", Кэш.ГлавноеОкно.МодульОбъектаКлиент(), сбисПараметрыСоздания);
			СбисПоказатьВопрос(ОбработчикДиалога, лТекстДиалога, лРежимДиалога, 0, КодВозвратаДиалога.Да);
			Возврат;
			// alo Меркурий >>
		//1189641556
		ИначеЕсли Кэш.Парам.СпособОбмена <> 1 И Кэш.Парам.СоздаватьЧерновик Тогда 
			ДопПараметры.ОбработчикРезультата.ДополнительныеПараметры.Вставить("СоздатьЧерновик",Истина); //1190434889
			сбисПараметрыСоздания= Новый Структура("Кэш, ОписаниеДокумента, Результат, ОбработчикРезультата", Кэш, ОписаниеДокумента, Результат, ДопПараметры.ОбработчикРезультата);
			КомандаОткрытьДокументОнлайн_ПослеДиалога(КодВозвратаДиалога.Да, СбисПараметрыСоздания);   
			Возврат;
		КонецЕсли;
		Если ПараметрыДокумента.Свойство("СтарыйИдСессии") Тогда
			Кэш.Парам.ИдентиФикаторСессии = ПараметрыДокумента.СтарыйИдСессии;
		КонецЕсли;	
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		Результат = Кэш.ОбщиеФункции.сбисИсключение(ИнфОбОшибке, "МодульОбъектаКлиент.ОткрытьДокументОнлайн");
		ДопПараметры.ОбработчикРезультата.ДополнительныеПараметры.Отказ = Истина;
	КонецПопытки;
	ВыполнитьСбисОписаниеОповещения(Результат, ДопПараметры.ОбработчикРезультата);

КонецПроцедуры	

&НаКлиенте
Процедура КомандаОткрытьДокументОнлайн_ПослеДиалога(Ответ, СбисПараметрыСоздания) Экспорт 
	Кэш = сбисПараметрыСоздания.Кэш;
	Попытка
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			ВыполнитьСбисОписаниеОповещения("Отменено пользователем", сбисПараметрыСоздания.ОбработчикРезультата);
			Возврат;
		КонецЕсли;
		Пакет = сбисПараметрыСоздания.ОписаниеДокумента.Пакет;
		ИниТекущегоРеестра = сбисПараметрыСоздания.Кэш.Текущий.ТипДок;
		
		ДанныеПакета = Новый Структура("ИмяИни, Документ1С, СоставПакета", ИниТекущегоРеестра, Пакет);
		ЗаполнитьЗначенияСвойств(ДанныеПакета, сбисПараметрыСоздания.Кэш.ТаблДок.ТекущиеДанные);
		ДанныеПакета.Вставить("НеЗапускатьВДокументооборот", Истина);
		// VAAl
		// Потом как нибудь перейдем на создание черновиков через новую отпраку, пока по старому
		// Новая отправка не дает ссылки на документ СБИС, так что тоже пока старая отправка
		// Надо переписывать на обработку асинхронных методов
		ДопПараметрыЧерновика = Новый Структура("Результат, ИспользоватьНовуюОтправку", сбисПараметрыСоздания.Результат, Ложь);
		СоздатьЧерновик(ДанныеПакета, ДопПараметрыЧерновика);
		
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		сбисПараметрыСоздания.Результат = НовыйСбисИсключение(ИнфОбОшибке, "МодульОбъектаКлиент.КомандаОткрытьДокументОнлайн_ПослеДиалога");
		СбисПараметрыСоздания.ОбработчикРезультата.ДополнительныеПараметры.Отказ = Истина;
	КонецПопытки;
	ВыполнитьСбисОписаниеОповещения(сбисПараметрыСоздания.Результат, СбисПараметрыСоздания.ОбработчикРезультата);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЧерновик(ДанныеПакета, ДопПараметры) Экспорт
	Перем ИспользоватьНовуюОтправку;
	
	Попытка
		МодульНастройки = ПолучитьЗначениеПараметраТекущегоСеанса("Настройки");
		Кэш = ПолучитьТекущийЛокальныйКэш();
		
		Если НЕ ДопПараметры.Свойство("ИспользоватьНовуюОтправку", ИспользоватьНовуюОтправку) Тогда
			ИспользоватьНовуюОтправку = ПолучитьЗначениеПараметраСбис("ИспользоватьНовуюОтправку");
		КонецЕсли;
		
		Пакет = ДанныеПакета.Документ1С;
		
		//Костыли пока черновик работает через старую отправку. В дальнейшем переделать на ЗапуститьМассовуюОтправкуДокументов
		Если Кэш.Свойство("РезультатОтправки") Тогда
			Кэш.Удалить("РезультатОтправки");
		КонецЕсли;
		
		Если ИспользоватьНовуюОтправку Тогда
			
			МодульПодготовкиДокумента = НайтиФункциюСеансаОбработки("ПодготовитьСтруктуруДокумента", Кэш.Текущий.ФормыРаздела);
			МассивДокументов = МодульПодготовкиДокумента.ПодготовитьСтруктуруДокумента(ДанныеПакета, Кэш);
			
			Если МассивДокументов = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			МодульОткрытияДокумента = НайтиФункциюСеансаОбработки("ПоказатьДокумента", Кэш.Текущий.ФормыРаздела);
			ДопПараметрыЗаписи = Новый Структура("ОбработчикРезультата", ДопПараметры.ОбработчикРезультата);
			Для каждого СоставПакета Из МассивДокументов Цикл
				СоставПакета_Записать(СоставПакета, ДопПараметрыЗаписи);
			КонецЦикла;
			
		Иначе
			// old
			СоставПакетаОтправить = Новый Структура("СоставПакета, НеЗапускатьВДокументооборот");
			ЗаполнитьЗначенияСвойств(СоставПакетаОтправить, ДанныеПакета);
			
			СписокОтмеченныхДокументов = Новый Массив;
			СписокОтмеченныхДокументов.Добавить(СоставПакетаОтправить);
			
			ПараметрыЗаписиЧерновика = Новый Структура("Пакет, Результат",
														Пакет,
														ДопПараметры.Результат);
			СоздатьЧерновик_old(СписокОтмеченныхДокументов, ПараметрыЗаписиЧерновика);
			
		КонецЕсли;
		
	Исключение
		
		ИнфОбОшибке = ИнформацияОбОшибке();
		ДопПараметры.Результат = НовыйСбисИсключение(ИнфОбОшибке, "МодульОбъектаКлиент.СоздатьЧерновик");
		
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЧерновик_old(СписокОтмеченныхДокументов, ДопПараметры)
	
	Кэш = ПолучитьТекущийЛокальныйКэш();
	Пакет = ДопПараметры.Пакет;
	
	фрмОД = ГлавноеОкно.сбисНайтиФормуФункции("ОтправитьДокументы","Документ_" + Кэш.Текущий.ТипДок, "Документ_Шаблон", Кэш);
	фрмОД.ОтправитьДокументы(Кэш, СписокОтмеченныхДокументов);
	Если Кэш.РезультатОтправки.Отправлено Тогда
		фрм = ГлавноеОкно.СбисНайтиФормуФункции("СбисПрочитатьСведенияОПакете", Кэш.ФормаРаботыСоСтатусами, "");
		ИдДокументаАккаунта	= фрм.СбисПрочитатьСведенияОПакете(Новый Структура("ДокументСсылка", Пакет), Кэш);
		Если ЗначениеЗаполнено(ИдДокументаАккаунта.ИдДокумента) Тогда
			СоставПакета		= Кэш.Интеграция.ПрочитатьДокумент(Кэш, ИдДокументаАккаунта.ИдДокумента);
			ПараметрыДокумента	= Кэш.Интеграция.СБИС_ПолучитьПараметрыПакетаДляОткрытияОнлайн(ИдДокументаАккаунта, Новый Структура("Кэш", Кэш));
			Если ТипЗнч(СоставПакета) = Тип("Структура") И СоставПакета.Свойство("СсылкаДляНашаОрганизация") Тогда
				ДопПараметры.Результат.Ссылка = СоставПакета.СсылкаДляНашаОрганизация;
				Если ЗначениеЗаполнено(ДопПараметры.Результат.Ссылка) И Не ПараметрыДокумента.Тикет = "" Тогда
					ДопПараметры.Результат.Ссылка = ДопПараметры.Результат.Ссылка + "&ticket=" + ПараметрыДокумента.Тикет + "&nocheck=1";
				КонецЕсли;
			КонецЕсли;
			Если ПараметрыДокумента.Свойство("СтарыйИдСессии") Тогда
				Кэш.Парам.ИдентиФикаторСессии = ПараметрыДокумента.СтарыйИдСессии;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

