
&НаКлиенте
Функция		СбисСуществуетОбъектКонфигурацииКлиент(ИмяГлобальногоТипаОбъекта, ИмяЛокальногоТипаОбъекта) Экспорт
	
	Возврат СбисСуществуетОбъектКонфигурацииВызовСервера(ИмяГлобальногоТипаОбъекта, ИмяЛокальногоТипаОбъекта);
	
КонецФункции

&НаСервере
Функция		СбисСуществуетОбъектКонфигурацииВызовСервера(ИмяГлобальногоТипаОбъекта, ИмяЛокальногоТипаОбъекта)
	
	Возврат МодульОбъектаСервер().СбисСуществуетОбъектКонфигурацииСервер(ИмяГлобальногоТипаОбъекта, ИмяЛокальногоТипаОбъекта) 
	
КонецФункции

