
&НаКлиенте
Функция		СбисСуществуетОбъектКонфигурацииКлиент(ПутьОбъекта, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	ПоискМетаданных = ПолучитьЗначениеПараметраТекущегоСеанса("ПоискМетаданных");
	
	Если ПоискМетаданных = Неопределено Тогда
		ПоискМетаданных = Новый Структура;
	КонецЕсли;
	
	ИмяМетаданных = СтрЗаменить(ПутьОбъекта, ".", "_");
	
	Если ПоискМетаданных.Свойство(ИмяМетаданных) Тогда
		Возврат ПоискМетаданных[ИмяМетаданных];
	КонецЕсли;

	РезультатПоиска = СбисСуществуетОбъектКонфигурацииВызовСервера(ПутьОбъекта, ДопПараметры);
	ПоискМетаданных.Вставить(ИмяМетаданных, РезультатПоиска);
	ИзменитьПараметрСбис("ПоискМетаданных", ПоискМетаданных);
	
	Возврат РезультатПоиска;
	
КонецФункции

&НаСервере
Функция		СбисСуществуетОбъектКонфигурацииВызовСервера(Знач ПутьОбъекта, Знач ДопПараметры = Неопределено)
	
	Возврат МодульОбъектаСервер().СбисСуществуетОбъектКонфигурацииСервер(ПутьОбъекта, ДопПараметры);
	
КонецФункции

