
// Функция возвращает результат работы метода ExtSysAction.CheckAnnul
//
// Параметры:
//  ИдентификаторыПакетов  - Массив - обрабатываемые идентификаторы пакетов документов
//  ДопПараметры  - Структура - Набор полей, работа с которыми может расширить результат работы функции.
//
// Возвращаемое значение:
//   Структура   - Результат вызова. Список доступных к аннулированию идентификаторов пакетов.
//
&НаКлиенте
Функция ПроверитьВозможностьАннулирования(ИдентификаторыПакетов, ДопПараметры = Неопределено) 
	
	Кэш = ГлавноеОкно.Кэш;  
	
	ПараметрыВызова = Новый Структура;  
	ПараметрыВызова.Вставить("docflowIds",ИдентификаторыПакетов);
	 
	ФлагОшибки = Ложь;  
	
	РезультатВызова = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ExtSysAction_CheckAnnul(ПараметрыВызова, Новый Структура("Кэш", Кэш), ФлагОшибки); 
	
	Если ФлагОшибки Тогда
		ВызватьСбисИсключение(РезультатВызова, "МодульОбъектаКлиент.ПроверитьВозможностьАннулирования");
	КонецЕсли;   
	
	Возврат РезультатВызова;
	
КонецФункции  

// Функция возвращает результат работы метода ExtSysOrders.List, список заказов для построения реестра документов.
//
// Параметры:
//  ПараметрыФильтра  - Структура - Дополнительные параметры фильтра
//  ДопПараметры  - Структура - Набор полей, работа с которыми может расширить результат работы функции.
//
// Возвращаемое значение:
//   Структура   - Результат вызова.
//
&НаКлиенте
Функция ПолучитьСписокЗаказов(Кэш, ПараметрыФильтра, ДопПараметры = Неопределено, Отказ) Экспорт	    
	
	Кэш = ГлавноеОкно.Кэш;   
	ОбщиеФункцииДокументов = ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");    
	МодульИнтеграции = ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция");
		
	ГлавноеОкно.ОтметитьВсе = Ложь;
	 
	ПараметрыФильтрации = СформироватьФильтрДляРеестраОнлайна(Кэш.ГлавноеОкно, Новый Структура("ДопФильтры", ПараметрыФильтра));
	
	РезультатВызова = МодульИнтеграции.ExtSysOrders_List(ПараметрыФильтрации, Новый Структура("Кэш", Кэш), Отказ); 
	
	Если Отказ Тогда         
		
		ГлавноеОкно.сбисСпрятатьСостояние(ГлавноеОкно);	
		ВызватьИсключение СбисИсключение_Представление(РезультатВызова); 
		
	КонецЕсли;   
	
	Возврат РезультатВызова;
			
КонецФункции    

// Функция проверяет допустимые форматы документов отгрузки, в зависимости от этапа документооборота
//
// Параметры: 
//  Идентификатор 	- Строка	- Идентификатор Saby обрабатываемого пакета
//  ДопПараметры	- Структура	- Набор полей, работа с которыми может расширить результат работы функции 
// 
// Возвращаемое значение:
//  Массив - Результат вызова.
//
&НаКлиенте
Функция ПолучитьСписокФорматовДокументовОтгрузки(Идентификатор, ДопПараметры = Неопределено) Экспорт
	
	Кэш = ГлавноеОкно.Кэш;
	МодульИнтеграции = ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция");
	
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("ИдДок", Идентификатор);
	
	ДопПараметрыВызова = Новый Структура("Кэш", Кэш);

	ФлагОшибки = Ложь;
	
	РезультатВызова = МодульИнтеграции.ExtSysDocument_AcceptedFormatsByChain(ПараметрыВызова, ДопПараметрыВызова, ФлагОшибки);
	
	Если ФлагОшибки Тогда   
		
		ВызватьИсключение СбисИсключение_Представление(РезультатВызова); 
		
	КонецЕсли; 
	
	ОтправляетсяУоО = Ложь;
	СовместнаяОтправкаУоО = Ложь;  
	
	Если РезультатВызова.РасширениеВложений.Свойство("DESADV") Тогда  
		
		ОтправляетсяУоО = Истина;
		СовместнаяОтправкаУоО = РезультатВызова.РасширениеВложений.DESADV.Свойство("WITH_UZD")
									И РезультатВызова.РасширениеВложений.DESADV.WITH_UZD = Истина;  
		
	КонецЕсли;
	
	Результат = Новый Массив; 
	
	Если ЗначениеЗаполнено(РезультатВызова.ТипыВложений) Тогда 
		
		Для Каждого ЭлементМассива Из РезультатВызова.ТипыВложений Цикл
			
			Если НРег(ЭлементМассива) = НРег("УведОбОтгр") 
				И ОтправляетсяУоО
				И НЕ СовместнаяОтправкаУоО Тогда
				Результат.Добавить(НРег("УведомлОтгр"));
			ИначеЕсли НРег(ЭлементМассива) = НРег("СЧФДОП") Тогда
				Результат.Добавить(НРег("УпдСчфДоп"));
			ИначеЕсли НРег(ЭлементМассива) = НРег("ДОП") Тогда
				Результат.Добавить(НРег("УпдДоп"));
			ИначеЕсли НРег(ЭлементМассива) = НРег("СЧФ") Тогда
				Результат.Добавить(НРег("СчФктр"));
			ИначеЕсли НРег(ЭлементМассива) = НРег("ТОРГ12") Тогда
				Результат.Добавить(НРег("ЭДОНакл"));
			ИначеЕсли НРег(ЭлементМассива) = НРег("АктВыполнРабот") Тогда
				Результат.Добавить(НРег("АктВР"));
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Результат.Добавить(НРег("УпдСчфДоп"));
		Результат.Добавить(НРег("УпдДоп"));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Функция ДанныеДокументаОтгрузкиПоПриоритету(ПараметрыПоиска, ДопПараметры = Неопределено) Экспорт
	Перем ДопОтбор;
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	ДопПараметры.Свойство("ДопОтборИни", ДопОтбор);
	
	Документы1С			= ПараметрыПоиска.Документы1С;
	ТипыВложенийСБИС	= ПараметрыПоиска.ТипыВложенийСБИС;
	
	ДокументыПоТипуСБИС = Новый Соответствие;
	
	Для каждого ЭлементСписка Из Документы1С Цикл
		
		ПараметрыИниВходящие = Новый Структура("ОбъектСсылка, ТипИни", ЭлементСписка.Значение, "Выгрузка");
		Ини = ИниПоПараметрам(ПараметрыИниВходящие);
		
		ДополнительноОтобратьИни(Ини, ДопОтбор);
		
		Если Ини = Неопределено Тогда
			Продолжить;
		ИначеЕсли Ини.Свойство("мФайл") Тогда
			// Скорее всего такого не будет
		Иначе
			
			Для каждого ЭлементСтруктуры Из Ини Цикл
				
				ПараметрыРасчета = Новый Структура;
				ПараметрыРасчета.Вставить("ИмяИни",				ЭлементСтруктуры.Ключ);
				ПараметрыРасчета.Вставить("Ини",				ЭлементСтруктуры.Значение);
				ПараметрыРасчета.Вставить("Документ",			ЭлементСписка.Значение);
				ПараметрыРасчета.Вставить("ВозможныеТипыСБИС",	ТипыВложенийСБИС);
				
				ОпределеитьТипДокументаСБИС(ДокументыПоТипуСБИС, ПараметрыРасчета);
			
			КонецЦикла;
			
		КонецЕсли;
	
	КонецЦикла;
		
	УведомлОтгр	= ДокументыПоТипуСБИС.Получить("УведомлОтгр");
	УпдСчфДоп	= ДокументыПоТипуСБИС.Получить("УпдСчфДоп");
	УпдДоп		= ДокументыПоТипуСБИС.Получить("УпдДоп");
	СчфДоп		= ДокументыПоТипуСБИС.Получить("СчфДоп");
	ЭДОНакл		= ДокументыПоТипуСБИС.Получить("ЭДОНакл");
	АктВР		= ДокументыПоТипуСБИС.Получить("АктВР");
	
	Результат = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(УведомлОтгр) Тогда
		Результат = УведомлОтгр;	
	ИначеЕсли ЗначениеЗаполнено(УпдСчфДоп) Тогда
		Результат = УпдСчфДоп;
	ИначеЕсли ЗначениеЗаполнено(СчфДоп) Тогда
		
		Результат = СчфДоп;
		
		Если ЗначениеЗаполнено(ЭДОНакл) Тогда
		
			Для каждого Документ Из ЭДОНакл Цикл
				Результат.Добавить(Документ.Значение, Документ.Представление);
			КонецЦикла;
		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(АктВР) Тогда
		
			Для каждого Документ Из АктВР Цикл
				Результат.Добавить(Документ.Значение, Документ.Представление);
			КонецЦикла;
		
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(УпдДоп) Тогда
		Результат = УпдДоп;
	Иначе
		
		Если ЗначениеЗаполнено(ЭДОНакл) Тогда
		
			Для каждого Документ Из ЭДОНакл Цикл
				Результат.Добавить(Документ.Значение, Документ.Представление);
			КонецЦикла;
		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(АктВР) Тогда
		
			Для каждого Документ Из АктВР Цикл
				Результат.Добавить(Документ.Значение, Документ.Представление);
			КонецЦикла;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОпределеитьТипДокументаСБИС(ДокументыПоТипуСБИС, ПараметрыРасчета)
	
	ИмяИни				= ПараметрыРасчета.ИмяИни;
	Ини					= ПараметрыРасчета.Ини;
	Документ			= ПараметрыРасчета.Документ;
	ВозможныеТипыСБИС	= ПараметрыРасчета.ВозможныеТипыСБИС;
	
	МодульДокументов = ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	
	Для каждого Файл Из Ини.мФайл Цикл
		
		// Проверка на тип формируемого и доступного вложения
		Вложение_Тип = МодульДокументов.РассчитатьЗначение("Вложение_Тип", Файл.Значение);
		
		// Проверка на соответствие типу документа 1с, из которого формируется документ СБИС
		Документ1С = МодульДокументов.РассчитатьЗначение("Документ", Файл.Значение);
		ОписаниеТипа = Новый ОписаниеТипов(СтрЗаменить(Документ1С, "Документ.", "ДокументСсылка."));
		РезультатПроверкиТипа = ОписаниеТипа.ПривестиЗначение(Документ);
		
		Если ВозможныеТипыСБИС.Найти(НРег(Вложение_Тип)) = Неопределено
			ИЛИ НЕ ЗначениеЗаполнено(РезультатПроверкиТипа) Тогда
			Продолжить;
		ИначеЕсли ДокументыПоТипуСБИС.Получить(Вложение_Тип) = Неопределено Тогда
			ДокументыПоТипуСБИС.Вставить(Вложение_Тип, Новый СписокЗначений);
		КонецЕсли;
		
		ДокументыПоТипуСБИС[Вложение_Тип].Добавить(Документ, ИмяИни);  
		
		Прервать;
	
	КонецЦикла;
	
КонецПроцедуры

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_РаботаСЗаказами_Аккордеон 
#КонецОбласти

