
&НаКлиенте
Функция ПрименитьФорматКСтроке(ФорматнаяСтрока, ПараметрыФорматнойСтроки = Неопределено, КлючФормата = "СтрЗаменить") Экспорт
	
	КлючПроверка = НРег(КлючФормата);
	
	Если КлючПроверка = "стрзаменить" Тогда
		
		НоваяФорматнаяСтрока = ФорматнаяСтрока;
		
		Если	ТипЗнч(ПараметрыФорматнойСтроки) = Тип("Структура")
			Или	ТипЗнч(ПараметрыФорматнойСтроки) = Тип("ФиксированнаяСтруктура")
			Или	ТипЗнч(ПараметрыФорматнойСтроки) = Тип("Соответствие") Тогда
			
			Для Каждого КлючИЗначение Из ПараметрыФорматнойСтроки Цикл
				
				НоваяФорматнаяСтрока = СтрЗаменить(НоваяФорматнаяСтрока, "{" + КлючИЗначение.Ключ + "}", КлючИЗначение.Значение);
				
			КонецЦикла;
			
		ИначеЕсли	ТипЗнч(ПараметрыФорматнойСтроки) = Тип("Массив")
			Или		ТипЗнч(ПараметрыФорматнойСтроки) = Тип("ФиксированныйМассив") Тогда
			
			Для ИндексСтрок = 0 По ПараметрыФорматнойСтроки.Количество() - 1 Цикл
				
				НоваяФорматнаяСтрока = СтрЗаменить(НоваяФорматнаяСтрока, "{" + ИндексСтрок + "}", ПараметрыФорматнойСтроки[ИндексСтрок]);
				
			КонецЦикла;
			
		Иначе
			
			НоваяФорматнаяСтрока = СтрЗаменить(НоваяФорматнаяСтрока, "{" + ПараметрыФорматнойСтроки + "}", "");
			
		КонецЕсли;
	
	ИначеЕсли	КлючПроверка = "убрать" Тогда
		
		НоваяФорматнаяСтрока = ФорматнаяСтрока;
		Если ПараметрыФорматнойСтроки = Неопределено Тогда
			
			ПараметрыФорматнойСтроки =  "@/-?=\& ""'#№*(:|;).";
			
		КонецЕсли;
		Для	Шаг	= 1	По СтрДлина(ПараметрыФорматнойСтроки) Цикл
			
			НоваяФорматнаяСтрока = СтрЗаменить(НоваяФорматнаяСтрока, Сред(ПараметрыФорматнойСтроки, Шаг, 1), "");
			
		КонецЦикла;
		
	ИначеЕсли	КлючПроверка = "ключструктуры" Тогда
		
		НоваяФорматнаяСтрока = ПрименитьФорматКСтроке(ФорматнаяСтрока,, "Убрать");
		Если Найти("0123456789", Лев(НоваяФорматнаяСтрока, 1)) Тогда
			
			//Первый символ - число. Добавить префикс(в структуре ключ не может начинаться с числа)
			НоваяФорматнаяСтрока = "_" + НоваяФорматнаяСтрока;
			
		КонецЕсли;
		
	ИначеЕсли	КлючПроверка = "формат" Тогда
		
		НоваяФорматнаяСтрока = Формат(НоваяФорматнаяСтрока, ПараметрыФорматнойСтроки);
		
	Иначе
		
		НоваяФорматнаяСтрока = ФорматнаяСтрока;
		
	КонецЕсли;
	
	Возврат НоваяФорматнаяСтрока;	

КонецФункции

//Функция преобразует строку формата "25.10.2023 21.20.54" или "25.10.2023" в дату 
//для способа обмена SabyHttpsClient, где дата в ответах приходит строкой
&НаКлиенте
Функция ДатаИзСтроки(str) Экспорт
	
	Если ТипЗнч(str) = Тип("Дата") Тогда
		Возврат str;
	КонецЕсли;
	
	Результат = str;
	
	Если	Сред(str,3,1) = "."
		И	Сред(str,6,1) = "." Тогда
		//Переопределим значение как дату, если это действительно она
		Если		СтрДлина(str) = 10 Тогда
			Попытка
				Результат = Дата(Сред(str,7,4), Сред(str,4,2), Лев(str, 2));
			Исключение
				//В случае исключения, ничего не делаем. Это не дата, значение не меняется
			КонецПопытки;
		ИначеЕсли	СтрДлина(str) = 19 Тогда 
			Попытка
				Результат = Дата(Сред(str,7,4), Сред(str,4,2), Лев(str, 2), Сред(str,12, 2), Сред(str,15, 2), Сред(str,18, 2))
			Исключение
				//В случае исключения, ничего не делаем. Это не дата, значение не меняется
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции


