
// Функция - Получить расхождения по выбранным документам
//
// Параметры:
//  ПараметрыСравненияВходящие	 - 	Структура
//		МодульПодготовкиРасхождений - Форма	 			- форма раздела для подготовки данных документов к сравнению
//		СписокСопоставлений			- СписокЗначений	- Список структур документов к сравнению
//			КлючДетализации		- Строка		- ключ детализации для поиска итога в результате действия
//			Документ1С			- Ссылка		- сравниваемый документ 1С
//			ДокументСБИСНазвание- Строка		- название вложения СБИС
//			ИдВложения			- Строка, УИД	- Ид вложения СБИС
//			СоставПакета        - Структура		- документ СБИС
//  ДопПараметры				 - Структура 
// 
// Возвращаемое значение:
//  РезультатДействия - Структура, объект РезультатДействия сравнения
//
&НаКлиенте
Функция СравнитьВыбранныеДокументы(ПараметрыСравненияВходящие, ДопПараметры) Экспорт
	
	Перем РеестрДляСтатистики;
	
	РезультатДействия			= НовыйРезультатДействия(Новый Структура("Тип", "ПроверкаРасхождений"), Новый Структура);
	МодульПодготовкиРасхождений	= ПараметрыСравненияВходящие.МодульПодготовкиРасхождений;
	СбисСчётчикСтрок			= 0;
	СбисВсегоСтрок				= ПараметрыСравненияВходящие.СписокСопоставлений.Количество();
	ПараметрыПроверкиРасхождений= Новый Структура("РезультатДействия", РезультатДействия);
	Если ДопПараметры.Свойство("ОбработчикДельты") Тогда
		ПараметрыПроверкиРасхождений.Вставить("ОбработчикДельты", ДопПараметры.ОбработчикДельты);
	КонецЕсли;
	
	ПрокидыватьДанныеДокументов = ДопПараметры.Свойство("ДетализацияСДаннымиДокументов") И ДопПараметры.ДетализацияСДаннымиДокументов;
	
	Для Каждого ЭлементСпискаСопоставления Из ПараметрыСравненияВходящие.СписокСопоставлений Цикл
		СтрокаСопоставления = ЭлементСпискаСопоставления.Значение;
		
		ГлавноеОкно.СбисПоказатьСостояние("Формирование расхождения", , Мин(100, Окр(СбисСчётчикСтрок * 100 / СбисВсегоСтрок)));
		Попытка
			СоответствиеДокументов = МодульПодготовкиРасхождений.ПодготовитьСтруктуруДокументаДляРасхождений(СтрокаСопоставления, ГлавноеОкно.Кэш);
			РезультатДействия_ОбновитьВремя(РезультатДействия, "Подготовка");
		Исключение
			СбисИсключение = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.СравнитьВыбранныеДокументы");
			ПараметрыРезультата = Новый Структура("Тип, КлючГруппировки", "НеВыполнено", СтрокаСопоставления.КлючДетализации);
			РезультатДействия_ОбработатьРезультат(РезультатДействия, СбисИсключение, ПараметрыРезультата);
			Продолжить;
		КонецПопытки;	

		Попытка
			СтрокаСоответствия = СоответствиеДокументов.Получить(СтрокаСопоставления.КлючДетализации);
			Если СтрокаСоответствия = Неопределено Тогда
				ВызватьСбисИсключение(735, "Не удалось собрать данные для сравнения", "СоответствиеДокументов.Получить",,,,);
			КонецЕсли;
			Если ПрокидыватьДанныеДокументов Тогда
				РезультатДействия.Вставить("ДанныеДокумента1С",СтрокаСоответствия.СтруктураДокументаПоДанным1С);
			КонецЕсли;	   
   
			РезультатСравнения	= ВыполнитьПроверкуРасхожденийПоСтрокеСоответствия(Новый Структура("Ключ, Значение", СтрокаСопоставления.КлючДетализации, СтрокаСоответствия), ПараметрыПроверкиРасхождений);
   
			Если ПрокидыватьДанныеДокументов Тогда
				РезультатСравнения.Значение.Вставить("ДанныеДокументов",СтрокаСоответствия);
			КонецЕсли;																 
   
			ПараметрыРезультата = Новый Структура("Тип, КлючГруппировки", "Выполнено", СтрокаСопоставления.КлючДетализации);
			РезультатСравнения.Значение.Вставить("ДанныеСравнение",СтрокаСоответствия);																																	 
			РезультатДействия_ОбработатьРезультат(РезультатДействия, РезультатСравнения.Значение, ПараметрыРезультата);
   
		Исключение
			СбисИсключение = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.СравнитьВыбранныеДокументы");
			ПараметрыРезультата = Новый Структура("Тип, КлючГруппировки", "Ошибка", СтрокаСопоставления.КлючДетализации);
			РезультатДействия_ОбработатьРезультат(РезультатДействия, СбисИсключение, ПараметрыРезультата);
		КонецПопытки;	
	КонецЦикла;
	
	Если ДопПараметры.Свойство("Владелец") Тогда
		РеестрДляСтатистики = ДопПараметры.Владелец.НазваниеКратко();
	Иначе
		РеестрДляСтатистики = "Неизвестно";
	КонецЕсли;
	
	ЗаписьПрикладнойСтатистики = НовыйЗаписьПрикладнойСтатистики(РеестрДляСтатистики, "Сравнение документов");
	ПрикладнаяСтатистика = НовыйПрикладнаяСтатистика();
	ПрикладнаяСтатистика_Добавить(ПрикладнаяСтатистика, ЗаписьПрикладнойСтатистики);
	ПрикладнаяСтатистика_Отправить(ПрикладнаяСтатистика);
 
	ГлавноеОкно.СбисСпрятатьСостояние();
 
	Возврат	РезультатДействия;	
КонецФункции	

//весь результат помещается в переданный объект ДопПараметры.РезультатДействия
&НаКлиенте
Функция ВыполнитьПроверкуРасхожденийПоСтрокеСоответствия (ОписаниеПроверкиРасхождения, ДопПараметры)

	Перем ОбработчикДельтыОбъектов, СтруктураДокументаПоДаннымСбис, СтруктураДокументаПоДанным1С, ИнформацияОДокументах, Ини;
	РезультатДействия	= ДопПараметры.РезультатДействия;
	
	Если		Не ОписаниеПроверкиРасхождения.Значение.Свойство("СтруктураДокументаПоДаннымСбис",	СтруктураДокументаПоДаннымСбис) Тогда
		
		ВызватьСбисИсключение(,"МодульОбъектаКлиент.ВыполнитьПроверкуРасхожденийПоСтрокеСоответствия",,,"Отсутствует описание структуры документа по данным СБИС");
		
	ИначеЕсли	Не ОписаниеПроверкиРасхождения.Значение.Свойство("СтруктураДокументаПоДанным1С",	СтруктураДокументаПоДанным1С) Тогда
		
		ВызватьСбисИсключение(,"МодульОбъектаКлиент.ВыполнитьПроверкуРасхожденийПоСтрокеСоответствия",,,"Отсутствует описание структуры документа по данным 1С");
		
	ИначеЕсли	Не ОписаниеПроверкиРасхождения.Значение.Свойство("ИнформацияОДокументах",			ИнформацияОДокументах) Тогда
		
		ВызватьСбисИсключение(,"МодульОбъектаКлиент.ВыполнитьПроверкуРасхожденийПоСтрокеСоответствия",,,"Отсутствует описание структуры настройки расхождения");
		
	Иначе
		
		ФормыПоиска = Новый Массив;
		ФормыПоиска.Добавить("Файл_" + ИнформацияОДокументах.Формат + "_" + СтрЗаменить(ИнформацияОДокументах.Версия, ".", "_"));
		ФормыПоиска.Добавить("Файл_Шаблон");
		
		фрм = НайтиФункциюСеансаОбработки("ПолучитьКартуСравнения", ФормыПоиска);
		Если фрм = Ложь Тогда
			ВызватьСбисИсключение(, "МодульОбъектаКлиент.ВыполнитьПроверкуРасхожденийПоСтрокеСоответствия",,,"Отсутствует описание карты расхождения");
		КонецЕсли;
		
	КонецЕсли;
	
	Карта				= фрм.ПолучитьКартуСравнения();
	НовДопПараметры		= Новый Структура("Карта", Карта);
	РасхожденияОбъектов	= ПолучитьРасхождениеОбъектов(СтруктураДокументаПоДаннымСбис, СтруктураДокументаПоДанным1С, НовДопПараметры);
	
	Если Не ДопПараметры.Свойство("ОбработчикДельты", ОбработчикДельтыОбъектов) Тогда
		Возврат РасхожденияОбъектов;
	КонецЕсли;
	
	ПараметрыДельты = Новый Структура("ОписаниеПроверки, Дельта, Результат", ОписаниеПроверкиРасхождения, РасхожденияОбъектов);
	ВыполнитьСбисОписаниеОповещения(ПараметрыДельты, ОбработчикДельтыОбъектов);
	Возврат ПараметрыДельты.Результат;
	
КонецФункции

&НаКлиенте
Функция ПодготовитьСтруктуруДокументаСбисДляРасхождений(СтрокаСпискаДокументов)
	
	фрм = ГлавноеОкно.сбисНайтиФормуФункции("НайтиДокументы1СПоПакетуСБИС",ГлавноеОкно.Кэш.ФормаРаботыСоСтатусами,"");
	МассивПакетов = Новый Массив;
	ПолныйСоставПакета = Новый Структура;
	
	Для Каждого Строка из СтрокаСпискаДокументов.СоставПакета Цикл		
		Документ = Строка.Значение;
		ИдентификаторПакета = Строка.Значение.Идентификатор;
		//+tda//Если интеграция через каталог, передаём не идентификатор, а сам пакет
		Если ГлобальныйКэш.Парам.СпособОбмена = 1 Тогда
			ИдентификаторПакета = Строка.Значение;
		КонецЕсли;
		//-tda//
		ОшибкаЧтения = Ложь;
		ПолныйСоставПакета = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ПрочитатьДокумент(ГлавноеОкно.Кэш, ИдентификаторПакета,,ОшибкаЧтения);
		Если ОшибкаЧтения Тогда
			Продолжить;
		КонецЕсли;
		МассивСлужебных = Новый Массив;
		Если ПолныйСоставПакета.Свойство("Вложение") Тогда
			фрм.НайтиДокументы1СПоПакетуСБИС(ПолныйСоставПакета, ГлавноеОкно.Кэш.Ини, ГлавноеОкно.КаталогНастроек, МассивСлужебных);
			// Удалим служебные вложения
			счУдаленных = 0;
			Для Каждого Элемент Из МассивСлужебных Цикл
				ПолныйСоставПакета.Вложение.Удалить(Элемент-счУдаленных);
				счУдаленных = счУдаленных+1;
			КонецЦикла;
			МассивПакетов.Добавить(ПолныйСоставПакета);
		ИначеЕсли	ТипЗнч(СтрокаСпискаДокументов) = Тип("Структура") 
			И	СтрокаСпискаДокументов.Свойство("ВернутьПустойСоставПакета")
			И	СтрокаСпискаДокументов.ВернутьПустойСоставПакета Тогда
			МассивПакетов.Добавить(ПолныйСоставПакета);
		Иначе
			ВызватьСбисИсключение(, "МодульОбъектаКлиент.ПодготовитьСтруктуруДокументаСбисДляРасхождений", 726, ,"В пакете " + ПолныйСоставПакета.Название + " отсутствуют вложения.");
		КонецЕсли;
		Возврат МассивПакетов;
	КонецЦикла;	
	Возврат МассивПакетов;
	
КонецФункции

&НаКлиенте
Функция ПодготовитьСтруктуруДокумента1СДляРасхождений(СтрокаСпискаДокументов) Экспорт

	ФункцииДокументов	= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	МассивВложений		= ФункцииДокументов.ПодготовитьСтруктуруДокумента1С(СтрокаСпискаДокументов, ПолучитьТекущийЛокальныйКэш());
	Возврат МассивВложений;
	
КонецФункции
	
&НаКлиенте
Функция ПодготовитьСтруктуруДокументаДляРасхожденийДляРеестраСБИС(СтрокаСпискаДокументов) Экспорт
	Перем СтруктураИниФайла, СтруктураФайла, мДокументы, СтруктураДокументаПоДаннымСбис, СтруктураДокументаПоДанным1С;

	Если СтрокаСпискаДокументов.Документ1С = Неопределено Тогда
		
		ВызватьСбисИсключение(735, "МодульОбъектаКлиент.ПодготовитьСтруктуруДокументаДляРасхожденийДляРеестраСБИС",,,"Отсутствует сопоставленный документ 1С для сравнения");
		
	КонецЕсли;
	Если СтрокаСпискаДокументов.ИдВложения = Неопределено Тогда
		
		ВызватьСбисИсключение(735, "МодульОбъектаКлиент.ПодготовитьСтруктуруДокументаДляРасхожденийДляРеестраСБИС",,,"Отсутствует сопоставленный документ СБИС для сравнения");
		
	КонецЕсли;
	
	СбисМодулиСеансов			= ГлобальныйКэш.ТекущийСеанс.Модули;
	МассивРазобранныхПакетов	= Новый Массив();
	СоответствиеРезультат		= Новый Соответствие;
	МассивПакетов				= ПодготовитьСтруктуруДокументаСбисДляРасхождений(СтрокаСпискаДокументов);
	
	Для Каждого Пакет Из МассивПакетов Цикл
		
		СоответствиеСравнения = СоставПакета_Получить(Пакет, "ДанныеСравнения", СтрокаСпискаДокументов);
		
		Для Каждого КлючИЗначение Из СоответствиеСравнения Цикл
			
			СоответствиеРезультат.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			
		КонецЦикла;
		
	КонецЦикла;
	Возврат СоответствиеРезультат;
	
КонецФункции

&НаКлиенте
Функция ПодготовитьСтруктуруДокументаДляРасхожденийДляРеестра1С(СтрокаСпискаДокументов) Экспорт
	Перем СтруктураИниФайла, СтруктураФайла, мДокументы, СтруктураДокументаПоДаннымСбис, СтруктураДокументаПоДанным1С;

	Кэш = ГлавноеОкно.Кэш;
	Если СтрокаСпискаДокументов.Документ1С = Неопределено Тогда
		ВызватьСбисИсключение(735, "МодульОбъектаКлиент.ПодготовитьСтруктуруДокументаДляРасхожденийДляРеестраСБИС",,,"Отсутствует сопоставленный документ 1С для сравнения");
	КонецЕсли;
	Если СтрокаСпискаДокументов.ИдВложения = Неопределено Тогда
		ВызватьСбисИсключение(735, "МодульОбъектаКлиент.ПодготовитьСтруктуруДокументаДляРасхожденийДляРеестраСБИС",,,"Отсутствует сопоставленный документ СБИС для сравнения");
	КонецЕсли;

	СбисМодулиСеансов	= ГлобальныйКэш.ТекущийСеанс.Модули;
	Соответствие		= Новый Соответствие();
	КэшПакетов			= Новый Структура("Успешно, Ошибки", Новый Соответствие(), Новый Соответствие());
	
	МассивПакетов = ГлобальныйКэш.Модули.ФункцииДокументов.ПодготовитьСтруктуруДокумента1С(СтрокаСпискаДокументов, ГлавноеОкно.Кэш);
	
	Для каждого Пакет Из МассивПакетов Цикл
		Для Каждого ВложениеПакета Из Пакет.Вложение Цикл
			СтруктураДокументаПоДанным1С = ВложениеПакета.СтруктураФайла.Файл.Документ;
			
			ИдДок = СбисМодулиСеансов.ФункцииДокументов.ИдентификаторСБИСПоДокументу(Кэш, ВложениеПакета.Документы1С[0].Значение);
			Если Не ЗначениеЗаполнено(ИдДок) Тогда
				ВызватьСбисИсключение(735, "МодульОбъектаКлиент.ПодготовитьСтруктуруДокументаДляРасхожденийДляРеестраСБИС",,,"Не удалось получить документ СБИС");
			КонецЕсли;
			
			Если Не КэшПакетов.Ошибки.Получить(ИдДок) = Неопределено Тогда
				ВызватьСбисИсключение(735, "МодульОбъектаКлиент.ПодготовитьСтруктуруДокументаДляРасхожденийДляРеестраСБИС",,,"Не удалось получить вложение СБИС");
			КонецЕсли;
			
			ПолныйСоставПакетаСбис = КэшПакетов.Успешно.Получить(ИдДок);
			Если ПолныйСоставПакетаСбис = Неопределено Тогда 
				Попытка
					ПараметрыДокумента = Кэш.Интеграция.СБИС_ПолучитьПараметрыПакетаДляОткрытияОнлайн(ИдДок, Новый Структура("Кэш", Кэш));
					ДопПарам = Новый Структура("СообщатьПриОшибке, ВернутьОшибку", Ложь, Истина);
					СоставПакетаСбис = Кэш.Интеграция.ПрочитатьДокумент(Кэш,ПараметрыДокумента.ИдДокумента, ДопПарам);
					//Для Каждого ВложениеСбис Из СоставПакетаСбис.Вложение Цикл
					//	Если ВложениеСбис.Идентификатор = СтрокаСпискаДокументов.ИдВложения Тогда
					//		Прервать;
					//	КонецЕсли;
					//	ВложениеСбис = 
					//КонецЦикла;
					
					
										
					ПолныйСоставПакетаСбис = СбисМодулиСеансов.ФункцииДокументов.РазобратьСтруктуруДокументаСбис(СоставПакетаСбис, Кэш); //только по вложению сбис	
					
					ВложениеСбис = НайтиВложениеСбисПоВложению1С(Новый Структура("СоставПакетаСбис,Вложение1С",СоставПакетаСбис, ВложениеПакета), Новый Структура("Кэш", Кэш));
					СтруктураДокументаПоДаннымСбис = ВложениеСбис.СтруктураФайла.Файл.Документ; 
					КэшПакетов.Успешно.Вставить(ИдДок, ПолныйСоставПакетаСбис);
				Исключение
					ВызватьСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ПодготовитьСтруктуруДокументаДляРасхожденийДляРеестраСБИС",,,"Не удалось получить вложение СБИС");
				КонецПопытки;
			Иначе
				Попытка
					ВложениеСбис = НайтиВложениеСбисПоВложению1С(Новый Структура("СоставПакетаСбис,Вложение1С",СоставПакетаСбис, ВложениеПакета), Новый Структура("Кэш", Кэш));
                	СтруктураДокументаПоДаннымСбис = ВложениеСбис.СтруктураФайла.Файл.Документ;  
				Исключение
					СтруктураДокументаПоДаннымСбис = Неопределено;
				КонецПопытки;
			КонецЕсли;
			
			Если Не СтруктураДокументаПоДанным1С = Неопределено Тогда
				
				ПараметрыПоискаИниРасхождения = Новый Структура("ТипДокумента, ВерсияДокумента, НастройкаПроверкаРасхождения", ВложениеСБИС.ФорматДляЗагрузки, ВложениеСБИС.ВерсияФорматаДляЗагрузки);
				ВложениеСБИС.Свойство("НастройкаПроверкаРасхождения", ПараметрыПоискаИниРасхождения.НастройкаПроверкаРасхождения);
				ИниПоискаРасхождения = НайтиИниПроверкиРасхождения(ПараметрыПоискаИниРасхождения);
				
				ИнформацияОДокументах = Новый Структура("ИниСравненияДокументов, Формат, Версия", Новый Структура("мСравнениеДокументов", ИниПоискаРасхождения), ВложениеСБИС.ФорматДляЗагрузки, ВложениеСБИС.ВерсияФорматаДляЗагрузки);
				Соответствие.Вставить(ВложениеСБИС.Название, Новый Структура("СтруктураДокументаПоДаннымСбис, СтруктураДокументаПоДанным1С, ИнформацияОДокументах", СтруктураДокументаПоДаннымСбис, СтруктураДокументаПоДанным1С, ИнформацияОДокументах));
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	Возврат Соответствие;	
КонецФункции

&НаКлиенте
Функция Найти_мФайлПоВложению(Вложение, Документ1С)
	Перем ТекстОшибки, ВерсияФорматаВложения;
	
	МодульФункцийДокументов	= ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов;
	ТипДокумента1С			= СтрПолучитьСтроку(СтрЗаменить(МодульФункцийДокументов.ПолучитьИмяИСПоСсылке(Документ1С), ".", Символы.ПС), 2);
	Если Вложение.Свойство("ВерсияФорматаДляЗагрузки", ВерсияФорматаВложения) Тогда
		ВерсияФорматаВложения = СтрЗаменить(ВерсияФорматаВложения, "_", ".");
	Иначе
		ВерсияФорматаВложения = Вложение.ВерсияФормата;
	КонецЕсли;
	
	Попытка
		НаборПодходящихИни = ИниПоПараметрам(Новый Структура("Тип1С, ТипИни", ТипДокумента1С, "Выгрузка"));
	Исключение
		ВызватьСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.Найти_мФайлПоВложению");
	КонецПопытки;

	ПараметрыПроверкиИни= Новый Структура("ДокументСсылка, Версия, Тип", Документ1С, ВерсияФорматаВложения, Вложение.Тип);
	ТекстОшибки			= "В файлах настроек для документов {ТипДок} отсутствует описание формирования {Тип}, версии {Версия}";
	
	//Основная ини - одноименная с типом документа.
	Если НаборПодходящихИни.Свойство(ТипДокумента1С) Тогда
		
		ДанныеВыгрузки = ПолучитьИзИниВыгрузкуТипаВложения(НаборПодходящихИни[ТипДокумента1С], ПараметрыПроверкиИни);
		Если Не ДанныеВыгрузки = Неопределено Тогда
			Возврат ДанныеВыгрузки;
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого КлючИЗначениеИни Из НаборПодходящихИни Цикл
		
		Если КлючИЗначениеИни.Ключ = ТипДокумента1С Тогда 
			//Одноименная ини уже проверена.
			Продолжить;
		КонецЕсли;
		
		ДанныеВыгрузки = ПолучитьИзИниВыгрузкуТипаВложения(КлючИЗначениеИни.Значение, ПараметрыПроверкиИни);
		Если ДанныеВыгрузки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Возврат ДанныеВыгрузки	
	КонецЦикла;
	Если ТекстОшибки = Неопределено Тогда
		ТекстОшибки = "Не удалось найти файл настроек для {ТипДок}";
	Иначе
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "{Тип}",		ПараметрыПроверкиИни.Тип);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "{Версия}",	ВерсияФорматаВложения);
	КонецЕсли;
	ТекстОшибки = СтрЗаменить(ТекстОшибки, "{ТипДок}",	Строка(ТипЗнч(Документ1С)));
	
	ВызватьСбисИсключение(726, "МодульОбъектаКлиент.Найти_мФайлПоВложению",,,ТекстОшибки);
	
КонецФункции

&НаКлиенте
Функция ПолучитьИзИниВыгрузкуТипаВложения(ДанныеИни, ПараметрыПроверки)

	Если	Не ТипЗнч(ДанныеИни) = Тип("Структура") 
		Или	Не ДанныеИни.Свойство("мФайл") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МодульФункцийДокументов	= ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов;
	Документ1С				= ПараметрыПроверки.ДокументСсылка;
	
	Для Каждого КлючИЗначение Из ДанныеИни.мФайл Цикл
		КонтекстИни				= Новый Структура("Ини, Документ", МодульФункцийДокументов.СбисСкопироватьОбъектНаКлиенте(КлючИЗначение.Значение), Документ1С);
		ВходящийКонтекстРасчета	= Новый Структура;
		ВходящийКонтекстРасчета.Вставить("ИспользоватьНовыйФорматАктаСверки", ГлобальныйКэш.Парам.ИспользоватьНовыйФорматАктаСверки);

		ЕстьШККонтрагентов = ГлобальныйКэш.Парам.ИспользоватьШтрихкодыНоменклатурыКонтрагентов;
		ЗначениеИниДокумента = КонтекстИни.Ини;
		ЗначениеИниДокумента.Вставить("Формат2016",										Новый Структура("Значение,РассчитанноеЗначение", Истина,			Истина));
		ЗначениеИниДокумента.Вставить("Формат2019",										Новый Структура("Значение,РассчитанноеЗначение", Истина,			Истина));
		ЗначениеИниДокумента.Вставить("ФорматУКД2020",									Новый Структура("Значение,РассчитанноеЗначение", Истина,			Истина));
		ЗначениеИниДокумента.Вставить("ВходящийКонтекст",								Новый Структура("Значение,РассчитанноеЗначение", "",				ВходящийКонтекстРасчета));
		ЗначениеИниДокумента.Вставить("ИспользоватьШтрихкодыНоменклатурыКонтрагентов",	Новый Структура("Значение,РассчитанноеЗначение", ЕстьШККонтрагентов,ЕстьШККонтрагентов));
		
		//Говнокод, но расчёт должен быть на сервере.
		ТипИзИни				= МодульФункцийДокументов.РассчитатьЗначениеНаСервере("Файл_Формат",		КонтекстИни);
		ВерсияФорматаИзИни		= МодульФункцийДокументов.РассчитатьЗначениеНаСервере("Файл_ВерсияФормата",	КонтекстИни);

		//ТипИзИни				= МодульФункцийДокументов.РассчитатьЗначениеНаСервере("Вложение_Тип",				КонтекстИни);
		//ПодтипИзИни				= МодульФункцийДокументов.РассчитатьЗначениеНаСервере("Вложение_ПодТип",			КонтекстИни);
		//ВерсияФорматаИзИни		= МодульФункцийДокументов.РассчитатьЗначениеНаСервере("Вложение_ВерсияФормата",		КонтекстИни);
		
		Если	ПараметрыПроверки.Тип	= ТипИзИни
			//И	ПараметрыПроверкиИни.Подтип	= ПодтипИзИни
			И	ПараметрыПроверки.Версия= ВерсияФорматаИзИни Тогда 
			Результат = Новый Структура("Ключ, Значение", КлючИЗначение.Ключ, ЗначениеИниДокумента);   
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция НайтиВложениеСбисПоВложению1С(ОписаниеПакета, ДопПараметры) Экспорт
	СоставПакетаСбис = ОписаниеПакета.СоставПакетаСбис;
	Вложение1С = ОписаниеПакета.Вложение1С;
	Для Каждого ВложениеСбис Из СоставПакетаСбис.Вложение Цикл
		Если (Не ВложениеСбис.Свойство("Служебный") или ВложениеСбис.Служебный = "Нет")
			И Вложение1С.Тип = ВложениеСбис.Тип
			И Вложение1С.ПодТип = ВложениеСбис.ПодТип
			И Вложение1С.ВерсияФормата = ВложениеСбис.ВерсияФормата
			И Строка(Вложение1С.ПодВерсияФормата) = ВложениеСбис.ПодВерсияФормата Тогда
			Возврат ВложениеСбис;
		КонецЕсли;	
	КонецЦикла;		
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Функция НайтиИниПроверкиРасхождения(ИнформацияОДокументе, ДопПараметры=Неопределено) Экспорт
	Перем НастройкаПроверкаРасхождения, ТипДокумента, ВерсияДокумента, Результат;
	
	Кэш = ГлавноеОкно.Кэш;
	Если Не (ЗначениеЗаполнено(ИнформацияОДокументе)
		И ТипЗнч(ИнформацияОДокументе) = Тип("Структура")) Тогда
		
		Возврат Неопределено;
	КонецЕсли;
	
	Если ИнформацияОДокументе.Свойство("НастройкаПроверкаРасхождения", НастройкаПроверкаРасхождения)
		И ЗначениеЗаполнено(НастройкаПроверкаРасхождения) Тогда
		Возврат ИниПоПараметрам(Новый Структура("Имя", НастройкаПроверкаРасхождения));
	КонецЕсли;
	
	Если ИнформацияОДокументе.Свойство("ТипДокумента", ТипДокумента)
		И ИнформацияОДокументе.Свойство("ВерсияДокумента", ВерсияДокумента)
		И ЗначениеЗаполнено(ТипДокумента)
		И ЗначениеЗаполнено(ВерсияДокумента) Тогда
		
		ТипИни			= "ПроверкаРасхождения";
		ВерсияДокумента	= ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.СбисЗаменитьНедопустимыеСимволы(ВерсияДокумента);
		ИмяИни = ТипИни + "_"
			 +	ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.СбисЗаменитьНедопустимыеСимволы(ТипДокумента) + "_"
			 +	ВерсияДокумента;
			
		Попытка
			Ини = ИниПоПараметрам(Новый Структура("Имя, ТипИни", ИмяИни, "ПроверкаРасхождения"));
		Исключение
			ИмяИни = ТипИни + "_Шаблон_" + ВерсияДокумента;
			Ини = ИниПоПараметрам(Новый Структура("Имя, ТипИни", ИмяИни, "ПроверкаРасхождения"));
		КонецПопытки;
			
		Если Не Ини = Неопределено Тогда
			Результат = Новый Структура("мСравнениеДокументов");
			ЗаполнитьЗначенияСвойств(Результат, Ини);
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;
	
	Возврат Неопределено;	
КонецФункции

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Расхождения_СравнениеОбъектов
#КонецОбласти

