&НаСервереБезКонтекста
Функция БыстроеВнедрениеEDI_ПоискСтороныВКонтуре(GLN) Экспорт

	ЗапросПартнера = Новый Запрос;
	ЗапросПартнера.Текст = "ВЫБРАТЬ
	                       |	КонтурEDI_ДополнительныеРеквизиты.Объект КАК Ссылка
	                       |ИЗ
	                       |	РегистрСведений.КонтурEDI_ДополнительныеРеквизиты КАК КонтурEDI_ДополнительныеРеквизиты
	                       |ГДЕ
	                       |	(КонтурEDI_ДополнительныеРеквизиты.Свойство = ""GLN_Контрагента""
	                       |			ИЛИ КонтурEDI_ДополнительныеРеквизиты.Свойство = ""GLN_Организации"")
	                       |	И КонтурEDI_ДополнительныеРеквизиты.Значение = &GLN";
	
	ЗапросПартнера.УстановитьПараметр("GLN", GLN);

	РезультатПартнер = ЗапросПартнера.Выполнить().Выгрузить();
	Если РезультатПартнер.Количество() Тогда
		Возврат РезультатПартнер[0].Ссылка; 
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции 

&НаСервереБезКонтекста
Функция БыстроеВнедрениеEDI_ПоискПартнераВКонтуре(Сторона) Экспорт

	ЗапросПартнера = Новый Запрос;
	ЗапросПартнера.Текст = "ВЫБРАТЬ
	                       |	КонтурEDI_ДополнительныеРеквизиты.Значение КАК Партнер
	                       |ИЗ
	                       |	РегистрСведений.КонтурEDI_ДополнительныеРеквизиты КАК КонтурEDI_ДополнительныеРеквизиты
	                       |ГДЕ
	                       |	КонтурEDI_ДополнительныеРеквизиты.Свойство = ""ПартнерКонтрагента""
	                       |	И КонтурEDI_ДополнительныеРеквизиты.Объект = &Сторона";
	
	ЗапросПартнера.УстановитьПараметр("Сторона", Сторона);

	РезультатПартнер = ЗапросПартнера.Выполнить().Выгрузить();
	Если РезультатПартнер.Количество() Тогда
		Возврат РезультатПартнер[0].Партнер; 
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции 

 
