
&НаКлиенте
Процедура ЗаполнитьСведенияОПользователеИАккаунте(ПараметрыЗаполнить, Кэш) Экспорт
	Попытка
		ИнформацияОТекущемПользователе	= СбисПолучитьИнформациюОТекущемПользователе(ПараметрыЗаполнить, Кэш);
		Кэш.СБИС.ПараметрыИнтеграции.Вставить("ИдАккаунта");
		Кэш.СБИС.ПараметрыИнтеграции.Вставить("ИдПользователя");
		
		//Пока дублируем и на ГО и в параметры интеграции, чтобы не сломать текущую логику.
		Кэш.СБИС.ПараметрыИнтеграции.Пользователь	= ИнформацияОТекущемПользователе.Название;
		ГлавноеОкно.Пользователь					= ИнформацияОТекущемПользователе.Название; 
		
		ИнформацияОТекущемПользователе.Свойство("НомерАккаунта", Кэш.СБИС.ПараметрыИнтеграции.ИдАккаунта);
		
		Кэш.СБИС.Вставить("Сессии", Новый Соответствие());
		Если	ИнформацияОТекущемПользователе.Свойство("ИдПерсоны", Кэш.СБИС.ПараметрыИнтеграции.ИдПользователя)
			И	ЗначениеЗаполнено(Кэш.СБИС.ПараметрыИнтеграции.ИдПользователя) Тогда
			КлючСессии = Кэш.СБИС.ПараметрыИнтеграции.КодСервиса + "_" + Кэш.СБИС.ПараметрыИнтеграции.ИдПользователя;
			Кэш.СБИС.Сессии.Вставить(КлючСессии, Новый Структура());
			Кэш.СБИС.Сессии[КлючСессии].Вставить("params", Новый Структура());
			Кэш.СБИС.Сессии[КлючСессии].Вставить("accounts", Новый Соответствие());
			Кэш.СБИС.Сессии[КлючСессии].accounts.Вставить(Кэш.СБИС.ПараметрыИнтеграции.ИдАккаунта, Кэш.Парам.ИдентификаторСессии);
		Иначе	
			Кэш.СБИС.ПараметрыИнтеграции.ИдПользователя = "";
		КонецЕсли;
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ВызватьСбисИсключение(ИнфоОбОшибке, "МодульОбъектаКлиент.ЗаполнитьСведенияОПользователеИАккаунте");
	КонецПопытки;	
КонецПроцедуры

&НаКлиенте
Функция СбисПолучитьСписокАккаунтов(Кэш, ДопПараметры, Отказ) Экспорт
	СписокАккаунтов = Кэш.Интеграция.СБИС_ПолучитьСписокАккаунтов(Кэш, Новый Структура(), Новый Структура(), Ложь);
	Если Отказ Тогда
		ВызватьСбисИсключение(, "МодульОбъектаКлиент.СбисПолучитьСписокАккаунтов",, "Не удалось получить список аккаунтов");
	КонецЕсли;
	Если ТипЗнч(СписокАккаунтов) = Тип("Структура") Тогда
		Если СписокАккаунтов.Свойство("Список") Тогда
			Возврат СписокАккаунтов.Список;
		КонецЕсли;
	КонецЕсли;	
	Возврат СписокАккаунтов;
КонецФункции 

&НаКлиенте	
Функция СбисПереключитьАккаунт(Кэш, param, ДопПараметры, Отказ) Экспорт    
	Результат = Кэш.Интеграция.СБИС_ПереключитьАккаунт(Кэш, param, Новый Структура(), Ложь);
	Если Отказ Тогда
		ВызватьСбисИсключение(, "МодульОбъектаКлиент.СбисПереключитьАккаунт",, "Не удалось переключить аккаунт");
	КонецЕсли;
	
	КлючПользователя =  Кэш.СБИС.ПараметрыИнтеграции.КодСервиса + "_" + Кэш.СБИС.ПараметрыИнтеграции.ИдПользователя;
	Кэш.СБИС.Сессии[КлючПользователя].accounts.Вставить(param.НомерАккаунта, Результат);
	Кэш.СБИС.ПараметрыИнтеграции.Вставить("ИдАккаунта", param.НомерАккаунта);
	Возврат Результат;
КонецФункции
                                                                                                        
&НаКлиенте	
Функция СбисПолучитьИнформациюОТекущемПользователе(ПараметрыЗапросаИнформации=Неопределено, Кэш) Экспорт  
	Отказ = Ложь;
	Результат = Кэш.Интеграция.СБИС_ПолучитьИнформациюОТекущемПользователе(Кэш, Новый Структура, Новый Структура(), Отказ);
	Если Отказ Тогда
		ОшибкаЧтения = НовыйСбисИсключение(Результат, "МодульОбъектаКлиент.ПолучитьИнформациюОТекущемПользователе",, "Не удалось получить информацию о текущем пользователе");
		ВызватьИсключение СбисИсключение_Представление(ОшибкаЧтения);
	КонецЕсли;
	
	Фамилия	= Неопределено;
	Имя		= Неопределено;
	Отчество= Неопределено;    
	
	Если Не Результат.Свойство("Фамилия", Фамилия) Тогда
		Фамилия = "";
	КонецЕсли;
	Если Не Результат.Свойство("Имя", Имя) Тогда
		Имя = "";
	КонецЕсли;
	Если Не Результат.Свойство("Отчество",	Отчество) Тогда
		Отчество = "";
	КонецЕсли; 
	
	Если Результат.Свойство("Пользователь") Тогда
		 Фамилия = Результат.Пользователь.Фамилия;
		 Имя = Результат.Пользователь.Имя;
		 Отчество = Результат.Пользователь.Отчество; 
		 Если Результат.Пользователь.Свойство("ИдПрофиля") Тогда
			Результат.Вставить("ИдПерсоны", Результат.Пользователь.ИдПрофиля);
		 КонецЕсли;
		 Если Результат.Пользователь.Свойство("Аккаунт") Тогда
		 	Результат.Вставить("НомерАккаунта", Результат.Пользователь.Аккаунт.Номер);
		 КонецЕсли;
	 КонецЕсли;
	Результат.Вставить("Название", Фамилия+" "+Имя+" "+Отчество); 
	Возврат Результат;
КонецФункции  

&НаКлиенте
Функция СбисДействияПриВыходеИзАккаунта(Кэш, ДопПараметры = Неопределено) Экспорт
 
	Кэш.Парам.ЗапомнитьПароль		= Ложь;
	Кэш.Парам.ЗапомнитьСертификат	= Ложь;
	Кэш.Парам.Пароль				= "";
	СохранитьМеткиСтатусов(Кэш, ДопПараметры);
	
	СохранитьМеткиСтатусов(Кэш, ДопПараметры);

	Если Кэш.КэшНастроек.Свойство("ВыбранныеНастройки") Тогда 
		
		Кэш.КэшНастроек.Удалить("ВыбранныеНастройки");
		
	КонецЕсли;

КонецФункции
	
