
&НаКлиенте
Функция СохранитьМеткиСтатусов(Кэш, ДопПараметры = Неопределено) Экспорт	
	// Получение способа хранения меток статусов
	// 0 - Пользователя СБИС
	// 1 - Аккаунта СБИС
	// 2 - Информационной системы
	СпособХраненияМетокСтатусов	= Кэш.Парам.СпособХраненияМетокСтатусов;
	
	МеткиСтатусов = Кэш.ФормаНастроекОбщее.МеткиСтатусовПоУмолчанию();
	ЗаполнитьЗначенияСвойств(МеткиСтатусов, ГлавноеОкно);
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	ДопПараметры.Вставить("СпособХраненияМетокСтатусов", СпособХраненияМетокСтатусов);
			
	Кэш.ФормаНастроек.СбисСохранитьМеткиСтатусов(Кэш, МеткиСтатусов, ДопПараметры);
	
КонецФункции

&НаКлиенте
Функция ПрочитатьМеткиСтатусов(ПараметрыЧтения=Неопределено, ДопПараметры=Неопределено) Экспорт
	
	Возврат ГлавноеОкно.Кэш.ФормаНастроек.СбисПрочитатьМеткиСтатусов(ГлавноеОкно.Кэш);
                             
КонецФункции

// Процедура - периодическая процедура для синхронизации меток статусов у пользователя
//
// Параметры:
//  ДействиеОбновления	 - 	 - 
//  ДопПараметры		 - 	 - 
//
&НаКлиенте
Процедура  ОбновитьМеткиСтатусов(ПараметрыОбновить = Неопределено, ДопПараметры) Экспорт
	МеткиСтатусов = ПрочитатьМеткиСтатусов(ПараметрыОбновить, ДопПараметры);
	Если Не ЗначениеЗаполнено(МеткиСтатусов) Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ГлавноеОкно, МеткиСтатусов);
КонецПроцедуры

