
&НаСервереБезКонтекста
Функция БыстроеВнедрениеEDI_ПоискПартнераВКонтуре(Сторона) Экспорт

	ЗапросПартнера = Новый Запрос;
	ЗапросПартнера.Текст = "ВЫБРАТЬ
	                       |	КонтурEDI_ДополнительныеРеквизиты.Значение КАК Партнер
	                       |ИЗ
	                       |	РегистрСведений.КонтурEDI_ДополнительныеРеквизиты КАК КонтурEDI_ДополнительныеРеквизиты
	                       |ГДЕ
	                       |	КонтурEDI_ДополнительныеРеквизиты.Свойство = ""ПартнерКонтрагента""
	                       |	И КонтурEDI_ДополнительныеРеквизиты.Объект = &Сторона";
	
	ЗапросПартнера.УстановитьПараметр("Сторона", Сторона);

	РезультатПартнер = ЗапросПартнера.Выполнить().Выгрузить();
	Если РезультатПартнер.Количество() Тогда
		Возврат РезультатПартнер[0].Партнер; 
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции   

&НаКлиенте
Функция БыстроеВнедрениеEDI_ПолучитьДанныеСтороныПоИмени(СтороныДокумента, КлючСтороны, ДопПараметры = Неопределено) Экспорт
	
	Перем ДанныеСтороны;

	Если КлючСтороны = "Получатель"
		И (СтороныДокумента.Свойство("Получатель", ДанныеСтороны)
			Или СтороныДокумента.Свойство("Покупатель", ДанныеСтороны)) Тогда
			
			Возврат ДанныеСтороны;  
			
	ИначеЕсли КлючСтороны = "Отправитель" 
		И (СтороныДокумента.Свойство("Отправитель", ДанныеСтороны)
			Или СтороныДокумента.Свойство("Поставщик", ДанныеСтороны)) Тогда 
			
			Возврат ДанныеСтороны;		
			
	Иначе
			
		Возврат СтороныДокумента[КлючСтороны];  
		
	КонецЕсли;

КонецФункции
 
