
&НаКлиенте
Функция СбисФормат(ФорматнаяСтрока, ПараметрыФорматнойСтроки) Экспорт
	Результат = ФорматнаяСтрока;
	Если ПараметрыФорматнойСтроки.Свойство("Заменить") Тогда
		Для Каждого КлючИЗначение Из ПараметрыФорматнойСтроки.Заменить Цикл
			Результат = СтрЗаменить(Результат, "{" + КлючИЗначение.Ключ + "}", КлючИЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
КонецФункции

//Функция преобразует строку формата "25.10.2023 21.20.54" или "25.10.2023" в дату 
//для способа обмена SabyHttpsClient, где дата в ответах приходит строкой
&НаКлиенте
Функция ДатаИзСтроки(str) Экспорт
	
	Если ТипЗнч(str) = Тип("Дата") Тогда
		Возврат str;
	КонецЕсли;
	
	Результат = str;
	
	Если	Сред(str,3,1) = "."
		И	Сред(str,6,1) = "." Тогда
		//Переопределим значение как дату, если это действительно она
		Если		СтрДлина(str) = 10 Тогда
			Попытка
				Результат = Дата(Сред(str,7,4), Сред(str,4,2), Лев(str, 2));
			Исключение
				//В случае исключения, ничего не делаем. Это не дата, значение не меняется
			КонецПопытки;
		ИначеЕсли	СтрДлина(str) = 19 Тогда 
			Попытка
				Результат = Дата(Сред(str,7,4), Сред(str,4,2), Лев(str, 2), Сред(str,12, 2), Сред(str,15, 2), Сред(str,18, 2))
			Исключение
				//В случае исключения, ничего не делаем. Это не дата, значение не меняется
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции


