
&НаСервереБезКонтекста
Функция РеквизитСопоставленияНоменклатурыПоУмолчанию() Экспорт
	
	Если	Метаданные.Константы.Найти("ИспользоватьХарактеристикиНоменклатуры")<>Неопределено
		И	Константы.ИспользоватьХарактеристикиНоменклатуры.Получить() = Истина Тогда 
		Возврат "Идентификатор";
	Иначе
		Возврат "Код"
	КонецЕсли;

КонецФункции

&НаКлиенте
Функция ИспользоватьНовоеСопоставлениеНоменклатуры() Экспорт
	
	ТекСпособСопоставленияНоменклатуры = ПолучитьПараметрПользователя("СпособСопоставленияНоменклатуры");
	Возврат ТекСпособСопоставленияНоменклатуры = 0
		Или	(	ТекСпособСопоставленияНоменклатуры = 1
			И	ПолучитьПараметрПользователя("ИспользоватьНовоеСопоставлениеНоменклатуры"));
	
КонецФункции

