
&НаСервереБезКонтекста
Функция РеквизитСопоставленияНоменклатурыПоУмолчанию() Экспорт
	
	Если	Метаданные.Константы.Найти("ИспользоватьХарактеристикиНоменклатуры")<>Неопределено
		И	Константы.ИспользоватьХарактеристикиНоменклатуры.Получить() = Истина Тогда 
		Возврат "Идентификатор";
	Иначе
		Возврат "Код"
	КонецЕсли;

КонецФункции

// Функция - Обновляет глобальные параметры для работы с сопоставлением номенклатуры в зависимости от текущих настроек и фич
//
// Параметры:
//  ИниКонфигурации	 - ИниКонфигурации/Неопределено 
//  ДопПараметры	 - Структура/Неопределено 
// 
&НаКлиенте
Процедура ОбновитьПараметрыСопоставленияНоменклатуры(ИниКонфигурации = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если ИниКонфигурации = Неопределено Тогда
		ИниКонфигурации = ИниПоПараметрам("Конфигурация");
	КонецЕсли;
	
	Кэш = ПолучитьТекущийЛокальныйКэш();
	
	РасширенныйФункционалСопоставленияНоменклатуры =	(ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры") 
															ИЛИ ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры4100"))
														И ПолучитьЗначениеПараметраСБИС("ИспользоватьНовоеСопоставлениеНоменклатуры");
	КаталогСопоставлениеНаСервере				   = Кэш.ОбщиеФункции.РассчитатьЗначение("ФормаРаботыСНоменклатуройПоставщика_КаталогНаСервере",	ИниКонфигурации);
	
	Если РасширенныйФункционалСопоставленияНоменклатуры Тогда
			
		// Установка дополнительных форм
		// Устанавливаем форму сопоставления от сохр. значения СпособСопоставленияНоменклатуры
		ИзменитьПараметрСбис("СпособСопоставленияНоменклатуры",	ПолучитьЗначениеПараметраСбис("СпособСопоставленияНоменклатуры"));
		ИзменитьПараметрСбис("ЕстьЕдиницыНаФормеПросмотра",		Истина);
		
		ФормаРаботыСНоменклатуройOLD = Кэш.ОбщиеФункции.РассчитатьЗначение("НоменклатураПоставщиков", ИниКонфигурации);
		Если Лев(ФормаРаботыСНоменклатуройOLD, 10) = "Справочник" Тогда
			ФормаРаботыСНоменклатуройOLD = "СопоставлениеНоменклатуры_Справочники"; 
		ИначеЕсли Лев(ФормаРаботыСНоменклатуройOLD, 7) = "Регистр" Тогда
			ФормаРаботыСНоменклатуройOLD = "СопоставлениеНоменклатуры_Регистры"; 
		КонецЕсли;   
		
		Отказ = Ложь;
		ФормаРаботыСоСопоставлениемOLD	= Кэш.ГлавноеОкно.СбисПолучитьФормуОбработки(Кэш, ФормаРаботыСНоменклатуройOLD, Новый Структура, Отказ); 
		Попытка
			ФормаРаботыСоСопоставлениемOLD.УстановитьПараметрыМодуля(Новый Структура("Каталог", КаталогСопоставлениеНаСервере), Кэш);
		Исключение
			//Ничего не делаем
		КонецПопытки;
		
		ИзменитьПараметрТекущегоСеанса("ФормаРаботыСНоменклатуройOLD", ФормаРаботыСоСопоставлениемOLD);   
				
	Иначе
		
		ФормаРаботыСНоменклатурой		= Кэш.ОбщиеФункции.РассчитатьЗначение("ФормаРаботыСНоменклатуройПоставщика",					ИниКонфигурации);
		
		// Меняем форму работы с номенклатурой
		Если Кэш.Парам.СпособХраненияНастроек = 1 Тогда
			
			СБИС_НоменклатураПоставщиков = Кэш.ОбщиеФункции.РассчитатьЗначение("НоменклатураПоставщиков", ИниКонфигурации);
			
			// если настройки хранятся на сервере, то номенклатуру сопоставляем не в каталоге
			Если Не ЗначениеЗаполнено(СБИС_НоменклатураПоставщиков) Тогда
			ИначеЕсли	Лев(СБИС_НоменклатураПоставщиков,10) = "Справочник" Тогда
				
				ФормаРаботыСНоменклатурой = "СопоставлениеНоменклатуры_Справочники";
				
			ИначеЕсли	Лев(СБИС_НоменклатураПоставщиков,7) = "Регистр" Тогда
				
				ФормаРаботыСНоменклатурой = "СопоставлениеНоменклатуры_Регистры";
				
			КонецЕсли;
			
		КонецЕсли; 
		
		Отказ = Ложь;
		
		ФормаРаботыСоСопоставлением		= Кэш.ГлавноеОкно.СбисПолучитьФормуОбработки(Кэш, ФормаРаботыСНоменклатурой, Новый Структура, Отказ);

		Если Отказ Тогда
			
			ИсключениеУстановки = НовыйСбисИсключение(ФормаРаботыСоСопоставлением, "ФайлыНастроекОбщее.УстановитьИниКонфигурации");
			ВызватьИсключение СбисИсключение_ВСтроку(ИсключениеУстановки);
			
		КонецЕсли;
		Попытка
			ФормаРаботыСоСопоставлением.УстановитьПараметрыМодуля(Новый Структура("Каталог", КаталогСопоставлениеНаСервере), Кэш);
		Исключение
			//Исключение не обрабатываем, отвалиться может только в случае, если форма вынесена в внешние функции
		КонецПопытки;
		
		фрм = Кэш.ГлавноеОкно.СбисНайтиФормуФункции("Инициализировать", ФормаРаботыСНоменклатурой);
		Если фрм <> Ложь Тогда
			
			фрм.Инициализировать(Кэш);
			
		КонецЕсли;
	
		//+++ 1186694647 TODO Спилить и сделать видимым всегда - после завершения проекта по сопоставлению номенклатуры.
		ЕстьЕдиницыНаФормеПросмотра = Не	(	ФормаРаботыСНоменклатурой = "СопоставлениеНоменклатуры_Регистры"
											Или ФормаРаботыСНоменклатурой = "СопоставлениеНоменклатуры_Справочники"
											Или	ФормаРаботыСНоменклатурой = "СопоставлениеНоменклатуры_СуммовойУчет");
											
		ИзменитьПараметрСбис("ИмяМодуляРаботыСНоменклатурой",	ФормаРаботыСНоменклатурой);
		ИзменитьПараметрСбис("ЕстьЕдиницыНаФормеПросмотра", ЕстьЕдиницыНаФормеПросмотра);
		
		ИзменитьПараметрТекущегоСеанса("МодульСопоставлениеНоменклатуры", ФормаРаботыСоСопоставлением);
		ИзменитьПараметрТекущегоСеанса("ИмяМодуляСопоставленияНоменклатуры", ФормаРаботыСоСопоставлением.ИмяФормы);
		
	КонецЕсли;
	
КонецПроцедуры

