
// Процедура собирает статистику и отправляет на сервис.
//
// Параметры:
//  ПараметрыСтатистики	 - Структура	 - Действие
//  ДопПараметры		 - Структура	 - 
//
&НаКлиенте
Процедура СбисСтатистика_СформироватьИЗаписать(ПараметрыСтатистики, ДопПараметры = Неопределено) Экспорт
	                                                                                                                
	// При отключенном обмене или без авторизации записать ничего не сможем.
	Если Не (ПолучитьЗначениеПараметраСбис("ОбменВключен") И ПолучитьЗначениеПараметраСбис("Авторизован")) Тогда
		Возврат;
	КонецЕсли; 
	
	Попытка 
		
		ДанныеСтатистики = СбисСтатистика_СформироватьДанныеСообщений(ПараметрыСтатистики, ДопПараметры);
		Отказ = Ложь; 
		
		Для Каждого СообщениеСтатистики Из ДанныеСтатистики.Сообщения Цикл 
			
			РезультатОтправки = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.СбисОтправитьСообщениеСтатистики(ГлавноеОкно.Кэш, СообщениеСтатистики, Отказ); 
			
			Если Отказ Тогда
				ВызватьСбисИсключение(РезультатОтправки, ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".СбисОтправитьСообщениеСтатистики");;
			КонецЕсли;  
			
		КонецЦикла;
		
		Для Каждого СообщениеОбОшибке Из ДанныеСтатистики.Ошибки Цикл
			
			РезультатОтправки = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.СбисОтправитьСообщениеОшибки(ГлавноеОкно.Кэш, СообщениеОбОшибке, Отказ);
			
			Если Отказ Тогда
				ВызватьСбисИсключение(РезультатОтправки, ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".СбисОтправитьСообщениеОшибки");;
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СообщениеСтатистики Из ДанныеСтатистики.Прикладная Цикл 
			
			ДопПараметрыОтправки = Новый Структура("Кэш", ГлавноеОкно.Кэш);
			РезультатОтправки = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ExtSysMarking_SendStatisticData(СообщениеСтатистики, ДопПараметрыОтправки, Отказ);
			
			Если Отказ Тогда
				ВызватьСбисИсключение(РезультатОтправки, ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".ExtSysMarking_SendStatisticData");;
			КонецЕсли;    
			
		КонецЦикла;    
		
	Исключение   
		
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ВызватьСбисИсключение(ИнфоОбОшибке, "МодульОбъектКлиент.СбисСтатистика_СформироватьИЗаписать");
		
	КонецПопытки;           
	
КонецПроцедуры

//Функция, в зависимости от выбранного действия, формирует параметры к отправке на сервис статистики
&НаКлиенте
Функция СбисСтатистика_СформироватьДанныеСообщений(ПараметрыСтатистики, ДопПараметры = Неопределено)
    Результат = Новый Структура("Сообщения, Ошибки, Прикладная", Новый Массив, Новый Массив, Новый Массив);
    
    // Инициализация параметров
    Если Не ПараметрыСтатистики.Свойство("ИмяРеестра") Тогда
        ПараметрыСтатистики.Вставить("ИмяРеестра", ГлавноеОкно.Кэш.Текущий.ТипДок);
    КонецЕсли;
    
    Действие = ПараметрыСтатистики.Действие;
    
    // Выбор обработки в зависимости от действия
    Если Действие = "Отправка" Тогда
        ОбработатьОтправку(ПараметрыСтатистики, Результат);
        
    ИначеЕсли Действие = "Загрузка" Тогда
        ОбработатьЗагрузку(ПараметрыСтатистики, Результат);
        
    ИначеЕсли Действие = "Ошибка" Тогда
        ОбработатьОшибку(ПараметрыСтатистики, Результат);
        
    ИначеЕсли Действие = "Обновление" Тогда
        ОбработатьОбновление(ПараметрыСтатистики, Результат);
        
    ИначеЕсли Действие = "Аутентификация" Тогда
        ОбработатьАутентификацию(ПараметрыСтатистики, Результат);
        
    ИначеЕсли Действие = "ПрикладнаяСтатистика" Тогда
        ОбработатьПрикладнуюСтатистику(ПараметрыСтатистики, Результат);
        
    КонецЕсли;
    
    Возврат Результат;
КонецФункции

&НаКлиенте
Функция ОбработатьОшибку(ПараметрыСтатистики, Результат)
    СбисСтек = Неопределено;
    ПараметрыСообщения = Новый Структура("count, code, action_param, action_name, error_name, error_detail, Прикладная", 
        1, 100, "Ошибка", "Ошибка");
    
    Если Не ПараметрыСтатистики.Ошибка.Свойство("stack", СбисСтек) Тогда
        СбисСтек = Новый Массив;
        ЗаписьВСтек = ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.СбисСкопироватьОбъектНаКлиенте(ПараметрыСтатистики.Ошибка);
        СбисСтек.Добавить(ЗаписьВСтек);
    КонецЕсли;
    
    ПараметрыСообщения.code = Формат(ПараметрыСтатистики.Ошибка.code, "ЧГ=0");
    ПараметрыСообщения.error_name = ПараметрыСтатистики.Ошибка.message;
    ПараметрыСообщения.error_detail = ПараметрыСтатистики.Ошибка.details;
    
    НовоеСообщение = СбисСтатистика_СформироватьСтруктуруОшибки(ПараметрыСообщения);
    НовоеСообщение.data.Вставить("stack", СбисСтек);
	СформированнаяОшибка = СбисСтатистика_СформироватьСтатистикуОшибокДляIntegration(ПараметрыСообщения, НовоеСообщение);
    Результат.Ошибки.Добавить(СформированнаяОшибка);
КонецФункции

&НаКлиенте
Функция ОбработатьОтправку(ПараметрыСтатистики, Результат)
    РезультатОтправки = ПараметрыСтатистики.РезультатОтправки;
    
    // Успешная отправка
    Если РезультатОтправки.Отправлено Тогда
        ПараметрыСообщения = Новый Структура("count, action_param, action_name, name_integration, Прикладная", 
            РезультатОтправки.Отправлено, ПараметрыСтатистики.ИмяРеестра, "Отправка", "Import", РезультатОтправки.ПрикладнаяСтатистика);
        НовоеСообщение = СбисСтатистика_СформироватьСтатистикуДляIntegration(ПараметрыСообщения);
        Результат.Сообщения.Добавить(НовоеСообщение);
    КонецЕсли;
    
    // Ошибки отправки
    Если РезультатОтправки.Ошибок Тогда
        ОбработатьОшибкиОтправки(РезультатОтправки, ПараметрыСтатистики, Результат);
    КонецЕсли;
КонецФункции       

&НаКлиенте
Функция ОбработатьОшибкиОтправки(РезультатОтправки, ПараметрыСтатистики, Результат)
    Для Каждого ОшибкаОтправки Из РезультатОтправки.ДетализацияОшибок Цикл
        ПараметрыСообщения = Новый Структура("count, code, action_param, action_name, error_name, error_detail, Прикладная", 
            0, 100, ПараметрыСтатистики.ИмяРеестра, "Отправка", РезультатОтправки.ПрикладнаяСтатистика);
        ТекстОшибки = ОшибкаОтправки.Ключ;
        ПараметрыСообщения.error_name = ТекстОшибки;
        ПараметрыСообщения.code = 100;
        
        // Поиск соответствия кодов ошибок
        Если РезультатОтправки.Свойство("СоответствиеКодовИТекстовОшибок") Тогда
            КодОшибки = РезультатОтправки.СоответствиеКодовИТекстовОшибок.Получить(ТекстОшибки);
            Если КодОшибки <> Неопределено Тогда
                ПараметрыСообщения.code = Формат(КодОшибки, "ЧГ=0");
            КонецЕсли;
        КонецЕсли;
        
        Для Каждого ДетализацияОшибки Из ОшибкаОтправки.Значение Цикл
            ОбработатьДетализациюОшибки(ДетализацияОшибки, ПараметрыСообщения, Результат);
        КонецЦикла;
    КонецЦикла;
КонецФункции  

&НаКлиенте
Функция ОбработатьДетализациюОшибки(ДетализацияОшибки, ПараметрыСообщения, Результат)
    СбисСтек = Неопределено;
    Если Не ДетализацияОшибки.СтруктураОшибки.Свойство("stack", СбисСтек) Тогда
        СбисСтек = Новый Массив;
        ЗаписьВСтек = Новый Структура("message,details,code");
        ЗаполнитьЗначенияСвойств(ЗаписьВСтек, ДетализацияОшибки.СтруктураОшибки);
        ЗаписьВСтек.Вставить("method_name", "WriteDocumentEx");
        Если ДетализацияОшибки.СтруктураОшибки.Свойство("dump") Тогда
            ЗаписьВСтек.Вставить("dump", ДетализацияОшибки.СтруктураОшибки.dump);
        КонецЕсли;
        СбисСтек.Добавить(ЗаписьВСтек);
    КонецЕсли;
    
    ПараметрыОтправки = Новый Структура;
    ПараметрыОтправки.Вставить("ini_name", ПараметрыСообщения.action_param);
	Если ДетализацияОшибки.Свойство("ОбработанДокумент1С") Тогда
    	ПараметрыОтправки.Вставить("value", Строка(ДетализацияОшибки.ОбработанДокумент1С));
	КонецЕсли;
    ПараметрыОтправки.Вставить("type", "ДокументСсылка." + ПараметрыСообщения.action_param);
    
    ПараметрыСообщения.error_detail = ДетализацияОшибки.Сообщение;
    НовоеСообщение = СбисСтатистика_СформироватьСтруктуруОшибки(ПараметрыСообщения);
    НовоеСообщение.data.Вставить("stack", СбисСтек);
    НовоеСообщение.data.Вставить("param", ПараметрыОтправки);
	СформированнаяОшибка = СбисСтатистика_СформироватьСтатистикуОшибокДляIntegration(ПараметрыСообщения, НовоеСообщение);
    Результат.Ошибки.Добавить(СформированнаяОшибка);
КонецФункции 

&НаКлиенте
Функция ОбработатьЗагрузку(ПараметрыСтатистики, Результат)
	РезультатОтправки = ПараметрыСтатистики.Результат;
    Если ПараметрыСтатистики.Результат.Всего.Выполнено Тогда
        ПараметрыСообщения = Новый Структура("count, action_param, action_name, name_integration, Прикладная", 
            ПараметрыСтатистики.Результат.Всего.Выполнено, ПараметрыСтатистики.ИмяРеестра, "Загрузка", "Export", РезультатОтправки.ПрикладнаяСтатистика);
        НовоеСообщение = СбисСтатистика_СформироватьСтатистикуДляIntegration(ПараметрыСообщения);
        Результат.Сообщения.Добавить(НовоеСообщение);
    КонецЕсли;
    
    Для Каждого ОшибкаЗагрузки Из ПараметрыСтатистики.Результат.Ошибки.ДетализацияОшибок Цикл
        ОбработатьОшибкиЗагрузки(ОшибкаЗагрузки, ПараметрыСтатистики, Результат);
    КонецЦикла;
КонецФункции 

&НаКлиенте
Функция ОбработатьОшибкиЗагрузки(ОшибкаЗагрузки, ПараметрыСтатистики, Результат)
	РезультатОтправки = ПараметрыСтатистики.Результат;
    ПараметрыСообщения = Новый Структура("count, code, action_param, action_name, error_name, error_detail, Прикладная", 
        1, 100, ПараметрыСтатистики.ИмяРеестра, "Загрузка", РезультатОтправки.ПрикладнаяСтатистика);
    ТекстОшибки = ОшибкаЗагрузки.Ключ;
    ПараметрыСообщения.error_name = ТекстОшибки;
    ПараметрыСообщения.code = 100;
    
    КодОшибки = ПараметрыСтатистики.Результат.Ошибки.СоответствиеКодов.Получить(ТекстОшибки);
    Если КодОшибки <> Неопределено Тогда
        ПараметрыСообщения.code = Формат(КодОшибки, "ЧГ=0");
    КонецЕсли;
    
    Для Каждого ДетализацияОшибки Из ОшибкаЗагрузки.Значение Цикл
        ОбработатьДетализациюОшибкиЗагрузки(ДетализацияОшибки, ПараметрыСообщения, Результат);
    КонецЦикла;
КонецФункции 

&НаКлиенте
Функция ОбработатьДетализациюОшибкиЗагрузки(ДетализацияОшибки, ПараметрыСообщения, Результат)
    СбисСтек = Новый Массив;
    ЗаписьВСтек = Новый Структура("message, details, code, method_name", 
        ДетализацияОшибки.Состояние, ДетализацияОшибки.Сообщение, ПараметрыСообщения.code, "ЗагрузитьУпорядоченныйСоставПакетаВыбраннымСпособом");
    
    СбисДампОшибки = Новый Структура;
    ПараметрыОтправки = Новый Структура;
    ПараметрыОтправки.Вставить("ini_name", ПараметрыСообщения.action_param);
    
    Для Каждого СбисОбработанОбъект Из ДетализацияОшибки.ОбработаныОбъекты1С Цикл
        Если Не СбисОбработанОбъект.Ошибки Тогда
            Продолжить;
        КонецЕсли;
        
        Если ПараметрыОтправки.Свойство("value") Тогда
            СбисДампДополнительныеОбъекты = Неопределено;
            Если Не СбисДампОшибки.Свойство("ДополнительныеОбъекты", СбисДампДополнительныеОбъекты) Тогда
                СбисДампДополнительныеОбъекты = Новый Массив;
                СбисДампОшибки.Вставить("ДополнительныеОбъекты", СбисДампДополнительныеОбъекты);
            КонецЕсли;
            СбисДампДополнительныеОбъекты.Добавить(Новый Структура("value, type", Строка(СбисОбработанОбъект.Ссылка), СбисОбработанОбъект.Тип));
            Продолжить;
        КонецЕсли;
        
        ПараметрыОтправки.Вставить("value", Строка(СбисОбработанОбъект.Ссылка));
        ПараметрыОтправки.Вставить("type", СбисОбработанОбъект.Тип);
    КонецЦикла;
    
    Если ЗначениеЗаполнено(СбисДампОшибки) Тогда
        ЗаписьВСтек.Вставить("dump", СбисДампОшибки);
    КонецЕсли;
    
    СбисСтек.Добавить(ЗаписьВСтек);
    ПараметрыСообщения.error_detail = ДетализацияОшибки.Сообщение;
    НовоеСообщение = СбисСтатистика_СформироватьСтруктуруОшибки(ПараметрыСообщения);
    НовоеСообщение.data.Вставить("stack", СбисСтек);
    НовоеСообщение.data.Вставить("param", ПараметрыОтправки);
	СформированнаяОшибка = СбисСтатистика_СформироватьСтатистикуОшибокДляIntegration(ПараметрыСообщения, НовоеСообщение);
    Результат.Ошибки.Добавить(СформированнаяОшибка);
КонецФункции 

&НаКлиенте
Функция ОбработатьАутентификацию(ПараметрыСтатистики, Результат)
	РезультатОтправки = ПараметрыСтатистики.РезультатОтправки;
    ДетальноеСообщение = ПараметрыСтатистики.ДетальноеСообщение;
    ПараметрыСообщения = Новый Структура("count, action_param, action_name, name_integration, Прикладная", 
	1, ДетальноеСообщение, "Аутентификация", "Auth", РезультатОтправки.ПрикладнаяСтатистика);
    НовоеСообщение = СбисСтатистика_СформироватьСтатистикуДляIntegration(ПараметрыСообщения);
    Результат.Сообщения.Добавить(НовоеСообщение);
КонецФункции   

&НаКлиенте
Функция ОбработатьПрикладнуюСтатистику(ПараметрыСтатистики, Результат)
    ФункционалПрикладнойИмя = "Обработка 1С";
    
    Если ТипЗнч(ПараметрыСтатистики.Сообщения) = Тип("Структура") Тогда
        ПараметрыСообщения = Новый Структура("Функционал, Количество, Действие, Контекст", ФункционалПрикладнойИмя, 1);
        ЗаполнитьЗначенияСвойств(ПараметрыСообщения, ПараметрыСтатистики.Сообщения);
        Результат.Прикладная.Добавить(ПараметрыСообщения);
        
    ИначеЕсли ТипЗнч(ПараметрыСтатистики.Сообщения) = Тип("Массив") Тогда
        Для Каждого ЭлементНаЗапись Из ПараметрыСтатистики.Сообщения Цикл
            ПараметрыСообщения = Новый Структура("Функционал, Количество, Действие, Контекст", ФункционалПрикладнойИмя, 1);
            ЗаполнитьЗначенияСвойств(ПараметрыСообщения, ЭлементНаЗапись);
            Результат.Прикладная.Добавить(ПараметрыСообщения);
        КонецЦикла;
        
    Иначе
        ПараметрыСообщения = Новый Структура("Функционал, Количество, Действие, Контекст", ФункционалПрикладнойИмя, 1);
        СтрокаРазделить = СтрЗаменить(ПараметрыСтатистики.Сообщения, ".", Символы.ПС);
        ПараметрыСообщения.Контекст = СтрПолучитьСтроку(СтрокаРазделить, 1);
        ПараметрыСообщения.Действие = СтрПолучитьСтроку(СтрокаРазделить, 2);
        Результат.Прикладная.Добавить(ПараметрыСообщения);
    КонецЕсли;
КонецФункции

&НаКлиенте
Функция ОбработатьОбновление(ПараметрыСтатистики, Результат)
    ПараметрыСтатистикиОтправка = Новый Структура;
    Отказ = Ложь;
    
    // Получаем данные по настройкам
    ДанныеПоНастройкам = ГлавноеОкно.Кэш.ФормаНастроек.ПолучитьИнформациюПоНастройкам(ГлавноеОкно.Кэш, ПараметрыСтатистикиОтправка, Отказ);
    
    // Формируем дамп данных
    Дамп = СформироватьДампДляОбновления(ДанныеПоНастройкам);
    
    // Обрабатываем ошибки обновления
    ОбработатьОшибкиОбновления(ПараметрыСтатистики, Дамп, Результат);
    
    // Формируем сообщение о выполненных действиях
    ОбработатьДействияОбновления(ПараметрыСтатистики, Дамп, Результат);
КонецФункции 

&НаКлиенте
Функция СформироватьДампДляОбновления(ДанныеПоНастройкам)
    Дамп = Новый Структура("Действия, Xslt, Ини, Функции", Новый Массив, Новый Массив, Новый Массив, ДанныеПоНастройкам.EPF.ЕстьИзменения);
    
    // Добавляем XSLT файлы
    Для Каждого ФайлНастроек Из ДанныеПоНастройкам.XSLT Цикл
        Если Не ФайлНастроек.ЕстьИзменения Или Найти(ФайлНастроек.ИмяФайла, "Утвердить") Тогда
            Продолжить; // Пропускаем файлы без изменений или связанные с титулами
        КонецЕсли;
        Дамп.Xslt.Добавить(Новый Структура("file_name", ФайлНастроек.ИмяФайла));
    КонецЦикла;
    
    // Добавляем INI файлы
    Для Каждого ФайлНастроек Из ДанныеПоНастройкам.XML Цикл
        Если Не ФайлНастроек.ЕстьИзменения Тогда
            Продолжить;
        КонецЕсли;
        Дамп.Ини.Добавить(Новый Структура("ini_name", ФайлНастроек.Ини_ИмяИни));
    КонецЦикла;
    
    Возврат Дамп;
КонецФункции   

&НаКлиенте
Функция ОбработатьОшибкиОбновления(ПараметрыСтатистики, Дамп, Результат)
    РезультатДействия = ПараметрыСтатистики.Результат;
    ПараметрыСообщения = Новый Структура("count, code, action_param, action_name, error_name, error_detail", 0, 100, "Ошибка обновления", "Обновление");
    
    Для Каждого ОшибкаДействия Из РезультатДействия.Ошибки.ДетализацияОшибок Цикл
        ТекстОшибки = ОшибкаДействия.Ключ;
        ПараметрыСообщения.count = 1;
        ПараметрыСообщения.error_name = ТекстОшибки;
        
        // Определяем код ошибки
        КодОшибки = РезультатДействия.Ошибки.СоответствиеКодов.Получить(ТекстОшибки);
        Если КодОшибки <> Неопределено Тогда
            ПараметрыСообщения.code = Формат(КодОшибки, "ЧГ=0");
        КонецЕсли;
        
        Для Каждого ДетализацияОшибки Из ОшибкаДействия.Значение Цикл
            ОбработатьДетализациюОшибкиОбновления(ДетализацияОшибки, ПараметрыСообщения, Дамп, Результат);
        КонецЦикла;
    КонецЦикла;
КонецФункции 

&НаКлиенте
Функция ОбработатьДействияОбновления(ПараметрыСтатистики, Дамп, Результат)
    РезультатДействия = ПараметрыСтатистики.Результат;
    
    // Добавляем выполненные действия в дамп
    Для Каждого ДействиеПриОбновлении Из РезультатДействия.Действие.ДетализацияВыполнено Цикл
        Дамп.Действия.Добавить(Новый Структура("update_action_name", ДействиеПриОбновлении.Ключ));
    КонецЦикла;
    
    // Формируем сообщение о выполненных действиях
    ПараметрыСообщения = Новый Структура("count, action_param, action_name, data, name_integration", 
	1, РезультатДействия.Параметры.ВерсияБыло, "Обновление", Дамп, "UpdateProduct");
    НовоеСообщение = СбисСтатистика_СформироватьСтатистикуДляIntegration(ПараметрыСообщения);
    Результат.Сообщения.Добавить(НовоеСообщение);
КонецФункции


&НаКлиенте
Функция ОбработатьДетализациюОшибкиОбновления(ДетализацияОшибки, ПараметрыСообщения, Дамп, Результат)
    СбисСтек = Неопределено;
    
    // Генерируем стек ошибки, если он отсутствует
    Если Не ДетализацияОшибки.Данные.Свойство("stack", СбисСтек) Тогда
        СбисСтек = Новый Массив;
        ЗаписьВСтек = Новый Структура("message, details, code");
        ЗаполнитьЗначенияСвойств(ЗаписьВСтек, ДетализацияОшибки.Данные);
        ЗаписьВСтек.Вставить("method_name", "Обновление");
        Если ДетализацияОшибки.Данные.Свойство("dump") Тогда
            ЗаписьВСтек.Вставить("dump", ДетализацияОшибки.Данные.dump);
        КонецЕсли;
        СбисСтек.Добавить(ЗаписьВСтек);
    КонецЕсли;
    
    ПараметрыОтправки = ДетализацияОшибки.Данные.dump;
    ПараметрыСообщения.error_detail = ДетализацияОшибки.Сообщение;
    
    НовоеСообщение = СбисСтатистика_СформироватьСтруктуруОшибки(ПараметрыСообщения);
    НовоеСообщение.data.Вставить("stack", СбисСтек);
    НовоеСообщение.data.Вставить("param", ПараметрыОтправки);
	СформированнаяОшибка = СбисСтатистика_СформироватьСтатистикуОшибокДляIntegration(ПараметрыСообщения, НовоеСообщение);
    Результат.Ошибки.Добавить(СформированнаяОшибка);
КонецФункции

//Функция генерирует сообщение об успешной операции на сервис статистики
&НаКлиенте
Функция СбисСтатистика_СформироватьСтруктуруОперации(ПараметрыСтатистики)
	СтруктураПараметров = Новый Структура();
	Для Каждого КлючИЗначение Из ПараметрыСтатистики Цикл 
		СтруктураПараметров.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	СтруктураПараметров.Вставить("service",		"ext1C");
	СтрокаМодуль = ГлобальныйКэш.ПараметрыСистемы.Обработка.КраткаяВерсия + "_" + ГлобальныйКэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя;
	СтруктураПараметров.Вставить("module", 			СтрокаМодуль);
	СтруктураПараметров.Вставить("subsystem",		ГлобальныйКэш.КэшНастроек.ПараметрыНастроек.ПрефиксУстановленныхНастроек);
	СтруктураПараметров.Вставить("connection_id",	"0");//connection_id не передаем.
	
	Возврат СтруктураПараметров;
	
КонецФункции    

&НаКлиенте
Функция СбисСтатистика_СформироватьСтатистикуДляIntegration(ПараметрыСтатистики)
	
	ПараметрыСистемы = ГлобальныйКэш_Получить("ПараметрыСистемы");
	СведенияОбИнтеграции	= ПолучитьЗначениеПараметраТекущегоСеанса("СведенияОбИнтеграции");
	КэшНастроек =  ГлобальныйКэш_Получить("КэшНастроек"); 
	
	Если ПараметрыСтатистики.Свойство("ActionData") Тогда
		ActionData = ПараметрыСтатистики.ActionData;
	Иначе
		ActionData = Новый Структура;
	КонецЕсли;
	
	Если ПараметрыСтатистики.Свойство("Count") Тогда
		Количество = ПараметрыСтатистики.Count;
	Иначе
		Количество = 1;
	КонецЕсли;
	
	Если ПараметрыСтатистики.Свойство("name_integration") Тогда
        action = ПараметрыСтатистики.name_integration;
	Иначе 
		action = "Other";
	КонецЕсли;
	
	Если ПараметрыСтатистики.Свойство("Прикладная") И ПараметрыСтатистики.Прикладная <> Неопределено Тогда
		ActionContext = ПрикладнаяСтатистика_ПолучитьПараметр(ПараметрыСтатистики.Прикладная, "ТипДокумента");
	Иначе 
		ActionContext = "";
	КонецЕсли;
	
	Статистика = Новый Структура;
	SystemInfo = Новый Структура;
	SystemInfo.Вставить("ExtSysType",			"1C");
	SystemInfo.Вставить("ExtSysSubtype",		КэшНастроек.ПараметрыНастроек.ПрефиксУстановленныхНастроек);//из Кэша
	SystemInfo.Вставить("ExtSysVersion",		ПараметрыСистемы.Конфигурация.Версия);//из Кэша
	SystemInfo.Вставить("Product",				ПараметрыСистемы.Обработка.ИмяПродукта);//собираем из Кэша пример vo2_1c_82_of
	SystemInfo.Вставить("ProductVersion",		ПараметрыСистемы.Обработка.Версия);// версия обработки ProductVersion
	SystemInfo.Вставить("Connector",			СведенияОбИнтеграции.Параметры.ИмяКоннкетора);//
	SystemInfo.Вставить("ApiType",				"edo");
	SystemInfo.Вставить("CustomizationType",	"301");
	МассивActions = Новый Массив;
	Actions = Новый Структура;
	Actions.Вставить("ActionName",				action);
	Actions.Вставить("ActionContext",			ActionContext);
	Actions.Вставить("ActionData", 				ActionData);
	Actions.Вставить("ActionCount",				Количество);
	Статистика.Вставить("SystemInfo",			SystemInfo); 
	МассивActions.Добавить(Actions);
	Статистика.Вставить("Actions",				МассивActions);
	
	Возврат Статистика
КонецФункции   
&НаКлиенте
Функция СбисСтатистика_СформироватьСтатистикуОшибокДляIntegration(ПараметрыСтатистики, НовоеСообщение)
	
	ПараметрыСистемы = ГлобальныйКэш_Получить("ПараметрыСистемы");
	СведенияОбИнтеграции	= ПолучитьЗначениеПараметраТекущегоСеанса("СведенияОбИнтеграции");
	КэшНастроек =  ГлобальныйКэш_Получить("КэшНастроек"); 
	action = "Other";
	Количество = 1;
	
	Если ПараметрыСтатистики.Свойство("Прикладная") И ПараметрыСтатистики.Прикладная <> Неопределено Тогда
		ActionContext = ПрикладнаяСтатистика_ПолучитьПараметр(ПараметрыСтатистики.Прикладная, "ТипДокумента");
	Иначе 
		ActionContext = "Ошибка";
	КонецЕсли;
	
	Если ПараметрыСтатистики.Свойство("Ошибка") Тогда
        ErrorMessage = ПараметрыСтатистики.Ошибка.message;
		ErrorDetail = ПараметрыСтатистики.Ошибка.details;
		ErrorCode = ПараметрыСтатистики.Ошибка.code;	
	Иначе 
		ErrorMessage = ПараметрыСтатистики.error_name;
		ErrorDetail = ПараметрыСтатистики.error_detail;
		ErrorCode = ПараметрыСтатистики.code;
	КонецЕсли;
		
	Статистика = Новый Структура;
	SystemInfo = Новый Структура;
	SystemInfo.Вставить("ExtSysType",			"1C");
	SystemInfo.Вставить("ExtSysSubtype",		КэшНастроек.ПараметрыНастроек.ПрефиксУстановленныхНастроек);
	SystemInfo.Вставить("ExtSysVersion",		ПараметрыСистемы.Конфигурация.Версия);
	SystemInfo.Вставить("Product",				ПараметрыСистемы.Обработка.ИмяПродукта);
	SystemInfo.Вставить("ProductVersion",		ПараметрыСистемы.Обработка.Версия);
	SystemInfo.Вставить("Connector",			СведенияОбИнтеграции.Параметры.ИмяКоннкетора);
	SystemInfo.Вставить("ApiType",				"edo");
	SystemInfo.Вставить("CustomizationType",	"301");
	МассивErrors = Новый Массив;
	Errors = Новый Структура;
	Errors.Вставить("ActionName",				action);
	Errors.Вставить("ActionContext",			ActionContext);
	Errors.Вставить("ErrorData", 				НовоеСообщение.data);
	Errors.Вставить("ErrorCount",				1);
	Errors.Вставить("ErrorMessage",				ErrorMessage);
	Errors.Вставить("ErrorDetail",				ErrorDetail);
	Errors.Вставить("ErrorCode",				ErrorCode);
	Статистика.Вставить("SystemInfo",			SystemInfo); 
	МассивErrors.Добавить(Errors);
	Статистика.Вставить("Errors",				МассивErrors);
	
	Возврат Статистика
КонецФункции

//Функция генерирует готовое сообщение об ошибке для сервиса статистики
&НаКлиенте
Функция СбисСтатистика_СформироватьСтруктуруОшибки(ПараметрыСтатистики)
	СтруктураПараметров = СбисСтатистика_СформироватьСтруктуруОперации(ПараметрыСтатистики);
	//Добавим в data поля шапки статистики
	stat_data = ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.СбисСкопироватьОбъектНаКлиенте(СтруктураПараметров);
	//Допишем информацию о системе для записи.
	system_info = Новый Структура;
	system_info.Вставить("configuration_info",		ГлобальныйКэш.ПараметрыСистемы.Конфигурация.ПодробнаяИнформация);
	system_info.Вставить("configuration_version",	ГлобальныйКэш.ПараметрыСистемы.Конфигурация.Версия);
	system_info.Вставить("platform_version",		ГлобальныйКэш.ПараметрыСистемы.Клиент.ВерсияПриложения);
	system_info.Вставить("os_client",				ГлобальныйКэш.ПараметрыСистемы.Клиент.ТипОС);
	system_info.Вставить("os_server",				ГлобальныйКэш.ПараметрыСистемы.Сервер.ТипОС);
	system_info.Вставить("first_launch",			ПолучитьЗначениеПараметраТекущегоСеанса("ПервыйЗапуск"));
	system_info.Вставить("sdk_version",				ГлобальныйКэш.СБИС.ПараметрыИнтеграции.Версия);
	stat_data.Вставить("systemInfo", system_info);
	СтруктураПараметров.Вставить("data", stat_data);
	Возврат СтруктураПараметров;		
	
КонецФункции

