
// Функция получает транспортные упаковки с документа, возвращает результат работы метода ExtSysMarking.ExtSysMarking_NumList
//
// Параметры:
//  СписокПараметровВызова - Структура - параметры для вызова функции онлайна  
//  ДопПараметры - Структура - Набор полей, работа с которыми может расширить результат работы функции. 
// 
// Возвращаемое значение:
//   Структура   - Результат вызова. Код результата или ошибка 
//
&НаКлиенте
Функция ПолучитьТранспортныеУпаковкиСДокумента(СписокПараметровВызова, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;  
		
    ПараметрыВызова = Новый Структура; 	
	ПараметрыВызова.Вставить("ДопПоля",		Новый Массив());
	ПараметрыВызова.Вставить("Фильтр",		СписокПараметровВызова.Фильтр); 
	ПараметрыВызова.Вставить("Сортировка",	Новый Массив());
	ПараметрыВызова.Вставить("Навигация",	Новый Массив());
		
	ФлагОшибки = Ложь;
	РезультатВызова = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ExtSysMarking_NumList(ПараметрыВызова, Новый Структура("Кэш", ГлавноеОкно.Кэш), ФлагОшибки);
	Если ФлагОшибки Тогда
		ВызватьСбисИсключение(РезультатВызова, "МодульОбъектаКлиент.ПолучитьТранспортныеУпаковкиСДокумента");
	КонецЕсли; 
	
	Возврат РезультатВызова;

КонецФункции

// Функция перемещает номенклатуру в упаковку, либо достает ее из упаковки, возвращает результат работы метода ExtSysNom.MoveToPack
//
// Параметры:
//  СписокПараметровВызова - Структура - параметры для вызова функции онлайна 
//  ДопПараметры - Структура - Набор полей, работа с которыми может расширить результат работы функции. 
// 
// Возвращаемое значение:
//   Структура   - Результат вызова. Код результата или ошибка 
//
&НаКлиенте
Функция ПереместитьТоварВИзТранспортнойУпаковки(СписокПараметровВызова, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;
	
	ФлагОшибки = Ложь;
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("Filters",		Новый Структура);
	
	ПараметрыВызова.Filters.Вставить("Документ",	СписокПараметровВызова.ИдДокументаСБИС);
	ПараметрыВызова.Filters.Вставить("selection",	Новый Структура);
	
	ПараметрыВызова.Filters.selection.Вставить("marked", СписокПараметровВызова.МассивИдНомеклатурПереместить);
	
	Если ДопПараметры.Свойство("КоличествоПереместить") Тогда
		ПараметрыВызова.Filters.Вставить("Количество", ДопПараметры.КоличествоПереместить);
	КонецЕсли;
	
	ПараметрыВызова.Вставить("RootId",		СписокПараметровВызова.ИдКудаПереместить);
	ПараметрыВызова.Вставить("AddFields",	Новый Структура("check_pack_size", Ложь));
	
	РезультатВызова = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ExtSysNom_MoveToPack(Кэш, ПараметрыВызова, ДопПараметры, ФлагОшибки);
	Если ФлагОшибки Тогда
		ВызватьСбисИсключение(РезультатВызова, "МодульОбъектаКлиент.ПереместитьТоварВИзТранспортнойУпаковки");
	КонецЕсли; 
	
	Возврат РезультатВызова;

КонецФункции

// Функция удаляет транспортную упаковку с документа, возвращает результат работы метода ExtSysNom.UnPack
//
// Параметры:
//  СписокПараметровВызова - Структура - параметры для вызова функции онлайна 
//  ДопПараметры - Структура - Набор полей, работа с которыми может расширить результат работы функции. 
// 
// Возвращаемое значение:
//   Структура   - Результат вызова. Код результата или ошибка 
//
&НаКлиенте
Функция УдалитьТранспортнуюУпаковку(СписокПараметровВызова, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;
	
	ФлагОшибки = Ложь;
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	Фильтры = Новый Структура("selection, Документ");
	Фильтры.selection	= Новый Структура("marked", СписокПараметровВызова.МассивИдУдалить);
	Фильтры.Документ	= СписокПараметровВызова.ИдДокументаСБИС;
		
    ПараметрыВызова = Новый Структура; 	
	ПараметрыВызова.Вставить("Filters",		Фильтры);
	ПараметрыВызова.Вставить("AddFields",	Новый Структура("deletePack", true));
		
	РезультатВызова = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ExtSysNom_UnPack(Кэш, ПараметрыВызова, ДопПараметры, ФлагОшибки);
	Если ФлагОшибки Тогда
		ВызватьСбисИсключение(РезультатВызова, "МодульОбъектаКлиент.УдалитьТранспортнуюУпаковку");
	КонецЕсли; 
	
	Возврат РезультатВызова;

КонецФункции

// Функция удаляет транспортную упаковку с документа, возвращает результат работы метода ExtSysNom.DeleteDnBatchAndRecalcQty
//
// Параметры:
//  СписокПараметровВызова - Структура - параметры для вызова функции онлайна 
//  ДопПараметры - Структура - Набор полей, работа с которыми может расширить результат работы функции. 
// 
// Возвращаемое значение:
//   Структура   - Результат вызова. Код результата или ошибка 
//
&НаКлиенте
Функция УдалитьНоменклатуруВТранспортнойУпаковке(СписокПараметровВызова, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;
	
	ФлагОшибки = Ложь;
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;

    Фильтры = Новый Структура("selection, Документ, Раздел");
	Фильтры.selection	= Новый Структура("marked", СписокПараметровВызова.МассивИдУдалить);
	Фильтры.Документ	= СписокПараметровВызова.ИдДокументаСБИС;
	Фильтры.Раздел		= СписокПараметровВызова.ИдУпаковки;
	
		
    ПараметрыВызова = Новый Структура; 	
	ПараметрыВызова.Вставить("Filters",		Фильтры);
		
	РезультатВызова = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ExtSysNom_DeleteDnBatchAndRecalcQty(Кэш, ПараметрыВызова, ДопПараметры, ФлагОшибки);
	Если ФлагОшибки Тогда
		ВызватьСбисИсключение(РезультатВызова, "МодульОбъектаКлиент.УдалитьНоменклатуруВТранспортнойУпаковке");
	КонецЕсли; 
	
	Возврат РезультатВызова;

КонецФункции

// Функция по-особому изменяет количество товара, редаклируемое в таблице транспортных упаковок, возвращает результат работы метода ExtSysNom.CustomDocNomUpdate
//
// Параметры:
//  СписокПараметровВызова - Структура - параметры для вызова функции онлайна 
//  ДопПараметры - Структура - Набор полей, работа с которыми может расширить результат работы функции. 
// 
// Возвращаемое значение:
//   Структура   - Результат вызова. Код результата или ошибка 
//
&НаКлиенте
Функция ИзменитьКоличествоНоменклатурыВТаблицеТранспортныхУпаковок(СписокПараметровВызова, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;
	
	ФлагОшибки = Ложь;
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;

	Фильтры = Новый Структура("Документ, НоменклатураДокумента, Количество");
	Фильтры.Документ				= СписокПараметровВызова.ИдДокументаСБИС;
	Фильтры.НоменклатураДокумента	= СписокПараметровВызова.ИдНоменклатурыСБИС;
	Фильтры.Количество				= СписокПараметровВызова.Количество;
	
	Если СписокПараметровВызова.Свойство("ИдУпаковкиСБИС") Тогда
		Фильтры.Вставить("Раздел", СписокПараметровВызова.ИдУпаковкиСБИС);
	КонецЕсли;
	
    ПараметрыВызова = Новый Структура; 	
	ПараметрыВызова.Вставить("Filters",		Фильтры);
	ПараметрыВызова.Вставить("AddFields",	Новый Структура);
	
	ПараметрыВызова.AddFields.Вставить("check_pack_size",	Ложь);
		
	РезультатВызова = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ExtSysNom_CustomDocNomUpdate(Кэш, ПараметрыВызова, ДопПараметры, ФлагОшибки);
	Если ФлагОшибки Тогда
		ВызватьСбисИсключение(РезультатВызова, "МодульОбъектаКлиент.ИзменитьКоличествоНоменклатурыВТаблицеТранспортныхУпаковок");
	КонецЕсли; 
	
	Возврат РезультатВызова;

КонецФункции

// Функция инициализирует создание транспортной упаковки, возвращает результат работы метода ExtSysNom.CustomCreate
//
// Параметры:
//  СписокПараметровВызова - Структура - параметры для вызова функции онлайна 
//  ДопПараметры - Структура - Набор полей, работа с которыми может расширить результат работы функции. 
// 
// Возвращаемое значение:
//   Структура   - Результат вызова. Код результата или ошибка 
//
&НаКлиенте
Функция ИнициализироватьСозданиеТранспортнойУпаковки(СписокПараметровВызова, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;
	
	ФлагОшибки = Ложь;
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
    Фильтр = Новый Структура();
	Фильтр.Вставить("Документ",				СписокПараметровВызова.ИдДокументаСБИС);
	
	Если ДопПараметры.Свойство("ПрочитатьСПредыдущейЗаписиУпаковки")
			И ДопПараметры.ПрочитатьСПредыдущейЗаписиУпаковки Тогда
			
		Фильтр.Вставить("read_with_pack_rec",	Истина);
		Фильтр.Вставить("Parent_",				Истина);
		Фильтр.Вставить("WasabyList",			Истина);
		
	КонецЕсли;
		
    ПараметрыВызова = Новый Структура; 	
	ПараметрыВызова.Вставить("Фильтр",		Фильтр);
	ПараметрыВызова.Вставить("Метод",		null);
		
	РезультатВызова = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ExtSysNom_CustomCreate(Кэш, ПараметрыВызова, ДопПараметры, ФлагОшибки);
	Если ФлагОшибки Тогда
		ВызватьСбисИсключение(РезультатВызова, "МодульОбъектаКлиент.ИнициализироватьСозданиеТранспортнойУпаковки");
	КонецЕсли; 
	
	Возврат РезультатВызова;

КонецФункции

// Функция генерирует код транспортной упаковки, возвращает результат работы метода ExtSysNom.GeneratePackage
//
// Параметры:
//  СписокПараметровВызова - Структура - параметры для вызова функции онлайна 
//  ДопПараметры - Структура - Набор полей, работа с которыми может расширить результат работы функции. 
// 
// Возвращаемое значение:
//   Структура   - Результат вызова. Код результата или ошибка 
//
&НаКлиенте
Функция СгенерироватьКодТранспортнойУпаковки(СписокПараметровВызова, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;
	
	ФлагОшибки = Ложь;
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;

    Фильтр = Новый Структура();
	Фильтр.Вставить("Документ",					СписокПараметровВызова.ИдДокументаСБИС);
	Фильтр.Вставить("НоменклатураДокумента",	Null);
	Фильтр.Вставить("template_name",			СписокПараметровВызова.ШаблонКода);
	Фильтр.Вставить("org_gln",					СписокПараметровВызова.GLN);
		
    ПараметрыВызова = Новый Структура("Filters",		Фильтр); 	
		
	РезультатВызова = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ExtSysNom_GeneratePackage(Кэш, ПараметрыВызова, ДопПараметры, ФлагОшибки);
	Если ФлагОшибки Тогда
		ВызватьСбисИсключение(РезультатВызова, "МодульОбъектаКлиент.СгенерироватьКодТранспортнойУпаковки");
	КонецЕсли; 
	
	Возврат РезультатВызова;

КонецФункции

// Функция генерирует код транспортной упаковки, возвращает результат работы метода ExtSysNom.GetGln
//
// Параметры:
//  СписокПараметровВызова - Структура - параметры для вызова функции онлайна 
//  ДопПараметры - Структура - Набор полей, работа с которыми может расширить результат работы функции. 
// 
// Возвращаемое значение:
//   Структура   - Результат вызова. Код результата или ошибка 
//
&НаКлиенте
Функция ПолучитьGLNДляГенерацииКодаТранспортнойУпаковки(СписокПараметровВызова, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;
	
	ФлагОшибки = Ложь;
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;

    ПараметрыВызова = Новый Структура("Документ",	СписокПараметровВызова.ИдДокументаСБИС); 	
		
	РезультатВызова = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ExtSysNom_GetGln(Кэш, ПараметрыВызова, ДопПараметры, ФлагОшибки);
	Если ФлагОшибки Тогда
		ВызватьСбисИсключение(РезультатВызова, "МодульОбъектаКлиент.ПолучитьGLNДляГенерацииКодаТранспортнойУпаковки");
	КонецЕсли; 
	
	Возврат РезультатВызова;

КонецФункции

// Функция генерирует транспортную упаковку, возвращает результат работы метода ExtSysNom.GeneratePack
//
// Параметры:
//  СписокПараметровВызова	- Структура - параметры для вызова функции онлайна 
//  ДопПараметры			- Структура - Набор полей, работа с которыми может расширить результат работы функции. 
// 
// Возвращаемое значение:
//   Структура   - Результат вызова. Код результата или ошибка 
//
&НаКлиенте
Функция СгенерироватьТранспортнуюУпаковку(СписокПараметровВызова, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;
	
	ФлагОшибки = Ложь;
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;

    ПараметрыВызова = Новый Структура("filters, params", Новый Структура);
	
	ПараметрыВызова.filters.Вставить("Документ",	СписокПараметровВызова.ИдДокументаСБИС);
	
	ПараметрыВызова.params = СписокПараметровВызова.СтруктураПараметровСбис;
		
	РезультатВызова = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ExtSysNom_GeneratePack(Кэш, ПараметрыВызова, ДопПараметры, ФлагОшибки);
	Если ФлагОшибки Тогда
		ВызватьСбисИсключение(РезультатВызова, "МодульОбъектаКлиент.СгенерироватьТранспортнуюУпаковку");
	КонецЕсли; 
	
	Возврат РезультатВызова;

КонецФункции

