
// Команда инициирует создание информации о транспортной упаковке
&НаКлиенте
Процедура ДобавитьУпаковку(Команда)

	фрм = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаСозданияТранспортнойУпаковки", Новый Структура("Владелец", ЭтаФорма));   
    фрм.ОписаниеОповещенияОЗакрытии = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ДобавитьУпаковку_Завершение", ЭтаФорма);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИдДокументаСБИС", СоставПакета.Идентификатор);
	фрм.ПоказатьПоверх(ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУпаковку_Завершение(РезультатСоздания, ДопПараметры) Экспорт
	
	Если РезультатСоздания = Истина Тогда
		ЗаполнитьТранспортныеУпаковки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьТранспортнуюУпаковкуНоменклатуру(Команда)
	
	СписокПараметровВызова = Новый Структура;
	СписокПараметровВызова.Вставить("ИдДокументаСБИС", СоставПакета.Идентификатор);
	
	ТЗУпаковок = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаТранспортныеУпаковки");
	ВыделенныеСтроки = ТЗУпаковок.ВыделенныеСтроки;
	ТекущаяСтрока = ТЗУпаковок.ТекущиеДанные;
	
	МассивИдУпаковок	= Новый Массив;
	МассивИдНоменклатур	= Новый Массив;
	
	Для каждого ИдВыделеннойСтроки Из ВыделенныеСтроки Цикл
		
		ВыделеннаяСтрока = МодульОбъектаКлиент().ПолучитьСтрокуКоллекцииФормыПоИдентификаторуУФ(ТранспортныеУпаковки, ИдВыделеннойСтроки); 
		
		ЭтоУпаковка			= ВыделеннаяСтрока.ЭтоУпаковка;
		ЭтоТоварВУпаковке	= Не ЭтоУпаковка И ВыделеннаяСтрока.ПолучитьРодителя() <> Неопределено;
		
		Если ЭтоУпаковка Тогда
			МассивИдУпаковок.Добавить(ВыделеннаяСтрока.ИдентификаторСбис);
		ИначеЕсли ЭтоТоварВУпаковке Тогда
			МассивИдНоменклатур.Добавить(ВыделеннаяСтрока.ИдентификаторСбис);
		Иначе
			Продолжить;
		КонецЕсли;
	
	КонецЦикла;
	
	Если Не МассивИдУпаковок.Количество() И Не МассивИдНоменклатур.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Если МассивИдУпаковок.Количество() Тогда
		
		СписокПараметровВызова.Вставить("МассивИдУдалить", МассивИдУпаковок);
		
		Попытка
			Результат = МодульОбъектаКлиент().УдалитьТранспортнуюУпаковку(СписокПараметровВызова);
		Исключение
			МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "УдалитьТранспортнуюУпаковку");
		КонецПопытки;
		
	КонецЕсли;
	
	Если МассивИдНоменклатур.Количество() Тогда
		
		СписокПараметровВызова.Вставить("МассивИдУдалить",	МассивИдНоменклатур);
		СписокПараметровВызова.Вставить("ИдУпаковки",		ТекущаяСтрока.ПолучитьРодителя().ИдентификаторСбис);
		
		Попытка
			Результат = МодульОбъектаКлиент().УдалитьНоменклатуруВТранспортнойУпаковке(СписокПараметровВызова);
		Исключение
			МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "УдалитьНоменклатуруВТранспортнойУпаковке");
		КонецПопытки;
		
	КонецЕсли;
	
	ЗаполнитьТранспортныеУпаковки();
	
КонецПроцедуры

