&НаКлиенте
Перем МестныйКэш;

#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти  

#Область include_core2_vo2_Раздел_Полученные 
#КонецОбласти 

&НаКлиенте
Процедура сбисОформлениеДопПолейРеестра(Кэш) Экспорт
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Срок").Видимость = Истина;   
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Лицо2").Видимость = Истина; 
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РеестрЗаказов")) Тогда
		
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.ТекущееДействие").Видимость = Истина;   
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.ТекущийЭтап").Видимость = Ложь;  
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Расхождение").Видимость = Истина;  
		
	КонецЕсли;  
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.СтатусВГосСистеме").Видимость = Ложь; 

	ОписаниеИзменить	= Новый ФиксированнаяСтруктура("Форма, Реквизит", Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Лицо2");
	Изменения 			= Новый ФиксированнаяСтруктура("Заголовок", "Грузополучатель");
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеИзменить, Изменения);

КонецПроцедуры

// Функция - обновляет контент для подразделов раздела Полученные	
//
// Параметры:
//  Кэш	 - Структура - Кэш обработки 
// 
// Возвращаемое значение:
//  Структура - набор полей для заполнения таблицы реестра документов
//
&НаКлиенте
Функция ОбновитьКонтент(Кэш, ДопПараметры = Неопределено) Экспорт 
	
	ОбщиеФункцииДокументов = Кэш.ТекущийСеанс.Модули.ФункцииДокументов;	
	
	ПараметрыСписка = Новый Структура();
	
	СтруктураДляОбновленияФормы = МодульОбъектаКлиент().ПолучитьСписокДокументовСБИС(ПараметрыСписка, ДопПараметры);   
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РеестрЗаказов")) Тогда  
		
		ДопПараметры = Новый Структура;
		
		ДопПараметры.Вставить("ТипыСвязанныхДокументов", МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыСвязанныхДокументов")); 
		ДопПараметры.Вставить("КритерииОтбораСвязанныхДокументов", 
								МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("КритерииОтбораСвязанныхДокументов"));
		
		ОбработатьСписокДокументов_Сервер(СтруктураДляОбновленияФормы.Таблица_РеестрДокументов, ДопПараметры);
	
		Для Каждого СтрокаСписка Из СтруктураДляОбновленияФормы.Таблица_РеестрДокументов Цикл 
			
			Если СтрокаСписка.Свойство("ЗагрузитьЕще") Тогда
				
				Продолжить;
				
			ИначеЕсли СтрокаСписка.Свойство("Дельта") Тогда
				
				Дельта = СтрокаСписка.Дельта;
				
			Иначе
				
				Дельта = 0;
				
			КонецЕсли;
			
			ДополнительныеПоля = Новый Структура("СвязанныеДокументы, Документы1С, Дельта", 
			СтрокаСписка.СвязанныеДокументы, СтрокаСписка.Документы1С, Дельта); 
				
			
			СоставПакета = СтрокаСписка.СоставПакета[0].Значение;
			
			МодульОбъектаКлиент().СоставПакета_Обновить(СоставПакета, Новый Структура("ДопПоля", ДополнительныеПоля));	
			
			СписокДействий = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "ТекущееДействие");  
			
			Если ЗначениеЗаполнено(СписокДействий) Тогда
				СтрокаСписка.ТекущееДействие = СписокДействий[0].Представление;   
			КонецЕсли;
			
		КонецЦикла;   
			
	КонецЕсли;
	
	ОбщиеФункцииДокументов.ОбновитьПанельНавигации(Кэш); 
	
	Контент = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Контент");
	Контент.ТекущаяСтраница = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Контент, "РеестрДокументов");
	Кэш.ТаблДок = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов");
	
	Кэш.ГлавноеОкно.СписокДопОперацийРеестра.Очистить();
	
	Возврат СтруктураДляОбновленияФормы;     
	
КонецФункции  

&НаСервере
Процедура ОбработатьСписокДокументов_Сервер(СписокДокументов, ДопПараметры)  
	
	Для Каждого СтрокаСписка Из СписокДокументов Цикл   
		
		Если СтрокаСписка.Свойство("ЗагрузитьЕще")
			ИЛИ	НЕ ЗначениеЗаполнено(СтрокаСписка.Документы1С) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ДокументОснование = СтрокаСписка.Документы1С[0].Значение;
		
		СтрокаСписка.СвязанныеДокументы.ЗагрузитьЗначения(МодульОбъектаСервер().СбисОбъектыПоКритериюОтбора(ДокументОснование, ДопПараметры));
		
	КонецЦикла;   
	
КонецПроцедуры
	
// Процедура - Обновляет панель массовых операций, панель фильтра, контекстное меню при смене раздела
//
// Параметры:
//  Кэш	 - Структура - Кэш обработки 
//
&НаКлиенте
Процедура НаСменуРаздела(Кэш) Экспорт   
	
	ФормаРаздела = МодульОбъектаКлиент().ПолучитьФормуОбработки("Раздел_Полученные_Полученные");
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РеестрЗаказов")) Тогда
		
		ФормаРаздела.ПодготовитьФильтрРаздела(Кэш);
		
		ГлавноеОкно = Кэш.ГлавноеОкно;
		
		ГлавноеОкно.сбисУстановитьКонтекстноеМеню("Таблица_РеестрДокументов", "КонтекстноеМенюПолученные");
		ГлавноеОкно.сбисУстановитьКонтекстноеМеню("Таблица_РеестрСобытий", "КонтекстноеМенюПолученныеРеестрСобытий");
		ПанельМассовыхОпераций = ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "ПанельМассовыхОпераций");
		ПанельМассовыхОпераций.ТекущаяСтраница = ГлавноеОкно.сбисПолучитьСтраницу(ПанельМассовыхОпераций, "Полученные_ЗаказВх");
		
		СпособИнтеграцииКаталог = Кэш.Парам.СпособОбмена = 1;
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"ПанельМассовыхОпераций").Видимость = Истина;
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"ПанельТулбар").Видимость = Истина;	
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"МассовыеОперацииСопоставить2").Видимость	= Не СпособИнтеграцииКаталог;
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"МассовыеОперацииУтвердить1").Видимость	= Не СпособИнтеграцииКаталог;
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"Сохранить1").Видимость					= Не СпособИнтеграцииКаталог;
		
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"ПанельФильтра").Видимость = Не СпособИнтеграцииКаталог;
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"ПоказатьПанельФильтра").Видимость = Не СпособИнтеграцииКаталог;
		
	Иначе
		ФормаРаздела.НаСменуРаздела(Кэш);
	КонецЕсли; 

	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Грузополучатель").Видимость = Ложь;
	
КонецПроцедуры       
		
// Процедура - Устанавливает видимости колонок при переходе в раздел
//
// Параметры:
//  Кэш	 - Структура - Кэш обработки 
//
&НаКлиенте
Процедура НастроитьКолонки(Кэш) Экспорт  
	
	ФормаРаздела = МодульОбъектаКлиент().ПолучитьФормуОбработки("Раздел_Полученные_Полученные");
	ФормаРаздела.НастроитьКолонки(Кэш); 
	
КонецПроцедуры      

// Функция - Обработчик запроса списка документов
//
// Параметры:
//  Кэш				 - Структура	- Кэш обработки
//  ПараметрыМетода	 - Структура	- Параметры для выполнения метода
//  ДопПараметры	 - Структура	- Набор параметров для расширения работы функции
//  Отказ			 - Булево		- Флаг ошибки при вызове метода
// 
// Возвращаемое значение:
//  Структура - Список документов или структура ошибки
//
&НаКлиенте
Функция ОбработчикЗапросаСпискаДокументов(Кэш, ПараметрыМетода, ДопПараметры, Отказ) Экспорт  
	
	Перем ФазаДокумента;  
	
	Если НЕ МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РеестрЗаказов")) Тогда  
		
		СбисМодульИнтеграции = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция");
	
		Возврат СбисМодульИнтеграции.СБИС_СписокДокументов(Кэш, ПараметрыМетода, ДопПараметры, Отказ);  
		
	КонецЕсли;  
	
	Если ДопПараметры.Свойство("ЭтоПерваяИтерация") 
		И НЕ ДопПараметры.ЭтоПерваяИтерация Тогда
		
		Отказ = Истина;
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ГлавноеОкно 			= Кэш.ГлавноеОкно;  	
	ПараметрыАккордеона 	= ГлавноеОкно.АккордеонДополнительный;    
	
	Если НЕ ЗначениеЗаполнено(ПараметрыАккордеона) Тогда
		
		ПараметрыАккордеона = Новый Структура;
		
	КонецЕсли;
									
	Если ПараметрыАккордеона.Свойство("ФильтрДляРаздела") Тогда
	
		Для Каждого ПараметрФильтра Из ПараметрыАккордеона.ФильтрДляРаздела Цикл
			
			 ПараметрыМетода.Вставить(ПараметрФильтра.Ключ, ПараметрФильтра.Значение);
			
		КонецЦикла;  
	
	КонецЕсли;  	 
		
	Если  ПараметрыАккордеона.Свойство("ТекущаяФазаДокумента", ФазаДокумента) Тогда 
		
		Если ФазаДокумента = "Завершенные" Тогда
	  
			ПараметрыМетода.Вставить("СостояниеСобытий", "Отработанные"); 
			
		ИначеЕсли ФазаДокумента = "Все" Тогда
			
			// Отбираем все документы
			ПараметрыМетода.Вставить("СостояниеСобытий", "Все");  
			
		Иначе
			
			// Отбираем только документы, находящиеся в работе
			ПараметрыМетода.Вставить("СостояниеСобытий", "Активные");
			
		КонецЕсли; 
		
	Иначе
		
		// Первый переход в раздел. Вернули пункт "Все", поэтому отбираем все документы
		ПараметрыМетода.Вставить("СостояниеСобытий", "Все");
		
	КонецЕсли;  
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеФичи("ПриличныйВидВО") Тогда
		ПропатчитьФильтрДляКурсорнойНавигации(Кэш, ПараметрыМетода, ДопПараметры, Отказ);
	Иначе
		ПропатчитьФильтрДляПостраничныйНавигации(Кэш, ПараметрыМетода, ДопПараметры, Отказ);
	КонецЕсли;
		
 	СписокДокументов = МодульОбъектаКлиент().ПолучитьСписокЗаказов(Кэш, ПараметрыМетода, ДопПараметры, Отказ); 
	
	Если СписокДокументов.Документ.Количество() Тогда
		
		ПараметрыАккордеона.Вставить("ФильтрПоследняяЗапись", СписокДокументов.Навигация); 
		
	КонецЕсли;
	
	ГлавноеОкно.АккордеонДополнительный = ПараметрыАккордеона; 
	
	Возврат СписокДокументов;
	
КонецФункции   

&НаКлиенте
Процедура ПропатчитьФильтрДляПостраничныйНавигации(Кэш, ПараметрыМетода, ДопПараметры, Отказ)  
	
	Перем НавигацияНаправление, лПоследняяЗапись;
	
	ГлавноеОкно 			= Кэш.ГлавноеОкно;  
	ПараметрыАккордеона 	= ГлавноеОкно.АккордеонДополнительный;
	ЗаписейНаСтранице 		= ДопПараметры.РазмерСтраницы;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыАккордеона) Тогда
		
		ПараметрыАккордеона = Новый Структура;
		
	КонецЕсли;
	
	ДопПараметры.Свойство("Направление", НавигацияНаправление);
	ПараметрыАккордеона.Свойство("ФильтрПоследняяЗапись", лПоследняяЗапись); 
	
	Если НавигацияНаправление = "ПредыдущаяСтраница"
		И НЕ ГлавноеОкно.ФильтрСтраница = 1 Тогда 
		
		Направление = "backward";    
		
	ИначеЕсли НавигацияНаправление = "ПерваяСтраница"
		Или ГлавноеОкно.ФильтрСтраница = 1 Тогда
		
		лПоследняяЗапись = Неопределено; 
			
		Направление = "forward";
		
	Иначе
		
		Направление = "forward"; 
		
	КонецЕсли; 
 	
	ПараметрыМетода.Вставить("Навигация", Новый Структура);
	ПараметрыМетода.Навигация.Вставить("Направление", Направление);
	ПараметрыМетода.Навигация.Вставить("КоличествоДокументов", ЗаписейНаСтранице); 
	ПараметрыМетода.Навигация.Вставить("Страница", ГлавноеОкно.ФильтрСтраница);  
	ПараметрыМетода.Навигация.Вставить("РазмерСтраницы", ЗаписейНаСтранице);  
	ПараметрыМетода.Навигация.Вставить("ПоследняяЗапись", лПоследняяЗапись); 
	
КонецПроцедуры   

&НаКлиенте
Процедура ПропатчитьФильтрДляКурсорнойНавигации(Кэш, ПараметрыМетода, ДопПараметры, Отказ)  
	
	Перем НавигацияНаправление, лПоследняяЗапись;
	
	ГлавноеОкно 			= Кэш.ГлавноеОкно;  
	ПараметрыАккордеона 	= ГлавноеОкно.АккордеонДополнительный;
	ЗаписейНаСтранице 		= ПараметрыМетода.Навигация.РазмерСтраницы;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыАккордеона) Тогда
		
		ПараметрыАккордеона = Новый Структура;
		
	КонецЕсли;
	
	ПараметрыАккордеона.Свойство("ФильтрПоследняяЗапись", лПоследняяЗапись); 
 	
	ПараметрыМетода.Вставить("Навигация", Новый Структура);
	ПараметрыМетода.Навигация.Вставить("Направление", "forward");
	ПараметрыМетода.Навигация.Вставить("КоличествоДокументов", ЗаписейНаСтранице); 
	ПараметрыМетода.Навигация.Вставить("РазмерСтраницы", ЗаписейНаСтранице);  
	ПараметрыМетода.Навигация.Вставить("ПоследняяЗапись", лПоследняяЗапись); 
	ПараметрыМетода.Навигация.Вставить("Страница", ГлавноеОкно.ФильтрСтраница); 
	
КонецПроцедуры   

// Функция - Обновляет контент и подготавливает раздел по входным параметрам
//
// Параметры:
//  ПараметрыОбновления	 - Структура - Параметры функции
//  ДопПараметры		 - Структура - Набор параметров для расширения работы функции 
// 
// Возвращаемое значение:
//  Булево - Всегда Истина 
//
&НаКлиенте
Функция ОбновитьКонтентПодговитьРаздел(ПараметрыОбновления, ДопПараметры) Экспорт    
	
	Кэш = ДопПараметры.Кэш; 
		
	Если МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РеестрЗаказов")) Тогда
		
		МодульОбъектаКлиент().ВывестиДополнительныйАккордеон(); 
		
	Иначе 
		
		МодульОбъектаКлиент().СкрытьДополнительныйАккордеон(); 
		
	КонецЕсли;

	Возврат Истина;

КонецФункции     

&НаКлиенте
Процедура ЗавершитьДействияНадДокументами(РезультатОтправки, ДопПараметры) Экспорт
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();

	МодульОбъектаКлиент().ОбновитьДополнительныйАккордеон();
	
	МодульОбъектаКлиент().МассоваяОперация_Показать(РезультатОтправки, Новый ФиксированнаяСтруктура("Владелец", Кэш.ГлавноеОкно));
	
КонецПроцедуры

#Область include_core2_vo2_Раздел_Полученные_ЗаказВх_ГлавноеОкно
#КонецОбласти
