&НаКлиенте
Перем МестныйКэш;

#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти  

#Область include_core2_vo2_Раздел_Полученные 
#КонецОбласти 

&НаКлиенте
Процедура сбисОформлениеДопПолейРеестра(Кэш) Экспорт
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Срок").Видимость = Истина;   
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Лицо2").Видимость = Истина;

	ОписаниеИзменить	= Новый ФиксированнаяСтруктура("Форма, Реквизит", Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Лицо2");
	Изменения 			= Новый ФиксированнаяСтруктура("Заголовок", "Грузополучатель");
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеИзменить, Изменения);

КонецПроцедуры

// Функция - обновляет контент для подразделов раздела Полученные	
//
// Параметры:
//  Кэш	 - Структура - Кэш обработки 
// 
// Возвращаемое значение:
//  Структура - набор полей для заполнения таблицы реестра документов
//
&НаКлиенте
Функция ОбновитьКонтент(Кэш) Экспорт 
	
	ОбщиеФункцииДокументов = Кэш.ТекущийСеанс.Модули.ФункцииДокументов;	
	СтруктураДляОбновленияФормы = Кэш.Интеграция.сбисПолучитьСписокДокументов(Кэш); 
	
	ОбщиеФункцииДокументов.ОбновитьПанельНавигации(Кэш); 
	
	Контент = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Контент");
	Контент.ТекущаяСтраница = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Контент, "РеестрДокументов");
	Кэш.ТаблДок = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов");
	
	Кэш.ГлавноеОкно.СписокДопОперацийРеестра.Очистить();
	
	Возврат СтруктураДляОбновленияФормы;     
	
КонецФункции  
	
// Процедура - Обновляет панель массовых операций, панель фильтра, контекстное меню при смене раздела
//
// Параметры:
//  Кэш	 - Структура - Кэш обработки 
//
&НаКлиенте
Процедура НаСменуРаздела(Кэш) Экспорт   
	
	ФормаРаздела = МодульОбъектаКлиент().ПолучитьФормуОбработки("Раздел_Полученные_Полученные");
	ФормаРаздела.НаСменуРаздела(Кэш);  
	
КонецПроцедуры       
		
// Процедура - Устанавливает видимости колонок при переходе в раздел
//
// Параметры:
//  Кэш	 - Структура - Кэш обработки 
//
&НаКлиенте
Процедура НастроитьКолонки(Кэш) Экспорт  
	
	ФормаРаздела = МодульОбъектаКлиент().ПолучитьФормуОбработки("Раздел_Полученные_Полученные");
	ФормаРаздела.НастроитьКолонки(Кэш); 
	
КонецПроцедуры      

// Процедура - Устанавливает значения фильтра по-умолчанию для текущего раздела
//
// Параметры:
//  Кэш	 - Структура - Кэш обработки 
//
&НаКлиенте
Процедура ФильтрОчистить(Кэш) Экспорт
	
	ФормаРаздела = МодульОбъектаКлиент().ПолучитьФормуОбработки("Раздел_Полученные_Полученные");
	ФормаРаздела.ФильтрОчистить(Кэш);  
	
КонецПроцедуры

// Процедура - показывает дополнительный аккордеон
//
// Параметры:
//  Кэш	 - Структура - Кэш обработки 
//
&НаКлиенте
Процедура ВывестиДополнительныйАккордеон(Кэш) Экспорт
	Форма = Кэш.ГлавноеОкно;		
	Если Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "АккордеонДополнительныйHTML").Видимость = Истина;
	ИначеЕсли Не МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "АккордеонДополнительныйHTML").Видимость Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "АккордеонДополнительныйHTML").Видимость = Истина;
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "Контент").Ширина = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "Контент").Ширина 
		- МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "АккордеонДополнительныйHTML").Ширина;
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "Контент").Лево = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "Контент").Лево 
		+ МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "АккордеонДополнительныйHTML").Ширина;
	КонецЕсли;
КонецПроцедуры	