&НаКлиенте
Перем МестныйКэш;

#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти  

// Процедура устанавливает панель навигации на 1ую страницу	
&НаКлиенте
Процедура НавигацияУстановитьПанель(Кэш = Неопределено) Экспорт
	
	Если МестныйКэш = Неопределено Тогда
		МестныйКэш = Кэш;
	КонецЕсли;
	
	ГлавноеОкно = МестныйКэш.ГлавноеОкно;
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "ПанельНавигации").Видимость		= Истина;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "ЗаписейНаСтранице1С").Видимость	= Ложь;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "ЗаписейНаСтранице").Видимость		= Истина;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "КоманднаяПанельНавигация").Видимость	= Ложь;	

КонецПроцедуры

// функция формирует структуру данных по пакету электронных документов, необходимую для его предварительного просмотра и загрузки в 1С		
&НаКлиенте
Функция ПодготовитьСтруктуруДокумента(СтрокаСпискаДокументов, Кэш) Экспорт

	Возврат Кэш.ОбщиеФункции.ПодготовитьСтруктуруДокументаСбис(СтрокаСпискаДокументов, Кэш);	
	
КонецФункции

&НаКлиенте
Функция ПодготовитьСтруктуруДокументаДляРасхождений(СтрокаСпискаДокументов, Кэш) Экспорт
			
	Попытка
		Возврат МодульОбъектаКлиент().ПодготовитьСтруктуруДокументаДляРасхожденийДляРеестраСБИС(СтрокаСпискаДокументов);
	Исключение
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнформацияОбОшибке(), "Раздел_Полученные_Полученные.ПодготовитьСтруктуруДокументаДляРасхождений");
	КонецПопытки;
			
КонецФункции

&НаКлиенте
Процедура сбисОформлениеДопПолейРеестра(Кэш) Экспорт
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Срок").Видимость = Истина;   
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Лицо2").Видимость = Истина; 
			
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.ТекущееДействие").Видимость = Истина;   
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.ТекущийЭтап").Видимость = Ложь;  
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Расхождение").Видимость = Истина;   
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.СтатусВГосСистеме").Видимость = Ложь; 

	ОписаниеИзменить	= Новый ФиксированнаяСтруктура("Форма, Реквизит", Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Лицо2");
	Изменения 			= Новый ФиксированнаяСтруктура("Заголовок", "Грузополучатель");
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеИзменить, Изменения);

КонецПроцедуры

// Функция - обновляет контент для подразделов раздела Полученные	
//
// Параметры:
//  Кэш	 - Структура - Кэш обработки 
// 
// Возвращаемое значение:
//  Структура - набор полей для заполнения таблицы реестра документов
//
&НаКлиенте
Функция ОбновитьКонтент(Кэш, ДопПараметры = Неопределено) Экспорт 
	
	ОбщиеФункцииДокументов	= Кэш.ТекущийСеанс.Модули.ФункцииДокументов;
	ГлавноеОкно				= Кэш.ГлавноеОкно;
	
	ФильтрРаздела = МодульОбъектаКлиент().РазделГО_Получить(Кэш.Текущий, "Фильтр");
	ФильтрРаздела.Вставить("ЗаписейНаСтранице", МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ЗаписейНаСтранице"));
	ФильтрРаздела.Вставить("ФильтрСтраница", ГлавноеОкно.ФильтрСтраница);
	ДопРараметрыФильтра = Новый Структура("ДопФильтры", ДопПараметры);
	ПараметрыСписка = Новый Структура("Фильтр", МодульОбъектаКлиент().СформироватьФильтрДляРеестраОнлайна(ФильтрРаздела, ДопРараметрыФильтра));
	ПараметрыСписка.Фильтр.Навигация.Вставить("ПоследняяЗапись", ФильтрРаздела.ФильтрПоследняяЗапись);
	
	СтруктураДляОбновленияФормы = МодульОбъектаКлиент().ПолучитьСписокДокументовСБИС(ПараметрыСписка, ДопПараметры);    
	
	Если ГлавноеОкно.ФильтрЕстьЕще Тогда
		СтрокаЗагрузитьЕще = Новый Структура("Проведен, Статус, ЗагрузитьЕще", -1, -1, "Загрузить еще");
		СтрокаЗагрузитьЕще.Вставить("Контрагент", "Загрузить еще"); // Для vo2 проверка признака из поля «Контрагент»
		СтруктураДляОбновленияФормы.Таблица_РеестрДокументов.Добавить(СтрокаЗагрузитьЕще);
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТипыСвязанныхДокументов", МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыСвязанныхДокументов")); 
	ДопПараметры.Вставить("КритерииОтбораСвязанныхДокументов", 
							МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("КритерииОтбораСвязанныхДокументов"));
	
	ОбработатьСписокДокументов_Сервер(СтруктураДляОбновленияФормы.Таблица_РеестрДокументов, ДопПараметры);

	Для Каждого СтрокаСписка Из СтруктураДляОбновленияФормы.Таблица_РеестрДокументов Цикл 
		
		Если СтрокаСписка.Свойство("ЗагрузитьЕще") Тогда
			
			Продолжить;
			
		ИначеЕсли СтрокаСписка.Свойство("Дельта") Тогда
			
			Дельта = СтрокаСписка.Дельта;
			
		Иначе
			
			Дельта = 0;
			
		КонецЕсли;
		
		ДополнительныеПоля = Новый Структура("СвязанныеДокументы, Документы1С, Дельта", 
		СтрокаСписка.СвязанныеДокументы, СтрокаСписка.Документы1С, Дельта); 
			
		
		СоставПакета = СтрокаСписка.СоставПакета[0].Значение;
		
		МодульОбъектаКлиент().СоставПакета_Обновить(СоставПакета, Новый Структура("ДопПоля", ДополнительныеПоля));	
		
		СписокДействий = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "ТекущееДействие");  
		
		Если ЗначениеЗаполнено(СписокДействий) Тогда
			СтрокаСписка.ТекущееДействие = СписокДействий[0].Представление;   
		КонецЕсли;
		
	КонецЦикла;   
	
	ОбщиеФункцииДокументов.ОбновитьПанельНавигации(Кэш); 
	
	Контент = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "Контент");
	Контент.ТекущаяСтраница = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Контент, "РеестрДокументов");
	Кэш.ТаблДок = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "Таблица_РеестрДокументов");
	
	ГлавноеОкно.СписокДопОперацийРеестра.Очистить();
	
	Возврат СтруктураДляОбновленияФормы;     
	
КонецФункции  

&НаСервере
Процедура ОбработатьСписокДокументов_Сервер(СписокДокументов, ДопПараметры)  
	
	Для Каждого СтрокаСписка Из СписокДокументов Цикл   
		
		Если СтрокаСписка.Свойство("ЗагрузитьЕще")
			ИЛИ	НЕ ЗначениеЗаполнено(СтрокаСписка.Документы1С) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ДокументОснование = СтрокаСписка.Документы1С[0].Значение;
		
		СтрокаСписка.СвязанныеДокументы.ЗагрузитьЗначения(МодульОбъектаСервер().СбисОбъектыПоКритериюОтбора(ДокументОснование, ДопПараметры));
		
	КонецЦикла;   
	
КонецПроцедуры
	
// Процедура - Обновляет панель массовых операций, панель фильтра, контекстное меню при смене раздела
//
// Параметры:
//  Кэш	 - Структура - Кэш обработки 
//
&НаКлиенте
Процедура НаСменуРаздела(Кэш) Экспорт   
	
	ФормаРаздела = МодульОбъектаКлиент().ПолучитьФормуОбработки("Раздел_Полученные_Полученные");
			
	ФормаРаздела.ПодготовитьФильтрРаздела(Кэш);
	
	ГлавноеОкно = Кэш.ГлавноеОкно;
	
	ГлавноеОкно.сбисУстановитьКонтекстноеМеню("Таблица_РеестрДокументов", "КонтекстноеМенюПолученные");
	ГлавноеОкно.сбисУстановитьКонтекстноеМеню("Таблица_РеестрСобытий", "КонтекстноеМенюПолученныеРеестрСобытий");
	ПанельМассовыхОпераций = ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "ПанельМассовыхОпераций");
	ПанельМассовыхОпераций.ТекущаяСтраница = ГлавноеОкно.сбисПолучитьСтраницу(ПанельМассовыхОпераций, "Полученные_ЗаказВх");
	
	СпособИнтеграцииКаталог = Кэш.Парам.СпособОбмена = 1;
	ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"ПанельМассовыхОпераций").Видимость = Истина;
	ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"ПанельТулбар").Видимость = Истина;	
	ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"МассовыеОперацииСопоставить2").Видимость	= Не СпособИнтеграцииКаталог;
	ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"МассовыеОперацииУтвердить1").Видимость	= Не СпособИнтеграцииКаталог;
	ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"Сохранить1").Видимость					= Не СпособИнтеграцииКаталог;
	
	ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"ПанельФильтра").Видимость = Не СпособИнтеграцииКаталог;
	ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"ПоказатьПанельФильтра").Видимость = Не СпособИнтеграцииКаталог;

	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Грузополучатель").Видимость = Ложь;
	
КонецПроцедуры       
		
// Процедура - Устанавливает видимости колонок при переходе в раздел
//
// Параметры:
//  Кэш	 - Структура - Кэш обработки 
//
&НаКлиенте
Процедура НастроитьКолонки(Кэш) Экспорт  
	
	ФормаРаздела = МодульОбъектаКлиент().ПолучитьФормуОбработки("Раздел_Полученные_Полученные");
	ФормаРаздела.НастроитьКолонки(Кэш); 
	
КонецПроцедуры      

// Функция - Обработчик запроса списка документов
//
// Параметры:
//  Кэш				 - Структура	- Кэш обработки
//  ПараметрыМетода	 - Структура	- Параметры для выполнения метода
//  ДопПараметры	 - Структура	- Набор параметров для расширения работы функции
//  Отказ			 - Булево		- Флаг ошибки при вызове метода
// 
// Возвращаемое значение:
//  Структура - Список документов или структура ошибки
//
&НаКлиенте
Функция ОбработчикЗапросаСпискаДокументов(Кэш, ПараметрыМетода, ДопПараметры, Отказ) Экспорт  
	
	Перем ФазаДокумента;   
	
	ГлавноеОкно 			= Кэш.ГлавноеОкно;  	
	ПараметрыАккордеона 	= ГлавноеОкно.АккордеонДополнительный;    
	
	Если НЕ ЗначениеЗаполнено(ПараметрыАккордеона) Тогда
		
		ПараметрыАккордеона = Новый Структура;
		
	КонецЕсли;
									
	Если ПараметрыАккордеона.Свойство("ФильтрДляРаздела") Тогда
	
		Для Каждого ПараметрФильтра Из ПараметрыАккордеона.ФильтрДляРаздела Цикл
			
			 ПараметрыМетода.Вставить(ПараметрФильтра.Ключ, ПараметрФильтра.Значение);
			
		КонецЦикла;  
	
	КонецЕсли;  	 
		
	Если  ПараметрыАккордеона.Свойство("ТекущаяФазаДокумента", ФазаДокумента) Тогда 
		
		Если ФазаДокумента = "Завершенные" Тогда
	  
			ПараметрыМетода.Вставить("СостояниеСобытий", "Отработанные"); 
			
		ИначеЕсли ФазаДокумента = "Всезаказы" Тогда
			
			// Отбираем все документы
			ПараметрыМетода.Вставить("СостояниеСобытий", "Все");  
			
		Иначе
			
			// Отбираем только документы, находящиеся в работе
			ПараметрыМетода.Вставить("СостояниеСобытий", "Активные");
			
		КонецЕсли; 
		
	Иначе
		
		// Первый переход в раздел. Вернули пункт "Все", поэтому отбираем все документы
		ПараметрыМетода.Вставить("СостояниеСобытий", "Все");
		
	КонецЕсли;  
	
	ПропатчитьФильтрДляКурсорнойНавигации(Кэш, ПараметрыМетода, ДопПараметры, Отказ);
		
 	СписокДокументов = МодульОбъектаКлиент().ПолучитьСписокЗаказов(Кэш, ПараметрыМетода, ДопПараметры, Отказ); 
	
	Если СписокДокументов.Документ.Количество() Тогда
		ПараметрыАккордеона.Вставить("ФильтрПоследняяЗапись", СписокДокументов.Навигация);
		МодульОбъектаКлиент().РазделГО_ОбновитьФильтр(Кэш.Текущий, Новый Структура("ФильтрПоследняяЗапись", СписокДокументов.Навигация));
	КонецЕсли;
	
	ГлавноеОкно.АккордеонДополнительный = ПараметрыАккордеона; 
	
	Возврат СписокДокументов;
	
КонецФункции   

&НаКлиенте
Процедура ПропатчитьФильтрДляПостраничныйНавигации(Кэш, ПараметрыМетода, ДопПараметры, Отказ)  
	
	Перем НавигацияНаправление, лПоследняяЗапись;
	
	ГлавноеОкно 			= Кэш.ГлавноеОкно;  
	ПараметрыАккордеона 	= ГлавноеОкно.АккордеонДополнительный;
	ЗаписейНаСтранице 		= ДопПараметры.РазмерСтраницы;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыАккордеона) Тогда
		
		ПараметрыАккордеона = Новый Структура;
		
	КонецЕсли;
	
	ДопПараметры.Свойство("Направление", НавигацияНаправление);
	ПараметрыАккордеона.Свойство("ФильтрПоследняяЗапись", лПоследняяЗапись); 
	
	Если НавигацияНаправление = "ПредыдущаяСтраница"
		И НЕ ГлавноеОкно.ФильтрСтраница = 1 Тогда 
		
		Направление = "backward";    
		
	ИначеЕсли НавигацияНаправление = "ПерваяСтраница"
		Или ГлавноеОкно.ФильтрСтраница = 1 Тогда
		
		лПоследняяЗапись = Неопределено; 
			
		Направление = "forward";
		
	Иначе
		
		Направление = "forward"; 
		
	КонецЕсли; 
 	
	ПараметрыМетода.Вставить("Навигация", Новый Структура);
	ПараметрыМетода.Навигация.Вставить("Направление", Направление);
	ПараметрыМетода.Навигация.Вставить("КоличествоДокументов", ЗаписейНаСтранице); 
	ПараметрыМетода.Навигация.Вставить("Страница", ГлавноеОкно.ФильтрСтраница);  
	ПараметрыМетода.Навигация.Вставить("РазмерСтраницы", ЗаписейНаСтранице);  
	ПараметрыМетода.Навигация.Вставить("ПоследняяЗапись", лПоследняяЗапись); 
	
КонецПроцедуры   

&НаКлиенте
Процедура ПропатчитьФильтрДляКурсорнойНавигации(Кэш, ПараметрыМетода, ДопПараметры, Отказ)  
	
	Перем НавигацияНаправление, лПоследняяЗапись;
	
	ГлавноеОкно 			= Кэш.ГлавноеОкно;  
	ПараметрыАккордеона 	= ГлавноеОкно.АккордеонДополнительный;
	ЗаписейНаСтранице 		= ПараметрыМетода.Навигация.РазмерСтраницы;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыАккордеона) Тогда
		
		ПараметрыАккордеона = Новый Структура;
		
	КонецЕсли;
	
	Если Не ПараметрыМетода.Навигация.Свойство("ПоследняяЗапись", лПоследняяЗапись) Тогда
		ПараметрыАккордеона.Свойство("ФильтрПоследняяЗапись", лПоследняяЗапись);
	КонецЕсли;
 	
	ПараметрыМетода.Вставить("Навигация", Новый Структура);
	ПараметрыМетода.Навигация.Вставить("Направление", "forward");
	ПараметрыМетода.Навигация.Вставить("КоличествоДокументов", ЗаписейНаСтранице); 
	ПараметрыМетода.Навигация.Вставить("РазмерСтраницы", ЗаписейНаСтранице);  
	ПараметрыМетода.Навигация.Вставить("ПоследняяЗапись", лПоследняяЗапись); 
	ПараметрыМетода.Навигация.Вставить("Страница", ГлавноеОкно.ФильтрСтраница); 
	
КонецПроцедуры

// Процедура устанавливает значения фильтра по-умолчанию для текущего раздела	
&НаКлиенте
Процедура ФильтрОчистить(Кэш) Экспорт
	
	ГлавноеОкно = Кэш.ГлавноеОкно;
	
	// Получить дефолтный фильтр
	ЗаполнитьЗначенияСвойств(ГлавноеОкно, МодульОбъектаКлиент().РазделГО_Получить(Кэш.Текущий, "ПустойФильтр"));

	МодульОбъектаКлиент().РазделГО_ОчиститьФильтрПоследняяЗапись(Кэш.Текущий);
	
КонецПроцедуры

// Функция - Обновляет контент и подготавливает раздел по входным параметрам
//
// Параметры:
//  ПараметрыОбновления	 - Структура - Параметры функции
//  ДопПараметры		 - Структура - Набор параметров для расширения работы функции 
// 
// Возвращаемое значение:
//  Булево - Всегда Истина 
//
&НаКлиенте
Функция ОбновитьКонтентПодговитьРаздел(ПараметрыОбновления, ДопПараметры) Экспорт    
	
	Кэш = ДопПараметры.Кэш; 
		                                                                                                   		
	МодульОбъектаКлиент().ВывестиДополнительныйАккордеон(); 

	Возврат Истина;

КонецФункции     

&НаКлиенте
Процедура ЗавершитьДействияНадДокументами(РезультатОтправки, ДопПараметры) Экспорт
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();

	МодульОбъектаКлиент().ОбновитьДополнительныйАккордеон();
	
	МодульОбъектаКлиент().МассоваяОперация_Показать(РезультатОтправки, Новый ФиксированнаяСтруктура("Владелец", Кэш.ГлавноеОкно));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыРаздела(РазделГО) Экспорт

	ПараметрыBlockly = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ПараметрыBlockly");
	ПараметрыРаздела = МодульОбъектаКлиент().РазделГО_Получить(РазделГО, "ПараметрыРаздела");
	
	ПараметрыРаздела.Вставить("ДоступенФильтрПоТС",
								ПараметрыBlockly.Свойство("Доступно_ТорговаяСеть_list")
									И ПараметрыBlockly.Доступно_ТорговаяСеть_list);

КонецПроцедуры

&НаКлиенте
Функция ЗначенияДляФильтрПоУмолчанию(РазделГО, ДопПараметры = Неопределено) Экспорт

	ФрмФильтр = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаУстановкиФильтра");
			
	ПустойФильтр = ФрмФильтр.ЗначенияДляФильтрПоУмолчанию(РазделГО, ДопПараметры);
	ПустойФильтр.Вставить("ФильтрТС", Неопределено);
	
	Возврат ПустойФильтр;

КонецФункции


#Область include_core2_vo2_Раздел_Полученные_ЗаказВх_ГлавноеОкно
#КонецОбласти
