&НаКлиенте
Перем МестныйКэш;

#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти  

#Область include_core2_vo2_Раздел_Полученные 
#КонецОбласти 

&НаКлиенте
Процедура сбисОформлениеДопПолейРеестра(Кэш) Экспорт
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Срок").Видимость = Истина;   
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Лицо2").Видимость = Истина; 
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РеестрЗаказов")) Тогда
		
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.ТекущееДействие").Видимость = Истина;   
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.ТекущийЭтап").Видимость = Ложь;  
		
	КонецЕсли;  
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.СтатусВГосСистеме").Видимость = Ложь; 

	ОписаниеИзменить	= Новый ФиксированнаяСтруктура("Форма, Реквизит", Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Лицо2");
	Изменения 			= Новый ФиксированнаяСтруктура("Заголовок", "Грузополучатель");
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеИзменить, Изменения);

КонецПроцедуры

// Функция - обновляет контент для подразделов раздела Полученные	
//
// Параметры:
//  Кэш	 - Структура - Кэш обработки 
// 
// Возвращаемое значение:
//  Структура - набор полей для заполнения таблицы реестра документов
//
&НаКлиенте
Функция ОбновитьКонтент(Кэш) Экспорт 
	
	ОбщиеФункцииДокументов = Кэш.ТекущийСеанс.Модули.ФункцииДокументов;	
	СтруктураДляОбновленияФормы = МодульОбъектаКлиент().ПолучитьСписокДокументовСБИС();  
	
	СписокДокументов = СтруктураДляОбновленияФормы.Таблица_РеестрДокументов;    
	
	Для Каждого СтрокаСписка Из СписокДокументов Цикл
		
		ДополнительныеПоля = Новый Структура("СвязанныеДокументы, Документы1С", СтрокаСписка.СвязанныеДокументы, СтрокаСписка.Документы1С); 
		
		СоставПакета = СтрокаСписка.СоставПакета[0].Значение;
		
		МодульОбъектаКлиент().СоставПакета_Обновить(СоставПакета, Новый Структура("ДопПоля", ДополнительныеПоля));	
		
		СписокДействий = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "ТекущееДействие");  
		
		СтрокаСписка.ТекущееДействие = СписокДействий[0].Представление;
		
	КонецЦикла;
	
	ОбщиеФункцииДокументов.ОбновитьПанельНавигации(Кэш); 
	
	Контент = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Контент");
	Контент.ТекущаяСтраница = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Контент, "РеестрДокументов");
	Кэш.ТаблДок = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов");
	
	Кэш.ГлавноеОкно.СписокДопОперацийРеестра.Очистить();
	
	Возврат СтруктураДляОбновленияФормы;     
	
КонецФункции  
	
// Процедура - Обновляет панель массовых операций, панель фильтра, контекстное меню при смене раздела
//
// Параметры:
//  Кэш	 - Структура - Кэш обработки 
//
&НаКлиенте
Процедура НаСменуРаздела(Кэш) Экспорт   
	
	ФормаРаздела = МодульОбъектаКлиент().ПолучитьФормуОбработки("Раздел_Полученные_Полученные");
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РеестрЗаказов")) Тогда
		
		ФормаРаздела.ПодготовитьФильтрРаздела(Кэш);
		
		ГлавноеОкно = Кэш.ГлавноеОкно;
		
		ГлавноеОкно.сбисУстановитьКонтекстноеМеню("Таблица_РеестрДокументов", "КонтекстноеМенюПолученные");
		ГлавноеОкно.сбисУстановитьКонтекстноеМеню("Таблица_РеестрСобытий", "КонтекстноеМенюПолученныеРеестрСобытий");
		ПанельМассовыхОпераций = ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "ПанельМассовыхОпераций");
		ПанельМассовыхОпераций.ТекущаяСтраница = ГлавноеОкно.сбисПолучитьСтраницу(ПанельМассовыхОпераций, "Полученные_ЗаказВх");
		
		СпособИнтеграцииКаталог = Кэш.Парам.СпособОбмена = 1;
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"ПанельМассовыхОпераций").Видимость = Истина;
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"ПанельТулбар").Видимость = Истина;	
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"МассовыеОперацииСопоставить2").Видимость	= Не СпособИнтеграцииКаталог;
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"МассовыеОперацииУтвердить1").Видимость	= Не СпособИнтеграцииКаталог;
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"Сохранить1").Видимость					= Не СпособИнтеграцииКаталог;
		
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"ПанельФильтра").Видимость = Не СпособИнтеграцииКаталог;
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"ПоказатьПанельФильтра").Видимость = Не СпособИнтеграцииКаталог;
		
	Иначе
		ФормаРаздела.НаСменуРаздела(Кэш);
	КонецЕсли; 

	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Грузополучатель").Видимость = Ложь;
	
КонецПроцедуры       
		
// Процедура - Устанавливает видимости колонок при переходе в раздел
//
// Параметры:
//  Кэш	 - Структура - Кэш обработки 
//
&НаКлиенте
Процедура НастроитьКолонки(Кэш) Экспорт  
	
	ФормаРаздела = МодульОбъектаКлиент().ПолучитьФормуОбработки("Раздел_Полученные_Полученные");
	ФормаРаздела.НастроитьКолонки(Кэш); 
	
КонецПроцедуры      

// Процедура - показывает дополнительный аккордеон
//
// Параметры:
//  Кэш	 - Структура - Кэш обработки 
//
&НаКлиенте
Процедура ВывестиДополнительныйАккордеон(Кэш) Экспорт
	Форма = Кэш.ГлавноеОкно;		
	Если Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "АккордеонДополнительныйHTML").Видимость = Истина;
	ИначеЕсли Не МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "АккордеонДополнительныйHTML").Видимость Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "АккордеонДополнительныйHTML").Видимость = Истина;
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "Контент").Ширина = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "Контент").Ширина 
		- МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "АккордеонДополнительныйHTML").Ширина;
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "Контент").Лево = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "Контент").Лево 
		+ МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "АккордеонДополнительныйHTML").Ширина;
	КонецЕсли;  
	
	СтруктураМастерФильтра = МодульОбъектаКлиент().ПолучитьСтруктураМастерФильтра();  
	
	МодульОбъектаКлиент().СформироватьСтруктуруДополнительногоАккордеона(СтруктураМастерФильтра, Новый Структура());
	
КонецПроцедуры

// Функция - Обработчик запроса списка документов
//
// Параметры:
//  Кэш				 - Структура	- Кэш обработки
//  ПараметрыМетода	 - Структура	- Параметры для выполнения метода
//  ДопПараметры	 - Структура	- Набор параметров для расширения работы функции
//  Отказ			 - Булево		- Флаг ошибки при вызове метода
// 
// Возвращаемое значение:
//  Структура - Список документов или структура ошибки
//
&НаКлиенте
Функция ОбработчикЗапросаСпискаДокументов(Кэш, ПараметрыМетода, ДопПараметры, Отказ) Экспорт  
	
	Перем Направление;   
	
	ГлавноеОкно = Кэш.ГлавноеОкно;
	ПараметрыАккордеона = Кэш.ГлавноеОкно.АккордеонДополнительный;
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РеестрЗаказов")) Тогда  
		
		Если ЗначениеЗаполнено(ПараметрыАккордеона) Тогда  
			
			Если НЕ ПараметрыАккордеона.Свойство("Направление", Направление) Тогда 
			
				Направление = "forward"; 
			
			КонецЕсли;
			
			Если ПараметрыАккордеона.Свойство("ФильтрДляРаздела") Тогда
			
				Для Каждого ПараметрФильтра Из ПараметрыАккордеона.ФильтрДляРаздела Цикл
					
					 ПараметрыМетода.Вставить(ПараметрФильтра.Ключ, ПараметрФильтра.Значение);
					
				КонецЦикла;  
			
			КонецЕсли;
			
		Иначе
			
			Направление = "forward";
			
		КонецЕсли; 
			
		ПараметрыМетода.Вставить("Навигация", Новый Структура);
		ПараметрыМетода.Навигация.Вставить("Направление", Направление);
		ПараметрыМетода.Навигация.Вставить("КоличествоДокументов", ГлавноеОкно.ЗаписейНаСтранице); 
		ПараметрыМетода.Навигация.Вставить("Страница", ГлавноеОкно.ФильтрСтраница);  
		ПараметрыМетода.Навигация.Вставить("РазмерСтраницы", ГлавноеОкно.ЗаписейНаСтранице); 
			
		СписокДокументов = МодульОбъектаКлиент().ПолучитьСписокЗаказов(Кэш, ПараметрыМетода, ДопПараметры, Отказ); 
		
	Иначе  
		
		СписокДокументов = Кэш.Интеграция.СБИС_СписокДокументов(Кэш, ПараметрыМетода, ДопПараметры, Отказ);
		
	КонецЕсли;  
	
	Возврат СписокДокументов;
	
КонецФункции   

// Функция - Обновляет контент и подготавливает раздел по входным параметрам
//
// Параметры:
//  ПараметрыОбновления	 - Структура - Параметры функции
//  ДопПараметры		 - Структура - Набор параметров для расширения работы функции 
// 
// Возвращаемое значение:
//  Булево - Всегда Истина 
//
&НаКлиенте
Функция ОбновитьКонтентПодговитьРаздел(ПараметрыОбновления, ДопПараметры) Экспорт    
	
	Кэш = ДопПараметры.Кэш; 
		
	Если МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РеестрЗаказов")) Тогда
		
		ВывестиДополнительныйАккордеон(Кэш); 
		
	Иначе 
		
		Если Не Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
			
			СкрытьДополнительныйАккордеон(); 
			
		Иначе
			
			МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "АккордеонДополнительныйHTML").Видимость = Ложь; 
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат Истина;

КонецФункции     

// ОФ Скрывает Дополнительный аккордеон
&НаКлиенте
Процедура СкрытьДополнительныйАккордеон() Экспорт
	Если МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "АккордеонДополнительныйHTML").Видимость Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "АккордеонДополнительныйHTML").Видимость = Ложь;
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Контент").Лево = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Контент").Лево 
		- МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "АккордеонДополнительныйHTML").Ширина;
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Контент").Ширина = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Контент").Ширина 
		+ МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "АккордеонДополнительныйHTML").Ширина;
	КонецЕсли;
КонецПроцедуры

#Область include_core2_vo2_Раздел_Полученные_ЗаказВх_ГлавноеОкно
#КонецОбласти
