&НаКлиенте
Перем МестныйКэш;

#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти  

#Область include_core2_vo2_Раздел_Полученные 
#КонецОбласти 

&НаКлиенте
Процедура сбисОформлениеДопПолейРеестра(Кэш) Экспорт
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Срок").Видимость = Истина;   
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Лицо2").Видимость = Истина; 
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РеестрЗаказов")) Тогда
		
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.ТекущееДействие").Видимость = Истина;   
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.ТекущийЭтап").Видимость = Ложь;  
		
	КонецЕсли;  
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.СтатусВГосСистеме").Видимость = Ложь; 

	ОписаниеИзменить	= Новый ФиксированнаяСтруктура("Форма, Реквизит", Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Лицо2");
	Изменения 			= Новый ФиксированнаяСтруктура("Заголовок", "Грузополучатель");
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеИзменить, Изменения);

КонецПроцедуры

// Функция - обновляет контент для подразделов раздела Полученные	
//
// Параметры:
//  Кэш	 - Структура - Кэш обработки 
// 
// Возвращаемое значение:
//  Структура - набор полей для заполнения таблицы реестра документов
//
&НаКлиенте
Функция ОбновитьКонтент(Кэш) Экспорт 
	
	ОбщиеФункцииДокументов = Кэш.ТекущийСеанс.Модули.ФункцииДокументов;	
	СтруктураДляОбновленияФормы = МодульОбъектаКлиент().ПолучитьСписокДокументовСБИС();   
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РеестрЗаказов")) Тогда  
		
		ДопПараметры = Новый Структура;
		
		ДопПараметры.Вставить("ТипыСвязанныхДокументов", МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыСвязанныхДокументов"));
		
		ОбработатьСписокДокументов_Сервер(СтруктураДляОбновленияФормы.Таблица_РеестрДокументов, ДопПараметры);
	
		Для Каждого СтрокаСписка Из СтруктураДляОбновленияФормы.Таблица_РеестрДокументов Цикл 
			
			Если СтрокаСписка.Свойство("Дельта") Тогда
				
				Дельта = СтрокаСписка.Дельта;
				
			Иначе
				
				Дельта = 0;
				
			КонецЕсли;
			
			ДополнительныеПоля = Новый Структура("СвязанныеДокументы, Документы1С, Дельта", 
			СтрокаСписка.СвязанныеДокументы, СтрокаСписка.Документы1С, Дельта); 
				
			
			СоставПакета = СтрокаСписка.СоставПакета[0].Значение;
			
			МодульОбъектаКлиент().СоставПакета_Обновить(СоставПакета, Новый Структура("ДопПоля", ДополнительныеПоля));	
			
			СписокДействий = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "ТекущееДействие");  
			
			Если ЗначениеЗаполнено(СписокДействий) Тогда
				СтрокаСписка.ТекущееДействие = СписокДействий[0].Представление;   
			КонецЕсли;
			
		КонецЦикла;   
			
	КонецЕсли;
	
	ОбщиеФункцииДокументов.ОбновитьПанельНавигации(Кэш); 
	
	Контент = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Контент");
	Контент.ТекущаяСтраница = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Контент, "РеестрДокументов");
	Кэш.ТаблДок = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов");
	
	Кэш.ГлавноеОкно.СписокДопОперацийРеестра.Очистить();
	
	Возврат СтруктураДляОбновленияФормы;     
	
КонецФункции  

&НаСервере
Процедура ОбработатьСписокДокументов_Сервер(СписокДокументов, ДопПараметры)  
	
	Для Каждого СтрокаСписка Из СписокДокументов Цикл   
		
		Если НЕ ЗначениеЗаполнено(СтрокаСписка.Документы1С) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ДокументОснование = СтрокаСписка.Документы1С[0].Значение;
		
		СтрокаСписка.СвязанныеДокументы = МодульОбъектаСервер().СбисОбъектыПоКритериюОтбора(ДокументОснование, ДопПараметры);
		
	КонецЦикла;   
	
КонецПроцедуры
	
// Процедура - Обновляет панель массовых операций, панель фильтра, контекстное меню при смене раздела
//
// Параметры:
//  Кэш	 - Структура - Кэш обработки 
//
&НаКлиенте
Процедура НаСменуРаздела(Кэш) Экспорт   
	
	ФормаРаздела = МодульОбъектаКлиент().ПолучитьФормуОбработки("Раздел_Полученные_Полученные");
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РеестрЗаказов")) Тогда
		
		ФормаРаздела.ПодготовитьФильтрРаздела(Кэш);
		
		ГлавноеОкно = Кэш.ГлавноеОкно;
		
		ГлавноеОкно.сбисУстановитьКонтекстноеМеню("Таблица_РеестрДокументов", "КонтекстноеМенюПолученные");
		ГлавноеОкно.сбисУстановитьКонтекстноеМеню("Таблица_РеестрСобытий", "КонтекстноеМенюПолученныеРеестрСобытий");
		ПанельМассовыхОпераций = ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "ПанельМассовыхОпераций");
		ПанельМассовыхОпераций.ТекущаяСтраница = ГлавноеОкно.сбисПолучитьСтраницу(ПанельМассовыхОпераций, "Полученные_ЗаказВх");
		
		СпособИнтеграцииКаталог = Кэш.Парам.СпособОбмена = 1;
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"ПанельМассовыхОпераций").Видимость = Истина;
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"ПанельТулбар").Видимость = Истина;	
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"МассовыеОперацииСопоставить2").Видимость	= Не СпособИнтеграцииКаталог;
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"МассовыеОперацииУтвердить1").Видимость	= Не СпособИнтеграцииКаталог;
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"Сохранить1").Видимость					= Не СпособИнтеграцииКаталог;
		
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"ПанельФильтра").Видимость = Не СпособИнтеграцииКаталог;
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"ПоказатьПанельФильтра").Видимость = Не СпособИнтеграцииКаталог;
		
	Иначе
		ФормаРаздела.НаСменуРаздела(Кэш);
	КонецЕсли; 

	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Грузополучатель").Видимость = Ложь;
	
КонецПроцедуры       
		
// Процедура - Устанавливает видимости колонок при переходе в раздел
//
// Параметры:
//  Кэш	 - Структура - Кэш обработки 
//
&НаКлиенте
Процедура НастроитьКолонки(Кэш) Экспорт  
	
	ФормаРаздела = МодульОбъектаКлиент().ПолучитьФормуОбработки("Раздел_Полученные_Полученные");
	ФормаРаздела.НастроитьКолонки(Кэш); 
	
КонецПроцедуры      

// Функция - Обработчик запроса списка документов
//
// Параметры:
//  Кэш				 - Структура	- Кэш обработки
//  ПараметрыМетода	 - Структура	- Параметры для выполнения метода
//  ДопПараметры	 - Структура	- Набор параметров для расширения работы функции
//  Отказ			 - Булево		- Флаг ошибки при вызове метода
// 
// Возвращаемое значение:
//  Структура - Список документов или структура ошибки
//
&НаКлиенте
Функция ОбработчикЗапросаСпискаДокументов(Кэш, ПараметрыМетода, ДопПараметры, Отказ) Экспорт  
	
	Перем Направление, ФазаДокумента;   
	
	ГлавноеОкно = Кэш.ГлавноеОкно;
	ПараметрыАккордеона = Кэш.ГлавноеОкно.АккордеонДополнительный;
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РеестрЗаказов")) Тогда  
		
		Если ЗначениеЗаполнено(ПараметрыАккордеона) Тогда  
			
			Если НЕ ПараметрыАккордеона.Свойство("Направление", Направление) Тогда 
			
				Направление = "forward"; 
			
			КонецЕсли;
			
			Если ПараметрыАккордеона.Свойство("ФильтрДляРаздела") Тогда
			
				Для Каждого ПараметрФильтра Из ПараметрыАккордеона.ФильтрДляРаздела Цикл
					
					 ПараметрыМетода.Вставить(ПараметрФильтра.Ключ, ПараметрФильтра.Значение);
					
				КонецЦикла;  
			
			КонецЕсли; 
			
			Если  ПараметрыАккордеона.Свойство("ТекущаяФазаДокумента", ФазаДокумента)
				И ФазаДокумента = "Завершенные" Тогда
			
				ПараметрыМетода.Вставить("СостояниеСобытий", "Отработанные"); 
			
			Иначе 
			
				ПараметрыМетода.Вставить("СостояниеСобытий", "Активные");      
				
			КонецЕсли;
			
		Иначе
			
			Направление = "forward";    
			
			ПараметрыМетода.Вставить("СостояниеСобытий", "Активные"); 
			
		КонецЕсли; 
			 
		
		ПараметрыМетода.Вставить("Навигация", Новый Структура);
		ПараметрыМетода.Навигация.Вставить("Направление", Направление);
		ПараметрыМетода.Навигация.Вставить("КоличествоДокументов", ГлавноеОкно.ЗаписейНаСтранице); 
		ПараметрыМетода.Навигация.Вставить("Страница", ГлавноеОкно.ФильтрСтраница);  
		ПараметрыМетода.Навигация.Вставить("РазмерСтраницы", ГлавноеОкно.ЗаписейНаСтранице); 
			
		СписокДокументов = МодульОбъектаКлиент().ПолучитьСписокЗаказов(Кэш, ПараметрыМетода, ДопПараметры, Отказ); 
		
	Иначе  
		
		СписокДокументов = Кэш.Интеграция.СБИС_СписокДокументов(Кэш, ПараметрыМетода, ДопПараметры, Отказ);
		
	КонецЕсли;  
	
	Возврат СписокДокументов;
	
КонецФункции   

// Функция - Обновляет контент и подготавливает раздел по входным параметрам
//
// Параметры:
//  ПараметрыОбновления	 - Структура - Параметры функции
//  ДопПараметры		 - Структура - Набор параметров для расширения работы функции 
// 
// Возвращаемое значение:
//  Булево - Всегда Истина 
//
&НаКлиенте
Функция ОбновитьКонтентПодговитьРаздел(ПараметрыОбновления, ДопПараметры) Экспорт    
	
	Кэш = ДопПараметры.Кэш; 
		
	Если МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РеестрЗаказов")) Тогда
		
		МодульОбъектаКлиент().ВывестиДополнительныйАккордеон(); 
		
	Иначе 
		
		МодульОбъектаКлиент().СкрытьДополнительныйАккордеон(); 
		
	КонецЕсли;

	Возврат Истина;

КонецФункции     

#Область include_core2_vo2_Раздел_Полученные_ЗаказВх_ГлавноеОкно
#КонецОбласти
