
// функции для совместимости кода 
&НаКлиенте
Функция сбисЭлементФормы(Форма,ИмяЭлемента)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Форма.Элементы.Найти(ИмяЭлемента);
	КонецЕсли;
	Возврат Форма.ЭлементыФормы.Найти(ИмяЭлемента);
КонецФункции

&НаКлиенте
Функция сбисПолучитьСтраницу(Элемент, ИмяСтраницы)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Элемент.ПодчиненныеЭлементы[ИмяСтраницы];
	КонецЕсли;
	Возврат Элемент.Страницы[ИмяСтраницы];
КонецФункции

// функция обновляет контент для подразделов раздела Полученные	
&НаКлиенте
Функция ОбновитьКонтент(Кэш) Экспорт
	МестныйКэш = Кэш;
	СтруктураДляОбновленияФормы = Кэш.Интеграция.сбисПолучитьСписокДокументов(Кэш);
	Кэш.ОбщиеФункции.ОбновитьПанельНавигации(Кэш);
	ГлавноеОкно = Кэш.ГлавноеОкно;
	Контент = сбисЭлементФормы(ГлавноеОкно, "Контент");
	Контент.ТекущаяСтраница = сбисПолучитьСтраницу(Контент, "РеестрДокументов");	
	Кэш.ТаблДок = сбисЭлементФормы(ГлавноеОкно,"Таблица_РеестрДокументов");
	Кэш.ГлавноеОкно.СписокДопОперацийРеестра.Очистить();
	Возврат СтруктураДляОбновленияФормы;
КонецФункции

&НаКлиенте
Функция ПараметраФильтраДляСобытий() Экспорт
	
	ФормаГлавноеОкно	= МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаГлавноеОкно");
	ДопПараметрыФильтра = Новый Структура("Тип",				ФормаГлавноеОкно.Кэш.Текущий.ТипДок);
	Результат			= Новый Структура("ДопФильтры, Реестр", ДопПараметрыФильтра, "СписокДокументов");
	Возврат Результат;
	
КонецФункции

// Процедура открывает окно просмотра документа	
&НаКлиенте
Процедура ПоказатьДокумент(Кэш, СтрТабл) Экспорт
	МестныйКэш = Кэш;
	ГлавноеОкно = Кэш.ГлавноеОкно;
	МассивПакетов = ПодготовитьСтруктуруДокумента(СтрТабл, Кэш);
	Если МассивПакетов.Количество() > 0 Тогда
		ПолныйСоставПакета = МассивПакетов[0];
		
		//1189641556
		ТекущийРаздел = Кэш.Разделы["р"+Кэш.Текущий.Раздел];   
		
		ДопПараметры = Новый Структура;  
		ДопПараметры.Вставить("ТекущийРаздел",ТекущийРаздел); 
		
		Попытка
			Кэш.СБИС.МодульОбъектаКлиент.ПодготовитьДокументСбисКПросмотру(ПолныйСоставПакета,ДопПараметры);
		Исключение
			Кэш.СБИС.МодульОбъектаКлиент.ВызватьСбисИсключение(ИнформацияОбОшибке(), "Раздел_Полученные_Шаблон.ПоказатьДокумент");
		КонецПопытки;
		
		Если МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РасширенныйФункционалСопоставленияНоменклатуры")) Тогда 
			фрм = ГлавноеОкно.сбисНайтиФормуФункции("ПоказатьДокумент","ФормаПросмотрДокументаРасширенноеСопоставление","", Кэш);
			фрм.ПоказатьДокумент(Кэш,ПолныйСоставПакета); 	
		Иначе
			фрм = ГлавноеОкно.сбисНайтиФормуФункции("ПоказатьДокумент", "ФормаПросмотрДокумента","", Кэш);
			фрм.ПоказатьДокумент(Кэш,ПолныйСоставПакета);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

// Процедура обновляет панель массовых операций, панель фильтра, контекстное меню при смене раздела	
&НаКлиенте
Процедура НаСменуРаздела(Кэш) Экспорт
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("НаСменуРаздела","Раздел_Полученные_Полученные","", Кэш);
	фрм.НаСменуРаздела(Кэш);
КонецПроцедуры

// Процедура устанавливает значения фильтра по-умолчанию для текущего раздела	
&НаКлиенте
Процедура ФильтрОчистить(Кэш) Экспорт
	ГлавноеОкно = Кэш.ГлавноеОкно;
	
	ОписаниеТиповФильтра = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолейФильтра");
	Если Не ТипЗнч(ОписаниеТиповФильтра) = Тип("Структура") Тогда
		ОписаниеТиповФильтра = Новый Структура;
	КонецЕсли;
	
	ГлавноеОкно.ФильтрПериод = "За весь период";
	
	Если ОписаниеТиповФильтра.Свойство("ФильтрОрганизация") Тогда
		ГлавноеОкно.ФильтрОрганизация = ОписаниеТиповФильтра.ФильтрОрганизация.ПривестиЗначение();
	Иначе	
		ГлавноеОкно.ФильтрОрганизация = "";
	КонецЕсли;
	Если ОписаниеТиповФильтра.Свойство("ФильтрКонтрагент") Тогда
		ГлавноеОкно.ФильтрКонтрагент = ОписаниеТиповФильтра.ФильтрКонтрагент.ПривестиЗначение();
	Иначе	
		ГлавноеОкно.ФильтрКонтрагент = "";
	КонецЕсли;
	Если ОписаниеТиповФильтра.Свойство("ФильтрОтветственный") Тогда
		ГлавноеОкно.ФильтрОтветственный = ОписаниеТиповФильтра.ФильтрОтветственный.ПривестиЗначение();
	Иначе	
		ГлавноеОкно.ФильтрОтветственный = "";
	КонецЕсли;
	ГлавноеОкно.ФильтрДатаНач = "";
	ГлавноеОкно.ФильтрДатаКнц = "";
	ГлавноеОкно.ФильтрСостояние = ГлавноеОкно.СписокСостояний.НайтиПоИдентификатору(0).Значение;
	ГлавноеОкно.ФильтрКонтрагентПодключен = "";
	ГлавноеОкно.ФильтрКонтрагентСФилиалами = Ложь;
	ГлавноеОкно.ФильтрСтраница = 1;
	ГлавноеОкно.ФильтрМаска = "";
	
	ПараметрыФильтра = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПараметрыТекущегоФильтра");
	ЗаполнитьЗначенияСвойств(ПараметрыФильтра, ГлавноеОкно);
	МодульФормированияФильтра = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("СформироватьСтруктуруФильтра", Кэш.Текущий.ФормыРаздела);
	Если МодульФормированияФильтра <> Ложь Тогда
		МодульФормированияФильтра.СформироватьСтруктуруФильтра(Кэш, ПараметрыФильтра);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция сбисСписокДополнительныхОпераций(Кэш, ФормаПросмотра) Экспорт
	СписокДопОпераций = Новый СписокЗначений;
	СписокДопОпераций.Добавить("СбисПечать", "Печать");
	СписокДопОпераций.Добавить("СохранитьНаДиск", "Сохранить на диск");
	СписокДопОпераций.Добавить("ОткрытьДокументОнлайн", "Открыть документ на sbis.ru");
	СписокДопОпераций.Добавить("ОткрытьКонтрагентаОнлайнПоПакету", "Открыть контрагента на sbis.ru");
	СписокДопОпераций.Добавить("СформироватьРасхождение", "Сформировать расхождение");
	ФормаПросмотра.СервисДопОперацияПросмотра(СписокДопОпераций);	// alo доп операции из инишки Сервис
	Возврат СписокДопОпераций;
КонецФункции

&НаКлиенте
Функция СохранитьНаДиск(Кэш, ФормаПросмотра) Экспорт
	ФормаПросмотра.СохранитьНаДискНажатие("");
КонецФункции

&НаКлиенте
Функция СбисПечать(Кэш, ФормаПросмотра) Экспорт
	ФормаПросмотра.СбисПечать("");
КонецФункции

&НаКлиенте
Функция ОткрытьДокументОнлайн(Кэш, ФормаПросмотра) Экспорт
	Если ФормаПросмотра<>Неопределено Тогда
	ФормаПросмотра.ОткрытьДокументОнлайн("");
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция СформироватьРасхождение(Кэш, ФормаПросмотра) Экспорт
	ФормаПросмотра.СформироватьРасхождениеНажатие("");
КонецФункции

&НаКлиенте
функция сбисПовторитьЭтап(Кэш, ФормаПросмотра, НазваниеЭтапа) экспорт
	Отказ = Ложь;
	СоставПакета = Кэш.Интеграция.сбисПовторитьЭтап(Кэш, ФормаПросмотра.СоставПакета.Идентификатор, НазваниеЭтапа,Отказ);
	Если Не Отказ Тогда
		ФормаПросмотра.СоставПакета.Вставить("Этап", СоставПакета.Этап);
		УстановитьВидимостьЭлементовВформеПросмотра(ФормаПросмотра, ФормаПросмотра.СоставПакета, Кэш.Парам);
	КонецЕсли;
КонецФункции

// Функция заполняет данные о прохождении документа	
&НаКлиенте
Функция ЗаполнитьПрохождение(СоставПакета) Экспорт
	Если	МестныйКэш = Неопределено 
		И 	НЕ ЭтаФорма.ВладелецФормы = Неопределено Тогда
		
		Попытка
			МестныйКэш = ЭтаФорма.ВладелецФормы.Кэш;
		Исключение
			МестныйКэш = ЭтаФорма.ВладелецФормы.МестныйКэш;
		КонецПопытки;
	КонецЕсли;
	Возврат МестныйКэш.ОбщиеФункции.ЗаполнитьПрохождение(МестныйКэш, СоставПакета, Новый Структура);
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементовВформеПросмотра(ФормаПросмотра, СоставПакета, КэшПарам) Экспорт
    Перем ЭтапыПакета, ДействияПакета;
	
	//Если есть возможность выполнить аннулирование документа, то форма переходов должна быть доступна
	СостояниеПакета = СоставПакета;
	ЕстьАннулирование	= Не	(	СостояниеПакета.Свойство("Состояние", СостояниеПакета)
								И	СостояниеПакета.Свойство("Название", СостояниеПакета)
								И	СостояниеПакета = "Отозван мной");
	ЭлементЭтап			= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ФормаПросмотра, "ТекущийЭтап");
	ЭлементУтвердить	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ФормаПросмотра, "Утвердить");
	ЭлементОтклонить	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ФормаПросмотра, "Отклонить");
	ЭлементЭтап.Видимость = Истина;
	Если	СоставПакета.Свойство("Этап", ЭтапыПакета)
		И	ЭтапыПакета.Количество()
		И	ЭтапыПакета[0].Свойство("Действие",ДействияПакета)
		И	ДействияПакета.Количество() Тогда
		
		ЭлементУтвердить.Видимость = Истина;
		ЭлементУтвердить.Заголовок = ДействияПакета[0].Название;
		Если ДействияПакета.Количество() > 1 Тогда
			ЭлементОтклонить.Видимость = Истина;
			ЭлементОтклонить.Заголовок = ДействияПакета[1].Название;
		Иначе
			ЭлементОтклонить.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		ЭлементЭтап.Видимость		= ЕстьАннулирование;
		ЭлементОтклонить.Видимость	= Ложь;
		ЭлементУтвердить.Видимость	= Ложь;
	КонецЕсли;
	
	ПанельТулБара = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ФормаПросмотра, "ТулБар");
	ПанельТулБара.ТекущаяСтраница = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ПанельТулБара, "Полученные"); 
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСтруктуруФильтра(Кэш, ПараметрыФормирования) Экспорт
	
	// Значения по умолнанию
	ТипыПолейФильтра = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолейФильтра");
	МодульСпискаСостояний = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("СписокСостоянийДокумента", Кэш.Текущий.ФормыРаздела);
	СписокСостояний = ?(МодульСпискаСостояний = Ложь, Новый СписокЗначений, МодульСпискаСостояний.СписокСостоянийДокумента());
	
	ПараметрыФильтра = Новый Структура;
		
	ПараметрыФильтра.Вставить("ФильтрСтраница",				1);
	ПараметрыФильтра.Вставить("ФильтрПериод",				"За весь период");

	ПараметрыФильтра.Вставить("ФильтрДатаНач",				"");
	ПараметрыФильтра.Вставить("ФильтрДатаКнц",				"");
	ПараметрыФильтра.Вставить("ФильтрКонтрагентПодключен",	"");
	ПараметрыФильтра.Вставить("ФильтрКонтрагентСФилиалами",	"");
	ПараметрыФильтра.Вставить("ФильтрМаска",				"");
	
	ПараметрыФильтра.Вставить("ФильтрСостояние",			СписокСостояний.НайтиПоИдентификатору(0).Значение);
	ПараметрыФильтра.Вставить("ФильтрКонтрагент",			ТипыПолейФильтра.ФильтрКонтрагент.ПривестиЗначение());
	ПараметрыФильтра.Вставить("ФильтрОрганизация",			ТипыПолейФильтра.ФильтрОрганизация.ПривестиЗначение());
	ПараметрыФильтра.Вставить("ФильтрОтветственный",		ТипыПолейФильтра.ФильтрОтветственный.ПривестиЗначение());
	ПараметрыФильтра.Вставить("ФильтрТипыДокументов",		Новый СписокЗначений);
	
	// Значения из сохранений
	ТекущийФильтр = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПараметрыТекущегоФильтра");
	
	ЗаполнитьЗначенияСвойств(ПараметрыФильтра, ТекущийФильтр);
	
	// Переданные значения
	ЗаполнитьЗначенияСвойств(ПараметрыФильтра, ПараметрыФормирования);
	
	// Записываем в параметры текущего сеанса
	МодульОбъектаКлиент().ИзменитьПараметрСбис("ПараметрыТекущегоФильтра", ПараметрыФильтра);
	
КонецПроцедуры

&НаКлиенте
Функция СписокСостоянийДокумента() Экспорт

	СписокСостояний = Новый СписокЗначений();
	СписокСостояний.Добавить("Все документы");
	СписокСостояний.Добавить("Требующие ответа");
	СписокСостояний.Добавить("Утвержденные");
	СписокСостояний.Добавить("Отклоненные");
	СписокСостояний.Добавить("Незакрепленные");
	СписокСостояний.Добавить("Удаленные");
	СписокСостояний.Добавить("Аннулированные");
	СписокСостояний.Добавить("Черновики");
	
	Возврат СписокСостояний;
	
КонецФункции

