
// функции для совместимости кода 
&НаКлиенте
Функция сбисЭлементФормы(Форма,ИмяЭлемента)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Форма.Элементы.Найти(ИмяЭлемента);
	КонецЕсли;
	Возврат Форма.ЭлементыФормы.Найти(ИмяЭлемента);
КонецФункции

&НаКлиенте
Функция сбисПолучитьСтраницу(Элемент, ИмяСтраницы)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Элемент.ПодчиненныеЭлементы[ИмяСтраницы];
	КонецЕсли;
	Возврат Элемент.Страницы[ИмяСтраницы];
КонецФункции

// функция обновляет контент для подразделов раздела Полученные	
&НаКлиенте
Функция ОбновитьКонтент(Кэш) Экспорт
	МестныйКэш = Кэш;
	СтруктураДляОбновленияФормы = МодульОбъектаКлиент().ПолучитьСписокДокументовСБИС();
	Кэш.ОбщиеФункции.ОбновитьПанельНавигации(Кэш);
	ГлавноеОкно = Кэш.ГлавноеОкно;
	Контент = сбисЭлементФормы(ГлавноеОкно, "Контент");
	Контент.ТекущаяСтраница = сбисПолучитьСтраницу(Контент, "РеестрДокументов");	
	Кэш.ТаблДок = сбисЭлементФормы(ГлавноеОкно,"Таблица_РеестрДокументов");
	Кэш.ГлавноеОкно.СписокДопОперацийРеестра.Очистить();
	Возврат СтруктураДляОбновленияФормы;
КонецФункции

&НаКлиенте
Функция ПараметраФильтраДляСобытий() Экспорт
	
	ФормаГлавноеОкно	= МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаГлавноеОкно");
	ДопПараметрыФильтра = Новый Структура("Тип",				ФормаГлавноеОкно.Кэш.Текущий.ТипДок);
	Результат			= Новый Структура("ДопФильтры, Реестр", ДопПараметрыФильтра, "СписокДокументов");
	Возврат Результат;
	
КонецФункции

// Процедура открывает окно просмотра документа	
&НаКлиенте
Процедура ПоказатьДокумент(Кэш, СтрТабл) Экспорт
	МестныйКэш = Кэш;
	ГлавноеОкно = Кэш.ГлавноеОкно;
	МассивПакетов = ПодготовитьСтруктуруДокумента(СтрТабл, Кэш);
	Если МассивПакетов.Количество() > 0 Тогда
		ПолныйСоставПакета = МассивПакетов[0];
		
		//1189641556
		ТекущийРаздел = Кэш.Разделы["р"+Кэш.Текущий.Раздел];   
		
		ДопПараметры = Новый Структура;  
		ДопПараметры.Вставить("ТекущийРаздел",ТекущийРаздел); 
		
		ПодготовитьДокументКПросмотру(ПолныйСоставПакета, ДопПараметры);
		
		Если МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РасширенныйФункционалСопоставленияНоменклатуры")) Тогда 
			фрм = ГлавноеОкно.сбисНайтиФормуФункции("ПоказатьДокумент","ФормаПросмотрДокументаРасширенноеСопоставление","", Кэш);
			фрм.ПоказатьДокумент(Кэш,ПолныйСоставПакета); 	
		Иначе
			фрм = ГлавноеОкно.сбисНайтиФормуФункции("ПоказатьДокумент", "ФормаПросмотрДокумента","", Кэш);
			фрм.ПоказатьДокумент(Кэш,ПолныйСоставПакета);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

// Использовать процедуру "ПодготовитьДокументСбис" из "ДокументСбис_Шаблон"
&НаКлиенте
Процедура ПодготовитьДокументКПросмотру(МассивПакетов, ДопПараметры) Экспорт
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш(); 
	
	МассивПакетов.Параметры.Вставить("ЕстьАннулирование", Ложь);
	
	сч = 0;
	// 4Sych
	Если МассивПакетов.Вложение.Количество() Тогда
		
		МодульОбъектаКлиент().ВложениеСБИС_Получить(МассивПакетов.Вложение[0], "ВизуализацияДокумента", Новый ФиксированнаяСтруктура("СоставПакета", МассивПакетов));

		Для Каждого Элемент Из МассивПакетов.Вложение Цикл

			Если МассивПакетов.Свойство("Событие") Тогда
				Элемент.Вставить("Событие", МассивПакетов.Событие);
			КонецЕсли;

			МассивПакетов.Вложение[сч].Вставить("Отмечен", Истина);
			сч = сч + 1;

		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Процедура обновляет панель массовых операций, панель фильтра, контекстное меню при смене раздела	
&НаКлиенте
Процедура НаСменуРаздела(Кэш) Экспорт
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("НаСменуРаздела","Раздел_Полученные_Полученные","", Кэш);
	фрм.НаСменуРаздела(Кэш);
КонецПроцедуры

&НаКлиенте
Функция сбисСписокДополнительныхОпераций(Кэш, ФормаПросмотра) Экспорт
	СписокДопОпераций = Новый СписокЗначений;
	СписокДопОпераций.Добавить("СбисПечать", "Печать");
	СписокДопОпераций.Добавить("СохранитьНаДиск", "Сохранить на диск");
	СписокДопОпераций.Добавить("ОткрытьДокументОнлайн", "Открыть документ на sbis.ru");
	СписокДопОпераций.Добавить("ОткрытьКонтрагентаОнлайнПоПакету", "Открыть контрагента на sbis.ru");
	СписокДопОпераций.Добавить("СформироватьРасхождение", "Сформировать расхождение");
	ФормаПросмотра.СервисДопОперацияПросмотра(СписокДопОпераций);	// alo доп операции из инишки Сервис
	Возврат СписокДопОпераций;
КонецФункции

&НаКлиенте
Функция СохранитьНаДиск(Кэш, ФормаПросмотра) Экспорт
	ФормаПросмотра.СохранитьНаДискНажатие("");
КонецФункции

&НаКлиенте
Функция СбисПечать(Кэш, ФормаПросмотра) Экспорт
	ФормаПросмотра.СбисПечать("");
КонецФункции

&НаКлиенте
Функция ОткрытьДокументОнлайн(Кэш, ФормаПросмотра) Экспорт
	Если ФормаПросмотра<>Неопределено Тогда
	ФормаПросмотра.ОткрытьДокументОнлайн("");
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция СформироватьРасхождение(Кэш, ФормаПросмотра) Экспорт
	ФормаПросмотра.СформироватьРасхождениеНажатие("");
КонецФункции

&НаКлиенте
функция сбисПовторитьЭтап(Кэш, ФормаПросмотра, НазваниеЭтапа) экспорт
	Отказ = Ложь;
	СоставПакета = Кэш.Интеграция.сбисПовторитьЭтап(Кэш, ФормаПросмотра.СоставПакета.Идентификатор, НазваниеЭтапа,Отказ);
	Если Не Отказ Тогда
		ФормаПросмотра.СоставПакета.Вставить("Этап", СоставПакета.Этап);
		УстановитьВидимостьЭлементовВформеПросмотра(ФормаПросмотра, ФормаПросмотра.СоставПакета, Кэш.Парам);
	КонецЕсли;
КонецФункции

// Функция заполняет данные о прохождении документа	
&НаКлиенте
Функция ЗаполнитьПрохождение(СоставПакета) Экспорт
	Если	МестныйКэш = Неопределено 
		И 	НЕ ЭтаФорма.ВладелецФормы = Неопределено Тогда
		
		Попытка
			МестныйКэш = ЭтаФорма.ВладелецФормы.Кэш;
		Исключение
			МестныйКэш = ЭтаФорма.ВладелецФормы.МестныйКэш;
		КонецПопытки;
	КонецЕсли;
	Возврат МестныйКэш.ОбщиеФункции.ЗаполнитьПрохождение(МестныйКэш, СоставПакета, Новый Структура);
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементовВформеПросмотра(ФормаПросмотра, СоставПакета, КэшПарам) Экспорт
    Перем ЭтапыПакета, ДействияПакета;
	
	//Если есть возможность выполнить аннулирование документа, то форма переходов должна быть доступна
	СостояниеПакета = СоставПакета;
	ЕстьАннулирование	= Не	(	СостояниеПакета.Свойство("Состояние", СостояниеПакета)
								И	СостояниеПакета.Свойство("Название", СостояниеПакета)
								И	СостояниеПакета = "Отозван мной");
	ЭлементЭтап			= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ФормаПросмотра, "ТекущийЭтап");
	ЭлементУтвердить	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ФормаПросмотра, "Утвердить");
	ЭлементОтклонить	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ФормаПросмотра, "Отклонить");
	ЭлементЭтап.Видимость = Истина;
	Если	СоставПакета.Свойство("Этап", ЭтапыПакета)
		И	ЭтапыПакета.Количество()
		И	ЭтапыПакета[0].Свойство("Действие",ДействияПакета)
		И	ДействияПакета.Количество() Тогда
		
		ЭлементУтвердить.Видимость = Истина;
		ЭлементУтвердить.Заголовок = ДействияПакета[0].Название;
		Если ДействияПакета.Количество() > 1 Тогда
			ЭлементОтклонить.Видимость = Истина;
			ЭлементОтклонить.Заголовок = ДействияПакета[1].Название;
		Иначе
			ЭлементОтклонить.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		ЭлементЭтап.Видимость		= ЕстьАннулирование;
		ЭлементОтклонить.Видимость	= Ложь;
		ЭлементУтвердить.Видимость	= Ложь;
	КонецЕсли;
	
	ПанельТулБара = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ФормаПросмотра, "ТулБар");
	ПанельТулБара.ТекущаяСтраница = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ПанельТулБара, "Полученные"); 
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если ЭлементУтвердить.Видимость = Истина И СтрДлина(ЭлементУтвердить.Заголовок) > 10 Тогда
			ТекущийШрифт = ЭлементУтвердить.Шрифт;
			ЭлементУтвердить.Шрифт = Новый Шрифт(ТекущийШрифт,, 9);
		Иначе                                                 
			ТекущийШрифт = ЭлементУтвердить.Шрифт;
			ЭлементУтвердить.Шрифт = Новый Шрифт(ТекущийШрифт,, 11);
		КонецЕсли;
		
		Если ЭлементОтклонить.Видимость = Истина И СтрДлина(ЭлементОтклонить.Заголовок) > 10 Тогда
			ТекущийШрифт = ЭлементОтклонить.Шрифт;
			ЭлементОтклонить.Шрифт = Новый Шрифт(ТекущийШрифт,, 9);
		Иначе
			ТекущийШрифт = ЭлементОтклонить.Шрифт;
			ЭлементОтклонить.Шрифт = Новый Шрифт(ТекущийШрифт,, 11);
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Функция СписокСостоянийДокумента() Экспорт

	СписокСостояний = Новый СписокЗначений();
	СписокСостояний.Добавить("Все документы");
	СписокСостояний.Добавить("Требующие ответа");
	СписокСостояний.Добавить("Утвержденные");
	СписокСостояний.Добавить("Отклоненные");
	СписокСостояний.Добавить("Незакрепленные");
	СписокСостояний.Добавить("Удаленные");
	СписокСостояний.Добавить("Аннулированные");
	СписокСостояний.Добавить("Черновики");
	
	Возврат СписокСостояний;
	
КонецФункции

