
//ДопПараметры - Структура: 
&НаКлиенте
Функция СформироватьНаборПодстановок(Вложение=Неопределено, ДопПараметры=Неопределено) Экспорт
	
	Если Вложение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		НаборПодстановок = Новый Соответствие;
		НаборПодстановок.Вставить("Генератор", НовыйПодстановкаГенератор(Вложение, ДопПараметры));
	Исключение
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнформацияОбОшибке(), "Файл_Шаблон.СформироватьНаборПодстановок");
	КонецПопытки;
		
	Возврат НаборПодстановок;
	
КонецФункции

// Функция - конструктор подстановки "Генератор"
//
// Параметры:
//  Вложение	 - 	 - 
//  ДопПараметры - Структура:
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Функция НовыйПодстановкаГенератор(Вложение, ДопПараметры)
	Перем Кэш;
	
	Если Не ДопПараметры.Свойство("Кэш", Кэш) Тогда
		Кэш = ВладелецФормы.Кэш;
	КонецЕсли;

	Генератор = Новый Соответствие;
	Попытка
		ЗаполнитьГенераторДаннымиВложения(Кэш, Генератор, Вложение, ДопПараметры);
	Исключение
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнформацияОбОшибке(), "Файл_Шаблон.СформироватьПодстановкуГенератор");
	КонецПопытки;
		
	Возврат Генератор;
	
КонецФункции

