
///////////////////////////////////////////////////////////////////////
// Генератор для ComersML спилен в 25.1100, далее принимает только 3.01
///////////////////////////////////////////////////////////////////////

&НаКлиенте
Функция СформироватьДокументДляГенератора(ПараметрыФормированияВходящие, Кэш) Экспорт
    Перем ТекДокументАдресДоставки;
	
	Док		= ПараметрыФормированияВходящие.Документ;
	Вложение= ПараметрыФормированияВходящие.Вложение;
	
	ТекДокумент = Док.Файл.Документ;
	
	//TODO удалить в 24.2100
	//Это не нужно, т.к. стороны должны определяться на стадии ПрочитатьДокумент, а не сгенерировать вложение.
	//Как временное решение, можно восстановить эту логику, но простановка ГП и ГО тут это ошибка
	//Если НЕ ТекДокумент.Свойство("Грузоотправитель") Тогда
	//	ТекДокумент.Вставить("Грузоотправитель", Новый Структура());
	//	Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(ТекДокумент.Грузоотправитель, Вложение.Отправитель);
	//КонецЕсли;
	//Если НЕ ТекДокумент.Свойство("Грузополучатель") Тогда
	//	ТекДокумент.Вставить("Грузополучатель", Новый Структура());
	//	Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(ТекДокумент.Грузополучатель, Вложение.Получатель);
	//КонецЕсли;
	
	РегистрационныеСведения = Неопределено;
	
	Если ТекДокумент.Свойство("Поставщик")
		И ТекДокумент.Поставщик.Свойство("СвФЛ", РегистрационныеСведения) Тогда
	
		ТекДокумент.Поставщик.Вставить("СвИП", РегистрационныеСведения);
		ТекДокумент.Поставщик.Удалить("СвФЛ");
	
	КонецЕсли;
	
	Если ТекДокумент.Свойство("Покупатель")
		И ТекДокумент.Покупатель.Свойство("СвФЛ", РегистрационныеСведения) Тогда
	
		ТекДокумент.Покупатель.Вставить("СвИП", РегистрационныеСведения);
		ТекДокумент.Покупатель.Удалить("СвФЛ");
	
	КонецЕсли;
	
	Если ТекДокумент.Свойство("АдресДоставки", ТекДокументАдресДоставки) Тогда
		Если ЗначениеЗаполнено(ТекДокументАдресДоставки) И ТекДокумент.Свойство("Грузополучатель") Тогда
			//Заменяется адрес ГП на адрес доставки. Логика из XSLT.
			АдресСписок = Новый Массив;
			АдресСписок.Добавить(ТекДокумент.АдресДоставки);
			ТекДокумент.Грузополучатель.Вставить("Адрес", АдресСписок);
		КонецЕсли;
		ТекДокумент.Удалить("АдресДоставки");
	КонецЕсли;
	
	ОшибкаФормирования = Ложь;
	Если ПараметрыФормированияВходящие.Свойство("ФормыПоиска") Тогда
		фрмПараметр = Кэш.ГлавноеОкно.СбисНайтиФормуФункцииСеанса(Кэш, "ЗаполнитьПоДокументПараметр", ПараметрыФормированияВходящие.ФормыПоиска, Новый Структура, ОшибкаФормирования)
	Иначе
		фрмПараметр = ЭтаФорма;
	КонецЕсли; 
	фрмПараметр.ЗаполнитьПоДокументПараметр(Док, Кэш); 
	
	ОшибкаФормирования = Ложь;
	Если ПараметрыФормированияВходящие.Свойство("ФормыПоиска") Тогда
		фрмОснования = Кэш.ГлавноеОкно.СбисНайтиФормуФункцииСеанса(Кэш, "ЗаполнитьПоДокументОснование", ПараметрыФормированияВходящие.ФормыПоиска, Новый Структура, ОшибкаФормирования);
	Иначе
		фрмОснования = ЭтаФорма;
	КонецЕсли;
	//ЗаполнитьПоДокументОснование(Док, Кэш);
	
	СчетчикБезНДС = 0;
	
	Для Каждого ТекСтрока ИЗ ТекДокумент.ТаблДок.СтрТабл Цикл
		
		Если ТекСтрока.НДС.Свойство("Ставка") Тогда
			Если ТекСтрока.НДС.Ставка = "без НДС" Тогда
				ТекСтрока.Вставить("БезНДС", ТекСтрока.НДС.Ставка);
				СчетчикБезНДС = СчетчикБезНДС + 1;
			Иначе
				ТекСтрока.Вставить("БезНДС", "");
			КонецЕсли;
		Иначе
			ТекСтрока.Вставить("БезНДС", "");
		КонецЕсли;
		
	КонецЦикла;
	
	ОшибкаФормирования = Ложь;
	Если ПараметрыФормированияВходящие.Свойство("ФормыПоиска") Тогда
		фрмОснования = Кэш.ГлавноеОкно.СбисНайтиФормуФункцииСеанса(Кэш, "СформироватьОснование", ПараметрыФормированияВходящие.ФормыПоиска, Новый Структура, ОшибкаФормирования)
	Иначе
		фрмОснования = ЭтаФорма;
	КонецЕсли;
	//СформироватьОснование(Док, Кэш);
    
	Если ПараметрыФормированияВходящие.Свойство("ФормыПоиска") Тогда
		фрмПараметров = Кэш.ГлавноеОкно.СбисНайтиФормуФункцииСеанса(Кэш, "СформироватьПараметры", ПараметрыФормированияВходящие.ФормыПоиска, Новый Структура, ОшибкаФормирования);
	Иначе
		фрмПараметров = ЭтаФорма;
	КонецЕсли;
	фрмПараметров.СформироватьПараметры(Док, Кэш);
	
	//Закоментировано в 24.2100, чтобы ПолучитьHTMLПоXML возвращал без подписантов 
	//ТекДокумент.Вставить("Подписант", Новый Структура("ОблПолн", 5));
	
	Возврат Док;
	
КонецФункции

//ДопПараметры - Структура: 
&НаКлиенте
Функция СформироватьНаборПодстановок(Вложение=Неопределено, ДопПараметры=Неопределено) Экспорт
	
	Если Вложение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		НаборПодстановок = Новый Соответствие;
		НаборПодстановок.Вставить("Генератор", НовыйПодстановкаГенератор(Вложение, ДопПараметры));
	Исключение
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнформацияОбОшибке(), "Файл_Шаблон.СформироватьНаборПодстановок");
	КонецПопытки;
		
	Возврат НаборПодстановок;
	
КонецФункции

// Функция - конструктор подстановки "Генератор"
//
// Параметры:
//  Вложение	 - 	 - 
//  ДопПараметры - Структура:
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Функция НовыйПодстановкаГенератор(Вложение, ДопПараметры)
	Перем Кэш;
	
	Если Не ДопПараметры.Свойство("Кэш", Кэш) Тогда
		Кэш = ВладелецФормы.Кэш;
	КонецЕсли;

	Генератор = Новый Соответствие;
	Попытка
		ЗаполнитьГенераторДаннымиВложения(Кэш, Генератор, Вложение, ДопПараметры);
	Исключение
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнформацияОбОшибке(), "Файл_Шаблон.СформироватьПодстановкуГенератор");
	КонецПопытки;
		
	Возврат Генератор;
	
КонецФункции

