/////////////////////////////////////////

&НаКлиенте
Процедура ЗаполнитьГенераторДаннымиВложения(Кэш, Генератор, Вложение, ДопПараметры)

	Файл_Шаблон = Кэш.ГлавноеОкно.СбисПолучитьФормуОбработки(Кэш, "Файл_Шаблон", Новый Структура, Ложь);
	ЗаполнитьОбщиеДанные(Кэш, Генератор, Вложение);
	
	Файл_Шаблон.ЗаполнитьПоИмениСтороны(Кэш, Генератор, Вложение, "Получатель",			ДопПараметры);
	Файл_Шаблон.ЗаполнитьПоИмениСтороны(Кэш, Генератор, Вложение, "Отправитель",		ДопПараметры);
	//Файл_Шаблон.ЗаполнитьПодписант(Кэш, Генератор, Вложение, ДопПараметры);
	ЗаполнитьТабличныеДанные(Кэш, Генератор, Вложение, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Функция ИсточникДанных_ПолучитьДанныеСтороныПоИмени(Кэш, Вложение, ИмяСтороны) Экспорт
	
	Если ИмяСтороны = "Отправитель" Тогда
		Результат = Вложение.Получатель;
	ИначеЕсли ИмяСтороны = "Получатель" Тогда
		Результат = Вложение.Отправитель;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьОбщиеДанные(Кэш, Генератор, Вложение)
	Перем Период;
	
	Файл_Шаблон = Кэш.ГлавноеОкно.СбисПолучитьФормуОбработки(Кэш, "Файл_Шаблон", Новый Структура, Ложь);
	ТекФайл = Вложение.СтруктураДокумента.Файл;
	ТекДокумент = ТекФайл.Документ;
	 
	Генератор.Вставить("ВерсияПрограммы", "VO2_gen");
	
	Файл_Шаблон.УстановитьЗначениеПоКлючу(Генератор, "ИдФайл",		ТекФайл, "Имя");
	Файл_Шаблон.УстановитьЗначениеПоКлючу(Генератор, "КодФормы",	ТекФайл);
	
	Файл_Шаблон.УстановитьЗначениеПоКлючу(Генератор, "Время",		ТекДокумент);
	Файл_Шаблон.УстановитьЗначениеПоКлючу(Генератор, "Дата",		ТекДокумент); 
	Файл_Шаблон.УстановитьЗначениеПоКлючу(Генератор, "ДатаОсн",		ТекДокумент, "Основание.Дата");
	Файл_Шаблон.УстановитьЗначениеПоКлючу(Генератор, "ИдФайл",		ТекДокумент); 
	Файл_Шаблон.УстановитьЗначениеПоКлючу(Генератор, "КодОКВ",		ТекДокумент); 
	Файл_Шаблон.УстановитьЗначениеПоКлючу(Генератор, "НаимОсн",		ТекДокумент, "Основание.Название");
	Файл_Шаблон.УстановитьЗначениеПоКлючу(Генератор, "Номер",		ТекДокумент);
	Файл_Шаблон.УстановитьЗначениеПоКлючу(Генератор, "НомОсн",		ТекДокумент, "Основание.Номер");
	
	Файл_Шаблон.УстановитьЗначениеПоКлючу(Генератор, "СрокДействия.ДатаНачала",		ТекДокумент, "Период.ДатаНач");
	Файл_Шаблон.УстановитьЗначениеПоКлючу(Генератор, "СрокДействия.ДатаОкончания",	ТекДокумент, "Период.ДатаКнц");
	
	Файл_Шаблон.УстановитьЗначениеПоКлючу(Генератор, "Параметры",	ТекДокумент, "Параметр");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГенераторПоСтруктуре(Кэш, Генератор, ИмяРеквизита, СтруктураДанных)
	
	Для Каждого ТекРеквизит ИЗ СтруктураДанных Цикл
		
		Ключ = ИмяРеквизита + ТекРеквизит.Ключ;
		
		ЗначениеВГенераторе = Генератор.Получить(Ключ);
		Если ЗначениеВГенераторе = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		//Если требуется положить по новому пути, то смотрим на значение, указанное в генераторе 
		Если ЗначениеЗаполнено(ЗначениеВГенераторе) Тогда
			Генератор.Вставить(ЗначениеВГенераторе, ТекРеквизит.Значение);
			Генератор.Удалить(Ключ);
		Иначе
			Генератор.Вставить(Ключ, ТекРеквизит.Значение);
		КонецЕсли;
			//Генератор.Вставить(Ключ, ТекРеквизит.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТабличныеДанные(Кэш, Генератор, Вложение, ДопПараметры)
	Перем КоммерческаяИнформация;
	
	Файл_Шаблон = Кэш.ГлавноеОкно.СбисПолучитьФормуОбработки(Кэш, "Файл_Шаблон", Новый Структура, Ложь);
	
	МодульТаблДок = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ИсточникДанных_ПолучитьТабличнуюЧастьДокумента", ДопПараметры.ФормыПоиска);
	
	ТабличнаяЧастьДокумента = МодульТаблДок.ИсточникДанных_ПолучитьТабличнуюЧастьДокумента(Кэш, Вложение, "СтрТабл");
	
	Если ТабличнаяЧастьДокумента = Неопределено Тогда
		Возврат;	
	КонецЕсли;

	ТабличныеДанные = Новый Массив;
	
	Для Каждого ТекСтрока ИЗ ТабличнаяЧастьДокумента Цикл

		ТекДанные = Новый Соответствие();
		
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "ИнфПол",			ТекСтрока, "Параметр");
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "GTIN", 			ТекСтрока);
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "Артикул",			ТекСтрока);
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "ЕдИзм",			ТекСтрока);
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "Идентификатор",	ТекСтрока);
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "Количество",		ТекСтрока, "Кол_во");
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "Кратность",		ТекСтрока);
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "МинЗаказ",		ТекСтрока);
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "Наименование", 	ТекСтрока, "Название");
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "НДСЗначение", 	ТекСтрока, "НДС.Ставка");
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "НДСТип", 			ТекСтрока, "НДС.ТипСтавки");
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "НомНомер",		ТекСтрока, "КодПоставщика");
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "НомНомерСтор",	ТекСтрока, "КодПокупателя");
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "ОКЕИ",			ТекСтрока);
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "Примечание", 		ТекСтрока);
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "ПриостановкаЦен",	ТекСтрока);
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "СуммаНДС",		ТекСтрока, "НДС.Сумма");
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "Цена",			ТекСтрока);
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "ЦенаБезНДС",		ТекСтрока);
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "ЦенаБезНДСДок",	ТекСтрока, "ЦенаСтараяБезНДС");
		Файл_Шаблон.УстановитьЗначениеПоКлючу(ТекДанные, "ЦенаДок",			ТекСтрока, "ЦенаСтарая");
		
		ТабличныеДанные.Добавить(ТекДанные);
		
	КонецЦикла;
	
	Генератор.Вставить("ТабличныеДанные", ТабличныеДанные);
	
КонецПроцедуры

