
//DynamicDirective

// Функция - Применить формат к строке
//
// Параметры:
//  ФорматнаяСтрока			 - Строка	 - к которой применяется формат
//  ПараметрыФорматнойСтроки - Структура/Соответствие/Массив	 - в зависимости от формата
//  КлючФормата				 - Строка	 - как отформатировать строку. Подробнее - смотреть по ключу в коде
// 
// Возвращаемое значение:
//  Строка - отформатированный результат
//
Функция ПрименитьФорматКСтроке(ФорматнаяСтрока, ПараметрыФорматнойСтроки = Неопределено, КлючФормата = "СтрШаблон") Экспорт
	Перем ПараметрДляИзвлечения;
	
	КлючПроверка = НРег(КлючФормата);
	
	Если КлючПроверка = "стршаблон" Тогда
		
		// Применяет шаблон, в зависимости от типа ПараметрыФорматнойСтроки строки
		
		// ПараметрыФорматнойСтроки - Структура/Фиксированная структура/Соответствие - {"МойКлюч1": "Hello", "МойКлюч2": "world"}
		// Пример: "{МойКлюч1} {МойКлюч2}" - > "Hello world", 
		
		// ПараметрыФорматнойСтроки - Массив/Фиксированный Массив - ["Hello", "world"]
		// Пример "{0} {1}" - > "Hello world"
		
		// ПараметрыФорматнойСтроки - Строка - "sad" удалит из шаблона
		// Пример "Hello sad world" - > "Hello world"
		
		// Возможно, надо добавить выпиливание параметров, к которым не приминился шаблон
		НоваяФорматнаяСтрока = ФорматнаяСтрока;
		Если	ТипЗнч(ПараметрыФорматнойСтроки) = Тип("Структура")
			Или	ТипЗнч(ПараметрыФорматнойСтроки) = Тип("ФиксированнаяСтруктура")
			Или	ТипЗнч(ПараметрыФорматнойСтроки) = Тип("Соответствие") Тогда
			
			Для Каждого КлючИЗначение Из ПараметрыФорматнойСтроки Цикл
				
				НоваяФорматнаяСтрока = СтрЗаменить(НоваяФорматнаяСтрока, "{" + КлючИЗначение.Ключ + "}", КлючИЗначение.Значение);
				
			КонецЦикла;
			
		ИначеЕсли	ТипЗнч(ПараметрыФорматнойСтроки) = Тип("Массив")
			Или		ТипЗнч(ПараметрыФорматнойСтроки) = Тип("ФиксированныйМассив") Тогда
			
			Для ИндексСтрок = 0 По ПараметрыФорматнойСтроки.Количество() - 1 Цикл
				
				НоваяФорматнаяСтрока = СтрЗаменить(НоваяФорматнаяСтрока, "{" + ИндексСтрок + "}", ПараметрыФорматнойСтроки[ИндексСтрок]);
				
			КонецЦикла;
			
		Иначе
			
			НоваяФорматнаяСтрока = СтрЗаменить(НоваяФорматнаяСтрока, "{СтрШаблон}", ПараметрыФорматнойСтроки);
			
		КонецЕсли;
	
	ИначеЕсли	КлючПроверка = "стрзаменить" Тогда
		
		// Делает последовательно замены по ключу
		// Пример: "МойКлюч1 МойКлюч2" - "Hello world", 
		// ПараметрыФорматнойСтроки - Структура, Фиксированная структура, либо Соответствие - {"МойКлюч1": "Hello", "МойКлюч2": "world"}

		НоваяФорматнаяСтрока = ФорматнаяСтрока;
		
		Для Каждого КлючИЗначение Из ПараметрыФорматнойСтроки Цикл
			
			НоваяФорматнаяСтрока = СтрЗаменить(НоваяФорматнаяСтрока, КлючИЗначение.Ключ, КлючИЗначение.Значение);
			
		КонецЦикла;
		
	ИначеЕсли	КлючПроверка = "убрать" Тогда
		
		НоваяФорматнаяСтрока = ПрименитьФорматКСтроке_Убрать(ФорматнаяСтрока, ПараметрыФорматнойСтроки);
		
	ИначеЕсли	КлючПроверка = "оставить" Тогда
		
		// Оставляет строку только с описанными символами
		// Пример "1H2e@3l4$5l6o w7o8r9l0d?" -> "Hello world"
		// ПараметрыФорматнойСтроки - Строка - "HhelloWworld "

		Если ПараметрыФорматнойСтроки = Неопределено Тогда
			
			Возврат ФорматнаяСтрока;
			
		КонецЕсли;
		
		НоваяФорматнаяСтрока = "";
		Для	Шаг	= 1	По СтрДлина(ФорматнаяСтрока) Цикл
			
			СимволПроверка = Сред(ФорматнаяСтрока, Шаг, 1);
			Если Не Найти(ПараметрыФорматнойСтроки, СимволПроверка) Тогда
				
				Продолжить;
				
			КонецЕсли;
			НоваяФорматнаяСтрока = НоваяФорматнаяСтрока + СимволПроверка;
			
		КонецЦикла;
		
	ИначеЕсли	КлючПроверка = "ключструктуры" Тогда
		
		НоваяФорматнаяСтрока = ПрименитьФорматКСтроке_Ключ(ФорматнаяСтрока);
		
	ИначеЕсли	КлючПроверка = "формат" Тогда
		
		// Обетка над формат
		НоваяФорматнаяСтрока = Формат(ФорматнаяСтрока, ПараметрыФорматнойСтроки);
		
	ИначеЕсли	КлючПроверка = "каталог" Тогда
		
		Возврат ПрименитьФорматКСтроке_Каталог(ФорматнаяСтрока, ПараметрыФорматнойСтроки);
		
	ИначеЕсли	КлючПроверка = "файл" Тогда
		
		// Убрать для файла символы, которые могут сломать название файла
		НоваяФорматнаяСтрока = ПрименитьФорматКСтроке_Убрать(ФорматнаяСтрока, "\/*?:""<>|" + Символы.Таб);

	Иначе
		
		НоваяФорматнаяСтрока = ФорматнаяСтрока;
		
	КонецЕсли;
	
	Возврат НоваяФорматнаяСтрока;	

КонецФункции

//DynamicDirective

// Функция - Применить формат к строке - сделать ключ структуры
//
// Параметры:
//  ФорматнаяСтрока			 - Строка	 - к которой применяется формат
// 
// Возвращаемое значение:
//  Строка - отформатированный результат
//
Функция ПрименитьФорматКСтроке_Ключ(ФорматнаяСтрока) Экспорт
	
	// Приводит входящую строку так, чтобы ее можно использовать как ключ структуры
	// Пример "1H2e@3l4$5l6o w7o8r9l0d?" -> "Helloworld"

	НоваяФорматнаяСтрока = ПрименитьФорматКСтроке_Убрать(ФорматнаяСтрока);
	Если Найти("0123456789", Лев(НоваяФорматнаяСтрока, 1)) Тогда
		
		//Первый символ - число. Добавить префикс(в структуре ключ не может начинаться с числа)
		НоваяФорматнаяСтрока = "_" + НоваяФорматнаяСтрока;
		
	КонецЕсли;
	
	Возврат НоваяФорматнаяСтрока;	

КонецФункции

//DynamicDirective

// Функция - Применить формат к строке - удалить символы
//
// Параметры:
//  ФорматнаяСтрока			 - Строка	 - к которой применяется формат
//  ПараметрыФорматнойСтроки - Строка	 - набор удаляемых символов
// 
// Возвращаемое значение:
//  Строка - отформатированный результат
//
Функция ПрименитьФорматКСтроке_Убрать(ФорматнаяСтрока, ПараметрыФорматнойСтроки = Неопределено) Экспорт
	
	// Делает последовательно удаления символов из строки
	// Пример "He@l$lo world?" -> "Hello world"
	// ПараметрыФорматнойСтроки - Строка - "@$?"
	
	НоваяФорматнаяСтрока = ФорматнаяСтрока;
	Если ПараметрыФорматнойСтроки = Неопределено Тогда
		
		ПараметрыФорматнойСтроки =  "%@/-?!=\& ""'#№*(:|;).,`~$^–[]{}<>+°";
		
	КонецЕсли;
	
	Для	Шаг	= 1	По СтрДлина(ПараметрыФорматнойСтроки) Цикл
		
		НоваяФорматнаяСтрока = СтрЗаменить(НоваяФорматнаяСтрока, Сред(ПараметрыФорматнойСтроки, Шаг, 1), "");
		
	КонецЦикла;
	
	Возврат НоваяФорматнаяСтрока;

КонецФункции

//DynamicDirective

Функция ПрименитьФорматКСтроке_Каталог(ФорматнаяСтрока, ПараметрыФорматнойСтроки = Неопределено) Экспорт
	Перем ПараметрДляИзвлечения;
	
	ПутьДляФормата = Неопределено;
	Если	ТипЗнч(ПараметрыФорматнойСтроки) = Тип("ФиксированнаяСтруктура")
		Или	ТипЗнч(ПараметрыФорматнойСтроки) = Тип("Структура") Тогда
		
		ПараметрыФорматнойСтроки.Свойство("Контекст",	ПараметрДляИзвлечения);
		ПараметрыФорматнойСтроки.Свойство("Путь",		ПутьДляФормата);
		
	Иначе
		
		ПутьДляФормата = ПараметрыФорматнойСтроки;
		
	КонецЕсли;	
	
	// Собрать путь к каталогу с разделителем
	ТипОС = ТипОСКонтекста(ПараметрДляИзвлечения);
	
	Если ТипОС = "linux" Тогда
		
		сРазделитель = "/";
		
	Иначе
		
		сРазделитель = "\";
		
	КонецЕсли;
	
	НоваяФорматнаяСтрока = ФорматнаяСтрока + ?(Прав(ФорматнаяСтрока, 1) = сРазделитель, "", сРазделитель);
	Если Не ПутьДляФормата = Неопределено Тогда
		
		// Тут мы собираем имя каталога на основании переданного пути + разделителя
		ФорматЗаменить = Новый Соответствие;
		ФорматЗаменить.Вставить("/", " ");
		ФорматЗаменить.Вставить("\", " ");
		
		Если ТипЗнч(ПутьДляФормата) = Тип("Массив") Тогда
		
			// Добавить путь к основному 
			Для Каждого ЭлементПути Из ПутьДляФормата Цикл
				
				НоваяФорматнаяСтрока = НоваяФорматнаяСтрока + ПрименитьФорматКСтроке(ЭлементПути, ФорматЗаменить, "СтрЗаменить") + сРазделитель;
				
			КонецЦикла;
			
		Иначе
			
			// Добавить путь к основному 
			НоваяФорматнаяСтрока = НоваяФорматнаяСтрока + ПрименитьФорматКСтроке(ПутьДляФормата, ФорматЗаменить, "СтрЗаменить") + сРазделитель;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НоваяФорматнаяСтрока;	

КонецФункции

//DynamicDirective

//Функция преобразует строку формата "25.10.2023 21.20.54" или "25.10.2023" в дату 
//для способа обмена SabyHttpsClient, где дата в ответах приходит строкой
Функция ДатаИзСтроки(str) Экспорт
	
	Если ТипЗнч(str) = Тип("Дата") Тогда
		Возврат str;
	КонецЕсли;
	
	Результат = str;
	
	Если	Сред(str,3,1) = "."
		И	Сред(str,6,1) = "." Тогда
		//Переопределим значение как дату, если это действительно она
		Если		СтрДлина(str) = 10 Тогда
			Попытка
				Результат = Дата(Сред(str,7,4), Сред(str,4,2), Лев(str, 2));
			Исключение
				//В случае исключения, ничего не делаем. Это не дата, значение не меняется
			КонецПопытки;
		ИначеЕсли	СтрДлина(str) = 19 Тогда 
			Попытка
				Результат = Дата(Сред(str,7,4), Сред(str,4,2), Лев(str, 2), Сред(str,12, 2), Сред(str,15, 2), Сред(str,18, 2))
			Исключение
				//В случае исключения, ничего не делаем. Это не дата, значение не меняется
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

//Функция сериализует версию из формата 1С в формат Число и обратно. Пример в 1С: 3.0.40.40, пример в число: 3 0000 0040 0040
//DynamicDirective
Функция ПривестиВерсию(Версия, ПараметрыПриведения) Экспорт
		
	ВариантПриведения	= ?(ПараметрыПриведения.Свойство("ВариантПриведения"),	ПараметрыПриведения.ВариантПриведения,	"ЧислоВСтроку");
	Разделитель			= ?(ПараметрыПриведения.Свойство("Разделитель"),		ПараметрыПриведения.Разделитель,		".");
	Заполнитель			= ?(ПараметрыПриведения.Свойство("Заполнитель"),		ПараметрыПриведения.Заполнитель,		"0");
	Разрядность			= ?(ПараметрыПриведения.Свойство("Разрядность"),		ПараметрыПриведения.Разрядность,		4);
	ЧислоРазрядов		= ?(ПараметрыПриведения.Свойство("ЧислоРазрядов"),		ПараметрыПриведения.ЧислоРазрядов,		4);
	Результат			= "";
	
	СтрокаВерсии	= СокрЛП(СтрЗаменить(Формат(Версия, "ЧН=0; ЧГ=0"), Символы.НПП, ""));
	
	Если		ВариантПриведения	= "СтрокуВЧисло" Тогда//Переводит из формата 1.1.1.1 в число 1 0001 0001 0001
		МногоуровневаяСтрока = СтрЗаменить(СтрокаВерсии, Разделитель, Символы.ПС);
		Для шаг = 2 По СтрЧислоСтрок(МногоуровневаяСтрока) Цикл
			СтрокаРазряда = СтрПолучитьСтроку(МногоуровневаяСтрока, шаг);
			Пока СтрДлина(СтрокаРазряда) < Разрядность Цикл
				СтрокаРазряда = Заполнитель + СтрокаРазряда;
			КонецЦикла;
			Результат = Результат + СтрокаРазряда;
		КонецЦикла;
		Результат = СтрПолучитьСтроку(МногоуровневаяСтрока, 1)	+ Результат;
		Результат = Число(Результат);
	ИначеЕсли	ВариантПриведения	= "ЧислоВСтроку" Тогда//Переводит из формата числа 1 0001 0001 0001 в 1.1.1.1
		Если СтрЧислоВхождений(СтрокаВерсии, Разделитель) = ЧислоРазрядов - 1 Тогда//версия уже сериализована.
			Возврат	СтрокаВерсии;
		КонецЕсли;
		ДробЧислоРазрядов	= СтрДлина(СтрокаВерсии) / Разрядность;
		ЦелЧислоРазрядов	= ?(Цел(ДробЧислоРазрядов) = ДробЧислоРазрядов, ДробЧислоРазрядов, Цел(ДробЧислоРазрядов)	+ 1);
		
		Для шаг = 1 По ЦелЧислоРазрядов Цикл
			Если СтрДлина(СтрокаВерсии) > Разрядность * шаг Тогда 
				СтрокаРазряда	= Сред(СтрокаВерсии, (СтрДлина(СтрокаВерсии)	- Разрядность*шаг)+1, Разрядность);
			Иначе
				СтрокаРазряда	= Сред(СтрокаВерсии, 1, Разрядность-(Разрядность*шаг-СтрДлина(СтрокаВерсии)));
			КонецЕсли;
			Пока	Лев(СтрокаРазряда, 1) = Заполнитель
				И	СтрДлина(СтрокаРазряда) > 1	Цикл
				СтрокаРазряда	= Сред(СтрокаРазряда, 2);
			КонецЦикла;
			Результат	= Разделитель	+ СтрокаРазряда	+ Результат;
		КонецЦикла;
		Если ЧислоРазрядов > ЦелЧислоРазрядов Тогда
			Для	шаг = 1 По ЧислоРазрядов - ЦелЧислоРазрядов	Цикл
				Результат = Разделитель	+ Заполнитель + Результат;
			КонецЦикла;
		КонецЕсли;
		Если Лев(Результат, 1) = Разделитель Тогда
			Результат = Сред(Результат, 2);
		КонецЕсли;
	ИначеЕсли	ВариантПриведения	= "Дозаполнить"	Тогда//дозаполнение версии до стандарта. Пример: версия 1.1.1 станет 1.1.1.0
		ВспомогательныйРазделитель	= ?(ПараметрыПриведения.Свойство("ВспомогательныйРазделитель"), ПараметрыПриведения.ВспомогательныйРазделитель, "-");
		шаг = 0;
		Если Не ПустаяСтрока(СтрокаВерсии) Тогда
			МногоСтрочнаяЗапись = СтрЗаменить(СтрокаВерсии, ВспомогательныйРазделитель, Символы.ПС);
			Пока шаг < СтрЧислоСтрок(МногоСтрочнаяЗапись) Цикл
				шаг = шаг + 1;
				Результат = Результат + СтрПолучитьСтроку(МногоСтрочнаяЗапись, шаг)	+ Разделитель;
			КонецЦикла;
		КонецЕсли;
		Пока шаг < ЧислоРазрядов Цикл//Дозаполнить недостающие разряды
			шаг = шаг + 1;
			Результат = Результат + "0" + Разделитель;
		КонецЦикла;
		Результат = Лев(Результат, СтрДлина(Результат) - СтрДлина(Разделитель));
	КонецЕсли;
	
	Возврат	Результат;
	
КонецФункции

