
&НаСервере
Функция	СформироватьФильтрДляРеестраОнлайна_Сторона(ФильтрСсылка, ДопПараметры)
	Перем ДанныеСторонаИни;
	
	СтруктураСтороныДляФильтра	= Новый Структура; 
	ИниКонфигурация				= ИниПоПараметрам("Конфигурация");
	МодульРаботыСДокументами	= МодульОбъектаКлиентСервер();
	
	Если	Не	ИниКонфигурация.Свойство("мСторона",			ДанныеСторонаИни)
		Или	Не	ДанныеСторонаИни.Свойство(ДопПараметры.Ключ, 	ДанныеСторонаИни) Тогда
		ДанныеСторонаИни = Новый Структура;
	КонецЕсли;
	
	ИННСтороны	= СокрЛП(МодульРаботыСДокументами.get_prop(ФильтрСсылка, "ИНН"));
	Если Не ЗначениеЗаполнено(ИННСтороны) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	СвФЛЮЛ		= Новый Структура("ИНН", ИННСтороны);
	
	Если СтрДлина(ИННСтороны) = 12 Тогда
		
		СтруктураСтороныДляФильтра.Вставить("СвФЛ", СвФЛЮЛ);	
		
	Иначе
		
		Попытка
			
			СвФЛЮЛ.Вставить( "КПП", МодульРаботыСДокументами.get_prop(ФильтрСсылка, "КПП"));
			
		Исключение
			
			// если КПП живет в другом реквизите или вообще не в реквизите, а в регистре сведений
			Если ЗначениеЗаполнено(ДанныеСторонаИни) Тогда 
				
				Контекст = Новый Структура("Документ, Ини, ТекущийРазделИни", ФильтрСсылка, ИниКонфигурация, ДанныеСторонаИни);
				СвФЛЮЛ.Вставить("КПП", СокрЛП(МодульРаботыСДокументами.РассчитатьЗначениеНаСервере("Сторона_КПП", Контекст))); 
				
			КонецЕсли;
		КонецПопытки;
		
		СтруктураСтороныДляФильтра.Вставить("СвЮЛ", СвФЛЮЛ);
		
	КонецЕсли;
	
	Если ДанныеСторонаИни.Свойство("Сторона_КодФилиала") Тогда
		
		Контекст = Новый Структура("Документ, Ини, ТекущийРазделИни", ФильтрСсылка, ИниКонфигурация, ДанныеСторонаИни);
		СвФЛЮЛ.Вставить("КодФилиала", СокрЛП(МодульРаботыСДокументами.РассчитатьЗначениеНаСервере("Сторона_КодФилиала", Контекст)));
		
	КонецЕсли;
	
	ЗначениеСФилиалами = Неопределено;
	Если	ДопПараметры.Свойство("Фильтры")
		И	ДопПараметры.Фильтры.Свойство("Фильтр" + ДопПараметры.Ключ + "СФилиалами", ЗначениеСФилиалами)
		И	ЗначениеЗаполнено(ЗначениеСФилиалами)
		И	ЗначениеСФилиалами Тогда
		СтруктураСтороныДляФильтра.Вставить("ДопПоля", "СФилиалами");
	КонецЕсли;
	
	Возврат СтруктураСтороныДляФильтра;
	
КонецФункции 

