
//функция выполняет запрос документов 1С на основании файлов настроек и результат кладет в массив структур 	
&НаКлиенте
Функция ЗаполнитьМассивДокументов1С(ТекстЗапроса, ПараметрыФильтра, КаталогНастроек=Неопределено) Экспорт
	
	ОписаниеЗапроса = МодульОбъектаКлиент().Реестры1С_ПодготовитьКВыполнению(ТекстЗапроса, ПараметрыФильтра);
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("РежимОтладки") Тогда
		
		ДанныеВЛог = Новый Массив;
		лОтладочныеДанные = Новый Структура(
		"Тип,			Модуль,					Вызов,									Время,			Идентификатор,					Сообщение", 
		"CALL_PARAM",	"РаботаСДокументами1С",	"ЗаполнитьМассивДокументов1СНаСервере",	ТекущаяДата(),	"ЗаполнитьМассивДокументов1С",	ОписаниеЗапроса);
		ДанныеВЛог.Добавить(лОтладочныеДанные);
		
		МодульОбъектаКлиент().СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ДанныеВЛог));
					
	КонецЕсли;
	
	Возврат ЗаполнитьМассивДокументов1СНаСервере(ОписаниеЗапроса.Текст, ОписаниеЗапроса.Параметры, ПараметрыФильтра);
	
КонецФункции

//функция выполняет запрос документов 1С на основании файлов настроек и результат кладет в массив структур 	
&НаСервере
Функция ЗаполнитьМассивДокументов1СНаСервере(Знач ТекстЗапроса, Знач ПараметрыЗапроса, ПараметрыФильтра) Экспорт
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Для Каждого КлючИЗначениеПараметр Из ПараметрыЗапроса Цикл
		
		Запрос.УстановитьПараметр(КлючИЗначениеПараметр.Ключ, КлючИЗначениеПараметр.Значение);
		
	КонецЦикла;
	
	Попытка
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
	Исключение
		
		ИсключениеПостроения = МодульОбъектаСервер().НовыйСбисИсключение(ИнформацияОбОшибке(), "РаботаСДокуметами1С.ЗаполнитьМассивДокументов1С", 608);
		ВызватьИсключение МодульОбъектаСервер().СбисИсключение_ВСтроку(ИсключениеПостроения);
		
	КонецПопытки;
	
	
	МассивДокументов = Новый Массив;
	
	Если НЕ ПараметрыФильтра.ВсеДокументы и ПараметрыФильтра.РазмерСтраницы<>"все" Тогда
		Если ПараметрыФильтра.Страница=0 Тогда	// последняя страница
			Если ПараметрыФильтра.ФильтрСостояние = "Все документы" Тогда    // если нет фильтра по состоянию, то сразу вычисляем номера записей для последней страницы
				РезультатТаблица = РезультатЗапроса.Выгрузить();
				РезультатТаблица.Свернуть("Документ");
				НомКнц = РезультатТаблица.Количество();
				КолСтраниц = НомКнц/Число(ПараметрыФильтра.РазмерСтраницы);
				ПараметрыФильтра.Страница = ?(КолСтраниц = Цел(КолСтраниц), Цел(КолСтраниц), Цел(КолСтраниц)+1);
				КолСтраницДо = ?(КолСтраниц = Цел(КолСтраниц), КолСтраниц-1, Цел(КолСтраниц));
				НомНач = КолСтраницДо*Число(ПараметрыФильтра.РазмерСтраницы)+1;
			Иначе   // если есть фильтр по состоянию, то последнюю страницу сможем определить только после перебора всех
				НомНач = 0;
				НомКнц = Выборка.Количество();
			КонецЕсли;
		Иначе
			НомНач = (ПараметрыФильтра.Страница-1)*Число(ПараметрыФильтра.РазмерСтраницы)+1;
			НомКнц = (ПараметрыФильтра.Страница)*Число(ПараметрыФильтра.РазмерСтраницы); 
		КонецЕсли;
	Иначе
		НомНач = 0;
		НомКнц = Выборка.Количество();
	КонецЕсли;
	сч = 0;	
	Пока Выборка.СледующийПоЗначениюПоля("Документ") Цикл //перебираем документы
		ИндексКартинки = -1;
		Если РезультатЗапроса.Колонки.Найти("СтатусЭД")<>Неопределено Тогда
			ИндексКартинки = ОпределитьНомерСтатусаЭДПоПредставлению(Выборка.СтатусЭД);
			Если ПараметрыФильтра.ФильтрСостояние = "Все документы" или
				(ПараметрыФильтра.ФильтрСостояние = "Недоставленные" и (ИндексКартинки=1 или ИндексКартинки=2 или ИндексКартинки=9)) или
				((ПараметрыФильтра.ФильтрСостояние = "Требующие ответа" или ПараметрыФильтра.ФильтрСостояние = "Не получен ответ") и ИндексКартинки=4) или 
				(ПараметрыФильтра.ФильтрСостояние = "Утвержденные" и ИндексКартинки=6) или 
				(ПараметрыФильтра.ФильтрСостояние = "Отклоненные" и ИндексКартинки=5) или
				(ПараметрыФильтра.ФильтрСостояние = "С ошибками" и ИндексКартинки=3) или
				(ПараметрыФильтра.ФильтрСостояние = "Удаленные" и (ИндексКартинки=7 или ИндексКартинки=8)) или // alo
				(ПараметрыФильтра.ФильтрСостояние = "Удаленные контрагентом" и ИндексКартинки=7) или // alo
				(ПараметрыФильтра.ФильтрСостояние = "Удаленные мной" и ИндексКартинки=8) или // alo
				(ПараметрыФильтра.ФильтрСостояние = "Не отправленные" и ИндексКартинки=-1) Тогда
				сч = сч+1;
			Иначе
				//сч = сч-1; // alo чтобы на странице было именно то количество что указана в переключателе
				Продолжить;
			КонецЕсли;
		Иначе
			сч = сч+1;
		КонецЕсли;
		Если сч<НомНач Тогда 
			Продолжить;
		КонецЕсли;
		Если сч>НомКнц Тогда
			ПараметрыФильтра.ФильтрЕстьЕще = Истина;
			Прервать;
		КонецЕсли;
		СписокДокументов = Новый СписокЗначений;//список документов комплекта
		НоваяСтр = Новый Структура;
		// << alo СтатусГос
		Для Каждого Колонка из РезультатЗапроса.Колонки цикл
			НоваяСтр.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
		КонецЦикла; 
		НоваяСтр.Вставить("Документ1С", Выборка.Документ);
		Документы1С = Новый СписокЗначений;
		Документы1С.Добавить(Выборка.Документ);
		НоваяСтр.Вставить("Документы1С", Документы1С);
		НоваяСтр.Вставить("Проведен", сбисИндексКартинкиДокумента1С(Выборка.ДокументПроведен, Выборка.ДокументПометкаУдаления));
		НоваяСтр.Вставить("Статус", ИндексКартинки);
		
		НоваяСтр.Вставить("Дата", Выборка.ДатаДокумента);
		НоваяСтр.Вставить("Номер", сбисНомерНаПечать(Выборка.НомерДокумента));
		НоваяСтр.Вставить("Сумма", Выборка.СуммаДокумента);	// alo СтатусГос >>
		Если РезультатЗапроса.Колонки.Найти("ФайлНастроекДокумента")<>Неопределено и ЗначениеЗаполнено(Выборка.ФайлНастроекДокумента) Тогда
			ФайлНастроек = Выборка.ФайлНастроекДокумента;
		Иначе
			ФайлНастроек = "";
		КонецЕсли;
		СписокДокументов.Добавить(Выборка.Документ,ФайлНастроек);
		Если РезультатЗапроса.Колонки.Найти("Приложение")<>Неопределено Тогда
			Пока Выборка.Следующий() Цикл //перебираем все связанные документы
				Если ЗначениеЗаполнено(Выборка.Приложение) Тогда //если есть связанный документ
					Если РезультатЗапроса.Колонки.Найти("ФайлНастроекПриложения")<>Неопределено и ЗначениеЗаполнено(Выборка.ФайлНастроекПриложения) Тогда
						ФайлНастроек = Выборка.ФайлНастроекПриложения;
					Иначе
						ФайлНастроек = "";
					КонецЕсли;
					СписокДокументов.Добавить(Выборка.Приложение,ФайлНастроек);
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
		НоваяСтр.Вставить("СоставПакета", СписокДокументов);
		МассивДокументов.Добавить(НоваяСтр);
	КонецЦикла;
	
	Если	ПараметрыФильтра.Страница = 0
		И	МассивДокументов.Количество() Тогда	

		// последняя страница и установлен фильтр по состоянию
		Если ПараметрыФильтра.РазмерСтраницы = "все" Тогда
			
			НомерСтраницы	= 1;
			
		Иначе
			
			НомКнц			= МассивДокументов.Количество();
			КолСтраниц		= НомКнц / Число(ПараметрыФильтра.РазмерСтраницы);
			КолСтраницДо	= ?(КолСтраниц = Цел(КолСтраниц), КолСтраниц - 1, Цел(КолСтраниц));
			НомНач			= КолСтраницДо * Число(ПараметрыФильтра.РазмерСтраницы) + 1;
			НомерСтраницы	= ?(КолСтраниц = Цел(КолСтраниц), Цел(КолСтраниц), Цел(КолСтраниц) + 1);
			МассивДокументовПоследнейСтраницы	= Новый Массив;
			Для сч = НомНач По НомКнц Цикл
				
				МассивДокументовПоследнейСтраницы.Добавить(МассивДокументов[сч-1]);
				
			КонецЦикла;
			МассивДокументов	= МассивДокументовПоследнейСтраницы;
				
		КонецЕсли;
		
		ПараметрыФильтра.Страница	= НомерСтраницы;
		
	КонецЕсли;
	
	Возврат МассивДокументов;
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьМассивЭлементовСправочника(ТекстЗапроса, ПараметрыФильтра) Экспорт
	
	Если ПараметрыФильтра = Неопределено Тогда
		ПараметрыФильтра = Новый Структура;
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Для каждого ПараметрЗапроса Из ПараметрыФильтра Цикл
		
		Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
		Запрос.УстановитьПараметр("Есть" + ПараметрЗапроса.Ключ, ЗначениеЗаполнено(ПараметрЗапроса.Значение));
		
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("МассивЭлементовСправочника", Новый Массив);
	ИменаКолонок = "";
	
	Для каждого ОписаниеКолонки Из РезультатЗапроса.Колонки Цикл
		ИменаКолонок = ИменаКолонок + ОписаниеКолонки.Имя + ",";
	КонецЦикла;
	
	ПараметрыЗаполнения.Вставить("ИменаКолонок", Лев(ИменаКолонок, СтрДлина(ИменаКолонок) - 1));
	ПараметрыЗаполнения.Вставить("Выборка", РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией));
	
	ЗаполнитьМассивЭлементовСправочникаИерархически(ПараметрыЗаполнения);
	
	Возврат ПараметрыЗаполнения.МассивЭлементовСправочника;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьМассивЭлементовСправочникаИерархически(ПараметрыЗаполнения) Экспорт
	
	СтрокиДерева = ПараметрыЗаполнения.Выборка.Строки;
	
	Для каждого Выборка Из СтрокиДерева Цикл
		
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			
			СтрокаДерева = Новый Структура(ПараметрыЗаполнения.ИменаКолонок);
			ЗаполнитьЗначенияСвойств(СтрокаДерева, Выборка);
			
			ПараметрыЗаполненияПодстрок = Новый Структура;
			ПараметрыЗаполненияПодстрок.Вставить("МассивЭлементовСправочника", Новый Массив);
			ПараметрыЗаполненияПодстрок.Вставить("ИменаКолонок", ПараметрыЗаполнения.ИменаКолонок);
			ПараметрыЗаполненияПодстрок.Вставить("Выборка", Выборка);
			
			ЗаполнитьМассивЭлементовСправочникаИерархически(ПараметрыЗаполненияПодстрок);
			
			СтрокаДерева.Вставить("Строки", ПараметрыЗаполненияПодстрок.МассивЭлементовСправочника);
			ПараметрыЗаполнения.МассивЭлементовСправочника.Добавить(СтрокаДерева);
			
		Иначе
			
			ПараметрыЗаполненияПодстрок = Новый Структура;
			ПараметрыЗаполненияПодстрок.Вставить("МассивЭлементовСправочника", ПараметрыЗаполнения.МассивЭлементовСправочника);
			ПараметрыЗаполненияПодстрок.Вставить("ИменаКолонок", ПараметрыЗаполнения.ИменаКолонок);
			ПараметрыЗаполненияПодстрок.Вставить("Выборка", Выборка);
			
			ЗаполнитьМассивЭлементовСправочникаИерархически(ПараметрыЗаполненияПодстрок);
		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

