
&НаКлиенте
Функция НовыйАсинхронноеСбисСобытие(ОснованиеДляСобытия = "", СбисДанныеСобытия = Неопределено, СбисТипСобытия = "", ДопПараметры=Неопределено) Экспорт
	
	Результат = НовыйПрикладнойОбъектSABY("АсинхронноеСбисСобытие");
	
	Если ОбъектSABY_ЭтоТип(ОснованиеДляСобытия, "ПрикладнойОбъектSABY") Тогда
		
		// ИД команды и события обязательно должны совпадать. Либо формируется событие на основании другого события.
		ИдСобытия = ПрикладнойОбъектSABY_Получить(ОснованиеДляСобытия, "Идентификатор");
		ПрикладнойОбъектSABY_Установить(Результат, "Идентификатор", ИдСобытия);
		
	ИначеЕсли Не ПустаяСтрока(ОснованиеДляСобытия) Тогда
		
		ПрикладнойОбъектSABY_Установить(Результат, "Идентификатор", ОснованиеДляСобытия);
		
	КонецЕсли;
	
	Результат.Вставить("Данные");
	Результат.Вставить("Тип");
	Результат.Вставить("Получено");
	Результат.Вставить("Обрабатывается", Ложь);
	
	АсинхронноеСбисСобытие_Установить(Результат, "Тип",		СбисТипСобытия);
	АсинхронноеСбисСобытие_Установить(Результат, "Данные",	СбисДанныеСобытия);
	АсинхронноеСбисСобытие_Установить(Результат, "Получено");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура АсинхронноеСбисСобытие_Установить(АсинхронноеСбисСобытие, КлючУстановить, ЗначениеУстановить=Неопределено) Экспорт
	
	Если			КлючУстановить = "Тип" Тогда
		ТипСобытияУстановить = НРег(ЗначениеУстановить);
		Если		ТипСобытияУстановить = "event"			Тогда
			АсинхронноеСбисСобытие.Тип = "Event";
		ИначеЕсли 	ТипСобытияУстановить = "message"		Тогда
			АсинхронноеСбисСобытие.Тип = "Message";
		ИначеЕсли	ТипСобытияУстановить = "error"			Тогда
			АсинхронноеСбисСобытие.Тип = "Error";
		ИначеЕсли	ТипСобытияУстановить = "criticalerror"	Тогда
			АсинхронноеСбисСобытие.Тип = "CriticalError";
		ИначеЕсли	ТипСобытияУстановить = "timeouterror"	Тогда
			АсинхронноеСбисСобытие.Тип = "TimeoutError";
		ИначеЕсли	ТипСобытияУстановить = "async"			Тогда
			АсинхронноеСбисСобытие.Тип = "Async";
		ИначеЕсли	ТипСобытияУстановить = "asyncerror"		Тогда
			АсинхронноеСбисСобытие.Тип = "AsyncError";
		ИначеЕсли	ТипСобытияУстановить = "beforecall"		Тогда
			АсинхронноеСбисСобытие.Тип = "BeforeCall";
		ИначеЕсли	ТипСобытияУстановить = "aftercall"		Тогда
			АсинхронноеСбисСобытие.Тип = "AfterCall";
		Иначе
			АсинхронноеСбисСобытие.Тип = "Unknown";
		КонецЕсли;
	ИначеЕсли	КлючУстановить = "Данные" Тогда
		Если	ЭтоТипСбис(ЗначениеУстановить, "АсинхронноеСбисСобытие") Тогда
			АсинхронноеСбисСобытие.Данные	= ЗначениеУстановить.Данные;
			Если АсинхронноеСбисСобытие.Тип = "Unknown" Тогда
				АсинхронноеСбисСобытие.Тип = ЗначениеУстановить.Тип;
			КонецЕсли;
			Если АсинхронноеСбисСобытие.Идентификатор = "" Тогда
				АсинхронноеСбисСобытие.Идентификатор = ЗначениеУстановить.Идентификатор;
			КонецЕсли;
			АсинхронноеСбисСобытие_Установить(АсинхронноеСбисСобытие, "Получено", ЗначениеУстановить.ПОлучено);
		Иначе
			АсинхронноеСбисСобытие.Данные	= ЗначениеУстановить;
		КонецЕсли;
	ИначеЕсли	КлючУстановить = "Получено" Тогда
		Если	АсинхронноеСбисСобытие.Получено = Неопределено
			И	ЗначениеУстановить = Неопределено Тогда
			ЗначениеУстановить = ТекущаяДата();
		КонецЕсли;
		АсинхронноеСбисСобытие.Получено = ЗначениеУстановить;
		
	ИначеЕсли	КлючУстановить = "Обрабатывается" Тогда
		
		АсинхронноеСбисСобытие.Обрабатывается = ЗначениеУстановить = Истина;

	Иначе
		
		ПрикладнойОбъектSABY_Установить(АсинхронноеСбисСобытие, КлючУстановить, ЗначениеУстановить);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция АсинхронноеСбисСобытие_Получить(АсинхронноеСбисСобытие, КлючПолучить = Неопределено, ТипПолучить = Неопределено) Экспорт
	
	Если ОбъектSABY_ЭтоТип(АсинхронноеСбисСобытие, "АсинхронноеСбисСобытие") Тогда
		
		Если КлючПолучить = "Идентификатор" Тогда
			
			// Есть не типовой идентификатор для события
			Результат = ПрикладнойОбъектSABY_Получить(АсинхронноеСбисСобытие, КлючПолучить);
			Если Результат = Неопределено Тогда
				
				// Ид объекта это ИД события
				Возврат Строка(ПрикладнойОбъектSABY_Получить(АсинхронноеСбисСобытие,, "ид"));
				
			КонецЕсли;
			
			Возврат Результат;
		
		КонецЕсли;
		
		Возврат ПрикладнойОбъектSABY_Получить(АсинхронноеСбисСобытие, КлючПолучить, ТипПолучить);
		
	КонецЕсли;
	
	// Если это не тип асинхронное событие, то сообщение в старом формате. 
	// TODO 26.3100 - убрать обработку не текущего типа
	ТипПроверить = НРег(ТипПолучить);
	Если ТипПроверить = "ид" Тогда
		
		Возврат АсинхронноеСбисСобытие.Идентификатор;
		
	КонецЕсли;
	
КонецФункции

// Процедура - обрабатывает полученное событие из пула ответов
//
// Параметры:
//  АсинхронноеСбисСобытие	 - АсинхронноеСбисСобытие	 - Структура, с описанием полученного ответа
//  Сбис3КомандыОжидаются	 - Соответствие				 - Пул запущенных команд, по которым ожидается ответ
//  Результат				 - Соответствие				 - Пул полученных ответов, по запущенным командам из Сбис3КомандыОжидаются
//
&НаКлиенте
Процедура	АсинхронноеСбисСобытие_ОбработатьПолученное(АсинхронноеСбисСобытие, Сбис3КомандыОжидаются = Неопределено, Результат = Неопределено) Экспорт
	
	ОтветОбработан = Ложь;
	
	Если 		АсинхронноеСбисСобытие.Тип = "Event" Тогда
		ОтветОбработан = АсинхронноеСбисСобытие_ВызватьСобытиеПоПодписке(АсинхронноеСбисСобытие);
	ИначеЕсли   АсинхронноеСбисСобытие.Тип = "CriticalError" Тогда
		ОтветОбработан = АсинхронноеСбисСобытие_ВызватьСобытиеПоПодписке(АсинхронноеСбисСобытие);
		Если Не Сбис3КомандыОжидаются = Неопределено Тогда 
			//При крите дать ответ на все ожидаемые команды
			Для Каждого Сбис3КомандаОжидается Из Сбис3КомандыОжидаются Цикл
				НовоеАсинхронноеСобытие			= НовыйАсинхронноеСбисСобытие(Сбис3КомандаОжидается.Значение, АсинхронноеСбисСобытие);
				КомандаОбрабатываемогоОтвета	= Неопределено;
				
				АсинхронноеСбисСобытие_ОсвободитьПоток(НовоеАсинхронноеСобытие, КомандаОбрабатываемогоОтвета, ОтветОбработан);
				
				Если Не Результат = Неопределено Тогда
					
					Если КомандаОбрабатываемогоОтвета = Неопределено Тогда
						
						Результат.Вставить(Сбис3КомандаОжидается.Ключ, Сбис3КомандаОжидается.Значение); 
						
					Иначе
						
						Результат.Вставить(Сбис3КомандаОжидается.Ключ, КомандаОбрабатываемогоОтвета);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли 	АсинхронноеСбисСобытие.Тип = "Async" Тогда
		//Если это асинхронное событие, то проставим в команду что есть ответ, но поток не снимается а продолжается его ожидание
		АсинхронныйПоток = АсинхронноеСбисСобытие_ПолучитьПоток(АсинхронноеСбисСобытие);
		Если Не АсинхронныйПоток = Неопределено Тогда
			АсинхронныйПоток.Ответ = АсинхронноеСбисСобытие.Данные;
		КонецЕсли;
		
		Если ПолучитьЗначениеПараметраСбис("РежимОтладки") Тогда
			лОтладочныеДанные = Новый Структура("Тип, Модуль, Вызов, Время, Идентификатор, Сообщение", АсинхронноеСбисСобытие.Тип);
			лОтладочныеДанные.Модуль		= ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
			лОтладочныеДанные.Сообщение		= АсинхронноеСбисСобытие.Данные;
			лОтладочныеДанные.Идентификатор	= АсинхронноеСбисСобытие.Идентификатор;
			лОтладочныеДанные.Время			= АсинхронноеСбисСобытие.Получено;
			Если АсинхронныйПоток = Неопределено Тогда
				лОтладочныеДанные.Вызов		= "Unknown";
			Иначе
				лОтладочныеДанные.Вызов		=  АсинхроннаяСбисКоманда_Получить(АсинхронныйПоток, "ИмяВызова");
			КонецЕсли;
			ДанныеВЛог = Новый Массив;
			ДанныеВЛог.Добавить(лОтладочныеДанные);
			СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ДанныеВЛог));
		КонецЕсли;
		
		//Асинхронное событие, поместить промежуточный ответ на всякий
		Возврат;
	КонецЕсли;
	
	//После чтения ответа, посмотрим что с ним сделать:
	//1. Есть соответствующий запрос, отправленный ранее. Тогда надо освободить поток и проверить наличие подписки на тип ответа и вызвать обработчик.
	//2. Мы ожидаем этот ответ синхронно, тогда добавим его в результат чтения.
	//3. Если не 1 и не 2, то добавим полученный ответ в список "ненужных", при необходимости обработать, или выгрузить в лог (включить режим отладки).
			
	КомандаОбрабатаемогоОтвета = Неопределено;
	АсинхронноеСбисСобытие_ОсвободитьПоток(АсинхронноеСбисСобытие, КомандаОбрабатаемогоОтвета, ОтветОбработан);
	
	//Если команда ожидается как ответ, подготовим результат
	КомандаНаВозврат = Неопределено;
	Если	Не Сбис3КомандыОжидаются		= Неопределено
		И	Не КомандаОбрабатаемогоОтвета	= Неопределено Тогда
		КомандаНаВозврат = Сбис3КомандыОжидаются.Получить(АсинхроннаяСбисКоманда_Получить(КомандаОбрабатаемогоОтвета, "Идентификатор"));
	КонецЕсли;
	
	Если КомандаНаВозврат = Неопределено Тогда
		
		Если Не ОтветОбработан Тогда
			АсинхронноеСбисСобытие_ДобавитьНеобработанныйОтвет(АсинхронноеСбисСобытие);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	ИдАсинхСобытия = АсинхронноеСбисСобытие_Получить(АсинхронноеСбисСобытие,"Идентификатор");
	Если Не Результат = Неопределено Тогда
		
		Результат.Вставить(ИдАсинхСобытия, КомандаНаВозврат);
		
	КонецЕсли;
	
	Если Не Сбис3КомандыОжидаются = Неопределено Тогда

		Сбис3КомандыОжидаются.Удалить(ИдАсинхСобытия);
		
	КонецЕсли;
			
КонецПроцедуры
	
//Вызывает метод подписки на событие Event
//Параметры: 
//Сбис3СобытиеОтвет - описание полученного события
//ДопПараметры - дополнительные параметры вызова, которые передаются в обработчик события.
//РезультатСобытия - в переменную помещается результат вызова события по подписке, если функция что-то возвращает
&НаКлиенте
Функция АсинхронноеСбисСобытие_ВызватьСобытиеПоПодписке(АсинхронноеСбисСобытие, ДопПараметры=Неопределено) Экспорт
	
	ИдентификаторОтвета		= АсинхронноеСбисСобытие_Получить(АсинхронноеСбисСобытие, "Идентификатор");
	СбисПараметрыПодписки	= ГлобальныйКэш.СБИС.ДанныеИнтеграции.Подписки.Получить(ИдентификаторОтвета);
	Результат	= Ложь;
	Отказ		= Ложь;
	
	Если Не СбисПараметрыПодписки = Неопределено Тогда
		ИмяФункцииПодписки		= Неопределено;
		МодульФункцииПодписки	= Неопределено;
		
		Если Не СбисПараметрыПодписки.Свойство("Функция", ИмяФункцииПодписки) Тогда
			//Для события QueryID = его тип, если не указана функция вызова
			ИмяФункцииПодписки = ИдентификаторОтвета;
		КонецЕсли;
		Если Не СбисПараметрыПодписки.Свойство("Модуль", МодульФункцииПодписки) Тогда
			МодульФункцииПодписки = МодульОбъектаКлиент();
		КонецЕсли;
		
		ПараметрыСобытия = Новый Структура("Основные, Дополнительные", СбисПараметрыПодписки.Параметры, ДопПараметры);
		Попытка
			ОбработчикСобытия = НовыйСбисОписаниеОповещения(ИмяФункцииПодписки, МодульФункцииПодписки, ПараметрыСобытия);
			ВыполнитьСбисОписаниеОповещения(АсинхронноеСбисСобытие, ОбработчикСобытия);
		Исключение
			РезультатСобытия = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент." + ИмяФункцииПодписки,,,,Новый Структура("data", АсинхронноеСбисСобытие));
			Отказ = Истина;
		КонецПопытки;
		Результат = Истина;
	КонецЕсли;
	
	Если ПолучитьЗначениеПараметраСбис("РежимОтладки") Тогда
		ДанныеВЛог = Новый Массив;
		
		лОтладочныеДанные = Новый Структура("Тип, Модуль, Время, Идентификатор, Сообщение, Вызов", АсинхронноеСбисСобытие.Тип, "МодульОбъектаКлиент", АсинхронноеСбисСобытие.Получено, ИдентификаторОтвета, АсинхронноеСбисСобытие.Данные, "Unknown");
		Если Результат Тогда
			лОтладочныеДанные.Вызов = ИмяФункцииПодписки;
		КонецЕсли;
		ДанныеВЛог.Добавить(лОтладочныеДанные);

		Если Отказ Тогда
			НовоеАсинхронноеСобытие = НовыйАсинхронноеСбисСобытие(, РезультатСобытия, "AsyncError");
			//Если пришел результат от подписки на событие, то его тоже выгрузим в лог
			лОтладочныеДанные = Новый Структура("Тип, Модуль, Время, Идентификатор, Сообщение, Вызов", НовоеАсинхронноеСобытие.Тип, "МодульОбъектаКлиент", НовоеАсинхронноеСобытие.Получено,ИдентификаторОтвета, АсинхронноеСбисСобытие.Данные, ИмяФункцииПодписки);
			ДанныеВЛог.Добавить(лОтладочныеДанные);
		КонецЕсли;
		СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ДанныеВЛог));
	КонецЕсли;
	Если Отказ Тогда
		ВызватьСбисИсключение(РезультатСобытия, "МодульОбъектаКлиент.АсинхронныеВызовы_ВызватьСобытиеПоПодписке");
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

//Добавляет не ожидаемый ответ от плагина в список на обработку/очистку. Подключает очищалку. 
&НаКлиенте
Процедура АсинхронноеСбисСобытие_ДобавитьНеобработанныйОтвет(АсинхронноеСбисСобытие) Экспорт

	ИдентификаторОтвета		= АсинхронноеСбисСобытие_Получить(АсинхронноеСбисСобытие, "Идентификатор");
	НеобработанныеОтветы	= ГлобальныйКэш.СБИС.ДанныеИнтеграции.НеизвестныеОтветы.Получить(ИдентификаторОтвета);
	Если НеобработанныеОтветы = Неопределено Тогда
		НеобработанныеОтветы = Новый Массив;
	КонецЕсли;
	НеобработанныеОтветы.Добавить(АсинхронноеСбисСобытие);
	ГлобальныйКэш.СБИС.ДанныеИнтеграции.НеизвестныеОтветы.Вставить(ИдентификаторОтвета, НеобработанныеОтветы);
	
	ГлобальныйКэш_ОчиститьНевостребованныеОтветы();
	
КонецПроцедуры

// Процедура освобождает команду от выполнения с вызовом события.
// Если команда не указана, то получает по событию. Если событие еще не обрабатывалось, то запускает вызов обработчика из команды события по типу
//
// Параметры:
//  АсинхроннаяСбисКоманда	 - 	 - 
//  АсинхронноеСбисСобытие	 - 	 - 
//  СобытиеОбработано		 - 	 - 
//
//	Возвращает команду из потока
&НаКлиенте
Процедура АсинхронноеСбисСобытие_ОсвободитьПоток(АсинхронноеСбисСобытие, АсинхроннаяСбисКоманда = Неопределено, СобытиеОбработано = Ложь) Экспорт
	
	Если АсинхроннаяСбисКоманда = Неопределено Тогда
		АсинхроннаяСбисКоманда = АсинхронноеСбисСобытие_ПолучитьПоток(АсинхронноеСбисСобытие);
		Если АсинхроннаяСбисКоманда = Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ИдКоманды = АсинхроннаяСбисКоманда_Получить(АсинхроннаяСбисКоманда, "Идентификатор");

	АсинхроннаяСбисКоманда.ВремяПолучения	= АсинхронноеСбисСобытие.Получено;
	АсинхроннаяСбисКоманда.Ответ			= АсинхронноеСбисСобытие;
	
	Если Не СобытиеОбработано Тогда
		
		СобытиеОбработано = АсинхроннаяСбисКоманда_ВызватьСобытие(АсинхроннаяСбисКоманда, АсинхронноеСбисСобытие);
		
	ИначеЕсли ПолучитьЗначениеПараметраСбис("РежимОтладки") Тогда
		
		// Если режим отладки, то выгрузим для освобождаемого потока ответ в лог.
		ИмяМетодаВыполнено =  АсинхроннаяСбисКоманда_Получить(АсинхроннаяСбисКоманда, "ИмяВызова");
		
		лОтладочныеДанные = Новый Структура("Тип, Вызов, Время, Сообщение, Идентификатор, Модуль", АсинхронноеСбисСобытие.Тип, ИмяМетодаВыполнено, ТекущаяДата());
		лОтладочныеДанные.Модуль		= ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		лОтладочныеДанные.Идентификатор = ИдКоманды;
		Если Не АсинхроннаяСбисКоманда.ПараметрыКоманды.ОчиститьПараметры Тогда
			лОтладочныеДанные.Сообщение = АсинхронноеСбисСобытие.Данные;
		КонецЕсли;
		
		ДанныеВЛог = Новый Массив;
		ДанныеВЛог.Добавить(лОтладочныеДанные);
		СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ДанныеВЛог));

	КонецЕсли;
	
	ГлобальныйКэш.СБИС.ДанныеИнтеграции.Потоки.Удалить(ИдКоманды);
	
КонецПроцедуры

// Функция возвращает команду от полученного события.
//
// Параметры:
//  АсинхроннаяСбисКоманда	 - 	 - 
//
//	Возвращает команду из потока
&НаКлиенте
Функция АсинхронноеСбисСобытие_ПолучитьПоток(АсинхронноеСбисСобытие) Экспорт
	
	Если ЭтоТипСбис(АсинхронноеСбисСобытие, "АсинхронноеСбисСобытие") Тогда

		ИдСобытия = АсинхронноеСбисСобытие_Получить(АсинхронноеСбисСобытие, "Идентификатор");
		
	ИначеЕсли ТипЗнч(АсинхронноеСбисСобытие) = Тип("Строка") Тогда
		
		ИдСобытия = АсинхронноеСбисСобытие;
		
	Иначе
		
		// Это событие старого образца, не обернутое в класс.
		ИдСобытия = АсинхронноеСбисСобытие.Идентификатор;
		
	КонецЕсли;
	
	Возврат ГлобальныйКэш.СБИС.ДанныеИнтеграции.Потоки.Получить(ИдСобытия);
	
КонецФункции

