
//Класс команды для вызова СБИС3 плагина
&НаКлиенте
Функция НовыйАсинхроннаяСбисКоманда(ОбработчикВызова=Неопределено, ДопПараметры=Неопределено) Экспорт
	Перем СбисАккаунт, ВремяОжиданияОтвета, МодульВызоваКоманды, ПодпискиНаСобытияУстановить, ИдВызоваКоманды;

	Результат = НовыйПрикладнойОбъектSABY("АсинхроннаяСбисКоманда");
	Результат.Вставить("ОбработчикВызова", ОбработчикВызова);
	Результат.Вставить("АргументВызова");
	Результат.Вставить("События");
	Результат.Вставить("Ответ");
	Результат.Вставить("ВремяОжиданияОтвета");
	Результат.Вставить("ВремяВызова");
	Результат.Вставить("ВремяПолучения");
	Результат.Вставить("ПараметрыСобытий");
	
	Результат.Вставить("ПараметрыКоманды",	Новый Структура);
	Результат.Вставить("ДанныеКоманд",		Новый Соответствие);
	
	Если Не ДопПараметры = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Результат, ДопПараметры);
		Если		ДопПараметры.Свойство("ПодпискиНаСобытия", ПодпискиНаСобытияУстановить)
			И	Не	ПодпискиНаСобытияУстановить = Неопределено Тогда
			
			Если Результат.События = Неопределено Тогда
				Результат.События = Новый Структура;
			КонецЕсли;
			Для Каждого КлючИЗначениеПОдписки Из ПодпискиНаСобытияУстановить Цикл
				НовоеСобытие = Новый Структура("Функция, ФункцияОшибки, Параметры, Модуль, МодульОшибки");
				ЗаполнитьЗначенияСвойств(НовоеСобытие, КлючИЗначениеПОдписки.Значение);
				Результат.События.Вставить(КлючИЗначениеПОдписки.Ключ, НовоеСобытие);
			КонецЦикла;
		КонецЕсли;
		
		ДопПараметры.Свойство("Идентификатор", ИдВызоваКоманды);
		
		Если ДопПараметры.Свойство("ОчиститьПараметры") Тогда
			Результат.ПараметрыКоманды.Вставить("ОчиститьПараметры", ДопПараметры.ОчиститьПараметры);
		КонецЕсли;
 
	КонецЕсли;
	Если Не Результат.ПараметрыКоманды.Свойство("ОчиститьПараметры") Тогда
		Результат.ПараметрыКоманды.Вставить("ОчиститьПараметры",	Ложь);
	КонецЕсли;
	
	Если Не Результат.ПараметрыКоманды.Свойство("МногопоточныйРежим") Тогда
		Результат.ПараметрыКоманды.Вставить("МногопоточныйРежим",	ПолучитьЗначениеПараметраСбис("МногопоточныйРежим"));
	КонецЕсли;
	
	Если Результат.События = Неопределено Тогда
		Результат.События = Новый Структура;
	КонецЕсли;
	
	Если ИдВызоваКоманды = Неопределено Тогда
		Попытка
			ИдВызоваКоманды = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.СБИС_ИдЗапросаВызова(ГлавноеОкно.Кэш);
		Исключение
			ВызватьСбисИсключение(ИнформацияОбОшибке(), ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".СБИСПлагин_Команда", 400);
		КонецПопытки;
	КонецЕсли;
	
	ПрикладнойОбъектSABY_Установить(Результат, "Идентификатор", ИдВызоваКоманды);
	
	Если Не ЗначениеЗаполнено(Результат.ВремяОжиданияОтвета) Тогда
		Результат.ВремяОжиданияОтвета = ПолучитьЗначениеПараметраСбис("ВремяОжиданияОтвета");
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

//Вызываем метод плагина и подключаем обработчик на результат.
&НаКлиенте
Процедура АсинхроннаяСбисКоманда_Установить(АсинхроннаяСбисКоманда, КлючУстановить, ЗначениеУстановить=Неопределено) Экспорт

	Если			КлючУстановить = "События" Тогда
		
		Для Каждого КлючИЗначениеПодписка Из ЗначениеУстановить Цикл
			
			АсинхроннаяСбисКоманда.События.Вставить(КлючИЗначениеПодписка.Ключ, КлючИЗначениеПодписка.Значение);
			
		КонецЦикла;
		
	ИначеЕсли       КлючУстановить = "ОчиститьСобытия" Тогда
		
		АсинхроннаяСбисКоманда.События.Очистить();
		
	ИначеЕсли       КлючУстановить = "ПараметрыСобытий" Тогда
		
		АсинхроннаяСбисКоманда.ПараметрыСобытий = ЗначениеУстановить;
		
	Иначе
		
		ПрикладнойОбъектSABY_Установить(АсинхроннаяСбисКоманда, КлючУстановить, ЗначениеУстановить);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция АсинхроннаяСбисКоманда_Получить(АсинхроннаяСбисКоманда, КлючПолучить, ТипПолучить=Неопределено) Экспорт
	
	Если КлючПолучить = "СкрытьДанные" Тогда
			
		Возврат АсинхроннаяСбисКоманда.ПараметрыКоманды.ОчиститьПараметры;
		
	ИначеЕсли КлючПолучить = "ИмяВызова" Тогда
		
		ИмяКомандыВызова = АсинхроннаяСбисКоманда.ОбработчикВызова.ИмяПроцедуры;
			
		Если ИмяКомандыВызова = "СбисОтправитьКоманду_Асинхронно" Тогда
			
			ИмяКомандыВызова = АсинхроннаяСбисКоманда.АргументВызова.Метод;
			
		КонецЕсли;
		
		Возврат ИмяКомандыВызова;	
		
	КонецЕсли;
	Возврат ПрикладнойОбъектSABY_Получить(АсинхроннаяСбисКоманда, КлючПолучить, ТипПолучить);
	
КонецФункции

// Функция - Вызывает событие от подписки асинх.команды
//
// Параметры:
//  АсинхроннаяСбисКоманда	 - АсинхроннаяСбисКоманда	- от которой вызывается событие
//  КлючСобытия				 - Строка					- Ключ для поиска в Событиях команды	
//  РезультатСобытия		 - Произв					- результат, куда будет помещен итог обработки
// 
// Возвращаемое значение:
//  Булево  - было ли вызвано событие, или нет.
//
&НаКлиенте
Функция АсинхроннаяСбисКоманда_ВызватьСобытие(АсинхроннаяСбисКоманда, АсинхронноеСбисСобытие) Экспорт
	Перем СобытиеВыполнить, лМодульСобытияВыполнить, лФункцияОбработкиОшибки, лМодульОшибкиВыполнить;
	
	Если Не АсинхроннаяСбисКоманда.События.Свойство(АсинхронноеСбисСобытие.Тип, СобытиеВыполнить) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если Не СобытиеВыполнить.Свойство("Модуль", лМодульСобытияВыполнить) Тогда
		лМодульСобытияВыполнить = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция;
	КонецЕсли;
	
	Если СобытиеВыполнить.Свойство("ФункцияОшибки", лФункцияОбработкиОшибки)
		И	(	Не	СобытиеВыполнить.Свойство("МодульОшибки", лМодульОшибкиВыполнить)
			Или		лМодульОшибкиВыполнить = Неопределено) Тогда
		
		лМодульОшибкиВыполнить = лМодульСобытияВыполнить;
		
	КонецЕсли;	
	
	ДанныеВЛог = Новый Массив;
	Если ПолучитьЗначениеПараметраСбис("РежимОтладки") Тогда
		
		лОтладочныеДанные = Новый ФиксированнаяСтруктура("Команда, Событие, Время", АсинхроннаяСбисКоманда, АсинхронноеСбисСобытие, ТекущаяДата());
		ДанныеВЛог.Добавить(лОтладочныеДанные);

	КонецЕсли;
	
	Попытка
		
		ОбработчикСобытия = НовыйСбисОписаниеОповещения(СобытиеВыполнить.Функция, лМодульСобытияВыполнить, АсинхроннаяСбисКоманда.ПараметрыСобытий);
		ВыполнитьСбисОписаниеОповещения(АсинхронноеСбисСобытие, ОбработчикСобытия);
		
	Исключение
		
		ОшибкаОбработкиСобытия	= НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.АсинхроннаяСбисКоманда_ВызватьСобытие");
		АсинхронноСобытиеОшибки	= НовыйАсинхронноеСбисСобытие(	АсинхронноеСбисСобытие,
																ОшибкаОбработкиСобытия,
																"CriticalError");
		Если ПолучитьЗначениеПараметраСбис("РежимОтладки") Тогда
			
			лОтладочныеДанные = Новый ФиксированнаяСтруктура("Команда, Событие, Время", АсинхроннаяСбисКоманда, АсинхронноСобытиеОшибки, ТекущаяДата());
			ДанныеВЛог.Добавить(лОтладочныеДанные);

		КонецЕсли;
		
		Если ЗначениеЗаполнено(лФункцияОбработкиОшибки) Тогда
			
			// Если упали в ошибку при обработке ответа, и есть обработка события ошибки
			ОбработчикСобытия = НовыйСбисОписаниеОповещения(лФункцияОбработкиОшибки, лМодульСобытияВыполнить, АсинхроннаяСбисКоманда.ПараметрыСобытий);
			ВыполнитьСбисОписаниеОповещения(АсинхронноСобытиеОшибки, ОбработчикСобытия);
			
		Иначе
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ДанныеВЛог) Тогда
		
		СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ДанныеВЛог));
		
	КонецЕсли;
	
	Возврат Истина

КонецФункции

//Вызывает команду и дожидается ответа.
&НаКлиенте
Функция АсинхроннаяСбисКоманда_ОтправитьИДождатьсяОтвета(АсинхроннаяСбисКоманда) Экспорт
	
	Попытка
		АсинхроннаяСбисКоманда_Выполнить(АсинхроннаяСбисКоманда);
		КомандаОбработана = АсинхроннаяСбисКоманда_ПолучитьОтветСинхронно(АсинхроннаяСбисКоманда);
	Исключение
		РезультатВызова	= НовыйСбисИсключение(ИнформацияОбОшибке(), ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".СбисОтправитьИОбработатьКоманду");
		НовоеСобытие	= НовыйАсинхронноеСбисСобытие(АсинхроннаяСбисКоманда, РезультатВызова, "Error");
		АсинхронноеСбисСобытие_ОсвободитьПоток(НовоеСобытие, АсинхроннаяСбисКоманда);
	КонецПопытки;
		
	Возврат АсинхроннаяСбисКоманда.Ответ;

КонецФункции
	
//Вызываем метод плагина и подключаем обработчик на результат.
&НаКлиенте
Процедура АсинхроннаяСбисКоманда_Выполнить(АсинхроннаяСбисКоманда) Экспорт
	
	АсинхроннаяСбисКоманда_ВызватьСобытие(АсинхроннаяСбисКоманда, НовыйАсинхронноеСбисСобытие(,,"BeforeCall"));

	Попытка
		АсинхроннаяСБИСКоманда.ВремяВызова = ТекущаяДата();
		ВыполнитьСбисОписаниеОповещения(АсинхроннаяСбисКоманда, АсинхроннаяСбисКоманда.ОбработчикВызова);
		
		Если АсинхроннаяСбисКоманда.ПараметрыКоманды.ОчиститьПараметры Тогда
			АсинхроннаяСбисКоманда.АргументВызова.ПараметрыМетода = Неопределено;
		КонецЕсли;
		
		Если АсинхроннаяСбисКоманда.ПараметрыКоманды.МногопоточныйРежим Тогда 
			АсинхроннаяСбисКоманда_ЗанятьПоток(АсинхроннаяСБИСКоманда);
		КонецЕсли;
		
		СобытиеПослеОтправки = НовыйАсинхронноеСбисСобытие(АсинхроннаяСбисКоманда, , "AfterCall");
	Исключение
		//Генерируем событие об ошибке
		РезультатОтправка		= НовыйСбисИсключение(ИнформацияОбОшибке(), ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".АсинхроннаяСбисКоманда_Выполнить");
		СобытиеПослеОтправки	= НовыйАсинхронноеСбисСобытие(АсинхроннаяСбисКоманда.Идентификатор, РезультатОтправка, "Error");
	КонецПопытки;
	
	СобытиеОбработано = АсинхроннаяСбисКоманда_ВызватьСобытие(АсинхроннаяСбисКоманда, СобытиеПослеОтправки);
	
	Если Не СобытиеОбработано Тогда
		//Нет подписки на ошибку, прокинуть в команду.
		Если СобытиеПослеОтправки.Тип = "Error" Тогда
			ВызватьСбисИсключение(РезультатОтправка, "МодульОбъектаКлиент.АсинхроннаяСбисКоманда_Выполнить");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//Ожидает получения ответа на вызов команды.
&НаКлиенте
Функция АсинхроннаяСбисКоманда_ПолучитьОтветСинхронно(АсинхроннаяСбисКоманда, ДопПараметры = Неопределено) Экспорт
	Перем Результат;
	
	ИдОжидаемойКоманды	= АсинхроннаяСбисКоманда_Получить(АсинхроннаяСбисКоманда, "Идентификатор");
	ОжидаемыеКоманды	= Новый Соответствие;
	ОжидаемыеКоманды.Вставить(ИдОжидаемойКоманды, АсинхроннаяСбисКоманда);

	Пока Истина Цикл
		РезультатПолучения	= ГлобальныйКэш_ЧтениеОтветовИВызовСобытий(ОжидаемыеКоманды);
		Результат			= РезультатПолучения.Получить(ИдОжидаемойКоманды);
		Если	Не Результат = Неопределено 				
			Или	Не АсинхроннаяСбисКоманда.ВремяОжиданияОтвета
			Или	Не ПолучитьЗначениеПараметраСбис("ОбменВключен") Тогда 
			//Получен ответ на запрос, или делаем один проход на чтение	
			Прервать;
		ИначеЕсли ТекущаяДата() - АсинхроннаяСбисКоманда.ВремяВызова > АсинхроннаяСбисКоманда.ВремяОжиданияОтвета Тогда
			//Установленный на команде таймаут
			ИмяПроцедурыВызова = АсинхроннаяСбисКоманда.ОбработчикВызова.ИмяПроцедуры;
			ВызватьСбисИсключение(, ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".СБИСПлагин_ПолучитьОтвет_Синхронно",
				775,, ИмяПроцедурыВызова + "() не вернул ответ за разумное время",,
				"https://saby.ru/help/integration/1C_set/modul/typical_errors/plugin_answer");
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура АсинхроннаяСбисКоманда_ЗанятьПоток(АсинхроннаяСбисКоманда) Экспорт
	
	ГлобальныйКэш.СБИС.ДанныеИнтеграции.Потоки.Вставить(АсинхроннаяСбисКоманда_Получить(АсинхроннаяСбисКоманда, "Идентификатор"), АсинхроннаяСбисКоманда);
	Если ПолучитьЗначениеПараметраСбис("РежимОтладки") Тогда
		ДанныеВЛог = Новый Массив;
		ДанныеВЛог.Добавить(АсинхроннаяСбисКоманда);
		СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ДанныеВЛог));
	КонецЕсли;

КонецПроцедуры

