
// Базовый объект для всех прочих

//DynamicDirective

// Функция - конструктор базового объекта SABY
//
// Параметры:
//  ТипДляНовогоОбъекта	 - Строка	 - тип наследника от базового объекта
// 
// Возвращаемое значение:
//  ПрикладнойОбъектSABY - Структура с предопределенными свойствами
//
Функция НовыйПрикладнойОбъектSABY(ВходящиеПараметры = Неопределено, ДопПараметры = Неопределено) Экспорт 
	
	Результат = Новый Структура("_тип", "ПрикладнойОбъектSABY");
	Результат.Вставить("_ид",			Новый УникальныйИдентификатор);
	Результат.Вставить("_параметры",	Новый Структура);				// Простые свойства объекта, не являющиеся прямыми свойствами класса
	Результат.Вставить("_данные",		Новый Соответствие);    		// Составные свойства объекта, не являющиеся прямыми свойствами класса
	
	Если Не ВходящиеПараметры = Неопределено Тогда
		
		Если ТипЗнч(ВходящиеПараметры) = Тип("Строка") Тогда
			
			ПрикладнойОбъектSABY_Установить(Результат,,ВходящиеПараметры, "Тип");
			
		ИначеЕсли ПрикладнойОбъектSABY_ЭтоТип(ВходящиеПараметры, Результат) Тогда
			
			Результат._тип			= ВходящиеПараметры._тип;
			Результат._параметры	= СоздатьКопиюОбъекта(ДопПараметры._параметры);
			Результат._данные		= СоздатьКопиюОбъекта(ДопПараметры._данные);
			
		КонецЕсли;
	
	КонецЕсли;
	
	Для НомерЧислоСтрок = 1 По СтрЧислоСтрок(Результат._тип) Цикл
		
		ПредставлениеТипа = СтрПолучитьСтроку(Результат._тип, НомерЧислоСтрок);
		Результат._данные.Вставить(ПредставлениеТипа, НРег(ПредставлениеТипа));
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_БазовыйОбъект_АПИ
#КонецОбласти

