
// Функция - Конструктор класса набора средств идентификации товаров
// 
// Возвращаемое значение:
//  Структура - Объект класса
//
&НаКлиенте
Функция НовыйНаборСредствИдентификацииТоваров() Экспорт
	
	СтруктураНомСредИдентТов = Новый Структура;
	
	СтруктураНомСредИдентТов.Вставить("_класс", "НаборСредствИдентификацииТоваров"); 
	СтруктураНомСредИдентТов.Вставить("ИдентТрансУпак", Новый СписокЗначений);  
	СтруктураНомСредИдентТов.Вставить("НомУпак", Новый СписокЗначений); 
	СтруктураНомСредИдентТов.Вставить("КИЗ", Новый СписокЗначений); 
	СтруктураНомСредИдентТов.Вставить("КолВедМарк", Новый СписокЗначений);  
	СтруктураНомСредИдентТов.Вставить("ПрПартМарк", Новый СписокЗначений);  
	СтруктураНомСредИдентТов.Вставить("GTIN", "");
	
	Возврат СтруктураНомСредИдентТов;
	
КонецФункции

// Процедура - Добавляет значения в набор средств идентификации товаро 
//
// Параметры:
//  НаборСредствИдентификацииТоваров - Структура 	- Объект набора средств идентификации товаро
//  КлючУстановить					 - Строка 		- Ключ добавляемой информации
//  ЗначениеУстановить				 - Соответствие	- Значение добаляемой информации
//
&НаКлиенте
Процедура НаборСредствИдентификацииТоваров_УстановитьДанные(НаборСредствИдентификацииТоваров, КлючУстановить, ЗначениеУстановить) Экспорт
	
	// Не добавляем повторно один и тот же штрихкод	
	Если НаборСредствИдентификацииТоваров[КлючУстановить].НайтиПоЗначению(ЗначениеУстановить) = Неопределено Тогда  
		
		НаборСредствИдентификацииТоваров[КлючУстановить].Добавить(ЗначениеУстановить); 
		
	КонецЕсли; 

КонецПроцедуры   

// Процедура - Добавляет значения в набор средств идентификации товаро 
//
// Параметры:
//  НаборСредствИдентификацииТоваров - Структура 	- Объект набора средств идентификации товаро
//  КлючУстановить					 - Строка 		- Ключ добавляемой информации
//  ЗначениеУстановить				 - Строка		- Значение добаляемой информации
//
&НаКлиенте
Процедура НаборСредствИдентификацииТоваров_Установить(НаборСредствИдентификацииТоваров, КлючУстановить, ЗначениеУстановить) Экспорт
	
	НаборСредствИдентификацииТоваров[КлючУстановить] = ЗначениеУстановить;
	
КонецПроцедуры

