
&НаКлиенте
Функция НовыйКонвертСБИС(ВходящиеПараметры, ДопПараметры = Неопределено) Экспорт 
	Перем ДанныеСторонКонверта;
	
	КонвертСБИС = ВложениеСБИС_Пустой();
	ОбъектSABY_Установить(КонвертСБИС, "Тип", "КонвертСБИС");

	КонвертСБИС.Вставить("НашаОрганизация");
	КонвертСБИС.Вставить("Контрагент");
	
	// Параметры, которые должны быть перенесены в прикладной объект
	
	// Прописать значения по-умолчанию
	КонвертСБИС_Установить(КонвертСБИС, "Тип",							"Конверт");
	КонвертСБИС_Установить(КонвертСБИС, "ВерсияФормата",				"3_01");
	КонвертСБИС_Установить(КонвертСБИС, "НеЗапускатьВДокументооборот",	Ложь);

	Если	ВходящиеПараметры.Свойство("ГрязныйИни")
		И	ВходящиеПараметры.Свойство("ДокументСсылка") Тогда
		
		Возврат яНовыйКонвертСБИС_ПоГрязнымДанным(КонвертСБИС, ВходящиеПараметры, ДопПараметры);
		
	Иначе
		
		Для Каждого КлючИЗначение Из ВходящиеПараметры Цикл
			
			КонвертСБИС_Установить(КонвертСБИС, КлючИЗначение.Ключ, КлючИЗначение.Значение);
			
		КонецЦикла;
		
		Возврат КонвертСБИС;
		
	КонецЕсли;
	
КонецФункции

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_КонвертСБИС_private
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_КонвертСБИС_API
#КонецОбласти

