
// Класс для программной генерации формы
//
// Параметры:
//  ДопПараметры - Структура, Неопределено	 - Пока не используется
// 
// Возвращаемое значение:
//  Структура - Новый объект класса
//
&НаКлиенте
Функция НовыйКонструкторФорм(ДопПараметры = Неопределено) Экспорт
	
	КонструкторФорм = Новый Структура("_класс, Элементы, Команды",
		"КонструкторФорм",
		Новый Структура,
		Новый Структура);

	Возврат КонструкторФорм;
	
КонецФункции

// Добавляет в конфструктор форм элемент формы
//
// Параметры:
//  КонструкторФорм - Структура - Объект класса КонструкторФорм
//  ДопПараметры - Структура - Дополнительные поля, описывающие элемент:
//    + Имя (Строка) - Имя элемента (обязательно)
//    + Заголовок (Строка) - Представление элемента для пользователя
//    + Тип (ОписаниеТипа) - Тип элемента формы
//
&НаКлиенте
Процедура КонструкторФорм_ДобавитьЭлемент(КонструкторФорм, ДопПараметры) Экспорт
	Перем Имя;
	
	Если НЕ ДопПараметры.Свойство("Имя", Имя) Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеСвойства = "Заголовок, Тип";
	
	НовыйЭлемент = Новый Структура(ДоступныеСвойства);
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ДопПараметры);
	
	КонструкторФорм.Элементы.Вставить(Имя, НовыйЭлемент);
	
КонецПроцедуры

// Изменяет в конфструктор форм элемент формы
//
// Параметры:
//  КонструкторФорм - Структура - Объект класса КонструкторФорм
//  ДопПараметры - Структура - Дополнительные поля, описывающие элемент:
//    + Имя (Строка) - Имя элемента (обязательно)
//    + Свойства (Стукрутра) - Ключ-имя свойства, значение-значение свойства
//
&НаКлиенте
Процедура КонструкторФорм_ИзменитьЭлемент(КонструкторФорм, ДопПараметры) Экспорт
	Перем Имя, ИзменяемыйЭлемент;
	
	Если НЕ ДопПараметры.Свойство("Имя", Имя)
		ИЛИ НЕ КонструкторФорм.Элементы.Свойство(Имя, ИзменяемыйЭлемент) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СвойствоРеквизита Из ДопПараметры.Свойства Цикл
		ИзменяемыйЭлемент.Вставить(СвойствоРеквизита.Ключ, СвойствоРеквизита.Значение);
	КонецЦикла;
	
КонецПроцедуры

// Добавляет в конфструктор форм команду формы
//
// Параметры:
//  КонструкторФорм - Структура - Объект класса КонструкторФорм
//  ДопПараметры - Структура - Дополнительные поля, описывающие команду:
//    + Имя (Строка) - Имя элемента (обязательно)
//    + Заголовок (Строка) - Представление команды для пользователя
//
&НаКлиенте
Процедура КонструкторФорм_ДобавитьКоманду(КонструкторФорм, ДопПараметры) Экспорт
	Перем Имя;
	
	Если НЕ ДопПараметры.Свойство("Имя", Имя) Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеСвойства = "Заголовок";
	
	НовыйКоманда = Новый Структура(ДоступныеСвойства);
	
	ЗаполнитьЗначенияСвойств(НовыйКоманда, ДопПараметры);
	
	КонструкторФорм.Команды.Вставить(Имя, НовыйКоманда);
	
КонецПроцедуры

// Устанавливает свойство элемента формы
//
// Параметры:
//  КонструкторФорм - Структура - Объект класса КонструкторФорм
//  ДопПараметры - Структура - Дополнительные поля, описывающие команду:
//    + Элемент (Строка) - Имя элемента (обязательно)
//    + Свойство (Структура) - Ключ - имя свойства, Значение - значение свойства
//
&НаКлиенте
Процедура КонструкторФорм_УстановитьСвойство(КонструкторФорм, ДопПараметры) Экспорт
	
	Если НЕ ДопПараметры.Свойство("Элемент")
		ИЛИ НЕ КонструкторФорм.Элементы.Свойство(ДопПараметры.Элемент)
		ИЛИ НЕ ДопПараметры.Свойство("Свойство") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ КонструкторФорм.Элементы[ДопПараметры.Элемент].Свойство("Свойства") Тогда
		КонструкторФорм.Элементы[ДопПараметры.Элемент].Вставить("Свойства", Новый Структура);
	КонецЕсли;
	
	Для каждого СвойствоЭлемента Из ДопПараметры.Свойство Цикл
		КонструкторФорм.Элементы[ДопПараметры.Элемент].Свойства.Вставить(СвойствоЭлемента.Ключ, СвойствоЭлемента.Значение);
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает свойство элемента формы
//
// Параметры:
//  КонструкторФорм - Структура - Объект класса КонструкторФорм
//  ДопПараметры - Структура - Дополнительные поля, описывающие команду:
//    + Элемент (Строка) - Имя элемента (обязательно)
//    + Значение (Строка) - Значение реквизита (Обязательно)
//
&НаКлиенте
Процедура КонструкторФорм_УстановитьЗначениеРеквизита(КонструкторФорм, ДопПараметры) Экспорт
	
	Если НЕ ДопПараметры.Свойство("Элемент")
		ИЛИ НЕ КонструкторФорм.Элементы.Свойство(ДопПараметры.Элемент)
		ИЛИ НЕ ДопПараметры.Свойство("Значение") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ КонструкторФорм.Свойство("ЗначенияРеквизитов") Тогда
		КонструкторФорм.Вставить("ЗначенияРеквизитов", Новый Структура);
	КонецЕсли;
	
	КонструкторФорм.ЗначенияРеквизитов.Вставить(ДопПараметры.Элемент, ДопПараметры.Значение);
	
КонецПроцедуры

