
&НаКлиенте
Функция НовыйКонвертСБИС(ВходящиеПараметры, ДопПараметры = Неопределено) Экспорт 
	
	Кэш = ПолучитьТекущийЛокальныйКэш();
	
	ГрязныйИниДанные	= ВходящиеПараметры.ГрязныйИни;
	Документ1Ссылка		= ВходящиеПараметры.ДокументСсылка;

	ВходящиеПараметры.Вставить("Тип",		Кэш.ОбщиеФункции.РассчитатьЗначение("Тип",		ГрязныйИниДанные));
	ВходящиеПараметры.Вставить("ПодТип",	Кэш.ОбщиеФункции.РассчитатьЗначение("ПодТип",	ГрязныйИниДанные));
	
	Если ДопПараметры = Неопределено Тогда
		
		ДопПараметры = Новый Структура;
		
	КонецЕсли;
	
	ДопПараметры.Вставить("_класс",	"КонвертСБИС");
		
	Вложение = НовыйВложениеСБИС(ВходящиеПараметры, ДопПараметры);
	
	ИмяДокумента				= Кэш.ОбщиеФункции.ПолучитьРеквизитМетаданныхОбъекта(Документ1Ссылка, "Имя");
	НеЗапускатьВДокументооборот	= Кэш.ОбщиеФункции.РассчитатьЗначение("НеЗапускатьВДокументооборот", ГрязныйИниДанные);
	
	// Получить пользовательский идентификатор
	МассивСтатусРегламент	= ПолучитьЗначениеПараметраСбис("МассивСтатусРегламент");
	РегламентСтруктура		= ВложениеСБИС_Получить(Вложение, "Регламент");
	
	//KES 050751151 Статусы в разрезе регламентов (ОТПРАВКА ПАКЕТА ДОКУМЕНТОВ) --> 40 +
	Если		ЗначениеЗаполнено(РегламентСтруктура) 
		И		РегламентСтруктура.Свойство("Название") 
		И НЕ	МассивСтатусРегламент.Найти(РегламентСтруктура.Название) = Неопределено Тогда
		
		// Хранение статуса идёт по регламенту - Пользовательский ИД генерируется
		фрм		= Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПрочитатьПараметрыДокументаСБИС", Кэш.ФормаРаботыСоСтатусами,"",Кэш);
		ИдДок	= фрм.ПрочитатьПараметрыДокументаСБИС(	Документ1Ссылка,
														Кэш.ГлавноеОкно.Кэш.Парам.КаталогНастроек,
														РегламентСтруктура.Название+"ДокументСБИС_Ид",Кэш.Ини);
		ПользовательскийИдентификатор = ИмяДокумента + ":" + ?( ЗначениеЗаполнено(ИдДок), ИдДок, Строка(Новый УникальныйИдентификатор));
		
	Иначе
		
		ПользовательскийИдентификатор = Кэш.ОбщиеФункции.РассчитатьЗначение("Документ_ПользовательскийИдентификатор", ГрязныйИниДанные, Кэш);
		Если НЕ ЗначениеЗаполнено(ПользовательскийИдентификатор) Тогда
			
			ПользовательскийИдентификатор = ИмяДокумента + ":" + Строка(Документ1Ссылка.УникальныйИдентификатор());
			
		КонецЕсли;
		
	КонецЕсли;
				
	Вложение.Вставить("НашаОрганизация",	ВложениеСБИС_Получить(Вложение, "Отправитель"));
	
	ПолучательКонверт = ВложениеСБИС_Получить(Вложение, "Получатель");
	Если Не ПолучательКонверт = Неопределено Тогда
	 
		Вложение.Вставить("Контрагент", ПолучательКонверт);
		
	КонецЕсли;
	Вложение.Удалить("Отправитель");
	Вложение.Удалить("Получатель");
	
	Вложение.Вставить("НеЗапускатьВДокументооборот",	НеЗапускатьВДокументооборот);
	Вложение.Вставить("ПользовательскийИдентификатор",	ПользовательскийИдентификатор);
	
	// Временная заглушка для дальнейшей проверке типа
	Вложение._класс = "СоставПакета" + Символы.ПС + Вложение._класс;
	
	Возврат Вложение;
	
КонецФункции

