
// Класс - Кэш
//
// Параметры:
//  ПараметрыКонструктора	 - Структура	 - описанине для создания отложенной операции
//		АдресСервера		- Необязательный, Строка, адрес сервера настройки. Если не указано, то берется первый доступный
//		МодульОбъектаКлиент	- Необязательный, Форма/МодульОбъекта. Если не указан, берется текущий.
// 
// Возвращаемое значение:
//  Экземпляр(Структура) - пустой класс Кэш
//
&НаКлиенте
Функция НовыйЛокальныйКэш_Пустой()
	
	//TODO 24.4100 убрать из локального кэша объекты ТекущийСеанс, СБИС и ПараметрыСистемы
	НовыйКэш = НовыйОбъектSABY("ЛокальныйКэш");
	НовыйКэш.Вставить("ТихийРежим", Ложь);
	НовыйКэш.Вставить("СБИС");
	НовыйКэш.Вставить("ТекущийСеанс");
	НовыйКэш.Вставить("Парам", Новый Структура);
	НовыйКэш.Вставить("РаботаСJSON");
	НовыйКэш.Вставить("ГлавноеОкно");
	НовыйКэш.Вставить("ПараметрыСистемы");

	Возврат НовыйКэш;
	
КонецФункции	
	
// Класс - Кэш
//
// Параметры:
//  ПараметрыКонструктора	 - Структура	 - описанине для создания отложенной операции
//		АдресСервера		- Необязательный, Строка, адрес сервера настройки. Если не указано, то берется первый доступный
//		МодульОбъектаКлиент	- Необязательный, Форма/МодульОбъекта. Если не указан, берется текущий.
// 
// Возвращаемое значение:
//  Экземпляр(Структура) - пустой класс Кэш
//
&НаКлиенте
Функция НовыйЛокальныйКэш(ПараметрыКонструктора = Неопределено) Экспорт
	Перем	КлассКэшСБИС, КлассТекущийСеанс, ГлавноеОкноУстановить, МодульОбъектаУстановить, 
			ПараметрыСистемыУстановить, ПараметрыПользователяУстановить;
	
	НовыйКэш = НовыйЛокальныйКэш_Пустой();
	
	ГлавноеОкноУстановить	= ГлавноеОкно;
	МодульОбъектаУстановить	= МодульОбъектаКлиент();
	
	Если ПараметрыКонструктора = Неопределено Тогда 
		
		КлассКэшСБИС			= НовыйКэшСБИС_Пустой();
		КлассТекущийСеанс		= НовыйТекущийСеанс_Пустой();
		
	ИначеЕсли	ЭтоТипСбис(ПараметрыКонструктора, "ГлобальныйКэш") Тогда
			
		КлассКэшСБИС 					= ПараметрыКонструктора.СБИС;
		КлассТекущийСеанс				= ПараметрыКонструктора.ТекущийСеанс;
		ПараметрыПользователяУстановить	= Новый Структура;
		ПараметрыСистемыУстановить		= ПараметрыКонструктора.ПараметрыСистемы;
				
		Для Каждого КлючИЗначениеПараметр Из ПараметрыКонструктора.Парам Цикл
			ПараметрыПользователяУстановить.Вставить(КлючИЗначениеПараметр.Ключ, КлючИЗначениеПараметр.Значение);
		КонецЦикла;
			
	ИначеЕсли	ЭтоТипСбис(ПараметрыКонструктора, "ЛокальныйКэш") Тогда
		
		ЛокальныйКэш_ПривестиСовместимость(НовыйКэш);
		
		ЛокальныйКэш_Вставить(НовыйКэш, "ФормаНастроекОбщее",	ПараметрыКонструктора.ФормаНастроекОбщее); 
		ЛокальныйКэш_Вставить(НовыйКэш, "ФормаНастроек",		ПараметрыКонструктора.ФормаНастроек); 
		ЛокальныйКэш_Вставить(НовыйКэш, "ОбщиеФункции",			ПараметрыКонструктора.ОбщиеФункции);
		ЛокальныйКэш_Вставить(НовыйКэш, "Интеграция",			ПараметрыКонструктора.Интеграция);
		ЛокальныйКэш_Вставить(НовыйКэш, "РаботаСJSON",			ПараметрыКонструктора.РаботаСJSON);
		
		КлассКэшСБИС 					= ГлобальныйКэш.СБИС;
		КлассТекущийСеанс				= ГлобальныйКэш.ТекущийСеанс;
		ПараметрыПользователяУстановить	= Новый Структура;
		ПараметрыСистемыУстановить		= ГлобальныйКэш.ПараметрыСистемы;
		
		Для Каждого КлючИЗначениеПараметр Из ГлобальныйКэш.Парам Цикл
			ПараметрыПользователяУстановить.Вставить(КлючИЗначениеПараметр.Ключ, КлючИЗначениеПараметр.Значение);
		КонецЦикла;
		
	Иначе
		
		Если		ПараметрыКонструктора.Свойство("ГлавноеОкно") Тогда
			
			ГлавноеОкноУстановить = ПараметрыКонструктора.ГлавноеОкно;
			
		ИначеЕсли	ПараметрыКонструктора.Свойство("Владелец") Тогда
			
			ГлавноеОкноУстановить = ПараметрыКонструктора.Владелец;
			
		КонецЕсли;
		
		Если	ПараметрыКонструктора.Свойство("МодульОбъектаКлиент") Тогда
			
			МодульОбъектаУстановить = ПараметрыКонструктора.МодульОбъектаКлиент;
			
		КонецЕсли;
		
		// СБИС
		Если Не ПараметрыКонструктора.Свойство("КэшСБИС", КлассКэшСБИС) Тогда
			
			КлассКэшСБИС = НовыйКэшСБИС();
			
		КонецЕсли;
		
		// ТекущийСеанс
		Если Не ПараметрыКонструктора.Свойство("ТекущийСеанс", КлассТекущийСеанс) Тогда
			
			КлассТекущийСеанс = НовыйТекущийСеанс(ПараметрыКонструктора);
			
		КонецЕсли;
		
	
		// ПараметрыСистемы
		Если ПараметрыКонструктора.Свойство("ПараметрыСистемы") Тогда
			
			ПараметрыСистемыУстановить = ПараметрыКонструктора.ПараметрыСистемы;
			
		КонецЕсли;
				
	КонецЕсли;
	
	ЛокальныйКэш_Вставить(НовыйКэш, "СБИС",					КлассКэшСБИС);
	ЛокальныйКэш_Вставить(НовыйКэш, "ТекущийСеанс",			КлассТекущийСеанс);
	ЛокальныйКэш_Вставить(НовыйКэш, "Парам",				ПараметрыПользователяУстановить);
	ЛокальныйКэш_Вставить(НовыйКэш, "ПараметрыСистемы",		ПараметрыСистемыУстановить);
	ЛокальныйКэш_Вставить(НовыйКэш, "МодульОбъектаКлиент",	МодульОбъектаУстановить);
	ЛокальныйКэш_Вставить(НовыйКэш, "Владелец",				ГлавноеОкноУстановить);
		
	Возврат НовыйКэш;
	
КонецФункции

&НаКлиенте
Процедура ЛокальныйКэш_Вставить(ЛокальныйКэш, КлючВставить, ЗначениеВставить) Экспорт
	
	Если		КлючВставить = "Владелец" Тогда
		
		ЛокальныйКэш.ГлавноеОкно = ЗначениеВставить;
		
	ИначеЕсли	КлючВставить = "АдресСервера" Тогда
		
		КэшСБИС_Вставить(ЛокальныйКэш.СБИС, КлючВставить, ЗначениеВставить);
		
	ИначеЕсли	КлючВставить = "МодульОбъектаКлиент" Тогда
	
		КэшСБИС_Вставить(ЛокальныйКэш.СБИС, КлючВставить, ЗначениеВставить);
		
	ИначеЕсли	КлючВставить = "ПараметрыПользователя" Тогда
	
		Для Каждого КлючИЗначениеПараметр Из ЗначениеВставить Цикл
			
			ЛокальныйКэш.Парам.Вставить(КлючИЗначениеПараметр.Ключ, КлючИЗначениеПараметр.Значение);
			
		КонецЦикла;
		
	Иначе
	
		ЛокальныйКэш[КлючВставить] = ЗначениеВставить;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - дополняет структуру кэша старыми костылями для совместимости
//
// Параметры:
//  ЛокальныйКэш - Структура, ЛокальныйКэш	 - экземпляр класса ЛокальныйКэш обработки
//
&НаКлиенте
Процедура ЛокальныйКэш_ПривестиСовместимость(ЛокальныйКэш) Экспорт
	
	ЛокальныйКэш.Вставить("Заплатки",				Ложь);
	ЛокальныйКэш.Вставить("СовместимостьМетодов",	ГлобальныйКэш.СовместимостьМетодов);
	ЛокальныйКэш.Вставить("Текущий",				НовыйРазделГО());
	ЛокальныйКэш.Вставить("ТаблДок",				"");
	
	//Модули в корне
	ЛокальныйКэш.Вставить("ФормаНастроекОбщее",	ПараметрSABY("МодульУправленияНастройками", "Сеанс"));
	ЛокальныйКэш.Вставить("ОбщиеФункции",		ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов"));
	ЛокальныйКэш.Вставить("РаботаСJSON",		СбисРаботаСJSON);
	ЛокальныйКэш.Вставить("ФормаНастроек"); 
	ЛокальныйКэш.Вставить("Интеграция");
	
	ЛокальныйКэш.Вставить("МенюРазделов",		Новый Структура());
	ЛокальныйКэш.Вставить("Разделы",			ЛокальныйКэш.ТекущийСеанс.Интерфейс.СтруктураРазделов);
	
	Если Не ГлобальныйКэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		
		ЛокальныйКэш.Вставить("ПараметрыФильтра", Новый Структура);
		
	КонецЕсли;
	
	ЛокальныйКэш.Вставить("ИспользоватьОбработчикиСобытий",		Ложь);
	ЛокальныйКэш.Вставить("ТипыПолейФильтра",					Новый Структура); // перенесено в ТекущийСеанс.ОписаниеКонфигурации.ТипыПолейФильтра
	ЛокальныйКэш.Вставить("ини",								Новый Структура);
	ЛокальныйКэш.Вставить("Реестры",							Новый Структура);
	ЛокальныйКэш.Вставить("КэшЗначенийИни",						Новый Структура);
	ЛокальныйКэш.Вставить("КэшСертификатов",					Новый Структура);
	
	ЛокальныйКэш.КэшЗначенийИни.Вставить("ТекущийПакет",	Новый Структура());
	ЛокальныйКэш.КэшЗначенийИни.Вставить("Организации",		Новый Структура());
	ЛокальныйКэш.КэшЗначенийИни.Вставить("ИниЗагрузки",		Новый Структура);
	
	// Пользовательские фильтры
	ЛокальныйКэш.Вставить("ПараметрыФильтра",		Новый Структура());
	ЛокальныйКэш.Вставить("ФормаРаботыСоСтатусами",	"Статусы_Регистры");
	
	// Дополнительные вложения, прикладываются к каждому отправляемому пакету
	ЛокальныйКэш.Вставить("ДопВложение",	Новый Массив);
	ЛокальныйКэш.Вставить("КэшНастроек",	Новый Структура);
	
	//Спилить после 24.4100 Старые параметры асинхронной отправки
	ЛокальныйКэш.Вставить("СписокНоменклатуры",				Новый СписокЗначений);
	ЛокальныйКэш.Вставить("КоличествоВОтправке",			100);
	ЛокальныйКэш.Вставить("КоличествоПотоковОтправки",		10);
	ЛокальныйКэш.Вставить("ПодготовленныеКОтправке",		Новый Массив);
	ЛокальныйКэш.Вставить("НеобработанныеОтветыОтправки",	Новый Массив);
	
КонецПроцедуры

// Процедура - уничтожает и очищает кэш очистить объект
//
// Параметры:
//  ЛокальныйКэш - 	 - 
//
&НаКлиенте
Процедура ЛокальныйКэш_ОчиститьОбъект(ЛокальныйКэш) Экспорт
	
	Если Не ЛокальныйКэш.Интеграция = Неопределено Тогда 
		
		Попытка
			
			ЛокальныйКэш.Интеграция.Завершить(ЛокальныйКэш, Новый Структура("ЗавершитьРаботу", Истина), Ложь);
			
		Исключение
			
			ИнфоОбОшибке	= ИнформацияОбОшибке();
			СбисИсключение	= НовыйСбисИсключение(ИнфоОбОшибке, "МодульОбъектаКлиент.ЛокальныйКэш_ОчиститьОбъект");  
			СообщитьСбисИсключение(СбисИсключение, Новый Структура("СтатусСообщения", "platform_warning"));
			
		КонецПопытки;
		
	КонецЕсли;

	КэшСБИС_ОчиститьОбъект(ЛокальныйКэш.СБИС);
	ТекущийСеанс_ОчиститьОбъект(ЛокальныйКэш.ТекущийСеанс, Истина);

	ЛокальныйКэш.КэшЗначенийИни.Очистить();
	ЛокальныйКэш.КэшНастроек.Очистить();
	ЛокальныйКэш.КэшСертификатов.Очистить();
	ЛокальныйКэш.МенюРазделов.Очистить();

	Для Каждого КлючИЗначение Из ЛокальныйКэш Цикл
		
		ЛокальныйКэш.Вставить(КлючИЗначение.Ключ, Неопределено);
		
	КонецЦикла;
	
КонецПроцедуры

//Устанавливает кэш обмена
&НаКлиенте
Функция	НовыйКэшСБИС_Пустой()
	
	ПараметрыИнтеграцииСБИС = Новый Структура("ИдАккаунта, ИдПользователя, ИнтеграцияИмя, Пользователь, Демо");
	ПараметрыИнтеграцииСБИС.Вставить("Версия",							"");
	ПараметрыИнтеграцииСБИС.Вставить("ПредставлениеСервера");
	ПараметрыИнтеграцииСБИС.Вставить("КодСервиса");
	
	//Если параметр отключен, то для формирования вложений не будет использоваться ФЭД.Сгенерировать, а только XSLT-преобразования
	ПараметрыИнтеграцииСБИС.Вставить("ГенераторФЭД",					Ложь);
	//Crypto-мод
	ПараметрыИнтеграцииСБИС.Вставить("Шифрование",						Ложь);
	//Наличие хранения настроек в СБИС
	ПараметрыИнтеграцииСБИС.Вставить("ДоступныСерверныеНастройки",		Ложь);
	ПараметрыИнтеграцииСБИС.Вставить("СтатусыВРазрезеРегламента",		Ложь);
	
	//Если параметр отключен, то потоки в глобальном кэше не будут заниматься и отслеживаться время их выполнения
	ПараметрыИнтеграцииСБИС.Вставить("МногопоточныйРежим",				Истина);
	ПараметрыИнтеграцииСБИС.Вставить("Потоки_КоличествоСвободных",		10);
	ПараметрыИнтеграцииСБИС.Вставить("Потоки_МаксимальноеКоличество",	10);
	ПараметрыИнтеграцииСБИС.Вставить("ВремяОжиданияОтвета",				60);
	ПараметрыИнтеграцииСБИС.Вставить("ВремяОжиданияОтвета_Отправка",	120);
	ПараметрыИнтеграцииСБИС.Вставить("ВключитьВО3",	                    Ложь);
	
	ДанныеВозврата = НовыйОбъектSABY("КэшСБИС");
	ДанныеВозврата.Вставить("Ини",					Новый Структура);
	ДанныеВозврата.Вставить("ДанныеИнтеграции",		НовыйДанныеИнтеграции());
	ДанныеВозврата.Вставить("ПараметрыИнтеграции",	ПараметрыИнтеграцииСБИС);
	ДанныеВозврата.Вставить("ОбменВключен",			Ложь);
	ДанныеВозврата.Вставить("Авторизован",			Ложь);
	ДанныеВозврата.Вставить("АдресСервера");
	ДанныеВозврата.Вставить("МодульОбъектаКлиент");
	Возврат	ДанныеВозврата;
	
КонецФункции
	
//Устанавливает кэш обмена
&НаКлиенте
Функция	НовыйКэшСБИС(ПараметрыКонструктора = Неопределено) Экспорт
	Перем МодульОбъектаКлиент, СбисАдресСервера;
	
	НовыйКэшСбис = НовыйКэшСБИС_Пустой();
	
	Если ПараметрыКонструктора = Неопределено Тогда
		
		Возврат НовыйКэшСбис;
		
	КонецЕсли;
	
	КэшСБИС_Вставить(НовыйКэшСбис, "МодульОбъектаКлиент", МодульОбъектаКлиент());
	
	Возврат	НовыйКэшСбис;
	
КонецФункции

//Устанавливает параметры интеграции обмена
&НаКлиенте
Функция	НовыйДанныеИнтеграции(ПараметрыКонструктора = Неопределено) Экспорт
	
	ИменаКлючей =	"Подписки
					|Потоки
					|НеизвестныеОтветы
					|События";
	
	Результат = НовыйПрикладнойОбъектSABY("ДанныеИнтеграции");
	
	Для НомерКлюча = 1 По СтрЧислоСтрок(ИменаКлючей) Цикл
		
		Результат.Вставить(СтрПолучитьСтроку(ИменаКлючей, НомерКлюча), Новый Соответствие);
		
	КонецЦикла;
	
	Результат.Вставить("Объекты", Новый Структура);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура КэшСБИС_Вставить(КэшСБИС, КлючВставить, ЗначениеВставить)
	
	КэшСБИС[КлючВставить] = ЗначениеВставить
	
КонецПроцедуры

&НаКлиенте
Процедура КэшСБИС_ОчиститьОбъект(КэшСБИС)
	
	КэшСБИС.МодульОбъектаКлиент = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Функция НовыйСтруктураРазделов()
	
	СтруктураРазделов = НовыйПрикладнойОбъектSABY("СтруктураРазделов");
	СтруктураРазделов.Вставить("р1",			"Полученные");
	СтруктураРазделов.Вставить("р2",			"Отправленные");
	СтруктураРазделов.Вставить("р3",			"Продажа");
	СтруктураРазделов.Вставить("р4",			"Покупка");
	// СтруктураРазделов.Вставить("р5",			"Настройки"); // Раздел больше не существует
	СтруктураРазделов.Вставить("р6",			"Справочники");
	СтруктураРазделов.Вставить("р7",			"Учет");
	СтруктураРазделов.Вставить("р8",			"Задачи");
	СтруктураРазделов.Вставить("р9",			"Отчетность");
	СтруктураРазделов.Вставить("Продажа",		Новый Структура);
	СтруктураРазделов.Вставить("Покупка",		Новый Структура);
	СтруктураРазделов.Вставить("Отчетность",	Новый Структура);
	СтруктураРазделов.Вставить("Справочники",	Новый Структура);
	
	Возврат СтруктураРазделов;
	
КонецФункции

&НаКлиенте
Функция НовыйТекущийСеанс_Пустой()
	
	ПутьКРеквизитуКолонки	= "{%ТЧ%}.";
    ИмяКолонкиШаблон		= "{ИмяКолонки}";
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
		ПутьКРеквизитуКолонки	= ПутьКРеквизитуКолонки + "{%ТЧ%}";
        ИмяКолонкиШаблон		= "{ТЧ}" + ИмяКолонкиШаблон;
	#КонецЕсли

	СбисОтложенныеОперации	= Новый Структура("ПоследнийВызовМС, СообщатьОбОшибках, Процедуры", Ложь, 600, Истина);
	СбисОтложенныеОперации.Вставить("Запущено",				Ложь);
	СбисОтложенныеОперации.Вставить("МаксимальныйПериод",	600);
	СбисОтложенныеОперации.Вставить("СообщатьПриОшибке",	Истина);

	СеансИнтерфейс			= Новый Структура("Блокировки, ШаблонРеквизитаКолонок, ИмяРеквизитаКолонок, СтруктураРазделов", Новый Соответствие);
	КэшФорм					= Новый Структура("Получены, Клиентские, Стандартные, Интерфейсные", Новый Соответствие, Новый СписокЗначений);
	НаборМодулейСеанса		= Новый Структура("Интеграция, ФункцииДокументов, Настройки, НастройкиСБИС, МодульСопоставлениеНоменклатуры, МодульХраненияСтатусов, МодульУправленияНастройками");
	ОписаниеКонфигурации	= Новый Структура("ТипыПолей1С, ТипыПолейФильтра, ИмяРегистраДополнительныхСведений, ИмяРеквизитаЕдиницыИзмерения, ПредставленияТипов", Новый Структура, Новый Структура, "", "");
	ОписаниеКонфигурации.Вставить("ОписаниеМетаданныхШтрихкодов", Новый Структура);
	ОписаниеКонфигурации.Вставить("ИмяМодуляСопоставленияНоменклатуры", "");
	
	НаборПараметровСеанса	= Новый Структура("Идентификатор, РежимОтладки, ТихийРежим", Строка(Новый УникальныйИдентификатор), Ложь, Ложь);
	НаборПараметровСеанса.Вставить("ПервыйЗапуск",							Ложь);
	НаборПараметровСеанса.Вставить("НоваяВерсия",							Ложь);
	НаборПараметровСеанса.Вставить("АвтоматическоеСозданиеНоменклатуры",	Ложь);
	
	СбисОтложенныеОперации.Процедуры		= Новый Соответствие;
	СеансИнтерфейс.ШаблонРеквизитаКолонок	= ПутьКРеквизитуКолонки;
	СеансИнтерфейс.ИмяРеквизитаКолонок		= ИмяКолонкиШаблон;
	СеансИнтерфейс.СтруктураРазделов		= НовыйСтруктураРазделов();
	СеансИнтерфейс.Вставить("КэшироватьИнтерфейсныеФормы", Истина);
	
	КэшТекущегоСеанса = НовыйПрикладнойОбъектSABY("ТекущийСеанс");
	КэшТекущегоСеанса.Вставить("Интерфейс",					СеансИнтерфейс);
	КэшТекущегоСеанса.Вставить("СбисОтложенныеОперации",	СбисОтложенныеОперации);
	КэшТекущегоСеанса.Вставить("Параметры",					НаборПараметровСеанса);
	КэшТекущегоСеанса.Вставить("СведенияОбИнтеграции");
	КэшТекущегоСеанса.Вставить("РеквизитыСторонДляПоиска");
	КэшТекущегоСеанса.Вставить("Формы",						КэшФорм);
	КэшТекущегоСеанса.Вставить("Модули",					НаборМодулейСеанса);
	КэшТекущегоСеанса.Вставить("Функции",					Новый Структура);
	КэшТекущегоСеанса.Вставить("РасчитанныеЗначения",		Новый Соответствие);
	КэшТекущегоСеанса.Вставить("ОписаниеКонфигурации",		ОписаниеКонфигурации);
	
	Возврат КэшТекущегоСеанса;
	
КонецФункции
	
&НаКлиенте
Процедура ТекущийСеанс_Вставить(ТекущийСеанс, КлючВставить, ЗначениеВставить)
	
	Если КлючВставить = "СтандартныеФормы" Тогда
		
		ТекущийСеанс.Формы.Стандартные	= ЗначениеВставить;
		
	ИначеЕсли КлючВставить = "ИнтерфейсныеФормы" Тогда

		ТекущийСеанс.Формы.Интерфейсные	= ЗначениеВставить;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийСеанс_ОчиститьОбъект(ТекущийСеанс, ЗавершениеРаботы = Истина)
		
	Если ЗавершениеРаботы Тогда
		
		СтруктураОчистить = Новый Структура("Кэш, ЛокальныйКэш, МестныйКэш");
		Для Каждого КлючИЗначениеМодуль Из ТекущийСеанс.Формы.Получены Цикл
		
			Если КлючИЗначениеМодуль.Значение = Ложь Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(КлючИЗначениеМодуль.Значение, СтруктураОчистить);		
			КлючИЗначениеМодуль.Значение.ВладелецФормы = Неопределено;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТекущийСеанс.Формы.Получены.Очистить();
	ТекущийСеанс.Модули.Очистить();
	ТекущийСеанс.Функции.Очистить();
	
КонецПроцедуры

&НаКлиенте
Функция НовыйКэшНастроек(ПараметрыКонструктора = Неопределено) Экспорт 
	
	НовыйКэшНастроек = НовыйОбъектSABY("КэшНастроек");
    НовыйКэшНастроек.Вставить("Ини",			Новый Структура);
    НовыйКэшНастроек.Вставить("ИниВПорядке",	Ложь);

	Возврат НовыйКэшНастроек;
	
КонецФункции

&НаКлиенте
Функция НовыйТекущийСеанс(ПараметрыКонструктора = Неопределено)
	Перем ЗначениеСеансУстановить, ПараметрыСистемыТекущие;
	
	ТекущийСеансПустой = НовыйТекущийСеанс_Пустой();
	ТекущийСеанс_Вставить(ТекущийСеансПустой, "СтандартныеФормы",	ТекущийСеанс_СтандартныеФормы());
	ТекущийСеанс_Вставить(ТекущийСеансПустой, "ИнтерфейсныеФормы",	ТекущийСеанс_ИнтерфейсныйФормы());
	
	Если ПараметрыКонструктора.Свойство("ПараметрыСистемы", ПараметрыСистемыТекущие) Тогда
		
		ОпцияПоСовестимости =	ПараметрыСистемыТекущие.Клиент.УправляемоеПриложение
							И	ЗначениеЗаполнено(ПараметрыСистемыТекущие.Конфигурация.РежимСовместимости)
							И	СравнитьВерсииБольшеМеньше(ПараметрыСистемыТекущие.Конфигурация.РежимСовместимости, "8.3.6.1");				
							
		ТекущийСеансПустой.Интерфейс.КэшироватьИнтерфейсныеФормы = НЕ (ПараметрыСистемыТекущие.Клиент.ЭтоLinux ИЛИ ОпцияПоСовестимости);
		
	КонецЕсли;
	
	Возврат ТекущийСеансПустой;
	
КонецФункции

// Функция - Содержит список доступных способов обработки номенклатуры для диалогов
// 
// Возвращаемое значение:
//  СписокЗначений - где значение число код обработки номенклатуры, представление - имя модуля
//
&НаКлиенте
Функция СписокДоступныхСпособовСопоставленияНоменклатуры(Режим = "Общие", ДопПараметры = Неопределено) Экспорт
	// --> 12123099
	РасширенныйФункционалСопоставленияНоменклатуры	=	ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры") 
													ИЛИ ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры4100");
														
	ФормаОбщихФункций 			                    = ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции");
	СБИС_НоменклатураПоставщиков                    = ФормаОбщихФункций.РассчитатьЗначение("НоменклатураПоставщиков", ИниПоПараметрам("Конфигурация")); 
	
	ЕстьСправочники                                 = Лев(СБИС_НоменклатураПоставщиков,10) = "Справочник";
	ЕстьРегистры	                                = Лев(СБИС_НоменклатураПоставщиков,7) = "Регистр";
	ЕстьДБФ			                                = ПолучитьПараметрПользователя("СпособХраненияНастроек") = 0;
	ЕстьДБФ			                                = Истина;

	ВариантыСопоставления = Новый СписокЗначений();
	
	ВсеСпособыСопоставления = СписокВсехСпособовСопоставленияНоменклатуры(Режим);
	
	Если ЕстьДБФ Тогда 
		ВариантыСопоставления.Добавить(1, ВсеСпособыСопоставления.НайтиПоЗначению(1).Представление);
	КонецЕсли;
	Если ЕстьСправочники Тогда 
		ВариантыСопоставления.Добавить(2, ВсеСпособыСопоставления.НайтиПоЗначению(2).Представление);
	КонецЕсли;
	Если ЕстьРегистры Тогда
		ВариантыСопоставления.Добавить(3, ВсеСпособыСопоставления.НайтиПоЗначению(3).Представление); 
	КонецЕсли;
	Если РасширенныйФункционалСопоставленияНоменклатуры Тогда
		// Добавим в конец как способ с наибольшим "весом" и подбором по-умолчанию, при активной фиче
		ВариантыСопоставления.Добавить(0, ВсеСпособыСопоставления.НайтиПоЗначению(0).Представление);
	КонецЕсли;
	
	ТекСпособСопостав = Неопределено; 
	
	Если Режим = "Интерфейс" И НЕ (ДопПараметры = Неопределено)
		И ДопПараметры.Свойство("ТекСпособСопоставНоменклатуры",ТекСпособСопостав)
		И ВариантыСопоставления.НайтиПоЗначению(ТекСпособСопостав) = Неопределено Тогда 
		
		ВариантыСопоставления.Добавить(ТекСпособСопостав, ВсеСпособыСопоставления.НайтиПоЗначению(ТекСпособСопостав).Представление);
		
	КонецЕсли;
	
	Возврат ВариантыСопоставления;
	
КонецФункции

 &НаКлиенте
Функция СписокВсехСпособовСопоставленияНоменклатуры(Режим = "Интерфейс") Экспорт
	
	ВариантыСопоставления = Новый СписокЗначений();

	Если Режим = "Интерфейс" Тогда 
		ВариантыСопоставления.Добавить(-1,	"Недоступно");
		ВариантыСопоставления.Добавить(0,	"В Saby");
		ВариантыСопоставления.Добавить(1,	"В файле DBF");
		ВариантыСопоставления.Добавить(2,	"В справочнике");
		ВариантыСопоставления.Добавить(3,	"В регистре"); 
	Иначе
		ВариантыСопоставления.Добавить(-1,	"");
		ВариантыСопоставления.Добавить(0,	"СопоставлениеНоменклатуры_СБИС");
		ВариантыСопоставления.Добавить(1,	"СопоставлениеНоменклатуры_ДБФ");
		ВариантыСопоставления.Добавить(2,	"СопоставлениеНоменклатуры_Справочники");
		ВариантыСопоставления.Добавить(3,	"СопоставлениеНоменклатуры_Регистры"); 	
	КонецЕсли; 
	

	Возврат ВариантыСопоставления;
	
КонецФункции

// Функция - Содержит список доступных способов обработки документов для диалогов
// 
// Возвращаемое значение:
//  СписокЗначений - где значение число код обработки документов, представление - имя модуля
//
&НаКлиенте
Функция СписокДоступныхСпособовХраненияСтатусов(Режим = "Интерфейс", ДопПараметры = Неопределено) Экспорт
	
	ВариантыСопоставления = Новый СписокЗначений();
	ВариантыСопоставления.Добавить(1, "Статусы_Регистры");
	ВариантыСопоставления.Добавить(2, "Статусы_DBF");
	
	Возврат ВариантыСопоставления;
	
КонецФункции

// Функция - Содержит список доступных способов обработки номенклатуры для диалогов
// 
// Возвращаемое значение:
//  СписокЗначений - где значение число код обработки номенклатуры, представление - смысловое и диалоговое представление
//
&НаКлиенте
Функция СписокДоступныхСпособовОбработкиНоменклатуры(Режим = "Интерфейс", ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда 
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	РежимыВыбора = Новый СписокЗначений();
	Если Режим = "Диалог" Тогда
		РежимыВыбора.Добавить(0, "Загружать только документы, где номенклатура полностью сопоставлена.");
		РежимыВыбора.Добавить(2, "Загружать все документы, при этом в табличную часть загружать только сопоставленную номенклатуру.");                             
		РежимыВыбора.Добавить(3, "Загружать все документы, загружать всю табличную часть, при этом для несопоставленных позиций не указывать номенклатуру.");
		
		Если ПолучитьЗначениеПараметраТекущегоСеанса("АвтоматическоеСозданиеНоменклатуры") Тогда
			
			РежимыВыбора.Вставить(1, 1, "Продолжить загрузку. Для несопоставленных позиций создавать карточки номенклатуры.");
			
		КонецЕсли;
	Иначе
		РежимыВыбора.Добавить(0, "Загружать только документы, где номенклатура полностью сопоставлена.");
		РежимыВыбора.Добавить(2, "Загружать все документы, при этом в табличную часть загружать только сопоставленную номенклатуру.");                             
		РежимыВыбора.Добавить(3, "Загружать все документы, загружать всю табличную часть, при этом для несопоставленных позиций не указывать номенклатуру.");
		
		Если ПолучитьЗначениеПараметраТекущегоСеанса("АвтоматическоеСозданиеНоменклатуры") Тогда
			
			РежимыВыбора.Вставить(1, 1, "Для несопоставленных позиций создавать карточки номенклатуры.");
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат РежимыВыбора;
	
КонецФункции

// Функция - Содержит список доступных способов обработки документов для диалогов
// 
// Возвращаемое значение:
//  СписокЗначений - где значение число код обработки документов, представление - смысловое и диалоговое представление
//
&НаКлиенте
Функция СписокДоступныхСпособовОбработкиДокументов(Режим = "Интерфейс") Экспорт
	
	РежимыВыбора = Новый СписокЗначений();
	Если Режим = "Диалог" Тогда
		
		РежимыВыбора.Добавить(0, "Перезаполнять");
		РежимыВыбора.Добавить(1, "Создать новые документы");                             
		РежимыВыбора.Добавить(2, "Отменить");
		
	Иначе
		
		РежимыВыбора.Добавить(0, "Перезаполнять существующие документы 1С.");
		РежимыВыбора.Добавить(1, "Создать новые документы 1С к уже существующим.");                             
		РежимыВыбора.Добавить(3, "Создать новые документы 1С только если нет подходящих.");
		
	КонецЕсли;
	
	Возврат РежимыВыбора;
	
КонецФункции

// Функция - Содержит список доступных вариантов обработки периода для фильтров
//
// Параметры:
//  Режим	 - Строка	 - ДатаДокумента, ВходящаяДата
// 
// Возвращаемое значение:
//  СписокЗначений - где значение число код обработки документов, представление - смысловое и диалоговое представление
//
&НаКлиенте
Функция СписокДоступныхСпособовВариантовФильтраПериод(Режим = "ДатаДокумента") Экспорт
	
	РежимыВыбора = Новый СписокЗначений();
	
	РежимыВыбора.Добавить(0, "Не использовать");
	РежимыВыбора.Добавить(1, "Точное совпадение");                             
	РежимыВыбора.Добавить(2, "Отклонение период");

	Возврат РежимыВыбора;
	
КонецФункции

// Функция - Содержит список доступных вариантов обработки периода для фильтров
//
// Параметры:
//  Режим	 - Строка	 - ДатаДокумента, ВходящаяДата
// 
// Возвращаемое значение:
//  СписокЗначений - где значение число код обработки документов, представление - смысловое и диалоговое представление
//
&НаКлиенте
Функция СписокДоступныхСпособовВариантовФильтраПериодОтклонение(Режим = "ДатаДокумента") Экспорт
	
	РежимыВыбора = Новый СписокЗначений();
	
	РежимыВыбора.Добавить("Дней",		"Указать в днях");
	РежимыВыбора.Добавить("Дата",		"По дате");                             
	РежимыВыбора.Добавить("Месяц",		"По месяцу");
	РежимыВыбора.Добавить("Квартал",	"По кварталу");
	РежимыВыбора.Добавить("Год",		"По году");

	Возврат РежимыВыбора;
	
КонецФункции

// Функция - Содержит список доступных вариантов обработки номера для фильтров
//
// Возвращаемое значение:
//  СписокЗначений - где значение число код обработки документов, представление - смысловое и диалоговое представление
//
&НаКлиенте
Функция СписокДоступныхСпособовВариантовФильтраНомер() Экспорт
	
	РежимыВыбора = Новый СписокЗначений();
	
	РежимыВыбора.Добавить("Не использовать",	"Не использовать");
	РежимыВыбора.Добавить("Точное совпадение",	"Точное совпадение");                             
	РежимыВыбора.Добавить("Вхождение",			"Вхождение");

	Возврат РежимыВыбора;
	
КонецФункции

// Функция - Содержит список доступных вариантов обработки номера для фильтров
//
// Возвращаемое значение:
//  СписокЗначений - где значение число код обработки документов, представление - смысловое и диалоговое представление
//
&НаКлиенте
Функция СписокДоступныхСпособовХраненияМетокСтатусов(Режим = "Интерфейс") Экспорт
	
	СписокСпособовХранения	 = СписокВсехСпособовХраненияМетокСтатусов(Режим);
	ПараметрыСистемы		 = ГлобальныйКэш_Получить("ПараметрыСистемы");
	
	Если ИспользоватьСбисПараметрыДляХраненияОбщихНастроек() Тогда
		
		СписокСпособовХранения.Удалить(2);
		
	КонецЕсли;
		
	Возврат СписокСпособовХранения;
	
КонецФункции

 &НаКлиенте
Функция СписокВсехСпособовХраненияМетокСтатусов(Режим = "Интерфейс") Экспорт
	
	СписокСпособовХранения = Новый СписокЗначений();

	СписокСпособовХранения.Добавить(0, "Пользователя Saby");
	СписокСпособовХранения.Добавить(1, "Аккаунта Saby");
	СписокСпособовХранения.Добавить(2, "Информационной базы");

	Возврат СписокСпособовХранения;
	
КонецФункции

&НаСервере
Функция ТекущийСеанс_СтандартныеФормы()
	
	СписокФорм		= Новый СписокЗначений;
	МетаданныеФорм	= МодульОбъектаСервер().Метаданные().Формы;
	Для Каждого Фрм Из МетаданныеФорм Цикл
		
		СписокФорм.Добавить(Фрм.Имя);
		
	КонецЦикла;
	Возврат СписокФорм;
	
КонецФункции

// Функция - список интерфейсных модулей. Переделать на определение через метаданные форм. Пока просто заколочено.
// 
// Возвращаемое значение:
//  СписокЗначений - Список форм, которые являются интерфейсными, а не программными модулями
//
&НаКлиенте
Функция ТекущийСеанс_ИнтерфейсныйФормы()
	
	СписокФорм = Новый СписокЗначений;
	
	СписокФорм.Добавить("ФормаПросмотрДокумента");
	СписокФорм.Добавить("ФормаАвторизация");
	СписокФорм.Добавить("Вход");
	СписокФорм.Добавить("ФайлыНастроекОбщее");
	СписокФорм.Добавить("ФормаНастройки");
	СписокФорм.Добавить("ФормаУстановкиФильтра");
	СписокФорм.Добавить("ФормаАдресаПоКЛАДР");
	СписокФорм.Добавить("ФормаНовости");
 	СписокФорм.Добавить("ФормаНастройкаEDI");
  	СписокФорм.Добавить("ФормаСозданияКонтрагента");
 	СписокФорм.Добавить("ФормаПереходы");
 	СписокФорм.Добавить("ФормаСопоставитьСДокументами1С");

	Возврат СписокФорм;
	
КонецФункции

