
// Функция готовит структуру пакета электронных документов по комплекту документов 1С для просмотра и отправки контрагентам.
// Т.к. по одной строке документов 1С может быть сформировано несколько комплектов (оказание услуги), то структуры пакетов добавляются в массив.
//
// Параметры:
//  СтрокаСпискаДокументов	 - ДанныеФормыЭлементКоллекции - Параметры для формирования электронного документа
//  ДопПараметры			 - Структура - Набор расширений работы функции
// 
// Возвращаемое значение:
//  Массив - Набор сгенерированных пакетов
//
&НаКлиенте
Функция НовыйНаборПакетов(ПараметрыГенерации, ДопПараметры) Экспорт 
	Перем СтруктураОшибки, ИмяОсновнойИни;
	
	Результат = Новый Структура("_класс, Данные, Параметры, Статистика", "НаборПакетов", Новый Структура, Новый Структура, Новый Структура);
	
	Результат.Статистика.Вставить("ВремяСоздания",	ТекущаяДата());
	Результат.Статистика.Вставить("ВремяНачало");
	Результат.Статистика.Вставить("ВремяЧтенияИни");
	Результат.Статистика.Вставить("ВремяОбработкиКодом");
	Результат.Статистика.Вставить("ВремяКонец");
	
	Если ПараметрыГенерации.Свойство("Раздел") Тогда
		
		ИмяОсновнойИни = РазделГО_Получить(ПараметрыГенерации.Раздел, "ИмяИни");
		
	КонецЕсли;

	Результат.Параметры.Вставить("ОснованиеСсылка");
  	Результат.Параметры.Вставить("ОснованиеКлюч");
	Результат.Параметры.Вставить("ИмяИни",			ИмяОсновнойИни);

	Результат.Данные.Вставить("ПрочитанныеПакеты",	Новый Массив);
	Результат.Данные.Вставить("ВнешниеФайлы",		Новый Массив);
	Результат.Данные.Вставить("Ошибки",				Новый Массив);
	Результат.Данные.Вставить("ФорматныеФайлы",		Новый СписокЗначений);
	Результат.Данные.Вставить("СоставПакета1С",		Новый СписокЗначений);

	Возврат Результат;
	
КонецФункции  

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_НаборПакетов_public
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_НаборПакетов_private
#КонецОбласти

