
// Функция готовит структуру пакета электронных документов по комплекту документов 1С для просмотра и отправки контрагентам.
// Т.к. по одной строке документов 1С может быть сформировано несколько комплектов (оказание услуги), то структуры пакетов добавляются в массив.
//
// Параметры:
//  СтрокаСпискаДокументов	 - ДанныеФормыЭлементКоллекции - Параметры для формирования электронного документа
//  ДопПараметры			 - Структура - Набор расширений работы функции
// 
// Возвращаемое значение:
//  Массив - Набор сгенерированных пакетов
//
&НаКлиенте
Функция НовыйНаборПакетов(ПараметрыГенерации, ДопПараметры = Неопределено) Экспорт 
	Перем СтруктураОшибки, ИмяОсновнойИни;

	Результат = НовыйЧтениеИниПоДанным1С(ПараметрыГенерации);
	ПрикладнойОбъектSABY_Установить(Результат, "Тип", "НаборПакетов");
	
	Результат.Вставить("ВнешниеФайлы",		Новый Массив);	
	Результат.Вставить("ПрочитанныеПакеты",	Новый Массив);	
	Результат.Статистика.Вставить("ВремяОбработкиКодом");
	
	Если ПараметрыГенерации.Свойство("ИмяИни") Тогда
		
		ИмяОсновнойИни = ПараметрыГенерации.ИмяИни;
		
	КонецЕсли;
	
	НеЗапускатьВДокументооборот = Ложь;
	Если ПараметрыГенерации.Свойство("НеЗапускатьВДокументооборот") Тогда
		
		ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
		НеЗапускатьВДокументооборот = ОписаниеТипаБулево.ПривестиЗначение(ПараметрыГенерации.НеЗапускатьВДокументооборот);
   		ПрикладнойОбъектSABY_Установить(Результат, "НеЗапускатьВДокументооборот", НеЗапускатьВДокументооборот);
		
	КонецЕсли;

 	ПрикладнойОбъектSABY_Установить(Результат, "ОснованиеСсылка");
   	ПрикладнойОбъектSABY_Установить(Результат, "ОснованиеКлюч");
   	ПрикладнойОбъектSABY_Установить(Результат, "ИмяИни",						ИмяОсновнойИни);
  	ПрикладнойОбъектSABY_Установить(Результат, "НеЗапускатьВДокументооборот",	НеЗапускатьВДокументооборот);
	// Состав пакета для сохранения очередности добавления ссылок и файлов
	ПрикладнойОбъектSABY_Установить(Результат, "СоставПакета1С",				Новый СписокЗначений,	"Данные");

	Возврат Результат;
	
КонецФункции  

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_НаборПакетов_public
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_НаборПакетов_private
#КонецОбласти

