
// Функция - Новый объект класса пользовательское действие
// Вызывается через метод получения класса-основания
//
// Параметры:
//  Основание	 - Структура - Объект класса (обязательно!)
//  ДопПараметры - Структура - На всякий случай
// 
// Возвращаемое значение:
//  Структура - Объект класса
//
&НаКлиенте
Функция НовыйПользовательскоеДействие(Основание, ДопПараметры = Неопределено)
	
	ПользовательскоеДействие = Новый Структура;
	ПользовательскоеДействие.Вставить("_класс",				"ПользовательскоеДействие");
	ПользовательскоеДействие.Вставить("Основание",			Основание);
	ПользовательскоеДействие.Вставить("Параметры",			Новый Структура);
	ПользовательскоеДействие.Вставить("Идентификатор");
	ПользовательскоеДействие.Вставить("Представление");
	
	Возврат ПользовательскоеДействие;

КонецФункции

// Функция - Возвращает ключ основания. Используется для кэширования результатов выбора
//
// Параметры:
//  Основание	 - Структура - Объект какого-либо класса
//  ДопПараметры - Структура, Неопределено - На всякий случай
// 
// Возвращаемое значение:
//  Произвольный - Ключ для определения основания
//
&НаКлиенте
Функция ПользовательскоеДействие_КлючОснования(Основание, ДопПараметры = Неопределено) Экспорт 
	
	КлючОснования = Неопределено;
	
	Если ЭтоТипСбис(Основание, "СбисИсключение") Тогда
		Основание.Свойство("code", КлючОснования);
	КонецЕсли;
	
	Возврат КлючОснования;

КонецФункции

// Процедура - Вызывает выполнение выбранного пользовательского действия
//
// Параметры:
//  ПользовательскоеДействие - Структура - Объект класса ПользовательскоеДействие
//  ДопПараметры			 - Структура - Доп. параметры для выполнения действия
//
&НаКлиенте
Процедура ПользовательскиеДействия_Выполнить(ПользовательскоеДействие, ДопПараметры) Экспорт

	Если НЕ ЭтоТипСбис(ПользовательскоеДействие, "ПользовательскоеДействие") Тогда
		// Чет не то пришло
		Возврат;
	КонецЕсли;
	
	// Ошибка 773001
	Если ПользовательскоеДействие.Идентификатор = "ОтправитьУведомлениеОбОтгрузке" Тогда
		ПользовательскиеДействия_ОтправитьУведомлениеОбОтгрузке(ПользовательскоеДействие, ДопПараметры);
	ИначеЕсли ПользовательскоеДействие.Идентификатор = "Отмена" Тогда
		ПользовательскиеДействия_Отмена(ПользовательскоеДействие, ДопПараметры);
	// Этапы заказов
	ИначеЕсли ПользовательскоеДействие.Идентификатор = "ЗагрузитьВ1С" Тогда
		ПользовательскиеДействия_ЗагрузитьВ1С(ПользовательскоеДействие, ДопПараметры);
	ИначеЕсли ПользовательскоеДействие.Идентификатор = "Утвердить" Тогда
		ПользовательскиеДействия_Утвердить(ПользовательскоеДействие, ДопПараметры);
	ИначеЕсли ПользовательскоеДействие.Идентификатор = "Отклонить" Тогда
		ПользовательскиеДействия_Отклонить(ПользовательскоеДействие, ДопПараметры);
	ИначеЕсли ПользовательскоеДействие.Идентификатор = "СвязатьСОтгрузкой" Тогда
		ПользовательскиеДействия_СвязатьСОтгрузкой(ПользовательскоеДействие, ДопПараметры);
	ИначеЕсли ПользовательскоеДействие.Идентификатор = "Отгрузить" Тогда
		ПользовательскиеДействия_Отгрузить(ПользовательскоеДействие, ДопПараметры);
	ИначеЕсли ПользовательскоеДействие.Идентификатор = "ОбработатьРезультатыПриемки" Тогда
		ПользовательскиеДействия_ОбработатьРезультатыПриемки(ПользовательскоеДействие, ДопПараметры);
	ИначеЕсли ПользовательскоеДействие.Идентификатор = "Отправить" Тогда
		ПользовательскиеДействия_Отправить(ПользовательскоеДействие, ДопПараметры);
	КонецЕсли;

КонецПроцедуры

// Функция для получения параметра объекта класса ПользовательскоеДействие
//
// Параметры:
//  ПользовательскоеДействие - Структура - Объект класса ПользовательскоеДействие
//  Ключ					 - Строка - Имя параметра
// 
// Возвращаемое значение:
//  Произвольный - Значение параметра
//
&НаКлиенте
Функция ПользовательскиеДействия_ПолучитьПараметр(ПользовательскоеДействие, Ключ) Экспорт

	Результат = Неопределено;
	
	Если НЕ ЭтоТипСбис(ПользовательскоеДействие, "ПользовательскоеДействие") Тогда
		// Чет не то пришло
		Возврат Результат;
	КонецЕсли;
	
	ПользовательскоеДействие.Параметры.Свойство(Ключ, Результат);
	
	Возврат Результат;

КонецФункции

// Процедура для установки параметра объекта класса ПаользовательскоеДействие
//
// Параметры:
//  ПользовательскоеДействие - Структура - Объект класса ПользовательскоеДействие
//  Ключ					 - Строка - Имя параметра
//  Значение				 - Произвольный - Значение параметра
//
&НаКлиенте
Процедура ПользовательскиеДействия_УстановитьПараметр(ПользовательскоеДействие, Ключ, Значение) Экспорт
	
	Если НЕ ЭтоТипСбис(ПользовательскоеДействие, "ПользовательскоеДействие") Тогда
		// Чет не то пришло
		Возврат;
	КонецЕсли;
	
	ПользовательскоеДействие.Параметры.Вставить(Ключ, Значение);

КонецПроцедуры

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ПользовательскиеДействия_Команды
#КонецОбласти

