
&НаСервере
Функция СбисИсключение_ИзСтрокиВызовСервера(Знач СбисИсключение, ДопПарамеры = Неопределено) 
	
	Возврат МодульОбъектаСервер().СбисИсключение_ИзСтрокиСервер(СбисИсключение, ДопПарамеры);
	
КонецФункции

// Функция - Возвращает пользовательские действия, доступные для иключения
//
// Параметры:
//  СбисИсключение - Структура - Объект класса СбисИсключение
//  ДопПараметры - Структура, Неопределено - Дополнительные параметры для действий
// 
// Возвращаемое значение:
//  Массив - массив объектов кдасса ПользовательскоеДействие
//
&НаКлиенте
Функция СбисИсключение_ПользовательскиеДействия(СбисИсключение, ДопПараметры = Неопределено) Экспорт

	НаборПользовательскихДействий = Новый Массив;
	
	ПолныйКодОшибки = СбисИсключение_Получить(СбисИсключение, "ПолныйКод");
	
	Если ПолныйКодОшибки = 773001 Тогда
	
		ДействиеОтправитьУоО = НовыйПользовательскоеДействие(СбисИсключение, ДопПараметры);
		ДействиеОтправитьУоО.Идентификатор = "ОтправитьУведомлениеОбОтгрузке";
		ДействиеОтправитьУоО.Представление = "Отправить Уведомление об отгрузке";
		ДействиеОтправитьУоО.Параметры.Вставить("Статус", "Завершено");
	
		ДействиеОтправитьОтмена = НовыйПользовательскоеДействие(СбисИсключение, ДопПараметры);
		ДействиеОтправитьОтмена.Идентификатор = "Отмена";
		ДействиеОтправитьОтмена.Представление = "Отмена";
		ДействиеОтправитьОтмена.Параметры.Вставить("Статус", "Ошибка");
																			
		НаборПользовательскихДействий.Добавить(ДействиеОтправитьУоО);
		НаборПользовательскихДействий.Добавить(ДействиеОтправитьОтмена);
		
	ИначеЕсли ПолныйКодОшибки = 773002 Тогда
		
		ОтправитьНовыйДокумент = НовыйПользовательскоеДействие(СбисИсключение, ДопПараметры);
		ОтправитьНовыйДокумент.Идентификатор = "ОтправитьНовыйДокумент";
		ОтправитьНовыйДокумент.Представление = "Отправить новым пакетом";
		ОтправитьНовыйДокумент.Параметры.Вставить("Статус", "Завершено");
	
		ДействиеОтправитьОтмена = НовыйПользовательскоеДействие(СбисИсключение, ДопПараметры);
		ДействиеОтправитьОтмена.Идентификатор = "Отмена";
		ДействиеОтправитьОтмена.Представление = "Отмена";
		ДействиеОтправитьОтмена.Параметры.Вставить("Статус", "Ошибка");
																			
		НаборПользовательскихДействий.Добавить(ОтправитьНовыйДокумент);
		НаборПользовательскихДействий.Добавить(ДействиеОтправитьОтмена);
		
	ИначеЕсли ПолныйКодОшибки = 325401 Тогда
		
		ДействиеПереотправитьМаркДок = НовыйПользовательскоеДействие(СбисИсключение, ДопПараметры);
		ДействиеПереотправитьМаркДок.Идентификатор = "ОтправитьМаркДокументБезКодов";
		ДействиеПереотправитьМаркДок.Представление = "Отправить документ без кодов маркировки";
		ДействиеПереотправитьМаркДок.Параметры.Вставить("Статус", "Завершено");
	
		ДействиеОтправитьОтмена = НовыйПользовательскоеДействие(СбисИсключение, ДопПараметры);
		ДействиеОтправитьОтмена.Идентификатор = "Отмена";
		ДействиеОтправитьОтмена.Представление = "Отмена";
		ДействиеОтправитьОтмена.Параметры.Вставить("Статус", "Ошибка");
																			
		НаборПользовательскихДействий.Добавить(ДействиеПереотправитьМаркДок);
		НаборПользовательскихДействий.Добавить(ДействиеОтправитьОтмена);		
		
	ИначеЕсли ПолныйКодОшибки = 335 Тогда
		
		ДействиеОткрытьСсылкуОплаты = НовыйПользовательскоеДействие(СбисИсключение, ДопПараметры);
		ДействиеОткрытьСсылкуОплаты.Идентификатор = "ОткрытьСсылкуОплаты";
		ДействиеОткрытьСсылкуОплаты.Представление = "Открыть ссылку оплаты";
		ДействиеОткрытьСсылкуОплаты.Параметры.Вставить("Статус", "Ошибка");
		ДействиеОткрытьСсылкуОплаты.Параметры.Вставить("ПрименитьДляВсехДокументов", Истина);
		
		ДействиеВидеоЗвонок = НовыйПользовательскоеДействие(СбисИсключение, ДопПараметры);
		ДействиеВидеоЗвонок.Идентификатор = "Видеозвонок";
		ДействиеВидеоЗвонок.Представление = "Видеозвонок";
		ДействиеВидеоЗвонок.Параметры.Вставить("Статус", "Ошибка");
		
		ДействиеКарточкаМенеджера = НовыйПользовательскоеДействие(СбисИсключение, ДопПараметры);
		ДействиеКарточкаМенеджера.Идентификатор = "КарточкаМенеджера";
		ДействиеКарточкаМенеджера.Представление = "Карточка менеджера";
		ДействиеКарточкаМенеджера.Параметры.Вставить("Статус", "Ошибка");
		
		ДействиеОтправитьОтмена = НовыйПользовательскоеДействие(СбисИсключение, ДопПараметры);
		ДействиеОтправитьОтмена.Идентификатор = "Отмена";
		ДействиеОтправитьОтмена.Представление = "Отмена";
		ДействиеОтправитьОтмена.Параметры.Вставить("Статус", "Ошибка");
																			
		НаборПользовательскихДействий.Добавить(ДействиеОткрытьСсылкуОплаты);
		НаборПользовательскихДействий.Добавить(ДействиеВидеоЗвонок);
		НаборПользовательскихДействий.Добавить(ДействиеКарточкаМенеджера);
		НаборПользовательскихДействий.Добавить(ДействиеОтправитьОтмена);
		
	КонецЕсли;
	
	Возврат НаборПользовательскихДействий;

КонецФункции

