
&НаКлиенте
Функция СбисСтек_Новый() Экспорт 
	Возврат Новый Структура("ДанныеСтека, РазмерСтека", Новый Массив, 0);
КонецФункции

// Push
&НаКлиенте
Процедура СбисСтек_Положить(СбисСтек, Значение) Экспорт 
	СбисСтек.ДанныеСтека.Добавить(Значение);
	СбисСтек.РазмерСтека = СбисСтек.РазмерСтека + 1;
КонецПроцедуры

// Top
&НаКлиенте
Функция СбисСтек_ВзятьБезУдаления(СбисСтек) Экспорт 
	Возврат СбисСтек.ДанныеСтека[СбисСтек.РазмерСтека - 1];
КонецФункции

// Pop
&НаКлиенте
Функция СбисСтек_Взять(СбисСтек) Экспорт
	СбисСтек.РазмерСтека = СбисСтек.РазмерСтека - 1;
	Значение = СбисСтек.ДанныеСтека[СбисСтек.РазмерСтека];
	СбисСтек.ДанныеСтека.Удалить(СбисСтек.РазмерСтека);
	Возврат Значение;
КонецФункции

// isEmpty
&НаКлиенте
Функция СбисСтек_Пустой(СбисСтек) Экспорт 
	Возврат СбисСтек.РазмерСтека = 0;
КонецФункции

