
&НаКлиенте
Функция СбисИсключение_Представление(СбисИсключениеВходящее, КлючПредставления = "Исключение") Экспорт
	
	КлючПроверить = НРег(КлючПредставления);
	Если ТипЗнч(СбисИсключениеВходящее) = Тип("ИнформацияОбОшибке") Тогда
		
		СбисИсключение = НовыйСбисИсключение(СбисИсключениеВходящее, "МодульОбъектаКлиент.СбисИсключение_Представление");
		
	ИначеЕсли Не ЭтоТипСбис(СбисИсключениеВходящее, "СбисИсключение") Тогда
		
		Возврат "Неизвестный формат исключения для приведения к строке!";
		
	Иначе
		
		СбисИсключение = СбисИсключениеВходящее;
		
	КонецЕсли;	
		
	Если КлючПроверить = "сообщение" Тогда
		
		Результат = СбисИсключение.message;
		
		Если Результат = Неопределено Тогда
			
			Результат = "";
			
		КонецЕсли;
		
		Если	СбисИсключение.Свойство("details")
			И	СбисИсключение.message <> СбисИсключение.details Тогда 
			Результат = Результат + " (" + СбисИсключение.details + ")";
		КонецЕсли;
		
	ИначеЕсли КлючПроверить = "полныйтекст" Тогда
		
		Результат = СбисИсключение.message;
		
		Если Результат = Неопределено Тогда
			
			Результат = "";
			
		КонецЕсли;
		
		Если	Не СбисИсключение.message = СбисИсключение.details Тогда 
			Результат = Результат + Символы.ПС + "Детально: " + СбисИсключение.details;
		КонецЕсли;
	
		Если	ЗначениеЗаполнено(СбисИсключение.dump)
			И	СбисИсключение.dump.Свойство("ДетализацияОшибки")
			И	СбисИсключение.dump.Свойство("ИсходнаяСтрока")
			И	СбисИсключение.dump.Свойство("НомерСтроки") Тогда
			
			СтрокаДетально = "В модуле {ИмяМодуля}, в строке ""{ИсходнаяСтрока}"" ({НомерСтроки}) произошла ошибка ""{ДетализацияОшибки}""!";
			СтрокаДетально = ПрименитьФорматКСтроке(СтрокаДетально, СбисИсключение.dump);
			Результат = Результат + Символы.ПС + "Подбробная информация: " + СтрокаДетально;
			
		КонецЕсли;
		
	Иначе 
		
		Результат = СбисИсключение_ВСтроку(СбисИсключение);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СбисИсключение_ВСтрокуВызовСервера(Знач СбисИсключение, ДопПарамеры = Неопределено) 
	
	Возврат МодульОбъектаСервер().СбисИсключение_ВСтрокуСервер(СбисИсключение, ДопПарамеры);
	
КонецФункции

&НаСервере
Функция СбисИсключение_ИзСтрокиВызовСервера(Знач СбисИсключение, ДопПарамеры = Неопределено) 
	
	Возврат МодульОбъектаСервер().СбисИсключение_ИзСтрокиСервер(СбисИсключение, ДопПарамеры);
	
КонецФункции

// Функция - Возвращает пользовательские действия, доступные для иключения
//
// Параметры:
//  СбисИсключение - Структура - Объект класса СбисИсключение
//  ДопПараметры - Структура, Неопределено - Дополнительные параметры для действий
// 
// Возвращаемое значение:
//  Массив - массив объектов кдасса ПользовательскоеДействие
//
&НаКлиенте
Функция СбисИсключение_ПользовательскиеДействия(СбисИсключение, ДопПараметры = Неопределено) Экспорт

	НаборПользовательскихДействий = Новый Массив;
	
	ПолныйКодОшибки = СбисИсключение_Получить(СбисИсключение, "ПолныйКод");
	
	Если ПолныйКодОшибки = 773001 Тогда
	
		ДействиеОтправитьУоО = НовыйПользовательскоеДействие(СбисИсключение, ДопПараметры);
		ДействиеОтправитьУоО.Идентификатор = "ОтправитьУведомлениеОбОтгрузке";
		ДействиеОтправитьУоО.Представление = "Отправить Уведомление об отгрузке";
		ДействиеОтправитьУоО.Параметры.Вставить("Статус", "Завершено");
	
		ДействиеОтправитьОтмена = НовыйПользовательскоеДействие(СбисИсключение, ДопПараметры);
		ДействиеОтправитьОтмена.Идентификатор = "Отмена";
		ДействиеОтправитьОтмена.Представление = "Отмена";
		ДействиеОтправитьОтмена.Параметры.Вставить("Статус", "Ошибка");
																			
		НаборПользовательскихДействий.Добавить(ДействиеОтправитьУоО);
		НаборПользовательскихДействий.Добавить(ДействиеОтправитьОтмена);
		
	ИначеЕсли ПолныйКодОшибки = 335 Тогда
		
		ДействиеОткрытьСсылкуОплаты = НовыйПользовательскоеДействие(СбисИсключение, ДопПараметры);
		ДействиеОткрытьСсылкуОплаты.Идентификатор = "ОткрытьСсылкуОплаты";
		ДействиеОткрытьСсылкуОплаты.Представление = "Открыть ссылку оплаты";
		ДействиеОткрытьСсылкуОплаты.Параметры.Вставить("Статус", "Ошибка");
		ДействиеОткрытьСсылкуОплаты.Параметры.Вставить("ПрименитьДляВсехДокументов", Истина);
		
		ДействиеВидеоЗвонок = НовыйПользовательскоеДействие(СбисИсключение, ДопПараметры);
		ДействиеВидеоЗвонок.Идентификатор = "Видеозвонок";
		ДействиеВидеоЗвонок.Представление = "Видеозвонок";
		ДействиеВидеоЗвонок.Параметры.Вставить("Статус", "Ошибка");
		
		ДействиеКарточкаМенеджера = НовыйПользовательскоеДействие(СбисИсключение, ДопПараметры);
		ДействиеКарточкаМенеджера.Идентификатор = "КарточкаМенеджера";
		ДействиеКарточкаМенеджера.Представление = "Карточка менеджера";
		ДействиеКарточкаМенеджера.Параметры.Вставить("Статус", "Ошибка");
		
		ДействиеОтправитьОтмена = НовыйПользовательскоеДействие(СбисИсключение, ДопПараметры);
		ДействиеОтправитьОтмена.Идентификатор = "Отмена";
		ДействиеОтправитьОтмена.Представление = "Отмена";
		ДействиеОтправитьОтмена.Параметры.Вставить("Статус", "Ошибка");
																			
		НаборПользовательскихДействий.Добавить(ДействиеОткрытьСсылкуОплаты);
		НаборПользовательскихДействий.Добавить(ДействиеВидеоЗвонок);
		НаборПользовательскихДействий.Добавить(ДействиеКарточкаМенеджера);
		НаборПользовательскихДействий.Добавить(ДействиеОтправитьОтмена);
		
	КонецЕсли;
	
	Возврат НаборПользовательскихДействий;

КонецФункции

#Область include_core2_vo2_МодульОбъекта_Классы_СбисИсключение_Общее //&НаКлиенте
#КонецОбласти

