
// Функция - Конструктор класс описание оповещения с учетом старых ОФ
//
// Параметры: аналогично ОписаниеОповещения
// 
// Возвращаемое значение:
// СбисОписаниеОповещения  - экземпляр класса
//
&НаКлиенте
Функция НовыйСбисОписаниеОповещения(СбисПроцедура, СбисМодуль, СбисДопПараметры = Неопределено, СбисПроцедураИсключения = Неопределено, СбисМодульИсключения = Неопределено) Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Если ГлобальныйКэш.СовместимостьМетодов.Объекты1С.ОписаниеОповещения Тогда
			
			СтрокаВычислить = "Новый ОписаниеОповещения(СбисПроцедура, СбисМодуль, СбисДопПараметры)";
			Если Не СбисПроцедураИсключения = Неопределено Тогда
				
				СбисМодульИсключенияУстановить = СбисМодульИсключения;
				Если СбисМодульИсключенияУстановить = Неопределено Тогда 
					
					СбисМодульИсключенияУстановить = СбисМодуль;
					СтрокаВычислить = СтрЗаменить(СтрокаВычислить, ")", ", СбисПроцедураИсключения, СбисМодульИсключенияУстановить)");
					
				КонецЕсли;
				
			КонецЕсли;
			//Вычислить для маскировки от синтаксиса
			Попытка
				
				ОписаниеОповещенияРезультат = Вычислить(СтрокаВычислить);
				
			Исключение
				
				ДанныеОшибки = Новый Структура("Метод", СбисПроцедура);
				ОшибкаСозданияОбъекта = НовыйСбисИсключение(	ИнформацияОбОшибке(),
																МодульОбъектаКлиентСервер_Представление() + "Новый_ОписаниеОповещения",
																615,
																"Ошибка вызова конструктора ""ОписаниеОповещения""",
																,ДанныеОшибки);
				ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаСозданияОбъекта);
				
			КонецПопытки;
			
		Иначе
			
			// Для теста вызова надо снизить падения при тесте метода и обернуть все вызовы на "SabyТестВызова"
			//ТестФункции = НайтиФункциюСеансаОбработки(СбисПроцедура, СбисМодуль);
			//Если ТестФункции = Ложь Тогда
			//	
			//	ВызватьИсключение "Ошибка при вызове конструктора ""(СбисОписаниеОповещения)"". Метод не найден.";
			//	
			//КонецЕсли;
			ОписаниеОповещенияРезультат = НовыйОбъектSABY("СбисОписаниеОповещения");
			ОписаниеОповещенияРезультат.Вставить("ИмяПроцедуры", СбисПроцедура);
			ОписаниеОповещенияРезультат.Вставить("Модуль", СбисМодуль);
			ОписаниеОповещенияРезультат.Вставить("ДополнительныеПараметры", СбисДопПараметры);
			ОписаниеОповещенияРезультат.Вставить("ИмяПроцедурыОбработкиОшибки", СбисПроцедураИсключения);
			ОписаниеОповещенияРезультат.Вставить("МодульОбработкиОшибки", СбисМодульИсключения);
			
		КонецЕсли;
		
	#Иначе
		
		Если СбисПроцедураИсключения = Неопределено Тогда
			
			Попытка
				
				ОписаниеОповещенияРезультат = Новый ОписаниеОповещения(СбисПроцедура, СбисМодуль, СбисДопПараметры);
				
			Исключение
				
				ДанныеОшибки = Новый Структура("Метод", СбисПроцедура);
				ОшибкаСозданияОбъекта = НовыйСбисИсключение(	ИнформацияОбОшибке(),
																МодульОбъектаКлиентСервер_Представление() + "Новый_ОписаниеОповещения",
																615,
																"Ошибка вызова конструктора ""ОписаниеОповещения""",
																,ДанныеОшибки);
				ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаСозданияОбъекта);
				
			КонецПопытки;
			
		Иначе
			
			СбисМодульИсключенияУстановить = СбисМодульИсключения;
			Если СбисМодульИсключенияУстановить = Неопределено Тогда 
				
				СбисМодульИсключенияУстановить = СбисМодуль;
				
			КонецЕсли;
			
			Попытка
				
				ОписаниеОповещенияРезультат = Новый ОписаниеОповещения(СбисПроцедура, СбисМодуль, СбисДопПараметры, СбисПроцедураИсключения, СбисМодульИсключенияУстановить);
				
			Исключение
				
				ДанныеОшибки = Новый Структура("Метод", СбисПроцедура);
				ОшибкаСозданияОбъекта = НовыйСбисИсключение(	ИнформацияОбОшибке(),
																МодульОбъектаКлиентСервер_Представление() + "Новый_ОписаниеОповещения",
																615,
																"Ошибка вызова конструктора ""ОписаниеОповещения""",
																,ДанныеОшибки);
				ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаСозданияОбъекта);
				
			КонецПопытки;
			
		КонецЕсли;
		
	#КонецЕсли
	
	Возврат ОписаниеОповещенияРезультат;
	
КонецФункции

// Процедура - Выполняет описание оповещения.
//	Обработка результата функций через Возврат не поддерживается. 
//	Для получения результата требуется проброска в ДополнительныеПараметры ОписанияОповещения тега Результат с заполнением в обработчике
//
// Параметры:
//  РезультатВызова			 - Произвольный				- первый аргумент в вызове
//  СбисОписаниеОповещения	 - СбисОписаниеОповещения	- вызываемый экземпляр описания оповещения для обработки
//
&НаКлиенте
Процедура ВыполнитьСбисОписаниеОповещения(РезультатВызова=Неопределено, СбисОписаниеОповещения) Экспорт
	
	Если СбисОписаниеОповещения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если ГлобальныйКэш.СовместимостьМетодов.Объекты1С.ОписаниеОповещения Тогда
			Выполнить("ВыполнитьОбработкуОповещения(СбисОписаниеОповещения, РезультатВызова)");//Через Выполнить для старых платформ. Маскировка от синтаксиса. 
		Иначе
			Попытка
				Выполнить("СбисОписаниеОповещения.Модуль." + СбисОписаниеОповещения.ИмяПроцедуры + "(РезультатВызова, СбисОписаниеОповещения.ДополнительныеПараметры)");
			Исключение
				СтандартнаяОбработка = Истина;
				Если ЗначениеЗаполнено(СбисОписаниеОповещения.ИмяПроцедурыОбработкиОшибки) Тогда
					ИнформацияОбОшибке = ИнформацияОбОшибке();
					Выполнить("СбисОписаниеОповещения.МодульОбработкиОшибки." + СбисОписаниеОповещения.ИмяПроцедурыОбработкиОшибки + "(ИнформацияОбОшибке, СтандартнаяОбработка, СбисОписаниеОповещения.ДополнительныеПараметры)");
				КонецЕсли;
				Если СтандартнаяОбработка Тогда
					ВызватьИсключение;
				КонецЕсли;
			КонецПопытки;
		КонецЕсли;
	#Иначе
		ВыполнитьОбработкуОповещения(СбисОписаниеОповещения, РезультатВызова);
	#КонецЕсли
	
КонецПроцедуры

