
#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_СопоставлениеНоменклатуры_СтруктураСтрок
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_СопоставлениеНоменклатуры_ОбщиеФункцииИПроцедуры
#КонецОбласти

&НаКлиенте
Процедура УдалитьЛишниеАтрибутыСтрокиТабличнойЧасти(СтрокаТабличнойЧасти, СписокАтрибутов) Экспорт

	Для Каждого ЛишнийАтрибут Из СписокАтрибутов Цикл
		Если СтрокаТабличнойЧасти.Свойство(ЛишнийАтрибут) Тогда
			СтрокаТабличнойЧасти.Удалить(ЛишнийАтрибут);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// В зависимости от режима номенклатуры либо создаём карточки в 1С либо загружаем в табличную часть без ссылок
//
// Параметры:
//  ПараметрыПодготовки  - Структура - Все необходимые данные для подготовки загрузки документа
//   - ВложениеСБИС - Структура -  Смотри МодульОбъектаКлиент_Классы_ВложениеСБИС  
//   - РежимЗагрузкиНоменклатуры - Число - Смотри настройку "Режим обработки документов" на вкладке Документы в настройках ВО
//	 - СоставПакета - Структура - Смотри МодульОбъектаКлиент_Отправка_СоставПакета      
// 	 - НоменклатураСБИС - Структура - Смотри МодульОбъектаКлиент_Классы_СопоставлениеНоменклатуры_СтруктураСтрок_СтрокаСопоставленияСБИС
// 	 - МассоваяЗагрузка - Булево - Признак загрузки документа из формы ПросмотрДокумента или из реестра документов 		
//  
&НаКлиенте
Функция РасширенноеСопоставление_ПодготовитьНоменклатурыКЗагрузкеВ1С(ПараметрыПодготовки) Экспорт
	
	ВложениеСБИС 			  = ПараметрыПодготовки.ВложениеСБИС;
	РежимЗагрузкиНоменклатуры = ПараметрыПодготовки.РежимЗагрузкиНоменклатуры;	
	СоставПакета 			  = ПараметрыПодготовки.СоставПакета;
	НоменклатураСБИС 		  = ПараметрыПодготовки.НоменклатураСБИС; 
	МассоваяЗагрузка 		  = ПараметрыПодготовки.МассоваяЗагрузка;
	
	Если РежимЗагрузкиНоменклатуры = 1 Тогда                                        
	
		РезультатСопоставления = НайтиСоздатьНоменклатуру1СПоНаборуКлассовСопоставления(ПараметрыПодготовки);			
		Возврат РезультатСопоставления;
		
	ИначеЕсли РежимЗагрузкиНоменклатуры = 3 Тогда
		
		ЗаполнитьСтрокиНоменклатурыПоДаннымСопоставления(ПараметрыПодготовки);
		Возврат Истина; 
		
	Иначе 
		Возврат Неопределено;
	КонецЕсли; 	
	
КонецФункции // РасширенноеСопоставление_ПодготовитьНоменклатурыКЗагрузкеВ1С()

&НаКлиенте
Процедура ЗаполнитьСтрокиНоменклатурыПоДаннымСопоставления(ПараметрыПодготовки)

	ВложениеСБИС = ПараметрыПодготовки.ВложениеСБИС;
	
	Для Каждого Сопоставление Из ВложениеСБИС.КлассыСопоставленияНоменклатур Цикл 
		
		Если Сопоставление.Номенклатура1С.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		Номенклатура1С = НовыйОписаниеНоменклатуры1СКлиент();
		
		ЗаполнитьЗначенияСвойств(Номенклатура1С, Сопоставление.НоменклатураСБИС);
		
		СтрокаСопоставленияСБИСКлиент_Вставить(Сопоставление, "Номенклатура1С", Номенклатура1С);
		
	КонецЦикла;
	
КонецПроцедуры
