
#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_СопоставлениеНоменклатуры_СтруктураСтрок
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_СопоставлениеНоменклатуры_ОбщиеФункцииИПроцедуры
#КонецОбласти

&НаКлиенте
Процедура УдалитьЛишниеАтрибутыСтрокиТабличнойЧасти(СтрокаТабличнойЧасти, СписокАтрибутов) Экспорт

	Для Каждого ЛишнийАтрибут Из СписокАтрибутов Цикл
		Если СтрокаТабличнойЧасти.Свойство(ЛишнийАтрибут) Тогда
			СтрокаТабличнойЧасти.Удалить(ЛишнийАтрибут);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

