
//Функция заполняет структуру с данными о текущем разделе
&НаКлиенте
Функция НовыйСтруктураРазделаГО(ИмяКнопкиРаздела = Неопределено, ДопПараметры = Неопределено) Экспорт
	Перем ИмяРеестра, СтруктураГО, ДопПараметрыРаздела, ПредыдущийРаздел;
	
	СтруктураРазделов = ПолучитьЗначениеПараметраТекущегоСеанса("СтруктураРазделов");
	Если Не ДопПараметры = Неопределено Тогда
		
		ДопПараметры.Свойство("ПараметрыРаздела",	ДопПараметрыРаздела);
		ДопПараметры.Свойство("ТекущийРаздел",		ПредыдущийРаздел);
		
		Если ДопПараметры.Свойство("ИмяИни") Тогда
			
			//Если кнопка не передана, то может быть передана имя ини файла раздела. Попробуем найти по реестрам.
			ИмяРеестра = ДопПараметры.ИмяИни;
			Для Каждого КлючИЗначение Из ГлавноеОкно.Кэш.Разделы Цикл
				
				Если	Не	(	КлючИЗначение.Ключ = "Покупка"
							Или	КлючИЗначение.Ключ = "Продажа"
							Или	КлючИЗначение.Ключ = "Справочники") Тогда
							
					Продолжить;
					
				КонецЕсли;
				
				Для Каждого КлючИЗначениеПодРаздел Из КлючИЗначение.Значение Цикл
					
					Если ИмяРеестра = КлючИЗначениеПодРаздел.Значение Тогда
						
						ИмяКнопкиРаздела = КлючИЗначениеПодРаздел.Ключ;
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если Не ИмяКнопкиРаздела = Неопределено Тогда
					
					Прервать;
					
				КонецЕсли;
			КонецЦикла;
			
			Если ИмяКнопкиРаздела = Неопределено Тогда
				
				// Имя кнопки не найдено, это может быть ини без реестра.
				ОбщиеФункции		= ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции");
				ЗначениеИни			= ИниПоПараметрам(ИмяРеестра);
				ИмяНадРаздела		= ОбщиеФункции.РассчитатьЗначение("ДокументРаздел", ЗначениеИни);
				Раздел				= _СтруктураРазделаГО_НазваниеНомерРазделаПоСоответствию(ИмяНадРаздела);
				ТекущийРаздел		= Раздел;
				// Виртуальный, 99 раздел. Надеюсь, столько кнопок в аккордеоне никогда не будет
				ИмяКнопкиРаздела	= "Аккордеон" + ИмяНадРаздела + "Док99" + Раздел + ТекущийРаздел;
				
			КонецЕсли;
			
			СтруктураГО = НовыйСтруктураРазделаГО_ПоДанным(ИмяКнопкиРаздела, Раздел, ТекущийРаздел, ИмяРеестра);
			
		КонецЕсли;	
			
	КонецЕсли;
		
	Если СтруктураГО = Неопределено Тогда;
		
		СтруктураГО = НовыйСтруктураРазделаГО_ПоДанным(ИмяКнопкиРаздела);
		СтруктураРазделаГО_Получить(СтруктураГО, "ИмяИни");		
		
	КонецЕсли;
		
	Если Не ДопПараметрыРаздела = Неопределено Тогда
		
		Для Каждого  ПараметрРаздела Из ДопПараметрыРаздела Цикл
			
			СтруктураГО.ПараметрыРаздела.Вставить(ПараметрРаздела.Ключ, ПараметрРаздела.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ПредыдущийРаздел = Неопределено Тогда
		
		//Сохраняем последовательность переходов по разделам на случай, если при невозможности перехода понадобится вернуться.	
		Если	ПредыдущийРаздел.ОписаниеРаздела.Номер = СтруктураГО.ОписаниеРаздела.Номер
			И	ЗначениеЗаполнено(СтруктураГО.ОписаниеРаздела.Номер) Тогда
			
			Если ПредыдущийРаздел.ОписаниеРаздела.Имя = ПредыдущийРаздел.ТипДок Тогда

				// Текущий - основной раздел. Берем его как предыдущий
				СтруктураГО.ПредыдущийРаздел = НовыйСтруктураРазделаГО_ПоДанным(ПредыдущийРаздел);
				
			ИначеЕсли Не ПредыдущийРаздел.ПредыдущийРаздел = Неопределено Тогда
				
				// Переход был между подразделами. Взять предыдущий от текущего
				СтруктураГО.ПредыдущийРаздел = НовыйСтруктураРазделаГО_ПоДанным(ПредыдущийРаздел.ПредыдущийРаздел);
				
			КонецЕсли;
			
		ИначеЕсли		ЗначениеЗаполнено(ПредыдущийРаздел.ОписаниеРаздела.Номер)
				И Не	СтруктураГО.ОписаниеРаздела.Имя = СтруктураГО.ТипДок	Тогда
				
			СтруктураГО.ПредыдущийРаздел = НовыйСтруктураРазделаГО_ПоДанным(ПредыдущийРаздел);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Совместимость для ВФК. НЕ УДАЛЯТЬ!
	СтруктураГО.Раздел = СтруктураГО.ОписаниеРаздела.Номер;
	
	Возврат СтруктураГО;
	
КонецФункции

&НаКлиенте
Функция НовыйСтруктураРазделаГО_ПоДанным(КнопкаРаздела = Неопределено, ДанныеРаздел = Неопределено, НомерТекущегоРаздела = Неопределено, ИниРаздела = Неопределено)
	
	Если ЭтоТипСбис(КнопкаРаздела, "СтруктураРазделаГО") Тогда
		
		Возврат НовыйСтруктураРазделаГО_ПоДанным(КнопкаРаздела.Имя, КнопкаРаздела.Раздел, КнопкаРаздела.ТекущийРаздел, КнопкаРаздела.ТипДок);
		
	Иначе
		
		ИмяКнопкиРаздела = КнопкаРаздела;
		
	КонецЕсли;
	
	СтруктураРазделаГО = _СтруктураРазделаГО_Пустой();
	
	// ПредыдущийРаздел - СтруктураРазделаГО - для отслеживания вложенности разделов. При не удачном переходе, возвращаемся по пути обратно
	// Имя				- Имя кнопки, по которой попали сюда
	// Раздел			- номер раздела из структуры разделов
	// ТипДок			- Тип для реестров СБИС
	// ИниРаздела		- Имя ини для реестра, если есть
	
	СтруктураРазделаГО.Вставить("ОписаниеРаздела", Новый Структура("Параметры, Номер, Имя, Ини", Новый Структура)); 
	
	СтруктураРазделаГО.Вставить("ПараметрыРаздела", Новый Структура);
	
	идРаздел = Прав(ИмяКнопкиРаздела, 2);

	// Имя кнопки
	Если ИмяКнопкиРаздела = Неопределено Тогда
	
		СтруктураРазделаГО.Имя = "";
		
	Иначе
		
		СтруктураРазделаГО.Имя = ИмяКнопкиРаздела;
		
	КонецЕсли;
	
	// Номер раздела из СтруктураРазделаГО
	Если ДанныеРаздел = Неопределено Тогда
	
		СтруктураРазделаГО.ОписаниеРаздела.Номер = Прав(идРаздел, 1);
		
	ИначеЕсли ТипЗнч(ДанныеРаздел) = Тип("Структура") Тогда
		
		СтруктураРазделаГО.ОписаниеРаздела = ДанныеРаздел;
		
	Иначе
		
		СтруктураРазделаГО.ОписаниеРаздела.Номер = ДанныеРаздел;
		
	КонецЕсли;
	
	// Номер текущего раздела
	Если НомерТекущегоРаздела = Неопределено Тогда
	
		СтруктураРазделаГО.ТекущийРаздел = Лев(идРаздел, 1);
		
	Иначе
		
		СтруктураРазделаГО.ТекущийРаздел = НомерТекущегоРаздела;
		
	КонецЕсли;
	
	// Имя ини
	Если ИниРаздела = Неопределено Тогда
	
		СтруктураРазделаГО.ОписаниеРаздела.Ини = "";
		
	Иначе
		
		СтруктураРазделаГО.ОписаниеРаздела.Ини = ИниРаздела;
		
	КонецЕсли;

	СтруктураРазделаГО.ОписаниеРаздела.Имя	= _СтруктураРазделаГО_НазваниеНомерРазделаПоСоответствию(СтруктураРазделаГО.ОписаниеРаздела.Номер);
	СтруктураРазделаГО.ТипДок		= Сред(ИмяКнопкиРаздела, 10, СтрДлина(ИмяКнопкиРаздела) - 11);
	
	Если ЗначениеЗаполнено(СтруктураРазделаГО.ОписаниеРаздела.Имя) Тогда
		
		СтруктураРазделаГО.ОписаниеРаздела.Вставить("ФормыРаздела", Новый Массив);
		СтруктураРазделаГО.ОписаниеРаздела.Вставить("ФормыФильтра", Новый Массив);
		
		ШаблонФормы	= СтруктураРазделаГО.ОписаниеРаздела.Имя + "_" + СтруктураРазделаГО.ТипДок;
		СтруктураРазделаГО.ОписаниеРаздела.ФормыРаздела.Добавить("Раздел_"			+ ШаблонФормы);
		СтруктураРазделаГО.ОписаниеРаздела.ФормыФильтра.Добавить("Фильтр_Раздел_"	+ ШаблонФормы);
		Если ЗначениеЗаполнено(СтруктураРазделаГО.ОписаниеРаздела.Ини) Тогда
			
			ШаблонФормы	= СтруктураРазделаГО.ОписаниеРаздела.Имя + "_" + СтруктураРазделаГО.ОписаниеРаздела.Ини;
			СтруктураРазделаГО.ОписаниеРаздела.ФормыРаздела.Добавить("Раздел_"			+ ШаблонФормы);
			СтруктураРазделаГО.ОписаниеРаздела.ФормыФильтра.Добавить("Фильтр_Раздел_"	+ ШаблонФормы);
			
		КонецЕсли;
		ШаблонФормы	= СтруктураРазделаГО.ОписаниеРаздела.Имя + "_Шаблон";
		СтруктураРазделаГО.ОписаниеРаздела.ФормыРаздела.Добавить("Раздел_"			+ ШаблонФормы);
		СтруктураРазделаГО.ОписаниеРаздела.ФормыФильтра.Добавить("Фильтр_Раздел_"	+ ШаблонФормы);
		
		// Костыль для совместимости на всякий случай. Спилить 25.2100
		СтруктураРазделаГО.Вставить("ФормыРаздела", СтруктураРазделаГО.ОписаниеРаздела.ФормыРаздела);
		
		Попытка
			
			фрм = НайтиФункциюСеансаОбработки("ОбновитьКонтент", СтруктураРазделаГО.ОписаниеРаздела.ФормыРаздела);
			
		Исключение
			
			СообщитьСбисИсключение(ИнформацияОбОшибке(), Новый Структура("ИмяКоманды", "МодульОбъектаКлиент.НовыйСтруктураРазделаГО_ПоДанным"));	
			
		КонецПопытки;
		
		СтруктураРазделаГО.Вставить("Форма", фрм);
		
	Иначе
		
		СтруктураРазделаГО.Вставить("Форма", Ложь);
		
	КонецЕсли;

	Возврат СтруктураРазделаГО;
	
КонецФункции

&НаКлиенте
Функция СтруктураРазделаГО_Получить(СтруктураРазделаГО, КлючЗначенияПолучить) Экспорт 
	Перем ПараметрПоиск;
	
	Если КлючЗначенияПолучить = "Название" Тогда
		
		Возврат СтруктураРазделаГО.ОписаниеРаздела.Имя;
		
	ИначеЕсли КлючЗначенияПолучить = "Тип" Тогда
		
		Возврат СтруктураРазделаГО.ТипДок;
		
	ИначеЕсли КлючЗначенияПолучить = "ИмяИни" Тогда
		
		Если		ЗначениеЗаполнено(СтруктураРазделаГО.ОписаниеРаздела.Ини)
			Или	Не	ЗначениеЗаполнено(СтруктураРазделаГО.Имя) Тогда
			
			Возврат СтруктураРазделаГО.ОписаниеРаздела.Ини;
			
		КонецЕсли;
		
		Для Каждого КлючИЗначение Из ПолучитьЗначениеПараметраТекущегоСеанса("СтруктураРазделов") Цикл
			
			Если	Не	(	КлючИЗначение.Ключ = "Покупка"
						Или	КлючИЗначение.Ключ = "Продажа"
						Или	КлючИЗначение.Ключ = "Справочники") Тогда
						
				Продолжить;
				
			КонецЕсли;
			
			Если КлючИЗначение.Значение.Свойство(СтруктураРазделаГО.Имя, ПараметрПоиск) Тогда
				
				Прервать;
				
			КонецЕсли;

		КонецЦикла;
		
		СтруктураРазделаГО.ОписаниеРаздела.Ини = ПараметрПоиск;

		Возврат СтруктураРазделаГО.ОписаниеРаздела.Ини;
		
	Иначе	
		
		Возврат СтруктураРазделаГО[КлючЗначенияПолучить];
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СтруктураРазделаГО_Вставить(СтруктураРазделаГО, КлючЗначенияВставить, ЗначениеВставить) Экспорт 
	
	СтруктураРазделаГО[КлючЗначенияВставить] = ЗначениеВставить;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураРазделаГО_Подготовить(СтруктураРазделаГО) Экспорт 

	Кэш = ПолучитьТекущийЛокальныйКэш();
	СтруктураРазделаГО.Форма.НаСменуРаздела(Кэш);
	СтруктураРазделаГО.Форма.НастроитьКолонки(Кэш);
	СтруктураРазделаГО.Форма.НавигацияУстановитьПанель(Кэш);

КонецПроцедуры
	
// Функция - возвращает Соответствие разделов главного окна
// 
// Возвращаемое значение:
//  Соответствие - номер раздела - его название
//
&НаКлиенте
Функция _СтруктураРазделаГО_СоответствиеРазделовГО()
	Перем РазделыГОСБИС;
	
	Если Не ГлобальныйКэш.ТекущийСеанс.Интерфейс.Свойство("РазделыАккордеона", РазделыГОСБИС) Тогда
		
		РазделыГОСБИС = Новый Соответствие;
		РазделыГОСБИС.Вставить("1",	"Полученные");
		РазделыГОСБИС.Вставить("2",	"Отправленные");
		РазделыГОСБИС.Вставить("3",	"Продажа");
		РазделыГОСБИС.Вставить("4",	"Покупка");
		РазделыГОСБИС.Вставить("5",	"Настройки");
		РазделыГОСБИС.Вставить("6",	"Справочники");
		РазделыГОСБИС.Вставить("7",	"Учет");
		РазделыГОСБИС.Вставить("8",	"Задачи");
		РазделыГОСБИС.Вставить("9",	"Отчетность");

		РазделыГОСБИС.Вставить("Полученные",	"1");
		РазделыГОСБИС.Вставить("Отправленные",	"2");
		РазделыГОСБИС.Вставить("Продажа",		"3");
		РазделыГОСБИС.Вставить("Покупка",		"4");
		РазделыГОСБИС.Вставить("Настройки",		"5");
		РазделыГОСБИС.Вставить("Справочники",	"6");
		РазделыГОСБИС.Вставить("Учет",			"7");
		РазделыГОСБИС.Вставить("Задачи",		"8");
		РазделыГОСБИС.Вставить("Отчетность",	"9");
		
		ГлобальныйКэш.ТекущийСеанс.Интерфейс.Вставить("РазделыАккордеона", РазделыГОСБИС);
	КонецЕсли;
	
	Возврат РазделыГОСБИС;
	
КонецФункции

// Функция - переводит номер раздела в название и наоборот
//
// Параметры:
//  НомерНазваниеВыбранногоРаздела	 - Строка	 - Номер, либо название раздела.
// 
// Возвращаемое значение:
//  Строка - Номер, или название раздела соответствующее аргументу.
//
&НаКлиенте
Функция _СтруктураРазделаГО_НазваниеНомерРазделаПоСоответствию(НомерНазваниеВыбранногоРаздела)

	Возврат _СтруктураРазделаГО_СоответствиеРазделовГО().Получить(Строка(НомерНазваниеВыбранногоРаздела));
	
КонецФункции

&НаКлиенте
Функция _СтруктураРазделаГО_Пустой()
	
	Возврат Новый Структура("_класс, ПредыдущийРаздел, ОписаниеРаздела, Имя, Раздел, ТекущийРаздел, ТипДок", "СтруктураРазделаГО");
	
КонецФункции

