
&НаСервере
Функция ВнешняяОбработка_Сохранить(ОписаниеОбработкиНайдено, ДопПараметры = Неопределено) Экспорт
	
	Возврат МодульОбъектаСервер().ВнешняяОбработка_Сохранить(ОписаниеОбработкиНайдено, ДопПараметры);
	
КонецФункции

&НаСервере
Функция ВнешняяОбработка_МестаПоискаПоУмолчанию() Экспорт
	
	Возврат МодульОбъектаСервер().ВнешняяОбработка_МестаПоискаПоУмолчанию();
	
КонецФункции

// Функция - Выполняет поиск обработки. Возможные места поиска: файл, справочник, конфигурация. Возвращает путь или ссылку на ВО
//
// Параметры:
//  ПараметрыПоиска	 - 	 Структура(ИмяОбработки, МестаПоиска*) 
//	*Необязательные  
//
// Возвращаемое значение:
//   Строка - путь к файловой обработке
//   СправочникСсылка - на элемент справочника Доп.Обработки
//	 Неопределено - обработка не найдена
&НаСервере
Функция ВнешняяОбработка_НайтиПоИмени(ПараметрыПоиска) Экспорт
	
	Возврат МодульОбъектаСервер().ВнешняяОбработка_НайтиПоИмени(ПараметрыПоиска);
	
КонецФункции

&НаСервере
Функция СсылочныйТипСтрокойСервер(Ссылка, ДопПараметры = Неопределено) Экспорт 

	Возврат МодульОбъектаСервер().СсылочныйТипСтрокойСервер(Ссылка, ДопПараметры);
	
КонецФункции

