
&НаКлиенте
Процедура ДействияСНастройками_ЗагрузитьИзКаталогаНажатие(Команда)
	
	ДопПараметры = Новый Структура("Кэш, Отказ, ОбновитьСоставНастроек, Тип", Кэш, Ложь, Ложь, "Загрузка");
	ОписаниеЗавершения = Кэш.ОбщиеФункции.СбисОписаниеОповещения(Кэш, "ДействияСНастройками_ЗавершениеВызоваКоманды", ЭтаФорма, ДопПараметры);
	Кэш.ФормаНастроек.СбисЗагрузитьНастройкиИзКаталога(Кэш, Новый Структура("Кэш, ОписаниеОповещенияОЗавершении", Кэш, ОписаниеЗавершения));
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСНастройками_ВыгрузитьВКаталогНажатие(Команда)
	
	ДопПараметры = Новый Структура("Кэш, Отказ, ОбновитьСоставНастроек, Тип", Кэш, Ложь, Ложь, "Выгрузка");
	ОписаниеЗавершения = Кэш.ОбщиеФункции.СбисОписаниеОповещения(Кэш, "ДействияСНастройками_ЗавершениеВызоваКоманды", ЭтаФорма, ДопПараметры);
	Кэш.ФормаНастроек.СбисВыгрузитьНастройкиВКаталог(Кэш, Новый Структура("Кэш, ОписаниеОповещенияОЗавершении", Кэш, ОписаниеЗавершения));
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСНастройками_СохранитьИзмененияНастроекНажатие(Команда)
	
	ПараметрыЗаписи = Новый Структура("Отказ, ПродолжитьВыполнение", Ложь, Истина);
	Кэш.ФормаНастроек.СбисСохранитьВыбранныеНастройки(Кэш, ПараметрыЗаписи);
	СбисОбновитьОтображение();  
		
КонецПроцедуры   

&НаКлиенте
Процедура ДействияСНастройками_ПеречитатьНастройки(Команда)

	Кэшнастроек		= МодульОбъектаКлиент().ГлобальныйКэш_Получить("КэшНастроек");
	КоннекшенSABY	= Кэшнастроек.ВыбранныеНастройки;
	ПараметрыПеречитать = Новый Структура("Кэш, Элемент", Кэш, Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "ДействияСНастройками_ПеречитатьНастройки"));

	МодульОбъектаКлиент().КоннекшенSaby_Очистить(КоннекшенSABY, "Данные");
	МодульОбъектаКлиент().КоннекшенSABY_Установить(КоннекшенSABY, "ОтключеныДоработки", Ложь);
	Попытка
		
		Кэш.ФормаНастроек.СбисПеречитатьНастройки(КоннекшенSABY, ПараметрыПеречитать);
		
	Исключение
		
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ФайлыНастроекОбщее.ДействияСНастройками.ПеречитатьНастройки");
		
	КонецПопытки;
	
КонецПроцедуры  

&НаКлиенте
Процедура ДействияСНастройками_ОтключитьДоработки(Команда)
	
	ПереключитьИспользованиеДоработок(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСНастройками_ВключитьДоработки(Команда)
	
	ПереключитьИспользованиеДоработок(Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьИспользованиеДоработок(ЗначениеПараметра = Ложь)
	
	ПараметрыДляПолучения	= Новый Структура("Кэш, Тип", Кэш, "Настройки");
	ВыбранныеНастройки		= МодульОбъектаКлиент().ПараметрSaby("ВыбранныеНастройки", ПараметрыДляПолучения);
	УстановленныеНастройки	= МодульОбъектаКлиент().ПараметрSaby("ВыбранныеНастройки", "Настройки");

	ПараметрыПродолжить		= Новый Структура("ВыбранныеНастройки, ЗначениеПараметра", ВыбранныеНастройки, ЗначениеПараметра);
	
	ОбработчикПродолжить = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПереключитьИспользованиеДоработок_Продолжить", ЭтаФорма, ПараметрыПродолжить);
	Если		МодульОбъектаКлиент().КоннекшенSABY_Получить(ВыбранныеНастройки, "Изменен")
		Или	Не	УстановленныеНастройки = ВыбранныеНастройки Тогда
		
		ЗаголовокВопроса	= "Все несохраненные изменения будут потеряны!";
		ТекстВопроса		= "Продолжить?";
		МодульОбъектаКлиент().СбисПоказатьВопрос(ОбработчикПродолжить, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, ЗаголовокВопроса);
		Возврат;
		
	КонецЕсли;
	
	МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(КодВозвратаДиалога.Да, ОбработчикПродолжить);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьИспользованиеДоработок_Продолжить(ВыборДиалог, ПараметрыПродолжить) Экспорт
	
	Если Не ВыборДиалог = КодВозвратаДиалога.Да Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ЭлементРодитель		= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДействияСНастройками_ПеречитатьНастройки");
	ПараметрыПеречитать	= Новый Структура("Элемент, Принудительно, Кэш", ЭлементРодитель, Истина, Кэш);
	
	МодульОбъектаКлиент().КоннекшенSABY_Установить(	ПараметрыПродолжить.ВыбранныеНастройки,
													"ОтключеныДоработки",
													ПараметрыПродолжить.ЗначениеПараметра);
	Попытка
		
		МодульОбъектаКлиент().ПоказатьСостояниеSABY(?(ПараметрыПродолжить.ЗначениеПараметра, "От", "В") + "ключаем изменения...");
		МодульОбъектаКлиент().КоннекшенSABY_Сохранить(ПараметрыПродолжить.ВыбранныеНастройки, "Параметры");
		
		// Очистить все, что есть.
		МодульОбъектаКлиент().КоннекшенSABY_Очистить(ПараметрыПродолжить.ВыбранныеНастройки, "ОписаниеИни");
		МодульОбъектаКлиент().КоннекшенSABY_Очистить(ПараметрыПродолжить.ВыбранныеНастройки, "Данные");
		
		Кэш.ФормаНастроек.СбисПеречитатьНастройки(ПараметрыПродолжить.ВыбранныеНастройки, ПараметрыПеречитать);
		МодульОбъектаКлиент().ПоказатьСостояниеSABY();
		
	Исключение
		
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ФайлыНастроекОбщее.ДействияСНастройками.ОтключитьДоработки");
		
	КонецПопытки;
	
КонецПроцедуры

// процедура устанавливает файлы настроек, выбранные в списке доступных настроек	
&НаКлиенте
Процедура УстановитьНастройки(Команда)
	
	сбисУстановитьФайлыНастроек(Кэш);
	
КонецПроцедуры

