
&НаКлиенте
Процедура ДействияСНастройками_ЗагрузитьИзКаталогаНажатие(Команда)
	
	ДопПараметры = Новый Структура("Кэш, Отказ, ОбновитьСоставНастроек, Тип", Кэш, Ложь, Ложь, "Загрузка");
	ОписаниеЗавершения = Кэш.ОбщиеФункции.СбисОписаниеОповещения(Кэш, "ДействияСНастройками_ЗавершениеВызоваКоманды", ЭтаФорма, ДопПараметры);
	Кэш.ФормаНастроек.СбисЗагрузитьНастройкиИзКаталога(Кэш, Новый Структура("Кэш, ОписаниеОповещенияОЗавершении", Кэш, ОписаниеЗавершения));
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСНастройками_ВыгрузитьВКаталогНажатие(Команда)
	
	ДопПараметры = Новый Структура("Кэш, Отказ, ОбновитьСоставНастроек, Тип", Кэш, Ложь, Ложь, "Выгрузка");
	ОписаниеЗавершения = Кэш.ОбщиеФункции.СбисОписаниеОповещения(Кэш, "ДействияСНастройками_ЗавершениеВызоваКоманды", ЭтаФорма, ДопПараметры);
	Кэш.ФормаНастроек.СбисВыгрузитьНастройкиВКаталог(Кэш, Новый Структура("Кэш, ОписаниеОповещенияОЗавершении", Кэш, ОписаниеЗавершения));
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСНастройками_СохранитьИзмененияНастроекНажатие(Команда)
	
	ПараметрыЗаписи = Новый Структура("Отказ, ПродолжитьВыполнение", Ложь, Истина);
	Кэш.ФормаНастроек.СбисСохранитьВыбранныеНастройки(Кэш, ПараметрыЗаписи);
	СбисОбновитьОтображение();  
		
КонецПроцедуры   

&НаКлиенте
Процедура ДействияСНастройками_ПеречитатьНастройки(Команда)

	Кэшнастроек		= МодульОбъектаКлиент().ГлобальныйКэш_Получить("КэшНастроек");
	КоннекшенSABY	= Кэшнастроек.ВыбранныеНастройки;
	ПараметрыПеречитать = Новый Структура("Кэш, Элемент", Кэш, Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "ДействияСНастройками_ПеречитатьНастройки"));

	МодульОбъектаКлиент().КоннекшенSaby_Очистить(КоннекшенSABY, "Данные");
	МодульОбъектаКлиент().КоннекшенSABY_Установить(КоннекшенSABY, "ОтключеныДоработки", Ложь);
	Попытка
		
		Кэш.ФормаНастроек.СбисПеречитатьНастройки(КоннекшенSABY, ПараметрыПеречитать);
		
	Исключение
		
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ФайлыНастроекОбщее.ДействияСНастройками.ПеречитатьНастройки");
		
	КонецПопытки;
	
КонецПроцедуры  

&НаКлиенте
Процедура ДействияСНастройками_ОтключитьДоработки(Команда)
	
	ПереключитьИспользованиеДоработок(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСНастройками_ВключитьДоработки(Команда)
	
	ПереключитьИспользованиеДоработок(Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьИспользованиеДоработок(ЗначениеПараметра)
	
	Кэшнастроек		= МодульОбъектаКлиент().ГлобальныйКэш_Получить("КэшНастроек");
	КоннекшенSABY	= Кэшнастроек.ВыбранныеНастройки;
	
	ПараметрыПеречитать = Новый Структура("Элемент, Принудительно, Кэш", Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "ДействияСНастройками_ПеречитатьНастройки"), Истина, Кэш);
	
	МодульОбъектаКлиент().КоннекшенSABY_Установить(КоннекшенSABY, "ОтключеныДоработки", ЗначениеПараметра);
	Попытка
		
		Кэш.ФормаНастроек.СбисПеречитатьНастройки(КоннекшенSABY, ПараметрыПеречитать);
		
	Исключение
		
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ФайлыНастроекОбщее.ДействияСНастройками.ОтключитьДоработки");
		
	КонецПопытки;
	
	
КонецПроцедуры

// процедура устанавливает файлы настроек, выбранные в списке доступных настроек	
&НаКлиенте
Процедура УстановитьНастройки(Команда)
	
	сбисУстановитьФайлыНастроек(Кэш);
	
КонецПроцедуры

