
&НаКлиенте
Процедура ДействияСНастройками_ЗагрузитьИзКаталогаНажатие(Команда)
	
	ДопПараметры = Новый Структура("Кэш, Отказ, ОбновитьСоставНастроек, Тип", Кэш, Ложь, Ложь, "Загрузка");
	ОписаниеЗавершения = Кэш.ОбщиеФункции.СбисОписаниеОповещения(Кэш, "ДействияСНастройками_ЗавершениеВызоваКоманды", ЭтаФорма, ДопПараметры);
	Кэш.ФормаНастроек.СбисЗагрузитьНастройкиИзКаталога(Кэш, Новый Структура("Кэш, ОписаниеОповещенияОЗавершении", Кэш, ОписаниеЗавершения));
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСНастройками_ВыгрузитьВКаталогНажатие(Команда)
	
	ДопПараметры = Новый Структура("Кэш, Отказ, ОбновитьСоставНастроек, Тип", Кэш, Ложь, Ложь, "Выгрузка");
	ОписаниеЗавершения = Кэш.ОбщиеФункции.СбисОписаниеОповещения(Кэш, "ДействияСНастройками_ЗавершениеВызоваКоманды", ЭтаФорма, ДопПараметры);
	Кэш.ФормаНастроек.СбисВыгрузитьНастройкиВКаталог(Кэш, Новый Структура("Кэш, ОписаниеОповещенияОЗавершении", Кэш, ОписаниеЗавершения));
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСНастройками_СохранитьИзмененияНастроекНажатие(Команда)
	
	ПараметрыЗаписи = Новый Структура("Отказ, ПродолжитьВыполнение", Ложь, Истина);
	Кэш.ФормаНастроек.СбисСохранитьВыбранныеНастройки(Кэш, ПараметрыЗаписи);
	СбисОбновитьОтображение();  
		
КонецПроцедуры   

&НаКлиенте
Процедура ДействияСНастройками_ПеречитатьНастройки(Команда)

	ПараметрыПеречитать = Новый Структура("Элемент", Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "ДействияСНастройками_ПеречитатьНастройки"));
	Кэш.ФормаНастроек.СбисПеречитатьНастройки(ПараметрыПеречитать, Кэш);
	
КонецПроцедуры  

// процедура устанавливает файлы настроек, выбранные в списке доступных настроек	
&НаКлиенте
Процедура УстановитьНастройки(Команда)
	
	сбисУстановитьФайлыНастроек(Кэш);
	
КонецПроцедуры

