
&НаКлиенте
Процедура КонфигурацияПриИзменении_Завершение(АргументЗавершения, ДопПараметры) Экспорт
	
	лОткатитьСистему = ДопПараметры.Отказ;
	ПараметрыОбновить = Новый Структура;
	Если АргументЗавершения = Неопределено Тогда
		лОткатитьСистему = Истина;
	Иначе
		ПараметрыОбновить.Вставить("УстановленныеИни", АргументЗавершения);		
	КонецЕсли;
	Если лОткатитьСистему Тогда
		Конфигурация = ПараметрыРаботы.КонфигурацияБыла;
	КонецЕсли;
	Если ДопПараметры.Отказ Тогда
		МодульОбъектаКлиент().СообщитьСбисИсключение(АргументЗавершения);
		Возврат;
	КонецЕсли;	
	СбисОбновитьОтображение(ПараметрыОбновить);
	                                    
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием_ПослеДиалога(РезультатДиалога, ДопПараметры) Экспорт
	
	Если		ДопПараметры.Режим = "Завершить" Тогда
		Если РезультатДиалога = КодВозвратаДиалога.Да Тогда

			МодульОбъектаКлиент().ЗавершитьРаботуSABY();
			
		КонецЕсли;
		
		Возврат;
	ИначеЕсли	ДопПараметры.Режим = "Сохранить" Тогда
		Если		РезультатДиалога = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		ИначеЕсли	РезультатДиалога = КодВозвратаДиалога.Да Тогда 
			ПараметрыЗаписи = Новый Структура("Отказ, ПродолжитьВыполнение", Ложь, Истина);
			Кэш.ФормаНастроек.СбисСохранитьВыбранныеНастройки(Кэш, ПараметрыЗаписи);
			Если ПараметрыЗаписи.Отказ Тогда 
				Возврат;
			КонецЕсли;
			ФормаЗакрытьУстановитьСтатусОк();
			Кэш.КэшНастроек.ИзмененияВНастройках = Ложь;
			ОбработчикДействия = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПерейтиВРаздел", Кэш.ГлавноеОкно);
			ОтложенноеДействие = МодульОбъектаКлиент().НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения", ОбработчикДействия));
			МодульОбъектаКлиент().ПодключитьОтложенноеДействие(ОтложенноеДействие);
		Иначе 
			
			Кэш.ФормаНастроек.СбисПеречитатьТекущиеНастройки(Новый Структура, Кэш);
			Кэш.КэшНастроек.ИзмененияВНастройках = Ложь;
			ФормаЗакрытьУстановитьСтатусОк();
			ОбработчикДействия = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПерейтиВРаздел", Кэш.ГлавноеОкно);
			ОтложенноеДействие = МодульОбъектаКлиент().НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения", ОбработчикДействия));
			МодульОбъектаКлиент().ПодключитьОтложенноеДействие(ОтложенноеДействие);
		
		КонецЕсли;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СбисОбновитьТаблицыИниФайлов(УстановленныеИниФайлы = Неопределено, Отказ = Ложь) Экспорт
	Перем СписокИниФайлыПрименить;
	
	Если Отказ Тогда
		ОбновитьПоляФормы(Новый Структура("ТабУстановленныеИниФайлы", Новый Массив()));
		Возврат;
	КонецЕсли;
	
	// Если инишки не передали, то проверим их 
	Если УстановленныеИниФайлы = Неопределено Тогда
		ДопПараметры = Новый Структура("Автообновление", Кэш.Парам.НастройкиАвтообновление);      
		УстановленныеИниФайлы = Кэш.ФормаНастроек.сбисПолучитьМассивУстановленныхИниФайлов(Кэш, ДопПараметры);
	КонецЕсли;
	
	Если Не Кэш.Свойство("Конфигурация") Тогда
		ЭтаФорма.ТабДоступныеИниФайлы.Очистить();
		
		СписокТиповНастроек = Кэш.ФормаНастроек.сбисПолучитьСписокДоступныхНастроек(Кэш);
		
		Если СписокТиповНастроек = Неопределено Тогда    
			ИнфоОбОшибке = "Не удалось получить список доступных настроек. Обратитесь в техподдержку";
			МодульОбъектаКлиент().ВызватьСбисИсключение(ИнфоОбОшибке, "ФайлыНастроекОбщее.СбисОбновитьТаблицыИниФайлов");
		КонецЕсли;
		
		ДанныеКонфигураций = Кэш.ФормаНастроекОбщее.СформироватьСтруктуруКонфигураций(Кэш, СписокТиповНастроек);
		Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "Конфигурация").СписокВыбора.ЗагрузитьЗначения(ДанныеКонфигураций.СписокВыбора);		
		Кэш.Вставить("Конфигурация", ДанныеКонфигураций.СтруктураКонфигураций);
		Конфигурация = Конфигурация;//Это имеет смысл, т.к. обновляет список выбора значением.
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Конфигурация) Тогда 
		
		ПрефиксСервис = Кэш.КэшНастроек.ПараметрыНастроек.ПрефиксСервис;
		ЗначениеПредставление = Новый Структура("ЗначениеПредставление", "Представление");
		Префикс = Кэш.ФормаНастроекОбщее.ПолучитьМассивФайловДляКонфигурации(СписокТиповНастроек, ПрефиксСервис, ЗначениеПредставление);
		
		Конфигурация = Кэш.ФормаНастроекОбщее.ОпределитьТипНастроекПоПрефиксу(Кэш.КэшНастроек.ПараметрыНастроек.ПрефиксСервис, Префикс);
	КонецЕсли;
	
	Если Не (ТипЗнч(УстановленныеИниФайлы) = Тип("Структура") И	УстановленныеИниФайлы.Свойство("СписокФайлов", СписокИниФайлыПрименить)) Тогда
		СписокИниФайлыПрименить = УстановленныеИниФайлы;
	КонецЕсли;                                                                                                       
	
	//Обновим таблицу доступных инишек
	Если	Кэш.Свойство("Конфигурация") Тогда
		
		Если СписокИниФайлыПрименить = Неопределено Тогда
			СписокИниФайлыПрименить = ТабУстановленныеИниФайлы;
		КонецЕсли;                                           
		
		СтруктураКонфигурации	= Кэш.ФормаНастроек.сбисПолучитьСтруктуруКонфигурации(Кэш, Кэш.Конфигурация, Конфигурация);
		ДоступныеИниФайлы		= Кэш.ФормаНастроекОбщее.СформироватьМассивТабДоступныеИниФайлыОбновить(СтруктураКонфигурации, СписокИниФайлыПрименить);
	Иначе
		ДоступныеИниФайлы = Новый Массив();
	КонецЕсли;
	
	ОбновитьПоляФормы(Новый Структура("ТабДоступныеИниФайлы", ДоступныеИниФайлы));
	
	//Если есть чем, то установленных инишек
	Если Не	УстановленныеИниФайлы = Неопределено Тогда
		ОбновитьПоляФормы(Новый Структура("ТабУстановленныеИниФайлы", СписокИниФайлыПрименить));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СбисОбновитьОтображение(ПараметрыОбновления=Неопределено, ДопПараметры=Неопределено)
	Перем УстановленныеИниФайлы;

	Если    	ПараметрыОбновления = Неопределено
		Или	Не	ПараметрыОбновления.Свойство("УстановленныеИни", УстановленныеИниФайлы) Тогда
		
		ВыбранныеНастройки		= Кэш.КэшНастроек.ВыбранныеНастройки;
		ОписаниеИни				= МодульОбъектаКлиент().КоннекшенSABY_Получить(ВыбранныеНастройки, "ОписаниеИни");
		УстановленныеИниФайлы	= ОписаниеИни.Установлены;
		
	КонецЕсли;
	
	СбисОбновитьТаблицыИниФайлов(УстановленныеИниФайлы);
	СбисОбновитьЭлементы_РазделНастроек();
	
КонецПроцедуры

//Процедура управляет отображением элементов на вкладке файлов настроек
&НаКлиенте
Процедура СбисОбновитьЭлементы_РазделНастроек()
	
	Перем ОсновнойЭлементПанелиДействий, ТипНастроек, ВыбраныНастройки;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ГруппаДействияНастройкиЛево").Видимость 
						= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ДоступныСерверныеНастройки");
	
	СпособХраненияНастроек = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("СпособХраненияНастроек");
	КаталогНастроек        = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("КаталогНастроек");
	
	ОбычнаяФорма = Не Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение;
	АктивныСерверныеНастройки	= СпособХраненияНастроек	= 1;
	ВидимыОпцииПереносаНастроек	= Истина;
	ЗаголовокНазвания = ?(АктивныСерверныеНастройки, "Выбранные настройки", "Каталог настроек");
	ЗаголовокНазвания = ЗаголовокНазвания + ?(ОбычнаяФорма, ":", "");
	ДобавитьКЗаголовку = "";
	
	Если	Кэш.КэшНастроек.Свойство("ВыбранныеНастройки", ВыбраныНастройки)
		И	ВыбраныНастройки.ПараметрыРаботы.Свойство("ТипНастроек", ТипНастроек) Тогда
		
		ДобавитьКЗаголовку = ?(ТипНастроек = Неопределено, "", ТипНастроек);
		
		Если Кэш.ФормаНастроек.ЕстьИзмененияНастроек(Кэш) Тогда
			ДобавитьКЗаголовку = ДобавитьКЗаголовку + "*";
		КонецЕсли;
		
		НастройкиНазвание = ВыбраныНастройки.Название;
		
	КонецЕсли;
	
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда	
		Если АктивныСерверныеНастройки Тогда
			СтраницаПутиКНастройкам = "СтраницаНастройкиНазвание";
		Иначе	
			СтраницаПутиКНастройкам = "СтраницаКаталогНастроек";
		КонецЕсли;  
		ОтображениеНастроек = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ГруппаПутьКНастройкам");
		ОтображениеНастроек.ТекущаяСтраница = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ОтображениеНастроек, СтраницаПутиКНастройкам);
	#Иначе
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "КаталогНастроек").Видимость	= Не АктивныСерверныеНастройки;
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "НастройкиНазвание").Видимость	= АктивныСерверныеНастройки;
	#КонецЕсли
	
	ЭлементДействия = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДействияСНастройками");
	ЭлементДействие_СохранитьИзменения	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭлементДействия, "ДействияСНастройками_СохранитьИзменения");
	ЭлементДействие_ПеречитатьНастройки	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭлементДействия, "ДействияСНастройками_ПеречитатьНастройки");
	ЭлементДействие_ЗагрузитьИзКаталога	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭлементДействия, "ДействияСНастройками_ЗагрузитьИзКаталога");
	ЭлементДействие_ВыгрузитьВКаталог	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭлементДействия, "ДействияСНастройками_ВыгрузитьВКаталог");
	ЭлементДействие_ОтключитьДоработки	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭлементДействия, "ДействияСНастройками_ОтключитьДоработки");
	ЭлементДействие_ВключитьДоработки	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭлементДействия, "ДействияСНастройками_ВключитьДоработки");
	
	ЕстьДоработки		= МодульОбъектаКлиент().КоннекшенSABY_Получить(ВыбраныНастройки, "ЕстьДоработки");
	ВключеныДоработки	= Не МодульОбъектаКлиент().КоннекшенSABY_Получить(ВыбраныНастройки, "ОтключеныДоработки");
	
	// Пока отключено.
	ЕстьДоработки = Ложь;
	
	Если АктивныСерверныеНастройки Тогда
		
		ОсновнойЭлементПанелиДействий	= ЭлементДействие_СохранитьИзменения;
		ЗаголовокДействиеЗагрузить		= "Загрузить настройки из каталога";
		ЗаголовокДействиеВыгрузить		= "Выгрузить настройки в каталог";
		
	ИначеЕсли	Не Кэш.ПараметрыСистемы.Конфигурация.Файловая
			И	Не ОбычнаяФорма Тогда
			
		ОсновнойЭлементПанелиДействий	= ЭлементДействие_ЗагрузитьИзКаталога;
		ЗаголовокДействиеЗагрузить		= "Перенести настройки из каталога на сервер";
		ЗаголовокДействиеВыгрузить		= "Получить настройки с сервера в каталог";
		
	Иначе
		
		ВидимыОпцииПереносаНастроек = Ложь;
		Если	ЕстьДоработки Тогда
		
			Если ВключеныДоработки Тогда

				ОсновнойЭлементПанелиДействий = ЭлементДействие_ОтключитьДоработки;
				
			Иначе
				
				ОсновнойЭлементПанелиДействий = ЭлементДействие_ВключитьДоработки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОсновнойЭлементПанелиДействий = Неопределено Тогда
		
		ЭлементДействия.Видимость = Ложь;
		
		Если ОбычнаяФорма Тогда
			//TODO спилить отдельную кнопку и сделать как на УФ, от панели
			МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДействияСНастройками_СохранитьИзменения").Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		
		ЭлементДействия.Видимость = Истина;
		
		Если ОбычнаяФорма Тогда
			МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДействияСНастройками_СохранитьИзменения").Видимость = Истина; 
		Иначе
			
			ЭлементДействие_СохранитьИзменения.Видимость	= АктивныСерверныеНастройки;
			ЭлементДействие_ПеречитатьНастройки.Видимость	= АктивныСерверныеНастройки;
			ЭлементДействие_ЗагрузитьИзКаталога.Видимость	= ВидимыОпцииПереносаНастроек;
			ЭлементДействие_ВыгрузитьВКаталог.Видимость		= ВидимыОпцииПереносаНастроек;

			ЭлементДействие_ЗагрузитьИзКаталога.Заголовок	= ЗаголовокДействиеЗагрузить;
			ЭлементДействие_ВыгрузитьВКаталог.Заголовок		= ЗаголовокДействиеВыгрузить;
			
			ЭлементДействия.Заголовок	= ОсновнойЭлементПанелиДействий.Заголовок;
			ЭлементДействия.Картинка	= ОсновнойЭлементПанелиДействий.Картинка;   
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОписаниеЭлемента = Новый Структура("Форма, ЭлементВладелец, Путь", ЭтаФорма, ЭлементДействия);
	ИзменениеЭлемента = Новый Структура("Видимость", Ложь);

	ОписаниеЭлемента.Путь = "ДействияСНастройками_ОтключитьДоработки";
	ИзменениеЭлемента.Видимость = ЕстьДоработки И ВключеныДоработки;
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеЭлемента, ИзменениеЭлемента);
	
	ОписаниеЭлемента.Путь = "ДействияСНастройками_ВключитьДоработки";
	ИзменениеЭлемента.Видимость = ЕстьДоработки И Не ВключеныДоработки;
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеЭлемента, ИзменениеЭлемента);

	Если ОбычнаяФорма	Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "НадписьНастройки").Заголовок	= ЗаголовокНазвания + " " + ДобавитьКЗаголовку;
	ИначеЕсли АктивныСерверныеНастройки Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "НастройкиНазвание").Заголовок	= ЗаголовокНазвания + " " + ДобавитьКЗаголовку;
	КонецЕсли;
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
		ОбновитьОтображениеДанных();
	#КонецЕсли
КонецПроцедуры

 // Процедура проверяет структуру настроек, обновляет данные на форме об установленных настройках	
&НаКлиенте
Процедура СбисОбновитьИнформациюНастроек(Кэш, УстановленныеИниФайлы = Неопределено, Отказ = Ложь) Экспорт
	
	СбисОбновитьОтображение();
		
КонецПроцедуры

&НаКлиенте
Процедура сбисПереключитьКонфигурацию(СтруктураКонфигурации, Кэш) Экспорт
	
	ДоступныеИниФайлы		= Кэш.ФормаНастроекОбщее.СформироватьМассивТабДоступныеИниФайлыОбновить(СтруктураКонфигурации, ТабУстановленныеИниФайлы);
	ОбновитьПоляФормы(Новый Структура("ТабДоступныеИниФайлы", ДоступныеИниФайлы));
	
КонецПроцедуры

//Нажатие на кнопку проверки настроек
&НаКлиенте
Процедура ПроверкаНастроекНажатие(Команда = Неопределено) 
	 
	Кэш.ФормаНастроек.ПараметрыРаботы.Вставить("ВыполнитьПроверку", Истина);
		
	Попытка
		СбисПолучитьИУстановитьНастройкиВКэш(Новый Структура("ПринудительнаяПроверка, ПродолжитьУстановку", Истина, Истина), Кэш); 	
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнфоОбОшибке, Новый Структура("ИмяКоманды", "ФайлНастроекОбщее.СбисПолучитьИУстановитьНастройкиВКэш"));
		
		Возврат;
	КонецПопытки;
	
	Модифицированность = Ложь;	
	
	Попытка
		СбисОбновитьТаблицыИниФайлов();
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнфоОбОшибке, Новый Структура("ИмяКоманды", "ФайлНастроекОбщее.СбисОбновитьТаблицыИниФайлов"));
		
		Возврат;
	КонецПопытки;
	
	Оповестить("ИзменилсяСоставФайловИни");
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСНастройками_ЗавершениеВызоваКоманды(РезультатКоманды, ДопПараметры) Экспорт
	
	// Обработка внешнего вызова
	Если Кэш = Неопределено Тогда 
		Кэш = ДопПараметры.Кэш;
	КонецЕсли;
		
	Кэш.ГлавноеОкно.СбисСпрятатьСостояние(); 
	Если ДопПараметры.Отказ Тогда
		Если ТипЗнч(РезультатКоманды) = Тип("Строка") Тогда
			РезультатКоманды = Кэш.ОбщиеФункции.СбисИсключение(РезультатКоманды, "ДействияСНастройками_ЗавершениеВызоваКоманды");
		КонецЕсли;
		Кэш.ГлавноеОкно.СбисСообщитьОбОшибке(Кэш, РезультатКоманды, Новый Структура("ФормаВладелец", Кэш.ФормаНастроекОбщее));
	ИначеЕсли ЗначениеЗаполнено(РезультатКоманды)
			И ТипЗнч(РезультатКоманды) = Тип("Строка") Тогда
		Если РезультатКоманды = "Отсутствуют файлы настроек для выгрузки." Тогда
			МодульОбъектаКлиент().СбисСообщить("Отсутствуют файлы настроек для выгрузки.");
		ИначеЕсли ДопПараметры.Тип = "Выгрузка" Тогда
			Сообщить("Файлы настроек успешно сохранены в каталог " + РезультатКоманды);
			Кэш.ГлавноеОкно.СбисОткрытьКаталог(РезультатКоманды);
		ИначеЕсли ДопПараметры.Тип = "Загрузка" Тогда
			Сообщить("Настройки успешно загружены из каталога " + РезультатКоманды);
			СбисОбновитьЭлементы_РазделНастроек();	
		ИначеЕсли ДопПараметры.Тип = "СборТехИнформации" Тогда
			#Если ВебКлиент Тогда
				Сообщить("Отсутствует возможность получения технической информации." + РезультатКоманды);
			#Иначе
				ИмяZip = Лев(РезультатКоманды, СтрДлина(РезультатКоманды) - 1) + ".zip"; 
				АрхивИнфо = Новый ЗаписьZipФайла(ИмяZip);
				АрхивИнфо.Добавить(РезультатКоманды, РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
				АрхивИнфо.Записать();
				УдалитьФайлы(РезультатКоманды); 
				Сообщить("Информация сохранена в " + ИмяZip);
			#КонецЕсли
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьПоляФормы(Знач СтруктураДляОбновленияФормы)

	Если ТипЗнч(СтруктураДляОбновленияФормы) = Тип("Структура") Тогда

		Для Каждого Элемент Из СтруктураДляОбновленияФормы Цикл
			
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				Если ТипЗнч(ЭтаФорма[Элемент.Ключ]) = Тип("ТаблицаЗначений") Тогда

					ЭтаФорма[Элемент.Ключ].Очистить();
					
					Если ЗначениеЗаполнено(Элемент.Значение) Тогда
						
						Для Каждого Строка Из Элемент.Значение Цикл
							СтрокаТаблицы = ЭтаФорма[Элемент.Ключ].Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Строка);		
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЕсли;
				
			#Иначе
				
				Если ТипЗнч(ЭтаФорма.РеквизитФормыВЗначение(Элемент.Ключ)) = Тип("ТаблицаЗначений") Тогда
					ТаблицаДанных = МассивСтруктурВТаблицуЗначений(Элемент.Значение);
					ЭтаФорма[Элемент.Ключ].Загрузить(ТаблицаДанных);
				КонецЕсли;  
				
			#КонецЕсли
			
		КонецЦикла
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция МассивСтруктурВТаблицуЗначений(МассивСтруктур)
	Результат = Новый ТаблицаЗначений;
	Если МассивСтруктур = Неопределено Или МассивСтруктур.Количество() = 0 Тогда
		Возврат Результат;
	Иначе 
		Образец = МассивСтруктур[0];
		Для Каждого  Стр из Образец Цикл
			Результат.Колонки.Добавить(Стр.Ключ );
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого Стр Из МассивСтруктур Цикл
		СтрТ = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТ, Стр);		
	КонецЦикла;
	Возврат Результат;
КонецФункции

