
&НаКлиенте
Процедура сбисПереключитьКонфигурацию(СтруктураКонфигурации, Кэш) Экспорт
	
	ДоступныеИниФайлы		= Кэш.ФормаНастроекОбщее.СформироватьМассивТабДоступныеИниФайлыОбновить(СтруктураКонфигурации, ТабУстановленныеИниФайлы);
	ОбновитьПоляФормы(Новый Структура("ТабДоступныеИниФайлы", ДоступныеИниФайлы));
	
КонецПроцедуры

//Процедура записывает в местный и глобальный кэш измененный параметр	
&НаКлиенте
Процедура ПараметрыПриИзменении(Элемент) Экспорт
	
	ПутьКДаннымФормы			= Сред(Элемент.Имя, Найти(Элемент.Имя, "_") + 1);
	Кэш.Парам[ПутьКДаннымФормы] = ЭтаФорма[ПутьКДаннымФормы]; 
	
КонецПроцедуры

&НаКлиенте
Процедура СпособХраненияНастроекПриИзменении(Элемент)
	
	// При изменении варианта хранения настроек	"перезапускаем" обработку
	ИзмениласьФормаНастроек = (Кэш.Парам.СпособХраненияНастроек <> СпособХраненияНастроек);
	Если	СпособХраненияНастроек	= 0				Тогда
		
		ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
		ДиалогОткрытия.Каталог = КаталогНастроек;
		ДиалогОткрытия.Заголовок = "Выберите каталог"; 
		
		Если ДиалогОткрытия.Выбрать() Тогда 
			
			КаталогНастроек = ДиалогОткрытия.Каталог;
			МодульОбъектаКлиент().ИзменитьПараметрПользователя("КаталогНастроек", КаталогНастроек);
			
		Иначе//Вернуть как было
			
			СпособХраненияНастроек	= Кэш.Парам.СпособХраненияНастроек;
			Возврат;
			
		КонецЕсли; 
		
		ПараметрыПриИзменении(Элемент);
		ПараметрыИнтеграции = Новый Структура("АдресСервера, СпособОбмена, СпособХраненияНастроек, ВремяОжиданияОтвета", Кэш.СБИС.АдресСервера);
		ЗаполнитьЗначенияСвойств(ПараметрыИнтеграции, Кэш.Парам);
		Кэш.ГлавноеОкно.ПерезапуститьГлавноеОкно(ПараметрыИнтеграции, Ложь, ИзмениласьФормаНастроек);
		
	ИначеЕсли	СпособХраненияНастроек	= 1
			И	МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ДоступныСерверныеНастройки") Тогда
			
		ПараметрыПриИзменении(Элемент);
		ПараметрыИнтеграции = Новый Структура("АдресСервера, СпособОбмена, СпособХраненияНастроек, ВремяОжиданияОтвета", Кэш.СБИС.АдресСервера);
		ЗаполнитьЗначенияСвойств(ПараметрыИнтеграции, Кэш.Парам);
		Кэш.ГлавноеОкно.ПерезапуститьГлавноеОкно(ПараметрыИнтеграции, Ложь, ИзмениласьФормаНастроек);
		
	Иначе
		
		ТекстСообщения	= "Хранение настроек на сервере не доступно для выбранного способа обмена!";
		ТаймАут			= 60;
		ТекстЗаголовка	= "Невозможно изменить способ хранения настроек!";
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Предупреждение(ТекстСообщения, ТаймАут, ТекстЗаголовка);
		#Иначе
			ПоказатьПредупреждение(,ТекстСообщения, ТаймАут, ТекстЗаголовка);
		#КонецЕсли
		
		СпособХраненияНастроек	= 0;
		ПараметрыПриИзменении(Элемент);
	КонецЕсли;
	
	сбисОбновитьЭлементы_РазделНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНастроекНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОтказОтВыбора = Ложь;
	КаталогНастроек = Кэш.ГлавноеОкно.сбисВыбратьКаталог(КаталогНастроек, ОтказОтВыбора);
	Если Не ОтказОтВыбора Тогда
		КаталогНастроекПриИзменении();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогНастроекОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Кэш.ГлавноеОкно.сбисОткрытьКаталог(КаталогНастроек);

КонецПроцедуры

 &НаКлиенте
Процедура КаталогНастроекПриИзменении(Элемент = Неопределено) Экспорт
	
	ПараметрыПриИзменении(Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "КаталогНастроек"));
	Кэш.Парам.ИдентификаторНастроек = Кэш.ФормаНастроек.сбисПолучитьИдентификаторНастроек(Кэш);		
	ПроверкаНастроекНажатие();
	СбисОбновитьОтображение();

КонецПроцедуры 

&НаКлиенте				   
Процедура НастройкиНазваниеПриИзменении(Элемент)
	
	Кэш.КэшНастроек.ИзмененияВНастройках = Истина;
	Кэш.КэшНастроек.ВыбранныеНастройки.Название	= НастройкиНазвание;
	сбисОбновитьЭлементы_РазделНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиНазваниеНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Кэш.ФормаНастроек.сбисВыбратьСоединение(Кэш);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиАвтообновлениеПриИзменении(Элемент)
	Кэш.ФормаНастроек.АвтообновлениеПриИзменении(Кэш, НастройкиАвтообновление);
	СбисОбновитьЭлементы_РазделНастроек();
КонецПроцедуры 

//Нажатие на кнопку проверки настроек
&НаКлиенте
Процедура ПроверкаНастроекНажатие(Команда = Неопределено) 
	 
	Кэш.ФормаНастроек.ПараметрыРаботы.Вставить("ВыполнитьПроверку", Истина);
	Попытка
		СбисПолучитьИУстановитьНастройкиВКэш(Новый Структура("ПринудительнаяПроверка, ПродолжитьУстановку", Истина, Истина), Кэш); 
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнфоОбОшибке, Новый Структура("ИмяКоманды", "ФайлНастроекОбщее.СбисПолучитьИУстановитьНастройкиВКэш"));
	КонецПопытки;    
	Модифицированность = Ложь;
	
	СбисОбновитьТаблицыИниФайлов();
	Оповестить("ИзменилсяСоставФайловИни");
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСНастройками_ЗагрузитьИзКаталогаНажатие(Команда)
	
	ДопПараметры = Новый Структура("Кэш, Отказ, ОбновитьСоставНастроек, Тип", Кэш, Ложь, Ложь, "Загрузка");
	ОписаниеЗавершения = Кэш.ОбщиеФункции.СбисОписаниеОповещения(Кэш, "ДействияСНастройками_ЗавершениеВызоваКоманды", ЭтаФорма, ДопПараметры);
	Кэш.ФормаНастроек.СбисЗагрузитьНастройкиИзКаталога(Кэш, Новый Структура("Кэш, ОписаниеОповещенияОЗавершении", Кэш, ОписаниеЗавершения));
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСНастройками_ВыгрузитьВКаталогНажатие(Команда)
	
	ДопПараметры = Новый Структура("Кэш, Отказ, ОбновитьСоставНастроек, Тип", Кэш, Ложь, Ложь, "Выгрузка");
	ОписаниеЗавершения = Кэш.ОбщиеФункции.СбисОписаниеОповещения(Кэш, "ДействияСНастройками_ЗавершениеВызоваКоманды", ЭтаФорма, ДопПараметры);
	Кэш.ФормаНастроек.СбисВыгрузитьНастройкиВКаталог(Кэш, Новый Структура("Кэш, ОписаниеОповещенияОЗавершении", Кэш, ОписаниеЗавершения));
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСНастройками_СохранитьИзмененияНастроекНажатие(Команда)
	
	ПараметрыЗаписи = Новый Структура("Отказ, ПродолжитьВыполнение", Ложь, Истина);
	Кэш.ФормаНастроек.СбисСохранитьВыбранныеНастройки(Кэш, ПараметрыЗаписи);
	СбисОбновитьОтображение();  
		
КонецПроцедуры   

&НаКлиенте
Процедура ДействияСНастройками_ПеречитатьНастройки(Команда)

	ПараметрыПеречитать = Новый Структура("Элемент", Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "ДействияСНастройками_ПеречитатьНастройки"));
	Кэш.ФормаНастроек.СбисПеречитатьНастройки(ПараметрыПеречитать, Кэш);
	
КонецПроцедуры  

&НаКлиенте
Процедура ДействияСНастройками_ЗавершениеВызоваКоманды(РезультатКоманды, ДопПараметры) Экспорт
	
	// Обработка внешнего вызова
	Если Кэш = Неопределено Тогда 
		Кэш = ДопПараметры.Кэш;
	КонецЕсли;
		
	Кэш.ГлавноеОкно.СбисСпрятатьСостояние(); 
	Если ДопПараметры.Отказ Тогда
		Если ТипЗнч(РезультатКоманды) = Тип("Строка") Тогда
			РезультатКоманды = Кэш.ОбщиеФункции.СбисИсключение(РезультатКоманды, "ДействияСНастройками_ЗавершениеВызоваКоманды");
		КонецЕсли;
		Кэш.ГлавноеОкно.СбисСообщитьОбОшибке(Кэш, РезультатКоманды, Новый Структура("ФормаВладелец", Кэш.ФормаНастроекОбщее));
	ИначеЕсли ЗначениеЗаполнено(РезультатКоманды)
			И ТипЗнч(РезультатКоманды) = Тип("Строка") Тогда
		Если РезультатКоманды = "Отсутствуют файлы настроек для выгрузки." Тогда
			МодульОбъектаКлиент().СбисСообщить("Отсутствуют файлы настроек для выгрузки.");
		ИначеЕсли ДопПараметры.Тип = "Выгрузка" Тогда
			Сообщить("Файлы настроек успешно сохранены в каталог " + РезультатКоманды);
			Кэш.ГлавноеОкно.СбисОткрытьКаталог(РезультатКоманды);
		ИначеЕсли ДопПараметры.Тип = "Загрузка" Тогда
			Сообщить("Настройки успешно загружены из каталога " + РезультатКоманды);
			СбисОбновитьЭлементы_РазделНастроек();	
		ИначеЕсли ДопПараметры.Тип = "СборТехИнформации" Тогда
			#Если ВебКлиент Тогда
				Сообщить("Отсутствует возможность получения технической информации." + РезультатКоманды);
			#Иначе
				ИмяZip = Лев(РезультатКоманды, СтрДлина(РезультатКоманды) - 1) + ".zip"; 
				АрхивИнфо = Новый ЗаписьZipФайла(ИмяZip);
				АрхивИнфо.Добавить(РезультатКоманды, РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
				АрхивИнфо.Записать();
				УдалитьФайлы(РезультатКоманды); 
				Сообщить("Информация сохранена в " + ИмяZip);
			#КонецЕсли
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// процедура устанавливает файлы настроек, выбранные в списке доступных настроек	
&НаКлиенте
Процедура УстановитьНастройки(Команда)
	
	сбисУстановитьФайлыНастроек(Кэш);
	
КонецПроцедуры
 
