
&НаКлиенте
Процедура ПередЗакрытиемОбработчик(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка = Истина)
	
	Если ПараметрыФормы.РежимЗакрытия = "ЗавершениеРаботы" Тогда
		
		Возврат;

	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Не Кэш.КэшНастроек.ИниВПорядке Тогда
		ОбработчикДиалога = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПередЗакрытием_ПослеДиалога", ЭтаФорма, Новый Структура("Режим", "Завершить"));
		ТекстВопроса = "Обнаружены ошибки в файлах настроек.
		|Без их исправления дальнейшая работа невозможна.";
		МодульОбъектаКлиент().СбисПоказатьВопрос(ОбработчикДиалога, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Завершить работу?");
		Отказ = Истина;
		Возврат;
	ИначеЕсли Кэш.ФормаНастроек.ЕстьИзмененияНастроек(Кэш) Тогда
		ОбработчикДиалога = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПередЗакрытием_ПослеДиалога", ЭтаФорма, Новый Структура("Режим", "Сохранить"));
		Если Кэш.ФормаНастроек.СбисПолучитьИдентификаторНастроек(Кэш) = МодульОбъектаКлиент().ПолучитьИдКоннекшена() Тогда
			МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(КодВозвратаДиалога.Да, ОбработчикДиалога);
		Иначе	
			МодульОбъектаКлиент().СбисПоказатьВопрос(ОбработчикДиалога, "Сохранить изменения в настройках?", РежимДиалогаВопрос.ДаНетОтмена,,,"Рекомендуется сохранить внесенные изменения.");	
		КонецЕсли;

		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонфигурацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ПараметрыРаботы.Вставить("КонфигурацияБыла", Конфигурация);

КонецПроцедуры

&НаКлиенте
Процедура КонфигурацияПриИзменении(Элемент)
	
	ПараметрыКонфигурации	= НайтиВыбраннуюКонфигурациюНастроек(Кэш.Конфигурация, Конфигурация);
	ОбработчикЗавершения	= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("КонфигурацияПриИзменении_Завершение", ЭтаФорма, Новый Структура("Кэш, Отказ", Кэш, Ложь));
	Кэш.ФормаНастроек.КонфигурацияПриИзменении(Новый Структура("Конфигурация, ОбработчикЗавершения", ПараметрыКонфигурации, ОбработчикЗавершения), Кэш);
	                                    
КонецПроцедуры

//Процедура записывает в местный и глобальный кэш измененный параметр	
&НаКлиенте
Процедура ПараметрыПриИзменении(Элемент) Экспорт
	
	ПутьКДаннымФормы			= Сред(Элемент.Имя, Найти(Элемент.Имя, "_") + 1);
	Кэш.Парам[ПутьКДаннымФормы] = ЭтаФорма[ПутьКДаннымФормы]; 
	
КонецПроцедуры

&НаКлиенте
Процедура СпособХраненияНастроекПриИзменении(Элемент)
	
	// При изменении варианта хранения настроек	"перезапускаем" обработку
	ИзмениласьФормаНастроек = (Кэш.Парам.СпособХраненияНастроек <> СпособХраненияНастроек);
	Если	СпособХраненияНастроек	= 0				Тогда
		
		ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
		ДиалогОткрытия.Каталог = КаталогНастроек;
		ДиалогОткрытия.Заголовок = "Выберите каталог"; 
		
		Если ДиалогОткрытия.Выбрать() Тогда 
			
			КаталогНастроек = ДиалогОткрытия.Каталог;
			МодульОбъектаКлиент().ИзменитьПараметрПользователя("КаталогНастроек", КаталогНастроек);
			
		Иначе//Вернуть как было
			
			СпособХраненияНастроек	= Кэш.Парам.СпособХраненияНастроек;
			Возврат;
			
		КонецЕсли; 
		
		ПараметрыПриИзменении(Элемент);
		ПараметрыИнтеграции = Новый Структура("АдресСервера, СпособОбмена, СпособХраненияНастроек, ВремяОжиданияОтвета", Кэш.СБИС.АдресСервера);
		ЗаполнитьЗначенияСвойств(ПараметрыИнтеграции, Кэш.Парам);
		Кэш.ГлавноеОкно.ПерезапуститьГлавноеОкно(ПараметрыИнтеграции, Ложь, ИзмениласьФормаНастроек);
		
	ИначеЕсли	СпособХраненияНастроек	= 1
			И	МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ДоступныСерверныеНастройки") Тогда
			
		ПараметрыПриИзменении(Элемент);
		ПараметрыИнтеграции = Новый Структура("АдресСервера, СпособОбмена, СпособХраненияНастроек, ВремяОжиданияОтвета", Кэш.СБИС.АдресСервера);
		ЗаполнитьЗначенияСвойств(ПараметрыИнтеграции, Кэш.Парам);
		Кэш.ГлавноеОкно.ПерезапуститьГлавноеОкно(ПараметрыИнтеграции, Ложь, ИзмениласьФормаНастроек);
		
	Иначе
		
		ТекстСообщения	= "Хранение настроек на сервере не доступно для выбранного способа обмена!";
		ТаймАут			= 60;
		ТекстЗаголовка	= "Невозможно изменить способ хранения настроек!";
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Предупреждение(ТекстСообщения, ТаймАут, ТекстЗаголовка);
		#Иначе
			ПоказатьПредупреждение(,ТекстСообщения, ТаймАут, ТекстЗаголовка);
		#КонецЕсли
		
		СпособХраненияНастроек	= 0;
		ПараметрыПриИзменении(Элемент);
	КонецЕсли;
	
	сбисОбновитьЭлементы_РазделНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНастроекНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОтказОтВыбора = Ложь;
	КаталогНастроек = Кэш.ГлавноеОкно.сбисВыбратьКаталог(КаталогНастроек, ОтказОтВыбора);
	Если Не ОтказОтВыбора Тогда
		КаталогНастроекПриИзменении();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогНастроекОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Кэш.ГлавноеОкно.сбисОткрытьКаталог(КаталогНастроек);

КонецПроцедуры

 &НаКлиенте
Процедура КаталогНастроекПриИзменении(Элемент = Неопределено) Экспорт
	
	Если Не КаталогНастроек = "" Тогда
		
		// Пустой каталог, установка по-умолчанию.
		Попытка
			
			ИдНастроекНовый = Кэш.ФормаНастроек.ПроверитьИдентификаторНастроек(КаталогНастроек);
			
		Исключение
			
			МодульОбъектаКлиент().СбисСообщить(ИнформацияОбОшибке(), "ФайлыНастроекОбщее.КаталогНастроекПриИзменении");
			Возврат;
			
		КонецПопытки;
		
		КаталогНастроек = ИдНастроекНовый;
		
	КонецЕсли;
	
	МодульОбъектаКлиент().ИзменитьПараметрSABY("КаталогНастроек", КаталогНастроек);
	
	// Обновить каталог после изменения, т.к. он может быть отформатирован
	КаталогНастроек = МодульОбъектаКлиент().ПараметрSABY("КаталогНастроек", "Пользователь");
	
	УстановленныеНастройки = Кэш.КэшНастроек.ВыбранныеНастройки;
	МодульОбъектаКлиент().КоннекшенSABY_Установить(УстановленныеНастройки, "Идентификатор", КаталогНастроек);
	МодульОбъектаКлиент().КоннекшенSABY_Очистить(УстановленныеНастройки, "Данные");
	МодульОбъектаКлиент().КоннекшенSABY_Очистить(УстановленныеНастройки, "ОписаниеИни");

	ПроверкаНастроекНажатие();
	СбисОбновитьОтображение();

КонецПроцедуры 

&НаКлиенте				   
Процедура НастройкиНазваниеПриИзменении(Элемент)
	
	Кэш.КэшНастроек.ИзмененияВНастройках = Истина;
	Кэш.КэшНастроек.ВыбранныеНастройки.Название	= НастройкиНазвание;
	сбисОбновитьЭлементы_РазделНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиНазваниеНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Кэш.ФормаНастроек.сбисВыбратьСоединение(Кэш);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиАвтообновлениеПриИзменении(Элемент)
	Кэш.ФормаНастроек.АвтообновлениеПриИзменении(Кэш, НастройкиАвтообновление);
	СбисОбновитьЭлементы_РазделНастроек();
КонецПроцедуры 

