
// Функция - Получить структура мастер фильтра
//
// Параметры:
//  ДопПараметры - Структура - Набор полей, работа с которыми может расширить результат работы функции 
// 
// Возвращаемое значение:
//  Структура - Результат вызова.
//
&НаКлиенте
Функция ПолучитьСтруктураМастерФильтра(ДопПараметры = Неопределено) Экспорт
	
	Кэш = ГлавноеОкно.Кэш; 
	МодульИнтеграции = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция");
	
	ПараметрыВызова = Новый Структура;  
	 
	ФлагОшибки = Ложь;  
	
	РезультатВызова = МодульИнтеграции.ExtSysOrders_MasterFilter(ПараметрыВызова, Новый Структура("Кэш", Кэш), ФлагОшибки); 
	
	Если ФлагОшибки Тогда   
		
		ВызватьИсключение СбисИсключение_Представление(РезультатВызова); 
		
	КонецЕсли;   
	
	Возврат РезультатВызова;
	
КонецФункции  

// Процедура - формирует структуру дополнительного аккордеона
//
// Параметры:
//  Аккордеон	 - Структура - Набор параметров для формирования аккордеона
//  ДопПараметры - Структура - Набор полей, работа с которыми может расширить результат работы функции 
//
&НаКлиенте
Процедура СформироватьСтруктуруДополнительногоАккордеона(Аккордеон, ДопПараметры = Неопределено) Экспорт     
			
	ВыбранныйРаздел = "Все"; 
	ПараметрыФильтрации = Новый Соответствие;
	
	СтруктураАккордеона = "{""accordion"": [";  
	
	Если ЗначениеЗаполнено(Аккордеон) Тогда   
		
		ОбработатьСтруктуруДополнительногоАккордеона(Аккордеон, СтруктураАккордеона, ПараметрыФильтрации, ДопПараметры);
		
	КонецЕсли;  
	
	СтруктураАккордеона = СтруктураАккордеона+"]";
	СтруктураАккордеона = СтрЗаменить(СтруктураАккордеона, ",]", "]");
	СтруктураАккордеона = СтрЗаменить(СтруктураАккордеона, "boolparent", "parent@"); //символ "@" не может быть в ключе структуры		
	СтруктураАккордеона = СтруктураАккордеона + ", ""selectedItem"":"""+ВыбранныйРаздел+"""";    
	СтруктураАккордеона = СтруктураАккордеона + ", ""appName"":""PIXEL""";      //выводим пустой пиксель 
	СтруктураАккордеона = СтруктураАккордеона + ", ""marginTop"":""0px""}";      //высота блока с птичкой
	
	ИмяМакета = "Аккордеон83";
	ПредставлениеАккордеона = МодульОбъектаКлиент().ПолучитьМакетОбработки(ИмяМакета, Новый Структура("Текст", Истина));

	сбисТекстHTML = СтрЗаменить(ПредставлениеАккордеона, "%accordion%", СтруктураАккордеона);
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(Новый ФиксированнаяСтруктура("Форма, Реквизит", ГлавноеОкно, "АккордеонДополнительныйHTML"),
														Новый ФиксированнаяСтруктура("HTML", сбисТекстHTML));     
														
	ГлавноеОкно.АккордеонДополнительный = Новый Структура("ПараметрыФильтрации", ПараметрыФильтрации);
															
КонецПроцедуры 

// Процедура - Обработать структуру дополнительного аккордеона
//
// Параметры:
//  Аккордеон			 - Структура	- Набор параметров для формирования аккордеона 
//  СтруктураАккордеона	 - Строка		- Строка для формирования JSON
//  ПараметрыФильтрации	 - Соответствие	- Набор полей для фильтрации реестра документа
//  ДопПараметры		 - Структура	- Набор полей, работа с которыми может расширить результат работы функции 
//
&НаКлиенте
Процедура ОбработатьСтруктуруДополнительногоАккордеона(Аккордеон, СтруктураАккордеона, ПараметрыФильтрации, ДопПараметры = Неопределено)    
	
	Перем СостояниеСобытий, ФильтрИдФазы;
	
	Кэш = ГлавноеОкно.Кэш;
	КлючРодителя = 1;  

	ЗаменаИдентификаторов = Новый Соответствие;
	Индекс = 1;
	
	Для Каждого КлючИЗначениеАккордеон Из Аккордеон Цикл  
				
		ЗаменаИдентификаторов.Вставить(КлючИЗначениеАккордеон.id, Индекс);

		КлючИЗначениеАккордеон.id = Строка(Формат(КлючИЗначениеАккордеон.id, "ЧГ=")); 
		КлючИЗначениеАккордеон.Вставить("filter_id", КлючИЗначениеАккордеон.id);
		КлючИЗначениеАккордеон.id = Строка(Индекс);
		Индекс = Индекс + 1;
		КлючИЗначениеАккордеон.parent_id = ЗаменаИдентификаторов.Получить(КлючИЗначениеАккордеон.parent_id);

		Если КлючИЗначениеАккордеон.title = "Все" 
			Или НЕ ЗначениеЗаполнено(КлючИЗначениеАккордеон.parent_id)
			Или ЗначениеЗаполнено(КлючИЗначениеАккордеон.regulation_id) Тогда  
			
			Продолжить; 
			
		КонецЕсли;    
		
		СтруктураФильтрации = Новый Структура;
		
		Если КлючИЗначениеАккордеон.parent_id = КлючРодителя Тогда
			
			КлючИЗначениеАккордеон.Вставить("level", 1);  
			КлючИЗначениеАккордеон.Вставить("boolparent", Истина);   
			КлючИЗначениеАккордеон.Вставить("action", Истина);
						
		Иначе 
			
			КлючИЗначениеАккордеон.Вставить("level", 2); 
			КлючИЗначениеАккордеон.Вставить("parent", Строка(Формат(КлючИЗначениеАккордеон.parent_id, "ЧГ=")));  
			КлючИЗначениеАккордеон.Вставить("action", Истина); 
						
		КонецЕсли;   
		
		Если КлючИЗначениеАккордеон.Свойство("filter")
			И КлючИЗначениеАккордеон.filter.Свойство("СостояниеСобытий") Тогда
			
			СостояниеСобытий = КлючИЗначениеАккордеон.filter.СостояниеСобытий;    
			СтруктураФильтрации.Вставить("СостояниеСобытий",СостояниеСобытий); 
			
		КонецЕсли;   
		  
		Если КлючИЗначениеАккордеон.Свойство("stage_id") 
			И ЗначениеЗаполнено(КлючИЗначениеАккордеон.stage_id) Тогда 
			
			ФильтрИдФазы = КлючИЗначениеАккордеон.stage_id[0];   	
			СтруктураФильтрации.Вставить("ФильтрИдФазы",ФильтрИдФазы);
			
		КонецЕсли; 
		
		ПараметрыФильтрации.Вставить(КлючИЗначениеАккордеон.id, СтруктураФильтрации);
		
		СтруктураАккордеона = СтруктураАккордеона + Кэш.РаботаСJSON.ПреобразоватьЗначениеВJSON(КлючИЗначениеАккордеон) + ",";  
		
	КонецЦикла;	
	
КонецПроцедуры 

// Процедура - Обрабатывает клик по пунктам дополнительного аккордеона
//
// Параметры:
//  ИмяДействия	 - Строка	 - действие
//  ИДКнопки	 - Строка	 - идентификатор пункта
//
&НаКлиенте
Процедура ОбработатьДействиеДополнительногоАккордеона(ИмяДействия, ИДКнопки) Экспорт
	
	Кэш = ГлавноеОкно.Кэш; 
	
	Отказ = Ложь; 
	
	Если ИмяДействия = "ADDON_NAVIGATE" Тогда  //обработать выбор раздела аккордеона
		Попытка 
			Если ПустаяСтрока(ИДКнопки) Тогда
				Возврат;
			КонецЕсли;
		Исключение
			ИнфоОбОшибке = ИнформацияОбОшибке();
			МодульОбъектаКлиент().СообщитьСбисИсключение(МодульОбъектаКлиент().НовыйСбисИсключение(ИнфоОбОшибке, "ГлавноеОкно.ОбработатьДействиеНаКлиенте."+ИмяДействия));
		КонецПопытки;
	Иначе
		Возврат;
	КонецЕсли;    
	
	ПараметрыФильтра = Новый Структура;
	
	Если ЗначениеЗаполнено(ГлавноеОкно.АккордеонДополнительный)
		И ГлавноеОкно.АккордеонДополнительный.Свойство("ПараметрыФильтрации")
		И ЗначениеЗаполнено(ГлавноеОкно.АккордеонДополнительный.ПараметрыФильтрации) Тогда
		СтруктураВыбора = ГлавноеОкно.АккордеонДополнительный.ПараметрыФильтрации.Получить(ИДКнопки);
		Если СтруктураВыбора.Свойство("СостояниеСобытий") Тогда
			ПараметрыФильтра.Вставить("СостояниеСобытий",СтруктураВыбора.СостояниеСобытий);
		КонецЕсли; 
		Если СтруктураВыбора.Свойство("ФильтрИдФазы") Тогда 
			МассивФаз = Новый Массив;
			МассивФаз.Добавить(СтруктураВыбора.ФильтрИдФазы);  
			ПараметрыФильтра.Вставить("ФильтрИдФазы",МассивФаз);
		КонецЕсли

	КонецЕсли; 
	
	ГлавноеОкно.АккордеонДополнительный.Вставить("ФильтрДляРаздела", ПараметрыФильтра);  
	
	СтруктураДляОбновленияФормы = Кэш.Текущий.Форма.ОбновитьКонтент(Кэш);
	ГлавноеОкно.ОбновитьПоляФормы(СтруктураДляОбновленияФормы);

КонецПроцедуры

