
&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыУстановки)
	
	Комментарий			= "";
	Исполнитель			= Неопределено;
	СоставПакета		= ПараметрыУстановки.СоставПакета;
	ВыбранноеДействие	= ПараметрыУстановки.ВыбранноеДействие;
	
	Переходы.Очистить();
	ИндексВставитьДобавить = 0;
	
	ЕстьАннулирование = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "МожноАннулировать");

	Если ЕстьАннулирование Тогда
		
		//Генерируем действие для Аннулирования.
		ДействиеАннулировать = Новый Структура(
			"Идентификатор,	Комментарий,Название,		ТребуетИсполнителя, ТребуетКомментария,	ТребуетПодписания,	ТребуетРасшифровки", 
			"",				"",			"Аннулировать",	"Нет",				"Да",				"Да",				"Нет");
		Переходы.Добавить(ДействиеАннулировать, ДействиеАннулировать.Название);
		ИндексВставитьДобавить = ИндексВставитьДобавить - 1;
		
	КонецЕсли;
	ЭтапыПакета = Неопределено;
	ПараметрыОтображения = Новый Структура("Заголовок, ИсполнительВидимость, ДатаПодробнееВидимость", "", Ложь, Ложь);
	Если СоставПакета.Свойство("Этап", ЭтапыПакета) Тогда
		ПараметрыОтображения.Заголовок = ЭтапыПакета[0].Название;		
		Если ЗначениеЗаполнено(ВыбранноеДействие) Тогда
			ПараметрыОтображения.ИсполнительВидимость = ВыбранноеДействие.ТребуетИсполнителя = "Да";
			Переходы.Вставить(Переходы.Количество() + ИндексВставитьДобавить, ВыбранноеДействие, ВыбранноеДействие.Название);	
		Иначе
			Для Каждого Действие Из ЭтапыПакета[0].Действие Цикл
				Если Действие.ТребуетИсполнителя = "Да" Тогда
					ПараметрыОтображения.ИсполнительВидимость = Истина;
				КонецЕсли;
				Если Действие.Название = "Утвердить" Тогда
					ПараметрыОтображения.ДатаПодробнееВидимость = Истина;
				КонецЕсли;
				Переходы.Вставить(Переходы.Количество() + ИндексВставитьДобавить, Действие, Действие.Название);
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ЕстьАннулирование Тогда
		
		ПараметрыОтображения.Заголовок = ДействиеАннулировать.Название;
		
	Иначе
		
		ПараметрыОтображения.Заголовок = "Отсутствуют доступные действия";
		
	КонецЕсли;
	
	Типы1С = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолей1С");
	Если	ПараметрыОтображения.ИсполнительВидимость
		И	Типы1С.Свойство("Исполнитель")	Тогда
		
		ЭлементОтветственный = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Исполнитель");
		ЧтоИзменить = Новый ФиксированнаяСтруктура("УстановитьОграничениеТипа", Типы1С.Исполнитель.ОписаниеТипа);
		МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ЭлементОтветственный, ЧтоИзменить);
		ПараметрыФормы.Вставить("ОтветственныйТип", Тип(Типы1С.Исполнитель.ТипыМассивСтрок[0]));

	КонецЕсли;
	
	ЭлементДатаПОлучить			= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДатаПолучения");
	ЭлементПодробнее			= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Подробнее");
	ЭлементПанельИсполнитель	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПанельИсполнитель");
	ЭлементПанельДатаПодробнее	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПанельДатаПодробнее");

	Если ПараметрыУстановки.СоставПакета.Тип = "ДокОтгрВх" Тогда
		ЭлементДатаПОлучить.Видимость = Истина;
		ЭлементПодробнее.Видимость = Истина;
		ДатаПолучения = ТекущаяДата();
	Иначе
		ЭлементДатаПОлучить.Видимость = Ложь;
		ЭлементПодробнее.Видимость = Ложь;
	КонецЕсли;
	
	ЭлементПанельИсполнитель.Видимость		= ПараметрыОтображения.ИсполнительВидимость; 
	ЭлементПанельДатаПодробнее.Видимость	= ПараметрыОтображения.ДатаПодробнееВидимость;
	Заголовок								= ПараметрыОтображения.Заголовок;
	
КонецПроцедуры

#Область include_core2_vo2_Формы_ФормаПереходы_СистемныйИнтерфейс_УстаревшееАПИВФК
#КонецОбласти

#Область include_core2_vo2_Формы_ФормаПереходы_СистемныйИнтерфейс_Обработчики
#КонецОбласти

