
// Область с АПИ обработки, например для использования в ВФК

// Функция - Скачать по ссылке в файл
//
// Параметры:
//  ПараметрыВходящие	 - Строка/Структура		 - Описание что скачиваем
//		Строка		 = полный УРЛ для скачивания
//		Структура	 = описание УРЛ
//			URLПолный: Строка	 - аналогично "Строка"
//			URL: Строка			 - УРЛ, требующие проверки и патча (по-возможности). Если не начинается на "https", до будет дополнен протоколом и серверем
//			Протокол: Строка	 - протокол для патча, если указан URL
//			Сервер: Строка		 - адрес сервера для патча, если указан URL.
//  ДопПараметры		 - Структура/Неопределено	 - Имя файла, куда сохранить. Если не указан, то будет создан новый временный файл.
//		ПолноеИмяФайла: Строка	 - Полный путь к файлу, куда нужно сохранить. Если не указано, будет создан новый временный файл
//		ИмяФайла: Строка		 - Указано имя файла для создания временного файла. Если не указано, то будет сгенерирован файл со случайным именем.
//		СоздаватьНовый: Булево	 - Принудительно указать пересоздание временного файла.
// 
// Возвращаемое значение:
//  Строка - Путь к файлу, куда скачано значение. При ошибке вызывается СбисИсключение.
//
&НаКлиенте
Функция СкачатьВФайлПоПараметрам(ПараметрыВходящие, ДопПараметры = Неопределено) Экспорт
	Перем UrlДляСкачивания, ИмяФайла, ПолноеИмяФайла, РасширениеФайла, СоздаватьНовый;
	
	Если ТипЗнч(ПараметрыВходящие) = Тип("Строка") Тогда
		
		UrlДляСкачивания = ПараметрыВходящие;
		
	ИначеЕсли 	ПараметрыВходящие.Свойство("URLПолный", UrlДляСкачивания) Тогда
		
		// Передан полный URL в явном виде
		
	ИначеЕсли	ПараметрыВходящие.Свойство("URL") Тогда
		
		Если Лев(ПараметрыВходящие.URL, 8) = "https://" Тогда
			
			// Передан готовый URL	
			UrlДляСкачивания = ПараметрыВходящие.URL;
				
		ИначеЕсли	ПараметрыВходящие.Свойство("Протокол")
				И	ПараметрыВходящие.Свойство("Сервер") Тогда
			
			UrlДляСкачивания = ПараметрыВходящие.Протокол + "://" + ПараметрыВходящие.Сервер + ПараметрыВходящие.URL;

		КонецЕсли;
		
	КонецЕсли;
	
	Если UrlДляСкачивания = Неопределено Тогда
		
		ВызватьИсключение "Ошибка в параметрах метода: СкачатьВФайлПоПараметрам - Отсутствует URL!";
		
	КонецЕсли;
		
	ПараметрыДляСкачать = Новый Структура("Ссылка, ИмяФайла", UrlДляСкачивания);
	Если ДопПараметры = Неопределено Тогда
		
		ПараметрыДляСкачать.ИмяФайла = НовыйВременныйФайлКлиент();
		
	ИначеЕсли ДопПараметры.Свойство("ПолноеИмяФайла", ПолноеИмяФайла) Тогда
		
		// На случай если необходимо сохранить не во временный файл.
		ПараметрыДляСкачать.ИмяФайла = ПолноеИмяФайла;
		
	Иначе
		
		ДопПараметры.Свойство("ИмяФайла",			ИмяФайла);
		ДопПараметры.Свойство("РасширениеФайла",	РасширениеФайла);
		
		Если Не ДопПараметры.Свойство("СоздаватьНовый", СоздаватьНовый) Тогда
			
			СоздаватьНовый = Ложь;
			
		КонецЕсли;
		
		ПараметрыДляСкачать.ИмяФайла = НовыйВременныйФайлКлиент(ИмяФайла, РасширениеФайла, , СоздаватьНовый);
		
	КонецЕсли;
	
	МодульСкачивания	= ПараметрSABY("Интеграция", "Сеанс");
	Кэш					= ПолучитьТекущийЛокальныйКэш();
	ОшибкаСкачивания	= Ложь;
	
	РезультатСкачивания = МодульСкачивания.СБИС_СохранитьПоСсылкеВФайл(Кэш, ПараметрыДляСкачать, Новый Структура, ОшибкаСкачивания);
	
	Если ОшибкаСкачивания Тогда
		
		ОшибкаСкачивания = НовыйСбисИсключение(РезультатСкачивания, "МодульОбъектаКлиент.СкачатьВФайлПоПараметрам");
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаСкачивания);
		
	КонецЕсли;
	
	Возврат ПараметрыДляСкачать.ИмяФайла
	
КонецФункции

//Процедура - показывает пользователю выбор по параметрам
//
// Параметры:
//  ПараметрыВыбораВходящие	 - Произвольный	 - что выбираем
//  ДопПараметры			 - Структура	 - расширение
//		Обработчик: СбисОписаниеОповещения описание функции/процедуры, в которую будет передан результат после выбора значения
//
&НаКлиенте
Процедура SABYВыбратьЗначение(ПараметрыВыбораВходящие, ДопПараметры) Экспорт
	Перем ОбработчикВыбора, ПараметрыОтбораВыбора;
	
	Если Не ДопПараметры.Свойство("Обработчик", ОбработчикВыбора) Тогда
		
		ВызватьИсключение "Не указан обработчик для обработки выбора значения!";
		
	КонецЕсли;
	
	Если Не ДопПараметры.Свойство("ПараметрыОтбораВыбора", ПараметрыОтбораВыбора) Тогда
		ПараметрыОтбораВыбора = Новый Структура;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыВыбораВходящие) = Тип("Тип") Тогда
		
		ТипСтрокой = СсылочныйТипСтрокой(ПараметрыВыбораВходящие);
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			МенеджерТипа	= МенеджерОбъектаПоИмени(ТипСтрокой);
			ФормаВыбора		= МенеджерТипа.ПолучитьФормуВыбора();
			
			Если ПараметрыОтбораВыбора.Свойство("ПараметрОтборПоВладельцу") Тогда
				ФормаВыбора.ПараметрОтборПоВладельцу = ПараметрыОтбораВыбора.ПараметрОтборПоВладельцу;
			КонецЕсли;
			Если ПараметрыОтбораВыбора.Свойство("ПараметрВыборПоВладельцу") Тогда
				ФормаВыбора.ПараметрВыборПоВладельцу = ПараметрыОтбораВыбора.ПараметрВыборПоВладельцу;
			КонецЕсли;
			
			Результат		= ФормаВыбора.ОткрытьМодально();
			ПодключитьОтложенноеДействие(ОбработчикВыбора, Результат);
			
		#Иначе
			
			ИмяФормыВыбора	= СтрЗаменить(ТипСтрокой, "Ссылка.", ".") + ".ФормаВыбора";
			
			Если ПараметрыОтбораВыбора.Свойство("ПараметрыФормы") Тогда
				ОткрытьФорму(ИмяФормыВыбора, ПараметрыОтбораВыбора.ПараметрыФормы, ЭтаФорма, , , , ОбработчикВыбора);	
			Иначе
				ОткрытьФорму(ИмяФормыВыбора, , ЭтаФорма, , , , ОбработчикВыбора);
			КонецЕсли;
			
		#КонецЕсли
		
	ИначеЕсли ТипЗнч(ПараметрыВыбораВходящие) = Тип("СписокЗначений") Тогда
		
		СбисВыбратьИзСписка(ПараметрыВыбораВходящие, ДопПараметры);
		
	КонецЕсли;

КонецПроцедуры

