
// Область с АПИ обработки, например для использования в ВФК

// Функция - Скачать по ссылке в файл
//
// Параметры:
//  UrlВходящий	 - Строка				 - УРЛ для скачивания файла
//  ИмяФайла	 - Строка/Неопределено	 - Имя файла, куда сохранить. Если не указан, то будет создан новый временный файл.
// 
// Возвращаемое значение:
//  Строка - Путь к файлу, куда скачано значение. При ошибки вызывается СбисИсключение.
//
&НаКлиенте
Функция СкачатьВФайлПоПараметрам(ПараметрыВходящие, ДопПараметры = Неопределено) Экспорт
	Перем UrlДляСкачивания, ИмяФайла, ПолноеИмяФайла, РасширениеФайла, СоздаватьНовый;
	
	Если ТипЗнч(ПараметрыВходящие) = Тип("Строка") Тогда
		
		UrlДляСкачивания = ПараметрыВходящие;
		
	ИначеЕсли 	ПараметрыВходящие.Свойство("URLПолный", UrlДляСкачивания) Тогда
		
		// Передан полный URL в явном виде
		
	ИначеЕсли	ПараметрыВходящие.Свойство("URL") Тогда
		
		Если Лев(ПараметрыВходящие.URL, 8) = "https://" Тогда
			
			// Передан готовый URL	
			UrlДляСкачивания = ПараметрыВходящие.URL;
				
		ИначеЕсли	ПараметрыВходящие.Свойство("Протокол")
				И	ПараметрыВходящие.Свойство("Сервер") Тогда
			
			UrlДляСкачивания = ПараметрыВходящие.Протокол + "://" + ПараметрыВходящие.Сервер + ПараметрыВходящие.URL;

		КонецЕсли;
		
	КонецЕсли;
	
	Если UrlДляСкачивания = Неопределено Тогда
		
		ВызватьИсключение "Ошибка в параметрах метода: СкачатьВФайлПоПараметрам - Отсутствует URL!";
		
	КонецЕсли;
		
	ПараметрыДляСкачать = Новый Структура("Ссылка, ИмяФайла", UrlДляСкачивания);
	Если ДопПараметры = Неопределено Тогда
		
		ПараметрыДляСкачать.ИмяФайла = НовыйВременныйФайлКлиент();
		
	ИначеЕсли ДопПараметры.Свойство("ПолноеИмяФайла", ПолноеИмяФайла) Тогда
		
		// На случай если необходимо сохранить не во временный файл.
		ПараметрыДляСкачать.ИмяФайла = ПолноеИмяФайла;
		
	Иначе
		
		Если ДопПараметры.Свойство("ИмяФайла",			ИмяФайла) Тогда
			
			Если Не ДопПараметры.Свойство("РасширениеФайла",	РасширениеФайла) Тогда
				
				ИмяФайлаРазделено	= СтрЗаменить(ИмяФайла, ".", Символы.ПС);
				РасширениеФайла		= СтрПолучитьСтроку(ИмяФайлаРазделено, СтрЧислоСтрок(ИмяФайлаРазделено));
				ИмяФайла			= Лев(ИмяФайла, СтрДлина(ИмяФайла) - СтрДлина(РасширениеФайла) - 1);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ДопПараметры.Свойство("СоздаватьНовый", СоздаватьНовый) Тогда
			
			СоздаватьНовый = Ложь;
			
		КонецЕсли;
		
		ПараметрыДляСкачать.ИмяФайла = НовыйВременныйФайлКлиент(ИмяФайла, РасширениеФайла, , СоздаватьНовый);
		
	КонецЕсли;
	
	МодульСкачивания	= ПараметрSABY("Интеграция", "Сеанс");
	Кэш					= ПолучитьТекущийЛокальныйКэш();
	ОшибкаСкачивания	= Ложь;
	
	РезультатСкачивания = МодульСкачивания.СБИС_СохранитьПоСсылкеВФайл(Кэш, ПараметрыДляСкачать, Новый Структура, ОшибкаСкачивания);
	
	Если ОшибкаСкачивания Тогда
		
		ОшибкаСкачивания = НовыйСбисИсключение(РезультатСкачивания, "МодульОбъектаКлиент.СкачатьВФайлПоПараметрам");
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаСкачивания);
		
	КонецЕсли;
	
	Возврат ПараметрыДляСкачать.ИмяФайла
	
КонецФункции

//Процедура - показывает пользователю выбор по параметрам
//
// Параметры:
//  ПараметрыВыбораВходящие	 - Произвольный	 - что выбираем
//  ДопПараметры			 - Структура	 - расширение
//		Обработчик: СбисОписаниеОповещения описание функции/процедуры, в которую будет передан результат после выбора значения
//
&НаКлиенте
Процедура SABYВыбратьЗначение(ПараметрыВыбораВходящие, ДопПараметры) Экспорт
	Перем ОбработчикВыбора, ПараметрыОтбораВыбора;
	
	Если Не ДопПараметры.Свойство("Обработчик", ОбработчикВыбора) Тогда
		
		ВызватьИсключение "Не указан обработчик для обработки выбора значения!";
		
	КонецЕсли;
	
	Если Не ДопПараметры.Свойство("ПараметрыОтбораВыбора", ПараметрыОтбораВыбора) Тогда
		ПараметрыОтбораВыбора = Новый Структура;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыВыбораВходящие) = Тип("Тип") Тогда
		
		ТипСтрокой = СсылочныйТипСтрокой(ПараметрыВыбораВходящие);
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			МенеджерТипа	= МенеджерОбъектаПоИмени(ТипСтрокой);
			ФормаВыбора		= МенеджерТипа.ПолучитьФормуВыбора();
			
			Если ПараметрыОтбораВыбора.Свойство("ПараметрОтборПоВладельцу") Тогда
				ФормаВыбора.ПараметрОтборПоВладельцу = ПараметрыОтбораВыбора.ПараметрОтборПоВладельцу;
			КонецЕсли;
			Если ПараметрыОтбораВыбора.Свойство("ПараметрВыборПоВладельцу") Тогда
				ФормаВыбора.ПараметрВыборПоВладельцу = ПараметрыОтбораВыбора.ПараметрВыборПоВладельцу;
			КонецЕсли;
			
			Результат		= ФормаВыбора.ОткрытьМодально();
			ПодключитьОтложенноеДействие(ОбработчикВыбора, Результат);
			
		#Иначе
			
			ИмяФормыВыбора	= СтрЗаменить(ТипСтрокой, "Ссылка.", ".") + ".ФормаВыбора";
			
			Если ПараметрыОтбораВыбора.Свойство("ПараметрыФормы") Тогда
				ОткрытьФорму(ИмяФормыВыбора, ПараметрыОтбораВыбора.ПараметрыФормы, ЭтаФорма, , , , ОбработчикВыбора);	
			Иначе
				ОткрытьФорму(ИмяФормыВыбора, , ЭтаФорма, , , , ОбработчикВыбора);
			КонецЕсли;
			
		#КонецЕсли
		
	ИначеЕсли ТипЗнч(ПараметрыВыбораВходящие) = Тип("СписокЗначений") Тогда
		
		СбисВыбратьИзСписка(ПараметрыВыбораВходящие, ДопПараметры);
		
	КонецЕсли;

КонецПроцедуры

