
// Область с АПИ обработки, например для использования в ВФК

// Функция - прочитать сохраняемый пользовательский параметр (настройку)
//
// Параметры:
//  ИмяПараметра - Строка					 - Ключ в Парам
//  ДопПараметры - Структура/Неопределено	 - Расширение
//		ЛокальныйКэш - ЛокальныйКэш -	задать источник поиска на случай необходимости чтения параметра от своего экземпляра Кэш. 
//										Если не задано, источник - ГлобальныйКэш
// 
// Возвращаемое значение:
//  Произвольный - значение параметра
//
&НаКлиенте
Функция ПолучитьПараметрПользователя(ИмяПараметра, ДопПараметры = Неопределено) Экспорт
	Перем ЗначениеПараметраСбис, ИсточникПроверкиПараметра;
	
	Если		ДопПараметры = Неопределено
		Или	Не	ДопПараметры.Свойство("ЛокальныйКэш", ИсточникПроверкиПараметра) Тогда
		
		ИсточникПроверкиПараметра = ГлобальныйКэш;
		
	КонецЕсли;
	
	Если ИсточникПроверкиПараметра = Неопределено Тогда
		
		ОшибкаИсточника = НовыйСбисИсключение(779,	"МодульОбъектаКлиент.ПолучитьПользовательскийПараметр",,,
													"Неопределен источник получения параметра " + ИмяПараметра);
		ВызватьИсключение СбисИсключение_Представление(ОшибкаИсточника);
		
	КонецЕсли;
	
	Если Не	ИсточникПроверкиПараметра.Парам.Свойство(ИмяПараметра, ЗначениеПараметраСбис) Тогда
			
		Возврат Неопределено;
		
	КонецЕсли;
		
	Возврат ЗначениеПараметраСбис;
	
КонецФункции

// Процедура записывает значение параметра по имени в кэш ГО и Глобальный кэш
//
// Параметры:
//  ИмяПараметра		 - Строка					 - Ключ параметра
//  ЗначениеПараметра	 - Произвольное значение	 - Значение параметра установить
//  ДопПараметры		 - Структура				 - 
//		Кэш			- ЛокальныйКэш, куда установить параметр
//		Глобально	- Булево (Истина), определяет необходимость обновить параметр глобально, или изменение касается только класса ЛокальныйКэш
//		Параметры	- Стуркутра, доп. параметры непосредственно для изменения
//		Адрес		- Строка, путь в кэше для установки параметра
//
&НаКлиенте
Процедура ИзменитьПараметрПользователя(ИмяПараметра, ЗначениеПараметра, ДопПараметры = Неопределено) Экспорт
	
	Если Не	ГлобальныйКэш.Парам.Свойство(ИмяПараметра) Тогда
		
		Возврат;
		
	КонецЕсли;
		
	ИзменитьПараметрСбис(ИмяПараметра, ЗначениеПараметра, ДопПараметры);		
	
КонецПроцедуры

