
//DynamicDirective

// Функция - прочитать сохраняемый пользовательский параметр (настройку)
//
// Параметры:
//  ИмяПараметра - Строка					 - Ключ в Парам
//  ДопПараметры - Структура/Неопределено	 - Расширение
//		ЛокальныйКэш - ЛокальныйКэш -	задать источник поиска на случай необходимости чтения параметра от своего экземпляра Кэш. 
//										Если не задано, источник - ГлобальныйКэш
// 
// Возвращаемое значение:
//  Произвольный - значение параметра
//
Функция ПолучитьПараметрПользователя(ИмяПараметра, ДопПараметры = Неопределено) Экспорт
	
	Возврат ПараметрSABY(ИмяПараметра, "Пользователь");

КонецФункции

//DynamicDirective

// Процедура записывает значение параметра по имени в кэш ГО и Глобальный кэш
//
// Параметры:
//  ИмяПараметра		 - Строка					 - Ключ параметра
//  ЗначениеПараметра	 - Произвольное значение	 - Значение параметра установить
//  ДопПараметры		 - Структура				 - 
//		Кэш			- ЛокальныйКэш, куда установить параметр
//		Глобально	- Булево (Истина), определяет необходимость обновить параметр глобально, или изменение касается только класса ЛокальныйКэш
//		Параметры	- Стуркутра, доп. параметры непосредственно для изменения
//		Адрес		- Строка, путь в кэше для установки параметра
//
Процедура ИзменитьПараметрПользователя(ИмяПараметра, ЗначениеПараметра, ДопПараметры = Неопределено) Экспорт
	
	Если Не	ГлобальныйКэш.Парам.Свойство(ИмяПараметра) Тогда
		
		Возврат;
		
	КонецЕсли;
		
	ИзменитьПараметрСбис(ИмяПараметра, ЗначениеПараметра, ДопПараметры);		
	
КонецПроцедуры

//DynamicDirective

// Функция - проверяет объект на принадлежность к типу СБИС
//
// Параметры:
//  ОбъектПроверка		 - Произвольный	 - проверяемый объект
//  ТипЗначенияСтрокой	 - Строка		 - тип, который проверяем
// 
// Возвращаемое значение:
//  Булево - истина если объект принадлежит типу СБИС
//
Функция ЭтоТипСбис(ОбъектПроверка, ТипЗначенияПроверить) Экспорт
	Перем ТипОбъектаПроверка, ТипЗначенияФормат;
	
	Если	ТипЗнч(ТипЗначенияПроверить) = Тип("Строка") Тогда
		
		ТипЗначенияФормат = НРег(ТипЗначенияПроверить);
		
	ИначеЕсли ЭтоТипСбис(ТипЗначенияПроверить, "ПрикладнойОбъектSABY") Тогда
		
		// При сравнении классов, для проверки берется только тип наследника, родители не учитываются
		ТипЗначенияФормат = ПрикладнойОбъектSABY_Получить(ТипЗначенияПроверить,,"Тип");
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	ЭтоТипСБИС			= Ложь;
	
	Если	ТипЗнч(ОбъектПроверка) = Тип("Структура") Тогда
		
		Если		ОбъектПроверка.Свойство("_тип") Тогда
			
			Возврат ОбъектSABY_ЭтоТип(ОбъектПроверка, ТипЗначенияПроверить);
			
		ИначеЕсли	ОбъектПроверка.Свойство("__name__",	ТипОбъектаПроверка) Тогда
		
			// В случае наследования, тип класса будет многострочным от наследника к родителю
			Для НомерЧислоСтрок = 1 По СтрЧислоСтрок(ТипОбъектаПроверка) Цикл
				
				ЗначениеПроверка = НРег(СтрПолучитьСтроку(ТипОбъектаПроверка, НомерЧислоСтрок));
				Если Найти(ТипЗначенияФормат, ЗначениеПроверка) Тогда 
					
					Возврат Истина;
					
				КонецЕсли;
				
			КонецЦикла;
		
		ИначеЕсли	 Найти(ТипЗначенияФормат, "вложениесбис") Тогда
			                //Формалка
			ЭтоТипСБИС	=	(		ОбъектПроверка.Свойство("ВерсияФормата")
								И	ОбъектПроверка.Свойство("ПодТип")
								И	ОбъектПроверка.Свойство("Тип")
							)
							//Неформалка
							Или
							(		ОбъектПроверка.Свойство("ПолноеИмяФайла")
								И	ОбъектПроверка.Свойство("Название")
								И	ОбъектПроверка.Свойство("ИмяФайла")
							);

		ИначеЕсли	Найти(ТипЗначенияФормат, "сбисисключение") Тогда
			
			ЭтоТипСБИС =	ОбъектПроверка.Свойство("code")
						И	ОбъектПроверка.Свойство("message")
						И	ОбъектПроверка.Свойство("details");
			
		ИначеЕсли	Найти(ТипЗначенияФормат, "составпакета") Тогда
						
			ЭтоТипСБИС =	ОбъектПроверка.Свойство("Контрагент")
						И	ОбъектПроверка.Свойство("НашаОрганизация")
						И	ОбъектПроверка.Свойство("Вложение");

		ИначеЕсли	Найти(ТипЗначенияФормат, "sbiswarning") Тогда
			
			// Проверка сбисовой ошибки по коду и коду БЛ
			ЭтоТипСБИС =		ОбъектПроверка.Свойство("code")
							И	ОбъектПроверка.code = -32000
						Или		ОбъектПроверка.Свойство("data")
							И	ТипЗнч(ОбъектПроверка.data) = Тип("Структура")
							И	ОбъектПроверка.data.Свойство("classid")
						
		ИначеЕсли	Найти(ТипЗначенияФормат, "файлдокумент") Тогда
							
			// Это описание файла данных, сформированного кодом в ПрочитатьДокумент на Файл_{Шаблон}
			ЭтоТипСБИС =	ОбъектПроверка.Свойство("Документ")
						И	ОбъектПроверка.Свойство("ВерсияФормата")
						И	ОбъектПроверка.Свойство("Формат");
							
		КонецЕсли;
		
	ИначеЕсли	Найти(ТипЗначенияФормат, "сбисописаниеоповещения") Тогда
		
		Если ГлобальныйКэш.СовместимостьМетодов.Объекты1С.ОписаниеОповещения Тогда
			
			ЭтоТипСБИС = Вычислить("Тип(""ОписаниеОповещения"")") = ТипЗнч(ОбъектПроверка);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ОбъектПроверка) = Тип("ИнформацияОбОшибке") Тогда
		
		ЭтоТипСБИС = Булево(Найти(ТипЗначенияФормат, "сбисисключение"));
		
	ИначеЕсли	Найти(ТипЗначенияФормат, "болванкасоставпакета") Тогда
		
		Если ТипЗнч(ОбъектПроверка) = Тип("СписокЗначений") Тогда
			
			Для Каждого ЭлементПроверка Из ОбъектПроверка Цикл
				
				ЭтоТипСБИС = Лев(ПолучитьПредставлениеТипа(ТипЗнч(ЭлементПроверка.Значение)), 8) = "Документ";
				Прервать;
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли 	Найти(ТипЗначенияФормат, "модульsaby") Тогда
		
		// TODO Добавить проверку принадлежности формы к обработкам saby и ВФК
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			Возврат ТипЗнч(ОбъектПроверка) = Тип("Форма");
			
		#Иначе
			
			Возврат ТипЗнч(ОбъектПроверка) = Тип("УправляемаяФорма");

		#КонецЕсли
		
	КонецЕсли;
	
	Возврат ЭтоТипСБИС;
	
КонецФункции

//DynamicDirective

// Функция - сравнивает равенство объектов SABY
//
// Параметры:
//  ОбъектПроверка1		 - ПрикладнойОбъектSABY	 - проверяемый объект1
//  ТипЗначенияСтрокой	 - ПрикладнойОбъектSABY	 - проверяемый объект2
// 
// Возвращаемое значение:
//  Булево - истина если объекты равны
//
Функция ОбъектыСбисРавны(ОбъектПроверка1, ОбъектПроверка2) Экспорт
	
	Если	ОбъектПроверка1 = ОбъектПроверка2 Тогда
		
		Возврат Истина;
		
	ИначеЕсли ОбъектПроверка1 = Неопределено
		Или	  ОбъектПроверка2 = Неопределено Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Попытка
		
		Если ПрикладнойОбъектSABY_Получить(ОбъектПроверка1,, "ид") = ПрикладнойОбъектSABY_Получить(ОбъектПроверка2,, "ид") Тогда
			
			Возврат Истина;
			
		КонецЕсли;
		
	Исключение
		
		Возврат Ложь

	КонецПопытки;
	
	Возврат Ложь
	
КонецФункции

//DynamicDirective

// Функция - Привести тип сбис. Приводит один тип к другому. Пока только дата. Добавляем по мере необходимости.
//
// Параметры:
//  ЗначениеПривести - любой тип	- Значение, которое надо привести к типу "ТипПривести"
//  ТипПривести		 - Тип/Строка	- тип, к которому нужно привести значение
// 
// Возвращаемое значение:
//   - приведенное значение "ЗначениеПривести" к типу "ТипПривести".
//		Если это невозможно, возвращаем то же значение.
//
Функция ПривестиТипСбис(ЗначениеПривести, ТипПривестиВходящий, ДопПараметры = Неопределено) Экспорт
	Перем ИгнорироватьОшибкиПриведения;
	
	Результат	= ЗначениеПривести;
	ТипПривести	= ТипПривестиВходящий;

	Если Не ДопПараметры = Неопределено Тогда
		
		ДопПараметры.Свойство("ИгнорироватьОшибки", ИгнорироватьОшибкиПриведения);
		
	КонецЕсли; 
	
	Если ИгнорироватьОшибкиПриведения = Неопределено Тогда
		
		ИгнорироватьОшибкиПриведения = Истина;
		
	КонецЕсли;
	
	Если ТипЗнч(ТипПривести) = Тип("Строка") Тогда
		
		// Получить параметры прочих типов, затем типы приведения. Если их нет, то создаём и заполняем
		ПараметрыПриведенияТипов = Новый Соответствие;
		ПрочиеТипы = ПолучитьЗначениеПараметраТекущегоСеанса("ОписаниеПрочихТипов");
		Если НЕ ПрочиеТипы = Неопределено И ПрочиеТипы.Свойство("ПараметрыПриведенияТипов") Тогда
			ПараметрыПриведенияТипов = ПрочиеТипы.ПараметрыПриведенияТипов;
		Иначе
			
			ПрочиеТипы = Новый Структура;
			
			СоответствиеВставить = Новый Соответствие;
			СоответствиеВставить.Вставить(Тип("Число"), "ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧН=0.000; ЧГ=0");
			ПараметрыПриведенияТипов.Вставить("Количество", СоответствиеВставить);
			//Описание приведения для суммовых параметров
			СоответствиеВставить = Новый Соответствие;
			СоответствиеВставить.Вставить(Тип("Число"), "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00");
			ПараметрыПриведенияТипов.Вставить("Сумма", СоответствиеВставить);
			
			СоответствиеВставить = Новый Соответствие;
			СоответствиеВставить.Вставить(Тип("Число"), "ЧГ=0");
			ПараметрыПриведенияТипов.Вставить("Номер", СоответствиеВставить);
			
			ПрочиеТипы.Вставить("ПараметрыПриведенияТипов", ПараметрыПриведенияТипов);
			// ИзменитьПараметрТекущегоСеанса("ОписаниеПрочихТипов", ПрочиеТипы);  Дождаться переноса этой функции на МодульОбъекта (26.2100) (с)Сыч
			
		КонецЕсли;
		
		Если	ТипПривести = "Сумма" 
			ИЛИ ТипПривести = "Количество" 
			ИЛИ ТипПривести = "Номер" Тогда
			
			ПараметрПоКлючу = ПараметрыПриведенияТипов.Получить(ТипПривести);
			Если ПараметрПоКлючу = Неопределено Тогда
				Возврат Результат;
			КонецЕсли; 
			
			ТипПриведенияРасширенный = ДопПараметры.ТипПриведенияРасширенный;
			ПараметрПривести = ПараметрПоКлючу.Получить(Тип(ТипПриведенияРасширенный));
			Если ПараметрПривести = Неопределено Тогда
				Возврат Результат;
			КонецЕсли;

			Возврат Формат(Результат, ПараметрПривести);
			
		ИначеЕсли ТипПривести = "запрос" Тогда
			
		    Возврат СериализоватьОбъектДляВозвратаНаКлиент(Результат);
			
		Иначе
			
			Попытка
				
				ТипПривести = Тип(ПолучитьПредставлениеТипа(ТипПривести));

			Исключение
				
				// Не удалось получить Тип по строке, возвращаем так, как есть
				Если ИгнорироватьОшибкиПриведения Тогда
				
					Возврат Результат;
					
				КонецЕсли;
				
				ОшибкаПриведения = НовыйСбисИсключение(,"МодульОбъектаКлиент.ПривестиТипСбис", 785001,, "Неизвестный тип", Новый ФиксированнаяСтруктура("Тип", ТипПривести));
				ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаПриведения);; 
				
			КонецПопытки;
			
		КонецЕсли;	
			
	ИначеЕсли ТипЗнч(ТипПривести) <> Тип("Тип") Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Если	ТипПривести = ТипЗнч(ЗначениеПривести)
		Или	ТипПривести = Тип("Null") Тогда
		
		// Уже приведено или неприводимый тип
		Возврат Результат;
		
	КонецЕсли;

	
	Если ТипПривести = Тип("Дата") Тогда
		
		Если	Сред(Результат, 3, 1) = "."
			И	Сред(Результат, 6, 1) = "." Тогда
			
			// Переопределим значение как дату, если это действительно она
			Если		СтрДлина(Результат) = 10 Тогда
				
				Попытка
					
					Результат = Дата(Сред(Результат,7,4), Сред(Результат,4,2), Лев(Результат, 2));
					
				Исключение
					
					// Не удалось получить Тип по строке, возвращаем так, как есть
					Если ИгнорироватьОшибкиПриведения Тогда
					
						Возврат Результат;
						
					КонецЕсли;
					
					ОшибкаПриведения = НовыйСбисИсключение(,"МодульОбъектаКлиент.ПривестиТипСбис",
															785001,
															,
															"Неверное значение """ + Результат + """ для приведения к типу ""Дата""");
					ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаПриведения);; 
					
				КонецПопытки;
				
			ИначеЕсли	СтрДлина(Результат) = 19 Тогда 
				
				Попытка
					
					Результат = Дата(Сред(Результат,7,4), Сред(Результат,4,2), Лев(Результат, 2), Сред(Результат,12, 2), Сред(Результат,15, 2), Сред(Результат,18, 2));
					
				Исключение
					
					// Не удалось получить Тип по строке, возвращаем так, как есть
					Если ИгнорироватьОшибкиПриведения Тогда
					
						Возврат Результат;
						
					КонецЕсли;
					
					ОшибкаПриведения = НовыйСбисИсключение(,"МодульОбъектаКлиент.ПривестиТипСбис",
															785001,
															,
															"Неверное значение """ + Результат + """ для приведения к типу ""Дата""");
					ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаПриведения);; 
					
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Попытка
			
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ТипПривести);
			СбисОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
			
			Результат = СбисОписаниеТипа.ПривестиЗначение(ЗначениеПривести);
			
		Исключение
			
			Если ИгнорироватьОшибкиПриведения Тогда
			
				Возврат Результат;
				
			КонецЕсли;
			
			ОшибкаПриведения = НовыйСбисИсключение(,"МодульОбъектаКлиент.ПривестиТипСбис",
													785001,
													,
													"Неверное значение """ + ЗначениеПривести + """ для приведения к типу """ + ТипПривести + """");
			ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаПриведения);; 
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//DynamicDirective

// Функция - копирует объект
//
// Параметры:
//  ОбъектСкопироватьВходящий	 - Произвольный	 - что скорпировать
//  ДопПараметры				 - Структура	 - Параметры копирования
//		ГлубокаяКопия			 - скопировать основной объект на всех уровнях
//		ЕслиТипНеизвестен		 - обработка неизвестных типов: "Ошибка" - вызвать исключение, пропустить - все остальные
// 
// Возвращаемое значение:
//  Произвольный - копия объекта. Если тип неизвестен, копирование не производится
//
Функция СоздатьКопиюОбъекта(Знач ОбъектСкопироватьВходящий, ДопПараметры = Неопределено) Экспорт

	ГлубокаяКопия		= Ложь;
	ЕслиТипНеизвестен	= "какесть"; // пропустить
	
	Если Не ДопПараметры = Неопределено Тогда
		
		ГлубокаяКопия = ДопПараметры.Свойство("ГлубокаяКопия")
					И	ДопПараметры.ГлубокаяКопия;
		Если ДопПараметры.Свойство("ЕслиТипНеизвестен") Тогда
			
			ЕслиТипНеизвестен	= НРег(ДопПараметры.ЕслиТипНеизвестен);
			
		КонецЕсли;
					
	КонецЕсли;
				
	КонтекстКопирования = Новый Структура("Уровень, ГлубокаяКопия, ЕслиТипНеизвестен, Путь", 0, ГлубокаяКопия, ЕслиТипНеизвестен);
	КонтекстКопирования.Путь = "ОбъектСкопироватьВходящий";
	
	Возврат СоздатьКопиюОбъекта_Объект(ОбъектСкопироватьВходящий, КонтекстКопирования);
	
КонецФункции

//DynamicDirective

// Функция - Объединияет объекты в 1
//
// Параметры:
//  ОбъектОсновной		 - Произвольный объект универсальных коллекций	 - основа объединения
//  ОбъектОбъединения	 - Произвольный объект универсальных коллекций	 - что надо влить в основной объект
//  ДопПараметры	 	 - Структура	 								 - контекст дозаполнения: 
//		ГлубокаяКопия			 - скопировать основной объект на всех уровнях, дополнить его глубокой копией второго объекта
//		ЕслиТипНеизвестен		 - обработка неизвестных типов: "Ошибка" - вызвать исключение, пропустить - все остальные
//		КлючиПеренестиКакЕсть	 - строка с разделителями ","/массив - обработка для структур. Если указан, то для ключей  игнорируется принцип глубокой копии и значение переносится без обработки
//		КлючиПеренестиТолько	 - строка с разделителями ","/массив - обработка для структур. Если указан, то для ключей  игнорируется принцип глубокой копии и значение переносится без обработки
// 
// Возвращаемое значение:
//  ОбъектОсновной с значениями объектов из ОбъектыОбъединения
//
Функция ОбъединитьОбъектыУниверсальныхКоллекций(ОбъектОсновной = Неопределено, ОбъектОбъединения = Неопределено, ДопПараметры)  Экспорт
    Перем КлючиПеренестиТолько, КлючиПеренестиКакЕсть, ГлубокаяКопия;
	
	Если ОбъектОсновной = Неопределено Тогда
		
		Возврат СоздатьКопиюОбъекта(ОбъектОбъединения, ДопПараметры);
		
	КонецЕсли;
	
	Если Не ДопПараметры.Свойство("ГлубокаяКопия", ГлубокаяКопия) Тогда
		
		ГлубокаяКопия = Ложь;
		
	КонецЕсли;
	
	Если ДопПараметры.Свойство("КлючиПеренестиКакЕсть", КлючиПеренестиКакЕсть) Тогда
		
		Если ТипЗнч(КлючиПеренестиКакЕсть) = Тип("Строка") Тогда
			
			КлючиПеренестиКакЕсть = СтрЗаменить(КлючиПеренестиКакЕсть, " ", "");
			КлючиПеренестиКакЕсть = СбисРазложитьСтрокуВМассивПодстрок(КлючиПеренестиКакЕсть, ",");
			
		КонецЕсли;
		
	Иначе
		
		КлючиПеренестиКакЕсть = Новый Массив;
		
	КонецЕсли;
	
	Если ДопПараметры.Свойство("КлючиПеренестиТолько", КлючиПеренестиТолько) Тогда
		
		Если ТипЗнч(КлючиПеренестиКакЕсть) = Тип("Строка") Тогда
			
			КлючиПеренестиТолько = СтрЗаменить(КлючиПеренестиТолько, " ", "");
			КлючиПеренестиТолько = СбисРазложитьСтрокуВМассивПодстрок(КлючиПеренестиТолько, ",");
			
		КонецЕсли;
		
	Иначе
		
		КлючиПеренестиТолько = Новый Массив;
		
	КонецЕсли;
	
	ГлубокаяКопия = ГлубокаяКопия = Истина;
	
	ОбъектРезультат = ОбъектОсновной;				
	Если ГлубокаяКопия Тогда
		
		ОбъектРезультат = СоздатьКопиюОбъекта(ОбъектОсновной, ДопПараметры);;				
		
	КонецЕсли;
	
	Если ОбъектОбъединения = Неопределено Тогда
		
		Возврат ОбъектРезультат;
		
	КонецЕсли;
						
	// Указать набор ключей для структур, которые надо переносить. Все остальное игнорируется
	ПростыеТипы = Новый Массив;
	ПростыеТипы.Добавить("Строка");
	ПростыеТипы.Добавить("Число");
	ПростыеТипы.Добавить("Булево");
	ПростыеТипы.Добавить("Дата");
	ПростыеТипы.Добавить("Неопределено");
	ОписаниеПростыхТипов = Новый ОписаниеТипов(ПростыеТипы);
	
	КонтекстОбъединенияРек = Новый Структура("Путь, Уровень, ГлубокаяКопия, ПростыеТипы, КлючиПеренестиТолько, КлючиПеренестиКакЕсть, ЕслиТипНеизвестен",
											"Объект",
											 0);
	КонтекстОбъединенияРек.ГлубокаяКопия				= ГлубокаяКопия;
	КонтекстОбъединенияРек.КлючиПеренестиТолько			= КлючиПеренестиТолько;
	КонтекстОбъединенияРек.КлючиПеренестиКакЕсть		= КлючиПеренестиКакЕсть;
	КонтекстОбъединенияРек.ПростыеТипы					= ОписаниеПростыхТипов;
	КонтекстОбъединенияРек.ЕслиТипНеизвестен			= "какесть";
	
	Возврат ОбъединитьОбъектыУниверсальныхКоллекций_Объект(ОбъектРезультат, ОбъектОбъединения, КонтекстОбъединенияРек) 
	
КонецФункции

//DynamicDirective

Функция ПолучитьПредставлениеОбъекта(ОбъектДляПредставления, ДопПараметры = Неопределено) Экспорт 

	Если ОбъектДляПредставления = Неопределено Тогда
		
		Возврат "";
		
	#Если ТолстыйКлиентОбычноеПриложение Тогда
			
	ИначеЕсли ТипЗнч(ОбъектДляПредставления) = Тип("Форма") Тогда
		
		ПараметрыПолучить = Новый Структура("ИмяФормы");
		ЗаполнитьЗначенияСвойств(ПараметрыПолучить, ОбъектДляПредставления);
		Если ПараметрыПолучить.ИмяФормы = Неопределено Тогда
			
			ДопПараметрыПолучить = Новый Структура("ОбработкаОбъект", ОбъектДляПредставления.ОбработкаОбъект);

			//Делать через перебор метаданных.
			Для Каждого ФормаМетаданные Из ОбъектДляПредставления.Метаданные().Формы Цикл
				
				ФормаЗначение = ПолучитьФормуОбработки(ФормаМетаданные.Имя, ДопПараметрыПолучить);
				Если ФормаЗначение = ОбъектДляПредставления Тогда
					
					ПараметрыПолучить.ИмяФормы = ФормаМетаданные.Имя;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Возврат ПараметрыПолучить.ИмяФормы;
		
	#Иначе
	ИначеЕсли ТипЗнч(ОбъектДляПредставления) = Тип("УправляемаяФорма") Тогда
		
		Возврат ОбъектДляПредставления.ИмяФормы;
		
	#КонецЕсли
	
	Иначе
		
		Возврат Строка(ОбъектДляПредставления);
	
	КонецЕсли;
	
КонецФункции

//DynamicDirective

// Функция - получает представление типа по входящему значению
//
// Параметры:
//  ЗначениеПредставления	- Объект1ССсылка/Строка	 - 
//  ДопПараметры			- Структура	 - расширение
// 
// Возвращаемое значение:
//  Строка - представление типа, которое можно использовать для создания типа
//
Функция ПолучитьПредставлениеТипа(ЗначениеПредставления, ДопПараметры = Неопределено) Экспорт 

	Перем Результат, ПредставленияТипов, ТипПроверки;

	Если ЗначениеПредставления = Неопределено Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Или Не НаСервере Тогда
		
		ПредставленияТипов 	= ПолучитьЗначениеПараметраТекущегоСеанса("ПредставленияТипов");
		
	#КонецЕсли
	
	Если ПредставленияТипов = Неопределено Тогда
		
		ПредставленияТипов = Новый Соответствие;
		
	КонецЕсли;
	
	Если		ТипЗнч(ЗначениеПредставления) = Тип("Строка") Тогда
		
		ТипПроверки		= ЗначениеПредставления;
		КлючПроверки	= СтрЗаменить(НРег(ТипПроверки), "ссылка", "");
		
	ИначеЕсли	ТипЗнч(ЗначениеПредставления) = Тип("Тип") Тогда
			
		ТипПроверки		= ЗначениеПредставления;
		КлючПроверки	= ТипПроверки;
		
	Иначе
	
		ТипПроверки		= ТипЗнч(ЗначениеПредставления);
		КлючПроверки	= ТипПроверки;
			
	КонецЕсли;
	
	Результат = ПредставленияТипов.Получить(КлючПроверки);
	
	Если Результат = Неопределено Тогда
		
		Если ТипЗнч(ТипПроверки) = Тип("Строка") Тогда
			
			СтрокаРаздел	= СтрЗаменить(ТипПроверки, ".", Символы.ПС);
			ТипМетаданных	= НРег(СтрПолучитьСтроку(СтрокаРаздел, 1));
			
			Если	Лев(ТипМетаданных, 8) = "документ" Тогда
				
				Результат = "ДокументСсылка." + СтрПолучитьСтроку(СтрокаРаздел, 2);
				
			ИначеЕсли	Лев(ТипМетаданных, 10) = "справочник" Тогда
				
				Результат = "СправочникСсылка." + СтрПолучитьСтроку(СтрокаРаздел, 2);
				
			ИначеЕсли	Лев(ТипМетаданных, 10) = "перечислен" Тогда
				
				Результат = "ПеречислениеСсылка." + СтрПолучитьСтроку(СтрокаРаздел, 2);
				
			ИначеЕсли	Лев(ТипМетаданных, 4) = "план" Тогда
			
				Если Найти(ТипМетаданных, "счетов") Тогда
				
					Результат = "ПланСчетовСсылка." + СтрПолучитьСтроку(СтрокаРаздел, 2);
				
				ИначеЕсли Найти(ТипМетаданных, "видоврасчета") Тогда
				
					Результат = "ПланВидовРасчетаСсылка." + СтрПолучитьСтроку(СтрокаРаздел, 2);
				
				Иначе
				
					Результат = "ПланВидовХарактеристикСсылка." + СтрПолучитьСтроку(СтрокаРаздел, 2);
				
				КонецЕсли;
				
			ИначеЕсли	Лев(ТипМетаданных, 7) = "регистр" Тогда
				
				Если Найти(ТипМетаданных, "накоплен") Тогда
					
					Результат = "РегистрНакопления." + СтрПолучитьСтроку(СтрокаРаздел, 2);
					
				ИначеЕсли Найти(ТипМетаданных, "сведен") Тогда
					
					Результат = "РегистрСведений." + СтрПолучитьСтроку(СтрокаРаздел, 2);
					
				Иначе
					
					Результат = "РегистрБухгалтерии." + СтрПолучитьСтроку(СтрокаРаздел, 2);
					
				КонецЕсли;
				
			ИначеЕсли	ТипМетаданных = "число" Тогда
				
				Результат = "Число";
				
			ИначеЕсли	ТипМетаданных = "дата" Тогда
				
				Результат = "Дата";
				
			ИначеЕсли	ТипМетаданных = "булево" Тогда
				
				Результат = "Булево";
				
			ИначеЕсли	ТипМетаданных = "табличнаячасть" Тогда
				
				Результат = "Null";
				
			Иначе
				
				Результат = "Строка";

			КонецЕсли;
			
		ИначеЕсли ЗначениеПредставления = ТипПроверки Тогда
			
			Результат = СсылочныйТипСтрокойСервер(ЗначениеПредставления, ДопПараметры);
			
		Иначе
		
			#Если ВебКлиент Тогда
				
				Результат = СсылочныйТипСтрокойСервер(ЗначениеПредставления, ДопПараметры);
				
			#ИначеЕсли ТолстыйКлиентОбычноеПриложение Или Не НаСервере Тогда
				
				Результат = СсылочныйТипСтрокойВызовКлиента(ЗначениеПредставления, ДопПараметры);
				
			#Иначе

				Результат = СсылочныйТипСтрокойСервер(ЗначениеПредставления, ДопПараметры);
				
			#КонецЕсли
			
		КонецЕсли;
		
		#Если ТолстыйКлиентОбычноеПриложение Или Не НаСервере Тогда
			
			ПредставленияТипов.Вставить(КлючПроверки, Результат);
			ИзменитьПараметрТекущегоСеанса("ПредставленияТипов", ПредставленияТипов);
			
		#КонецЕсли
		
	КонецЕсли;
	
	Если ДопПараметры = "Кратко" Тогда
		
		Результат = СбисРазложитьСтрокуВМассивПодстрок(Результат, ".");
		Если Результат.Количество() > 1 Тогда
			
			Результат = Результат[1];
			
		КонецЕсли;
		
	ИначеЕсли ДопПараметры = "Запрос" Тогда	
		
		Результат = СтрЗаменить(Результат, "Ссылка", "");

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СсылочныйТипСтрокой()

#Область include_core2_vo2_МодульОбъекта_АПИ_КлиентСервер_СоздатьКопиюОбъекта
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_АПИ_КлиентСервер_ОбъединитьОбъектыУниверсальныхКоллекций
#КонецОбласти

