
// Область с АПИ обработки, например для использования в ВФК

// Функция - прочитать сохраняемый пользовательский параметр (настройку)
//
// Параметры:
//  ИмяПараметра - Строка					 - Ключ в Парам
//  ДопПараметры - Структура/Неопределено	 - Расширение
//		ЛокальныйКэш - ЛокальныйКэш -	задать источник поиска на случай необходимости чтения параметра от своего экземпляра Кэш. 
//										Если не задано, источник - ГлобальныйКэш
// 
// Возвращаемое значение:
//  Произвольный - значение параметра
//
&НаКлиенте
Функция ПолучитьПараметрПользователя(ИмяПараметра, ДопПараметры = Неопределено) Экспорт
	Перем ЗначениеПараметраСбис, ИсточникПроверкиПараметра;
	
	Если		ДопПараметры = Неопределено
		Или	Не	ДопПараметры.Свойство("ЛокальныйКэш", ИсточникПроверкиПараметра) Тогда
		
		ИсточникПроверкиПараметра = ГлобальныйКэш;
		
	КонецЕсли;
	
	Если ИсточникПроверкиПараметра = Неопределено Тогда
		
		ОшибкаИсточника = НовыйСбисИсключение(779,	"МодульОбъектаКлиент.ПолучитьПользовательскийПараметр",,,
													"Неопределен источник получения параметра " + ИмяПараметра);
		ВызватьИсключение СбисИсключение_Представление(ОшибкаИсточника);
		
	КонецЕсли;
	
	Если Не	ИсточникПроверкиПараметра.Парам.Свойство(ИмяПараметра, ЗначениеПараметраСбис) Тогда
			
		Возврат Неопределено;
		
	КонецЕсли;
		
	Возврат ЗначениеПараметраСбис;
	
КонецФункции

// Процедура записывает значение параметра по имени в кэш ГО и Глобальный кэш
//
// Параметры:
//  ИмяПараметра		 - Строка					 - Ключ параметра
//  ЗначениеПараметра	 - Произвольное значение	 - Значение параметра установить
//  ДопПараметры		 - Структура				 - 
//		Кэш			- ЛокальныйКэш, куда установить параметр
//		Глобально	- Булево (Истина), определяет необходимость обновить параметр глобально, или изменение касается только класса ЛокальныйКэш
//		Параметры	- Стуркутра, доп. параметры непосредственно для изменения
//		Адрес		- Строка, путь в кэше для установки параметра
//
&НаКлиенте
Процедура ИзменитьПараметрПользователя(ИмяПараметра, ЗначениеПараметра, ДопПараметры = Неопределено) Экспорт
	
	Если Не	ГлобальныйКэш.Парам.Свойство(ИмяПараметра) Тогда
		
		Возврат;
		
	КонецЕсли;
		
	ИзменитьПараметрСбис(ИмяПараметра, ЗначениеПараметра, ДопПараметры);		
	
КонецПроцедуры

// Функция - Скачать по ссылке в файл
//
// Параметры:
//  UrlВходящий	 - Строка				 - УРЛ для скачивания файла
//  ИмяФайла	 - Строка/Неопределено	 - Имя файла, куда сохранить. Если не указан, то будет создан новый временный файл.
// 
// Возвращаемое значение:
//  Строка - Путь к файлу, куда скачано значение. При ошибки вызывается СбисИсключение.
//
&НаКлиенте
Функция СкачатьПоСсылкеВФайл(UrlВходящий, ДопПараметры = Неопределено) Экспорт
	Перем ИмяФайла, ПолноеИмяФайла, РасширениеФайла, СоздаватьНовый;
	
	ПараметрыДляСкачать = Новый Структура("Ссылка, ИмяФайла", UrlВходящий);
	Если ДопПараметры = Неопределено Тогда
		
		ПараметрыДляСкачать.ИмяФайла = НовыйВременныйФайлКлиент();
		
	ИначеЕсли ДопПараметры.Свойство("ПолноеИмяФайла", ПолноеИмяФайла) Тогда
		
		// На случай если необходимо сохранить не во временный файл.
		ПараметрыДляСкачать.ИмяФайла = ПолноеИмяФайла;
		
	Иначе
		
		Если ДопПараметры.Свойство("ИмяФайла",			ИмяФайла) Тогда
			
			Если Не ДопПараметры.Свойство("РасширениеФайла",	РасширениеФайла) Тогда
				
				ИмяФайлаРазделено	= СтрЗаменить(ИмяФайла, ".", Символы.ПС);
				РасширениеФайла		= СтрПолучитьСтроку(ИмяФайлаРазделено, СтрЧислоСтрок(ИмяФайлаРазделено));
				ИмяФайла			= Лев(ИмяФайла, СтрДлина(ИмяФайла) - СтрДлина(РасширениеФайла) - 1);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ДопПараметры.Свойство("СоздаватьНовый", СоздаватьНовый) Тогда
			
			СоздаватьНовый = Ложь;
			
		КонецЕсли;
		
		ПараметрыДляСкачать.ИмяФайла = НовыйВременныйФайлКлиент(ИмяФайла, РасширениеФайла, , СоздаватьНовый);
		
	КонецЕсли;
	
	МодульСкачивания	= ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция");
	Кэш					= ПолучитьТекущийЛокальныйКэш();
	ОшибкаСкачивания	= Ложь;
	
	РезультатСкачивания = МодульСкачивания.СБИС_СохранитьПоСсылкеВФайл(Кэш, ПараметрыДляСкачать, Новый Структура, ОшибкаСкачивания);
	
	Если ОшибкаСкачивания Тогда
		
		ОшибкаСкачивания = НовыйСбисИсключение(РезультатСкачивания, "МодульОбъектаКлиент.СкачатьПоСсылкеВФайл");
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаСкачивания);
		
	КонецЕсли;
	
	Возврат ПараметрыДляСкачать.ИмяФайла
	
КонецФункции

