
//DynamicDirective

// Функция - проверяет объект на принадлежность к типу СБИС
//
// Параметры:
//  ОбъектПроверка		 - Произвольный	 - проверяемый объект
//  ТипЗначенияСтрокой	 - Строка		 - тип, который проверяем
// 
// Возвращаемое значение:
//  Булево - истина если объект принадлежит типу СБИС
//
Функция ЭтоТипСбис(ОбъектПроверка, ТипЗначенияСтрокой) Экспорт
	Перем ТипОбъектаПроверка;
	
	ТипЗначенияФормат	= НРег(ТипЗначенияСтрокой);
	ЭтоТипСБИС			= Ложь;
	
	Если	ТипЗнч(ОбъектПроверка) = Тип("Структура") Тогда
		
		Если	ОбъектПроверка.Свойство("_класс",	ТипОбъектаПроверка)
			Или	ОбъектПроверка.Свойство("__name__",	ТипОбъектаПроверка) Тогда
		
			ЭтоТипСБИС	= ТипЗначенияФормат = НРег(ТипОбъектаПроверка);
		
		ИначеЕсли	ТипЗначенияФормат = "вложениесбис" Тогда
			                //Формалка
			ЭтоТипСБИС	=	(		ОбъектПроверка.Свойство("ВерсияФормата")
								И	ОбъектПроверка.Свойство("ПодТип")
								И	ОбъектПроверка.Свойство("Тип")
							)
							//Неформалка
							Или
							(		ОбъектПроверка.Свойство("ПолноеИмяФайла")
								И	ОбъектПроверка.Свойство("Название")
								И	ОбъектПроверка.Свойство("ИмяФайла")
							);

		ИначеЕсли	ТипЗначенияФормат = "сбисисключение" Тогда
			
			ЭтоТипСБИС =	ОбъектПроверка.Свойство("code")
						И	ОбъектПроверка.Свойство("message")
						И	ОбъектПроверка.Свойство("details");
			
		ИначеЕсли	ТипЗначенияФормат = "составпакета" Тогда
						
			ЭтоТипСБИС =	ОбъектПроверка.Свойство("Контрагент")
						И	ОбъектПроверка.Свойство("НашаОрганизация")
						И	ОбъектПроверка.Свойство("Вложение");

		ИначеЕсли	ТипЗначенияФормат = "sbiswarning" Тогда
			
			// Проверка сбисовой ошибки по коду и коду БЛ
			ЭтоТипСБИС =		ОбъектПроверка.Свойство("code")
							И	ОбъектПроверка.code = -32000
						Или		ОбъектПроверка.Свойство("data")
							И	ТипЗнч(ОбъектПроверка.data) = Тип("Структура")
							И	ОбъектПроверка.data.Свойство("classid")
						
		ИначеЕсли	ТипЗначенияФормат = "файлдокумент" Тогда
							
			// Это описание файла данных, сформированного кодом в ПрочитатьДокумент на Файл_{Шаблон}
			ЭтоТипСБИС =	ОбъектПроверка.Свойство("Документ")
						И	ОбъектПроверка.Свойство("ВерсияФормата")
						И	ОбъектПроверка.Свойство("Формат");
							
		КонецЕсли;
		
	ИначеЕсли	ТипЗначенияФормат = "сбисописаниеоповещения" Тогда
		
		Если ГлобальныйКэш.СовместимостьМетодов.Объекты1С.ОписаниеОповещения Тогда
			
			ЭтоТипСБИС = Вычислить("Тип(""ОписаниеОповещения"")") = ТипЗнч(ОбъектПроверка);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ОбъектПроверка) = Тип("ИнформацияОбОшибке") Тогда
		
		ЭтоТипСБИС = ТипЗначенияФормат = "сбисисключение";
		
	КонецЕсли;
	
	Возврат ЭтоТипСБИС;
	
КонецФункции

//DynamicDirective

// Функция - копирует объект
//
// Параметры:
//  ОбъектСкопироватьВходящий	 - Произвольный	 - что скорпировать
//  КонтекстКопирования			 - Структура	 - Параметры копирования
//		ГлубокаяКопия			 - скопировать основной объект на всех уровнях
//		ЕслиТипНеизвестен		 - обработка неизвестных типов: "Ошибка" - вызвать исключение, пропустить - все остальные
// 
// Возвращаемое значение:
//  Произвольный - копия объекта. Если тип неизвестен, копирование не производится
//
Функция СоздатьКопиюОбъекта(Знач ОбъектСкопироватьВходящий, ДопПараметры = Неопределено) Экспорт

	ГлубокаяКопия		= Ложь;
	ЕслиТипНеизвестен	= "пропустить";
	
	Если Не ДопПараметры = Неопределено Тогда
		
		ГлубокаяКопия = ДопПараметры.Свойство("ГлубокаяКопия")
					И	ДопПараметры.ГлубокаяКопия;
		Если ДопПараметры.Свойство("ЕслиТипНеизвестен") Тогда
			
			ЕслиТипНеизвестен	= НРег(ДопПараметры.ЕслиТипНеизвестен);
			
		КонецЕсли;
					
	КонецЕсли;
				
	КонтекстКопирования = Новый Структура("Уровень, ГлубокаяКопия, ЕслиТипНеизвестен, Путь", 0, ГлубокаяКопия, ЕслиТипНеизвестен);
	КонтекстКопирования.Путь = "ОбъектСкопироватьВходящий";
	
	Возврат СоздатьКопиюОбъекта_Объект(ОбъектСкопироватьВходящий, КонтекстКопирования);
	
КонецФункции

//DynamicDirective

// Функция - Объединияет объекты в 1
//
// Параметры:
//  ОбъектОсновной		 - Произвольный объект универсальных коллекций	 - основа объединения
//  ОбъектОбъединения	 - Произвольный объект универсальных коллекций	 - что надо влить в основной объект
//  ДопПараметры	 	 - Структура	 								 - контекст дозаполнения: 
//		ГлубокаяКопия			 - скопировать основной объект на всех уровнях, дополнить его глубокой копией второго объекта
//		ЕслиТипНеизвестен		 - обработка неизвестных типов: "Ошибка" - вызвать исключение, пропустить - все остальные
//		КлючиПеренестиКакЕсть	 - строка с разделителями ","/массив - обработка для структур. Если указан, то для ключей  игнорируется принцип глубокой копии и значение переносится без обработки
//		КлючиПеренестиТолько	 - строка с разделителями ","/массив - обработка для структур. Если указан, то для ключей  игнорируется принцип глубокой копии и значение переносится без обработки
// 
// Возвращаемое значение:
//  ОбъектОсновной с значениями объектов из ОбъектыОбъединения
//
Функция ОбъединитьОбъектыУниверсальныхКоллекций(ОбъектОсновной = Неопределено, ОбъектОбъединения = Неопределено, ДопПараметры)  Экспорт
    Перем КлючиПеренестиТолько, КлючиПеренестиКакЕсть, ГлубокаяКопия;
	
	Если ОбъектОсновной = Неопределено Тогда
		
		Возврат СоздатьКопиюОбъекта(ОбъектОбъединения, ДопПараметры);
		
	КонецЕсли;
	
	Если Не ДопПараметры.Свойство("ГлубокаяКопия", ГлубокаяКопия) Тогда
		
		ГлубокаяКопия = Ложь;
		
	КонецЕсли;
	
	Если ДопПараметры.Свойство("КлючиПеренестиКакЕсть", КлючиПеренестиКакЕсть) Тогда
		
		Если ТипЗнч(КлючиПеренестиКакЕсть) = Тип("Строка") Тогда
			
			КлючиПеренестиКакЕсть = СтрЗаменить(КлючиПеренестиКакЕсть, " ", "");
			КлючиПеренестиКакЕсть = СбисРазложитьСтрокуВМассивПодстрок(КлючиПеренестиКакЕсть, ",");
			
		КонецЕсли;
		
	Иначе
		
		КлючиПеренестиКакЕсть = Новый Массив;
		
	КонецЕсли;
	
	Если ДопПараметры.Свойство("КлючиПеренестиТолько", КлючиПеренестиТолько) Тогда
		
		Если ТипЗнч(КлючиПеренестиКакЕсть) = Тип("Строка") Тогда
			
			КлючиПеренестиТолько = СтрЗаменить(КлючиПеренестиТолько, " ", "");
			КлючиПеренестиТолько = СбисРазложитьСтрокуВМассивПодстрок(КлючиПеренестиТолько, ",");
			
		КонецЕсли;
		
	Иначе
		
		КлючиПеренестиТолько = Новый Массив;
		
	КонецЕсли;
	
	ГлубокаяКопия = ГлубокаяКопия = Истина;
	
	ОбъектРезультат = ОбъектОсновной;				
	Если ГлубокаяКопия Тогда
		
		ОбъектРезультат = СоздатьКопиюОбъекта(ОбъектОсновной, ДопПараметры);;				
		
	КонецЕсли;
	
	Если ОбъектОбъединения = Неопределено Тогда
		
		Возврат ОбъектРезультат;
		
	КонецЕсли;
						
	// Указать набор ключей для структур, которые надо переносить. Все остальное игнорируется
	ПростыеТипы = Новый Массив;
	ПростыеТипы.Добавить("Строка");
	ПростыеТипы.Добавить("Число");
	ПростыеТипы.Добавить("Булево");
	ПростыеТипы.Добавить("Дата");
	ПростыеТипы.Добавить("Неопределено");
	ОписаниеПростыхТипов = Новый ОписаниеТипов(ПростыеТипы);
	
	КонтекстОбъединенияРек = Новый Структура("Путь, Уровень, ГлубокаяКопия, ПростыеТипы, КлючиПеренестиТолько, КлючиПеренестиКакЕсть, ЕслиТипНеизвестен",
											"Объект",
											 0);
	КонтекстОбъединенияРек.ГлубокаяКопия				= ГлубокаяКопия;
	КонтекстОбъединенияРек.КлючиПеренестиТолько			= КлючиПеренестиТолько;
	КонтекстОбъединенияРек.КлючиПеренестиКакЕсть		= КлючиПеренестиКакЕсть;
	КонтекстОбъединенияРек.ПростыеТипы					= ОписаниеПростыхТипов;
	КонтекстОбъединенияРек.ЕслиТипНеизвестен			= "какесть";
	
	Возврат ОбъединитьОбъектыУниверсальныхКоллекций_Объект(ОбъектРезультат, ОбъектОбъединения, КонтекстОбъединенияРек) 
	
КонецФункции

#Область include_core2_vo2_МодульОбъекта_АПИ_КлиентСервер_СоздатьКопиюОбъекта
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_АПИ_КлиентСервер_ОбъединитьОбъектыУниверсальныхКоллекций
#КонецОбласти

