
// Область с АПИ обработки, например для использования в ВФК

//Процедура - показывает пользователю выбор по параметрам
//
// Параметры:
//  ПараметрыВыбораВходящие	 - Произвольный	 - что выбираем
//  ДопПараметры			 - Структура	 - расширение
//		"Обработчик": СбисОписаниеОповещения описание функции/процедуры, в которую будет передан результат после выбора значения
//		"Режим": Строка задать явно формат выбора значения.
//
&НаКлиенте
Процедура SABYВыбратьЗначение(ПараметрыВыбораВходящие, ДопПараметры) Экспорт
	Перем ОбработчикВыбора, ПараметрыОтбораВыбора, РежимВыбрать;
	
	Если Не ДопПараметры.Свойство("Обработчик", ОбработчикВыбора) Тогда
		
		ВызватьИсключение "Не указан обработчик для обработки выбора значения!";
		
	КонецЕсли;
	
	Если Не ДопПараметры.Свойство("ПараметрыОтбораВыбора", ПараметрыОтбораВыбора) Тогда
		
		ПараметрыОтбораВыбора = Новый Структура;
		
	КонецЕсли;
	
	ДопПараметры.Свойство("Режим", РежимВыбрать);
	РежимВыбрать = НРег(РежимВыбрать);
	
	Если РежимВыбрать = "каталог" Тогда
		
		ПараметрыВыбораВходящие.Вставить("РежимВыбораФайла", РежимДиалогаВыбораФайла.ВыборКаталога);
		СбисВыбратьФайл(ОбработчикВыбора, ПараметрыВыбораВходящие);
		
	ИначеЕсли ТипЗнч(ПараметрыВыбораВходящие) = Тип("Тип") Тогда
		
		ТипСтрокой = СсылочныйТипСтрокой(ПараметрыВыбораВходящие);
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			МенеджерТипа	= МенеджерОбъектаПоИмени(ТипСтрокой);
			ФормаВыбора		= МенеджерТипа.ПолучитьФормуВыбора();
			
			Если ПараметрыОтбораВыбора.Свойство("ПараметрОтборПоВладельцу") Тогда
				ФормаВыбора.ПараметрОтборПоВладельцу = ПараметрыОтбораВыбора.ПараметрОтборПоВладельцу;
			КонецЕсли;
			Если ПараметрыОтбораВыбора.Свойство("ПараметрВыборПоВладельцу") Тогда
				ФормаВыбора.ПараметрВыборПоВладельцу = ПараметрыОтбораВыбора.ПараметрВыборПоВладельцу;
			КонецЕсли;
			
			Результат		= ФормаВыбора.ОткрытьМодально();
			ПодключитьОтложенноеДействие(ОбработчикВыбора, Результат);
			
		#Иначе
			
			ИмяФормыВыбора	= СтрЗаменить(ТипСтрокой, "Ссылка.", ".") + ".ФормаВыбора";
			
			Если ПараметрыОтбораВыбора.Свойство("ПараметрыФормы") Тогда
				ОткрытьФорму(ИмяФормыВыбора, ПараметрыОтбораВыбора.ПараметрыФормы, ЭтаФорма, , , , ОбработчикВыбора);	
			Иначе
				ОткрытьФорму(ИмяФормыВыбора, , ЭтаФорма, , , , ОбработчикВыбора);
			КонецЕсли;
			
		#КонецЕсли
		
	ИначеЕсли ТипЗнч(ПараметрыВыбораВходящие) = Тип("СписокЗначений") Тогда
		
		СбисВыбратьИзСписка(ПараметрыВыбораВходящие, ДопПараметры);
		
	КонецЕсли;

КонецПроцедуры

// Процедура - Собрать отладочную информацию
//
// Параметры:
//  КаталогВыбора					 - Строка		 - куда сохранять ТИ
//  ПараметрыОтладочнойИнформации	 - Структура	 - Объекты, Модули. Массивы
//		Объекты: Массив произвольных объектов, которые нужно записать в каталог
//		Модули: Массив форм, у которых есть API метод "МодульОбработки_Выгрузить";
//
&НаКлиенте
Процедура SABYСохранитьОтладочнуюИнформацию(КаталогВыбора, ПараметрыОтладочнойИнформации) Экспорт
	Перем ОбработчикРезультата;
	
	Если КаталогВыбора = Неопределено Тогда
		
		Возврат;
		
	ИначеЕсли ТипЗнч(КаталогВыбора) = Тип("Массив") Тогда
		
		КаталогВыбора = КаталогВыбора[0];
		
	КонецЕсли;
	
	ИмяПапкиДляЛога = Формат(ТекущаяДата(), "ДФ =гггг_ММ_дд_ЧЧ_мм_сс");
	ПутьККаталогу	= ПрименитьФорматКСтроке(КаталогВыбора, ИмяПапкиДляЛога, "Каталог");
	Попытка
		
		СоздатьКаталог(ПутьККаталогу);
		
	Исключение
		
		СообщитьСбисИсключение(ИнформацияОбОшибке(), МодульОбъектаКлиентСервер_Представление() + "SABYСохранитьОтладочнуюИнформацию");
		Возврат;
		
	КонецПопытки;
	
	ПараметрыСбораТИ = Новый Структура("Каталог, Имя, Объекты, Модули, Папки");
	ЗаполнитьЗначенияСвойств(ПараметрыСбораТИ, ПараметрыОтладочнойИнформации);
	ПараметрыСбораТИ.Каталог	= КаталогВыбора;
	ПараметрыСбораТИ.Имя		= ИмяПапкиДляЛога;
	
	Если Не ПараметрыОтладочнойИнформации.Свойство("ОбработчикРезультата", ОбработчикРезультата) Тогда
		
		// Если не указано, что делать с результатом сбора, то сгенерировать свое
		ОбработчикРезультата = НовыйСбисОписаниеОповещения("SABYСохранитьОтладочнуюИнформацию_Завершить", МодульОбъектаКлиент());
		
	КонецЕсли;
	
	ПараметрыДляСбора	= Новый Структура;
	ПараметрыДляСбора.Вставить("ОбработчикЗавершить",	ОбработчикРезультата);
	
	СобратьОтладочнуюИнформацию(ПараметрыСбораТИ, ПараметрыДляСбора);

КонецПроцедуры

&НаКлиенте
Процедура SABYСохранитьОтладочнуюИнформацию_Завершить(РезультатСбораТИ, ДопПараметры) Экспорт
	
	Если ОбъектSABY_ЭтоТип(РезультатСбораТИ, "СбисИсключение") Тогда
		
		СбисСообщить(РезультатСбораТИ);
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(РезультатСбораТИ) = Тип("Файл") Тогда
		
		ОбработчикЗавершитьПОвторно = НовыйСбисОписаниеОповещения("SABYСохранитьОтладочнуюИнформацию_Завершить", МодульОбъектаКлиент(), ДопПараметры);
		ПараметрыСохранить = Новый Структура("Режим, ОбработчикРезультата", "НаСбисДиск_Файл", ОбработчикЗавершитьПОвторно);
		SABYСохранить(РезультатСбораТИ, ПараметрыСохранить);
		Возврат;
		
	КонецЕсли;
	
	ЗапуститьПриложение(РезультатСбораТИ);	
	
КонецПроцедуры

// Процедура - API метод для сохранения произвольного значения.
//
// Параметры:
//  ЧтоСохранить	 - Произвольный		 - Описание что записать. Может быть УРЛ, или текст в json/xml, Файл и пр.
//  ДопПараметры	 - Строка, Структура - расширение.
//		Тип Строка = режим записи данных:
//|			"ВКаталог_Текст" - сохранить строку как тестовый файл
//|			"ВКаталог_URL" - скачать по URL в файл
//|			"НаСбисДиск_Файл" - отправить файл на сбис диск
//		Тип Структура. Варианты ключей:
//|			Режим				 - Строка					 - Режим записи данных. Аналогично указанию как Строка. 
//|			ОбработчикРезультата - СбисОписаниеОповещения	 - что позвать после успешной записи. Если не указано, то при получении исключения при записи, вызовет его.
//|			СокращеннаяОшибка	 - Булево					 - при получении ошибки, и отсутствии ОбработчикРезультата указывает - кидать полное исключение, или его сокращенный вариант.
//|			ПолноеИмяФайла		 - Строка					 - Полный путь к файлу, куда нужно сохранить. Если не указано, будет создан новый временный файл:
//|			Имя					 - Строка					 - Если нет ПолноеИмяФайла. Если не указано, то будет сгенерирован файл со случайным именем.
//|			Расширение			 - Строка					 - Если нет ПолноеИмяФайла. Если не указано, то расширение будет взято от ИмяФайла, или сгенерировано по-умолчанию.
//|			Каталог				 - Строка					 - Если нет ПолноеИмяФайла. Если не указано, то будет взят КаталогВременныхФайлов().
//
&НаКлиенте
Процедура SABYСохранить(ЧтоСохранить, ДопПараметры) Экспорт
	Перем ОбработчикПродолжить, РежимЗаписи, ПолноеИсключение;
	
	ЗначениеДляЗаписи = ЧтоСохранить;
	Если ТипЗнч(ДопПараметры) = Тип("Строка") Тогда
		
		РежимЗаписи			= НРег(ДопПараметры);
		ПолноеИсключение	= Истина;
		
	Иначе
		
		ДопПараметры.Свойство("ОбработчикРезультата",	ОбработчикПродолжить);
		ДопПараметры.Свойство("СокращеннаяОшибка",		ПолноеИсключение);
		ПолноеИсключение = ПолноеИсключение = Ложь;
		
		Если Не ДопПараметры.Свойство("Режим", РежимЗаписи) Тогда
			
			// Определить что записываем
			Если ТипЗнч(ЗначениеДляЗаписи) = Тип("Строка") Тогда
		
		       	РежимЗаписи = "вкаталог_текст";
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
			
	РежимЗаписи			= НРег(РежимЗаписи);
	РежимЗаписиРазбить	= Saby_СтрРазделить82(РежимЗаписи, "_");
	
	Если РежимЗаписиРазбить[0] = "вкаталог" Тогда
		
		ОписаниеЗаписать = Новый Структура("Значение, Тип", ЧтоСохранить, РежимЗаписиРазбить[1]);
		РезультатЗаписи = яСохранитьВФайлНаДиск(ОписаниеЗаписать, ДопПараметры);
		
	ИначеЕсли	РежимЗаписиРазбить[0] = "насбисдиск" Тогда
		
		ОписаниеЗаписать = Новый Структура("Значение, Тип", ЧтоСохранить, РежимЗаписиРазбить[1]);
		РезультатЗаписи = яОтправитьФайлНаДиск(ОписаниеЗаписать, ДопПараметры);
		
	Иначе	
		
		РезультатЗаписи = НовыйСбисИсключение("Неизвестный тип для записи на диск (" + РежимЗаписи + ")!", МодульОбъектаКлиентСервер_Представление() + "SABYСохранить");
		
	КонецЕсли;
	
	Если ОбработчикПродолжить = Неопределено Тогда
		
		Если ОбъектSABY_ЭтоТип(РезультатЗаписи, "СбисИсключение") Тогда
			
			Если ПолноеИсключение Тогда 
				
				ВызватьИсключение СбисИсключение_Выгрузить(РезультатЗаписи); 
				
			Иначе
				
				ВызватьИсключение СбисИсключение_Выгрузить(РезультатЗаписи, "Сообщение"); 
				
			КонецЕсли;
			
		КонецЕсли;
		
		СбисСообщить(РезультатЗаписи);
		
	Иначе
		
		ВыполнитьСбисОписаниеОповещения(РезультатЗаписи, ОбработчикПродолжить);

	КонецЕсли;
	
КонецПроцедуры

