
&НаКлиенте
Процедура ВремяОжиданияОтветаПриИзменении(Элемент)
	Кэш.Интеграция.СбисУстановитьВремяОжидания(Кэш, ВремяОжиданияОтвета);
	ПараметрыПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ВходящаяДата_ВыборИзСпискаПриИзменении(Элемент)

	ЭлементОтклонение = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ВходящаяДата_Отклонение");
	
	Если ПоискВходящаяДата = 2 Тогда
		
		ВходящаяДата_ОтклонениеПриИзменении(ЭлементОтклонение);
			
		ЭлементОтклонение.Видимость = Истина;
		
	Иначе
		
		ЭлементОтклонение.Видимость = Ложь;
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, ЭлементОтклонение.Имя + "Ввод").Видимость = Ложь;
		
		#КонецЕсли
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящаяДата_ОтклонениеОчистка(Элемент, СтандартнаяОбработка)
	
	ПоискВходящаяДата_Отклонение = Неопределено;
	СтандартнаяОбработка = Ложь;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Элемент.Видимость = Ложь;
		Элемент = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ВходящаяДата_Отклонение");
		Элемент.Видимость = Истина;
	
	#КонецЕсли

	ВходящаяДата_ОтклонениеПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящаяДата_ОтклонениеПриИзменении(Элемент)

	Если ПоискВходящаяДата_Отклонение = Неопределено Тогда
		
		СписокВариантов					= МодульОбъектаКлиент().СписокДоступныхСпособовВариантовФильтраПериодОтклонение();
		ПоискВходящаяДата_Отклонение	= СписокВариантов[1].Значение;
		
	КонецЕсли;
	
	Если ПоискВходящаяДата_Отклонение = "Дней" Тогда
		
		ПоискВходящаяДата_Отклонение = 0;
		
	КонецЕсли;

	СопоставлениеДата_ОтклонениеУстановитьЭлемент(Элемент, ПоискВходящаяДата_Отклонение);
	ПоискВходящаяДата_Отклонение = ПоискВходящаяДата_Отклонение;
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеДата_ОтклонениеУстановитьЭлемент(Элемент, ЗначениеЭлемента)
		
	Если ТипЗнч(ЗначениеЭлемента) = Тип("Число") Тогда
			
		КнопкаОчистки		= Истина;
		ПараметрыИзменить	= Новый ФиксированнаяСтруктура("СписокВыбора, УстановитьОграничениеТипа", Ложь, Тип("Число"));
	
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			Элемент.Видимость = Ложь;
			Элемент = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, Элемент.Имя + "Ввод");
			Элемент.Видимость = Истина;
		
		#КонецЕсли		
			
	Иначе
		
		КнопкаОчистки		= Ложь;
		СписокВариантов		= МодульОбъектаКлиент().СписокДоступныхСпособовВариантовФильтраПериодОтклонение();
		ПараметрыИзменить	= Новый Структура("СписокВыбора, ЗначениеСписка", СписокВариантов, ЗначениеЭлемента);
		#Если Не ТолстыйКлиентОбычноеПриложение Тогда
			
			ПараметрыИзменить.Вставить("УстановитьОграничениеТипа", Тип("Строка"));
			
		#КонецЕсли
			
	КонецЕсли;
	
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(Элемент, ПараметрыИзменить);
		
	Элемент.КнопкаОчистки = КнопкаОчистки;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокумента_ВыборИзСпискаПриИзменении(Элемент)

	ЭлементОтклонение = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДатаДокумента_Отклонение");
	
	Если ПоискПоДате = 2 Тогда
		
		ДатаДокумента_ОтклонениеПриИзменении(ЭлементОтклонение);
			
		ЭлементОтклонение.Видимость = Истина;
		
	Иначе
		
		ЭлементОтклонение.Видимость = Ложь;		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, ЭлементОтклонение.Имя + "Ввод").Видимость = Ложь;
		
		#КонецЕсли		
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокумента_ОтклонениеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоискПоДате_Отклонение = Неопределено;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Элемент.Видимость = Ложь;
		Элемент = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДатаДокумента_Отклонение");
		Элемент.Видимость = Истина;
	
	#КонецЕсли		

	ДатаДокумента_ОтклонениеПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокумента_ОтклонениеПриИзменении(Элемент)

	Если	ПоискПоДате_Отклонение = Неопределено
		Или	ПоискПоДате_Отклонение = "" Тогда
		
		СписокВариантов			= МодульОбъектаКлиент().СписокДоступныхСпособовВариантовФильтраПериодОтклонение();
		ПоискПоДате_Отклонение	= СписокВариантов[1].Значение;
		
	КонецЕсли;
	
	Если ПоискПоДате_Отклонение = "Дней" Тогда
		
		ПоискПоДате_Отклонение = 0;
		
	КонецЕсли;

	СопоставлениеДата_ОтклонениеУстановитьЭлемент(Элемент, ПоискПоДате_Отклонение);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНастроекПриИзменении(Элемент)
	
	КаталогНастроек = Кэш.ОбщиеФункции.СбисФорматКаталога(КаталогНастроек, Кэш.ПараметрыСистемы.Клиент);
	ПараметрыПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНастроекНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка= Ложь;
	КаталогНастроек	= сбисВыбратьКаталог(КаталогНастроек);

КонецПроцедуры

&НаКлиенте
Процедура КаталогНастроекОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Кэш.ГлавноеОкно.сбисОткрытьКаталог(КаталогНастроек);
КонецПроцедуры 
 
//открывает диалог выбора каталога обмена	
&НаКлиенте
Процедура КаталогОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	ДиалогОткрытия.Заголовок = "Выберите каталог обмена документами"; 
	Если ДиалогОткрытия.Выбрать() Тогда 
		КаталогОбмена = ДиалогОткрытия.Каталог; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЭПНажатие(Элемент)
	
	ПараметрыЗапросаФормы = Новый Структура("Владелец, ПолучитьНовую, КэшироватьФорму", 
											 ЭтаФорма, Истина,		  Ложь);
	ОбработкаВыбора = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("НастройкиПодписания_РезультатДиалога", ЭтаФорма);
	
	фрм = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаНастройкиПодписания", ПараметрыЗапросаФормы);
	фрм.ОписаниеОповещенияОЗакрытии = ОбработкаВыбора;
	фрм.ПоказатьПоверх();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПодписания_РезультатДиалога(РезультатВвода, ДопПараметры = Неопределено)  Экспорт
	
	Если РезультатВвода = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МодульОбъектаКлиент().ИзменитьПараметрСБИС("НастройкиКриптографии", РезультатВвода);

КонецПроцедуры

// Процедура устанавливает видимость элементов формы в зависимости от выбранного варианта настроек прокси	
&НаКлиенте
Процедура НастройкиПроксиСервераПриИзменении(Элемент)
	
	ОбновитьДоступностьНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьАвтоматическоеСопоставлениеНоменклатурыПриИзменении(Элемент)
	ПараметрыПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьНовоеСопоставлениеНоменклатурыПриИзменении(Элемент)
	
	ПараметрыПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОбратноеСопоставлениеПриИзменении(Элемент)
	ПараметрыПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СпособХраненияНастроекПриИзменении(Элемент)

	ОбновитьДоступностьНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЭДПриИзменении(Элемент)
	// Включает/выключает дублирование статусов в типовые регистры 1С
	Если СостояниеЭД = Истина Тогда
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("ИмяФункции",	"ДублироватьСостояние");
		ПараметрыПоиска.Вставить("КлючФорм",	"Статусы_СостоянияЭД");
		Отказ = Ложь;
		ПараметрыПодсистемы = Кэш.ОбщиеФункции.сбисИнициироватьПодсистему(Кэш, ПараметрыПоиска, Отказ);
		Если Отказ Тогда
			Сообщить("Дублирование статусов в типовые регистры 1С не поддерживается для Вашей конфигурации 1С: " + ПараметрыПодсистемы.details);
			СостояниеЭД = Ложь;
		Иначе
			ПараметрыПриИзменении(Элемент);
		КонецЕсли;
	Иначе
		ПараметрыПриИзменении(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СпособХраненияМетокСтатусовПриИзменении(Элемент)
	
	Если СпособХраненияМетокСтатусов = Кэш.Парам.СпособХраненияМетокСтатусов Тогда
		Возврат
	КонецЕсли;
	Попытка
		ИзменитьСпособХраненияМетокСтатусов(СпособХраненияМетокСтатусов);
	Исключение
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ФормаНастройки.СпособХраненияМетокСтатусовПриИзменении")
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособСопоставленияНоменклатурыПриИзменении(Элемент)
	
	ИспользоватьНовоеСопоставлениеНоменклатуры = СпособСопоставленияНоменклатуры = 0;
	ОбновитьЗакладку_СопоставлениеНоменклатуры();
	
КонецПроцедуры

//Процедура записывает в местный и глобальный кэш измененный параметр	
&НаКлиенте
Процедура ПараметрыПриИзменении(Элемент) Экспорт 
	
	ПутьКДаннымФормы = Сред(Элемент.Имя, Найти(Элемент.Имя, "_") + 1); 

	ПараметрНаФормеИзменить(ПутьКДаннымФормы);
	
	ОбновитьДоступностьНастроек();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПараметрНаФормеИзменить(ИмяПараметра) 
	
	Если ИзмененныеПараметры.Свойство(ИмяПараметра) И Кэш.Парам[ИмяПараметра] = ЭтаФорма[ИмяПараметра] Тогда
		ИзмененныеПараметры.Удалить(ИмяПараметра);	
	Иначе 
		ИзмененныеПараметры.Вставить(ИмяПараметра, ИмяПараметра);	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСтатусовПриИзменении(Элемент) Экспорт
	
	Если	Кэш.ГлавноеОкно.ДатаПоследнегоЗапросаСтатусов = ДатаПоследнегоЗапросаСтатусов
		И	Кэш.ГлавноеОкно.ИдентификаторПоследнегоСобытия = ИдентификаторПоследнегоСобытия Тогда
		Возврат;
	КонецЕсли;
		
	Кэш.ГлавноеОкно.ДатаПоследнегоЗапросаСтатусов = ДатаПоследнегоЗапросаСтатусов;
	Кэш.ГлавноеОкно.ИдентификаторПоследнегоСобытия = ИдентификаторПоследнегоСобытия;
	
	МодульОбъектаКлиент().СохранитьМеткиСтатусов(Кэш);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалятьПрефиксыПриИзменении(Элемент)
	
	ПараметрыПриИзменении(Элемент);  
	ПараметрыОчистки = Новый Структура("Тип, Ключ", "ПользовательскиеЗначения.Функции", "НомерДокумента");
	Кэш.ОбщиеФункции.сбисОчиститьЗначениеРассчитанногоОбъекта(Кэш, ПараметрыОчистки);

КонецПроцедуры

&НаКлиенте
Процедура ШифроватьВыборочноПриИзменении(Элемент)
	
	ПараметрыПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресСервисаОбновленийПриИзменении(Элемент)
	
	//+++ МАИ 09.09.2021 Переопределяем сервер обновлений, если пользователь в режиме отладки указал другой
	Кэш.СБИС.ПараметрыИнтеграции.Вставить("АдресСервисаОбновлений", АдресСервисаОбновлений);
	//--- МАИ 09.09.2021

КонецПроцедуры

&НаКлиенте
Процедура РежимОтладкиПриИзменении(Элемент)
	
	РежимОтладкиПриИзмененииОбработчик();
	ПараметрыПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтладкиПриИзмененииОбработчик()
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "КаталогОтладки").Видимость = РежимОтладки;
	Если РежимОтладки Тогда
		
		КаталогОтладки			= ?(ЗначениеЗаполнено(КаталогОтладки), КаталогОтладки, КаталогНастроек);
		ОбработкаВыбораКаталога	= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("КаталогОтладки_ОбработкаВыбора", ЭтаФорма);
		
		Если ЗначениеЗаполнено(КаталогОтладки) Тогда
			
			МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(КаталогОтладки, ОбработкаВыбораКаталога);
			
		Иначе	
			
			МодульОбъектаКлиент().CбисВыбратьФайл(ОбработкаВыбораКаталога, Новый Структура("РежимВыбораФайла", РежимДиалогаВыбораФайла.ВыборКаталога));
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогОтладки_ОбработкаВыбора(РезультатДиалога, ДопПараметры = Неопределено) Экспорт
	Перем КаталогОтладкиБыл;
	
	Если РезультатДиалога = Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(КаталогОтладки) Тогда
			
			МодульОбъектаКлиент().СбисСообщить("Для установки логирования должен быть указан каталог");
			РежимОтладки = Ложь;
			РежимОтладкиПриИзмененииОбработчик();
			
		КонецЕсли;
		Возврат;
	
	КонецЕсли;
	
	Если ТипЗнч(РезультатДиалога) = Тип("Строка") Тогда
		
		ВыбранКаталог = РезультатДиалога;
		
	Иначе
		
		ВыбранКаталог = РезультатДиалога[0];
		
	КонецЕсли;
	
	ВыбранКаталог = МодульОбъектаКлиент().ПрименитьФорматКСтроке(ВыбранКаталог,, "Каталог");
	
	Если МодульОбъектаКлиент().ПроверитьСуществованиеФайлаSABY(ВыбранКаталог, Новый Структура("ЭтоКаталог", Истина)) Тогда
	
		КаталогОтладки = ВыбранКаталог; 
		ПараметрНаФормеИзменить("КаталогОтладки");
		
	Иначе
		
		МодульОбъектаКлиент().СбисСообщить("Указан неверный путь, или выбранный путь не является папкой");
		КаталогОтладки = НастройкиПодключения_Было.КаталогОтладки;
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура КаталогОтладкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОбработкаВыбораКаталога	= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("КаталогОтладки_ОбработкаВыбора", ЭтаФорма);
	
	МодульОбъектаКлиент().CбисВыбратьФайл(ОбработкаВыбораКаталога, Новый Структура("РежимВыбораФайла", РежимДиалогаВыбораФайла.ВыборКаталога));

КонецПроцедуры

&НаКлиенте
Процедура КаталогОтладкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Кэш.ГлавноеОкно.сбисОткрытьКаталог(КаталогОтладки);

КонецПроцедуры

&НаКлиенте
Процедура КаталогОтладкиПриИзменении(Элемент)
	
	КаталогОтладки_ОбработкаВыбора(КаталогОтладки);
	
КонецПроцедуры

&НаКлиенте
Процедура Таблица_СервисВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//alo
	ТекущиеДанныеСтроки = ВыбраннаяСтрока;
	Если Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		ТекущиеДанныеСтроки = Элемент.ТекущиеДанные;
	КонецЕсли;
	Контекст = Новый структура(ТекущиеДанныеСтроки.Ключ, ТекущиеДанныеСтроки.Команда);
	Контекст.Вставить("Кэш", Кэш);
	Кэш.ОбщиеФункции.РассчитатьЗначение(ТекущиеДанныеСтроки.Ключ, Контекст, Кэш);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеКонтрагента1СПриИзменении(Элемент)
	
	Настройки = НастройкиЭлементовЗаполненияКонтрагента1С();	
	ОбновитьНастройкиЭлементовФормы(Настройки.СписокЭлементов, Настройки.ПараметрыНастройки);

КонецПроцедуры

#Область include_core2_vo2_Формы_ФормаНастройки_Интерфейс_События_Элементы_Соединение
#КонецОбласти

