
// Функция - Сохранить данные обрабтотки по результату поиска
//
// Параметры:
//  ОписаниеОбработкиНайдено - Структура	 - результат ВнешняяОбработка_НайтиДанные
// 
// Возвращаемое значение:
//  Строка - Имя файла, куда сохранили значение
//
Функция ВнешняяОбработка_Сохранить(ОписаниеОбработкиНайдено, ДопПараметры = Неопределено) Экспорт
	Перем ПутьСохранить, ИмяФайлаСохранить;
	
	Если ОписаниеОбработкиНайдено.Свойство("Алгоритм") Тогда
		
		МестоПоиска = Новый Массив;
		МестоПоиска.Добавить(ОписаниеОбработкиНайдено);
		РезультатДанные = ВнешняяОбработка_НайтиДанные(МестоПоиска);
		ДанныеОбработки = РезультатДанные.Получить(ОписаниеОбработкиНайдено.Путь);
		
		РезультатЗаписи = ВнешняяОбработка_Сохранить(ДанныеОбработки, ДопПараметры);
		
		Если Не ДопПараметры = Неопределено
			И	ДопПараметры.Свойство("НаКлиент")
			И	ДопПараметры.НаКлиент Тогда
			
			РезультатЗаписи = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(РезультатЗаписи));
			
		КонецЕсли;
		
		Возврат РезультатЗаписи;
	
	Иначе
		
		Если ДопПараметры = Неопределено Тогда
			ИмяФайлаЗаписи = ОписаниеОбработкиНайдено.Имя;
		Иначе
			ИмяФайлаЗаписи = ДопПараметры.ИмяФайла;	
		КонецЕсли;	

		Если ОписаниеОбработкиНайдено.Тип = "Ссылка" Тогда
		
			ДанныеВФК			= ВнешняяОбработка_Данные(ОписаниеОбработкиНайдено.Значение);
			ВременныйФайлВФК	= НовыйВременныйФайл(ИмяФайлаЗаписи, "epf");
			ДанныеВФК.Данные.Записать(ВременныйФайлВФК);
			Возврат ВременныйФайлВФК;
			
		ИначеЕсли ОписаниеОбработкиНайдено.Тип = "Файл" Тогда
			
			Возврат ОписаниеОбработкиНайдено.Значение.ПолноеИмя;
			
		ИначеЕсли ОписаниеОбработкиНайдено.Тип = "ОбъектКонфигурации" Тогда
			
			Текст = Новый ТекстовыйДокумент;
			Текст.УстановитьТекст("Обработка " + ОписаниеОбработкиНайдено.Имя + " встроена в конфигурацию");
			ВременныйФайлВФК = НовыйВременныйФайл(ИмяФайлаЗаписи, "xml");
			Текст.Записать(ВременныйФайлВФК);
			
			Возврат ВременныйФайлВФК;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции
	
// Функция - Возвращает возможные места поиска ВО. Для сервера это справочники. На клиенте добавляется каталог настроек 
// 
// Возвращаемое значение:
//   - Массив структур
//
Функция ВнешняяОбработка_МестаПоискаПоУмолчанию() Экспорт
	
	МестаПоиска = Новый Массив();
	
	МестаПоиска.Добавить(Новый Структура("Путь, Алгоритм", "Справочники.ДополнительныеОтчетыИОбработки",	"Запрос"));
	МестаПоиска.Добавить(Новый Структура("Путь, Алгоритм", "Справочники.ВнешниеОбработки",					"Запрос"));	
	МестаПоиска.Добавить(Новый Структура("Путь, Алгоритм", "Обработки",										"Метаданные"));	

	Возврат МестаПоиска;
	
КонецФункции

Функция ВнешняяОбработка_НайтиПоИмени(ПараметрыОбработки) Экспорт
	
	МестаПоиска = ВнешняяОбработка_МестаПоискаПоУмолчанию();
	ПараметрыПоискаОбработок = Новый Структура("ИмяФайла", ПараметрыОбработки.ИмяОбработки);
	
	РезультатПоиска = ВнешняяОбработка_НайтиДанные(МестаПоиска, ПараметрыПоискаОбработок);
	
	Для Каждого МестоПоиска Из МестаПоиска Цикл
		
		ДанныеРезультат = РезультатПоиска.Получить(МестоПоиска.Путь);
		
		Если ДанныеРезультат.Значение = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Возврат ДанныеРезультат.Значение;
		
	КонецЦикла;
	
КонецФункции

// Функция - Выполняет поиск обработки. Возможные места поиска: файл, справочник, конфигурация. Возвращает путь или ссылку на ВО
//
// Параметры:
//  ПараметрыПоиска	 - 	 Структура(ИмяОбработки, МестаПоиска*) 
//	*Необязательные  
//
// Возвращаемое значение:
//   Строка - путь к файловой обработке
//   СправочникСсылка - на элемент справочника Доп.Обработки
//	 Неопределено - обработка не найдена
Функция ВнешняяОбработка_НайтиДанные(МестоПоискаВходящий, ДопПараметры = Неопределено) Экспорт
	Перем Результат;
	
	Результат = Новый Соответствие;
	
	Если ТипЗнч(МестоПоискаВходящий) = Тип("Массив") Тогда
		
		МестаПоиска = МестоПоискаВходящий;
		
	Иначе
		
		МестаПоиска = Новый Массив;
		МестаПоиска.Добавить(МестоПоискаВходящий);
		
	КонецЕсли;
	
	Для Каждого МестоПоиска Из МестаПоиска Цикл
		
		ПутьПоиска		= МестоПоиска.Путь;
		АлгоритмПоиска	= МестоПоиска.Алгоритм;
		СтрокаОшибки	= "Не удалось подключить внешние функции из """ + ПутьПоиска + """ по причине: ";
		
		Если Не ЗначениеЗаполнено(МестоПоиска.Алгоритм) Тогда
			
			Если Булево(СтрЧислоВхождений(ПутьПоиска, "\")) Тогда
				
				АлгоритмПоиска = "Каталог";
				
			Иначе
				
				АлгоритмПоиска = "Запрос";
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если		АлгоритмПоиска = "Каталог" Тогда
			
			// Это каталог, проверить наличие обработки
			ОписаниеОбработкиНайдено = ВнешняяОбработка_НайтиДанные_Алгоритм_Каталог(МестоПоиска, ДопПараметры);
					
		ИначеЕсли	АлгоритмПоиска = "Отладка" Тогда
			
			ОписаниеОбработкиНайдено = ВнешняяОбработка_НайтиДанные_Алгоритм_Каталог(МестоПоиска, ДопПараметры);
			ОписаниеОбработкиНайдено.Вставить("Отладка", Истина);
			
		ИначеЕсли	АлгоритмПоиска = "Метаданные" Тогда
			
			// Конфигурация
			ОписаниеОбработкиНайдено	= ВнешняяОбработка_НайтиДанные_Алгоритм_Метаданные(МестоПоиска, ДопПараметры);
			
		ИначеЕсли	АлгоритмПоиска = "Запрос" Тогда
			
			ОписаниеОбработкиНайдено	= ВнешняяОбработка_НайтиДанные_Алгоритм_Запрос(МестоПоиска, ДопПараметры);
				
		ИначеЕсли	АлгоритмПоиска = "Хранилище" Тогда
			
			ОписаниеОбработкиНайдено = Новый Структура("Тип, Поиск, Значение, ИД", "Хранилище", МестоПоиска, МестоПоиска.Путь, МестоПоиска.Путь);
			
		Иначе
			
			//Неизвестное место
			Продолжить;
		
		КонецЕсли;
		
		ПутьУжеПроверен = Результат.Получить(ПутьПоиска);
		Если   		ПутьУжеПроверен = Неопределено
			Или		ПутьУжеПроверен.Значение = Неопределено  Тогда
			
			Результат.Вставить(ПутьПоиска, ОписаниеОбработкиНайдено);
			
		КонецЕсли;

	КонецЦикла;	

	Возврат Результат;
	
КонецФункции

Функция ВнешняяОбработка_НайтиДанные_Алгоритм_Каталог(МестоПоиска, ДопПараметры)
	Перем ОбластьПоиска, ИмяФайлаПоиск;
	
	ПоискРезультат = Новый Структура("Алгоритм, Путь, Имя");
	ЗаполнитьЗначенияСвойств(ПоискРезультат, МестоПоиска);
	Если Не МестоПоиска.Свойство("Имя", ИмяФайлаПоиск) Тогда
		
		ИмяФайлаПоиск		= ДопПараметры.ИмяФайла;
		ПоискРезультат.Имя	= ИмяФайлаПоиск;
		
	КонецЕсли;
	
	ИмяФайлаПоиск = ИмяФайлаПоиск + ".epf";
	
	Если МестоПоиска.Свойство("Файл", ОбластьПоиска) Тогда
		
		ИмяФайлаПоискПроверка = Saby_СтрРазделить82(ОбластьПоиска, "\/");
		ИмяФайлаПоискПроверка = ИмяФайлаПоискПроверка[ИмяФайлаПоискПроверка.ВГраница()];
		Если Не ИмяФайлаПоиск = ИмяФайлаПоискПроверка Тогда
			
			ОбластьПоиска = МестоПоиска.Путь + ИмяФайлаПоиск;
			
		КонецЕсли;
		
	Иначе	
		
		ОбластьПоиска = МестоПоиска.Путь + ИмяФайлаПоиск;
		
	КонецЕсли;
	
	ПоискРезультат.Вставить("Файл",	ОбластьПоиска);
		
	ОписаниеОбработкиРезультат = Новый Структура("Тип, Поиск, Имя, Значение, ИД", "Файл", ПоискРезультат, ПоискРезультат.Имя);
	
	Попытка
		
		ФайлВнешнейОбработки = Новый Файл(ОбластьПоиска);
		
		Если Не ФайлВнешнейОбработки.Существует() Тогда//Такого файла нет
			
			Возврат ОписаниеОбработкиРезультат;
			
		КонецЕсли;
		ОписаниеОбработкиРезультат.Значение	= ФайлВнешнейОбработки;
		ОписаниеОбработкиРезультат.ИД		= ОбластьПоиска;
		
	Исключение
		
		ОшибкаПодключенияВФК = НовыйСбисИсключение(ИнформацияОбОшибке(), МодульОбъектаКлиентСервер_Представление() + "ВнешняяОбработка.НайтиПоИмениНаСервере");
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаПодключенияВФК);
		
	КонецПопытки;
	
	Возврат ОписаниеОбработкиРезультат;
	
КонецФункции

Функция ВнешняяОбработка_НайтиДанные_Алгоритм_Метаданные(МестоПоиска, ДопПараметры)
	Перем ИмяФайлаПоиск;
	ПутьПоиска = МестоПоиска.Путь;
	
	ПоискРезультат = Новый Структура("Алгоритм, Путь, Имя");
	ЗаполнитьЗначенияСвойств(ПоискРезультат, МестоПоиска);
	Если Не МестоПоиска.Свойство("Имя", ИмяФайлаПоиск) Тогда
		
		ИмяФайлаПоиск		= ДопПараметры.ИмяФайла;
		ПоискРезультат.Имя	= ИмяФайлаПоиск;
		
	КонецЕсли;

	ОписаниеОбработкиРезультат = Новый Структура("Тип, Поиск, Имя, Значение, ИД", "ОбъектКонфигурации", ПоискРезультат, ИмяФайлаПоиск);
	
	Попытка
		
		ОбластьПоиска = Метаданные[ПутьПоиска];
		
	Исключение
		
		Возврат ОписаниеОбработкиРезультат;
		
	КонецПопытки;
	
	ОписаниеОбработкиРезультат.Значение = ОбластьПоиска.Найти(ИмяФайлаПоиск);
	Если Не ОписаниеОбработкиРезультат.Значение = Неопределено Тогда
		
		ОписаниеОбработкиРезультат.ИД = ОписаниеОбработкиРезультат.Значение.ПолноеИмя();
		
	КонецЕсли;
	
	Возврат ОписаниеОбработкиРезультат;
	
КонецФункции

Функция ВнешняяОбработка_НайтиДанные_Алгоритм_Запрос(МестоПоиска, ДопПараметры)
	Перем ОбластьПоиска, ИмяФайлаПоиск;
	
	ПоискРезультат = Новый Структура("Алгоритм, Путь, Имя");
	ЗаполнитьЗначенияСвойств(ПоискРезультат, МестоПоиска);
	Если Не МестоПоиска.Свойство("Имя", ИмяФайлаПоиск) Тогда
		
		ИмяФайлаПоиск = ДопПараметры.ИмяФайла;
		ПоискРезультат.Имя = ИмяФайлаПоиск;
		
	КонецЕсли;
	
	ПутьПоиска			= ПолучитьПредставлениеТипа(МестоПоиска.Путь, "Запрос");
	МногоСтрочнаяЗапись = Saby_СтрРазделить82(ПутьПоиска, ".", Символы.ПС);
	ОписаниеОбработкиРезультат = Новый Структура("Тип, Поиск, Имя, Значение, ИД", "Неопределено", ПоискРезультат, ИмяФайлаПоиск);
	
	Если	Не МногоСтрочнаяЗапись.Количество()
		Или	Не СбисСуществуетОбъектКонфигурацииСервер(ПутьПоиска) Тогда
		
		Возврат ОписаниеОбработкиРезультат;
		
	КонецЕсли;
	
	СтрокаМетаданных	= МногоСтрочнаяЗапись[0];
	СтрокаПоиска		= МногоСтрочнаяЗапись[1];

	//Справочник обработок
	ОбластьПоиска = Справочники;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	| ОбластьПоиска.Ссылка КАК Обработка
	|ИЗ
	| " + СтрокаМетаданных + "." + СтрокаПоиска + " КАК ОбластьПоиска
	|ГДЕ
	| НЕ ОбластьПоиска.ПометкаУдаления
	| И ОбластьПоиска.%РевизитПоиска% ПОДОБНО &ИмяФайла");
	
	
	Запрос.УстановитьПараметр("ИмяФайла", "%"+ ИмяФайлаПоиск + "%");
	Если СтрокаПоиска = "ДополнительныеОтчетыИОбработки" Тогда
		
		Если Не Метаданные.Перечисления.Найти("ВариантыПубликацииДополнительныхОтчетовИОбработок") = Неопределено Тогда
			Запрос.Текст = Запрос.Текст + "
			| И ОбластьПоиска.Публикация = ЗНАЧЕНИЕ(Перечисление.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется)";
		КонецЕсли;
		
		РеквизитПоиска = "ИмяФайла";
		
	Иначе
		
		РеквизитПоиска = "Наименование";
		
	КонецЕсли;
	
	Если МестоПоиска.Свойство("РеквизитПоиска") Тогда
		
		РеквизитПоиска = МестоПоиска.РеквизитПоиска;
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%РевизитПоиска%",РеквизитПоиска);  
	
	Попытка
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
	Исключение

		ОписаниеОбработкиРезультат.Тип = "Ошибка";
		ОписаниеОбработкиРезультат.Значение = НовыйСбисИсключение(ИнформацияОбОшибке(), МодульОбъектаКлиентСервер_Представление() + "ВнешняяОбработка.Алгоритм.Запрос");
		Возврат ОписаниеОбработкиРезультат;
		
	КонецПопытки;
	
	Если РезультатЗапроса.Следующий() Тогда
		
		ОписаниеОбработкиРезультат.Значение = РезультатЗапроса.Обработка;
		ОписаниеОбработкиРезультат.ИД		= РезультатЗапроса.Обработка.УникальныйИдентификатор();
		ОписаниеОбработкиРезультат.Тип		= "Ссылка"

	КонецЕсли;

	Возврат ОписаниеОбработкиРезультат;
	
КонецФункции

// Функция - Создает новый экземпляр обработки.
//
// Параметры:
//  ВнешняяОбработка	- ссылка на справочник ДопОбработок или путь к файлу 
// 
// Возвращаемое значение:
//   - ОбработкаОбъект.<Имя обработки>. 
//
Функция ВнешняяОбработка_Создать(ВнешняяОбработкаДанные, ДопПараметры = Неопределено) Экспорт
	
	Если ТипЗнч(ВнешняяОбработкаДанные) = Тип("Структура") Тогда
		
		ДанныеСоздать = ВнешняяОбработкаДанные;
		
	Иначе
		
		ДанныеСоздать = ВнешняяОбработка_Данные(ВнешняяОбработкаДанные, ДопПараметры);
		
	КонецЕсли;
	РезультатСоздать = Новый Структура("Тип, Значение");
	Если ДанныеСоздать.Адрес = Неопределено Тогда
		
		РезультатСоздать.Значение	= ДанныеСоздать.Данные.Создать();
		РезультатСоздать.Тип		= "ОбработкаОбъект";
		
	Иначе
		
		#Если Не ТолстыйКлиентОбычноеПриложение Тогда
			
			Если Не ДанныеСоздать.Тип = "Файл" Тогда
				
				ДанныеСоздать.Адрес	= ВнешниеОбработки.Подключить(ДанныеСоздать.Адрес, ДанныеСоздать.Имя, Ложь);
				
			КонецЕсли;
			
		#КонецЕсли 
		
		РезультатСоздать.Значение	= ВнешниеОбработки.Создать(ДанныеСоздать.Адрес, Ложь);
		РезультатСоздать.Тип		= "ВнешняяОбработка";
		
	КонецЕсли;

	Возврат РезультатСоздать;
	
КонецФункции

Функция ВнешняяОбработка_Данные(ВнешняяОбработка, ДопПараметры = Неопределено) Экспорт
	
	Результат = Новый Структура("Адрес, Данные, ХешСумма, Тип, Имя");
	Если	ТипЗнч(ВнешняяОбработка) = Тип("Файл") Тогда
		
		Результат.Адрес = ВнешняяОбработка.ПолноеИмя;
		Результат.Имя	= ВнешняяОбработка.Имя;
		Результат.ХешСумма	= ХешСуммаЗначенияSABY(ВнешняяОбработка);
		Результат.Тип	= "Файл";
		
	ИначеЕсли ТипЗнч(ВнешняяОбработка) = Тип("ОбъектМетаданных") Тогда	
		
		Результат.Данные = Обработки[ВнешняяОбработка.Имя];
		Результат.ХешСумма	= ХешСуммаЗначенияSABY(ВнешняяОбработка);
		Результат.Тип	= "ОбъектМетаданных";
		
	ИначеЕсли ТипЗнч(ВнешняяОбработка) = Тип("Строка") Тогда
		
		Результат.Адрес = ВнешняяОбработка;
		Результат.ХешСумма	= ХешСуммаЗначенияSABY(ВнешняяОбработка);
		Результат.Тип	= "Строка";
		
	Иначе
		
		Если ВнешняяОбработка.Метаданные().Реквизиты.Найти("ХранилищеВнешнейОбработки") = Неопределено Тогда
			
			РеквизитХранилище = "ХранилищеОбработки";
			
		Иначе
			
			РеквизитХранилище = "ХранилищеВнешнейОбработки";
			
		КонецЕсли;
		
		Результат.Данные	= ВнешняяОбработка[РеквизитХранилище].Получить();
		Результат.ХешСумма	= ХешСуммаЗначенияSABY(Результат.Данные);
		Результат.Тип		= "Ссылка";

		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			Результат.Адрес	= ПолучитьИмяВременногоФайла();
			Результат.Данные.Записать(Результат.Адрес);
			
		#Иначе
			
			Результат.Адрес	= ПолучитьНавигационнуюСсылку(ВнешняяОбработка, РеквизитХранилище);
			
		#КонецЕсли
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция - Получает макет из внешней обработки. Опционально помещает во ВременноеХранилище или извлекает текст из макета. 
//
// Параметры:
//  ПараметрыОбработки	 -	Структура(ВнешняяОбработка*, ИмяОбработки*)
//							ВнешняяОбработка	- ссылка на справочник ДопОбработок или путь к файлу
//                          ИмяОбработки		- Имя обработки для поиска обработки, если ВнешняяОбработка не заполнено  	
//  ДопПараметры*		 -	Структура*(Текст, ПоместитьВХранилище*) 
//                       	Текст(Булево) - Вернуть текст из макета
//							ПоместитьВХранилище - Поместить макет во временное хранилище и вернуть ссылку	
// *Необязательные
// Возвращаемое значение:   Двоичные данные, Строка(Адрес в ВХ или текст макета), Неопределено, если не удалось найти обработку 
//   - 
//
Функция ВнешняяОбработка_ПолучитьМакетНаСервере(ПараметрыОбработки, ДопПараметры = Неопределено) Экспорт
	Перем Результат;
	
	Если ПараметрыОбработки.Свойство("ВнешняяОбработка") Тогда
		
		ВнешняяОбработка = ПараметрыОбработки.ВнешняяОбработка;
		
	Иначе
		
		ВнешняяОбработка = ВнешняяОбработка_НайтиПоИмени(ПараметрыОбработки);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВнешняяОбработка) Тогда
		
		ВызватьСбисИсключение("Не удалось найти внешнюю обработку " + ПараметрыОбработки.ИмяОбработки, "ВнешняяОбработка_ПолучитьМакетНаСервере"); 
		
	КонецЕсли;
	
	ВнешняяОбработкаОбъект	= ВнешняяОбработка_Создать(ВнешняяОбработка).Значение;
	Макет					= ВнешняяОбработкаОбъект.ПолучитьМакет(ПараметрыОбработки.ИмяМакета);
	
	Если НЕ ДопПараметры = Неопределено Тогда
		
		Если ДопПараметры.Свойство("Текст")	И ДопПараметры.Текст Тогда
			Результат = Макет.ПолучитьТекст()
		ИначеЕсли ДопПараметры.Свойство("ПоместитьВХранилище")	И ДопПараметры.ПоместитьВХранилище Тогда
			Результат = ПоместитьВоВременноеХранилище(Макет);	
		КонецЕсли;
		
	Иначе
		Результат = Макет;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция - Получает информацию о ВО из элемента справочника. Только для обработок, хранящихся в справочнике(!)
//
// Параметры:
//  ПараметрыОбработки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВнешняяОбработка_ПолучитьСведенияНаСервере(ПараметрыОбработки) Экспорт
	
	Если ПараметрыОбработки.Свойство("ВнешняяОбработка") Тогда
		
		ВнешняяОбработка = ПараметрыОбработки.ВнешняяОбработка;
		
	Иначе
		
		ВнешняяОбработка = ВнешняяОбработка_НайтиПоИмени(ПараметрыОбработки);
		
	КонецЕсли;
		
	Сведения = Новый Структура("Ссылка, Версия, ИмяФайла, ИмяОбъекта");
	ЗаполнитьЗначенияСвойств(Сведения, ВнешняяОбработка);
	
	Возврат Сведения;	
	
КонецФункции

