
// Процедура - обновляет параметр глобального модуля на сервере
//
// Параметры:
//  ИмяПараметраМодуля	 - Строка	 - имя обновляемого параметра
//  АдресПараметраМодуля - ФиксированнаяСтруктрура	 - Тип и Значение
//
Процедура ОбновитьПараметрГлобальногоМодуляНаСервере(ИмяПараметраМодуля, АдресПараметраМодуля = Неопределено) Экспорт
	
	Если ИмяПараметраМодуля = "ОчиститьГлобальныйКэш" Тогда
		
		ОчиститьГлобальныйКэшНаСервере();
		Возврат;
		
	КонецЕсли;
	
	Если АдресПараметраМодуля = Неопределено Тогда
		
		ЗначениеПараметраМодуля = Неопределено;
		
	ИначеЕсли ТипЗнч(АдресПараметраМодуля) = Тип("ФиксированнаяСтруктура") Тогда
		
		Если АдресПараметраМодуля.Тип = "Адрес" Тогда
	
			ЗначениеПараметраМодуля = ПолучитьИзВременногоХранилища(АдресПараметраМодуля.Значение);
			
		Иначе
			
			ЗначениеПараметраМодуля = АдресПараметраМодуля.Значение;
			
		КонецЕсли;
		
	Иначе
		
		ЗначениеПараметраМодуля = АдресПараметраМодуля;
		
	КонецЕсли;
	
	Если ИмяПараметраМодуля = "ГлобальныйКэш" Тогда
		
		ГлобальныйКэш = ЗначениеПараметраМодуля;
		СохранитьГлобальныйКэшНаСервере();
		Возврат;
		
	КонецЕсли;
	
	ГлобальныйКэш		= ПолучитьГлобальныйКэшНаСервере();
	ЗначениеЗаписать	= ГлобальныйКэш;
	КлючЗаписать		= "ГлобальныйКэшСервер";
	
	Если	ИмяПараметраМодуля = "Парам"			Тогда
		
		Для Каждого КлючИЗначениеПараметра Из ЗначениеПараметраМодуля Цикл
			
			ГлобальныйКэш.Парам.Вставить(КлючИЗначениеПараметра.Ключ, КлючИЗначениеПараметра.Значение);
			
		КонецЦикла;
		
	ИначеЕсли	ИмяПараметраМодуля = "ПараметрыСистемы"	Тогда
		
		ГлобальныйКэш.Вставить("ПараметрыСистемы", ЗначениеПараметраМодуля);
		
	ИначеЕсли	ИмяПараметраМодуля = "КэшИни"	Тогда

		ЗначениеЗаписать	= Новый Структура("Данные", Новый Структура);
		КлючЗаписать		= "КэшИниСервер";

	ИначеЕсли	ИмяПараметраМодуля = "Ини"	Тогда

		КлючЗаписать		= "КэшИниСервер";
		ЗначениеЗаписать	= ПрочитатьГлобальныйПараметрНаСервере(КлючЗаписать);
		Для Каждого КлючИЗначениеИни Из ЗначениеПараметраМодуля Цикл
			
			ЗначениеЗаписать.Данные.Вставить(КлючИЗначениеИни.Ключ, КлючИЗначениеИни.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
	
	СохранитьГлобальныйПараметрНаСервере(КлючЗаписать, ЗначениеЗаписать);
	
КонецПроцедуры

Функция ПолучитьГлобальныйКэшНаСервере()
	
	Если ГлобальныйКэш = Неопределено Тогда
		
		ВосстановитьГлобальныйКэшНаСервере();
		
	КонецЕсли;
	
	Возврат ГлобальныйКэш;
	
КонецФункции

Процедура ОчиститьГлобальныйКэшНаСервере()
	
	// Ничего не трогаем, если что кэш просто пересоздадим.
	Если ЭтоСерверУправляемоеПриложение() Тогда
		
		//УстановитьПривилегированныйРежим(Истина);

		//Попытка
		//	
		//	ХранилищеОбщихНастроек.Удалить("Integration", "ГлобальныйКэшСервер", "Integration");
		//	
		//Исключение
		//	
		//	//Обёрнуто скорее на всякий случай, чтобы дальнейшее закрытие не падало.
		//	
		//КонецПопытки;
		//
		//УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли
		
КонецПроцедуры

Процедура СохранитьГлобальныйКэшНаСервере() Экспорт
	
	СохранитьГлобальныйПараметрНаСервере("ГлобальныйКэшСервер", ГлобальныйКэш)
		
КонецПроцедуры

Процедура ВосстановитьГлобальныйКэшНаСервере()

	ГлобальныйКэш = ПрочитатьГлобальныйПараметрНаСервере("ГлобальныйКэшСервер");
		
КонецПроцедуры

Процедура СохранитьГлобальныйПараметрНаСервере(КлючПараметра, ЗначениеПараметра)
	
	Если ЭтоСерверУправляемоеПриложение() Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		ХранилищеОбщихНастроек.Сохранить("Integration", КлючПараметра, ЗначениеПараметра);
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли
		
КонецПроцедуры

Функция ПрочитатьГлобальныйПараметрНаСервере(КлючПараметра)
	
	Если ЭтоСерверУправляемоеПриложение() Тогда                                                
		
		УстановитьПривилегированныйРежим(Истина);
		
		Результат = ХранилищеОбщихНастроек.Загрузить("Integration", КлючПараметра);
		
		УстановитьПривилегированныйРежим(Ложь);
		
	Иначе
		
		СбисИсключение = НовыйСбисИсключение(500, "МодульОбъектаСервер.ПрочитатьГлобальныйПараметрНаСервере",,,"Ошибка работы с параметрами. Дальнейшая работа не возможна!", Новый ФиксированнаяСтруктура("Ключ", КлючПараметра));
		ВызватьИсключение СбисИсключение_ВСтроку(СбисИсключение);
		
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

Процедура ЗаполнитьКонтекстВО3ИзКэшаВО2НаСервере(КэшПарам)  Экспорт
	context_params = НастройкиПодключенияПрочитать();
	АдрСервера = get_prop(КэшПарам, "АдресСервера");
	АдрСервера = СтрЗаменить(АдрСервера, ".sbis", ".saby");
	Если Прав(АдрСервера, 1) = "/" Тогда
		АдрСервера = Лев(АдрСервера, СтрДлина(АдрСервера) - 1);
	КонецЕсли;
	Если Найти(АдрСервера, "https://") = 0 Тогда
		АдрСервера = "https://" + АдрСервера;
	КонецЕсли;
	context_params.Вставить("ApiUrl", АдрСервера);
	ЗаполнитьПараметрыПодключенияПоУРЛ(context_params);
	context_params.Удалить("Proxy");
	ТипПрокси = get_prop(КэшПарам, "ТипПрокси");
	Если ТипПрокси = "Вручную" Тогда
		Proxy = Новый Структура;
		Порт = get_prop(КэшПарам, "ПроксиПорт");
		ТипЧисло  = Новый ОписаниеТипов("Число");
		Порт = ТипЧисло.ПривестиЗначение(Порт);
		АдресСервераСтр	= СтрЗаменить(АдрСервера, ":", Символы.ПС);
		Proxy.Вставить("Protocol", СтрПолучитьСтроку(АдресСервераСтр, 1));
		Proxy.Вставить("Server", get_prop(КэшПарам, "ПроксиСервер"));
		Proxy.Вставить("Port", Порт);
		Proxy.Вставить("User", get_prop(КэшПарам, "ПроксиЛогин"));
		Proxy.Вставить("Password", get_prop(КэшПарам, "ПроксиПароль"));
		context_params.Вставить("Proxy", Proxy);
	КонецЕсли;
	
	СпособОбмена = get_prop(КэшПарам, "СпособОбмена");
	ИмяСвойстваТранспорта = ИмяСвойстваТранспорта();
	Если СпособОбмена = 6 Тогда
		context_params.Вставить(ИмяСвойстваТранспорта, "ExtSdk");
	ИначеЕсли СпособОбмена = 7 Тогда
		context_params.Вставить(ИмяСвойстваТранспорта, "ExtSdkCrypto");
	ИначеЕсли СпособОбмена = 8 Тогда
		context_params.Вставить(ИмяСвойстваТранспорта, "SabyPluginConnector");
	ИначеЕсли СпособОбмена = 9 Тогда
		context_params.Вставить(ИмяСвойстваТранспорта, "SabyHttpsClient");
	ИначеЕсли СпособОбмена = 1 Тогда
		context_params.Вставить(ИмяСвойстваТранспорта, "SabyConnect");
	ИначеЕсли КэшПарам.ИнтеграцияAPIВызовыНаКлиенте Тогда
		context_params.Вставить(ИмяСвойстваТранспорта, "APIClient");	
	Иначе
		context_params.Вставить(ИмяСвойстваТранспорта, "API");
	КонецЕсли;
	
	ИдентификаторСессии = get_prop(КэшПарам, "ИдентификаторСессии");
	sessionExtSdk2 = get_prop(context_params, "sessionExtSdk2", Новый Структура);
	СтруктураСессии = Новый Структура;
	Если ЗначениеЗаполнено(ИдентификаторСессии) Тогда
		СтруктураСессии.Вставить("Session", ИдентификаторСессии);
		ЗаписатьСессию(context_params, СтруктураСессии);
	ИначеЕсли sessionExtSdk2.Свойство("session", ИдентификаторСессии) И ЗначениеЗаполнено(ИдентификаторСессии) Тогда
		СтруктураСессии.Вставить("Session", ИдентификаторСессии);
		ЗаписатьСессию(context_params, СтруктураСессии);
		context_params.Удалить("sessionExtSdk2");
	КонецЕсли;
	
	ВходПоСерту =get_prop(КэшПарам, "ВходПоСертификату");
	Если ВходПоСерту Тогда
		context_params.Вставить("AuthType", "Certificate");
		AutoAuth = get_prop(КэшПарам, "ЗапомнитьСертификат");
		context_params.Вставить("Certificate", get_prop(КэшПарам, "Сертификат"));
	Иначе
		context_params.Вставить("AuthType", "Login");
		AutoAuth = get_prop(КэшПарам, "ЗапомнитьПароль");
		context_params.Вставить("login", get_prop(КэшПарам, "Логин"));
		context_params.Вставить("password", get_prop(КэшПарам, "Пароль"));
	КонецЕсли;
	context_params.Вставить("AutoAuth", AutoAuth);
	
	context_params.Вставить("EncryptSelectively", get_prop(КэшПарам, "ШифроватьВыборочно", Ложь));
	context_params.Вставить("Timeout", get_prop(КэшПарам, "ВремяОжиданияОтвета", 60));
	context_params.Вставить("ExchangeCatalog", get_prop(КэшПарам, "КаталогОбмена", ""));
	context_params.Вставить("AdvancedLog", get_prop(КэшПарам, "РежимОтладки", Ложь));
	context_params.Вставить("LoggingCatalog", get_prop(КэшПарам, "КаталогОтладки", ""));

	НастройкиПодключенияЗаписать(context_params);
КонецПроцедуры

