
Процедура ВыполнитьОбработчикиНаСервере(СтруктураОбработчиков, ДопПараметры) Экспорт
	
	Для каждого мОбработчикКлючИЗначение Из СтруктураОбработчиков Цикл
		ПараметрыОбработчика = мОбработчикКлючИЗначение.Значение;
		ИмяОбработчика = "сбис" + мОбработчикКлючИЗначение.Ключ;
		Попытка
			Если ИмяОбработчика = "сбисДорасчитатьВалютныеСуммыПоДокументамУТ11" Тогда
				сбисДорасчитатьВалютныеСуммыПоДокументамУТ11(ПараметрыОбработчика, ДопПараметры.Документ, ДопПараметры.ГрязныйИни);
			Иначе
				Сообщить("Обработчика """+мОбработчикКлючИЗначение.Ключ+""" не существует.");
				Возврат;
			КонецЕсли;
		Исключение
			ВызватьИсключение "Ошибка при вызове мОбработчика " + """" + мОбработчикКлючИЗначение.Ключ + """: " + ОписаниеОшибки();
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура сбисДорасчитатьВалютныеСуммыПоДокументамУТ11(ПараметрыОбработчика, Документ, ГрязныйИни) Экспорт
	
	МассивДокументов = Новый Массив;
	
	Для каждого ДокументКлючИЗначение Из ПараметрыОбработчика.МассивДокументов Цикл
		Если ДокументКлючИЗначение.Ключ = "сбисПараметрыУзла" Тогда
			Продолжить;	
		КонецЕсли;
		
		ДокументПараметр = СтрЗаменить(ДокументКлючИЗначение.Значение.Значение,"'","");
		
		МассивДокументов.Добавить(Вычислить(ДокументПараметр));
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	РегистрыСведений.СуммыДокументовВВалютахУчета.РассчитатьСуммыДокументовВВалютахУчета(МассивДокументов);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

