// Место для разнообразной копипасты из БСП 
Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт

   Массив = Новый Массив();
   СтруктураСтрокой = "";
   НужнаЗапятая = Ложь;
   Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
       Если НужнаЗапятая Тогда
           СтруктураСтрокой = СтруктураСтрокой + ",";
       КонецЕсли;
       СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
       НужнаЗапятая = Истина;
   КонецЦикла;
   Для Каждого Строка Из ТаблицаЗначений Цикл
       НоваяСтрока = Новый Структура(СтруктураСтрокой);
       ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
       Массив.Добавить(НоваяСтрока);
   КонецЦикла;
   Возврат Массив;

КонецФункции

