
Функция ПолучитьМакетОбработкиНаСервере(ИмяМакета, ДопПараметры=Неопределено) Экспорт 
	
	РезультатМакет = ПолучитьМакет(ИмяМакета);
	Если	Не	ДопПараметры = Неопределено
		И		ДопПараметры.Свойство("Текст")
		И		ДопПараметры.Текст Тогда
		РезультатМакет = РезультатМакет.ПолучитьТекст()
	КонецЕсли;
	
	Возврат РезультатМакет;
	
КонецФункции

Функция ВыполнитьЗапросСПараметрами(ТекстЗапросаВх, ПараметрыЗапросаВх, ДопПараметры = Неопределено) Экспорт
	Перем РазмерВыборки, лПривелегированныйРежим;
	
	ПривелегированныйРежим = Ложь;
	Если	Не	ДопПараметры = Неопределено Тогда

		ДопПараметры.Свойство("Размер",					РазмерВыборки);
		ДопПараметры.Свойство("ПривелегированныйРежим",	лПривелегированныйРежим);

	КонецЕсли;
	
	Если лПривелегированныйРежим = Неопределено Тогда
		
		лПривелегированныйРежим = Ложь;
		
	КонецЕсли;

	//Найти место в запросе для подставноки ограничения выборки
	Если Не РазмерВыборки = Неопределено Тогда
		ИтоговоеВыбрать	= 1;
		
		НомерСтрокиНачалоВыбрать	 = 1;
		ТекстЗапросаОбрезка			 = ТекстЗапросаВх;
		СимволПакет					 = Найти(ТекстЗапросаОбрезка, ";");
		Пока СимволПакет Цикл
			
			// Определить последний пакет, в котором происходит итоговая выборка
			СтрокиПакетаДоИтого			 = Сред(ТекстЗапросаОбрезка, 1, СимволПакет);
			СтрокаССимволомПакета		 = СтрПолучитьСтроку(ТекстЗапросаОбрезка, СтрЧислоСтрок(СтрокиПакетаДоИтого));
			
			ТекстЗапросаОбрезка			 = Сред(ТекстЗапросаОбрезка, СимволПакет + СтрДлина(СтрокаССимволомПакета) - Найти(СтрокаССимволомПакета, ";") + 2);
			НомерСтрокиНачалоВыбрать	 = НомерСтрокиНачалоВыбрать + СтрЧислоСтрок(СтрокиПакетаДоИтого);
			СимволПакет = Найти(ТекстЗапросаОбрезка, ";");
			
		КонецЦикла;
		
		Для НомерСтроки = НомерСтрокиНачалоВыбрать По СтрЧислоСтрок(ТекстЗапросаВх) Цикл
			// Найти в теле основную выборку, чтобы дописать в нее размер
			Если	Лев(СтрПолучитьСтроку(ТекстЗапросаВх, НомерСтроки), 7) = "ВЫБРАТЬ"
				И	(	Лев(СтрПолучитьСтроку(ТекстЗапросаВх, НомерСтроки - 1), 1) = "/"
					Или	Лев(СтрПолучитьСтроку(ТекстЗапросаВх, НомерСтроки - 1), 1) = ";") Тогда
					
				ИтоговоеВыбрать = НомерСтроки;
				
			КонецЕсли;
			
		КонецЦикла;
		СтрокаВыбрать = СтрПолучитьСтроку(ТекстЗапросаВх, ИтоговоеВыбрать);
		Если Не Найти(СтрокаВыбрать, "ПЕРВЫЕ") Тогда
			
			// Допишем размерность
			ТекстЗапросаНовый = "";
			Для НомерСтроки = 1 По ИтоговоеВыбрать - 1 Цикл
				
				ТекстЗапросаНовый = ТекстЗапросаНовый + Символы.ПС + СтрПолучитьСтроку(ТекстЗапросаВх, НомерСтроки);
				
			КонецЦикла;
			
			ТекстЗапросаНовый = ТекстЗапросаНовый + Символы.ПС + СтрокаВыбрать + " ПЕРВЫЕ " + РазмерВыборки;
			
			Для НомерСтроки = ИтоговоеВыбрать + 1 По СтрЧислоСтрок(ТекстЗапросаВх) Цикл
				
				ТекстЗапросаНовый = ТекстЗапросаНовый + Символы.ПС + СтрПолучитьСтроку(ТекстЗапросаВх, НомерСтроки);
				
			КонецЦикла;
			ТекстЗапросаВх = ТекстЗапросаНовый;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапросаВх);
	
	Для Каждого КлючИЗначениеЗапроса Из ПараметрыЗапросаВх Цикл
		
		Запрос.УстановитьПараметр(КлючИЗначениеЗапроса.Ключ, КлючИЗначениеЗапроса.Значение);
		
	КонецЦикла;
	
	Если лПривелегированныйРежим Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
	КонецЕсли;
	
	Попытка
		
		РезультатЗапроса = СериализоватьОбъектДляВозвратаНаКлиент(Запрос.Выполнить());
		
		Если лПривелегированныйРежим Тогда
			
			УстановитьПривилегированныйРежим(Ложь);
			
		КонецЕсли;
		
		Возврат РезультатЗапроса;

	Исключение
		
		ОшибкаЗапроса = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаСервер.ВыполнитьЗапросСПараметрами");
		ВызватьИсключение(СбисИсключение_ВСтроку(ОшибкаЗапроса)); 
		
	КонецПопытки;
		
КонецФункции

// Функция - сериализует объект для возврата на клиент
//
// Параметры:
//  ОбъектСериализации	 - Произвольный	 - объект, который требуется получить на клиенте. 
// 
// Возвращаемое значение:
//  Произвольный - Приводит таблицы и запросы к массиву структур.
//
Функция СериализоватьОбъектДляВозвратаНаКлиент(ОбъектСериализации) Экспорт 
	
	Если ТипЗнч(ОбъектСериализации) = Тип("РезультатЗапроса") Тогда
		
		Результат	= Новый Массив;
		
		Если Не ОбъектСериализации.Пустой() Тогда
			
			Попытка
				
				ВыборкаЗапроса = ОбъектСериализации.Выбрать();
				
			Исключение
				
				ВызватьИсключение(СбисИсключение_ВСтроку(ИнформацияОбОшибке(), "МодульОбъектаСервер.СериализоватьОбъектДляВозвратаНаКлиент")); 
				
			КонецПопытки;

			НаборКлючей = "";
			
			Для Каждого Колонка Из ОбъектСериализации.Колонки Цикл
				НаборКлючей = НаборКлючей + Колонка.Имя + ","
			КонецЦикла;

			НаборКлючей = Лев(НаборКлючей, СтрДлина(НаборКлючей)-1);

			Пока ВыборкаЗапроса.Следующий() Цикл
				
				НоваяСтр = Новый Структура(НаборКлючей);
				ЗаполнитьЗначенияСвойств(НоваяСтр, ВыборкаЗапроса);
				Результат.Добавить(НоваяСтр);
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ОбъектСериализации) = Тип("ТаблицаЗначений") Тогда
		
		Результат	= Новый Массив;
		
		Если ОбъектСериализации.Количество() Тогда
			
			НаборКлючей = "";
			
			Для Каждого Колонка Из ОбъектСериализации.Колонки Цикл
				
				НаборКлючей = НаборКлючей + Колонка.Имя + ","
				
			КонецЦикла;
			
			НаборКлючей = Лев(НаборКлючей, СтрДлина(НаборКлючей)-1);

			Для Каждого СтрокаТаблицы Из ОбъектСериализации Цикл
				
				НоваяСтр = Новый Структура(НаборКлючей);
				ЗаполнитьЗначенияСвойств(НоваяСтр, СтрокаТаблицы);
				Результат.Добавить(НоваяСтр);
				
			КонецЦикла;
			
		КонецЕсли;

	ИначеЕсли ТипЗнч(ОбъектСериализации) = Тип("Структура") Тогда
		
		Результат = Новый Структура;
		
		Для Каждого КлючИЗначение Из ОбъектСериализации Цикл
			
			Результат.Вставить(КлючИЗначение.Ключ, СериализоватьОбъектДляВозвратаНаКлиент(КлючИЗначение.Значение));
			
		КонецЦикла;

	Иначе
		
		Результат = ОбъектСериализации;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СбисЭтоТипСтрокой(ЗначениеСравнить, ТипСтрокойСравнить) Экспорт
	
	ТипПривестиКСтроке = Строка(ЗначениеСравнить);
	Возврат Булево(Найти(ТипПривестиКСтроке, ТипСтрокойСравнить));

КонецФункции

Функция СсылочныйТипСтрокойСервер(Ссылка, ДопПараметры = Неопределено) Экспорт 
	
	Если ТипЗнч(Ссылка) = Тип("Тип") Тогда
		
		ТипНайти = Ссылка;
		
	Иначе
		
		ТипНайти = ТипЗнч(Ссылка);
		
	КонецЕсли;	
	
	МетаданныеТипа = Метаданные.НайтиПоТипу(ТипНайти);
	
	Если МетаданныеТипа = Неопределено Тогда
	
		Запись = Новый ЗаписьXML; 
		Запись.УстановитьСтроку();
		СериализаторXDTO.ЗаписатьXML(Запись, );
		XMLСТипом = Запись.Закрыть();
		ТипСтрокой = Сред(XMLСТипом, Найти(XMLСТипом, ">") + 1);
		ТипСтрокой = Лев(ТипСтрокой, Найти(ТипСтрокой, "<") - 1);
		
	Иначе
		
		ТипСтрокой = МетаданныеТипа.ПолноеИмя();
		ТипСтрокой = СтрЗаменить(ТипСтрокой, ".", "Ссылка.");
		
	КонецЕсли;
	
	Возврат ТипСтрокой;
	
	
КонецФункции // СсылочныйТипСтрокой()

// Функция - приводит переданные данные файлов в формат Base64
//
// Параметры:
//  СбисДанныеФайлов - Массив	 - содержит либо объект двоичные данные, либо ПомещенныеФайлы от метода ПоместитьФайлы/НачатьПомещениеФайловНаСервер
// 
// Возвращаемое значение:
//  Массив - Base64 переданных файлов, в соответствии с индексом переданного массива
//
Функция ФайлыВBASE64Сервер(СбисДанныеФайлов) Экспорт
	
	РезультатBase64 = Новый Массив;
	
	Для Каждого СбисДанныеФайла Из СбисДанныеФайлов Цикл
		
		Если Не ТипЗнч(СбисДанныеФайла) = Тип("ДвоичныеДанные") Тогда
			
			СбисДанныеФайла = ПолучитьИзВременногоХранилища(СбисДанныеФайла.Хранение);
			
		КонецЕсли;
		
		РезультатBase64.Добавить(Base64Строка(СбисДанныеФайла));
		
	КонецЦикла;
	
	Возврат РезультатBase64;
	
КонецФункции

// Функция - отбирает документы по типу
//
// Параметры:
//  Документы1С	 - СписокЗначений	 - Список документов, среди которых нужно выбрать подходящие
//  ТипыДокументов - Строка, Массив	 - Тип нужных документов
// 
// Возвращаемое значение:
//  Структура - где ключ - искомый тип, а значение - найденный массив
//
Функция ВыбратьДокументыПоТипам(Документы1С, ТипыДокументов) Экспорт
	
	Результат = Новый Соответствие;
	Если ТипЗнч(ТипыДокументов) = Тип("Массив") Тогда
		Для Каждого ТипВыбрать Из ТипыДокументов Цикл
			
			Результат.Вставить(ТипВыбрать, ВыбратьДокументыПоТипу(Документы1С, ТипВыбрать));
			
		КонецЦикла;
	Иначе
		
		Результат.Вставить(ТипыДокументов, ВыбратьДокументыПоТипу(Документы1С, ТипыДокументов));

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВыбратьДокументыПоТипу(Документы1С, ТипДокумента)
	
	Если ТипЗнч(Документы1С) = Тип("СписокЗначений") Тогда
		МассивДокументовПроверить = Документы1С.ВыгрузитьЗначения();
	Иначе
		МассивДокументовПроверить = Документы1С;
	КонецЕсли;
		
	ТипДокументаПроверить	= СбисРазложитьСтрокуВМассивПодстрок(ТипДокумента, ".");
	Если ТипДокументаПроверить.Количество() = 1 Тогда
		ТипДокументаПроверить = ТипДокумента;
	Иначе
		ТипДокументаПроверить = ТипДокументаПроверить[1];
	КонецЕсли;
	Результат = Новый Массив;
	Для Каждого Документ1С Из МассивДокументовПроверить Цикл
		Если Документ1С.Метаданные().Имя = ТипДокументаПроверить Тогда
			Результат.Добавить(Документ1С);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Процедура - помещает произвольный объект во временную таблицу в запрос
//
// Параметры:
//  МенеджерВременныхТаблиц	 - МенеджерВременныхТаблиц	 - куда поместить
//  ОписаниеОбъектаПоместить - Струкутра	 - Имя - имя таблицы, Значение - объект, который требуется преобразовать к таблице и поместить в таблицу
//
Процедура ПоместитьОбъектВоВременнуюТаблицу(МенеджерВременныхТаблиц, ОписаниеОбъектаПоместить) Экспорт
	Перем МенеджерВременныхТаблицФункций, СтрокаПоляВыбрать;
	
	ИмяВременнойТаблицы = ОписаниеОбъектаПоместить.Имя;
	ОбъектПоместить		= ОписаниеОбъектаПоместить.Значение;
	Если ТипЗнч(ОбъектПоместить) = Тип("Массив") Тогда
	
		ОписаниеВТ			= ОбъектПоместить[0];
		ТаблицаДляЗапроса	= Новый ТаблицаЗначений;
		
		ТекстЗапроса = "ВЫБРАТЬ	{ПоляТаблицы}
		|ПОМЕСТИТЬ {ИмяВременойТаблицы}
		|ИЗ
		|	&{ИмяВременойТаблицы} КАК {ИмяВременойТаблицы}";
		Для Каждого КлючИЗначениеВТ Из ОписаниеВТ Цикл
			
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ТипЗнч(КлючИЗначениеВТ.Значение));
			
			ТаблицаДляЗапроса.Колонки.Добавить(КлючИЗначениеВТ.Ключ, Новый ОписаниеТипов(МассивТипов));
			Если СтрокаПоляВыбрать = Неопределено Тогда
				СтрокаПоляВыбрать = Символы.ПС + ИмяВременнойТаблицы + "." + КлючИЗначениеВТ.Ключ
			Иначе
				СтрокаПоляВыбрать = СтрокаПоляВыбрать + "," + Символы.ПС + ИмяВременнойТаблицы + "." + КлючИЗначениеВТ.Ключ
			КонецЕсли;
			
		КонецЦикла;
		Для Каждого СтрокаТаблицы Из ОбъектПоместить Цикл
			
			НоваяСтрока = ТаблицаДляЗапроса.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
		КонецЦикла;
		ТекстЗапроса = СтрЗаменить(СтрЗаменить(ТекстЗапроса,	
							"{ПоляТаблицы}",		СтрокаПоляВыбрать),
							"{ИмяВременойТаблицы}", ИмяВременнойТаблицы);
		
		ЗапросСозданиеВТ = Новый Запрос(ТекстЗапроса);
		ЗапросСозданиеВТ.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ЗапросСозданиеВТ.УстановитьПараметр(ИмяВременнойТаблицы, ТаблицаДляЗапроса);
		ЗапросСозданиеВТ.Выполнить();
		
	КонецЕсли;
	
КонецПроцедуры

Функция СериализоватьМассивСтруктурВОбъект(МассивВходящий, ДопПараметры) Экспорт
	
	Если ДопПараметры.Тип = "ДеревоЗначений" Тогда 
		Результат = СериализоватьМассивСтруктурВОбъект_ДеревоЗначение(МассивВходящий);
	ИначеЕсли ДопПараметры.Тип = "ТаблицаЗначений" Тогда
		Результат = СериализоватьМассивСтруктурВОбъект_ТаблицаЗначений(МассивВходящий);
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция СериализоватьМассивСтруктурВОбъект_ДеревоЗначение(МассивСтруктур) Экспорт
	
	ДеревоЗначений = Новый ДеревоЗначений;
	
	Если МассивСтруктур = Неопределено Или МассивСтруктур.Количество() = 0 Тогда
		Возврат ДеревоЗначений;
	Иначе 
		Образец = МассивСтруктур[0];
		ДеревоЗначений.Колонки.Очистить();
		Для Каждого  Стр из Образец Цикл
			Если Стр.Ключ = "Строки" Тогда
				Продолжить;
			КонецЕсли;
			ДеревоЗначений.Колонки.Добавить(Стр.Ключ);
		КонецЦикла;
	КонецЕсли;
	
	ЗаполнитьДеревоЗначениямиМассива(ДеревоЗначений, МассивСтруктур);
	
	Возврат ДеревоЗначений;

КонецФункции

Процедура ЗаполнитьДеревоЗначениямиМассива(ДеревоЗначений, МассивСтруктур)
	
	Для каждого СтруктураСтроки Из МассивСтруктур Цикл
	
		НовСтрока = ДеревоЗначений.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, СтруктураСтроки,, "Строки");
		
		Если СтруктураСтроки.Свойство("Строки")
			И ЗначениеЗаполнено(СтруктураСтроки.Строки) Тогда
		
			ЗаполнитьДеревоЗначениямиМассива(НовСтрока, СтруктураСтроки.Строки)
		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

Функция СериализоватьМассивСтруктурВОбъект_ТаблицаЗначений(МассивСтруктур)
	
	Результат = Новый ТаблицаЗначений;
	Если МассивСтруктур = Неопределено Или МассивСтруктур.Количество() = 0 Тогда
		Возврат Результат;
	Иначе 
		Образец = МассивСтруктур[0];
		Для Каждого  Стр из Образец Цикл
			Результат.Колонки.Добавить(Стр.Ключ );
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого Стр Из МассивСтруктур Цикл
		СтрТ = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТ, Стр);		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#Область include_core2_vo2_Модуль_МодульОбъектаСервер_ОбщиеФункцииИПроцедуры_ЗагрузкаДокументов_БлокФункцийИниФайлов
#КонецОбласти

