// Место для разнообразной копипасты из БСП 

// Возвращает копию исходного массива с уникальными значениями.
//
// Параметры:
//  Массив - Массив - массив произвольных значений.
//
// Возвращаемое значение:
//  Массив - массив уникальных элементов.
//
Функция СбисСвернутьМассив(Знач Массив) Экспорт
	
	Результат = Новый Массив;
	СбисДополнитьМассив(Результат, Массив, Истина);
	Возврат Результат;
	
КонецФункции

// Дополняет массив МассивПриемник значениями из массива МассивИсточник.
//
// Параметры:
//  МассивПриемник - Массив - массив, в который необходимо добавить значения.
//  МассивИсточник - Массив - массив значений для заполнения.
//  ТолькоУникальныеЗначения - Булево - если истина, то в массив будут включены только уникальные значения.
//
Процедура СбисДополнитьМассив(МассивПриемник, МассивИсточник, ТолькоУникальныеЗначения = Ложь) Экспорт
	
	Если ТолькоУникальныеЗначения Тогда
		
		УникальныеЗначения = Новый Соответствие;
		
		Для Каждого Значение Из МассивПриемник Цикл
			УникальныеЗначения.Вставить(Значение, Истина);
		КонецЦикла;
		
		Для Каждого Значение Из МассивИсточник Цикл
			Если УникальныеЗначения[Значение] = Неопределено Тогда
				МассивПриемник.Добавить(Значение);
				УникальныеЗначения.Вставить(Значение, Истина);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для Каждого Значение Из МассивИсточник Цикл
			МассивПриемник.Добавить(Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает строковое имя значения перечисления по его ссылке.
//
// Параметры:
//  Значение - ПеречислениеСсылка - значение, для которого необходимо получить имя перечисления.
//
// Возвращаемое значение:
//  Строка - имя значения перечисления.
//
Функция СбисИмяЗначенияПеречисления(Значение) Экспорт
	
	ОбъектМетаданных = Значение.Метаданные();
	
	ИндексЗначения = Перечисления[ОбъектМетаданных.Имя].Индекс(Значение);
	
	Возврат ОбъектМетаданных.ЗначенияПеречисления[ИндексЗначения].Имя;
	
КонецФункции

// Функция - Находит первое вхождение искомой строки как подстроки в исходной строке.   
// Аналог функции СтрНайти(), доступной с 8.3.6
//
// Параметры:
//  Строка				 - Строка	 - Исходная строка.
//  ПодстрокаПоиска		 - Строка	 - Искомая подстрока.
//  НаправлениеПоиска	 - Строка	 - Указывает направление поиска подстроки в строке.
//  НачальнаяПозиция	 - Число	 - Указывает позицию в строке, с которой начинается поиск.
//  НомерВхождения		 - Число	 - Указывает номер вхождения искомой подстроки в исходной строке.
// 
// Возвращаемое значение:
//  Число - Позиция первого знака найденной подстроки. 
//
Функция SabyСтрНайти(Строка, ПодстрокаПоиска, НаправлениеПоиска = Неопределено, НачальнаяПозиция = Неопределено, НомерВхождения = 1) Экспорт
    
    Если Строка = "" И ПодстрокаПоиска = "" Тогда
        // чтобы отрабатывало как в платформе
        Если НаправлениеПоиска = "СКонца" Тогда
            Если НомерВхождения = 1 Тогда
                Возврат 1;
            Иначе
                Возврат 0;
            КонецЕсли;
        Иначе
            Возврат Мин(НомерВхождения, ?(НачальнаяПозиция = Неопределено, 1, НачальнаяПозиция));
        КонецЕсли;
    КонецЕсли;
    
    Если НачальнаяПозиция = Неопределено Тогда
        Если НаправлениеПоиска = "СКонца" Тогда
            лНачальнаяПозиция = СтрДлина(Строка);
        Иначе
            лНачальнаяПозиция = 1;
        КонецЕсли;
    Иначе
        лНачальнаяПозиция = НачальнаяПозиция;
    КонецЕсли;
    
    Если НаправлениеПоиска = "СКонца" Тогда
        лСтрока = "";
        Для сч = 1 По СтрДлина(Строка) Цикл
            лСтрока = Сред(Строка, сч, 1) + лСтрока;
        КонецЦикла;
        лПодстрокаПоиска = "";
        Для сч = 1 По СтрДлина(ПодстрокаПоиска) Цикл
            лПодстрокаПоиска = Сред(ПодстрокаПоиска, сч, 1) + лПодстрокаПоиска;
        КонецЦикла;
        лНачальнаяПозиция = Макс(1, СтрДлина(Строка) - лНачальнаяПозиция - СтрДлина(ПодстрокаПоиска) + 2);
    Иначе
        лСтрока = Строка;
        лПодстрокаПоиска = ПодстрокаПоиска;
    КонецЕсли;
    
    лНомерВхождения = 0;
    Результат = Найти(Сред(лСтрока, лНачальнаяПозиция), лПодстрокаПоиска);
    Пока Результат Цикл
        лНачальнаяПозиция = Результат + лНачальнаяПозиция + СтрДлина(ПодстрокаПоиска) - 1;
        лНомерВхождения = лНомерВхождения + 1;
        Если лНомерВхождения = НомерВхождения Тогда
            Прервать;
        КонецЕсли;
        Результат = Найти(Сред(лСтрока, лНачальнаяПозиция), лПодстрокаПоиска);
    КонецЦикла;
    
    Если лНомерВхождения = НомерВхождения Тогда
        Результат = лНачальнаяПозиция - СтрДлина(ПодстрокаПоиска);
    Иначе
        Результат = 0;
    КонецЕсли;
        
    Если НаправлениеПоиска = "СКонца" И Результат <> 0 Тогда
        Результат = СтрДлина(Строка) - Результат - СтрДлина(ПодстрокаПоиска) + 2;
    КонецЕсли;
    
    Возврат Результат;
    
КонецФункции 

// Функция - Соединяет массив переданных строк в одну строку с указанным разделителем.
// Аналог функции СтрСоединить(), доступной с 8.3.6.
//
// Параметры:
//   Строки      - Массив - Массив, содержащий объединяемые строки
//   Разделитель - Строка - Строка, которая будет вставлена между объединяемыми строками.
//                          Если параметр не задан, строки будут объединены слитно друг с другом.
//
// Возвращаемое значение:
//   Строка - Строка, содержащая соединенные исходные строки с разделителем между ними.
//
Функция SabyСтрСоединить(Знач Строки, Разделитель = "") Экспорт
	Результат = "";
	Если Строки.Количество() = 1 Тогда
		Результат = Строки[0];
	Иначе
		Если Строки.Количество() > 1 Тогда
			Для Каждого СтрокаДобавить Из Строки Цикл
				Результат = Результат + Разделитель + СтрокаДобавить;
			КонецЦикла;
			Результат = Сред(Результат, СтрДлина(Разделитель) + 1);
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции  

