
// Функция - Определяет, есть справочники, документы и др. таблицы, а так же их реквизиты
// в метаданных конфигурации.
//
// Параметры:
//  ПутьОбъекта	 - Строка	 - Строка по типу: "Контрагенты", "ДополнительныеСведения.Объект".
//   Может содержать Название метаданных (справочник, документ и т.д.): определяет есть ли
//   объект с таким названием. Может серез точку быть указано Название реквизита.
//   Тогда определяется, если ли такой реквизит у объекта метаданных.
//  ДопПараметры - Структура	 - Содержит описание коллекций метаданных, в которых
//   производится поиск.
//   КлассМетаданных (строка) - Справочники, Документы, РегистрыСведений или ПланыВидовХарактеристик.
//   НаборОбъектов (строка) - Реквизиты, ТабличныеЧасти, Измерения или Ресурсы.
//   Объект (любая ссылка) - Ссылка на элемент Справочника, Документа или Плана видов.
//   
// Для перечислений  КлассМетаданных = "Перечисления", ПутьОбъекта = НазваниеПеречисления.Значение
// Возвращаемое значение:
//  Булево - Истина, если указанный объект есть
//
Функция СбисСуществуетОбъектКонфигурацииСервер(ПутьОбъекта, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	ЭлементКоллекцииМетаданных = ЭлементКоллекцииМетаданныхПоПараметрам(ПутьОбъекта, ДопПараметры);
	
	Возврат Не ЭлементКоллекцииМетаданных = Неопределено;
	
КонецФункции

// Функция - Элемент коллекции метаданных по имени
//
// Параметры:
//  ПутьОбъекта	 - Строка	 - Строка по типу: "Контрагенты", "ДополнительныеСведения.Объект".
//   Может содержать Название метаданных (справочник, документ и т.д.): определяет есть ли
//   объект с таким названием. Может серез точку быть указано Название реквизита.
//   Тогда определяется, если ли такой реквизит у объекта метаданных.
//  ДопПараметры - Структура	 - Содержит описание коллекций метаданных, в которых
//   производится поиск.
//   КлассМетаданных (строка) - Справочники, Документы, РегистрыСведений или ПланыВидовХарактеристик.
//   НаборОбъектов (строка) - Реквизиты, ТабличныеЧасти, Измерения или Ресурсы.
//   Объект (любая ссылка) - Ссылка на элемент Справочника, Документа или Плана видов.
// 
// Возвращаемое значение:
//  ОбъектКоллекцииМетаданных/Неопределено - найденное значение
//
Функция ЭлементКоллекцииМетаданныхПоПараметрам(ПутьОбъекта, ДопПараметры) Экспорт
	Перем ЭлементКоллекцииМетаданных;
	
	ПутьМассивом = Saby_СтрРазделить82(ПутьОбъекта, ".");
	КонтекстПолученияПути = Новый Структура("ОбъектМетаданных, ПутьКМетаданным, ПутьОбъекта", Метаданные, Новый Структура, ПутьМассивом);
	ОпределитьПутьМетаданных(КонтекстПолученияПути, ДопПараметры);
	
	ОбъектМетаданных	= КонтекстПолученияПути.ОбъектМетаданных;
	ПутьКМетаданным		= КонтекстПолученияПути.ПутьКМетаданным;
	ПутьМассивом		= КонтекстПолученияПути.ПутьОбъекта;
	
	Если	ПутьКМетаданным = Неопределено
		И	ПутьМассивом.Количество() = 2 Тогда
		
		Возврат Метаданные.НайтиПоПолномуИмени(ПутьОбъекта);
		
	КонецЕсли;

	Для Каждого ЧастьПутиОбъекта Из КонтекстПолученияПути.ПутьОбъекта Цикл
		
		Если ПутьКМетаданным = Неопределено Тогда
			
			Возврат ЭлементКоллекцииМетаданных;
			
		КонецЕсли;
		
		РезультатПоиска = Ложь;
		
		Для Каждого ЧастьПутиМетаданных Из ПутьКМетаданным Цикл
			
			Попытка
				Если ЧастьПутиМетаданных.Ключ = "Перечисления" Тогда
					
					ЭлементКоллекцииМетаданных = ОбъектМетаданных.Перечисления[ПутьМассивом[0]].ЗначенияПеречисления.Найти(ПутьМассивом[1]); 
					Если ЭлементКоллекцииМетаданных = Неопределено Тогда
						Продолжить;	
					КонецЕсли;
					
					Возврат ЭлементКоллекцииМетаданных;
					
				Иначе
					
					ЭлементКоллекцииМетаданных = ОбъектМетаданных[ЧастьПутиМетаданных.Ключ].Найти(ЧастьПутиОбъекта);
					
				КонецЕсли;
				
			Исключение
				
				ВызватьИсключение("Неизвестная коллекция метаданных " + ЧастьПутиМетаданных.Ключ);
				
			КонецПопытки;
			
			Если ЭлементКоллекцииМетаданных = Неопределено Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ОбъектМетаданных = ЭлементКоллекцииМетаданных;
			ПутьКМетаданным = ЧастьПутиМетаданных.Значение;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если НЕ ЭлементКоллекцииМетаданных = Неопределено Тогда
		
		Возврат ЭлементКоллекцииМетаданных;
		
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

Функция ЭлементКоллекцииМетаданныхПоПрямомуПути(ПутьОбъекта, ДопПараметры) Экспорт
	
	Перем ЭлементКоллекцииМетаданных;
	
	ПутьМассивом = Saby_СтрРазделить82(ПутьОбъекта, ".");
	КонтекстПолученияПути = Новый Структура("ОбъектМетаданных, ПутьКМетаданным, ПутьОбъекта", Метаданные, Новый Структура, ПутьМассивом);
	ОпределитьПутьМетаданных(КонтекстПолученияПути, ДопПараметры);
	
	ОбъектМетаданных	= КонтекстПолученияПути.ОбъектМетаданных;
	ПутьКМетаданным		= КонтекстПолученияПути.ПутьКМетаданным;
	ПутьМассивом		= КонтекстПолученияПути.ПутьОбъекта;
	
КонецФункции

Процедура ОпределитьПутьМетаданных(КонтекстПоискаПути, ДопПараметры)
	Перем КлассМетаданных, НаборОбъектов;
	
	Если ДопПараметры.Свойство("Объект")
		И Метаданные.НайтиПоТипу(ТипЗнч(ДопПараметры.Объект)) <> Неопределено Тогда 	
		
		КонтекстПоискаПути.ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ДопПараметры.Объект));
		
		Если НЕ ДопПараметры.Свойство("НаборОбъектов", НаборОбъектов) Тогда
			КонтекстПоискаПути.ПутьКМетаданным = Неопределено;
		ИначеЕсли КонтекстПоискаПути.ПутьОбъекта.Количество() < 3 Тогда
			КонтекстПоискаПути.ПутьКМетаданным = Новый Структура(НаборОбъектов);
		Иначе

			ОбъектыТабличнойЧасти = Новый Структура("Реквизиты");
			КонтекстПоискаПути.ПутьКМетаданным = Новый Структура(НаборОбъектов, ОбъектыТабличнойЧасти);
		КонецЕсли;
		
	ИначеЕсли НЕ ДопПараметры.Свойство("КлассМетаданных", КлассМетаданных) Тогда
		
		КонтекстПоискаПути.ПутьКМетаданным = Неопределено;	
		
	ИначеЕсли НЕ ДопПараметры.Свойство("НаборОбъектов", НаборОбъектов) Тогда
		
		КонтекстПоискаПути.ПутьКМетаданным.Вставить(КлассМетаданных, Неопределено);
		
	ИначеЕсли КонтекстПоискаПути.ПутьОбъекта.Количество() < 3 Тогда
		
		КонтекстПоискаПути.ПутьКМетаданным.Вставить(КлассМетаданных, Новый Структура(НаборОбъектов));
		
	Иначе

		ОбъектыТабличнойЧасти = Новый Структура("Реквизиты");
		КонтекстПоискаПути.ПутьКМетаданным.Вставить(КлассМетаданных, Новый Структура(НаборОбъектов, ОбъектыТабличнойЧасти));
		
	КонецЕсли;
	
КонецПроцедуры

