
// Функция - Рассчитать значение параметра ини на сервере
//
// Параметры:
//  ИмяПараметраРассчитать	 - Строка	 - имя узла ини, в котором надо выполнить расчет
//  Контекст				 - Структура - контекст расчёта
//		Ини: узел инишки, в котором ищется расчитываемый параметр
//		Путь: Массив (Неопределено)
//		
// 
// Возвращаемое значение:
//  Произвольное - посчитанное значение
//
Функция РассчитатьЗначениеSABY(ОписаниеПараметраРассчитать, Контекст) Экспорт
	
	Если ТипЗнч(ОписаниеПараметраРассчитать) = Тип("Строка") Тогда
		
		РассчитываемоеЗначение	= РассчитатьЗначениеSABY_ПолучитьРассчитываемоеЗначение(СокрЛП(ОписаниеПараметраРассчитать), Контекст);
		
	Иначе
		
		РассчитываемоеЗначение = ОписаниеПараметраРассчитать;
		
	КонецЕсли;
	
	Попытка
		
		Возврат РассчитатьЗначениеSABY_РассчитываемоеЗначение(РассчитываемоеЗначение, Контекст);
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Возврат Неопределено;
		
	КонецПопытки;

КонецФункции
	
Функция РассчитатьЗначениеSABY_РассчитываемоеЗначение(РассчитываемоеЗначение, Контекст)
	
	Если РассчитываемоеЗначение = Неопределено Тогда
		
		Возврат Неопределено;
		
	ИначеЕсли РассчитываемоеЗначение.Посчитано Тогда 
		
		Возврат РассчитываемоеЗначение.РассчитанноеЗначение;
		
	КонецЕсли;

	ЗнПер			= РассчитываемоеЗначение.ЗначениеРассчитать;
	РассчитываемоеЗначение.Вставить("Точка", Найти(ЗнПер, "."));
	ПервыйСимвол	= Лев(ЗнПер, 1);
	
	Если		РассчитатьЗначениеSABY_ЭтоФункция(ЗнПер, Контекст) Тогда
		
		// функции из глобальных серверных модулей 1С
		Результат = РассчитатьЗначениеSABY_Функция(РассчитываемоеЗначение, Контекст);
		
	ИначеЕсли	ПервыйСимвол = "^" Тогда	// формула
		
		Результат = РассчитатьЗначениеSABY_Формула(РассчитываемоеЗначение, Контекст);
		
	ИначеЕсли	ПервыйСимвол = "[" Тогда	// ссылка на объект (другую переменную)
		
		Результат = РассчитатьЗначениеSABY_ЗаписьКвадратныеСкобки(РассчитываемоеЗначение, Контекст);
		
	ИначеЕсли	ПервыйСимвол = "'"
			Или ПервыйСимвол = """" Тогда	 // строка
		
		Результат = РассчитатьЗначениеSABY_ЗаписьКавычки(РассчитываемоеЗначение, Контекст);
		
	ИначеЕсли	РассчитываемоеЗначение.Точка Тогда
		
		Результат = РассчитатьЗначениеSABY_ОбращениеМетаданные(РассчитываемоеЗначение, Контекст);
		
	Иначе
		
		// Точки в имени нет - проверка прямого обращения к данным, либо переадресация на другой узел
		Результат = РассчитатьЗначениеSABY_ЗаписьБезСпецСимволов(РассчитываемоеЗначение, Контекст);

	КонецЕсли;
	
	РассчитатьЗначениеSABY_ПривестиИЗапомнитьРезультат(РассчитываемоеЗначение, Результат, Контекст);
	
	Возврат Результат;
		
КонецФункции

Функция РассчитатьЗначениеSABY_ЗаписьБезСпецСимволов(РассчитываемоеЗначение, Контекст)
	Перем лДанныеИсточник, Результат, ЭтоПереадресация;
	
	ЗнПер					= РассчитываемоеЗначение.ЗначениеРассчитать;
	ПроверитьПереадресация	= Истина;
	
	Попытка
		
		Если		Найти("0123456789", Лев(ЗнПер, 1)) Тогда
			
			// Первое свойство - точно не ключ
			ПроверитьПереадресация = Ложь;
			
		ИначеЕсли	Контекст.Свойство("Переменные", лДанныеИсточник)
				И	лДанныеИсточник.Свойство(ЗнПер, Результат) Тогда
		
			Возврат Результат;
			
		ИначеЕсли	Контекст.Свойство("ДанныеИсточник", лДанныеИсточник)
			И		лДанныеИсточник.Свойство(ЗнПер, Результат) Тогда
			
			// Проверить в источнике
			Возврат Результат;
			
		КонецЕсли;
		
	Исключение
		
		// Это не свойство структуры. Осознанно идем в игнор и нарушение соглашения.
		ПроверитьПереадресация = Ложь;
		
	КонецПопытки;	
		
	Если ПроверитьПереадресация Тогда
		
		ЭтоПереадресация = РассчитатьЗначениеSABY_ПолучитьРассчитываемоеЗначение(ЗнПер, Контекст);
		
	КонецЕсли;
	
	Если    ЭтоПереадресация = Неопределено
		Или	ЭтоПереадресация.УзелИни = Неопределено Тогда
		
		// Это не переадресация на другой узел
		Если ЗнПер = "Структура" Тогда
			
			// Заявлена структура как источник
			Если	ТипЗнч(Контекст.Документ) = Тип("Структура")
				Или	ТипЗнч(Контекст.Документ) = Тип("ФиксированнаяСтруктура") Тогда
				
				Результат = Контекст.Документ;
				
			КонецЕсли;
			
		Иначе
			
			// Значение узла является результатом расчета само по себе
			Результат = ЗнПер;
			
		КонецЕсли;
		
	Иначе
		
		Результат = РассчитатьЗначениеSABY_РассчитываемоеЗначение(ЭтоПереадресация, Контекст);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РассчитатьЗначениеSABY_ЗаписьКвадратныеСкобки(РассчитываемоеЗначение, Контекст)
	Перем Объект1С;
	
	ЗнПер		= РассчитываемоеЗначение.ЗначениеРассчитать;
	СтрОбъекта	= Сред(ЗнПер, 2, Найти(ЗнПер, "]") - 2);
	
	РассчитываемоеЗначениеОбъекта = Новый ФиксированнаяСтруктура("ЗначениеРассчитать", СтрОбъекта);
	Объект1С = РассчитатьЗначениеSABY_ЗаписьБезСпецСимволов(РассчитываемоеЗначениеОбъекта, Контекст);
	
	ПараметрИни		= РассчитываемоеЗначение.УзелИни;
	ПрименитьОтбор	= Не	ПараметрИни = Неопределено
					И		ПараметрИни.Свойство("Отбор");

	ТипОбъект1С = ТипЗнч(Объект1С);
	
	Если РассчитываемоеЗначение.Точка Тогда
		
		ИмяРек = Сред(ЗнПер, РассчитываемоеЗначение.Точка + 1);
		
		Если	ТипОбъект1С = Тип("Строка")
			И	Найти(Объект1С, "{") Тогда
			
			// Переменная ссылается на результат функции, значит будем рассчитывать позже на клиенте, в функции РассчитатьЗначение
			Возврат ЗнПер;
			
		КонецЕсли;
		
	Иначе
		
		ИмяРек = "";

	КонецЕсли;
	
	Попытка

		Если ЗначениеЗаполнено(ИмяРек) Тогда
			
			Если		Объект1С = Неопределено Тогда
				
				Возврат Объект1С;
				
			ИначеЕсли	ИмяРек = "Метаданные" Тогда
				
				Объект1С = Объект1С.Метаданные();
				
			ИначеЕсли	ИмяРек = "УникальныйИдентификатор" Тогда 
				
				Объект1С = Строка(Объект1С.УникальныйИдентификатор());
				
			ИначеЕсли	ИмяРек = "ПустаяСсылка" Тогда 
				
				Объект1С = Объект1С.ПустаяСсылка();
				
			ИначеЕсли	ТипОбъект1С = Тип("Строка") Тогда
				
				Объект1С = Неопределено;
				
			Иначе	
				
				Объект1С = Объект1С[ИмяРек];
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПрименитьОтбор Тогда
			
			РассчитываемоеЗначение.Вставить("Объект", Объект1С);
			Объект1С = РассчитатьЗначениеSABY_Отбор(РассчитываемоеЗначение, Контекст);
			
		КонецЕсли;	
			
		Возврат Объект1С;
		
	Исключение
		
		Ошибка = ОписаниеОшибки();
		
	КонецПопытки;
		
КонецФункции

Функция РассчитатьЗначениеSABY_ЗаписьКавычки(РассчитываемоеЗначение, Контекст)

	ЗнПер					= РассчитываемоеЗначение.ЗначениеРассчитать;
	ПараметрИни				= РассчитываемоеЗначение.УзелИни;

	Если		ЗнПер = "'Истина'" Тогда
		
		Возврат Истина;
		
	ИначеЕсли	ЗнПер = "'Ложь'" Тогда
		
		Возврат Ложь;
		
	Иначе
		
		Результат = Сред(ЗнПер, 2, СтрДлина(ЗнПер) - 2);
		
		Если Не ПараметрИни = Неопределено
			И	ПараметрИни.Свойство("Тип")
			И	ПараметрИни.Тип = "Запрос" Тогда
			
			РассчитываемоеЗначение.Вставить("Запрос", Результат);
			Результат = РассчитатьЗначениеSABY_Запрос(РассчитываемоеЗначение, Контекст);
			
		КонецЕсли;
		
		Возврат Результат;
			
	КонецЕсли;
	
КонецФункции

Функция РассчитатьЗначениеSABY_ОбращениеМетаданные(РассчитываемоеЗначение, Контекст)

	ЗнПер		= РассчитываемоеЗначение.ЗначениеРассчитать;
	ПараметрИни	= РассчитываемоеЗначение.УзелИни;

	Если Не ПараметрИни = Неопределено
		И	ПараметрИни.Свойство("Отбор") Тогда
		
		Возврат РассчитатьЗначениеSABY_Отбор(РассчитываемоеЗначение, Контекст);
		
	КонецЕсли;
	
	СтрРазбить		= Saby_СтрРазделить82(ЗнПер, ".");
	ПервыйСимвол	= СтрРазбить[0]; 
	
	ИмяРек = СтрРазбить[1];
	
	Если	ПервыйСимвол = "Документ"
		Или	ПервыйСимвол = "ЗаписьСправочника" Тогда 	
			
			// ссылка на основной объект
			Возврат Контекст.Документ;
					
	КонецЕсли;
	
	Объект1С = МенеджерОбъектаПоИмени(ПервыйСимвол)[ИмяРек];

	Если ПервыйСимвол = "Константа" Тогда
		
		Объект1С = Объект1С.Получить();
		
	КонецЕсли;
	
	Возврат Объект1С;
			
КонецФункции

Функция РассчитатьЗначениеSABY_ПолучитьРассчитываемоеЗначение(ПараметрРассчитать, Контекст)
	Перем ЗначениеДляСчитать, ЗначениеДляПромежуточногоРасчета, НепосчитанныйУзел;
	
	Результат = Новый Структура("ИмяПараметра, Посчитано, ЗначениеРассчитать, РассчитанноеЗначение, УзелИни", ПараметрРассчитать, Ложь);
	Результат.Вставить("Кэшировать",  Не Контекст.Свойство("Кэшировать") Или Контекст.Кэшировать);
	
	ПервыйСимвол	= Лев(ПараметрРассчитать, 1);
	Если (	ПервыйСимвол = "["
		Или	ПервыйСимвол = "'" 
		Или ПервыйСимвол = "{"
		Или ПервыйСимвол = "^")	Тогда
		
		// Параметр и есть строка расчета
		Результат.ЗначениеРассчитать = ПараметрРассчитать;
		
	ИначеЕсли ПараметрРассчитать = "Переменные" Тогда
		
		Результат.РассчитанноеЗначение	= Контекст.Переменные;
 		Результат.Посчитано				= Истина;

	ИначеЕсли Найти("0123456789", ПервыйСимвол) Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		// в случае, если в качестве параметра функции используется, не имя, а значение параметра
		Попытка
			
			// Есть раздел, откуда можно взять узел на крайний случай
			ЕстьУзелИзРаздела =	Контекст.Свойство("ТекущийРазделИни",			НепосчитанныйУзел)
							И	НепосчитанныйУзел.Свойство(ПараметрРассчитать,	НепосчитанныйУзел)
							И	НепосчитанныйУзел.Свойство("Значение");
							
			Если ЕстьУзелИзРаздела Тогда
								
				Результат.УзелИни = НепосчитанныйУзел;
								
			ИначеЕсли Не Контекст.Свойство("Ини", Результат.УзелИни) Тогда
				
				// Нет раздела, нет ини. Не понятно, что считать
				Если ЕстьУзелИзРаздела Тогда
					
					Результат.УзелИни = НепосчитанныйУзел;
					
				Иначе	
					
					Возврат Неопределено;
					
				КонецЕсли;	
				
			ИначеЕсли Контекст.Свойство("Путь") Тогда
				
				// По пути могут быть одноименные узлы, а поэтому надо взять узел самого нижнего уровня.
				Для Каждого ЭлементПуть Из Контекст.Путь Цикл
					
					Если	Результат.УзелИни.Свойство(ПараметрРассчитать, ЗначениеДляПромежуточногоРасчета)
						И	ЗначениеДляПромежуточногоРасчета.Свойство("Значение") Тогда
						
						ЗначениеДляСчитать = ЗначениеДляПромежуточногоРасчета;
						
					КонецЕсли;
					
					Если Не Результат.УзелИни.Свойство(ЭлементПуть, Результат.УзелИни) Тогда
						
						// Проблема с путем. Прервать поиск, значение не посчитано, т.к. нет уверенности что дошли до нужной вложенности
						Возврат Неопределено;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Результат.УзелИни = ЗначениеДляСчитать;

			ИначеЕсли Не Результат.УзелИни.Свойство(ПараметрРассчитать, Результат.УзелИни) Тогда
				
				Возврат Неопределено;
				
			КонецЕсли;
			
			Если Результат.УзелИни = Неопределено Тогда
				
				Возврат Неопределено;
				
			КонецЕсли;
				
			ЕстьЧтоСчитать = ( 	Результат.УзелИни.Свойство("ВычислитьНаСервере",	ЗначениеДляСчитать)
							И	ЗначениеЗаполнено(ЗначениеДляСчитать))
						Или	( 	Результат.УзелИни.Свойство("Вычислить",				ЗначениеДляСчитать)
							И	ЗначениеЗаполнено(ЗначениеДляСчитать))
						Или	(	Результат.УзелИни.Свойство("Значение",				ЗначениеДляСчитать)
							И	ЗначениеЗаполнено(ЗначениеДляСчитать));
						
			Если ЕстьЧтоСчитать Тогда
				
				Результат.ЗначениеРассчитать = ЗначениеДляСчитать;
			
			КонецЕсли;
			Результат.Посчитано = Результат.УзелИни.Свойство("РассчитанноеЗначение", Результат.РассчитанноеЗначение);

		Исключение
			
			Возврат Неопределено;
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция РассчитатьЗначениеSABY_Отбор(РассчитываемоеЗначение, Контекст)
	Перем ОбъектДляОтбора;
	
	ЗнПер		= РассчитываемоеЗначение.ЗначениеРассчитать;
	ПараметрИни	= РассчитываемоеЗначение.УзелИни;
	
	Отбор = Новый Структура;
	Для Каждого Элемент Из ПараметрИни.Отбор Цикл
		
		Отбор.Вставить(Элемент.Ключ, РассчитатьЗначениеSABY(Элемент.Значение, Контекст));
		
	КонецЦикла;
	
	// Отбор по готовому объекту. Это либо текст запроса, либо ТЧ
	Если РассчитываемоеЗначение.Свойство("Объект", ОбъектДляОтбора) Тогда
		
		Если ТипЗнч(ОбъектДляОтбора) = Тип("Строка") Тогда
			
			РассчитываемоеЗначение.Вставить("Отбор",	Отбор);
			РассчитываемоеЗначение.Вставить("Запрос",	ЗнПер);
			Возврат РассчитатьЗначениеSABY_Запрос(РассчитываемоеЗначение, Контекст);
			
		ИначеЕсли ЗначениеЗаполнено(ОбъектДляОтбора) Тогда
			
			Если Отбор.Свойство("НомерСтроки") Тогда
				
				СтрокиТЧ = Новый Массив;
				СтрокиТЧ.Добавить(ОбъектДляОтбора.Получить(Число(Отбор.НомерСтроки)));
				
			Иначе
				
				СтрокиТЧ = ОбъектДляОтбора.НайтиСтроки(Отбор);
				
			КонецЕсли;
			
			СтрокиТЧ = ОбъектДляОтбора.Выгрузить(СтрокиТЧ);
			
		Иначе
			
			СтрокиТЧ = Новый Массив;
			
		КонецЕсли;
		
	Иначе
		
		// Отбор с выбором по метаданным.
		ПредставлениеТипа	= ПолучитьПредставлениеТипа(ЗнПер);
		СтрРазбить			= Saby_СтрРазделить82(ПредставлениеТипа, ".");
		МетаданныеТип		= СтрРазбить[0];
		МетаданныеПодТип	= СтрРазбить[1];
			
		Если		ПараметрИни.Свойство("СрезПоследних") Тогда
			
			ДатаСреза	= РассчитатьЗначениеSABY(ПараметрИни.СрезПоследних, Контекст);
			СтрокиТЧ	= РегистрыСведений[МетаданныеПодТип].СрезПоследних(ДатаСреза, Отбор);
			
		ИначеЕсли	ПараметрИни.Свойство("СрезОстатка") Тогда
				
			ДатаСреза	= РассчитатьЗначениеSABY(ПараметрИни.СрезОстатка, Контекст);
			СтрокиТЧ	= РегистрыНакопления[МетаданныеПодТип].Остатки(ДатаСреза, Отбор);
			
		Иначе
			
			РассчитываемоеЗначение.Вставить("Отбор", Отбор);
			Возврат РассчитатьЗначениеSABY_Запрос(РассчитываемоеЗначение, Контекст);
			
		КонецЕсли;
	
	КонецЕсли;
	
	Если Не СтрокиТЧ.Количество() Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	//СтрокиТЧ = Объект1С.Выгрузить(СтрокиТЧ);
	ВыбратьВсе		=	ПараметрИни.Свойство("Выбрать")
					И	нрег(ПараметрИни.Выбрать) = "все";
	
	Если	ПараметрИни.Свойство("Упорядочить")
		И	ЗначениеЗаполнено(ПараметрИни.Упорядочить) Тогда
		
		Упорядочить = РассчитатьЗначениеSABY(ПараметрИни.Упорядочить, Контекст);
		СтрокиТЧ.Сортировать(Упорядочить);
		
	КонецЕсли;

	РассчитываемоеЗначение.Вставить("Приведено", Истина);
	МассивСтрокТЧ	= Новый Массив;
	НаборКлючей		= СериализоватьОбъектДляВозвратаНаКлиент_КлючиСтроки(СтрокиТЧ);
		
	Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл 
		
		
		СтруктураСтрокиТЧ = Новый Структура(НаборКлючей);
		ЗаполнитьЗначенияСвойств(СтруктураСтрокиТЧ, СтрокаТЧ);
		
		Если ВыбратьВсе Тогда
			
			МассивСтрокТЧ.Добавить(СтруктураСтрокиТЧ);
			Продолжить;
			
		КонецЕсли;
		
		Возврат СтруктураСтрокиТЧ;
		
	КонецЦикла;
	
	Если МассивСтрокТЧ.Количество() Тогда
		
		Возврат МассивСтрокТЧ;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция РассчитатьЗначениеSABY_Запрос(РассчитываемоеЗначение, Контекст)
	Перем Отбор, ТекстЗапроса;
	
	ЗнПер		= РассчитываемоеЗначение.ЗначениеРассчитать;
	ПараметрИни	= РассчитываемоеЗначение.УзелИни;

	СсылкаЭторезультат	= Ложь;
	ВыбратьВсе			=	ПараметрИни.Свойство("Выбрать")
						И	нрег(ПараметрИни.Выбрать) = "все";
						
	Если Не РассчитываемоеЗначение.Свойство("Отбор", Отбор) Тогда
		
		Отбор = Новый Структура;
		Если ПараметрИни.Свойство("Отбор") Тогда
			Для Каждого Элемент Из ПараметрИни.Отбор Цикл
				
				Отбор.Вставить(Элемент.Ключ, РассчитатьЗначениеSABY(Элемент.Значение, Контекст));
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос	= Новый Запрос;

	Если РассчитываемоеЗначение.Свойство("Запрос", ТекстЗапроса) Тогда
		
		Для Каждого Элемент Из Отбор Цикл
			
			Запрос.Параметры.Вставить(Элемент.Ключ, Элемент.Значение);
				
		КонецЦикла;
		
	Иначе
		
		ПредставлениеТипа	= ПолучитьПредставлениеТипа(ЗнПер, "Запрос");
		СтрРазбить			= Saby_СтрРазделить82(ПредставлениеТипа, ".");
		МетаданныеТип		= СтрРазбить[0];
		МетаданныеПодТип	= СтрРазбить[1];

		СтрокаЧтоВыбрать	= "*";

		ТекстЗапроса = "ВЫБРАТЬ
	                      |	{Выбрать}
	                      |ИЗ
	                      |	{0}.{1} КАК ОбъектОтбора
	                      |ГДЕ
						  | ";
		
		ТекстЗапроса = СтрЗаменить(СтрЗаменить(ТекстЗапроса,"{0}", МетаданныеТип),"{1}", МетаданныеПодТип);
		
		Если	МетаданныеТип = "Документ"
			Или	МетаданныеТип = "Справочник"
			Или	Лев(МетаданныеТип, 4) = "План" Тогда
			
			СтрокаЧтоВыбрать	= "ОбъектОтбора.Ссылка КАК Ссылка";
			СсылкаЭторезультат	= Истина;
			ВыбратьВсе			= Ложь;
			
			Если	Отбор.Свойство("ПометкаУдаления")
				И	Отбор.ПометкаУдаления = "" Тогда
				
				Отбор.Удалить("ПометкаУдаления");
				
			ИначеЕсли	Не Отбор.Свойство("ПометкаУдаления")
					ИЛИ	Не ТипЗнч(Отбор.ПометкаУдаления) = Тип("Булево") Тогда
				
				Отбор.Вставить("ПометкаУдаления", Ложь);
			КонецЕсли;
			
		КонецЕсли;
		
		Для Каждого Элемент Из Отбор Цикл
			
			// Параметр Отбор для запроса через "_" приводим к отбору через "."
			КлючПараметр = Сред(Элемент.Ключ, Найти(Элемент.Ключ, "_") + 1);
			Запрос.Параметры.Вставить(КлючПараметр, Элемент.Значение);
			ТекстЗапроса = ТекстЗапроса + СтрЗаменить(СтрЗаменить(
				"ОбъектОтбора.{0} = &{1}
				|	И  ", "{0}",	СтрЗаменить(Элемент.Ключ, "_", "."))
						, "{1}",	КлючПараметр);
				
		КонецЦикла;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{Выбрать}", СтрокаЧтоВыбрать);
	 	ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса) - 5);

	КонецЕсли;

	Запрос.Текст		= ТекстЗапроса;
	РезультатЗапроса	= Запрос.Выполнить();			
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;

	// Установить признак готовой сериализации.
	РассчитываемоеЗначение.Вставить("Приведено", Истина);
	
	Объект1С = РезультатЗапроса.Выбрать();
	
	Если СсылкаЭторезультат Тогда
		
		Объект1С.Следующий();
		Возврат Объект1С.Ссылка;
		
	КонецЕсли;
	
	МассивСтрокТЧ			= Новый Массив;
	СтрокаДляСтрокиТЧ		= СериализоватьОбъектДляВозвратаНаКлиент_КлючиСтроки(РезультатЗапроса);
	
	Пока Объект1С.Следующий() Цикл 
		
		СтруктураСтрокиТЧ = Новый Структура(СтрокаДляСтрокиТЧ);
		ЗаполнитьЗначенияСвойств(СтруктураСтрокиТЧ, Объект1С);
		
		Если ВыбратьВсе Тогда
			
			МассивСтрокТЧ.Добавить(СтруктураСтрокиТЧ);
			Продолжить;
			
		КонецЕсли;
		
		Возврат СтруктураСтрокиТЧ;
		
	КонецЦикла;
	
	Возврат МассивСтрокТЧ;
	
КонецФункции

Функция РассчитатьЗначениеSABY_Формула(РассчитываемоеЗначение, Контекст)
	Перем ТипСтрокойПривести, ФорматИтогПривести;
	
	ЗнПер				= РассчитываемоеЗначение.ЗначениеРассчитать;
	ТекущееПолеИни		= РассчитываемоеЗначение.УзелИни;
	
	Если Не ТекущееПолеИни = Неопределено Тогда
		
		Если 	ТекущееПолеИни.Свойство("Тип")
			И	ТекущееПолеИни.Тип = "Число" Тогда
			
			ТипСтрокойПривести = ТекущееПолеИни.Тип;
			
		КонецЕсли;
		
		ТекущееПолеИни.Свойство("Формат", ФорматИтогПривести);
		
	КонецЕсли;
	
	Попытка
		ВычисляемаяСтрока	= СокрЛП(Сред(ЗнПер, 2));
		ПозСкобки			= Найти(ВычисляемаяСтрока, "(");
		ИмяФормулы			= Нрег(СокрЛП(Лев(ВычисляемаяСтрока, ПозСкобки - 1)));
		
		ВычисляемаяСтрока	= Сред(ВычисляемаяСтрока, ПозСкобки + 1);
		ВычисляемаяСтрока	= Лев(ВычисляемаяСтрока, СтрДлина(ВычисляемаяСтрока) - 1);
		
		МассивПараметров	= Новый Массив;
		УровеньВложенности	= 0;
		Пока СтрДлина(ВычисляемаяСтрока) Цикл 
			
			ПараметрВычислить = РассчитатьЗначениеSABY_Формула_ВычленитьПараметр(ВычисляемаяСтрока);
			МассивПараметров.Добавить(СокрЛП(ПараметрВычислить));
			
		КонецЦикла;
		
		Если ИмяФормулы = ">" Тогда
			Если МассивПараметров.Количество()<>4 Тогда   // неправильно написана формула
				Возврат Неопределено;
			КонецЕсли;
			сч = 0;
			Для Каждого Элемент Из МассивПараметров Цикл
				МассивПараметров[сч] = РассчитатьЗначениеSABY(Элемент, Контекст);
				сч = сч+1;
			КонецЦикла;
			Если МассивПараметров[0]>МассивПараметров[1] Тогда
				Возврат МассивПараметров[2];
			Иначе
				Возврат МассивПараметров[3];
			КонецЕсли;
		ИначеЕсли ИмяФормулы = "<" Тогда
			Если МассивПараметров.Количество()<>4 Тогда   // неправильно написана формула
				Возврат Неопределено;
			КонецЕсли;
			сч = 0;
			Для Каждого Элемент Из МассивПараметров Цикл
				МассивПараметров[сч] = РассчитатьЗначениеSABY(Элемент, Контекст);
				сч = сч+1;
			КонецЦикла;
			Если МассивПараметров[0]<МассивПараметров[1] Тогда
				Возврат МассивПараметров[2];
			Иначе
				Возврат МассивПараметров[3];
			КонецЕсли;
		ИначеЕсли ИмяФормулы = "=" Тогда
			КолПараметров = МассивПараметров.Количество();
			Если НЕ (КолПараметров=3 или КолПараметров=4) Тогда   // неправильно написана формула
				Возврат Неопределено;
			КонецЕсли;
			сч = 0;
			Для Каждого Элемент Из МассивПараметров Цикл
				МассивПараметров[сч] = РассчитатьЗначениеSABY(Элемент, Контекст);
				сч = сч+1;
			КонецЦикла;
			Если КолПараметров = 3 Тогда
				Если ЗначениеЗаполнено(МассивПараметров[0]) Тогда
					Возврат МассивПараметров[1];
				Иначе
					Возврат МассивПараметров[2];
				КонецЕсли;
			Иначе
				Если МассивПараметров[0]=МассивПараметров[1] Тогда
					Возврат МассивПараметров[2];
				Иначе
					Возврат МассивПараметров[3];
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ИмяФормулы = "!=" Тогда
			КолПараметров = МассивПараметров.Количество();
			Если НЕ (КолПараметров=3 или КолПараметров=4) Тогда   // неправильно написана формула
				Возврат Неопределено;
			КонецЕсли;
			сч = 0;
			Для Каждого Элемент Из МассивПараметров Цикл
				МассивПараметров[сч] = РассчитатьЗначениеSABY(Элемент, Контекст);
				сч = сч+1;
			КонецЦикла;
			Если КолПараметров = 3 Тогда
				Если НЕ ЗначениеЗаполнено(МассивПараметров[0]) Тогда
					Возврат МассивПараметров[1];
				Иначе
					Возврат МассивПараметров[2];
				КонецЕсли;
			Иначе
				Если МассивПараметров[0]<>МассивПараметров[1] Тогда
					Возврат МассивПараметров[2];
				Иначе
					Возврат МассивПараметров[3];
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ИмяФормулы = "+" Тогда
			
			Если ТипСтрокойПривести = "Число" Тогда
				
				Результат = 0;
				
			Иначе
				
				Результат = "";
				
			КонецЕсли;
			
			// Пока приведение только для формулы +
			Для Каждого Элемент Из МассивПараметров Цикл
				
				РассчитываемоеЗначениеПараметра = РассчитатьЗначениеSABY_ПолучитьРассчитываемоеЗначение(Элемент, Контекст);
				Если РассчитываемоеЗначениеПараметра.УзелИни = Неопределено Тогда
					
					РассчитываемоеЗначениеПараметра.Кэшировать	= Ложь;
					РассчитываемоеЗначениеПараметра.УзелИни		= ТекущееПолеИни;
					
				КонецЕсли;
				
				Элемент = РассчитатьЗначениеSABY(РассчитываемоеЗначениеПараметра, Контекст);
				Результат = Результат + Элемент;
				
			КонецЦикла;
			
			Если Не ФорматИтогПривести = Неопределено Тогда
				
				Результат = Формат(Результат, ФорматИтогПривести);
				
			КонецЕсли;
			
			Возврат Результат;
			
		ИначеЕсли ИмяФормулы = "-" Тогда 
			Если НЕ МассивПараметров.Количество() = 2 Тогда
				Возврат 0;  
			КонецЕсли;  
			Если ТипСтрокойПривести = Неопределено Тогда
				ОписаниеТипа = Новый ОписаниеТипов("Число");
				
			Иначе
				
				ОписаниеТипа = Новый ОписаниеТипов(ТипСтрокойПривести);
				
			КонецЕсли;
			Для номерПарам = 0 По 1 Цикл
				МассивПараметров[номерПарам] = РассчитатьЗначениеSABY(МассивПараметров[номерПарам], Контекст);
				МассивПараметров[номерПарам] = ОписаниеТипа.ПривестиЗначение(МассивПараметров[номерПарам]);
			КонецЦикла;
			Результат = МассивПараметров[0] - МассивПараметров[1];
			
			Если Не ФорматИтогПривести = Неопределено Тогда
				
				Результат = Формат(Результат, ФорматИтогПривести);
				
			КонецЕсли;
			
			Возврат Результат;
			
		ИначеЕсли ИмяФормулы = "/" Тогда
			
			КолПараметров = МассивПараметров.Количество();
			
			Если Не КолПараметров = 2 Тогда
				
				Возврат 0;
				
			КонецЕсли;
			
			сч = 0;
			Для Каждого Элемент Из МассивПараметров Цикл
				
				МассивПараметров[сч] = РассчитатьЗначениеSABY(Элемент, Контекст);
				сч = сч+1;
			КонецЦикла;
			Попытка
				Результат = ?(Число(МассивПараметров[1]) = 0, Число(МассивПараметров[0]), Число(МассивПараметров[0]) / Число(МассивПараметров[1]));
			Исключение
				Результат = 0;
			КонецПопытки;
			
			Если Не ФорматИтогПривести = Неопределено Тогда
				Результат = Формат(Результат, ФорматИтогПривести);
			КонецЕсли;
			
			Возврат Результат;

		ИначеЕсли ИмяФормулы = "*" Тогда
			Результат = 1;
			
			Для Каждого Элемент Из МассивПараметров Цикл
				
				Элемент = РассчитатьЗначениеSABY(Элемент, Контекст);
				Результат = Результат * Число(Элемент);
				
			КонецЦикла;
			
			Если Не ФорматИтогПривести = Неопределено Тогда
				
				Результат = Формат(Результат, ФорматИтогПривести);
				
			КонецЕсли;
			
			Возврат Результат;
		ИначеЕсли ИмяФормулы = "сред" Тогда
			КолПараметров = МассивПараметров.Количество();
			Если НЕ (КолПараметров=2 или КолПараметров=3) Тогда
				Возврат Неопределено;
			КонецЕсли;
			сч = 0;
			Для Каждого Элемент Из МассивПараметров Цикл
				МассивПараметров[сч] = РассчитатьЗначениеSABY(Элемент, Контекст);
				сч = сч+1;
			КонецЦикла;
			Если КолПараметров=2 Тогда
				Возврат Сред(МассивПараметров[0],МассивПараметров[1]);
			Иначе
				Возврат Сред(МассивПараметров[0],МассивПараметров[1],МассивПараметров[2]);	
			КонецЕсли;
		ИначеЕсли ИмяФормулы = "найти" Тогда
			КолПараметров = МассивПараметров.Количество();
			Если КолПараметров<>2 Тогда
				Возврат Неопределено;
			КонецЕсли;
			сч = 0;
			Для Каждого Элемент Из МассивПараметров Цикл
				МассивПараметров[сч] = РассчитатьЗначениеSABY(Элемент, Контекст);
				сч = сч+1;
			КонецЦикла;
			Возврат Найти(МассивПараметров[0],МассивПараметров[1]);	
		ИначеЕсли ИмяФормулы = "или" Тогда
			КолПараметров = МассивПараметров.Количество();
			Если МассивПараметров.Количество()<3 Тогда   // неправильно написана формула
				Возврат Неопределено;
			КонецЕсли;
			МассивПараметров[КолПараметров-1] = РассчитатьЗначениеSABY(МассивПараметров[КолПараметров-1], Контекст);
			МассивПараметров[КолПараметров-2] = РассчитатьЗначениеSABY(МассивПараметров[КолПараметров-2], Контекст);
			Для сч = 0 По КолПараметров-3 Цикл
				МассивПараметров[сч] = РассчитатьЗначениеSABY(МассивПараметров[сч], Контекст);
				Если МассивПараметров[сч] = Истина Тогда
					Возврат МассивПараметров[КолПараметров-2];
				КонецЕсли;
			КонецЦикла;
			Возврат МассивПараметров[КолПараметров-1];
		ИначеЕсли ИмяФормулы = "и" Тогда
			КолПараметров = МассивПараметров.Количество();
			Если МассивПараметров.Количество()<3 Тогда   // неправильно написана формула
				Возврат Неопределено;
			КонецЕсли;
			МассивПараметров[КолПараметров-1] = РассчитатьЗначениеSABY(МассивПараметров[КолПараметров-1], Контекст);
			МассивПараметров[КолПараметров-2] = РассчитатьЗначениеSABY(МассивПараметров[КолПараметров-2], Контекст);
			Для сч = 0 По КолПараметров-3 Цикл
				МассивПараметров[сч] = РассчитатьЗначениеSABY(МассивПараметров[сч], Контекст);
				Если МассивПараметров[сч] = Ложь
						Или МассивПараметров[сч] = Неопределено Тогда
					Возврат МассивПараметров[КолПараметров-1];
				КонецЕсли;
			КонецЦикла;
			Возврат МассивПараметров[КолПараметров-2];
		ИначеЕсли ИмяФормулы = "окрбольше" Тогда
			КолПараметров = МассивПараметров.Количество();
			Если МассивПараметров.Количество()<>1 Тогда   // неправильно написана формула
				Возврат Неопределено;
			КонецЕсли;
			МассивПараметров[0] = РассчитатьЗначениеSABY(МассивПараметров[0], Контекст);
			Если Цел(МассивПараметров[0]) = МассивПараметров[0] Тогда
				Возврат МассивПараметров[0];
			Иначе
				Возврат Цел(МассивПараметров[0])+1;
			КонецЕсли;
		ИначеЕсли ИмяФормулы = "окр" Тогда
			КолПараметров = МассивПараметров.Количество();
			Если МассивПараметров.Количество()<2 Тогда   // неправильно написана формула
				Возврат Неопределено;
			КонецЕсли;
			сч = 0;
			Для Каждого Элемент Из МассивПараметров Цикл
				МассивПараметров[сч] = РассчитатьЗначениеSABY(Элемент, Контекст);
				сч = сч+1;
			КонецЦикла;
			Если МассивПараметров.Количество() = 2 Тогда
				Возврат Окр(Число(МассивПараметров[0]), Число(МассивПараметров[1]));
			Иначе
				Возврат Окр(Число(МассивПараметров[0]), Число(МассивПараметров[1]), РежимОкругления.Окр15как10);
			КонецЕсли;
		ИначеЕсли ИмяФормулы = "типзнч" Тогда
			
			КолПараметров = МассивПараметров.Количество();
			Если Не МассивПараметров.Количество() = 1 Тогда
				
				// неправильно написана формула
				Возврат Неопределено;
				
			КонецЕсли;
			Парам = РассчитатьЗначениеSABY(МассивПараметров[0], Контекст);
			Возврат ПолучитьПредставлениеТипа(Парам);
			
		КонецЕсли;
		
	Исключение
		Ошибка = ОписаниеОшибки();
		Возврат Неопределено
	КонецПопытки
	
КонецФункции

Функция РассчитатьЗначениеSABY_Формула_ВычленитьПараметр(ВычисляемаяСтрока)
	
	УровеньВложенности	= 0;
	Разделитель			= ",";
	ПараметрВычислить	= Сред(ВычисляемаяСтрока, 1, Найти(ВычисляемаяСтрока, Разделитель) -1);
	ВычисляемаяСтрока	= Сред(ВычисляемаяСтрока, СтрДлина(ПараметрВычислить) + 2);
	ПараметрВычислить	= СокрЛП(ПараметрВычислить);
	Результат			= ПараметрВычислить;
	
	Если    Не Лев(ПараметрВычислить, 1) = "'"
		И	Найти(ПараметрВычислить, "(") Тогда
		
		УровеньВложенности = УровеньВложенности + 1;
		
	КонецЕсли;
	
	Пока	УровеньВложенности
		И	СтрДлина(ВычисляемаяСтрока) Цикл 
		
		ПараметрВычислить	= Сред(ВычисляемаяСтрока, 1, Найти(ВычисляемаяСтрока, ",") -1);
		ВычисляемаяСтрока	= Сред(ВычисляемаяСтрока, СтрДлина(ПараметрВычислить) + 2);
		ПараметрВычислить	= СокрЛП(ПараметрВычислить);
		Результат			= Результат + Разделитель + ПараметрВычислить;
		Если Лев(ПараметрВычислить, 1) = "'" Тогда
			
			// Это строковый параметр в формуле, не проверяем на вложенность.
			Продолжить;
			
		ИначеЕсли Найти(ПараметрВычислить, "(") Тогда
			
			УровеньВложенности = УровеньВложенности + 1;
			
		ИначеЕсли Найти(ПараметрВычислить, ")") Тогда
			
			УровеньВложенности = УровеньВложенности - 1;
			
		КонецЕсли;
		
	КонецЦикла;
	Возврат Результат;

КонецФункции

Функция РассчитатьЗначениеSABY_Функция(РассчитываемоеЗначение, Контекст)
	Перем Документ, СтрТабл, Переменные, РассчитыватьФункцию;
	
	СбисПараметр = РассчитываемоеЗначение.ЗначениеРассчитать;

	Если		Контекст.Свойство("Параметры", РассчитыватьФункцию)
		И		РассчитыватьФункцию.Свойство("ВычислитьФункции", РассчитыватьФункцию)
		И	Не	РассчитыватьФункцию Тогда
		
		Возврат СбисПараметр;
		
	КонецЕсли;
	
	Если Контекст.Свойство("ИмяОбъекта") Тогда
		
		Контекст.ДанныеРезультат.Свойство(Контекст.ИмяОбъекта, Документ);
		
	КонецЕсли;	
	Если Контекст.Свойство("ИмяОбъектаЛокальное") Тогда
		
		Контекст.ДанныеРезультат.Свойство(Контекст.ИмяОбъектаЛокальное, СтрТабл);
		
	КонецЕсли;
	
	Контекст.Свойство("Переменные", Переменные);
	
	Если Сред(СбисПараметр, 2, 14) = "МодульОбъекта." Тогда
		
		ПарамерВычислить = Сред(СбисПараметр, 16, СтрДлина(СбисПараметр) - 16);
		
	Иначе
		
		ПарамерВычислить = Сред(СбисПараметр, 2, СтрДлина(СбисПараметр)-2);
		
	КонецЕсли;
	
	Попытка
		
		Результат = Вычислить(ПарамерВычислить);

	Исключение
		
		Ошибка = ОписаниеОшибки();
		
		Если Найти(Ошибка, "Обращение к процедуре объекта как к функции") Тогда
			Попытка
				
				Выполнить(ПарамерВычислить);
				
			Исключение
				
				Ошибка = ОписаниеОшибки();
				Сообщить(Ошибка+ "(ошибка при выполнении процедуры """+Сред(СбисПараметр, 2, СтрДлина(СбисПараметр)-2)+""")");
				
			КонецПопытки;
		#Если ТолстыйКлиентОбычноеПриложение Тогда
		ИначеЕсли	Найти(Ошибка, "Ошибка компиляции при вычислении выражения") Тогда
			
			Сообщить("Вы запустили 1С:Предприятие в режиме ""Толстый клиент"". Установите режим запуска ""Тонкий клиент"" или обратитесь к администратору. " + "(ошибка при выполнении процедуры или вычисления функции """+Сред(СбисПараметр, 2, СтрДлина(СбисПараметр)-2)+""")");
				
		#КонецЕсли				
		Иначе
			
			Сообщить(Ошибка+ "(ошибка при вычислении функции """+Сред(СбисПараметр, 2, СтрДлина(СбисПараметр)-2)+""")");
			
		КонецЕсли;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

Процедура РассчитатьЗначениеSABY_ПривестиИЗапомнитьРезультат(РассчитываемоеЗначение, РасчитанноеЗначение, Контекст)
	Перем ТипПривести;

	УзелИни					= РассчитываемоеЗначение.УзелИни;
	ПриведенныйРезультат	= РасчитанноеЗначение;
	
	Если	УзелИни = Неопределено
		Или УзелИни = ПриведенныйРезультат Тогда
		
		// Результат это этот же узел ини, ничего не трогаем, значение не сохраняем.
		Возврат;
		
	КонецЕсли;
	
	Если		УзелИни.Свойство("Тип", ТипПривести)
		И Не(	РассчитываемоеЗначение.Свойство("Приведено")
			И	РассчитываемоеЗначение.Приведено) Тогда
			
		ТипПривести = НРег(ТипПривести);
		Если ТипПривести = "число"	Тогда
			
			ПриведенныйРезультат = ПривестиТипСбис(РасчитанноеЗначение,	ТипПривести);
			Если		ПриведенныйРезультат		= 0
				И	Не	Лев(РасчитанноеЗначение, 1)	= "0" Тогда
				
				Возврат;
				
			КонецЕсли;
			
		Иначе
			
			ПриведенныйРезультат = ПривестиТипСбис(РасчитанноеЗначение,	ТипПривести);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если УзелИни.Свойство("Формат") Тогда

		Если РассчитатьЗначениеSABY_ЭтоФункция(РасчитанноеЗначение, Контекст) Тогда
			
			ПриведенныйРезультат = СоздатьКопиюОбъекта(УзелИни);
						
		Иначе
			
			ПриведенныйРезультат = Формат(РасчитанноеЗначение,	УзелИни.Формат);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если РассчитываемоеЗначение.Кэшировать Тогда
		
		РассчитываемоеЗначение.УзелИни.Вставить("РассчитанноеЗначение", ПриведенныйРезультат);
		
	КонецЕсли;
	
	// Заменить значение на приведенное
	РасчитанноеЗначение = ПриведенныйРезультат;
	
КонецПроцедуры
		
Функция РассчитатьЗначениеSABY_ЭтоФункция(Параметр, Контекст)
	
	Возврат ТипЗнч(Параметр) = Тип("Строка")
		И	Найти(Параметр, "{") 
		И	Прав(Параметр, "1") = "}";
		
КонецФункции

#Область include_core2_vo2_Модуль_МодульОбъектаСервер_РассчитатьЗначениеНаСервере_ФункцииВызываемыеЧерезИни
#КонецОбласти

