
// Функция - вычитывает структуру объекта 1С
//
// Параметры:
//  Объект1ССсылка	 - ДокументСсылка, СправочникСсылка	 - ссылка на объект, который мы вычитываем
//  ДопПараметры	 - Неопределено, Структура	 - расширение метода
//		ВыгружатьТабличныеЧасти - Булево - (Истина) - определяет необходимость вычитать табличные части объекта
//		ВыгружатьСтандартныеРеквизиты - Булево - (Истина) - определяет необходимость вычитывать стандартные реквизиты
// 
// Возвращаемое значение:
//  Структура - идентичная метаданным объекта структура со значениями реквизитов.
//
Функция ВычитатьСтруктуруОбъекта1С(Объект1ССсылка, ДопПараметры = Неопределено) Экспорт
	Перем СтруктураДокОбъект;
	
	Попытка
		
		МетаданныеОбъекта = Объект1ССсылка.Метаданные();	
		
	Исключение
		
		СбисИсключение = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаСервер.ВычитатьСтруктуруОбъекта1С", 709);
		ВызватьИсключение СбисИсключение_ВСтроку(СбисИсключение);
		
	КонецПопытки;

	ЗаполнитьСтруктуруПоДаннымОбъекта1С(СтруктураДокОбъект, МетаданныеОбъекта.Реквизиты, Объект1ССсылка);
	
	Если		ДопПараметры = Неопределено
		Или	Не	ДопПараметры.Свойство("ВыгружатьТабличныеЧасти")
		Или		ДопПараметры.ВыгружатьТабличныеЧасти Тогда
		
		ПараметрыТЧ = Новый Структура("ЭтоТЧ", Истина);
		Для Каждого ТабличнаяЧастьМетаданные Из МетаданныеОбъекта.ТабличныеЧасти Цикл
			
			ЗаполнитьЗначенияВДокОбъект(СтруктураДокОбъект, ТабличнаяЧастьМетаданные, Объект1ССсылка[ТабличнаяЧастьМетаданные.Имя], ПараметрыТЧ);
			
		КонецЦикла;
		
	КонецЕсли;

	Если		ДопПараметры = Неопределено
		Или	Не	ДопПараметры.Свойство("ВыгружатьСтандартныеРеквизиты")
		Или		ДопПараметры.ВыгружатьСтандартныеРеквизиты Тогда
		
		ЗаполнитьСтруктуруПоДаннымОбъекта1С(СтруктураДокОбъект, МетаданныеОбъекта.СтандартныеРеквизиты, Объект1ССсылка);
		
	КонецЕсли;
	
	Возврат СтруктураДокОбъект;
	
КонецФункции

Процедура ЗаполнитьЗначенияВДокОбъект(СтруктураДокОбъект, МетаданныеОбъекта, ЗначениеОбъектаЗаполнить, ДопПараметры)
    Перем ЗначениеВДокОбъектЗаполнить;

	Если СтруктураДокОбъект = Неопределено Тогда
		
		СтруктураДокОбъект = Новый Структура;
		
	КонецЕсли;
	
	Если	ДопПараметры.Свойство("ЭтоТЧ")
		И	ДопПараметры.ЭтоТЧ Тогда
		
		Если Не СтруктураДокОбъект.Свойство(МетаданныеОбъекта.Имя, ЗначениеВДокОбъектЗаполнить) Тогда 
			
			ЗначениеВДокОбъектЗаполнить = Новый Массив;
			СтруктураДокОбъект.Вставить(МетаданныеОбъекта.Имя, ЗначениеВДокОбъектЗаполнить);			
			
		КонецЕсли;
		
		Для Каждого СтрокаТЧЗаполнить Из ЗначениеОбъектаЗаполнить Цикл
			
			НоваяСтрока = Неопределено;
			ЗаполнитьСтруктуруПоДаннымОбъекта1С(НоваяСтрока, МетаданныеОбъекта.Реквизиты, СтрокаТЧЗаполнить);
			ЗначениеВДокОбъектЗаполнить.Добавить(НоваяСтрока);
			
		КонецЦикла;
		
	Иначе
	
		ЗаполнитьСтруктуруПоДаннымОбъекта1С(СтруктураДокОбъект, МетаданныеОбъекта, ЗначениеОбъектаЗаполнить);

	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСтруктуруПоДаннымОбъекта1С(СтруктураДокОбъект, МетаданныеОбъекта, ЗначениеОбъектаЗаполнить)
	
	Если СтруктураДокОбъект = Неопределено Тогда
		
		СтруктураДокОбъект = Новый Структура;
		
	КонецЕсли;
	
	Для Каждого Реквизит Из МетаданныеОбъекта Цикл
		
		СтруктураДокОбъект.Вставить(Реквизит.Имя, ЗначениеОбъектаЗаполнить[Реквизит.Имя]);
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - создать новый + (пере)заполнить объект по нашим данным
//
// Параметры:
//  НашиДанныеВходящие	 - Структура	 - Идентично заполняемому объекту
//  ДопПараметры		 - Структура	 - 
// 

//Функция заполняет реквизиты объекта 1С из одноименных полей структуры. Поддерживаемые типы: Документ, Справочник	
Функция СоздатьОбъект1СИзСтруктурыНаСервере(СтруктураДокОбъект, ДопПараметры, Отказ) Экспорт
	Перем ПерезаполнятьТолькоНепроведенные, Объект1СЗначение, ОбъектСсылка, ФормироватьИсключение;
	
	ОбъектПодТип	= ДопПараметры.ПодТипОбъекта;
	ОбъектТип		= ДопПараметры.ТипОбъекта;
	
	ДопПараметры.Свойство("ПерезаполнятьТолькоНепроведенные",	ПерезаполнятьТолькоНепроведенные); 
	ДопПараметры.Свойство("ОбъектПерезаполнитьСсылка",			ОбъектСсылка); 
	Если Не ДопПараметры.Свойство("ФормироватьИсключение", ФормироватьИсключение) Тогда
		
		ФормироватьИсключение = Ложь;
		
	КонецЕсли;
	ПерезаполнятьТолькоНепроведенные = ПерезаполнятьТолькоНепроведенные	= Истина;
		
	ЭтоНовый	= Не ЗначениеЗаполнено(ОбъектСсылка);
	Результат	= Новый Структура("Тип, Ссылка, Состояние, Сообщение");
	ТекстТип	= НРег(Лев(ОбъектТип, 1)) + Сред(ОбъектТип, 2);
	ТекстОшибки	= "";
	СообщениеЗапрещенныйПериод = "";
	
	//Получаем объект для редактирования и записи
	Если ЭтоНовый Тогда
		
		//Попытка
		//	
		//	Объект1СЗначение = НовыйОбъект1С(ОбъектТип, ОбъектПодТип);
		//	
		//Исключение
		//	
		//	Отказ = Истина;
		//	ИсключениеСоздания	= НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаСервер.СоздатьОбъект1СИзСтруктурыНаСервере");
		//	
		//КонецПопытки;
		
		Если Лев(ОбъектТип, 10) = "Справочник" Тогда
			Попытка	
				ТекстТип = "справочника";
				Объект1СЗначение = Справочники[ОбъектПодТип].СоздатьЭлемент();
			Исключение
				ТекстОшибки = ОписаниеОшибки();
				Отказ = Истина;
			КонецПопытки;
			
		ИначеЕсли Лев(ОбъектТип, 22) = "ПланВидовХарактеристик" Тогда
			Попытка	
				ТекстТип = "плана видов характеристик";
				Объект1СЗначение = ПланыВидовХарактеристик[ОбъектПодТип].СоздатьЭлемент();
			Исключение
				ТекстОшибки = ОписаниеОшибки();
				Отказ = Истина;
			КонецПопытки;
			
		ИначеЕсли Лев(ОбъектТип, 8) = "Документ" Тогда
			Попытка	
				ТекстТип = "документа";
				Объект1СЗначение = Документы[ОбъектПодТип].СоздатьДокумент();
			Исключение
				ТекстОшибки = ОписаниеОшибки();
				Отказ = Истина;
			КонецПопытки;
			
		ИначеЕсли Лев(ОбъектТип, 16) = "РегистрыСведений" Тогда
			Попытка
				ТекстТип = "регистра сведений";
				Объект1СЗначение = РегистрыСведений[ОбъектПодТип].СоздатьМенеджерЗаписи();
			Исключение
				ТекстОшибки = ОписаниеОшибки();
				Отказ = Истина;
			КонецПопытки;
			
		Иначе
			ТекстОшибки = "Не поддерживаемый тип.";
			Отказ = Истина;
		КонецЕсли;
		Результат.Тип = ОбъектТип + "." + ОбъектПодТип;
	Иначе
		Попытка
			
			Если Лев(ОбъектТип, 8) = "Документ" Тогда
				ТекстТип			= "документа";
				Если ОбъектСсылка.Проведен И ПерезаполнятьТолькоНепроведенные Тогда

					Результат.Состояние = "Ошибка перезаполнения документа.";	    
					Результат.Сообщение = "Документ " + Строка(ОбъектСсылка) + " не перезаполнен, так как проведен. Включить возможность перезаполнения проведенных документов можно на вкладке ""Настройки"" в разделе ""Загрузка документов"".";
					Возврат Результат;
					
				КонецЕсли;
				
			КонецЕсли;
			Результат.Тип	= ОбъектТип + "." + ОбъектСсылка.Метаданные().Имя;
			Объект1СЗначение= ОбъектСсылка.ПолучитьОбъект();
		Исключение
			Результат.Тип = ОбъектТип + "." + ОбъектПодТип;
			ТекстОшибки = ОписаниеОшибки();
			Отказ = Истина;
		КонецПопытки;
	КонецЕсли;
	Если Отказ Тогда
		Результат.Состояние = "Ошибка формирования " + ТекстТип;
		Если ЭтоНовый Тогда
			Результат.Сообщение = "Не удалось создать " + ?(ОбъектТип = "Документ", "новый документ",  "новую запись " + ТекстТип) + ". " + ТекстОшибки;
		Иначе
			Результат.Сообщение = "Не удалось прочитать объект " + Строка(ОбъектСсылка) + ". " + ТекстОшибки;		
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;
	
	ЗаполнитьОбъект1СНашимиДанными(Объект1СЗначение, СтруктураДокОбъект, ДопПараметры);
	
	//Записываем изменения                                                                          6
	Попытка
		//Пробуем провести документ если включена опция
		Если Лев(ОбъектТип, 8) = "Документ" Тогда
			
			лРежимЗаписи		= Неопределено;
			лРежимПроведения	= Неопределено;
			
			//Убрать этот костыль в 3100
			Если ДопПараметры.Свойство("АвтоматическоеПроведениеЗаказов") 
				И ДопПараметры.АвтоматическоеПроведениеЗаказов
				И ДопПараметры.Ини.Свойство("ПроводитьДокументАвтоматически")
				И ДопПараметры.Ини.ПроводитьДокументАвтоматически.РассчитанноеЗначение Тогда
				
				лРежимЗаписи = РежимЗаписиДокумента.Проведение;
				лРежимПроведения = РежимПроведенияДокумента.Неоперативный;
			КонецЕсли;
			
			Если лРежимЗаписи = Неопределено Тогда
			    Если СтруктураДокОбъект.Свойство("РежимЗаписиДокумента", лРежимЗаписи) Тогда
			        СтруктураДокОбъект.Свойство("РежимПроведенияДокумента", лРежимПроведения);
			    Иначе
			        лРежимЗаписи = РежимЗаписиДокумента.Запись;
			    КонецЕсли;
			КонецЕсли;
			// Записываем документ 
			Объект1СЗначение.Записать();
			
			Если Не лРежимПроведения = Неопределено Тогда
				ОшибокНет = Ложь;
				// Проверяем все ли заполнено то что нужно для проведения и проводим документ
				ОшибокНет = Объект1СЗначение.ПроверитьЗаполнение();
				Если ОшибокНет Тогда
					Объект1СЗначение.Записать(лРежимЗаписи, лРежимПроведения);
				КонецЕсли;
				
			КонецЕсли;
			
			ОбъектСсылка = Объект1СЗначение.Ссылка;
		Иначе
			Объект1СЗначение.Записать();
			Если ОбъектТип <> "РегистрыСведений" Тогда
				ОбъектСсылка = Объект1СЗначение.Ссылка;
			Иначе
				ОбъектСсылка = ОбъектПодТип+" ";
				Для Каждого Измер Из Метаданные.РегистрыСведений[ОбъектПодТип].Измерения Цикл
					Если ЗначениеЗаполнено(Объект1СЗначение[Измер.Имя]) Тогда
						ОбъектСсылка = ОбъектСсылка+Измер.Имя + ": "  + Объект1СЗначение[Измер.Имя]+";";
					КонецЕсли;
				КонецЦикла
			КонецЕсли;
		КонецЕсли;
	Исключение
		
		ОшибкаЗаписи = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъекта.СоздатьОбъект1СИзСтруктурыНаСервере");
		
		ТекстОшибки			= ОписаниеОшибки();
		Отказ				= Истина; 
		
	КонецПопытки;
	//Пробуем заполним документу дату и повторно записать при ошибке.
	Если	Отказ
		И	Лев(ОбъектТип, 8) = "Документ" Тогда
		
		Если Найти(ТекстОшибки, "запрещенный период") Тогда
			СообщениеЗапрещенныйПериод = "Невозможно записать документ "
											+ Строка(Объект1СЗначение) 
											+ ", дата находится в запрещенном периоде. Пробуем записать с текущей датой..." + Символы.ПС;
		КонецЕсли;
		
		Отказ = Ложь;
		Попытка
			// Если требуется установка через ини, то берем оттуда, иначе текущая
			Если	Не	СтруктураДокОбъект.Свойство("Дата")
				Или	Не	ЗначениеЗаполнено(СтруктураДокОбъект.Дата) Тогда
				Объект1СЗначение.Дата = ТекущаяДата();
			КонецЕсли;
			Объект1СЗначение.Записать();
			ОбъектСсылка = Объект1СЗначение.Ссылка;
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Отказ = Истина;
		КонецПопытки;
	КонецЕсли;
	//Заполняем результат
	Если Отказ Тогда
		Результат.Состояние = "Ошибка формирования " + ТекстТип;
		Результат.Сообщение = СообщениеЗапрещенныйПериод 
								+ "Не удалось записать " + ?(ТекстТип = "документа", "документ",  " элемент " + ТекстТип) + ". "
								+  ТекстОшибки;
	Иначе
		СостояниеОбъекта	= ?(ЭтоНовый, "Создан", "Перезаполнен"); 
		Результат.Состояние = СостояниеОбъекта + ".";
		Результат.Сообщение = СостояниеОбъекта + ?(ТекстТип = "документа", " документ",  " элемент " + ТекстТип) + " " + Строка(ОбъектСсылка);
		Результат.Ссылка	= ОбъектСсылка;		
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Функция - // Возвращает ссылки на связанные объекты.
//
// Параметры:
//  ЗначениеКритерияОтбора	 - ДокументСсылка	- Документ для поиска оснований
// 
// Возвращаемое значение:
//  Массив - Список найденных документов
//
Функция СбисОбъектыПоКритериюОтбора(ЗначениеКритерияОтбора, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ДопПараметры.КритерииОтбораСвязанныхДокументов) Тогда
		
		КритерииОтбораСвязанныхДокументов = ДопПараметры.КритерииОтбораСвязанныхДокументов; 
		
	Иначе
		
		КритерииОтбораСвязанныхДокументов = "СвязанныеДокументы";
		
	КонецЕсли;
	
	Если Не Метаданные.КритерииОтбора[КритерииОтбораСвязанныхДокументов].Тип.СодержитТип(ТипЗнч(ЗначениеКритерияОтбора)) Тогда 
		
		Возврат Новый Массив;
		
	КонецЕсли;  
	
	СписокСвязанныхДокументов = Новый Массив;
	
	ОбработатьСписокСвязанныхДокументов(СписокСвязанныхДокументов, ЗначениеКритерияОтбора, ДопПараметры);
		
	Возврат СписокСвязанныхДокументов;
	
КонецФункции  

Процедура ОбработатьСписокСвязанныхДокументов(СписокСвязанныхДокументов, ЗначениеКритерияОтбора, ДопПараметры) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(ДопПараметры.КритерииОтбораСвязанныхДокументов) Тогда
		
		КритерииОтбораСвязанныхДокументов = ДопПараметры.КритерииОтбораСвязанныхДокументов; 
		
	Иначе
		
		КритерииОтбораСвязанныхДокументов = "СвязанныеДокументы";
		
	КонецЕсли;
	
	ШаблонЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПсевдонимТаблицы.Ссылка КАК Ссылка
	|ИЗ
	|	ИмяТаблицы КАК ПсевдонимТаблицы
	|ГДЕ
	|	ПсевдонимТаблицы.ИмяРеквизита = &ЗначениеКритерияОтбора";

	ШаблонЗапросаОбъединения = "ВЫБРАТЬ
	|	ПсевдонимТаблицы.Ссылка КАК Ссылка
	|ИЗ
	|	ИмяТаблицы КАК ПсевдонимТаблицы
	|ГДЕ
	|	ПсевдонимТаблицы.ИмяРеквизита = &ЗначениеКритерияОтбора";

	ЧастиЗапроса = Новый Массив;
	ТекстЧастиЗапроса = "";

	Для Каждого ЭлементСостава Из Метаданные.КритерииОтбора[КритерииОтбораСвязанныхДокументов].Состав Цикл

		Если ЭлементСостава = Неопределено
				Или НЕ ЭлементСостава.Тип.СодержитТип(ТипЗнч(ЗначениеКритерияОтбора)) Тогда  
				
			Продолжить;  
			
		КонецЕсли;

		ПутьКДанным = ЭлементСостава.ПолноеИмя();
		
		Если SabyСтрНайти(ПутьКДанным, "ТабличнаяЧасть") Тогда
			
			ОбъектМетаданных = ЭлементСостава.Родитель().Родитель(); 
			
		Иначе 
			
			ОбъектМетаданных = ЭлементСостава.Родитель(); 
			
		КонецЕсли;
				
		Если НЕ ПравоДоступа("Чтение", ОбъектМетаданных) Тогда  
			
			Продолжить;  
			
		КонецЕсли;

		Точка = SabyСтрНайти(ПутьКДанным, ".", "СКонца");
		ИмяРеквизита = Сред(ПутьКДанным, Точка + 1);

		ИмяТаблицы = ЭлементСостава.Родитель().ПолноеИмя();
		ИмяТаблицы = СтрЗаменить(ИмяТаблицы, "ТабличнаяЧасть.", "");

		Точка = SabyСтрНайти(ИмяТаблицы, ".", "СКонца");
		ПсевдонимТаблицы = "Таблица_" + Сред(ИмяТаблицы, Точка + 1);

		ТекстЧастиЗапроса = ?(ТекстЧастиЗапроса = "", ШаблонЗапроса, ШаблонЗапросаОбъединения);
		ТекстЧастиЗапроса = СтрЗаменить(ТекстЧастиЗапроса, "ИмяТаблицы", ИмяТаблицы);
		ТекстЧастиЗапроса = СтрЗаменить(ТекстЧастиЗапроса, "ПсевдонимТаблицы", ПсевдонимТаблицы);
		ТекстЧастиЗапроса = СтрЗаменить(ТекстЧастиЗапроса, "ИмяРеквизита", ИмяРеквизита);

		ЧастиЗапроса.Добавить(ТекстЧастиЗапроса);

	КонецЦикла;
	
	Если ЧастиЗапроса.Количество() Тогда 
		
		Запрос = Новый Запрос;
		Разделитель = Символы.ПС + "ОБЪЕДИНИТЬ" + Символы.ПС;
		Запрос.Текст = SabyСтрСоединить(ЧастиЗапроса, Разделитель);
		Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ЗначениеКритерияОтбора);   
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл   
		
		Если ЗначениеЗаполнено(СписокСвязанныхДокументов) 
			И НЕ СписокСвязанныхДокументов.Найти(Выборка.Ссылка) = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		СписокСвязанныхДокументов.Добавить(Выборка.Ссылка);
		
		ОбработатьСписокСвязанныхДокументов(СписокСвязанныхДокументов, Выборка.Ссылка, ДопПараметры);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры 

