
&НаСервере
Функция	ЗарегистрироватьПечатнуюФормуНаСервере(ПараметрыФормированияНаСервере, ДопПараметры = Неопределено) Экспорт
	Перем ИмяСправочникаОбработок, ХранилищеОбработки, СбисОбработкаСтарая;
	
	Если		Не	Метаданные.Справочники.Найти("ВнешниеОбработки") = Неопределено Тогда
		
		ИмяСправочникаОбработок = "ВнешниеОбработки";
		КлючХранилища = "ХранилищеВнешнейОбработки";
		
	ИначеЕсли	Не	Метаданные.Справочники.Найти("ДополнительныеОтчетыИОбработки") = Неопределено Тогда
		
		ИмяСправочникаОбработок = "ДополнительныеОтчетыИОбработки";
		КлючХранилища = "ХранилищеОбработки";
		
	Иначе
		
		//Нет справочника доп. обработок
		Возврат Неопределено;
		
	КонецЕсли;
	
	ОписаниеСправочникаОбработок = Новый ФиксированнаяСтруктура("Справочник, Хранилище", ИмяСправочникаОбработок, КлючХранилища);
	
	СбисОбработка = ЗарегистрироватьПечатнуюФормуНаСервере_Найти(ОписаниеСправочникаОбработок, ПараметрыФормированияНаСервере);
	
	Если	СбисОбработка = Неопределено
		Или	СбисОбработка.Пустая() Тогда
		
		СбисОбработка = ЗарегистрироватьПечатнуюФормуНаСервере_Создать(ОписаниеСправочникаОбработок, ПараметрыФормированияНаСервере);

	Иначе
		
		сбисОбработка = СбисОбработка.ПолучитьОбъект();
		
	КонецЕсли;
	
	Если		Не сбисОбработка.Метаданные().Реквизиты.Найти("Версия") = Неопределено Тогда
		
		сбисОбработка.Версия = ПараметрыФормированияНаСервере.Версия;
		
	ИначеЕсли   Не сбисОбработка.Метаданные().Реквизиты.Найти("Комментарий") = Неопределено Тогда

		сбисОбработка.Комментарий = ПараметрыФормированияНаСервере.Версия;
		
	КонецЕсли;	
	
	Если ПараметрыФормированияНаСервере.Свойство("ПометкаУдаления") Тогда
		
		сбисОбработка.ПометкаУдаления = ПараметрыФормированияНаСервере.ПометкаУдаления;
		
	Конецесли;
	
	ХранилищеОбработки = ЗарегистрироватьПечатнуюФормуНаСервере_ПолучитьДанные(ОписаниеСправочникаОбработок, ПараметрыФормированияНаСервере);
	
	// Обновить хранилище ПФ по данным нашей обработки.
	Если ХранилищеОбработки = Неопределено Тогда
		
		Если СбисОбработка.ЭтоНовый() Тогда
			
			ОшибкаПФ = НовыйСбисИсключение(703201, "МодульОбъектаСервер.ЗарегистрироватьПечатнуюФормуНаСервере",,,"Не удалось найти данные для регистрации!");
			ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаПФ);
			
		КонецЕсли;
		
	Иначе
		
		сбисОбработка[КлючХранилища] = ХранилищеОбработки;
		
	КонецЕсли;
	
	// Обновить команды ПФ
	ОбновитьКомандыПФНаСервере(сбисОбработка, ПараметрыФормированияНаСервере);
	
	Возврат сбисОбработка.Ссылка;

КонецФункции

&НаСервере
Функция ЗарегистрироватьПечатнуюФормуНаСервере_Найти(ОписаниеСправочникаОбработок, ПараметрыНайтиВходящие)
	Перем СбисПредставлениеПФСтарое, СбисОбработкаСтарая, сбисОбработка;
		
	СправочникВОМенеджер = Справочники[ОписаниеСправочникаОбработок.Справочник];
	
	Если ПараметрыНайтиВходящие.Свойство("ВариантыИменований", СбисПредставлениеПФСтарое) Тогда
		
		Для Каждого ВариантНазваний Из СбисПредставлениеПФСтарое Цикл
			
			СбисОбработкаСтарая = СправочникВОМенеджер.НайтиПоНаименованию(СбисПредставлениеПФСтарое);
			
			Если Не СбисОбработкаСтарая.Пустая() Тогда
				
				Прервать;
				
			КонецЕсли;
			
			СбисОбработкаСтарая = Неопределено;
			
		КонецЦикла;
				
	КонецЕсли;
	
	СбисОбработкаНовая = СправочникВОМенеджер.НайтиПоНаименованию(ПараметрыНайтиВходящие.Представление);
	
	Если		СбисОбработкаСтарая = Неопределено Тогда
		
		сбисОбработка = СбисОбработкаНовая;
		
	ИначеЕсли	СбисОбработкаНовая.Пустая() Тогда
			
		сбисОбработка = СбисОбработкаСтарая;
		
	Иначе
		
		сбисОбработка = СбисОбработкаСтарая.ПолучитьОбъект();
		
		УстановитьПривилегированныйРежим(Истина);
		Попытка
			
			сбисОбработка.Удалить();
			
		Исключение
			
			сбисОбработка.ПометкаУдаления = Истина;
			сбисОбработка.Записать();
			
		КонецПопытки;
		УстановитьПривилегированныйРежим(Ложь);
		
		сбисОбработка = СбисОбработкаНовая;
		
	КонецЕсли;
	
	Возврат сбисОбработка;
	
КонецФункции

&НаСервере
Функция ЗарегистрироватьПечатнуюФормуНаСервере_Создать(ОписаниеСправочникаОбработок, ПараметрыНайтиВходящие)
	Перем ИдентификаторКоманды;
	
	ПараметрыНайтиВходящие.Свойство("ИдентификаторКоманды", ИдентификаторКоманды);

	СправочникВОМенеджер		= Справочники[ОписаниеСправочникаОбработок.Справочник];
	СбисОбработка				= СправочникВОМенеджер.СоздатьЭлемент();		
	СбисОбработка.Наименование	= ПараметрыНайтиВходящие.Представление;
	
	Если ПараметрыНайтиВходящие.УправляемоеПриложение Тогда
		
		Если	ПараметрыНайтиВходящие.Свойство("ВидДопОбработокПечатнаяФорма")
			И	ЗначениеЗаполнено(ПараметрыНайтиВходящие.ВидДопОбработокПечатнаяФорма) Тогда
			
			СбисОбработка.Вид = ПараметрыНайтиВходящие.ВидДопОбработокПечатнаяФорма;
			
		Иначе
			
			СбисОбработка.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ПечатнаяФорма;
			
		КонецЕсли;
		
		СбисОбработка.ИспользоватьДляФормыОбъекта	= Истина;
		СбисОбработка.ИспользоватьДляФормыСписка	= Истина;
		СбисОбработка.БезопасныйРежим				= Ложь;
		сбисОбработка.Публикация					= Перечисления.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется;
		
		НоваяКоманда = СбисОбработка.Команды.Добавить();
		НоваяКоманда.Представление = ПараметрыНайтиВходящие.Представление;
		НоваяКоманда.Идентификатор = ИдентификаторКоманды;
		// на управляемых формах передача параметров работает только для ВариантЗапуска = ОткрытиеФормы, 
		//	поэтому используем ИдентификаторКоманды, а не ДополнительныеПараметрыОбработки 
		НоваяКоманда.ВариантЗапуска = Перечисления.СпособыВызоваДополнительныхОбработок.ВызовКлиентскогоМетода;
		
	ИначеЕсли ПараметрыНайтиВходящие.Свойство("ВидДопОбработокПечатнаяФорма")
			И ЗначениеЗаполнено(ПараметрыНайтиВходящие.ВидДопОбработокПечатнаяФорма) Тогда
			
		СбисОбработка.ВидОбработки = ПараметрыНайтиВходящие.ВидДопОбработокПечатнаяФорма;
		
	Иначе
		
		СбисОбработка.ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма;
		
	КонецЕсли;
	
	Возврат СбисОбработка;
	
КонецФункции

&НаСервере
Функция ЗарегистрироватьПечатнуюФормуНаСервере_ПолучитьДанные(ОписаниеСправочникаОбработок, ПараметрыНайтиВходящие)
	Перем ХранилищеОбработки;
	
	//Добавить команды
	Если		ПараметрыНайтиВходящие.Свойство("Данные") Тогда
		
		ХранилищеОбработки = Новый ХранилищеЗначения(ПараметрыНайтиВходящие.Данные);
		
	ИначеЕсли	ПараметрыНайтиВходящие.Свойство("Наименование") Тогда
		
		СправочникВОМенеджер = Справочники[ОписаниеСправочникаОбработок.Справочник];
		ОткрытаяОбработкаВСправочнике = СправочникВОМенеджер.НайтиПоНаименованию(ПараметрыНайтиВходящие.Наименование);
		Если	ОткрытаяОбработкаВСправочнике = Неопределено
			Или	ОткрытаяОбработкаВСправочнике.Пустая() Тогда
			
			Возврат Неопределено;	
			
		КонецЕсли;
		
		ХранилищеОбработки = ОткрытаяОбработкаВСправочнике[ОписаниеСправочникаОбработок.Хранилище];
		
	КонецЕсли;
	
	Возврат ХранилищеОбработки;
	
КонецФункции
	
&НаСервере
Процедура ОбновитьКомандыПФНаСервере(ПечатнаяФормаОбъект = Неопределено, ПараметрыФормированияКомандПечати) Экспорт
    Перем ИдентификаторКоманды;
	
	ВыполнитьЗаписьИзменений = Истина;

	ПараметрыФормированияКомандПечати.Свойство("ИдентификаторКоманды", ИдентификаторКоманды);
	
	Если ПечатнаяФормаОбъект = Неопределено Тогда
	
		ПечатнаяФормаОбъект = ПараметрыФормированияКомандПечати.ПечатнаяФормаСсылка.ПолучитьОбъект();
		ВыполнитьЗаписьИзменений = Ложь;
		
	КонецЕсли;
	
	Если	ПараметрыФормированияКомандПечати.УправляемоеПриложение
		И	Метаданные.Справочники.Найти("ИдентификаторыОбъектовМетаданных") = Неопределено Тогда
			
		//Для конфигураций, где нет справочника "ИдентификаторыОбъектовМетаданных", команды для печати не генерируем.
		Если ВыполнитьЗаписьИзменений Тогда
			
			ПечатнаяФормаОбъект.Записать();	
			
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
	//Добавить команды
	Для Каждого Элемент Из ПараметрыФормированияКомандПечати.СписокДокументов Цикл
		
		МетаданныеДок = Метаданные.Документы.Найти(Элемент.Значение);
		Если МетаданныеДок = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если ПараметрыФормированияКомандПечати.УправляемоеПриложение Тогда
						
			ОбъектНазначения = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", "Документ." + Элемент.Значение);
			Если ПечатнаяФормаОбъект.Назначение.Найти(ОбъектНазначения, "ОбъектНазначения") = Неопределено Тогда
				НоваяСтрока = ПечатнаяФормаОбъект.Назначение.Добавить();
				НоваяСтрока.ОбъектНазначения = ОбъектНазначения;
				ВыполнитьЗаписьИзменений = Истина;
			КонецЕсли;
			
		Иначе
			
			Если ПечатнаяФормаОбъект.Принадлежность.Найти("Документ """ + МетаданныеДок.Синоним + """", "ПредставлениеОбъекта") = Неопределено Тогда
				
				НоваяСтрока = ПечатнаяФормаОбъект.Принадлежность.Добавить();
				НоваяСтрока.ПредставлениеОбъекта	= "Документ """ + МетаданныеДок.Синоним + """";
				НоваяСтрока.ПредставлениеКнопки		= ПараметрыФормированияКомандПечати.Представление;
				НоваяСтрока.СсылкаОбъекта			= Документы[Элемент.Значение].ПустаяСсылка();
				Если НЕ ПечатнаяФормаОбъект.Метаданные().ТабличныеЧасти.Принадлежность.Реквизиты.Найти("МетаданныеОбъекта") = Неопределено Тогда
					НоваяСтрока.МетаданныеОбъекта		= "Документ." + МетаданныеДок.Имя;
				КонецЕсли;

				Если ЗначениеЗаполнено(ИдентификаторКоманды) Тогда
					СтруктураПараметрыОбработки = Новый Структура("ИдентификаторКоманды", ИдентификаторКоманды);
					НоваяСтрока.ДополнительныеПараметрыОбработки = Новый ХранилищеЗначения(СтруктураПараметрыОбработки);   
				Конецесли;
				
				ВыполнитьЗаписьИзменений = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВыполнитьЗаписьИзменений Тогда 
		
		ПечатнаяФормаОбъект.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

