
// Функция - формирует хеш сумму значения SABY
//
// Параметры:
//  ДанныеХешПолучить	 - Произвольный	 - основание для получения хэша
//  ДопПараметры		 - Неопределено, Структура	 - расширение
// 
// Возвращаемое значение:
//  Строка - хэш данных
//
Функция ХешСуммаЗначенияSABY(ДанныеХешПолучить, ДопПараметры = Неопределено) Экспорт
	
	// Пока сделано предельно тупо. Расширить при потребности.
	Если		ТипЗнч(ДанныеХешПолучить) = Тип("Файл") Тогда
		
		Результат	= ДанныеХешПолучить.ПолноеИмя;
		Результат	= Результат + ДанныеХешПолучить.ПолучитьВремяИзменения();
		
	ИначеЕсли   ТипЗнч(ДанныеХешПолучить) = Тип("ОбъектМетаданных") Тогда
		
		Результат	= ДанныеХешПолучить.ПолноеИмя();
		
	ИначеЕсли	ТипЗнч(ДанныеХешПолучить) = Тип("ДвоичныеДанные") Тогда

		Попытка
			
			ХешЗначенийПривести = Вычислить("Новый ХешированиеДанных(ХешФункция.MD5)");
			ХешЗначенийПривести.Добавить(ДанныеХешПолучить);
			Результат = Строка(ХешЗначенийПривести.ХешСумма);
			
		Исключение
			
			Результат = Строка(Новый УникальныйИдентификатор);
			
		КонецПопытки;
		
	Иначе
		
		Результат = Строка(ДанныеХешПолучить);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция - получает роли пользователя
//
// Параметры:
//  Пользователь1С	 - Неопределено, ПользовательИнформационнойБазы, Струкутра, ФиксированнаяСтруктура	 - описание пользователя со свойством УникальныйИдентификатор
//		Если Неопределено, то текущий пользователь
// 
// Возвращаемое значение:
//  ТаблицаЗначений - роли пользователя
//
Функция СписокРолейПользователя(Пользователь1С = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если Пользователь1С = Неопределено Тогда
		
		ВыбранныйПользователь1С = ПользователиИнформационнойБазы.ТекущийПользователь();
		
	Иначе
		
		ВыбранныйПользователь1С = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Пользователь1С.УникальныйИдентификатор);
		
	КонецЕсли;
	
	РолиПОльзователя = ВыбранныйПользователь1С.Роли;
	УстановитьПривилегированныйРежим(Ложь);
	
	ТаблицаРолей = Новый ТаблицаЗначений;
	ТаблицаРолей.Колонки.Добавить("Имя");
	ТаблицаРолей.Колонки.Добавить("Синоним");
	ТаблицаРолей.Колонки.Добавить("Значение");
	Для Каждого Роль Из РолиПОльзователя Цикл
		
		СтрокаТаблицы = ТаблицаРолей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Роль);
		СтрокаТаблицы.Значение = Роль;
		
	КонецЦикла;
	Возврат ТаблицаРолей;
	
КонецФункции

#Область include_core2_vo2_МодульОбъекта_Сервер_Общие_СериализоватьОбъектДляВозвратаНаКлиент
#КонецОбласти

