
// UAAРегла

//DynamicDirective
Процедура ВыполнитьКоманду_vo2(Идентификатор, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	Перем НуженКэш, НужнаАвторизация;
	
	_Событие	= " Событие";
	_Данные		= " Данные";
	_Это		= "Это ";
	
	ВосстановитьГлобальныйКэш();

	//Если ПолучитьЗначениеПараметраТекущегоСеанса("ОбменВключен") 
	//
	Если ПараметрыВыполненияКоманды = Неопределено Тогда
		
		НужнаАвторизация = Истина;
		
	КонецЕсли;
	
	ИмяСобытияДляРегистрации	= Идентификатор;
	ДанныеДляРегистрации		= ЛокализацияНазваниеПродукта();

	ЗаписьЖурналаРегистрацииНаСервере(
		ИмяСобытияДляРегистрации,
		ДанныеДляРегистрации,
		"Начало",
		"Информация");
		
	Если Не	 ГлобальныйКэш.СБИС.ОбменВключен Тогда
			
		ГлобальныйКэш.СБИС.ОбменВключен = Истина;	
			
	КонецЕсли;		
		
	Если НужнаАвторизация Тогда
		
		ОшибкаАвторзации = Ложь;
		РезльтатАвторизации = ВыполнитьАвторизациюSABY(, ОшибкаАвторзации);
		Если  ОшибкаАвторзации Тогда
			
			ЗаписьЖурналаРегистрацииНаСервере(
				ИмяСобытияДляРегистрации,
				ДанныеДляРегистрации,
				СбисИсключение_Выгрузить(РезльтатАвторизации, "JSON"),
				"Ошибка");
				
			Возврат;
			
		КонецЕсли;
		
		ИзменитьПараметрСбис("Авторизован",			Истина);
		ИзменитьПараметрСбис("ИдентификаторСессии", РезльтатАвторизации);
			
	КонецЕсли;
	
	ИсточникФильтра = Новый Структура;
	ИсточникФильтра.Вставить("ФильтрДатаНач", '00010101');
	ИсточникФильтра.Вставить("ФильтрДатаКнц", '00010101');
	ИсточникФильтра.Вставить("ЗаписейНаСтранице",	50);
	ИсточникФильтра.Вставить("НомерСтраницы",		2);
	
	РеестрЗаказов = СписокДокументовSABY(Новый Структура("ИсточникФильтра", ИсточникФильтра), Новый Структура("Текущий", Новый Структура("ТипДок", "ЗаказВх")));
		
	Попытка
	
		ЗаписьЖурналаРегистрацииНаСервере(
			ИмяСобытияДляРегистрации,
			ДанныеДляРегистрации,
			"Выполнено: " + ТекущаяДата(),
			"Информация");
			
	Исключение
		// ИнфОбОшибке = ИнформацияОбОшибке();
		// ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		ОшибкаДанные = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаСервер.ВыполнитьКоманду_vo2");
		ЗаписьЖурналаРегистрацииНаСервере(
			ИмяСобытияДляРегистрации,
			ДанныеДляРегистрации,
			СбисИсключение_Выгрузить(ОшибкаДанные),
			"Ошибка");
	КонецПопытки;
КонецПроцедуры
		
