
Функция ВыполнитьСинхроннуюКомандуТранспорта(Кэш, Метод, ПараметрыМетода, ДопПараметры, Отказ)
	
	ТекущийТранспортИнтеграции	= ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция");
	СведенияОбИнтеграции		= ПолучитьЗначениеПараметраТекущегоСеанса("СведенияОбИнтеграции");
	
	Попытка

		Возврат Вычислить(СведенияОбИнтеграции.Имя + "_" + Метод + "(Кэш, ПараметрыМетода, ДопПараметры, Отказ)");
		
	Исключение
		
		Отказ = Истина;
		Возврат НовыйСбисИсключение(ИнформацияОбОшибке(), МодульОбъектаКлиентСервер_Представление() + ".ВыполнитьСинхроннуюКомандуТранспорта");
		
	КонецПопытки;
	
КонецФункции

#Область include_core2_vo2_МодульОбъекта_Сервер_Транспорт_API
#КонецОбласти

