
// Функция - Обертка для вызова основного расчета
//
// Параметры:
//  Параметр - Строка/Структура	 - что считаем
//  Контекст - Структура		 - контекст, в разрезе чего считаем
// 
// Возвращаемое значение:
//  Произвольный - посчитанное значение
//
Функция РассчитатьЗначениеНаСервере(Параметр,Контекст) Экспорт
	
	Возврат РассчитатьЗначениеSABY(Параметр, Контекст);
	
КонецФункции	

Функция ПолучитьПараметрыСистемы() Экспорт
КонецФункции

Процедура ОбновитьПараметрГлобальногоМодуля(ИмяПараметраМодуля, ЗначениеПараметраМодуля) Экспорт
КонецПроцедуры

#Область include_core2_vo2_МодульОбъекта_Сервер_УправляемоеПриложение_НайтиФункциюСеансаОбработки
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Сервер_УправляемоеПриложение_Ини
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Сервер_УправляемоеПриложение_Интерфейс
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Сервер_УправляемоеПриложение_Списки_Реестры
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Сервер_Классы
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры
#КонецОбласти

