
&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыОткрытия)

	СписокПакетов.Очистить();
	ОтметитьВсе=Истина;
	Для Каждого Пакет из ПараметрыОткрытия.МассивПакетов Цикл
		НоваяСтрока = СписокПакетов.Добавить();
		НоваяСтрока.НазваниеПакета = пакет.вложение[0].название;
		НоваяСтрока.Пакет.добавить(пакет);
		НоваяСтрока.Отмечен = истина;
		Если Пакет.Свойство("Контрагент") Тогда
			Если Пакет.Контрагент.Свойство("СвЮЛ") Тогда
				НоваяСтрока.ПакетКонтрагент = Пакет.Контрагент.СвЮЛ.Название;
			ИначеЕсли Пакет.Контрагент.Свойство("СвФЛ") Тогда
				НоваяСтрока.ПакетКонтрагент = Пакет.Контрагент.СвФЛ.Фамилия+" "+Пакет.Контрагент.СвФЛ.Имя+?(Пакет.Контрагент.СвФЛ.Свойство("Отчество")," "+Пакет.Контрагент.СвФЛ.Отчество,"");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "НадписьПодготовленныеДокументы").Заголовок= "Подготовлено пакетов: "+СписокПакетов.Количество();

КонецПроцедуры

