
&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыОткрытия)
    Перем НаборПакетовНастроить;
	
	Если		ПараметрыОткрытия = Неопределено
		Или	Не	ПараметрыОткрытия.Свойство("МассивПакетов", НаборПакетовНастроить) Тогда
		
		// Считаем, что форма могла быть настроена заранее. Ничего не чистим и не трогаем.
		Возврат;
		
	КонецЕсли;
	
	СписокПакетов.Очистить();
	ОтметитьВсе = Истина;

	Для Каждого Пакет Из ПараметрыОткрытия.МассивПакетов Цикл
		
		НоваяСтрока = СписокПакетов.Добавить();
		НоваяСтрока.НазваниеПакета = МодульОбъектаКлиент().СоставПакета_Получить(Пакет, "Название");
		НоваяСтрока.Пакет.Добавить(пакет);
		НоваяСтрока.Отмечен = истина;
		
		Если Пакет.Свойство("Контрагент") Тогда
			Если Пакет.Контрагент.Свойство("СвЮЛ") Тогда
				НоваяСтрока.ПакетКонтрагент = Пакет.Контрагент.СвЮЛ.Название;
			ИначеЕсли Пакет.Контрагент.Свойство("СвФЛ") Тогда
				НоваяСтрока.ПакетКонтрагент = Пакет.Контрагент.СвФЛ.Фамилия+" "+Пакет.Контрагент.СвФЛ.Имя+?(Пакет.Контрагент.СвФЛ.Свойство("Отчество")," "+Пакет.Контрагент.СвФЛ.Отчество,"");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "НадписьПодготовленныеДокументы").Заголовок = "Подготовлено пакетов: " + СписокПакетов.Количество();

КонецПроцедуры

