
//DynamicDirective

Функция СоставПакета_АктивныйЭтап(СоставПакета, ДопПараметры = Неопределено) 
	
	Перем ЗначениеИтог;  
	
	Если СоставПакета.Свойство("Состояние", 			ЗначениеИтог)
			И	ЗначениеИтог.Свойство("Обработка", 		ЗначениеИтог)
			И	ЗначениеИтог.Свойство("АктивныйЭтап",	ЗначениеИтог) Тогда
			
		Возврат ЗначениеИтог;
		
	КонецЕсли;
					
	Возврат ЗначениеИтог;
				
КонецФункции

//DynamicDirective

Функция СоставПакета_Идентификатор(СоставПакета, ДопПараметры = Неопределено) Экспорт 
	Перем ИдПакета, Статус, ФорматИД;
	
	Направление = "1С";
	Если Не ДопПараметры = Неопределено Тогда
		
		Если ТипЗнч(ДопПараметры) = Тип("Строка") Тогда
			
			Направление = ДопПараметры;
			
		Иначе
			
			Если ДопПараметры.Свойство("Направление") Тогда
			
				Направление = ДопПараметры.Направление;
				
			КонецЕсли;
			
			Если ДопПараметры.Свойство("Формат") Тогда
			
				ФорматИД = ДопПараметры.Формат;
				
			КонецЕсли;

		КонецЕсли;
		
	КонецЕсли;
	
	Если Направление = "1С" Тогда
	
		Если			СоставПакета.Свойство("ВременныйИдентификатор", ИдПакета) Тогда
			
			// Ид пакета в готовом виде. Ранее созданный идентификатор.
			
		ИначеЕсли		СоставПакета.Свойство("ПользовательскийИдентификатор", ИдПакета)
					И	ЗначениеЗаполнено(ИдПакета)
				Или	(	СоставПакета_Получить(СоставПакета, "ЭтоРедакция")
					И	СоставПакета.Свойство("ИдентификаторРедакции", ИдПакета)
					И	ЗначениеЗаполнено(ИдПакета)) Тогда
				
			// Ид пакета в виде редакции, либо пользовательского ИД.
			// Скорее всего, там будет составное значение из имени типа + УИД основания 1С
			ИдПакета = Сред(ИдПакета, Найти(ИдПакета, ":") + 1);
			СоставПакета.Вставить("ВременныйИдентификатор", ИдПакета);
			
		Иначе
			
			ИдПакета = Строка(Новый УникальныйИдентификатор());
			СоставПакета.Вставить("ВременныйИдентификатор", ИдПакета);
			
		КонецЕсли;
		
	Иначе
		
		//Вернем существующий идентификатор
		СоставПакета.Свойство("Идентификатор", ИдПакета);

	КонецЕсли;
	
	Возврат ИдПакета;
	
КонецФункции

//DynamicDirective

Функция СоставПакета_Комментарий(СоставПакета, ДопПараметры) 
	
	Перем лКомментарий;  
	
	Если СоставПакета.Свойство("Примечание") Тогда
		
		лКомментарий = СоставПакета.Примечание;
		
	ИначеЕсли СоставПакета.Свойство("Комментарий") Тогда
		
		лКомментарий = СоставПакета.Комментарий;
		
	Иначе
		
		лКомментарий = "";    
		
	КонецЕсли;
		
	Возврат лКомментарий
		
КонецФункции

//DynamicDirective

Функция СоставПакета_РасхожденияПоПакету(СоставПакета) 
	
	Перем СбисРасширение, Расхождение;  
	
	Возврат СоставПакета.Свойство("Расширение", СбисРасширение) 
		И СбисРасширение.Свойство("ЕстьРасхождения",Расхождение) 
		И Расхождение = "Да";
		
КонецФункции
	
//DynamicDirective

// Функция возвращает статус из госсистем по состоянию или коду
//
// Параметры:
//  СоставПакета - Структура - Обрабатываемый пакет (Документ)
// 
// Возвращаемое значение:
//  Строка - Статус документа в госсистеме
//
Функция СоставПакета_СтатусГоссистемыПоПакету(СоставПакета) 
	
	Перем СтатусГос;    
	
		СбисРасширение	= СоставПакета_Получить(СоставПакета, "Расширение");
	
	Если СбисРасширение.Свойство("СостояниеГосСистемы", СтатусГос)
		И ЗначениеЗаполнено(СтатусГос) Тогда
		
		СтатусВГосСистеме = СтатусГос[0].СостояниеОперации;
		
	ИначеЕсли	СбисРасширение.Свойство("СостояниеМарк", СтатусГос)
		И	СтатусГос.Свойство("СостояниеОперации",	СтатусГос) Тогда 
		
		СтатусВГосСистеме	= СтатусГос; 
		
	//Прослеживаемой и маркируемой продукции, у одном документе, быть не может
	ИначеЕсли СбисРасширение.Свойство("СостояниеПросл", СтатусГос) 
		И СтатусГос.Свойство("КодСостоянияОперации", СтатусГос) Тогда 
 
		СтатусВГосСистеме 	= МодульОбъектаКлиентСервер().СостояниеПрослеживаемостиПоКодуСтрокой(СтатусГос);  
		
	Иначе
		
		СтатусВГосСистеме	= "";	 
		
	КонецЕсли;  
	
	Возврат СтатусВГосСистеме;
	
КонецФункции

//DynamicDirective

Функция СоставПакета_ТекущаяФазаДокумента(СоставПакета) 
	
	ИдентификаторФазы = Формат(СоставПакета.ИдФазы, "ЧН=0; ЧГ=");  
	
	ОтсутствуетАктивныйЭтап = НЕ ЗначениеЗаполнено(ИдентификаторФазы)
								И НЕ ЗначениеЗаполнено(СоставПакета_Получить(СоставПакета, "АктивныйЭтап"));
								
	ОтсутствуетЭтапУтверждения = ОтсутствуетАктивныйЭтап
									И СоставПакета_Получить(СоставПакета, "КодСостояния") = 45;
	 
	Если ИдентификаторФазы = "-1570" Тогда
		
		ФазаДокумента = "ОжиданиеПодтвержденияОДоставке";
		
	ИначеЕсли ИдентификаторФазы = "-1571" Тогда
		
		ФазаДокумента = "ОшибкаПриОбработке";
		
	ИначеЕсли ИдентификаторФазы = "-1572" Тогда
		
		ФазаДокумента = "УспешноОбработано";   
		
	ИначеЕсли ИдентификаторФазы = "-1573"
				ИЛИ ОтсутствуетЭтапУтверждения Тогда
		
		ФазаДокумента = "Отгрузка";        
		
	ИначеЕсли ИдентификаторФазы = "-1574" Тогда
		
		ФазаДокумента = "ОжиданиеПриемки"; 
		
	ИначеЕсли ИдентификаторФазы = "-1575" Тогда
		
		ФазаДокумента = "ОтправитьДокументы"; 
		
	ИначеЕсли ИдентификаторФазы = "-1576" Тогда
		
		ФазаДокумента = "Подписание";   
		
	ИначеЕсли ОтсутствуетАктивныйЭтап Тогда
		
		ФазаДокумента = "Завершенные";
		 
	Иначе  
		
		ФазаДокумента = "Утверждение";
		
	КонецЕсли;
	
	Возврат ФазаДокумента;
	
КонецФункции

//DynamicDirective

Функция СоставПакета_ТипAPI3Объекта(СоставПакета)

	СоответствиеТипов = Новый Соответствие;
	СоответствиеТипов.Вставить("ЗаказВх", "ЗаказПокупателя");
	
	Возврат СоответствиеТипов.Получить(СоставПакета_Получить(СоставПакета, "Тип"));

КонецФункции

