
//DynamicDirective

// Функция - Метод класса СоставПакета. Инкапсуляция получить значение
//
// Параметры:
//  СоставПакета - СоставПакета				 - Структура класса
//  КлючПолучить - Строка					 - Что получить от класса
//  ДопПараметры - Структура/Неопределено	 - расширение
// 
// Возвращаемое значение:
//  Произвольное значение - данные класса по ключу
//
Функция СоставПакета_Получить(СоставПакета, КлючПолучить, ДопПараметры = Неопределено) Экспорт 
	Перем ЗначениеИтог;
	
	Если		КлючПолучить = "РегламентНазвание" Тогда
		
		Если 	СоставПакета.Свойство("Регламент",	ЗначениеИтог)
			И	ЗначениеЗаполнено(ЗначениеИтог)
			И	ЗначениеИтог.Свойство("Название",	ЗначениеИтог) Тогда
			
			Возврат ЗначениеИтог;
			
		Иначе
			
			ЗначениеИтог = "";
			
		КонецЕсли;
		
	ИначеЕсли	КлючПолучить = "ИдентификаторСБИС" Тогда
		
		ЗначениеИтог = СоставПакета_Идентификатор(СоставПакета, "СБИС");
		
	ИначеЕсли	КлючПолучить = "Идентификатор"
			Или	КлючПолучить = "Идентификатор1С" Тогда
		
		ЗначениеИтог = СоставПакета_Идентификатор(СоставПакета);
		
	ИначеЕсли КлючПолучить = "ОсновнойДокумент1С" Тогда
		
		Если	СоставПакета.Вложение.Количество()
			И	СоставПакета.Вложение[0].Свойство("Документы1С")
			И	ЗначениеЗаполнено(СоставПакета.Вложение[0].Документы1С) Тогда
			ЗначениеИтог = СоставПакета.Вложение[0].Документы1С[0].Значение;
		КонецЕсли; 
		
	ИначеЕсли КлючПолучить = "СтатусГосСистемы" Тогда
		
		ЗначениеИтог = СоставПакета_СтатусГоссистемыПоПакету(СоставПакета);
		
	ИначеЕсли КлючПолучить = "ЕстьРасхождения" Тогда
		
		ЗначениеИтог = СоставПакета_РасхожденияПоПакету(СоставПакета);
		
	ИначеЕсли КлючПолучить = "ДанныеСравнения" Тогда
		
		ЗначениеИтог = СоставПакета_ДанныеСравнения(СоставПакета, ДопПараметры)
		
	ИначеЕсли КлючПолучить = "ДокументДляВложения" Тогда
		
		ЗначениеИтог = СоставПакета_ОснованиеДляВложения(СоставПакета, ДопПараметры);
		
	ИначеЕсли КлючПолучить = "Название" Тогда
		
		Если Не (СоставПакета.Свойство(КлючПолучить, ЗначениеИтог) И ЗначениеЗаполнено(ЗначениеИтог)) Тогда
			ЗначениеИтог = "";
			
			Если СоставПакета.Вложение.Количество() Тогда
				Документы1С = ВложениеСБИС_Получить(СоставПакета.Вложение[0], "Документы1С");
				Если ЗначениеЗаполнено(Документы1С)
					И ЗначениеЗаполнено(Документы1С[0].Значение) Тогда
					ЗначениеИтог = Строка(Документы1С[0].Значение);
				Иначе
					ЗначениеИтог = ВложениеСБИС_Получить(СоставПакета.Вложение[0], "Название");
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли	КлючПолучить = "Вложение" Тогда

		ЗначениеИтог = СоставПакета_НайтиВложение(СоставПакета, ДопПараметры);
		
	ИначеЕсли	КлючПолучить = "Вложения" Тогда 
		
		ЗначениеИтог = Новый Массив;  
		
		Если НЕ СоставПакета.Свойство("Вложение") Тогда
			
			Возврат ЗначениеИтог;
			
		КонецЕсли;
			
		// Перебираем массив вложений
		Для Каждого Вложение Из СоставПакета.Вложение Цикл
			
            ЗначениеИтог.Добавить(Вложение);
			
		КонецЦикла;
		
		Если	Не	ДопПараметры = Неопределено Тогда
			Если	ДопПараметры.Свойство("Служебные")
				И	ДопПараметры.Служебные
				И	СоставПакета.Свойство("ВложениеСлужебные") Тогда
			
			// Перебираем массив вложений
				Для Каждого Вложение Из СоставПакета.ВложениеСлужебные Цикл
					
		            ЗначениеИтог.Добавить(Вложение);
					
				КонецЦикла;
				
			КонецЕсли;
		
			Если	ДопПараметры.Свойство("Учет")
				И	ДопПараметры.Служебные
				И	СоставПакета.Свойство("ВложениеУчета") Тогда
				
				// Перебираем массив вложений
				Для Каждого Вложение Из СоставПакета.ВложениеУчета Цикл
					
		            ЗначениеИтог.Добавить(Вложение);
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;

	ИначеЕсли КлючПолучить = "Модифицирован" Тогда
		Если НЕ СоставПакета.Свойство(КлючПолучить, ЗначениеИтог) Тогда
			ЗначениеИтог = Ложь;
		КонецЕсли;
	ИначеЕсли КлючПолучить = "Грузополучатель" Тогда

		Участники = СоставПакета_Получить(СоставПакета, "Участники");
		
		Если НЕ ЗначениеЗаполнено(Участники) Тогда
			ЗначениеИтог = Неопределено;
		ИначеЕсли Найти("ЗаказИсх, ДокОтгрВх", СоставПакета_Получить(СоставПакета, "Тип")) Тогда
			Участники.Свойство("Лицо3", ЗначениеИтог);
		Иначе
			Участники.Свойство("Лицо2", ЗначениеИтог);
		КонецЕсли;
	ИначеЕсли КлючПолучить = "Параметры" Тогда
		
		Если Не СоставПакета.Свойство("Параметры") Тогда
			
			СоставПакета.Вставить("Параметры", Новый Структура);
			
		КонецЕсли;
		ЗначениеИтог = СоставПакета.Параметры;

	ИначеЕсли КлючПолучить = "КодСостояния" Тогда
		
		// https://saby.ru/help/integration/api/sequence/cod
		Если	СоставПакета.Свойство("Состояние",	ЗначениеИтог)
			И	ЗначениеИтог.Свойство("Код",		ЗначениеИтог)
			И	ЗначениеЗаполнено(ЗначениеИтог) Тогда
			
			Возврат ЗначениеИтог;
			
		КонецЕсли;	
		
	ИначеЕсли КлючПолучить = "ДопПараметрыСБИС" Тогда
		
		ЗначениеИтог = СоставПакета_ДопПараметрыСБИС(СоставПакета);
		
	ИначеЕсли КлючПолучить = "МожноАннулировать" Тогда
		
		Возврат СоставПакета_МожноАннулировать(СоставПакета, ДопПараметры);  
		
	ИначеЕсли КлючПолучить = "СтатусДокумента" Тогда 
		
		ЗначениеИтог = СоставПакета_СостояниеДокумента(СоставПакета);  
		
	ИначеЕсли КлючПолучить = "ТекущийЭтап" Тогда
		
		ЗначениеИтог = СоставПакета_ТекущийЭтап(СоставПакета);

	ИначеЕсли КлючПолучить = "ТекущееДействие" Тогда
		
		ЗначениеИтог = СоставПакета_ТекущееДействие(СоставПакета);
		
	ИначеЕсли КлючПолучить = "ЭтоЧерновик" Тогда
		
		ОписаниеБулево = Новый ОписаниеТипов("Булево");
		ЗначениеИтог	=	Строка(СоставПакета_Получить(СоставПакета, "КодСостояния")) = "0"
						И	ЗначениеЗаполнено(СоставПакета_Получить(СоставПакета, "ИдентификаторСБИС"))
						И	Не ОписаниеБулево.ПривестиЗначение(СоставПакета_Получить(СоставПакета, "Удален"))
						И	ЗначениеЗаполнено(СоставПакета_Получить(СоставПакета, "Этап"));

	ИначеЕсли КлючПолучить = "ОписаниеДействий" Тогда
		
		ЗначениеИтог = СоставПакета_ОписаниеДействий(СоставПакета);	
		
	ИначеЕсли КлючПолучить = "ТекущаяФазаДокумента" Тогда
		
		ЗначениеИтог = СоставПакета_ТекущаяФазаДокумента(СоставПакета);
		
	ИначеЕсли	КлючПолучить = "ПодходящийСертификат" Тогда

		ЗначениеИтог = СоставПакета_ПодходящийСертификат(СоставПакета, ДопПараметры);    
		
	ИначеЕсли	КлючПолучить = "Комментарий" Тогда

		ЗначениеИтог = СоставПакета_Комментарий(СоставПакета, ДопПараметры);  
		
	ИначеЕсли	КлючПолучить = "АктивныйЭтап" Тогда

		ЗначениеИтог = СоставПакета_АктивныйЭтап(СоставПакета, ДопПараметры);
		
	ИначеЕсли	КлючПолучить = "ТипAPI3Объекта" Тогда
		
		ЗначениеИтог = СоставПакета_ТипAPI3Объекта(СоставПакета);
		
	ИначеЕсли	КлючПолучить = "ДанныеСторон" Тогда
		
		ЗначениеИтог = СоставПакета_ПолучитьДанныеСторонИзПакета(СоставПакета);
		
	ИначеЕсли	КлючПолучить = "ЭтапыЦепочкиДокумента" Тогда
		
		Если	СоставПакета.Свойство("Расширение", 		ЗначениеИтог)
			И	ЗначениеИтог.Свойство("ЦепочкаДокументов",	ЗначениеИтог)
			И	ЗначениеИтог.Свойство("Этапы",				ЗначениеИтог)
			И	ЗначениеЗаполнено(ЗначениеИтог) Тогда
			
			Возврат ЗначениеИтог;
			
		КонецЕсли;

	ИначеЕсли	Не СоставПакета.Свойство(КлючПолучить, ЗначениеИтог)
			И	Не (	СоставПакета.Свойство("Параметры")
					И	СоставПакета.Параметры.Свойство(КлючПолучить, ЗначениеИтог))	Тогда
			
		Если ОбъектSABY_ЭтоТип(СоставПакета, "ПрикладнойОбъектSABY") Тогда
	
			ЗначениеИтог = ПрикладнойОбъектSABY_Получить(СоставПакета, КлючПолучить, ДопПараметры);
			
		Иначе
			
			СоставПакета.Свойство(КлючПолучить, ЗначениеИтог);
		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЗначениеИтог;
	
КонецФункции 

