
//Оставлено для совместимости, НЕ ИСПОЛЬЗОВАТЬ, места вызова переписать! Использовать ВызватьСбисИсключение
&НаКлиенте
Процедура СбисВызватьИсключение(БазоваяОшибка=Неопределено, СбисИмяКоманды,
								СбисКод=Неопределено, СбисСообщение=Неопределено, СбисДетализация=Неопределено, СбисДамп=Неопределено, СбисХелп=Неопределено) Экспорт
								
	МодульОбъектаКлиент().ВызватьСбисИсключение(БазоваяОшибка, СбисИмяКоманды, СбисКод, СбисСообщение, СбисДетализация, СбисДамп, СбисХелп);
	
КонецПроцедуры

//Оставлено для совместимости, НЕ ИСПОЛЬЗОВАТЬ, места вызова переписать! Использовать НовыйСбисИсключение
&НаКлиенте
Функция СбисИсключение(БазоваяОшибка=Неопределено, СбисИмяКоманды,
						СбисКод=Неопределено, СбисСообщение=Неопределено, СбисДетализация=Неопределено, СбисДамп=Неопределено, СбисХелп=Неопределено) Экспорт
	Возврат МодульОбъектаКлиент().НовыйСбисИсключение(БазоваяОшибка, СбисИмяКоманды, СбисКод, СбисСообщение, СбисДетализация, СбисДамп, СбисХелп);
КонецФункции

