
////////////////////////////////////////////////////
////////Вспомогательные функции кэширование/////////

//Функция получает значение из кэша через описание объекта
&НаКлиенте
Функция СбисПолучитьЗначениеРассчитанногоОбъекта(Кэш, сбисОписаниеОбъекта) Экспорт 
	
	СбисЗначенияОбъектов = Кэш.ТекущийСеанс.РасчитанныеЗначения.Получить(сбисОписаниеОбъекта.Тип);
	Если СбисЗначенияОбъектов = Неопределено Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат СбисЗначенияОбъектов.Получить(сбисОписаниеОбъекта.Ключ);
	
КонецФункции

//Функция кэширует сформированный и посчитанный объект
&НаКлиенте
Процедура СбисЗакэшироватьЗначениеРассчитанногоОбъекта(Кэш, сбисОписаниеОбъекта) Экспорт
	
	СбисЗначенияОбъектов = Кэш.ТекущийСеанс.РасчитанныеЗначения.Получить(сбисОписаниеОбъекта.Тип);
	
	Если СбисЗначенияОбъектов = Неопределено Тогда
		
		сбисЗначенияОбъектов = Новый Соответствие;
		Кэш.ТекущийСеанс.РасчитанныеЗначения.Вставить(сбисОписаниеОбъекта.Тип, сбисЗначенияОбъектов);
		
	КонецЕсли;
	
	сбисЗначенияОбъектов.Вставить(сбисОписаниеОбъекта.Ключ, сбисОписаниеОбъекта.Значение);
	
КонецПроцедуры

//Функция очищает кэшированное значение объекта
&НаКлиенте
Процедура ОчиститьЗначениеКэшированногоОбъекта(СбисОписаниеОбъекта, Кэш) Экспорт

	СбисЗначенияОбъектов = Кэш.ТекущийСеанс.РасчитанныеЗначения.Получить(сбисОписаниеОбъекта.Тип);
	Если СбисЗначенияОбъектов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	сбисЗначенияОбъектов.Удалить(сбисОписаниеОбъекта.Ключ);
	
КонецПроцедуры

//Функция очищает кэшированное значение объекта
&НаКлиенте
Процедура СбисОчиститьЗначениеРассчитанногоОбъекта(Кэш, сбисОписаниеОбъекта) Экспорт

	ОчиститьЗначениеКэшированногоОбъекта(СбисОписаниеОбъекта, Кэш)
	
КонецПроцедуры

