
////////////////////////////////////////////////////
///////////////Результат отправки///////////////////
////////////////////////////////////////////////////

&НаКлиенте
Функция ДобавитьОшибкуВРезультат(Кэш, Ошибка, ДанныеПоСтатусу) Экспорт
	ТекстОшибки			= Ошибка.message;
	ОписаниеРасширенное	= Ошибка.details;
	КодОшибки			= Ошибка.code;
	Кэш.РезультатОтправки.Ошибок = Кэш.РезультатОтправки.Ошибок + 1;
	Если Не Кэш.РезультатОтправки.Свойство("СоответствиеКодовИТекстовОшибок") Тогда
		Кэш.РезультатОтправки.Вставить("СоответствиеКодовИТекстовОшибок", Новый Соответствие);
	КонецЕсли;
	
	ЭлементСписка = Кэш.РезультатОтправки.ТипыОшибок.НайтиПоЗначению(ТекстОшибки);
	Если ЭлементСписка=Неопределено Тогда
		Кэш.РезультатОтправки.ТипыОшибок.Добавить(ТекстОшибки, 1);
		Кэш.РезультатОтправки.СоответствиеКодовИТекстовОшибок.Вставить(ТекстОшибки, КодОшибки);
	Иначе
		ЭлементСписка.Представление = Число(ЭлементСписка.Представление)+1;
	КонецЕсли;
	//AU изменена структура в детализации ошибок для возможности проброса дампа в сервис статистики
	ЭлементСоответствия = Кэш.РезультатОтправки.ДетализацияОшибок.Получить(ТекстОшибки);
	Если ЭлементСоответствия = Неопределено Тогда
		ЭлементСоответствия = Новый Массив;
		Кэш.РезультатОтправки.ДетализацияОшибок.Вставить(ТекстОшибки, ЭлементСоответствия);
	КонецЕсли;
	СтрокаВСоответствие = Новый Структура("ОбработанДокумент1С,Сообщение,СтруктураОшибки", ДанныеПоСтатусу.ОсновнойДокумент1С, ОписаниеРасширенное, Ошибка);
	ЭлементСоответствия.Добавить(СтрокаВСоответствие);
КонецФункции

