
////////////////////////////////////////////////////
////////////////////Статистика//////////////////////
////////////////////////////////////////////////////

//Обертка над методом, осталено для совместимости. НЕ ИСПОЛЬЗОВАТЬ
&НаКлиенте
Функция СбисСтатистика_СформироватьИЗаписатьСтатистикуНаСервис(Кэш, ПараметрыСтатистики, Отказ) Экспорт
	Попытка
		Если ПараметрыСтатистики.Действие = "Отправка" Тогда
			ПараметрыСтатистики.Вставить("РезультатОтправки", Кэш.РезультатОтправки);
		КонецЕсли;
		ПараметрыСтатистики.Вставить("ИмяРеестра", Кэш.Текущий.ТипДок);
		МодульОбъектаКлиент().СбисСтатистика_СформироватьИЗаписать(ПараметрыСтатистики, Новый Структура);	
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		Отказ = Истина;
		Возврат Кэш.ОбщиеФункции.СбисИсключение(ИнфоОбОшибке, "ОбщиеФункции.СформироватьИЗаписатьСтатистикуНаСервис");
	КонецПопытки;
КонецФункции

