
// Обработчик прерывания отправки через Ctrl+Break либо при получении пула ошибок, либо фатальной ошибки
//
// Параметры:
//  РезультатОтправки	 - РезультатОтправки (Структура)	 - класс для отправки
//
&НаКлиенте
Процедура РезультатОтправки_ОбработкаПрерывания(РезультатОтправки)
	
	Если		РезультатОтправки.Свойство("ПрерватьОтправку") Тогда
		ВызватьСбисИсключение(РезультатОтправки.ПрерватьОтправку, "МодульОбъектаКлиент.РезультатОтправки_ОбработкаПрерывания",,"Отправка была остановлена: " + РезультатОтправки.ПрерватьОтправку.message);
	ИначеЕсли	РезультатОтправки.ПараметрыОтправки.Индикатор.Прервано Тогда
		ВызватьСбисИсключение(790, "МодульОбъектаКлиент.РезультатОтправки_ОбработкаПрерывания");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОтправки_ПоказатьСтатус(РезультатОтправки, ТекстСостояния, СбисИндикатор = 0, СбисПояснение = "", ДопПараметры = Неопределено)
	
	ПараметрыДлительнойОперации = ДопПараметры;
	Если ПараметрыДлительнойОперации = Неопределено Тогда
		 ПараметрыДлительнойОперации = РезультатОтправки.ПараметрыОтправки.ПараметрыИндикатора;
	КонецЕсли;
	РезультатОтправки.ПараметрыОтправки.Индикатор.ПоказатьСостояниеДлительнойОперации(ТекстСостояния, СбисИндикатор, СбисПояснение, ПараметрыДлительнойОперации);

КонецПроцедуры

// Процедура - Прячет статус, сохраняя обработку прерывания
//
// Параметры:
//  РезультатОтправки	 - 	 - 
//
&НаКлиенте
Процедура РезультатОтправки_СпрятатьСтатус(РезультатОтправки, СбисЗавершить=Ложь)
			
	РезультатОтправки.ПараметрыОтправки.Индикатор.СпрятатьСтатусДлительнойОперации(СбисЗавершить);

КонецПроцедуры

&НаКлиенте
Функция РезультатОтправки_ПроверкаСертификатаПродолжитьОтправку(РезультатОтправки, ЦепочкаКомандОбработки)
	
	КлючСертификата			= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "КлючСертификата");
	ДанныеСертификатов		= ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки,		"КэшСертификатов");
	
	Если КлючСертификата = Неопределено Тогда
	
		ДокументСБИС			= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "ДокументСБИС");
		ОтправительДокумента	= СоставПакета_Получить(ДокументСБИС, "НашаОрганизация");
		КлючСертификата			= Сторона_Получить(ОтправительДокумента, "КлючСертификата");
		ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "КлючСертификата", КлючСертификата);
		
	КонецЕсли;
	
	// Требуется проверка сертификата.			
	ОшибкаАктивации = ДанныеСертификатов.ИННОшибки.Получить(КлючСертификата);
	Если Не ОшибкаАктивации = Неопределено Тогда
		
		// Установить ошибку сертификата, чтобы на следующей итерации отправки накопленных действий уронить с ошибкой
		ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Ошибка", ОшибкаАктивации);
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ДанныеСертификатов.ИННАктивированы.НайтиПоЗначению(КлючСертификата) = Неопределено Тогда
		
		// Сертификат не активирован. Подготовка активации.
		РезультатОтправки_Асинх_ПроверитьСертификаты_Подготовить(РезультатОтправки, ЦепочкаКомандОбработки);
		Если ДанныеСертификатов.ИННАктивировать.НайтиПоЗначению(КлючСертификата) = Неопределено Тогда
			
			ДанныеСертификатов.ИННАктивировать.Добавить(КлючСертификата);
			
		КонецЕсли;
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Отправка_РезультатОтправки_private_Команды
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Отправка_РезультатОтправки_private_Статистика
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Отправка_РезультатОтправки_private_МассоваяОтправка
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Отправка_РезультатОтправки_private_ЦепочкаКомандОбработки
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Документы_РезультатОтправки_ОбработкаОтветов
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Документы_РезультатОтправки_ЗаписьИтогов
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Документы_РезультатОтправки_Замер
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Документы_РезультатОтправки_ПользовательскиеДействия
#КонецОбласти

