
// Обработчик прерывания отправки через Ctrl+Break либо при получении пула ошибок, либо фатальной ошибки
//
// Параметры:
//  РезультатОтправки	 - РезультатОтправки (Структура)	 - класс для отправки
//
&НаКлиенте
Процедура РезультатОтправки_ОбработкаПрерывания(РезультатОтправки)
	
	Если		РезультатОтправки.Свойство("ПрерватьОтправку") Тогда
		ВызватьСбисИсключение(РезультатОтправки.ПрерватьОтправку, "МодульОбъектаКлиент.РезультатОтправки_ОбработкаПрерывания",,"Отправка была остановлена: " + РезультатОтправки.ПрерватьОтправку.message);
	ИначеЕсли	РезультатОтправки.ПараметрыОтправки.Индикатор.Прервано Тогда
		ВызватьСбисИсключение(790, "МодульОбъектаКлиент.РезультатОтправки_ОбработкаПрерывания");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОтправки_ПоказатьСтатус(РезультатОтправки, ТекстСостояния, СбисИндикатор = 0, СбисПояснение = "", ДопПараметры = Неопределено)
	
	ПараметрыДлительнойОперации = ДопПараметры;
	Если ПараметрыДлительнойОперации = Неопределено Тогда
		 ПараметрыДлительнойОперации = РезультатОтправки.ПараметрыОтправки.ПараметрыИндикатора;
	КонецЕсли;
	РезультатОтправки.ПараметрыОтправки.Индикатор.ПоказатьСостояниеДлительнойОперации(ТекстСостояния, СбисИндикатор, СбисПояснение, ПараметрыДлительнойОперации);

КонецПроцедуры

// Процедура - Прячет статус, сохраняя обработку прерывания
//
// Параметры:
//  РезультатОтправки	 - 	 - 
//
&НаКлиенте
Процедура РезультатОтправки_СпрятатьСтатус(РезультатОтправки, СбисЗавершить=Ложь)
			
	РезультатОтправки.ПараметрыОтправки.Индикатор.СпрятатьСтатусДлительнойОперации(СбисЗавершить);

КонецПроцедуры

&НаКлиенте
Функция РезультатОтправки_ПроверкаСертификатаПродолжитьОтправку(РезультатОтправки, ЦепочкаКомандОбработки)
	
	КлючСертификата			= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "КлючСертификата");
	ДанныеСертификатов		= ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки,		"КэшСертификатов");
	
	Если КлючСертификата = Неопределено Тогда
	
		ДокументСБИС			= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "ДокументСБИС");
		ОтправительДокумента	= СоставПакета_Получить(ДокументСБИС, "НашаОрганизация");
		КлючСертификата			= Сторона_Получить(ОтправительДокумента, "КлючСертификата");
		ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "КлючСертификата", КлючСертификата);
		
	КонецЕсли;
	
	// Требуется проверка сертификата.			
	ОшибкаАктивации = ДанныеСертификатов.ИННОшибки.Получить(КлючСертификата);
	Если Не ОшибкаАктивации = Неопределено Тогда
		
		// Установить ошибку сертификата, чтобы на следующей итерации отправки накопленных действий уронить с ошибкой
		ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Ошибка", ОшибкаАктивации);
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ДанныеСертификатов.ИННАктивированы.НайтиПоЗначению(КлючСертификата) = Неопределено Тогда
		
		// Сертификат не активирован. Подготовка активации.
		РезультатОтправки_Асинх_ПроверитьСертификаты_Подготовить(РезультатОтправки, ЦепочкаКомандОбработки);
		Если ДанныеСертификатов.ИННАктивировать.НайтиПоЗначению(КлючСертификата) = Неопределено Тогда
			
			ДанныеСертификатов.ИННАктивировать.Добавить(КлючСертификата);
			
		КонецЕсли;
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Отправляет сформированную пачку документов
//
// Параметры:
//  РезультатОтправки		 - РезультатОтправки (Структура)	 - класс для отправки
//  ПачкаДокументовКОтправке - Массив	 - массив из стурктур с готовым к отправке документом и пакетом
//  ОжидатьСвободныеПотоки	 - Булево	 - если Истина и потоков недостаточно для отправки всей пачки, то отправка не будет выполнена
// 
// Возвращаемое значение:
//  Булево - Отправили пачку, или нет
//
&НаКлиенте
Функция РезультатОтправки_ОтправитьПачкуДокументов(РезультатОтправки, ПачкаДокументовКОтправке, ОжидатьСвободныеПотоки)
	Перем ОшибкаОтправкиПачки;
	
	ПотоковСвободно = РезультатОтправки.ПараметрыОтправки.КоличествоПотоков - РезультатОтправки.ПараметрыОтправки.Потоки.Количество();
	Если 	ОжидатьСвободныеПотоки
		И	ПотоковСвободно < ПачкаДокументовКОтправке.Количество() Тогда
		//Набрана пачка документов, но её нельзя отправить, т.к. нет достаточного количества потоков
		Возврат Ложь;
	КонецЕсли;
		
	МодульОтправкиПачки = ГлавноеОкно.СбисНайтиФормуФункции("Отправка_ПачкаДокументов", ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя"));
	РезультатОтправки_СпрятатьСтатус(РезультатОтправки);
	Если МодульОтправкиПачки = Ложь Тогда
		СчетчикПачки = 0;
		ПараметрыИндикатораПачки = Новый Структура("Прерывать, БлокироватьИнтерфейс", Ложь, Истина);

		Для Каждого ДанныеОтправки Из ПачкаДокументовКОтправке Цикл
			СчетчикПачки = СчетчикПачки + 1;
			СтатусДоОтправки = ЦепочкаКомандОбработки_Получить(ДанныеОтправки, "Статус");
			Попытка
				РезультатОтправки_ОбработкаПрерывания(РезультатОтправки);
			Исключение
				//Прервано с ошибкой.
				Возврат Ложь;
			КонецПопытки;			
			Если РезультатОтправки.ПараметрыОтправки.СтатусПоПачкам Тогда
				
				РезультатОтправки_ПоказатьСтатус(РезультатОтправки, "Отправка пачки документов", Окр(СчетчикПачки * 100 / ПачкаДокументовКОтправке.Количество()),,ПараметрыИндикатораПачки);
				
			КонецЕсли;
			Если ОшибкаОтправкиПачки = Неопределено Тогда
				//Была фатальная ошибка отправки, роняем всё с ней.
				Попытка
					РезультатОтправки_ДокументВСвободныйПоток(РезультатОтправки, ДанныеОтправки);
					Если СтатусДоОтправки = ЦепочкаКомандОбработки_Получить(ДанныеОтправки, "Статус") Тогда
						//Статус должен измениться в процессе, сразу после отправки.
						ВызватьСбисИсключение(100, "МодульОбъектаКлиент.РезультатОтправки_ДокументВСвободныйПоток",,, "Неизвестная ошибка события в процессе отправки");
					КонецЕсли;
				Исключение
					ОшибкаОтправкиПачки			= НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.РезультатОтправки_ОтправитьПачкуДокументов");
					ПараметрыОбработатьОшибку	= Новый Структура("Фатальная, Исключение", Истина, ОшибкаОтправкиПачки);
					РезультатОтправки_ОбработатьОшибку(РезультатОтправки, ДанныеОтправки, ПараметрыОбработатьОшибку);
				КонецПопытки;
			Иначе
				ПараметрыОбработатьОшибку = Новый Структура("Фатальная, ИдентификаторОтправки", Истина, СоставПакета_Идентификатор(ДанныеОтправки.СоставПакета));
				РезультатОтправки_ОбработатьОшибку(РезультатОтправки, ДанныеОтправки, ПараметрыОбработатьОшибку);
			КонецЕсли;
		КонецЦикла;
	Иначе
		РезультатОтправки_ПоказатьСтатус(РезультатОтправки, "Отправка пачки документов");

		Попытка
			РезультатОтправки_ОбработкаПрерывания(РезультатОтправки);
		Исключение
			//Прервано с ошибкой.
			Возврат Ложь;
		КонецПопытки;
		
		СбисОтправки = Новый Массив;
		Для Каждого ДокументВПачке Из ПачкаДокументовКОтправке Цикл
			
			КомандаДляПотока = РезультатОтправки_НовыйАсинхроннаяСбисКоманда(РезультатОтправки, ДокументВПачке);
			АсинхроннаяСбисКоманда_ВызватьСобытие(КомандаДляПотока, НовыйАсинхронноеСбисСобытие(,,"AfterCall"));
			СбисОтправки.Добавить(КомандаДляПотока);
			
		КонецЦикла;
		Попытка
			
			ДатаНач = ТекущаяДата();

			ПараметрыОбработки		= Новый Структура("Отправки, РезультатОтправки", СбисОтправки, РезультатОтправки);
			МодульОтправкиПачки.Отправка_ПачкаДокументов(ПараметрыОбработки, ГлавноеОкно.Кэш);
			
			ДатаКнц = ТекущаяДата();
			
			РезультатОтправки.ВремяОтправки = РезультатОтправки.ВремяОтправки + (ДатаКнц - ДатаНач);
			
			РезультатОтправки_ПоказатьСтатус(РезультатОтправки, "Обработка ответов");
			МодульОтправкиПачки.Отправка_ОбработкаРезультатаПачкиДокументов(ПараметрыОбработки, ГлавноеОкно.Кэш);
			
		Исключение
			ОшибкаПачки					= НовыйСбисИсключение(ИнформацияОбОшибке(), ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".Отправка_ПачкаДокументов");
			ПараметрыОбработатьОшибку	= Новый Структура("Исключение, Фатальная", ОшибкаПачки, Истина);
			Для Каждого ДанныеОтправки Из ПачкаДокументовКОтправке Цикл
				РезультатОтправки_ОбработатьОшибку(РезультатОтправки, ДанныеОтправки, ПараметрыОбработатьОшибку);
			КонецЦикла;
		КонецПопытки;
	КонецЕсли;
	РезультатОтправки_СпрятатьСтатус(РезультатОтправки);
	
	Возврат Истина
	
КонецФункции
	
// Процедура - поставить пакет в очередь к отправке
//
// Параметры:
//  РезультатОтправки	 - РезультатОтправки (Структура)	 - класс для отправки
//  ДанныеОтправки		 - Струкутра	 - СоставПакета, Документ, Статус, ИНН
//
&НаКлиенте
Процедура РезультатОтправки_ПоставитьВОчередьКОтправке(РезультатОтправки, ЦепочкаКомандОбработки) Экспорт
	Перем ПодготовленныеСоответствие;
	
	ИдОтправки	= ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "Идентификатор");
	
	Если  ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "Статус") = "Подготовка" Тогда
		Попытка
			//Подготовить пакет к отправке
			ЦепочкаКомандОбработки_Подготовить(ЦепочкаКомандОбработки);
			РезультатОтправки.ПорНомер = РезультатОтправки.ПорНомер + 1;
		Исключение
			СбисИсключение	= НовыйСбисИсключение(ИнформацияОбОшибке(), ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".РезультатОтправки_Асинх_Отправка");
			ПараметрыОшибки	= Новый Структура("Исключение, Подготовка", СбисИсключение, Истина);
			РезультатОтправки_ОбработатьОшибку(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыОшибки);
			Возврат;
		КонецПопытки;
	КонецЕсли;	
	РезультатОтправки.Очередь.Подготовлены.Вставить(ИдОтправки, ЦепочкаКомандОбработки);
	
КонецПроцедуры

// Процедура - поставить пакет в очередь к отправке
//
// Параметры:
//  РезультатОтправки		- РезультатОтправки (Структура)- класс для отправки
//  ИдентификаторОтправки	- Строка	 					- Ид уже сформированного документа, который переотправляем
//
&НаКлиенте
Процедура РезультатОтправки_ПоставитьВОчередьНаПовторнуюОтправку(РезультатОтправки, ЦепочкаКомандОбработки) Экспорт
	
	РезультатОтправки.Счетчики.ОшибокОтправки	= РезультатОтправки.Счетчики.ОшибокОтправки + 1;		
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "Переотправка");
	РезультатОтправки_ПоставитьВОчередьКОтправке(РезультатОтправки, ЦепочкаКомандОбработки);
		
КонецПроцедуры

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Отправка_РезультатОтправки_private_Команды
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Отправка_РезультатОтправки_private_Статистика
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Отправка_РезультатОтправки_private_МассоваяОтправка
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Документы_РезультатОтправки_ОбработкаОтветов
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Документы_РезультатОтправки_ЗаписьИтогов
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Документы_РезультатОтправки_Замер
#КонецОбласти

