
// Функция - создаёт строку сопоставления единицы
//
// Параметры:
//  ИдСБИС	 - 	 - 
//  ИмяСБИС	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция НовыйСопоставлениеДляЕдиницыСервер() Экспорт
	
	Возврат Новый Структура("_класс, Коэффициент, ОКЕИ, Название, Ссылка, Владелец", "СопоставлениеДляЕдиницы", "1", "", "", "", "", "");

КонецФункции

Функция СопоставлениеДляЕдиницыСервер_Ключ(СопоставлениеДляЕдиницы) Экспорт
	
	Если ЗначениеЗаполнено(СопоставлениеДляЕдиницы.Ссылка) Тогда
		Возврат СопоставлениеДляЕдиницы.Ссылка;
	ИначеЕсли ЗначениеЗаполнено(СопоставлениеДляЕдиницы.ОКЕИ) Тогда
		Возврат СопоставлениеДляЕдиницы.ОКЕИ + "_" + СопоставлениеДляЕдиницы.Название;
	Иначе
		Возврат СопоставлениеДляЕдиницы.Название;
	КонецЕсли
		
КонецФункции

Функция СопоставлениеДляЕдиницыСервер_Получить(СопоставлениеДляЕдиницы, КлючПоиска) Экспорт
	
	Если КлючПоиска = "Владелец" Тогда
		Если ЗначениеЗаполнено(СопоставлениеДляЕдиницы.Ссылка) Тогда
			//Если ссылка есть, то владелец не должен быть пустым. Прочерк, если в принципе нет.
			Попытка
				//Пока через Try, переделать на параметр от ини конфигурации
				СопоставлениеДляЕдиницы.Владелец = СопоставлениеДляЕдиницы.Ссылка.Владелец;
			Исключение
			КонецПопытки;
			Если Не ЗначениеЗаполнено(СопоставлениеДляЕдиницы.Владелец) Тогда
				СопоставлениеДляЕдиницы.Владелец = "-";
				//Не удалось установить владельца. Вроде не должно быть ошибкой
			КонецЕсли;
		Иначе
			СопоставлениеДляЕдиницы.Владелец = "";
		КонецЕсли;
		Возврат СопоставлениеДляЕдиницы.Владелец;
	ИначеЕсли КлючПоиска = "Единица" Тогда
		Попытка
			СопоставлениеДляЕдиницы.Единица = СопоставлениеДляЕдиницы.Владелец.Единица;
		Исключение
			Возврат Неопределено;
		КонецПопытки
		
	КонецЕсли;
	
	Возврат СопоставлениеДляЕдиницы[КлючПоиска];
	
КонецФункции

Процедура СопоставлениеДляЕдиницыСервер_Вставить(СопоставлениеДляЕдиницы, КлючВставить, ЗначениеВставить) Экспорт
	
	Перем КлючДобавитьВДанные, ЗначениеЗаполнить;
	
	Если		КлючВставить = "Ссылка" Тогда
		Если ЗначениеЗаполнено(ЗначениеВставить) Тогда
			
			СопоставлениеДляЕдиницы.Ссылка = ЗначениеВставить;
			
			//Если ссылка есть, то владелец не должен быть пустым. Прочерк, если в принципе нет.
			Попытка
				СопоставлениеДляЕдиницы.Владелец = ЗначениеВставить.Владелец;
			Исключение
			КонецПопытки;
			Если НЕ ЗначениеЗаполнено(СопоставлениеДляЕдиницы.Владелец) Тогда
				//Не удалось установить владельца. Вроде не должно быть ошибкой
				СопоставлениеДляЕдиницы.Владелец = "-";
			КонецЕсли;
			
		Иначе
			
			СопоставлениеДляЕдиницы.Владелец = "";
			
		КонецЕсли;
	ИначеЕсли	КлючВставить = "Название" Тогда
		
		Если ЗначениеЗаполнено(ЗначениеВставить) Тогда
			СопоставлениеДляЕдиницы.Название = ЗначениеВставить;
		Иначе
			СопоставлениеДляЕдиницы.Название = Строка(СопоставлениеДляЕдиницы.Ссылка);
		КонецЕсли;
		
	ИначеЕсли	КлючВставить = "Коэффициент" Тогда
		
		Если ЗначениеЗаполнено(ЗначениеВставить) Тогда
			СопоставлениеДляЕдиницы[КлючВставить] = ЗначениеВставить;
		Иначе
			СопоставлениеДляЕдиницы[КлючВставить] = "1";
		КонецЕсли;
		
	ИначеЕсли	СопоставлениеДляЕдиницы.Свойство(КлючВставить) Тогда
		
		СопоставлениеДляЕдиницы[КлючВставить] = ЗначениеВставить;
		
	КонецЕсли;

КонецПроцедуры

Процедура СопоставлениеДляЕдиницыСервер_Заполнить(СопоставлениеДляЕдиницы, Источник, КлючПоиска, ДопПараметры) Экспорт
	
	Перем КлючДобавитьВДанные, ЗначениеЗаполнить;
	
	Если Не ДопПараметры.Свойство("Ключ", КлючДобавитьВДанные) Тогда 
		КлючДобавитьВДанные = КлючПоиска;
	КонецЕсли;
	Если	Не	Источник.Свойство(КлючПоиска, ЗначениеЗаполнить)
		Или Не	ЗначениеЗаполнено(ЗначениеЗаполнить) Тогда
		Возврат;
	КонецЕсли;
	
	СопоставлениеДляЕдиницы.Вставить(КлючДобавитьВДанные, ЗначениеЗаполнить);

КонецПроцедуры

Процедура СопоставлениеДляЕдиницыСервер_Заполнить1С(СтрокаСопоставленияСБИС, СопоставлениеЗаполнить) Экспорт
	
	Перем СЛокальнаяПеременная;
	
	Если		СопоставлениеЗаполнить.Свойство("ЕдИзмОрг", СЛокальнаяПеременная) Тогда
		// Наименование единицы измерения в старом формате
	ИначеЕсли	СопоставлениеЗаполнить.Свойство("ЕдИзм1С", СЛокальнаяПеременная) Тогда
		// Наименование единицы измерения в новом формате
	КонецЕсли;
	Если	ЗначениеЗаполнено(СЛокальнаяПеременная)
		И	СтрокаСопоставленияСБИС.Номенклатура1С.Получить(СопоставлениеЗаполнить.Номенклатура).Единицы.Получить(СЛокальнаяПеременная) = Неопределено Тогда
		ЕдиницаСопоставление = НовыйСопоставлениеДляЕдиницыСервер();
		СопоставлениеДляЕдиницыСервер_Вставить(ЕдиницаСопоставление, "Ссылка", СЛокальнаяПеременная);
	Иначе
		Возврат;
	КонецЕсли;
	
	Если	СопоставлениеЗаполнить.Свойство("ОКЕИ_1С", СЛокальнаяПеременная)
		И	ЗначениеЗаполнено(СЛокальнаяПеременная) Тогда
		СопоставлениеДляЕдиницыСервер_Вставить(ЕдиницаСопоставление, "ОКЕИ", СЛокальнаяПеременная);
	КонецЕсли;
	
	Если		СопоставлениеЗаполнить.Свойство("Коэффициент",	СЛокальнаяПеременная) Тогда
		// Коэффициент в старом формате
	ИначеЕсли	СопоставлениеЗаполнить.Свойство("Коэффициент1С",	СЛокальнаяПеременная) Тогда
		// Коэффициент в новом формате
	КонецЕсли;
	Если ЗначениеЗаполнено(СЛокальнаяПеременная) Тогда
		СопоставлениеДляЕдиницыСервер_Вставить(ЕдиницаСопоставление, "Коэффициент", СЛокальнаяПеременная);
	КонецЕсли;
	
	Если	СопоставлениеЗаполнить.Свойство("ЕдИзмНаименование1С",	СЛокальнаяПеременная)
		И	ЗначениеЗаполнено(СЛокальнаяПеременная) Тогда
		СопоставлениеДляЕдиницыСервер_Вставить(ЕдиницаСопоставление, "Название", СЛокальнаяПеременная);
	КонецЕсли;	
	
	// Передадим текущую номенлатуру для установки в нее единицы
	ДопПараметры = Новый Структура("Номенклатура", СопоставлениеЗаполнить.Номенклатура);	
	
	СтрокаСопоставленияСБИССервер_Вставить(СтрокаСопоставленияСБИС, "Единица", ЕдиницаСопоставление, ДопПараметры);
	
КонецПроцедуры

Процедура СопоставлениеДляЕдиницыСервер_ЗаполнитьСБИС(СтрокаСопоставленияСБИС, СопоставлениеЗаполнить) Экспорт
	
	Перем СЛокальнаяПеременная;
	
	ЕдиницаСопоставление = НовыйСопоставлениеДляЕдиницыСервер();
	
	Если		СопоставлениеЗаполнить.Свойство("ЕдИзмОКЕИ", СЛокальнаяПеременная) Тогда 
		// ОКЕИ в старом формате вариант 1	
	ИначеЕсли	СопоставлениеЗаполнить.Свойство("ОКЕИ", СЛокальнаяПеременная) Тогда
		// ОКЕИ в старом формате вариант 2
	ИначеЕсли	СопоставлениеЗаполнить.Свойство("ЕдИзмОКЕИ_СБИС", СЛокальнаяПеременная) Тогда
		// ОКЕИ в новом формате вариант 1
	ИначеЕсли	СопоставлениеЗаполнить.Свойство("ОКЕИ_СБИС", СЛокальнаяПеременная) Тогда
		// ОКЕИ в новом формате вариант 2
	КонецЕсли;
	Если ЗначениеЗаполнено(СЛокальнаяПеременная) Тогда
		СопоставлениеДляЕдиницыСервер_Вставить(ЕдиницаСопоставление, "ОКЕИ", СЛокальнаяПеременная);
	КонецЕсли;
	
	Если СопоставлениеЗаполнить.Свойство("КоэффициентСБИС",	СЛокальнаяПеременная) Тогда
		// Коэффициент в новом формате
	КонецЕсли;
	Если ЗначениеЗаполнено(СЛокальнаяПеременная) Тогда
		СопоставлениеДляЕдиницыСервер_Вставить(ЕдиницаСопоставление, "Коэффициент", СЛокальнаяПеременная);
	КонецЕсли;
	
	Если		СопоставлениеЗаполнить.Свойство("ЕдИзмНаименование",	СЛокальнаяПеременная) Тогда
		// Наименование единицы измерения в старом формате вариант 1
	ИначеЕсли 	СопоставлениеЗаполнить.Свойство("ЕдИзм",				СЛокальнаяПеременная) Тогда
		// Наименование единицы измерения в старом формате вариант 2
	ИначеЕсли	СопоставлениеЗаполнить.Свойство("ЕдИзмНаименованиеСБИС",СЛокальнаяПеременная) Тогда
		// Наименование единицы измерения в новом формате
	КонецЕсли;	
	Если ЗначениеЗаполнено(СЛокальнаяПеременная) Тогда
		СопоставлениеДляЕдиницыСервер_Вставить(ЕдиницаСопоставление, "Название", СЛокальнаяПеременная);
	КонецЕсли;	
	
	СтрокаСопоставленияСБИССервер_Вставить(СтрокаСопоставленияСБИС, "Единица", ЕдиницаСопоставление);
	
КонецПроцедуры

