
&НаКлиенте
Процедура CountryПриИзменении(Элемент)                                             
	
	ГОСТTLS	= Ложь;
	
    ОбновитьСписокДоступныхДоменов();
	ОбновитьСписокДоступныхСтендов();
	
	ЭлементDomain = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Domain");
	Domain = ЭлементДоменСтендКонтурПоСписку(Domain, ЭлементDomain.СписокВыбора);
	
	ЭлементContour = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Contour");
	Contour = ЭлементДоменСтендКонтурПоСписку(Contour, ЭлементContour.СписокВыбора);

	РазобранныйАдрес = СбисПолучитьСтруктуруРазобраногоАдреса();
	АдресСервера = МодульОбъектаКлиент().СбисСобратьАдресСервера(РазобранныйАдрес);
	
КонецПроцедуры

&НаКлиенте
Процедура DomainПриИзменении(Элемент)
	РазобранныйАдрес = СбисПолучитьСтруктуруРазобраногоАдреса();
	АдресСервера = МодульОбъектаКлиент().СбисСобратьАдресСервера(РазобранныйАдрес);
КонецПроцедуры 

&НаКлиенте
Процедура ГОСТTLSПриИзменении(Элемент)
	РазобранныйАдрес = СбисПолучитьСтруктуруРазобраногоАдреса();
	АдресСервера = МодульОбъектаКлиент().СбисСобратьАдресСервера(РазобранныйАдрес);
КонецПроцедуры

&НаКлиенте
Процедура ContourПриИзменении(Элемент)
	РазобранныйАдрес = СбисПолучитьСтруктуруРазобраногоАдреса();
	АдресСервера = МодульОбъектаКлиент().СбисСобратьАдресСервера(РазобранныйАдрес);
КонецПроцедуры  

&НаКлиенте
Процедура testContourПриИзменении(Элемент)
	
	Если testContour Тогда
		
		// Выбрать первый по списку
		Contour = "";
		
	КонецЕсли;
	ОбновитьСписокДоступныхСтендов();
	
	РазобранныйАдрес = СбисПолучитьСтруктуруРазобраногоАдреса();
	АдресСервера = МодульОбъектаКлиент().СбисСобратьАдресСервера(РазобранныйАдрес);
	
КонецПроцедуры 

&НаКлиенте
Процедура НевидимаяКнопкаНажатие(Элемент)
	СчетчикНажатий = СчетчикНажатий + 1;
	Если СчетчикНажатий >= 7 Тогда
		ЭлементГОСТTLS = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ГОСТTLS");
		ЭлементНевидимаяКнопка = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "НевидимаяКнопка");
		ЭлементНевидимаяКнопка.Видимость = Ложь;
		ЭлементГОСТTLS.Видимость = Истина;	
	КонецЕсли;
КонецПроцедуры

