
#Область include_core2_vo2_СпособыОбмена_NativeAPI_ВнешниеОбертки_АсинхронноеВыполнениеДействия
#КонецОбласти

#Область include_core2_vo2_СпособыОбмена_NativeAPI_ВнешниеОбертки_АсинхроннаяОтправка
#КонецОбласти

#Область include_core2_vo2_СпособыОбмена_NativeAPI_ВнешниеОбертки_АсинхронныеОперации
#КонецОбласти

#Область include_core2_vo2_СпособыОбмена_NativeAPI_ВнешниеОбертки_СинхронныеОперации
#КонецОбласти

&НаКлиенте
Функция СБИС_ЗаписатьДокумент(Кэш, document_in, ДопПараметры=Неопределено, Отказ=Ложь)
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура("ПреобразовыватьДаты, СообщатьПриОшибке, ВернутьОшибку", Ложь, Ложь, Истина);
	Иначе
		ОбязательныеПараметры = Новый Структура("ПреобразовыватьДаты, СообщатьПриОшибке, ВернутьОшибку", Ложь, Ложь, Истина);
		Для Каждого КлючЗначение Из ОбязательныеПараметры Цикл
			Если Не ДопПараметры.Свойство(КлючЗначение.Ключ) Тогда
				ДопПараметры.Вставить(КлючЗначение.Ключ,КлючЗначение.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СтруктураПараметровЗапроса	= Новый Структура("Документ", document_in);
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ЗаписатьДокумент", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  "SABYHttpClient.СБИС_ЗаписатьДокумент");
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СБИС_ВыполнитьДействие(Кэш, document_in, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ВыполнитьДействие", Новый Структура("Документ",document_in), ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  "API.СБИС_ВыполнитьДействие");
	КонецЕсли;
	Возврат Результат;
КонецФункции

//Проверяет действительность текущей сессии
&НаКлиенте
Функция СБИС_ПроверитьСессию(ИдСессииПроверить) Экспорт
	
	Кэш			= МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	Отказ		= Ложь;
	ДопПараметры= Новый Структура("ЕстьРезультат, АдресРесурса, ИдСессии", Истина, "/auth/service/", ИдСессииПроверить);
	
	РезультатЗапроса = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ПроверитьСессию", Новый Структура, ДопПараметры, Отказ);
	Если Отказ Тогда
		
		ОшибкаПроверитьСессию = МодульОбъектаКлиент().НовыйСбисИсключение(РезультатЗапроса, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_ПроверитьСессию");
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_ВСтроку(ОшибкаПроверитьСессию);
		
	КонецЕсли;
	
	Возврат	РезультатЗапроса.СессияАктивна = "Да"

КонецФункции

&НаКлиенте
Функция СБИС_ПодготовитьДействие(Кэш, document_in, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ПодготовитьДействие", Новый Структура("Документ",document_in), ДопПараметры, Отказ);	
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  "SABYHttpClient.СБИС_ПодготовитьДействие");
	КонецЕсли;
	Возврат Результат;
КонецФункции
	
&НаКлиенте
Функция СБИС_ПрочитатьДокумент(Кэш, param, ДопПараметры, Отказ) Экспорт
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ПрочитатьДокумент", Новый Структура("Документ", param), ДопПараметры, Отказ);
	Если Отказ Тогда
		
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_ПрочитатьДокумент");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СБИС_РасшифроватьФайл(Кэш, param, ДопПараметры, Отказ) Экспорт

	ВызватьИсключение "Невозможно расшифровать файл.";

КонецФункции

&НаКлиенте
Функция СБИС_СериализоватьСтрокуВBase64(Кэш, ПараметрыСериализовать, ДопПараметры, Отказ) Экспорт
	Возврат сбисСтрокаВBASE64(ПараметрыСериализовать.Строка);
КонецФункции

&НаКлиенте
Функция СБИС_СериализоватьФайлВBase64(Кэш, ПараметрыСериализовать, ДопПараметры, Отказ) Экспорт
	
	Возврат  МодульОбъектаКлиент().ПолучитьBASE64ПоИмениФайлаКлиент(ПараметрыСериализовать.ПолноеИмяФайла);
	
КонецФункции  

//Функция сохраняет по ссылке в файл в зависимости от среды и настройки "вызовы на клиенте".
//При успехе возвращает ссылку на файл, куда сохранили
//При неудаче структуру ошибки
&НаКлиенте
Функция СБИС_СохранитьПоСсылкеВФайл(Кэш, ПараметрыФайла, ДопПараметры, Отказ) Экспорт
	ПараметрыВызова = Новый Структура("АдресРесурса", ПараметрыФайла.Ссылка);
	ИмяФайлаПолучить = ПараметрыФайла.ИмяФайла;
	Если Не ЗначениеЗаполнено(ИмяФайлаПолучить) Тогда
		ИмяФайлаПолучить = Кэш.ОбщиеФункции.СбисПолучитьИмяВременногоФайлаКлиент("tmp");
	КонецЕсли;
	//#Если ВебКлиент Тогда
	//	Результат = СохранитьВложениеПоСсылкеВФайлНаСервере(КэшДляЗапросаНаСервере(Кэш), ПараметрыВызова, Отказ);
	//	Если Отказ Тогда
	//		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  "API.СБИС_СохранитьПоСсылкеВФайл");
	//	КонецЕсли;
	//	//Получаем файл с сервера
	//	Результат = СбисПолучитьФайлНаКлиент(Кэш, ИмяФайлаПолучить, Результат, Отказ);
	//	Если Отказ Тогда
	//		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  "API.СБИС_СохранитьПоСсылкеВФайл");
	//	КонецЕсли;
	//#ИначеЕсли ТолстыйКлиентОбычноеПриложение Тогда
	//	ПараметрыВызова.Вставить("ПутьКФайлу", ИмяФайлаПолучить);
	//	Результат = СбисОтправитьИОбработатьКомандуGETНаКлиенте(Кэш, ПараметрыВызова, Отказ);
	//	Если Отказ Тогда
	//		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  "API.СБИС_СохранитьПоСсылкеВФайл");
	//	КонецЕсли;
	//#Иначе
		//Если Кэш.Парам.ИнтеграцияAPIВызовыНаКлиенте Тогда
			ПараметрыВызова.Вставить("ПутьКФайлу", ИмяФайлаПолучить);
			Результат = СбисОтправитьИОбработатьКомандуGETНаКлиенте(Кэш, ПараметрыВызова, Отказ);
			Если Отказ Тогда
				СообщениеОбОшибке = "Не удалось скачать файл по ссылке: " + ПараметрыВызова.АдресРесурса;
				Возврат МодульОбъектаКлиент().НовыйСбисИсключение(Результат, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_СохранитьПоСсылкеВФайл",,,СообщениеОбОшибке);
			КонецЕсли;
	//	Иначе
	//		Результат = СохранитьВложениеПоСсылкеВФайлНаСервере(КэшДляЗапросаНаСервере(Кэш), ПараметрыВызова, Отказ);
	//		Если Отказ Тогда
	//			Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  "API.СБИС_СохранитьПоСсылкеВФайл");
	//		КонецЕсли;
	//		//Получаем файл с сервера
	//		Результат = СбисПолучитьФайлНаКлиент(Кэш, ИмяФайлаПолучить, Результат, Отказ);
	//		Если Отказ Тогда
	//			Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  "API.СБИС_СохранитьПоСсылкеВФайл");
	//		КонецЕсли;
	//	КонецЕсли;
	//#КонецЕсли
	Возврат ИмяФайлаПолучить;
КонецФункции

&НаКлиенте
Функция СБИС_СписокИзменений(Кэш, filter, ДопПараметры, Отказ) Экспорт
	СтруктураПараметровЗапроса	= Новый Структура("Фильтр", filter);
	ДопПараметрыВызова			= Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "СБИС.СписокИзменений", СтруктураПараметровЗапроса, ДопПараметрыВызова, Отказ);
	Если Отказ Тогда
		Результат = Кэш.ОбщиеФункции.СбисИсключение(Результат, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_СписокИзменений");
	КонецЕсли;
	Возврат Результат;
КонецФункции

//Возвращает текущую дату/время. Для вызовов сервера - время на сервере.
&НаКлиенте
Функция СБИС_ТекущаяДата(Кэш, Отказ=Ложь) Экспорт
	
	//Если Кэш.Парам.ИнтеграцияAPIВызовыНаКлиенте Тогда
		Возврат ТекущаяДата();
	//КонецЕсли;		
	//ДопПараметры				= Новый Структура("СообщатьПриОшибке, ВернутьОшибку", Ложь, Истина);
	//СтруктураПараметровЗапроса	= Новый Структура("Параметр", Новый Структура);
	//РезультатЗапроса = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ИнформацияОВерсии", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	//Если Отказ Тогда
	//	Возврат ТекущаяДата();
	//КонецЕсли;
	//Возврат РезультатЗапроса.ВнешнийИнтерфейс.ДатаВремяЗапроса;
	
КонецФункции

// Функция - СБИС информация о контрагенте
//
// Параметры:
//  Кэш					 - ЛокальнывйКэш	 - Структура параметров обработки
//  СтруктураКонтрагента - Сторона			 - СвФл/СвФЮл
//  ДопПараметры		 - Структура		 - Расширение
//  Отказ				 - Булево			 - Флаг ошибки
// 
// Возвращаемое значение:
//  Структура - результат метода СБИС.ИнформацияОКонтрагенте
//
&НаКлиенте
Функция СБИС_ИнформацияОКонтрагенте(Кэш, СтруктураКонтрагента, ДопПараметры, Отказ) Экспорт
	
	ПараметрыОтправки	= Новый Структура("Участник", СтруктураКонтрагента);
	СтруктураРезультата = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ИнформацияОКонтрагенте", ПараметрыОтправки, ДопПараметры, Отказ);
	Если Отказ Тогда
		
		Возврат Кэш.ОбщиеФункции.сбисИсключение(СтруктураРезультата, "API.СБИС_ИнформацияОКонтрагенте");
		
	КонецЕсли;
	
	Возврат СтруктураРезультата;
КонецФункции

&НаКлиенте
Функция СБИС_ПолучитьИнформациюОТекущемПользователе(Кэш, param, ДопПараметры, Отказ) Экспорт
	param.Вставить("ДопПоля", "Аккаунт,ИдПрофиля");
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ИнформацияОТекущемПользователе", Новый Структура("Параметр", param), ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  "API.СБИС_ПолучитьИнформациюОТекущемПользователе");
	КонецЕсли;
	Возврат Результат;
КонецФункции   

&НаКлиенте
Функция СБИС_ПолучитьСписокАккаунтов(Кэш, param, ДопПараметры, Отказ) Экспорт
	ДопПараметры.Вставить("АдресРесурса", "auth/service/?srv=1"); 
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "СБИС.СписокАккаунтов", param, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  "API.СБИС_ПолучитьСписокАккаунтов");
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СБИС_ПереключитьАккаунт(Кэш, param, ДопПараметры, Отказ) Экспорт
	ДопПараметры.Вставить("АдресРесурса", "auth/service/?srv=1");
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ПереключитьАккаунт", Новый Структура("Параметр", param), ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  "API.СБИС_ПереключитьАккаунт");
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СБИС_ПолучитьПараметрыПакетаДляОткрытияОнлайн(ОписаниеПакета, ДопПараметры) Экспорт
	Кэш = ДопПараметры.Кэш;
	Если	ОписаниеПакета.ИдАккаунта = "" Тогда
		Возврат Новый Структура("ИдДокумента, Тикет", ОписаниеПакета.ИдДокумента, "");
	Иначе
		ДанныеТикета = Кэш.СБИС.МодульОбъектаКлиент.СбисПолучитьТикетДляАккаунта(ОписаниеПакета);
		Возврат Новый Структура("ИдДокумента, Тикет, СтарыйИдСессии", ОписаниеПакета.ИдДокумента, ДанныеТикета.Тикет, ДанныеТикета.СтарыйИдСессии);
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция СБИС_СписокДокументов(Кэш, filter, ДопПараметры, Отказ) Экспорт

	СтруктураПараметровЗапроса = Новый Структура("Фильтр", filter);
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.СписокДокументов", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	Если Отказ Тогда
		Если Результат.code = 775 Тогда
			ТекстОшибки = "Не удалось получить список документов отгрузки.";
		Иначе
			ТекстОшибки = Результат.message +?(Результат.details = Результат.message, "", (" "+ Результат.details)); 
		КонецЕсли;
		Результат = Кэш.ОбщиеФункции.СбисИсключение(Результат, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_СписокДокументов", , ТекстОшибки);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СБИС_СписокДокументовПоСобытиям(Кэш, filter, ДопПараметры, Отказ) Экспорт

	СтруктураПараметровЗапроса = Новый Структура("Фильтр", filter);
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.СписокДокументовПоСобытиям", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	Если Отказ Тогда
		Результат = Кэш.ОбщиеФункции.СбисИсключение(Результат, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_СписокДокументовПоСобытиям");
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Интеграция_ФЭДМультиСгенерировать(ПараметрыДокумента, НаборПодстановок, ДопПараметры) Экспорт
	
	Попытка
		Кэш = ДопПараметры.Кэш;
		ДопПараметрыВызова = Новый Структура("СообщатьПриОшибке, ВернутьОшибку",  Ложь, Истина);
		
		Отказ = Ложь;
		ПараметрыВызова = Новый Структура;
		ПараметрыВызова.Вставить("Format",			ПараметрыДокумента);
		ПараметрыВызова.Вставить("SubstitutionList",НаборПодстановок);
		Результат = СбисОтправитьИОбработатьКоманду(ДопПараметры.Кэш, "Integration.FEDMultiGenerate", ПараметрыВызова, ДопПараметрыВызова, Отказ);
		
		Если Отказ Тогда
			МодульОбъектаКлиент().ВызватьСбисИсключение(Результат, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СбисОтправитьИОбработатьКомандуCallSabyApi2");
		КонецЕсли;
		
		Для Каждого файл Из Результат Цикл
			
			файл["Тело"] = МодульОбъектаКлиент().ПрочитатьЗначениеПоBase64Клиент(файл["Тело"]);
			
		КонецЦикла;
		
		Возврат Результат;
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнфоОбОшибке, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".Интеграция_ФЭДМультиСгенерировать");
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Функция СБИС_ЗаписатьВложение(Кэш, param, ДопПараметры, Отказ) Экспорт
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ЗаписатьВложение", Новый Структура("Документ", param), ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_ЗаписатьВложение");
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Функция - Вызов API3.InitConnection
//
// Параметры:
//  ПараметрыИнит		 - Структура	 - параметры в метод инита
//  ДопПараметрыВызова	 - Структура	 - расширение
// 
// Возвращаемое значение:
//  Структура/СбисИсключение - Результат API3.InitConnection, структура ошибки при отказе.
//
&НаКлиенте
Функция АПИ3_ИнитКоннекшен(ПараметрыИнит, ДопПараметрыВызова) Экспорт
	
	ДопПарметрыВызоваИнтеграции = Новый Структура("АдресРесурса, СообщатьПриОшибке, ВернутьОшибку", "/int-settings/service/", Ложь, Истина);
	
	Результат = СбисОтправитьИОбработатьКоманду(ДопПараметрыВызова.Кэш,
												"API3.InitConnection",
												ПараметрыИнит,
												ДопПарметрыВызоваИнтеграции,
												ДопПараметрыВызова.Отказ);
												
	Если ДопПараметрыВызова.Отказ Тогда
		
		ИмяВСтэк = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ИнтеграцияИмя") + ".АПИ3_ИнитКоннекшен";
		Возврат МодульОбъектаКлиент().НовыйСбисИсключение(Результат, ИмяВСтэк);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ФункционалВключен(Кэш, ИмяМетода, ДопПараметры = Неопределено, Отказ = Ложь) Экспорт
	ДопПараметры = Новый Структура; 
	Возврат СбисОтправитьИОбработатьКоманду(Кэш, "ExtSys.FeatureIsOn", Новый Структура("name", ИмяМетода), ДопПараметры, Отказ) = Истина;
КонецФункции

&НаКлиенте
Функция сбисОтправитьСообщениеОшибки(Кэш, СообщениеОбОшибке, Отказ) Экспорт
	сбисДополнительныеПараметрыОшибки = Новый Структура("АдресРесурса, СообщатьПриОшибке, ВернутьОшибку", "/int-settings/service/", Ложь, Истина);
	Возврат сбисОтправитьИОбработатьКоманду(Кэш, "IntegrationStat.RegisterErrors2", СообщениеОбОшибке, сбисДополнительныеПараметрыОшибки, Отказ);
КонецФункции

&НаКлиенте
Функция ExtSys_FeatureIsOn(ПараметрыФичи, ДопПараметрыВызова) Экспорт
	Если Не МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("Авторизован") Тогда
		//Если ещё не авторизовались, то за фичей не идём, считаем что неопределено.
		Возврат Неопределено;
	КонецЕсли;
	ДопПараметры = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь); 
	Возврат СбисОтправитьИОбработатьКоманду(ДопПараметрыВызова.Кэш, "ExtSys.FeatureIsOn", Новый Структура("name", ПараметрыФичи.НазваниеФичи), ДопПараметры, Ложь) = Истина;
КонецФункции

// Вызов функции MappingObject.List. Формирует список
// объектов синхронизируемых объектов определенного типа,
// с данными сопоставления и с расшифровкой естественных ключей
//
// Параметры:
//  Кэш  - Структура - Кэш обработки
//  ДопПоля  - Структура - Набор полей, которыми будут расширены
//					возвращаемые записи.
//	Фильтр	- Структура - Параметры фильтрации выборки.
//	Сортировка	- Структура - Параметры сортировки записей в выборке.
//	Навигация	-	 Структура - Параметры для навигации с типом
//					"постраничная", "бесконечный скролл"
//					или "по курсору".
//
// Возвращаемое значение:
//   Структура   - Результат вызова. Список объектов или ошибка
//
&НаКлиенте
Функция MappingObject_List(Кэш, ДопПоля, Фильтр, Навигация, Отказ = Ложь) Экспорт 

	ДопПараметрыВызова = Новый Структура("ЕстьРезультат,АдресРесурса,РежимКонвертации", Истина, "/int-settings/service/", "Стандарт"); 
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("ExtraFields",		ДопПоля);
	ПараметрыВызова.Вставить("Filter",		Фильтр);  
	ПараметрыВызова.Вставить("Pagination",	Навигация);
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "MappingObject.List", ПараметрыВызова, ДопПараметрыВызова, Отказ);
	Если Отказ Тогда
		Результат = Кэш.ОбщиеФункции.сбисИсключение(Результат, "MappingObject.List");
	КонецЕсли;
	Возврат Результат;

КонецФункции // MappingObject_List()

&НаКлиенте
Функция СБИС_ПолучитьСопоставлениеСторон(Кэш, ПараметрыДанныеУчастников, ДопПараметры=Неопределено, Отказ=Ложь) Экспорт
	ДопПараметры = Новый Структура;
	ПараметрыВызова = Новый Структура("data", ПараметрыДанныеУчастников);
	
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "ExtSysOrganization.MassFind", ПараметрыВызова, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_ПолучитьСопоставлениеСторон");
	КонецЕсли;
	Возврат Результат;
КонецФункции

#Область include_core2_vo2_СпособыОбмена_NativeAPI_ВнешниеОбертки_Госсистемы
#КонецОбласти

&НаКлиенте
Функция SearchNomenclatureCollation(Кэш, params, ДопПараметры, Отказ=Ложь) Экспорт 
	                                                                                                  
	Возврат СбисОтправитьИОбработатьКоманду(Кэш, "ContractorNomenclatureCollation.SearchByContractorData", params, ДопПараметры, Отказ);

КонецФункции  

// Функция управляет флагом документа ДокументРасширение.Изменен, 
// что позволяет вызывать перегенерацию документа при вызове метода СБИС.ПодготовитьДействие
//
// Параметры:
//  params			- Структура - Параметры метода.
//  ДопПараметры	- Структура - Набор полей, работа с которыми может расширить результат работы функции.
//  Отказ			- Булево	- Признак отказа.
//
// Возвращаемое значение:
//   Булево  - Результат вызова.
//
&НаКлиенте
Функция ExtSysDocument_Changed(params, ДопПараметры, Отказ = Ложь) Экспорт   
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();

	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	ПараметрыКоманды = Новый Структура();   
	ПараметрыКоманды.Вставить("docflow_id", params.ИдДок);    
	ПараметрыКоманды.Вставить("value", params.ФлагИзменен);
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysDocument.Changed", ПараметрыКоманды, ДопПараметрыВызова, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysDocument_Changed"); 
		
	КонецЕсли;  
	
	Возврат Результат;
	
КонецФункции

// Функция управляет флагом документа ДокументРасширение.Состояние.ЕстьРасхождения.
//
// Параметры:
//  params			- Структура - Параметры метода.
//  ДопПараметры	- Структура - Набор полей, работа с которыми может расширить результат работы функции.
//  Отказ			- Булево	- Признак отказа.
//
// Возвращаемое значение:
//   Булево  - Результат вызова.
//
&НаКлиенте
Функция ExtSysDocument_SetDevStatus(params, ДопПараметры, Отказ = Ложь) Экспорт   
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();

	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	ПараметрыКоманды = Новый Структура();   
	ПараметрыКоманды.Вставить("docflow_id", params.ИдДок);    
	ПараметрыКоманды.Вставить("status_val", params.ФлагРасхождения);
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysDocument.SetDevStatus", ПараметрыКоманды, ДопПараметрыВызова, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysDocument_SetDevStatus"); 
		
	КонецЕсли;  
	
	Возврат Результат;
	
КонецФункции

// Функция записывает сопоставление документов в маппинг
//
// Параметры:
//  params			- Структура - Параметры метода.
//  ДопПараметры	- Структура - Набор полей, работа с которыми может расширить результат работы функции.
//  Отказ			- Булево	- Признак отказа.
//
// Возвращаемое значение:
//   Структура  - Результат вызова.
//
&НаКлиенте
Функция ExtSysDocument_WriteMapping(params, ДопПараметры, Отказ = Ложь) Экспорт   
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();

	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysDocument.WriteMapping", params, ДопПараметрыВызова, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysDocument_WriteMapping"); 
		
	КонецЕсли;  
	
	Возврат Результат;
	
КонецФункции

// Функция - Вызов метода БЛ ExSysNom.CustomDocNomUpdate
//
// Параметры:
//  params		 - Структура - Параметры метода БЛ
//  ДопПараметры - Структура, Неопределено - Доп. параметры вызова
//  Отказ		 - Булево - Признак ошибки вызова метода
// 
// Возвращаемое значение:
//  Структура - Ответ БЛ
//
&НаКлиенте
Функция ExtSysNom_CustomDocNomUpdate(Кэш, ВходящийПараметрМетода,  ДопПараметры, Отказ = Ложь) Экспорт
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysNom.CustomDocNomUpdate", ВходящийПараметрМетода, ДопПараметры, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysNom.CustomDocNomUpdate"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

// Функция - Вызов метода БЛ ExtSysNom.MoveToPack
//
// Параметры:
//  params		 - Структура - Параметры метода БЛ
//  ДопПараметры - Структура, Неопределено - Доп. параметры вызова
//  Отказ		 - Булево - Признак ошибки вызова метода
// 
// Возвращаемое значение:
//  Структура - Ответ БЛ
//
&НаКлиенте
Функция ExtSysNom_MoveToPack(Кэш, ВходящийПараметрМетода,  ДопПараметры, Отказ = Ложь) Экспорт
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysNom.MoveToPack", ВходящийПараметрМетода, ДопПараметры, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysNom.MoveToPack"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

// Функция - Вызов метода БЛ ExtSysNom.UnPack
//
// Параметры:
//  params		 - Структура - Параметры метода БЛ
//  ДопПараметры - Структура, Неопределено - Доп. параметры вызова
//  Отказ		 - Булево - Признак ошибки вызова метода
// 
// Возвращаемое значение:
//  Структура - Ответ БЛ
//
&НаКлиенте
Функция ExtSysNom_UnPack(Кэш, ВходящийПараметрМетода,  ДопПараметры, Отказ = Ложь) Экспорт
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysNom.UnPack", ВходящийПараметрМетода, ДопПараметры, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysNom.UnPack"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

// Функция - Вызов метода БЛ ExtSysNom.DeleteDnBatchAndRecalcQty
//
// Параметры:
//  params		 - Структура - Параметры метода БЛ
//  ДопПараметры - Структура, Неопределено - Доп. параметры вызова
//  Отказ		 - Булево - Признак ошибки вызова метода
// 
// Возвращаемое значение:
//  Структура - Ответ БЛ
//
&НаКлиенте
Функция ExtSysNom_DeleteDnBatchAndRecalcQty(Кэш, ВходящийПараметрМетода,  ДопПараметры, Отказ = Ложь) Экспорт
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysNom.DeleteDnBatchAndRecalcQty", ВходящийПараметрМетода, ДопПараметры, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysNom.DeleteDnBatchAndRecalcQty"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

// Функция - Вызов метода БЛ ExtSysNom.CustomCreate
//
// Параметры:
//  params		 - Структура - Параметры метода БЛ
//  ДопПараметры - Структура, Неопределено - Доп. параметры вызова
//  Отказ		 - Булево - Признак ошибки вызова метода
// 
// Возвращаемое значение:
//  Структура - Ответ БЛ
//
&НаКлиенте
Функция ExtSysNom_CustomCreate(Кэш, ВходящийПараметрМетода,  ДопПараметры, Отказ = Ложь) Экспорт
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysNom.CustomCreate", ВходящийПараметрМетода, ДопПараметры, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysNom.CustomCreate"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

// Функция - Вызов метода БЛ ExtSysNom.GetGln
//
// Параметры:
//  params		 - Структура - Параметры метода БЛ
//  ДопПараметры - Структура, Неопределено - Доп. параметры вызова
//  Отказ		 - Булево - Признак ошибки вызова метода
// 
// Возвращаемое значение:
//  Структура - Ответ БЛ
//
&НаКлиенте
Функция ExtSysNom_GetGln(Кэш, ВходящийПараметрМетода,  ДопПараметры, Отказ = Ложь) Экспорт
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysNom.GetGln", ВходящийПараметрМетода, ДопПараметры, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysNom.GetGln"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

// Функция - Вызов метода БЛ ExtSysNom.GeneratePackage
//
// Параметры:
//  params		 - Структура - Параметры метода БЛ
//  ДопПараметры - Структура, Неопределено - Доп. параметры вызова
//  Отказ		 - Булево - Признак ошибки вызова метода
// 
// Возвращаемое значение:
//  Структура - Ответ БЛ
//
&НаКлиенте
Функция ExtSysNom_GeneratePackage(Кэш, ВходящийПараметрМетода,  ДопПараметры, Отказ = Ложь) Экспорт
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysNom.GeneratePackage", ВходящийПараметрМетода, ДопПараметры, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysNom.GeneratePackage"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

// Функция - Вызов метода БЛ ExtSysNom.GeneratePack
//
// Параметры:
//  params		 - Структура - Параметры метода БЛ
//  ДопПараметры - Структура, Неопределено - Доп. параметры вызова
//  Отказ		 - Булево - Признак ошибки вызова метода
// 
// Возвращаемое значение:
//  Структура - Ответ БЛ
//
&НаКлиенте
Функция ExtSysNom_GeneratePack(Кэш, ВходящийПараметрМетода,  ДопПараметры, Отказ = Ложь) Экспорт
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysNom.GeneratePack", ВходящийПараметрМетода, ДопПараметры, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysNom.GeneratePack"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

#Область include_core2_vo2_СпособыОбмена_NativeAPI_ВнешниеОбертки_РаботаСЗаказами
#КонецОбласти

#Область include_core2_vo2_СпособыОбмена_NativeAPI_ВнешниеОбертки_ПрикладнаяСтатистика
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_КлиентСервер_Транспорт_NativeAPI //&НаКлиенте
#КонецОбласти

