
// Функция - расшифровывает указанный файл
//
// Параметры:
//  Кэш			 - ЛокальныйКэш	 - экземпляр кэш
//  ФайлЗначение - Структура	 - с полем Ссылка, ДвоичныеДанные(Н)
// 
// Возвращаемое значение:
//  Строка - расшифрованные данные, если успешно
//
&НаКлиенте
Функция РасшифроватьФайлВложения(Кэш, ФайлВложения) Экспорт
    	
	ОшибкаРасшифровки = МодульОбъектаКлиент().НовыйСбисИсключение(	, 
																	"API3.РасшифроватьФайлВложения",
																	735,
																	,
																	"На способе обмена API отсутствует возможность работы с зашифрованными документами.",
																	,
																	"https://sbis.ru/help/integration/1C_set/modul/exchange");
	ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Представление(ОшибкаРасшифровки);
	
КонецФункции

// Функция - получает данные XML вложения
//
// Параметры:
//  ФайлВложения - Структура	 - с полем СсылкаНаФайл
//	ДопПараметры - Структура	 - возможность расширения
// 
// Возвращаемое значение:
//  Строка - расшифрованные данные, если успешно
//
&НаКлиенте
Функция ПрочитатьФайлВложения(ФайлВложения, ДопПараметры = Неопределено) Экспорт 
   	
	Возврат ПолучитьДанныеФайла(МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш(), ФайлВложения.Ссылка);
	
КонецФункции

