
// Авторизуется по логину/паролю	
&НаКлиенте
Функция АвторизоватьсяПоЛогинуПаролю(Кэш,Логин,Пароль,Отказ=Ложь) Экспорт 	

	Если Не ЗначениеЗаполнено(Логин) Тогда
	
		ОшибкаАвторизации = МодульОбъектаКлиент().НовыйСбисИсключение(785, "SabyHtppsClient.АвторизоватьсяПоЛогинуПаролю",,"Не указаны логин/пароль для авторизации");
		Отказ = Истина;
		Возврат ОшибкаАвторизации;
		
	КонецЕсли;

	МестныйКэш	= Кэш;
	КэшПарам = Новый Структура("ПолнаяВерсияПродукта,ТипПрокси,ПроксиСервер,ПроксиПорт,ПроксиЛогин,ПроксиПароль,UserAgent");
	ЗаполнитьЗначенияСвойств(КэшПарам, Кэш.Парам);//Отправляем только те параметры, что нужны для вызова команды, чтобы не перегружать вызов сервера.
	КэшПарам.Вставить("АдресСервера",Кэш.СБИС.АдресСервера);
	КэшПарам.Вставить("СовместимостьМетодов",Кэш.СовместимостьМетодов);
	
	ДопПараметры = Новый Структура("СообщатьПриОшибке, ЕстьРезультат, ИдСессии, АдресРесурса");
	ДопПараметры.СообщатьПриОшибке	= Ложь;
	ДопПараметры.ЕстьРезультат		= Истина;
	ДопПараметры.ИдСессии			= "";
	ДопПараметры.АдресРесурса		= "/auth/service/";
	
	ИмяМетода	= "СБИС.Аутентифицировать";
	СтруктураПараметровЗапроса = Новый Структура("Логин, Пароль", Логин, Пароль);

	ПараметрыРезультат = Новый Структура("Метод, Параметры, ДополнительныеПараметры", ИмяМетода, СтруктураПараметровЗапроса, ДопПараметры);
	ПараметрыРезультат.Вставить("Результат", сбисОтправитьИОбработатьКоманду(Кэш, ИмяМетода, СтруктураПараметровЗапроса, ДопПараметры, Отказ));
	
	Возврат МодульОбъектаКлиент().ОценитьРезультатАвторизации(ПараметрыРезультат, Отказ);
	
КонецФункции

// Функция - получает данные XML вложения
//
// Параметры:
//  ФайлВложения - Структура	 - с полем СсылкаНаФайл
//	ДопПараметры - Структура	 - возможность расширения
// 
// Возвращаемое значение:
//  Строка - расшифрованные данные, если успешно
//
&НаКлиенте
Функция ПрочитатьФайлВложения(ФайлВложения, ДопПараметры = Неопределено) Экспорт 
   	
	Возврат ПолучитьДанныеФайла(МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш(), ФайлВложения.Ссылка);
	
КонецФункции

// Читать HTML нужно от типа "ВложениеСБИС" - ВложениеСБИС_Получить с ключом "ВизуализацияДокумента"

&НаКлиенте
Функция ПолучитьHTMLПоXML(Кэш, Вложение) экспорт
	Перем СбисКодировка;
	// Получает html по xml	
	// Используется при просмотре документов из реестров продаж (1С)
	Отказ = Ложь;
	ДопПараметры = Новый Структура("ЕстьРезультат", Истина);
	МестныйКэш = Кэш;
	
	param = Новый Структура; 
	Если ТипЗнч(Вложение) = Тип("Структура") Тогда
		param.Вставить("XML", Вложение.XMLДокумента);
	Иначе   // для совместимости с внешними Функциями (СформироватьРасхождение)
		param.Вставить("XML", Вложение);
	КонецЕсли;
	
	html_text = СБИС_СформироватьHTMLИзXML(Кэш, param,, Отказ);

	Если Отказ Тогда 
		Кэш.ГлавноеОкно.СбисСообщитьОбОшибке(Кэш, html_text);
		Возврат Ложь;
	КонецЕсли;
	Возврат html_text;
КонецФункции

