
&НаКлиенте
Функция API_ОтправитьИОбработатьКоманду_Переадресация(Кэш, Метод, ПараметрыМетода, ДопПараметры, Отказ) Экспорт
	
	РежимОтладки	= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("РежимОтладки");
	ДанныеВЛог		= Новый Массив;
	ИДЗапроса		= Новый УникальныйИдентификатор;

	Если РежимОтладки Тогда
		
		лОтладочныеДанные = Новый Структура("Тип, Модуль, Вызов, Время, Идентификатор, Сообщение", "CALL", МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя"));
		лОтладочныеДанные.Модуль		= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		лОтладочныеДанные.Вызов			= Метод;
		Если	Не ДопПараметры.Свойство("ОчиститьПараметры")
			Или	Не ДопПараметры.ОчиститьПараметры Тогда
			
			лОтладочныеДанные.Сообщение = ПараметрыМетода;
			
		КонецЕсли;
		лОтладочныеДанные.Идентификатор	= ИДЗапроса;
		лОтладочныеДанные.Время			= ТекущаяДата();
		ДанныеВЛог.Добавить(лОтладочныеДанные);
		
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		
		РезультатОтвет = API_ОтправитьИОбработатьКоманду_ВызовСервера(КэшДляЗапросаНаСервере(Кэш), Метод, ПараметрыМетода, ДопПараметры, Отказ);
		
	#ИначеЕсли ТолстыйКлиентОбычноеПриложение Тогда
		
		РезультатОтвет = API_ОтправитьИОбработатьКоманду(Кэш, Метод, ПараметрыМетода, ДопПараметры, Отказ);
		
	#Иначе
		
		Если Кэш.Парам.ИнтеграцияAPIВызовыНаКлиенте Тогда
			
			РезультатОтвет = API_ОтправитьИОбработатьКоманду(Кэш, Метод, ПараметрыМетода, ДопПараметры, Отказ);
			
		Иначе
			
			РезультатОтвет = API_ОтправитьИОбработатьКоманду_ВызовСервера(КэшДляЗапросаНаСервере(Кэш), Метод, ПараметрыМетода, ДопПараметры, Отказ);
			
		КонецЕсли;
		
	#КонецЕсли
	
	ОтложенноеДействие = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ГлобальныйКэш_ЧтениеОтветовИВызовСобытий", МодульОбъектаКлиент());
	МодульОбъектаКлиент().ПодключитьОтложенноеДействие(ОтложенноеДействие);
	
	Если Отказ Тогда
		
		Если	РезультатОтвет.code		= 304
			И	РезультатОтвет.extCode	= 103 Тогда
			
			// Сгенерировать событие о потере авторизации
			АсинхронноеСбисСобытие = МодульОбъектаКлиент().НовыйАсинхронноеСбисСобытие("UnAuthorized", РезультатОтвет, "Event");
			МодульОбъектаКлиент().ГлобальныйКэш_ДобавитьСобытие(АсинхронноеСбисСобытие);
			// Перегенерировать ответ в понятное сообщение.
			РезультатОтвет = МодульОбъектаКлиент().НовыйСбисИсключение(РезультатОтвет, "API.ОтправитьИОбработатьКоманду.Переадресация",,,"Сессия была завершена.");
			
		КонецЕсли;
		
		Если РежимОтладки Тогда
			лОтладочныеДанные = Новый Структура("Тип, Модуль, Вызов, Время, Идентификатор, Сообщение", "ERROR");
			лОтладочныеДанные.Модуль		= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
			лОтладочныеДанные.Вызов			= Метод;
			лОтладочныеДанные.Сообщение		= РезультатОтвет;
			лОтладочныеДанные.Идентификатор	= ИДЗапроса;
			лОтладочныеДанные.Время			= ТекущаяДата();
			ДанныеВЛог.Добавить(лОтладочныеДанные);
			
			МодульОбъектаКлиент().СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ДанныеВЛог));
		КонецЕсли;
				
		//Приведено в соотсвтетствие с способом обмена ExtSdk
		Если	ДопПараметры.Свойство("СообщатьПриОшибке")
			И	ДопПараметры.СообщатьПриОшибке Тогда
			Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, РезультатОтвет);
		КонецЕсли;
		//Для интеграции через АПИ ошибка возвращается почти всегда
		Если Не	ДопПараметры.Свойство("ВернутьОшибку")
			Или	ДопПараметры.ВернутьОшибку Тогда
			
			Возврат РезультатОтвет;
			
		КонецЕсли;
		
		Возврат Неопределено;
		
	ИначеЕсли РежимОтладки Тогда
		
		лОтладочныеДанные = Новый Структура("Тип, Модуль, Вызов, Время, Идентификатор, Сообщение", "MESSAGE");
		лОтладочныеДанные.Модуль		= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		лОтладочныеДанные.Вызов			= Метод;
		Если	Не ДопПараметры.Свойство("ОчиститьПараметры")
			Или	Не ДопПараметры.ОчиститьПараметры Тогда
			
			лОтладочныеДанные.Сообщение = РезультатОтвет;
			
		Иначе
			
			лОтладочныеДанные.Сообщение = "Успешно";
			
		КонецЕсли;
		лОтладочныеДанные.Идентификатор	= ИДЗапроса;
		лОтладочныеДанные.Время			= ТекущаяДата();
		ДанныеВЛог.Добавить(лОтладочныеДанные);
		
		МодульОбъектаКлиент().СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ДанныеВЛог));
		
	КонецЕсли;
	
	Возврат РезультатОтвет;	
	
КонецФункции

&НаСервере
Функция API_ОтправитьИОбработатьКоманду_ВызовСервера(Знач Кэш, Знач Метод, Знач ПараметрыМетода, Знач ДопПараметры, Отказ) Экспорт
	
	Результат = МодульОбъектаСервер().API_ОтправитьИОбработатьКоманду(Кэш, Метод, ПараметрыМетода, ДопПараметры, Отказ);
	
	Если Отказ Тогда
		
		Возврат МодульОбъектаСервер().НовыйСбисИсключение(Результат, "API.ОтправитьИОбработатьКоманду.ВызовСервера");
		
	ИначеЕсли	Метод = "Get"
			И	Не Результат.Свойство("Данные") Тогда
		
		Результат.Вставить("ВременноеХранилище", ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Результат.Путь)));
		
	КонецЕсли;
	
    Возврат Результат;

КонецФункции

#Область include_core2_vo2_МодульОбъекта_Клиент_Транспорт_API_Подписки
#КонецОбласти

