
&НаКлиенте
Процедура ПодготовитьДокументСбис(МассивПакетов,ДопПараметры) Экспорт
	
	ПолныйСоставПакета = МассивПакетов;
	фрм = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ДополнительныеПараметрыДокумента", "ДокументСбис_" + ПолныйСоставПакета.Тип);
	Если Фрм <> Ложь Тогда
	
		 фрм.ДополнительныеПараметрыДокумента(ПолныйСоставПакета);
	
	КонецЕсли;
	сч = 0;
	// 4Sych
	Если ПолныйСоставПакета.Вложение.Количество() Тогда
		
		МодульОбъектаКлиент().ВложениеСБИС_Получить(ПолныйСоставПакета.Вложение[0], "ВизуализацияДокумента", Новый ФиксированнаяСтруктура("СоставПакета", ПолныйСоставПакета));

		Для Каждого Элемент Из ПолныйСоставПакета.Вложение Цикл

			Если ПолныйСоставПакета.Свойство("Событие") Тогда
				Элемент.Вставить("Событие", ПолныйСоставПакета.Событие);
			КонецЕсли;

			ПолныйСоставПакета.Вложение[сч].Вставить("Отмечен", Истина);
			сч = сч + 1;

		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
    
