
// ПЕРЕНЕСТИ в класс влоложения!
// Процедура - патчит дату, время, имя файла
//
// Параметры:
//  ФайлПропатчить		- Структура	- Вложение.СтруктураДокумента.Файл формируемого вложения
//  ВходящийКонтекст	- Структура
//		ФайлДанные		- Структура, грязный ини
//		ПолучательРоль	- Строка, роль получателя для поиска ИД
//		ОтправительРоль - Строка, роль отправителя для поиска ИД
//
&НаКлиенте
Процедура ПропатчитьФайлВложенияСБИС(ВложениеСБИС, ДопПараметры) Экспорт

	МодульФункций = ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	
	ИмяФормыПоФормату = "Файл_"
			+ МодульФункций.сбисЗаменитьНедопустимыеСимволы(ДопПараметры.ГрязныйИни.Файл_Формат)
			+ "_"
			+ МодульФункций.сбисЗаменитьНедопустимыеСимволы(ДопПараметры.ГрязныйИни.Файл_ВерсияФормата);
	
	ФайлПропатчить		= ВложениеСБИС.СтруктураДокумента.Файл;
	ДатаВремяСоздания	= ТекущаяДата();
	лДанныеСторон		= ДопПараметры.ДанныеСторон;
	МодульИмениФайла	= НайтиФункциюСеансаОбработки("ПропатчитьИмяФайлаВложения", ИмяФормыПоФормату);
	
	Если НЕ МодульИмениФайла = Ложь Тогда
		
		МодульИмениФайла.ПропатчитьИмяФайлаВложения(ВложениеСБИС, ДопПараметры);
		
	Иначе   
		
		ПропатчитьИмяФайлаВложения(ВложениеСБИС, ДопПараметры);
		
	КонецЕсли;
	
	ФайлПерегенерируется = ИспользоватьГенераторДляВложения(ВложениеСБИС);
	//Патчим параметры для генератора или если есть XSLT, т.е. если документ ещё перегенерируется в процессе
	//В остальных случаях, документ грузится как есть и могут быть ошибки формата
	Если Не ФайлПерегенерируется Тогда
		ИмяXSLTВыгрузки		= ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.сбисИмяXSLTДляВложения(ГлавноеОкно.Кэш, ФайлПропатчить, ВложениеСБИС);
		ФайлПерегенерируется= ЗначениеЗаполнено(XSLTПоПараметрам(ИмяXSLTВыгрузки));
	КонецЕсли;
	Если ФайлПерегенерируется Тогда
		//Дополнить отсутствующие параметры
		Если Не ФайлПропатчить.Свойство("Дата") Тогда
			ФайлПропатчить.Вставить("Дата",	Формат(ДатаВремяСоздания, "ДФ=dd.MM.yyyy"));
			ФайлПропатчить.Вставить("Время",Формат(ДатаВремяСоздания, "ДФ=HH.mm.ss"));
		КонецЕсли;
		
		//Для ИнОрг поместисть данные стороны в спец. узел, откуда они будут прокинуты в требуемые поля документа.
		//Для отправки, функция разложит данные стороны обратно, чтобы ЗаписатьДокумент правильно поставил сторону. 
		
		ПолучательИО = ПрочитатьДополнительныйПараметрСтороны(лДанныеСторон[ДопПараметры.ПолучательРоль], "ИностраннаяОрганизация") = Истина;  
		
		Если ПолучательИО Тогда  
			
			//СтруктураИНО = Новый Структура("Идентиф, Название", );
			лДанныеСтороны = лДанныеСторон[ДопПараметры.ПолучательРоль].СвЮЛ;
			лДанныеСтороны.Вставить("Идентиф", лДанныеСтороны.ИНН);
			лДанныеСтороны.Удалить("ИНН");
			лДанныеСторон[ДопПараметры.ПолучательРоль].Вставить("СвИН", лДанныеСтороны);
			лДанныеСторон[ДопПараметры.ПолучательРоль].Удалить("СвЮЛ");                                                          

		КонецЕсли; 
		
	Иначе
				
		МодульФормата = НайтиФункциюСеансаОбработки("ПропатчитьСтруктуруВложения", ИмяФормыПоФормату);

		Если МодульФормата <> Ложь Тогда
			МодульФормата.ПропатчитьСтруктуруВложения(ВложениеСБИС, ДопПараметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры   

// Процедура - патчит имя файла вложения
//
// Параметры:
//  ВложениеСБИС	- Структура	- Структура формируемого вложения
//  ДопПараметры	- Структура - Структура дополнительных параметров
//
&НаКлиенте
Процедура ПропатчитьИмяФайлаВложения(ВложениеСБИС, ДопПараметры) 
	
	Перем ПолучательИд, ОтправительИд, ФайлИмяПропатчить, лДанныеСторон;
	
	СтруктураФайла      = ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
	ФайлПропатчить		= ВложениеСБИС_Получить(СтруктураФайла, "Файл");

	ДатаВремяСоздания	= ТекущаяДата();   
	
	лДанныеСторон = ДопПараметры.ДанныеСторон;
		
	Если ФайлПропатчить.Свойство("Имя", ФайлИмяПропатчить) Тогда
		Если	ДопПараметры.ГрязныйИни.Свойство("мСторона") 
			И	лДанныеСторон[ДопПараметры.ПолучательРоль].Свойство("Идентификатор",	ПолучательИД) 
			И	лДанныеСторон[ДопПараметры.ОтправительРоль].Свойство("Идентификатор",	ОтправительИД) Тогда
			ФайлИмяПропатчить = ФайлИмяПропатчить + ПолучательИД + "_" + ОтправительИД;
		Иначе
			ФайлИмяПропатчить = ФайлИмяПропатчить + "_";
		КонецЕсли;
		ФайлПропатчить.Имя = ФайлИмяПропатчить + "_" + Формат(ДатаВремяСоздания, "ДФ=ггггММдд") + "_" + Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	
КонецПроцедуры  

// Процедура - Пропатчить ид файла для имени файла
//
// Параметры:
//  СтруктураИдФайла - Структура - структура ИД файла передаточного документа
//  СтруктураФайла	 - Структура - Вложение.СтруктураДокумента.Файл формируемого вложения
//		N2 - Прослеживаемость. Заполняется в N2 значение "1". По умолчанию значение "0".
//		N3 - Маркировка. Заполняется в N3 значение "1". По умолчанию значение "0".
//		N4 - Если у номенклатуры вид продукции (Пиво, напитки, изготавливаемые на основе пива, слабоалкогольные напитки), заполняется в N4 значение "1". 
//		По умолчанию значение "0". 
//		N5 - Если у номенклатуры один из видов продукции ИСМП тогда в N5 значение "1". По умолчанию значение "0". 
//
&НаКлиенте
Процедура ПропатчитьИдФайлаДляИмениФайла(СтруктураИдФайла, СтруктураФайла) Экспорт 
	
	ПутьТаблДок = "Документ.ТаблДок.СтрТабл";     
	
	ПутьКМаркируемомуТовару		= "НомСредИдентТов";
	ПутьКПрослеживаемомуТовару	= "СведПрослеж";
	
	ТаблДок = ПолучитьДанныеПоПути(Новый Структура("Путь, Данные", ПутьТаблДок, СтруктураФайла));     
	
	Для Каждого СтрТабл Из ТаблДок Цикл  
		
		НаличиеМаркированногоТовара		= ЗначениеЗаполнено(ПолучитьДанныеПоПути(Новый Структура("Путь, Данные", ПутьКМаркируемомуТовару, СтрТабл)));
		НаличиеПрослеживаемогоТовара	= ЗначениеЗаполнено(ПолучитьДанныеПоПути(Новый Структура("Путь, Данные", ПутьКПрослеживаемомуТовару, СтрТабл)));
		
		// Прервать цикл нельзя, теперь, в 5.02, может быть как прослеживаемый так и маркируемый товар
		
		Если НаличиеМаркированногоТовара Тогда
			СтруктураИдФайла.N3 = "1";
		КонецЕсли;      
		
		Если НаличиеПрослеживаемогоТовара Тогда
			СтруктураИдФайла.N2 = "1";
		КонецЕсли;
	
	КонецЦикла; 
			
КонецПроцедуры

// Функция - формирует структуру ИД файла передаточного документа
// 
// Возвращаемое значение:
// 	Структура - структура параметров 
//		N2 - Прослеживаемость
//		N3 - Маркировка
//		N4 - Пиво и напитки, изготавливаемые на основе пива, слабоалкогольные напитки 
//		N5 - Один из видов продукции ИСМП 
//
&НаКлиенте
Функция СтруктураИдФайлаПередаточногоДокумента() Экспорт
	
	СтруктураИдентификаторов = Новый Структура;
	
	СтруктураИдентификаторов.Вставить("N2", "0");  
	СтруктураИдентификаторов.Вставить("N3", "0");
    СтруктураИдентификаторов.Вставить("N4", "0"); 
	СтруктураИдентификаторов.Вставить("N5", "0");  
	
	Возврат СтруктураИдентификаторов; 
	
КонецФункции

//Функция возвращает ключ стороны для получения доп. параметров в кэше
&НаКлиенте
Функция	 КлючСтороныДляДопПараметров(мСторона)
	
	Перем СвФлЮл; 
	
	КлючИдентификатора = МодульОбъектаКлиент().Сторона_Получить(мСторона, "КлючИдентификатора");
	
	Если		мСторона.Свойство("СвЮЛ", СвФлЮл) Тогда   
		
		Идентификатор = МодульОбъектаКлиент().ПрименитьФорматКСтроке(СвФлЮл[КлючИдентификатора], "ЧГ=0", "Формат");
		Результат = Идентификатор + ?(СвФлЮл.Свойство("КПП"), "_" + СвФлЮл.КПП, "") + "_" + Сторона_Получить(мСторона, "Название");   
		
	ИначеЕсли   мСторона.Свойство("СвФЛ", СвФлЮл) Тогда 

		Идентификатор = МодульОбъектаКлиент().ПрименитьФорматКСтроке(СвФлЮл[КлючИдентификатора], "ЧГ=0", "Формат");
		Результат = Идентификатор + "_" + Сторона_Получить(мСторона, "Название"); ;   
		
	ИначеЕсли   мСторона.Свойство("СвИП", СвФлЮл) Тогда 
		
		Идентификатор = МодульОбъектаКлиент().ПрименитьФорматКСтроке(СвФлЮл[КлючИдентификатора], "ЧГ=0", "Формат");
		Результат = Идентификатор + "_" + Сторона_Получить(мСторона, "Название");  
		
	ИначеЕсли   мСторона.Свойство("СвИн", СвФлЮл) Тогда
		
		Идентификатор = МодульОбъектаКлиент().ПрименитьФорматКСтроке(СвФлЮл[КлючИдентификатора], "ЧГ=0", "Формат");
		Результат = Идентификатор + "_" + Сторона_Получить(мСторона, "Название"); 
		
	Иначе 
		
		Возврат мСторона.Название; 
		
	КонецЕсли;

	Если СвФлЮл.Свойство("КодФилиала") Тогда 
		
		Результат = Результат + "_" + СвФлЮл.КодФилиала; 
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

// Процедура - Сохраняет посчитанные дополнительные параметры стороны
//
// Параметры:
//  ДанныеУчастник		 - Структура	 - содержит СвЮл/СвФЛ
//  ДопПараметрыСтороны	 - Соответствие	 - данные, которые надо сохранить
//
&НаКлиенте
Процедура СохранитьДополнительныеПараметрыСтороны(ДанныеУчастник, ДопПараметрыСтороны) Экспорт
	Если Не ДопПараметрыСтороны.Количество() Тогда
		Возврат;
	КонецЕсли;                                      
	
	КлючДляПараметров = КлючСтороныДляДопПараметров(ДанныеУчастник);     
	РассчитаннаяСторона = ГлобальныйКэш.ТекущийСеанс.РасчитанныеЗначения.мСторона;
	Если РассчитаннаяСторона.Получить(КлючДляПараметров) = Неопределено Тогда
		ГлобальныйКэш.ТекущийСеанс.РасчитанныеЗначения.мСторона.Вставить(КлючДляПараметров, ДопПараметрыСтороны);
	Иначе
		РассчитаннаяСторона = РассчитаннаяСторона.Получить(КлючДляПараметров);
		Если РассчитаннаяСторона <> Неопределено Тогда
			Для Каждого Параметр Из ДопПараметрыСтороны Цикл
				Если РассчитаннаяСторона.Получить(Параметр.Ключ) = Неопределено Тогда
					РассчитаннаяСторона.Вставить(Параметр.Ключ, Параметр.Значение);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Сохраняет посчитанные дополнительные параметры стороны
//
// Параметры:
//  ДанныеУчастник		 - Структура	 - содержит СвЮл/СвФЛ
//  ДопПараметрыСтороны	 - Соответствие	 - данные, которые надо сохранить
//
&НаКлиенте
Функция ПрочитатьДополнительныйПараметрСтороны(ДанныеУчастник, КлючПараметры=Неопределено)  Экспорт
    Перем Результат;
	
	КлючДляДопПараметров = КлючСтороныДляДопПараметров(ДанныеУчастник);
	Если	Не ГлобальныйКэш.ТекущийСеанс.РасчитанныеЗначения.Свойство("мСторона", Результат) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Результат = Результат.Получить(КлючДляДопПараметров);
	Если Результат = Неопределено Тогда 
		Возврат Неопределено
	КонецЕсли;
	
	Если КлючПараметры = Неопределено Тогда 
		Возврат Результат;
	КонецЕсли;
	Возврат Результат.Получить(КлючПараметры);
	
КонецФункции

// Функция возвращает описание идентификатора СБИС по ссылке 1С
//
// Параметры:
//  ДокументСсылка	 - Ссылка на документ 1С - Ссылка, на документ 1С, по которому требуется извлечь сведения о пакете
//  ДопПараметры	 - Структура			 - 
//		ИмяРегламента 		- Строка			- имя регламента, для доп. разреза хранения статусов, если есть
//		СтруктураРаздела	- СтруктураРазделаГО- структура раздела обработки, для авто. определения регламента.
// Возвращаемое значение:
//  Структура - ИдДокумента, ИдАккаунта
//
&НаКлиенте
Функция ПрочитатьСведенияОИдСБИСПоДокументу1С(ДокументСсылка, ДопПараметры=Неопределено) Экспорт
	Перем СтруктураРазделаГО, ИмяРегламентаДокумента;
	
	МассивСтатусРегламент	= ПолучитьЗначениеПараметраСбис("МассивСтатусРегламент");
	СтатусРегламент			= "";
	
	Если Не ДопПараметры = Неопределено Тогда
		ДопПараметры.Свойство("ИмяРегламента",		ИмяРегламентаДокумента);
		ДопПараметры.Свойство("СтруктураРаздела",	СтруктураРазделаГО);
	КонецЕсли;
	Если		ЗначениеЗаполнено(МассивСтатусРегламент)
		И		ПолучитьЗначениеПараметраСбис("СтатусыВРазрезеРегламента") Тогда
		
		Если		ЗначениеЗаполнено(ИмяРегламентаДокумента) Тогда
			Если НЕ	МассивСтатусРегламент.Найти(ИмяРегламентаДокумента) = Неопределено Тогда
				СтатусРегламент = ИмяРегламентаДокумента;
			КонецЕсли;
		ИначеЕсли	ЗначениеЗаполнено(СтруктураРазделаГО) Тогда
			//Взять от раздела
			ИниРеестра = ИниПоПараметрам(СтруктураРазделаГО.ТипДок).мФайл;
			//первый ини
			Для Каждого Файл из ИниРеестра Цикл
				РегламентНазвание = ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.РассчитатьЗначение("Регламент_Название", Файл.Значение);
				Если НЕ МассивСтатусРегламент.Найти(РегламентНазвание) = Неопределено Тогда 
					СтатусРегламент = РегламентНазвание;
				КонецЕсли;
				Прервать;
			КонецЦикла;
		Иначе
			//Регламента нет
		КонецЕсли;
		
    КонецЕсли;
	
	ПараметрыПрочитатьСвойство = Новый Структура("ДокументСсылка, Регламент", ДокументСсылка, СтатусРегламент);
	
	фрм = ГлавноеОкно.СбисНайтиФормуФункции("СбисПрочитатьСведенияОПакете", ПолучитьЗначениеПараметраСбис("ИмяМодуляРаботыСоСтатусами"));
	Возврат фрм.СбисПрочитатьСведенияОПакете(ПараметрыПрочитатьСвойство, ГлавноеОкно.Кэш);

КонецФункции

// Функция - читает стороны по данным 1С
//
// Параметры:
//  ДанныеПрочитатьВходящие	 - Массив	 - Организации, Контрагенты по которым нужно получить данные
//  ДопПараметры			 - Структура - возможность расширить
// 
// Возвращаемое значение:
//  Соответствие - Ключ - ссылка на справочник, Значение - структура Ошибка/Результат(посчитанная сторона)
//
&НаКлиенте
Функция ПрочитатьСтороныПоДанным1С(ДанныеПрочитатьВходящие, ДопПараметры=Неопределено) Экспорт 
	Перем УзелИниВСоответствие;
	
	ИниКонфигурации = ИниПоПараметрам("Конфигурация");
	МодульФункций	= ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов;
	СоответствиеИни			= Новый Соответствие;
	СоответствиеПрочитать	= Новый Соответствие;
	СоответствиеРезультат	= Новый Соответствие;
	СоответствиеТипов		= Новый Соответствие;
	СоставПакета			= Новый СписокЗначений;
	// Распарсим файл ини.мСторона
	Если ИниКонфигурации.Свойство("мСторона") Тогда
		Для Каждого КлючИЗначение Из ИниКонфигурации.мСторона Цикл      
			СсылкаНаЭлемент = ПолучитьТипМетаданных(КлючИЗначение.Значение, "Сторона");      
			ИмяСправочника = СсылочныйТипСтрокой(СсылкаНаЭлемент);
			ИмяСправочника = СтрПолучитьСтроку(СтрЗаменить(ИмяСправочника, ".", Символы.ПС), 2);
			СоответствиеИни.Вставить(ИмяСправочника, КлючИЗначение.Значение);	
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого СсылкаДанные Из ДанныеПрочитатьВходящие Цикл
		ТипСсылки				= ТипЗнч(СсылкаДанные);
		ПредставлениеТипаСсылки	= СоответствиеТипов.Получить(ТипСсылки);
		Если ПредставлениеТипаСсылки = Неопределено Тогда
			ПредставлениеТипаСсылки = МодульФункций.ПолучитьРеквизитМетаданныхОбъекта(СсылкаДанные, "Имя");
			СоответствиеТипов.Вставить(ТипСсылки, ПредставлениеТипаСсылки);
		КонецЕсли;
		УзелИниВСоответствие = СоответствиеИни.Получить(ПредставлениеТипаСсылки);
		Если УзелИниВСоответствие = Неопределено Тогда
			СбисФункция = "МодульОбъектаКлиент.ПрочитатьСтороныПоДанным1С";
			Детализация = "В файле настроек отсутствует узел для обработки участников " + ПредставлениеТипаСсылки;
			РезультатОшибка = НовыйСбисИсключение(, СбисФункция, , Детализация);
			СоответствиеРезультат.Вставить(СсылкаДанные, Новый Структура("Ошибка", РезультатОшибка));
			Продолжить;
		КонецЕсли;
		СоставПакета.Добавить(СсылкаДанные);
		СоответствиеПрочитать.Вставить(СсылкаДанные, Новый Структура("ИмяИни, ДокументДанные","Участник", УзелИниВСоответствие));
	КонецЦикла;
	МодульФункций.ПолучитьДанныеДокументов1С(СоответствиеПрочитать, Новый Структура("ТекущийПакет",Новый Структура), СоставПакета);

	Для Каждого Элемент Из СоответствиеПрочитать Цикл
		Сторона = МодульФункций.ПолучитьСторону(ГлавноеОкно.Кэш, Элемент.Значение.ДокументДанные);     
		Если Сторона = Неопределено Тогда
			РезультатОшибка	= НовыйСбисИсключение(721, "МодульОбъектаКлиент.ПрочитатьСтороныПоДанным1С",,,"У " + Элемент.Ключ + " не заполнен ИНН/КПП");
			СоответствиеРезультат.Вставить(Элемент.Ключ, Новый Структура("Ошибка", РезультатОшибка));
		Иначе
			СоответствиеРезультат.Вставить(Элемент.Ключ, Новый Структура("Результат", Сторона));
		КонецЕсли;
	КонецЦикла;
	Возврат СоответствиеРезультат;

КонецФункции

// Функция определяет тип идентификационного номера налогоплательцика, с учетом региональной особенности
//
// Параметры:
//  ИдентификационныйНомер	 - Строка	- идентификациооный номер стороны, определяемый ини файлом
// 
// Возвращаемое значение:
//  Структура - Ключ - строка, тип идентификациооного номера. Значение - булево, если определили тип, возвращаем Истина, если нет - Ложь.
//
&НаКлиенте
Функция ОпределитьТипИдентификационногоНомера(ИдентификационныйНомер) Экспорт
		
	СоставИдентификационныхНомеров = ПолучитьСоставИдентификационныхНомеров();
	
	ЭтоИНН = СбисИННСоответствуетТребованиямБезТипа(ИдентификационныйНомер)
		Или НЕ ЗначениеЗаполнено(ИдентификационныйНомер)
		Или СбисУНПСоответствуетТребованиям(ИдентификационныйНомер, Истина);
		
	Если ЭтоИНН Тогда
		СоставИдентификационныхНомеров.ИНН = Истина;
		Возврат СоставИдентификационныхНомеров;
	КонецЕсли;	
	
	ПроверочноеЧисло = Сред(ИдентификационныйНомер, 5, 1);	
		
	Если Найти("45", ПроверочноеЧисло) Тогда
		СоставИдентификационныхНомеров.БИН = Истина;
		Возврат СоставИдентификационныхНомеров;
	КонецЕсли;
	
	Если Найти("0123", ПроверочноеЧисло) Тогда
		СоставИдентификационныхНомеров.ИИН = Истина;
		Возврат СоставИдентификационныхНомеров;
	КонецЕсли;
	
	Возврат СоставИдентификационныхНомеров;
	
КонецФункции  

// Функция, по длине идентификационного номера, определяет тип лица и проверяет соответствие ИНН требованиям.
//
// Параметры:
//  ИНН 	- Строка - проверяемый индивидуальный номер налогоплательщика.
//
// Возвращаемое значение:
//  Булево	- Истина, если соответствует.
//
&НаКлиенте
Функция СбисИННСоответствуетТребованиямБезТипа(Знач ИНН) Экспорт
	
	ИННСтр = СокрЛП(ИНН);
	ДлинаИНН =  СтрДлина(ИННСтр);
	
	Если ДлинаИНН = 10 Тогда
		ЭтоЮридическоеЛицо = Истина;
	ИначеЕсли ДлинаИНН = 12 Тогда
		ЭтоЮридическоеЛицо = Ложь;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат СбисИННСоответствуетТребованиям(ИНН, ЭтоЮридическоеЛицо);
	
КонецФункции

// Функция проверяет соответствие ИНН требованиям.
//
// Параметры:
//  ИНН                - Строка - проверяемый индивидуальный номер налогоплательщика.
//  ЭтоЮридическоеЛицо - Булево - признак, является ли владелец ИНН юридическим лицом.
//
// Возвращаемое значение:
//  Булево - Истина, если соответствует.
//
&НаКлиенте
Функция СбисИННСоответствуетТребованиям(Знач ИНН, ЭтоЮридическоеЛицо) Экспорт

	СоответствуетТребованиям = Истина;
	
	ИНН      = СокрЛП(ИНН);
	ДлинаИНН = СтрДлина(ИНН);

	Если ЭтоЮридическоеЛицо = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;  
	
	ТолькоЦифрыВСтроке = СбисТолькоЦифрыВСтроке(ИНН);
	
	Если НЕ ТолькоЦифрыВСтроке Тогда
		СоответствуетТребованиям = Ложь;
	КонецЕсли;

	Если  ЭтоЮридическоеЛицо И ДлинаИНН <> 10 Тогда
		СоответствуетТребованиям = Ложь;
	ИначеЕсли НЕ ЭтоЮридическоеЛицо И ДлинаИНН <> 12 Тогда
		СоответствуетТребованиям = Ложь;  
	Иначе
		//
	КонецЕсли;

	Если НЕ СоответствуетТребованиям Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ЭтоЮридическоеЛицо Тогда

		КонтрольнаяСумма = 0;

		Для Индекс = 1 По 9 Цикл

			Если Индекс = 1 Тогда
				Множитель = 2;
			ИначеЕсли Индекс = 2 Тогда
				Множитель = 4;
			ИначеЕсли Индекс = 3 Тогда
				Множитель = 10;
			ИначеЕсли Индекс = 4 Тогда
				Множитель = 3;
			ИначеЕсли Индекс = 5 Тогда
				Множитель = 5;
			ИначеЕсли Индекс = 6 Тогда
				Множитель = 9;
			ИначеЕсли Индекс = 7 Тогда
				Множитель = 4;
			ИначеЕсли Индекс = 8 Тогда
				Множитель = 6;
			ИначеЕсли Индекс = 9 Тогда
				Множитель = 8;
			Иначе
				//
			КонецЕсли;

			Цифра = Число(Сред(ИНН, Индекс, 1));
			КонтрольнаяСумма = КонтрольнаяСумма + Цифра * Множитель;

		КонецЦикла;
		
		КонтрольныйРазряд = (КонтрольнаяСумма %11) %10;

		Если КонтрольныйРазряд <> Число(Сред(ИНН, 10, 1)) Тогда
			СоответствуетТребованиям = Ложь;
		КонецЕсли;

	Иначе

		КонтрольнаяСумма11 = 0;
		КонтрольнаяСумма12 = 0;

		Для Индекс = 1 По 11 Цикл

			// Расчет множителя для 11-го и 12-го разрядов.
			Если Индекс = 1 Тогда
				Множитель11 = 7;
				Множитель12 = 3;
			ИначеЕсли Индекс = 2 Тогда
				Множитель11 = 2;
				Множитель12 = 7;
			ИначеЕсли Индекс = 3 Тогда
				Множитель11 = 4;
				Множитель12 = 2;
			ИначеЕсли Индекс = 4 Тогда
				Множитель11 = 10;
				Множитель12 = 4;
			ИначеЕсли Индекс = 5 Тогда
				Множитель11 = 3;
				Множитель12 = 10;
			ИначеЕсли Индекс = 6 Тогда
				Множитель11 = 5;
				Множитель12 = 3;
			ИначеЕсли Индекс = 7 Тогда
				Множитель11 = 9;
				Множитель12 = 5;
			ИначеЕсли Индекс = 8 Тогда
				Множитель11 = 4;
				Множитель12 = 9;
			ИначеЕсли Индекс = 9 Тогда
				Множитель11 = 6;
				Множитель12 = 4;
			ИначеЕсли Индекс = 10 Тогда
				Множитель11 = 8;
				Множитель12 = 6;
			ИначеЕсли Индекс = 11 Тогда
				Множитель11 = 0;
				Множитель12 = 8; 
			Иначе
				//
			КонецЕсли;

			Цифра = Число(Сред(ИНН, Индекс, 1));
			КонтрольнаяСумма11 = КонтрольнаяСумма11 + Цифра * Множитель11;
			КонтрольнаяСумма12 = КонтрольнаяСумма12 + Цифра * Множитель12;

		КонецЦикла;

		КонтрольныйРазряд11 = (КонтрольнаяСумма11 %11) %10;
		КонтрольныйРазряд12 = (КонтрольнаяСумма12 %11) %10;

		Если КонтрольныйРазряд11 <> Число(Сред(ИНН, 11, 1)) Или КонтрольныйРазряд12 <> Число(Сред(ИНН, 12, 1)) Тогда
			СоответствуетТребованиям = Ложь;
		КонецЕсли;

	КонецЕсли;

	Возврат СоответствуетТребованиям;

КонецФункции 


&НаКлиенте
Функция ПолучитьСоставИдентификационныхНомеров()
	
	Результат = Новый Структура;
	Результат.Вставить("ИНН", Ложь);	
	Результат.Вставить("БИН", Ложь);	
	Результат.Вставить("ИИН", Ложь);	
	
	Возврат Результат;
	
КонецФункции

// Функция проверяет, содержит ли строка только цифры.
//
// Параметры:
//  Значение         - Строка - проверяемая строка.
//  ПробелыЗапрещены - Булево - если Ложь, то в строке допустимо наличие пробелов.
//
// Возвращаемое значение:
//   Булево - Истина - строка содержит только цифры или пустая, Ложь - строка содержит иные символы.
//
&НаКлиенте
Функция СбисТолькоЦифрыВСтроке(Знач Значение, ПробелыЗапрещены = Истина) Экспорт
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПробелыЗапрещены Тогда
		Значение = СтрЗаменить(Значение, " ", "");
	КонецЕсли;
		
	Если СтрДлина(Значение) = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Если содержит только цифры, то в результате замен должна быть получена пустая строка.
	// Проверять при помощи ПустаяСтрока нельзя, так как в исходной строке могут быть пробельные символы.
	Возврат СтрДлина(
		СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить(
		СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( 
			Значение, "0", ""), "1", ""), "2", ""), "3", ""), "4", ""), "5", ""), "6", ""), "7", ""), "8", ""), "9", "")) = 0;
	
КонецФункции

// Функция проверяет соответствие УНП требованиям.
//
// Параметры:
//  УНП                - Строка - проверяемый индивидуальный номер налогоплательщика.
//  ЭтоЮридическоеЛицо - Булево - признак, является ли владелец УНП юридическим лицом.
//
// Возвращаемое значение:
//  Булево - Истина, если соответствует.
//
&НаКлиенте
Функция СбисУНПСоответствуетТребованиям(Знач УНП, ЭтоЮридическоеЛицо) Экспорт
	
	УНП = СокрЛП(УНП); 
	ДлинаУНП = СтрДлина(УНП); 
	КорректнаяДлинаУНП = 9;
	Знаменатель = 11;
	
	Если НЕ СбисТолькоЦифрыВСтроке(УНП) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ДлинаУНП = КорректнаяДлинаУНП 
		И ЭтоЮридическоеЛицо Тогда
		
		КонтрольнаяСумма = 0;
		
		Для Индекс = 1 По 8 Цикл
			
			Множитель = ПолучитьМножительПоИндексу(Индекс);	
			Цифра = Число(Сред(УНП, Индекс, 1));
			КонтрольнаяСумма = КонтрольнаяСумма + Цифра * Множитель;
			
		КонецЦикла;
		
		КонтрольныйРазряд = (КонтрольнаяСумма % Знаменатель);
		
		Если КонтрольныйРазряд <> Число(Сред(УНП, 9, 1)) 
			Или КонтрольныйРазряд = 10 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли ДлинаУНП = КорректнаяДлинаУНП 
		И НЕ ЭтоЮридическоеЛицо Тогда
		
		КонтрольнаяСумма = 0;
		
		Для Индекс = 1 По 8 Цикл 
			
			Множитель = ПолучитьМножительПоИндексу(Индекс); 
			Буква = Сред(УНП, Индекс, 1); 
			 
			Цифра = ПолучитьКонтрольнуюЦифру(Индекс, Буква); 
			
			Если Цифра = Ложь Тогда
				Цифра = Число(Сред(УНП, Индекс, 1));  
			КонецЕсли;		
						
			КонтрольнаяСумма = КонтрольнаяСумма + Цифра * Множитель;
			
		КонецЦикла;
		
		КонтрольныйРазряд = (КонтрольнаяСумма % Знаменатель);
		
		Если КонтрольныйРазряд <> Число(Сред(УНП, 9, 1)) 
			Или КонтрольныйРазряд = 10 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;	
	
КонецФункции  

&НаКлиенте
Функция ПолучитьМножительПоИндексу(Индекс)     
	
	МассивМножителей = Новый Массив;
	
	МассивМножителей.Добавить(29);
	МассивМножителей.Добавить(23);
	МассивМножителей.Добавить(19);
	МассивМножителей.Добавить(17);
	МассивМножителей.Добавить(13);
	МассивМножителей.Добавить(7);
	МассивМножителей.Добавить(5);
	МассивМножителей.Добавить(3);  
	
	Если МассивМножителей.Количество() < Индекс Тогда
		Возврат Ложь;
	Иначе
		Возврат МассивМножителей[Индекс - 1];
	КонецЕсли;
			
КонецФункции    

&НаКлиенте
Функция ПолучитьКонтрольнуюЦифру(Индекс, Буква)  
	
	МассивИндексов = Новый Массив; 
	
	СоставПервичныхКлючей = Новый Соответствие;
	СоставПервичныхКлючей.Вставить("А", 10);
	СоставПервичныхКлючей.Вставить("В", 11); 
	СоставПервичныхКлючей.Вставить("С", 12);
	СоставПервичныхКлючей.Вставить("Е", 14);
	СоставПервичныхКлючей.Вставить("Н", 17);
	СоставПервичныхКлючей.Вставить("К", 10);
	СоставПервичныхКлючей.Вставить("М", 22); 
	
	СоставВторичныхКлючей = Новый Соответствие; 
	СоставВторичныхКлючей.Вставить("А", 0);
	СоставВторичныхКлючей.Вставить("В", 1); 
	СоставВторичныхКлючей.Вставить("С", 2);
	СоставВторичныхКлючей.Вставить("Е", 3);
	СоставВторичныхКлючей.Вставить("Н", 4);
	СоставВторичныхКлючей.Вставить("К", 5);
	СоставВторичныхКлючей.Вставить("М", 6); 
	СоставВторичныхКлючей.Вставить("О", 7);
	СоставВторичныхКлючей.Вставить("Р", 8);
	СоставВторичныхКлючей.Вставить("Т", 9); 

	
	МассивИндексов.Добавить(СоставПервичныхКлючей);
	МассивИндексов.Добавить(СоставВторичныхКлючей);
	
	Если МассивИндексов.Количество() < Индекс Тогда
		Возврат Ложь;
	Иначе
		Возврат МассивИндексов[Индекс - 1].Получить(Буква);
	КонецЕсли;
			
КонецФункции

// Функция - возвращает тип формируемого документа
//
// Параметры:
//  ПараметрыРасчета - Структура	 -  Набор параметров для расчета типа формируемого документа
//  ДопПараметры	 - Структура	 -  Набор параметров для расширения работы функции
// 
// Возвращаемое значение:
//  Структура - Результат работы функции (Тип и Подтип пакета)
//
&НаКлиенте
Функция ТипФормируемогоДокументаПоУмолчанию(ПараметрыРасчета, ДопПараметры = Неопределено) Экспорт
	
	ИниТекущегоРаздела = ПараметрыРасчета.ИниТекущегоРаздела;  
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	МодульФункций = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	
	ТипПакета = "ДокОтгрИсх";
	ТипыПакета = МодульФункций.РассчитатьЗначение("РеестрСБИС_Тип", ИниТекущегоРаздела, Кэш);
	МассивТипов = МодульФункций.РазбитьСтрокуВМассивНаКлиенте(ТипыПакета, ",");
	Если МассивТипов.Количество() Тогда
		ТипПакета = МассивТипов[0];
	КонецЕсли;
	ПодтипПакета = МодульФункций.РассчитатьЗначение("РеестрСБИС_Подтип", ИниТекущегоРаздела, Кэш);
	
	Возврат Новый Структура("ТипПакета, ПодтипПакета", ТипПакета, ПодтипПакета);
	
КонецФункции

// Функция готовит структуру пакета электронных документов по комплекту документов 1С для просмотра и отправки контрагентам.
// Т.к. по одной строке документов 1С может быть сформировано несколько комплектов (оказание услуги), то структуры пакетов добавляются в массив.
//
// Параметры:
//  СтрокаСпискаДокументов	 - ДанныеФормыЭлементКоллекции - Параметры для формирования электронного документа
//  ДопПараметры			 - Структура - Набор расширений работы функции
// 
// Возвращаемое значение:
//  Массив - Набор сгенерированных пакетов
//
&НаКлиенте
Функция ЗапуститьПодготовкуДокументаСбисПоДанным1С(СтрокаСпискаДокументов, ДопПараметры) Экспорт 
	
	Кэш = ПолучитьТекущийЛокальныйКэш(); 
	
	МодульФункций = ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	
	ГлавноеОкно = Кэш.ГлавноеОкно; 
	МассивПакетов = Новый Массив;
	Контекст = Новый Структура("МассивПакетов", Новый Массив);
	Попытка
		Кэш.КэшЗначенийИни.ТекущийПакет.Очистить();
	Исключение
		//Убрать в .50
	КонецПопытки;
	ИниТекущегоРеестра = Кэш.Текущий.ТипДок;
	ВнешниеФайлы = Новый Массив;
	НеЗапускатьВДокументооборот = Ложь;
	МассивСтатусРегламент = Новый Массив;
	
	Если ЗначениеЗаполнено(ИниТекущегоРеестра) Тогда
		ЗначениеИниТекущегоРеестра = Кэш.ФормаНастроек.Ини(Кэш, ИниТекущегоРеестра);
		НеЗапускатьВДокументооборот = МодульФункций.РассчитатьЗначение("НеЗапускатьВДокументооборот", ЗначениеИниТекущегоРеестра, Кэш);
		//Костылище с переопределением каталога обмена от реестра
		Если Кэш.ФормаНастроек.Ини(Кэш, ИниТекущегоРеестра).Свойство("КаталогОбмена") Тогда
			Кэш.ФормаОтправки = Кэш.ГлавноеОкно.сбисПолучитьФорму("ИнтеграцияКаталог");
			Кэш.Парам.КаталогОбмена = Кэш.ОбщиеФункции.РассчитатьЗначение("КаталогОбмена", ЗначениеИниТекущегоРеестра, Кэш)
		Иначе
			Кэш.ФормаОтправки = Кэш.Интеграция;
		КонецЕсли;
	КонецЕсли;
	// выбираем нужные файлы настроек для выгрузки пакета
	СоответствиеДокументДанные = Новый Соответствие;
	Для Каждого Элемент из СтрокаСпискаДокументов.СоставПакета Цикл		
		Документ = Элемент.Значение;  
		
		Если НЕ ЗначениеЗаполнено(Документ) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Документ) = Тип("Строка") Тогда
			//Ссылка на внешний файл
			ВнешниеФайлы.Добавить(Документ);
			Продолжить;
		КонецЕсли;
		
		// Определяем ини для выгрузки текущего вложения			
		ИниДокумента = Кэш.ФормаНастроек.Ини_Выгрузка(Кэш, Документ, Элемент.Представление, Кэш.Текущий);
		Если Кэш.ини.Свойство(ИниДокумента) Тогда
			ВходящийКонтекстРасчета = Новый Структура;
			ВходящийКонтекстРасчета.Вставить("ИспользоватьНовыйФорматАктаСверки", Кэш.Парам.ИспользоватьНовыйФорматАктаСверки);
			ВходящийКонтекстРасчета.Вставить("УПД24", ПолучитьЗначениеПараметраСбис("УПД24"));
			ВходящийКонтекстРасчета.Вставить("РеквизитКодаНоменклатуры", ПолучитьЗначениеПараметраСбис("РеквизитКодаНоменклатуры"));
			ЗначениеИниДокумента = Кэш.ФормаНастроек.Ини(Кэш, ИниДокумента);
			ЗначениеИниДокумента.Вставить("Формат2016",		Новый Структура("Значение,РассчитанноеЗначение", Истина, Истина));
			ЗначениеИниДокумента.Вставить("Формат2019",		Новый Структура("Значение,РассчитанноеЗначение", Истина, Истина));
			ЗначениеИниДокумента.Вставить("ФорматУКД2020",	Новый Структура("Значение,РассчитанноеЗначение", Истина, Истина));
			ЗначениеИниДокумента.Вставить("ВходящийКонтекст", Новый Структура("Значение,РассчитанноеЗначение", "", ВходящийКонтекстРасчета));
			ЗначениеИниДокумента.Вставить("ИспользоватьШтрихкодыНоменклатурыКонтрагентов",	Новый Структура("Значение,РассчитанноеЗначение", Кэш.Парам.ИспользоватьШтрихкодыНоменклатурыКонтрагентов, Кэш.Парам.ИспользоватьШтрихкодыНоменклатурыКонтрагентов));
			ИдентификаторДокумента = СбисИдентификаторДокумента1С(Документ);

			СоответствиеДокументДанные.Вставить(ИдентификаторДокумента, Новый Структура("ИмяИни, ДокументДанные",ИниДокумента,ЗначениеИниДокумента));
		Иначе // Если нет инишки для одного из документов пакета, то весь пакет не формируем
			СтруктураОшибки	= НовыйСбисИсключение(,"РаботаСДокументами1С.ПодготовитьСтруктуруДокумента1С",610,, 
																		"Отсутствует настройка " + ИниДокумента + " для формирования документа " + Документ);
			//Если отправка, то вернуть как ответ
			Если Кэш.Свойство("РезультатОтправки") Тогда
				СоставПакета = НовыйСоставПакета(Новый Структура("ОснованиеПакета, Ошибка", Документ, СтруктураОшибки));
				МассивПакетов.Добавить(СоставПакета);
			Иначе
				СообщитьСбисИсключение(СтруктураОшибки, Новый Структура("Отправлять", Ложь));
			КонецЕсли;
			Возврат МассивПакетов;
		КонецЕсли;		
	КонецЦикла;
	
	// получаем на сервере все данные по документам пакета по файлам настроек
	Если Кэш.Свойство("РезультатОтправки") Тогда
		ДатаНач = МодульФункций.СбисТекущаяДатаВМиллисекундах(Кэш);	
	КонецЕсли;
	МодульФункций.ПолучитьДанныеДокументов1С(СоответствиеДокументДанные, Кэш.КэшЗначенийИни, СтрокаСпискаДокументов.СоставПакета, Кэш.Парам, Кэш);  // передаем СоставПакета, так как в нем нужный порядок документов	// alo Меркурий
	Если Кэш.Свойство("РезультатОтправки") Тогда
		ДатаКнц = МодульФункций.СбисТекущаяДатаВМиллисекундах(Кэш);
		Кэш.РезультатОтправки.ВремяПолученияДанных = Кэш.РезультатОтправки.ВремяПолученияДанных+(ДатаКнц-ДатаНач)/1000;	
	КонецЕсли;
	Кэш.КэшЗначенийИни.ТекущийПакет.Вставить("СоответствиеДокументДанные", СоответствиеДокументДанные);
	
	Если Не МодульФункций.ОбработатьДанныеДокументов1С(Кэш, Контекст, СтрокаСпискаДокументов.СоставПакета, СоответствиеДокументДанные) Тогда
		СтруктураОшибки = Неопределено;
		Если Не Контекст.СоставПакета.Свойство("Ошибка", СтруктураОшибки) Тогда 
			СтруктураОшибки = НовыйСбисИсключение(,	"РаботаСДокументами1С.ПодготовитьСтруктуруДокумента1С", 611, "Ошибка создания документа.", 
																		"Документ " + СтрокаСпискаДокументов.СоставПакета[0].Значение + " не сформирован.");
		КонецЕсли;
		Если Кэш.Свойство("РезультатОтправки") Тогда
			//При отправке, требуется прокинуть ошибку до вызова отправки чтобы получить номрмальное исключение
			СоставПакета = НовыйСоставПакета(Новый Структура("ОснованиеПакета, Ошибка", СтрокаСпискаДокументов.СоставПакета[0].Значение, СтруктураОшибки));
			МассивПакетов.Добавить(СоставПакета);
		Иначе
			СообщитьСбисИсключение(СтруктураОшибки);
		КонецЕсли;
		Возврат МассивПакетов;
	КонецЕсли;
	
	// добавляем в первый пакет внешние файлы
	Если Контекст.МассивПакетов.Количество()>0 Тогда
		Для Каждого ВнешнийФайлПуть из ВнешниеФайлы Цикл
			ВнешнийФайл = Новый Файл(ВнешнийФайлПуть);
			Если ВнешнийФайл.Существует() Тогда
				Вложение = Новый Структура("ПолноеИмяФайла,ИмяФайла,Название",ВнешнийФайлПуть,ВнешнийФайл.Имя,ВнешнийФайл.Имя);
				Контекст.МассивПакетов[0].Вложение.Добавить(Вложение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//KES 050751151 Статусы в разрезе регламентов (ОТПРАВКА ПАКЕТА ДОКУМЕНТОВ)--> 1 +
	Если Кэш.ФормаРаботыСоСтатусами = "Статусы_Регистры" 
		И (Кэш.Парам.СпособОбмена = 0 ИЛИ Кэш.Парам.СпособОбмена = 3)
		И Кэш.ини.Конфигурация.Свойство("СтатусРегламент") Тогда
		МассивСтатусРегламент  = МодульФункций.РазбитьСтрокуВМассивНаКлиенте(Кэш.ини.Конфигурация.СтатусРегламент.Значение,",");
	КонецЕсли;	   
	//<-- KES 050751151 Статусы в разрезе регламентов (ОТПРАВКА ПАКЕТА ДОКУМЕНТОВ)
	
	МодульРаздела = НайтиФункциюСеансаОбработки("ТипФормируемогоДокумента", Кэш.Текущий.ФормыРаздела);  	
	ПараметрыРасчетаТипа = Новый Структура("ИниТекущегоРаздела, ИниДокумента", ЗначениеИниТекущегоРеестра, ЗначениеИниДокумента); 
	
	Если МодульРаздела = Ложь Тогда

		ТипФормируемогоДокумента = ТипФормируемогоДокументаПоУмолчанию(ПараметрыРасчетаТипа);  

	Иначе

		ТипФормируемогоДокумента = МодульРаздела.ТипФормируемогоДокумента(ПараметрыРасчетаТипа); 

	КонецЕсли;
	
	ПараметрыГенерацииПакетов = Новый Структура("Кэш", Кэш);
	ПараметрыГенерацииПакетов.Вставить("ОснованиеПакета",				СтрокаСпискаДокументов.СоставПакета[0].Значение);
	ПараметрыГенерацииПакетов.Вставить("СтатусыРегламентов",			МассивСтатусРегламент);
	ПараметрыГенерацииПакетов.Вставить("Тип",							ТипФормируемогоДокумента.ТипПакета);
	ПараметрыГенерацииПакетов.Вставить("НеЗапускатьВДокументооборот",	НеЗапускатьВДокументооборот);
	ПараметрыГенерацииПакетов.Вставить("ГрязныеИни",					СоответствиеДокументДанные);
	Если ЗначениеЗаполнено(ТипФормируемогоДокумента.ПодтипПакета) Тогда
		ПараметрыГенерацииПакетов.Вставить("ПодТип", ТипФормируемогоДокумента.ПодтипПакета);
	КонецЕсли;
	Для Каждого Пакет Из Контекст.МассивПакетов Цикл
		РезультатГенерации = СгенерироватьИсходящийПакет(Пакет, ПараметрыГенерацииПакетов);
		Если РезультатГенерации.Ошибки.Количество() Тогда
			//В пакете ошибки. Дальнейшее выполнение не имеет смысла
			Если Кэш.Свойство("РезультатОтправки") Тогда
				//Идёт отправка, добавить в пакет первую ошибку, с ней и упадём в отправке. При необходимости сделать в разрезе конкретного документа 1С, сделать нормальный проброс ошибок
				Для Каждого КлючИЗначение Из РезультатГенерации.Ошибки Цикл
					РезультатГенерации.ПолныйСоставПакета.Вставить("Ошибка", КлючИЗначение.Значение);
					Прервать;
				КонецЦикла;
			Иначе
				Для Каждого КлючИЗначение Из РезультатГенерации.Ошибки Цикл
					//Показываем первое сообщение, старая логика
					Кэш.ГлавноеОкно.СбисСообщитьОбОшибке(Кэш, КлючИЗначение.Значение, Новый Структура("Отправлять", Ложь));
					Прервать;
				КонецЦикла;
				Продолжить;//Просто сообщить, этого вполне достаточно.
			КонецЕсли;
		КонецЕсли;
		МассивПакетов.Добавить(РезультатГенерации.ПолныйСоставПакета);
	КонецЦикла;
	
	Возврат МассивПакетов;  
	
КонецФункции  

// Функция - генерирует состав пакета с заголовками на основании подготовленных данных
//
// Параметры:
//  ПакетВходящий	 - Структура	 - Пакет-основание для формирования
//	ПараметрыГенерацииПакета	- Структура -
//		НеЗапускатьВДокументооборот - Булево         - признак проведения документа в СБИС после записи
//		Тип                         - Строка         - Тип в заголовок формируемого пакета. Если на входящем пакете указан Конверт, то игнорируется.
//		ПодТип                      - Строка         - ПодТип в заголовок формируемого пакета. Если на входящем пакете указан Конверт, то игнорируется.
//		ОснованиеПакета             - ДокументСсылка - основной документ пакета
//		Кэш                         - Структура      - кэш обработки
//
// Возвращаемое значение:
//  Структура - 
//		Ошибки				- Соответствие	- ошибки в процессе, где ключ - ссылка на документ 1С
//		ПолныйСоставПакета	- Структура - готовый состав пакета с данными.
//
&НаКлиенте
Функция СгенерироватьИсходящийПакет(ПакетВходящий, ПараметрыГенерацииПакета)
	Перем РегламентНазвание, ПолныйСоставПакета, СвЮлФлСтороны; 
	
	МодульФункций = ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	
	Кэш				= ПолучитьТекущийЛокальныйКэш();
	ОснованиеПакета	= ПараметрыГенерацииПакета.ОснованиеПакета;
	Результат		= Новый Структура("Ошибки, ПолныйСоставПакета", Новый Соответствие);
	
	Если ПакетВходящий.Свойство("Конверт", Результат.ПолныйСоставПакета) Тогда
		Если	Не	Результат.ПолныйСоставПакета.Свойство("НеЗапускатьВДокументооборот")
			Или		Результат.ПолныйСоставПакета.НеЗапускатьВДокументооборот = Неопределено Тогда
			Результат.ПолныйСоставПакета.Вставить("НеЗапускатьВДокументооборот",	ПараметрыГенерацииПакета.НеЗапускатьВДокументооборот);
		КонецЕсли;
	Иначе
		Результат.ПолныйСоставПакета = Новый Структура;
	КонецЕсли;
	
	//Сгенерировать XML вложений
	ПараметрыГенерацииВложений	= Новый Структура;
	Если ТипЗнч(ОснованиеПакета) <> Тип("Структура") Тогда
		ПараметрыГенерацииВложений.Вставить("ОснованиеПакета", ОснованиеПакета);
	КонецЕсли;
	ПараметрыГенерацииВложений.Вставить("СоставПакета",	ПакетВходящий);
	ПараметрыГенерацииВложений.Вставить("Результат",	Результат);
	ПараметрыГенерацииВложений.Вставить("ГрязныеИни",	ПараметрыГенерацииПакета.ГрязныеИни);
	РезультатГенерации			= СгенерироватьВложенияВПакет(ПараметрыГенерацииВложений, Кэш);

	//Если явно задана ошибка, то заменим последнюю по основанию, если такая была.
	Если ПакетВходящий.Свойство("Ошибка") Тогда
		Результат.Ошибки.Вставить(ОснованиеПакета, НовыйСбисИсключение(ПакетВходящий.Ошибка, "РаботаСДокументами1С.СгенерироватьПакет"));
	КонецЕсли;
	Результат.ПолныйСоставПакета.Вставить("Вложение", РезультатГенерации);
	
	Если	ПакетВходящий.Свойство("Конверт")
		Или	Результат.Ошибки.Количество() Тогда
		//Есть конверт, либо были ошибки, генерировать конверт не надо. Выходим.
		Возврат Результат;
	КонецЕсли;
	
	// если нет структуры конверта, то берем все с первого вложения	
	ОснованиеДляПакета	= РезультатГенерации[0];
	ОрганизацияСторона	= ВложениеСБИС_Получить(ОснованиеДляПакета, "СторонаПоРоли", "Отправитель");
	КонтрагентСторона	= ВложениеСБИС_Получить(ОснованиеДляПакета, "СторонаПоРоли", "Получатель");
	Если	ОрганизацияСторона = Неопределено Тогда
		
		ОшибкаГенерацияПакета = НовыйСбисИсключение(724, "МодульОбъектаКлиент.СгенерироватьИсходящийПакет");
		Результат.Ошибки.Вставить(ОснованиеПакета, ОшибкаГенерацияПакета);
		Возврат Результат;
			
	КонецЕсли;
	
	Если	КонтрагентСторона = Неопределено Тогда
		
		ОшибкаГенерацияПакета = НовыйСбисИсключение(725, "МодульОбъектаКлиент.СгенерироватьИсходящийПакет");
		Результат.Ошибки.Вставить(ОснованиеПакета, ОшибкаГенерацияПакета);
		Возврат Результат;
			
	КонецЕсли;	

	Результат.ПолныйСоставПакета.Вставить("НашаОрганизация", 			ОрганизацияСторона);
	Результат.ПолныйСоставПакета.Вставить("Контрагент", 				КонтрагентСторона);
	Результат.ПолныйСоставПакета.Вставить("Ответственный", 				ОснованиеДляПакета.Ответственный);
	Результат.ПолныйСоставПакета.Вставить("Подразделение", 				ОснованиеДляПакета.Подразделение);	
	Результат.ПолныйСоставПакета.Вставить("Регламент", 					ОснованиеДляПакета.Регламент);
	Результат.ПолныйСоставПакета.Вставить("Тип", 						ПараметрыГенерацииПакета.Тип);
	Результат.ПолныйСоставПакета.Вставить("НеЗапускатьВДокументооборот",ПараметрыГенерацииПакета.НеЗапускатьВДокументооборот);
	Результат.ПолныйСоставПакета.Вставить("ДокументОснование",			ОснованиеДляПакета.ДокументОснование);
	Результат.ПолныйСоставПакета.Вставить("Примечание",					ОснованиеДляПакета.Примечание);
	Результат.ПолныйСоставПакета.Вставить("Сертификат",					ОснованиеДляПакета.Сертификат);
	Если ПараметрыГенерацииПакета.Свойство("Подтип") Тогда
		Результат.ПолныйСоставПакета.Вставить("Подтип", ПараметрыГенерацииПакета.Подтип);	
	КонецЕсли;
	
	ДопПоля = Новый Массив;
	Если ОснованиеДляПакета.Свойство("ДопПоля") Тогда   // alo ДопПоля
		ДопПоля = ОснованиеДляПакета.ДопПоля;
	КонецЕсли;
	
	ИдентификаторГосконтракта = Неопределено;
	ПараметрыГенерацииВложений.Вложение.Свойство("ИдентификаторГосконтракта", ИдентификаторГосконтракта);
	
	Если ПолучитьЗначениеПараметраСбис("ПоддержкаОбменаЕИС")
		И ЗначениеЗаполнено(ИдентификаторГосконтракта) Тогда
		
		ДопПоля.Добавить("Расширение");
		ДопПоля.Добавить("ЕИС");
		
	КонецЕсли;
	Если ЗначениеЗаполнено(ДопПоля) Тогда
		Результат.ПолныйСоставПакета.Вставить("ДопПоля", ДопПоля);
	КонецЕсли;

	Если ОснованиеДляПакета.Свойство("Провести") Тогда   // alo Провести
		Результат.ПолныйСоставПакета.Вставить("Провести",	ОснованиеДляПакета.Провести);
	КонецЕсли;
	
	ИмяДокумента = МодульФункций.ПолучитьРеквизитМетаданныхОбъекта(ОснованиеПакета, "Имя");
	
	Если ПакетВходящий.Свойство("ПользовательскийИдентификатор") Тогда 
		Результат.ПолныйСоставПакета.Вставить("ПользовательскийИдентификатор", ПакетВходящий.ПользовательскийИдентификатор);
	ИначеЕсли		Результат.ПолныйСоставПакета.Свойство("Регламент",	РегламентНазвание) 
			И		РегламентНазвание.Свойство("Название",	РегламентНазвание) 
			И НЕ	ПараметрыГенерацииПакета.СтатусыРегламентов.Найти(РегламентНазвание) = Неопределено Тогда
		// Если вручную не назначен идентификатор и регламент подразумевает отдельное хранение статусов - guid выдается новый и не будет совпадать с guid документа			
		// Проверка, нет ли ранее сохраненного ид редакция
		фрм		= Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПрочитатьПараметрыДокументаСБИС", Кэш.ФормаРаботыСоСтатусами, "", Кэш);
		ИдДок	= фрм.ПрочитатьПараметрыДокументаСБИС(ОснованиеПакета, Кэш.ГлавноеОкно.Кэш.Парам.КаталогНастроек, РегламентНазвание + "ДокументСБИС_Ид", Кэш.Ини);
		//если первая отправка - новый ид
		Результат.ПолныйСоставПакета.Вставить("ПользовательскийИдентификатор", ИмяДокумента + ":"+?( ЗначениеЗаполнено(ИдДок), ИдДок, Строка(Новый УникальныйИдентификатор) ) );
	ИначеЕсли НЕ Результат.ПолныйСоставПакета.Свойство("ПользовательскийИдентификатор")
		И ТипЗнч(ОснованиеПакета) = Тип("Структура") Тогда 
		ИдОснования = ?(ОснованиеПакета.Свойство("Идентификатор"), ОснованиеПакета.Идентификатор, Новый УникальныйИдентификатор);
		Результат.ПолныйСоставПакета.Вставить("ПользовательскийИдентификатор", ИмяДокумента + ":" + Строка(ИдОснования));
	ИначеЕсли  НЕ Результат.ПолныйСоставПакета.Свойство("ПользовательскийИдентификатор") Тогда 
		Результат.ПолныйСоставПакета.Вставить("ПользовательскийИдентификатор",ИмяДокумента+":"+строка(ОснованиеПакета.УникальныйИдентификатор()));	
	КонецЕсли;
	Возврат Результат;

КонецФункции

// Функция - генерирует вложения в пакет на основании подготовленных данных
//
// Параметры:
//  ПараметрыГенерацииВложений	 - Структура	 - 
//		Пакет			- Структура - данные генерируемого пакета
//		ОснованиеПакета - ДокумнтСсылка	- основной документ пакета
//	Кэш							- Структура		- кэш обработки
//
// Возвращаемое значение:
//  Массив		- сгенерированные вложения для пакета
//
&НаКлиенте
Функция СгенерироватьВложенияВПакет(ПараметрыГенерацииВложений, Кэш)
	
	СписокВложенийВПакет = Новый Массив;
	Для Каждого Вложение Из ПараметрыГенерацииВложений.СоставПакета.Вложение Цикл
		Попытка
			ПараметрыГенерацииВложений.Вставить("Вложение", Вложение);
			НаборВложенийВПакет = СгенерироватьНаборВложенийВПакет(ПараметрыГенерацииВложений);
			Для Каждого ВложениеДобавить Из НаборВложенийВПакет Цикл
				СписокВложенийВПакет.Добавить(ВложениеДобавить);
			КонецЦикла;
		Исключение
			ИнфоОбОшибке= ИнформацияОбОшибке();
			КлючОшибки	= ?(Вложение.Свойство("Документ1С"), Вложение.Документ1С, ПараметрыГенерацииВложений.ОснованиеПакета);
			ПараметрыГенерацииВложений.Результат.Ошибки.Вставить(КлючОшибки, НовыйСбисИсключение(ИнфоОбОшибке, "РаботаСДокументами1С.СгенерироватьВложенияВПакет"));
		КонецПопытки;
	КонецЦикла;
	
	Если	Не СписокВложенийВПакет.Количество()
		И	Не ПараметрыГенерацииВложений.Результат.Ошибки.Количество() Тогда
		//Нет вложений и ошибок в явном виде. Значит это пустой пакет (не заполнены табличные части)
		Если Кэш.Свойство("РезультатОтправки") Тогда
			//Сгенерировать пустое вложение для детализации
			СписокВложенийВПакет.Добавить(НовыйВложениеСБИС(, ПараметрыГенерацииВложений));
		КонецЕсли;
		ОшибкаПодготовки = НовыйСбисИсключение
			(, "РаботаСДокументами1С.СгенерироватьВложенияВПакет", 
			726, 
			"Документ не сформирован", 
			"В документе " + Строка(ПараметрыГенерацииВложений.ОснованиеПакета) + " не заполнены табличные части. Электронный документ не сформирован.");
		ПараметрыГенерацииВложений.Результат.Ошибки.Вставить(ПараметрыГенерацииВложений.ОснованиеПакета, ОшибкаПодготовки);
	КонецЕсли;
	
	Если Кэш.ДопВложение.Количество() Тогда
		Для Каждого Вложение Из Кэш.ДопВложение Цикл
			СписокВложенийВПакет.Добавить(Вложение);
		Конеццикла;
	КонецЕсли;

	Возврат СписокВложенийВПакет;

КонецФункции

