
&НаКлиенте
Функция ВырезатьИсключенияXMLВложения(XMLФайла)
	
	НаборДляСтрЗаменить	= Новый Соответствие;
	НаборДляСтрЗаменить.Вставить("xmlns=""SFAKT""",											"");
	НаборДляСтрЗаменить.Вставить("xmlns=""OTORG12""",										"");
	НаборДляСтрЗаменить.Вставить("xmlns=""IAKTPRM""",										"");
	НаборДляСтрЗаменить.Вставить("xmlns:xs=""http://www.w3.org/2001/XMLSchema""",			"");
	НаборДляСтрЗаменить.Вставить("xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""",	"");
	НаборДляСтрЗаменить.Вставить("xmlns=""urn:schemas-microsoft-com:office:spreadsheet""",	"");
	
	Возврат ПрименитьФорматКСтроке(XMLФайла, НаборДляСтрЗаменить, "СтрЗаменить");
	
КонецФункции

// ПЕРЕНЕСТИ в класс влоложения!
// Процедура - патчит дату, время, имя файла
//
// Параметры:
//  ФайлПропатчить		- Структура	- Вложение.СтруктураДокумента.Файл формируемого вложения
//  ВходящийКонтекст	- Структура
//		ФайлДанные		- Структура, грязный ини
//		ПолучательРоль	- Строка, роль получателя для поиска ИД
//		ОтправительРоль - Строка, роль отправителя для поиска ИД
//
&НаКлиенте
Процедура ПропатчитьФайлВложенияСБИС(ВложениеСБИС, ДопПараметры) Экспорт

	ФайлПропатчить = ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураДокумента");
	Если Не ФайлПропатчить.Свойство("Файл", ФайлПропатчить) Тогда
		
		// Нет файла, неизвестная структура вложения. Нечего патчить
		Возврат;
		
	КонецЕсли;
	
	МодульФункций		= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	ИмяФормыПоФормату	= "Файл_"
			+ МодульФункций.сбисЗаменитьНедопустимыеСимволы(ДопПараметры.ГрязныйИни.Файл_Формат)
			+ "_"
			+ МодульФункций.сбисЗаменитьНедопустимыеСимволы(ДопПараметры.ГрязныйИни.Файл_ВерсияФормата);
	
	ДатаВремяСоздания	= ТекущаяДата();
	лДанныеСторон		= ДопПараметры.ДанныеСторон;
	МодульИмениФайла	= НайтиФункциюСеансаОбработки("ПропатчитьИмяФайлаВложения", ИмяФормыПоФормату);
	
	Если НЕ МодульИмениФайла = Ложь Тогда
		
		МодульИмениФайла.ПропатчитьИмяФайлаВложения(ВложениеСБИС, ДопПараметры);
		
	Иначе   
		
		ПропатчитьИмяФайлаВложения(ВложениеСБИС, ДопПараметры);
		
	КонецЕсли;
	
	ФайлПерегенерируется = ИспользоватьГенераторДляВложения(ВложениеСБИС);
	//Патчим параметры для генератора или если есть XSLT, т.е. если документ еще перегенерируется в процессе
	//В остальных случаях, документ грузится как есть и могут быть ошибки формата
	Если Не ФайлПерегенерируется Тогда
		
		ИмяXSLTВыгрузки		= ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.сбисИмяXSLTДляВложения(ГлавноеОкно.Кэш, ФайлПропатчить, ВложениеСБИС);
		ФайлПерегенерируется= ЗначениеЗаполнено(XSLTПоПараметрам(ИмяXSLTВыгрузки));
		
	КонецЕсли;
	
	Если ФайлПерегенерируется Тогда
		
		//Дополнить отсутствующие параметры
		Если Не ФайлПропатчить.Свойство("Дата") Тогда
			
			ФайлПропатчить.Вставить("Дата",		Формат(ДатаВремяСоздания, "ДФ=dd.MM.yyyy"));
			ФайлПропатчить.Вставить("Время",	Формат(ДатаВремяСоздания, "ДФ=HH.mm.ss"));
			
		КонецЕсли;
		
	Иначе
				
		МодульФормата = НайтиФункциюСеансаОбработки("ПропатчитьСтруктуруВложения", ИмяФормыПоФормату);

		Если МодульФормата <> Ложь Тогда
			МодульФормата.ПропатчитьСтруктуруВложения(ВложениеСБИС, ДопПараметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры   

// Процедура - патчит имя файла вложения
//
// Параметры:
//  ВложениеСБИС	- Структура	- Структура формируемого вложения
//  ДопПараметры	- Структура - Структура дополнительных параметров
//
&НаКлиенте
Процедура ПропатчитьИмяФайлаВложения(ВложениеСБИС, ДопПараметры) 
	
	Перем ПолучательИд, ОтправительИд, ФайлИмяПропатчить, лДанныеСторон;
	
	СтруктураФайла      = ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
	ФайлПропатчить		= ВложениеСБИС_Получить(СтруктураФайла, "Файл");

	ДатаВремяСоздания	= ТекущаяДата();   
	
	лДанныеСторон = ДопПараметры.ДанныеСторон;
		
	Если ФайлПропатчить.Свойство("Имя", ФайлИмяПропатчить) Тогда
		Если	ДопПараметры.ГрязныйИни.Свойство("мСторона") 
			И	лДанныеСторон[ДопПараметры.ПолучательРоль].Свойство("Идентификатор",	ПолучательИД) 
			И	лДанныеСторон[ДопПараметры.ОтправительРоль].Свойство("Идентификатор",	ОтправительИД) Тогда
			ФайлИмяПропатчить = ФайлИмяПропатчить + ПолучательИД + "_" + ОтправительИД;
		Иначе
			ФайлИмяПропатчить = ФайлИмяПропатчить + "_";
		КонецЕсли;
		ФайлПропатчить.Имя = ФайлИмяПропатчить + "_" + Формат(ДатаВремяСоздания, "ДФ=ггггММдд") + "_" + Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	
КонецПроцедуры  

// Процедура - Пропатчить ид файла для имени файла
//
// Параметры:
//  СтруктураИдФайла - Структура - структура ИД файла передаточного документа
//  СтруктураФайла	 - Структура - Вложение.СтруктураДокумента.Файл формируемого вложения
//		N2 - Прослеживаемость. Заполняется в N2 значение "1". По умолчанию значение "0".
//		N3 - Маркировка. Заполняется в N3 значение "1". По умолчанию значение "0".
//		N4 - Если у номенклатуры вид продукции (Пиво, напитки, изготавливаемые на основе пива, слабоалкогольные напитки), заполняется в N4 значение "1". 
//		По умолчанию значение "0". 
//		N5 - Если у номенклатуры один из видов продукции ИСМП тогда в N5 значение "1". По умолчанию значение "0".  
//		N6 - Нефтепродукты. Заполняется в N6 значение "1". По умолчанию значение "0".
//
&НаКлиенте
Процедура ПропатчитьИдФайлаДляИмениФайла(СтруктураИдФайла, СтруктураФайла, ДопПараметры = Неопределено) Экспорт 
	
	// Параметры, которые требуется определить по ТЧ товаров с марк и прослеж.
	НаличиеМаркированногоТовара				= ЗначениеЗаполнено(ДопПараметры)
												И ДопПараметры.ЕстьКодыМаркировки;
												
	НаличиеПрослеживаемогоТовара			= ЗначениеЗаполнено(ДопПараметры)
												И ДопПараметры.ЕстьПрослеживаемость; 

	ЗначениеNПереключить = "1";
	
	Если НаличиеПрослеживаемогоТовара Тогда
		
		СтруктураИдФайла.N2 = ЗначениеNПереключить;
		
	КонецЕсли;
	
	Если НаличиеМаркированногоТовара Тогда
		
		ВидыМаркированногоТовара = ДопПараметры.ВидыМаркированногоТовара;
		
		НаличиеПива							= ВидыМаркированногоТовара.Найти("beer") <> Неопределено;
		НаличиеТабака						= ВидыМаркированногоТовара.Найти("tobacco") <> Неопределено;
		НаличиеАльтернативногоТабака		= ВидыМаркированногоТовара.Найти("otp") <> Неопределено;
	    НаличиеНикотиносодержащейПродукции	= ВидыМаркированногоТовара.Найти("ncp") <> Неопределено;
	    НаличиеТабачногоСырья				= ВидыМаркированногоТовара.Найти("tobaccoraw") <> Неопределено;
		НаличиеНефтепродуктов				= ВидыМаркированногоТовара.Найти("autofluids") <> Неопределено;
		
		ТабакИПроизводные =	НаличиеТабака 
						Или НаличиеАльтернативногоТабака 
						Или НаличиеНикотиносодержащейПродукции 
						Или НаличиеТабачногоСырья;
		
		СтруктураИдФайла.N3 = ЗначениеNПереключить;
		
		Если НаличиеПива Тогда
		
			СтруктураИдФайла.N4 = ЗначениеNПереключить;
		
		КонецЕсли;
		
		Если ТабакИПроизводные Тогда
			
			СтруктураИдФайла.N5 = ЗначениеNПереключить;
			
		КонецЕсли;  
		
		Если НаличиеНефтепродуктов Тогда
		
			СтруктураИдФайла.N6 = ЗначениеNПереключить;
		
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры

// Функция - формирует структуру ИД файла передаточного документа
// 
// Возвращаемое значение:
// 	Структура - структура параметров 
//		N2 - Прослеживаемость
//		N3 - Маркировка
//		N4 - Пиво и напитки, изготавливаемые на основе пива, слабоалкогольные напитки 
//		N5 - Один из видов продукции ИСМП
//		N6 - Нефтепродукты
//
&НаКлиенте
Функция СтруктураИдФайлаПередаточногоДокумента() Экспорт
	
	СтруктураИдентификаторов = Новый Структура;
	
	СтруктураИдентификаторов.Вставить("N2", "0");  
	СтруктураИдентификаторов.Вставить("N3", "0");
    СтруктураИдентификаторов.Вставить("N4", "0"); 
	СтруктураИдентификаторов.Вставить("N5", "0");
	СтруктураИдентификаторов.Вставить("N6", "0");
	
	Возврат СтруктураИдентификаторов; 
	
КонецФункции

// Функция возвращает описание идентификатора СБИС по ссылке 1С
//
// Параметры:
//  ДокументСсылка	 - Ссылка на документ 1С - Ссылка, на документ 1С, по которому требуется извлечь сведения о пакете
//  ДопПараметры	 - Структура			 - 
//		ИмяРегламента 		- Строка			- имя регламента, для доп. разреза хранения статусов, если есть
//		СтруктураРаздела	- РазделГО- структура раздела обработки, для авто. определения регламента.
// Возвращаемое значение:
//  Структура - ИдДокумента, ИдАккаунта
//
&НаКлиенте
Функция ПрочитатьСведенияОИдСБИСПоДокументу1С(ДокументСсылка, ДопПараметры=Неопределено) Экспорт
	Перем РазделГО, ИмяРегламентаДокумента;
	
	МассивСтатусРегламент	= ПолучитьЗначениеПараметраСбис("МассивСтатусРегламент");
	СтатусРегламент			= "";
	
	Если Не ДопПараметры = Неопределено Тогда
		ДопПараметры.Свойство("ИмяРегламента",		ИмяРегламентаДокумента);
		ДопПараметры.Свойство("СтруктураРаздела",	РазделГО);
	КонецЕсли;
	
	Если		ЗначениеЗаполнено(МассивСтатусРегламент)
		И		ПолучитьЗначениеПараметраСбис("СтатусыВРазрезеРегламента") Тогда
		
		Если		ЗначениеЗаполнено(ИмяРегламентаДокумента) Тогда
			Если НЕ	МассивСтатусРегламент.Найти(ИмяРегламентаДокумента) = Неопределено Тогда
				СтатусРегламент = ИмяРегламентаДокумента;
			КонецЕсли;
		ИначеЕсли	ЗначениеЗаполнено(РазделГО) Тогда
			// Взять от раздела
			ИниРеестра = ИниПоПараметрам(РазделГО.ТипДок);
			Если ИниРеестра.Свойство("мФайл") Тогда
				// Первый ини
				Для Каждого Файл из ИниРеестра.мФайл Цикл
					РегламентНазвание = ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.РассчитатьЗначение("Регламент_Название", Файл.Значение);
					Если НЕ МассивСтатусРегламент.Найти(РегламентНазвание) = Неопределено Тогда 
						СтатусРегламент = РегламентНазвание;
					КонецЕсли;
					Прервать;
				КонецЦикла;
			Иначе
				// В реестровой ини нет мФайл, считаем, как без регламента
			КонецЕсли;
		Иначе
			// Регламента нет
		КонецЕсли;
		
    КонецЕсли;
	
	ПараметрыПрочитатьСвойство = Новый Структура("ДокументСсылка, Регламент", ДокументСсылка, СтатусРегламент);
	
	фрм = ГлавноеОкно.СбисНайтиФормуФункции("СбисПрочитатьСведенияОПакете", ПолучитьЗначениеПараметраСбис("ИмяМодуляРаботыСоСтатусами"));
	Возврат фрм.СбисПрочитатьСведенияОПакете(ПараметрыПрочитатьСвойство, ГлавноеОкно.Кэш);

КонецФункции

// Функция - читает стороны по данным 1С
//
// Параметры:
//  ДанныеПрочитатьВходящие	 - Массив	 - Организации, Контрагенты по которым нужно получить данные
//  ДопПараметры			 - Структура - возможность расширить
// 
// Возвращаемое значение:
//  Соответствие - Ключ - ссылка на справочник, Значение - структура Ошибка/Результат(посчитанная сторона)
//
&НаКлиенте
Функция ПрочитатьСтороныПоДанным1С(ДанныеПрочитатьВходящие, ДопПараметры=Неопределено) Экспорт 
	Перем УзелИниВСоответствие;
	
	ИниКонфигурации = ИниПоПараметрам("Конфигурация");
	МодульФункций	= ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов;
	СоответствиеИни			= Новый Соответствие;
	СоответствиеПрочитать	= Новый Соответствие;
	СоответствиеРезультат	= Новый Соответствие;
	СоответствиеТипов		= Новый Соответствие;
	СоставПакета			= Новый СписокЗначений;
	// Распарсим файл ини.мСторона
	Если ИниКонфигурации.Свойство("мСторона") Тогда
		Для Каждого КлючИЗначение Из ИниКонфигурации.мСторона Цикл      
			СсылкаНаЭлемент = ПолучитьТипМетаданных(КлючИЗначение.Значение, "Сторона");      
			ИмяСправочника = СсылочныйТипСтрокой(СсылкаНаЭлемент);
			ИмяСправочника = СтрПолучитьСтроку(СтрЗаменить(ИмяСправочника, ".", Символы.ПС), 2);
			СоответствиеИни.Вставить(ИмяСправочника, КлючИЗначение.Значение);	
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого СсылкаДанные Из ДанныеПрочитатьВходящие Цикл
		ТипСсылки				= ТипЗнч(СсылкаДанные);
		ПредставлениеТипаСсылки	= СоответствиеТипов.Получить(ТипСсылки);
		ИмяИни					= "Участник";
		Если ПредставлениеТипаСсылки = Неопределено Тогда
			ПредставлениеТипаСсылки = МодульФункций.ПолучитьРеквизитМетаданныхОбъекта(СсылкаДанные, "Имя");
			СоответствиеТипов.Вставить(ТипСсылки, ПредставлениеТипаСсылки);
		КонецЕсли;
		УзелИниВСоответствие = СоответствиеИни.Получить(ПредставлениеТипаСсылки);
		Если УзелИниВСоответствие = Неопределено Тогда
			СбисФункция = "МодульОбъектаКлиент.ПрочитатьСтороныПоДанным1С";
			Детализация = "В файле настроек отсутствует узел для обработки участников " + ПредставлениеТипаСсылки;
			РезультатОшибка = НовыйСбисИсключение(, СбисФункция, , Детализация);
			СоответствиеРезультат.Вставить(СсылкаДанные, Новый Структура("Ошибка", РезультатОшибка));
			Продолжить;
		КонецЕсли;
		СоставПакета.Добавить(СсылкаДанные, ИмяИни);
		//ИдентификаторДокумента = СбисИдентификаторДокумента1С(СсылкаДанные, ИмяИни);
		СоответствиеПрочитать.Вставить(СсылкаДанные, Новый Структура("ИмяИни, ДокументДанные",ИмяИни, УзелИниВСоответствие));
	КонецЦикла;
	
	МодульФункций.ПолучитьДанныеДокументов1С(СоответствиеПрочитать, Новый Структура("ТекущийПакет",Новый Структура), СоставПакета);

	Для Каждого Элемент Из СоответствиеПрочитать Цикл
		Сторона = МодульФункций.ПолучитьСторону(ГлавноеОкно.Кэш, Элемент.Значение.ДокументДанные);     
		Если Сторона = Неопределено Тогда
			РезультатОшибка	= НовыйСбисИсключение(721, "МодульОбъектаКлиент.ПрочитатьСтороныПоДанным1С",,,"У " + Элемент.Ключ + " не заполнен ИНН/КПП");
			СоответствиеРезультат.Вставить(Элемент.Ключ, Новый Структура("Ошибка", РезультатОшибка));
		Иначе
			СоответствиеРезультат.Вставить(Элемент.Ключ, Новый Структура("Результат", Сторона));
		КонецЕсли;
	КонецЦикла;
	Возврат СоответствиеРезультат;

КонецФункции

// Функция определяет тип идентификационного номера налогоплательцика, с учетом региональной особенности
//
// Параметры:
//  ИдентификационныйНомер	 - Строка	- идентификациооный номер стороны, определяемый ини файлом
// 
// Возвращаемое значение:
//  Структура - Ключ - строка, тип идентификациооного номера. Значение - булево, если определили тип, возвращаем Истина, если нет - Ложь.
//
&НаКлиенте
Функция ОпределитьТипИдентификационногоНомера(ИдентификационныйНомер) Экспорт
		
	СоставИдентификационныхНомеров = ПолучитьСоставИдентификационныхНомеров();
	
	ЭтоИНН = СбисИННСоответствуетТребованиямБезТипа(ИдентификационныйНомер)
		Или НЕ ЗначениеЗаполнено(ИдентификационныйНомер)
		Или СбисУНПСоответствуетТребованиям(ИдентификационныйНомер, Истина);
		
	Если ЭтоИНН Тогда
		СоставИдентификационныхНомеров.ИНН = Истина;
		Возврат СоставИдентификационныхНомеров;
	КонецЕсли;	
	
	ПроверочноеЧисло = Сред(ИдентификационныйНомер, 5, 1);	
		
	Если Найти("45", ПроверочноеЧисло) Тогда
		СоставИдентификационныхНомеров.БИН = Истина;
		Возврат СоставИдентификационныхНомеров;
	КонецЕсли;
	
	Если Найти("0123", ПроверочноеЧисло) Тогда
		СоставИдентификационныхНомеров.ИИН = Истина;
		Возврат СоставИдентификационныхНомеров;
	КонецЕсли;
	
	Возврат СоставИдентификационныхНомеров;
	
КонецФункции  

// Функция, по длине идентификационного номера, определяет тип лица и проверяет соответствие ИНН требованиям.
//
// Параметры:
//  ИНН 	- Строка - проверяемый индивидуальный номер налогоплательщика.
//
// Возвращаемое значение:
//  Булево	- Истина, если соответствует.
//
&НаКлиенте
Функция СбисИННСоответствуетТребованиямБезТипа(Знач ИНН) Экспорт
	
	ИННСтр = СокрЛП(ИНН);
	ДлинаИНН =  СтрДлина(ИННСтр);
	
	Если ДлинаИНН = 10 Тогда
		ЭтоЮридическоеЛицо = Истина;
	ИначеЕсли ДлинаИНН = 12 Тогда
		ЭтоЮридическоеЛицо = Ложь;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат СбисИННСоответствуетТребованиям(ИНН, ЭтоЮридическоеЛицо);
	
КонецФункции

// Функция проверяет соответствие ИНН требованиям.
//
// Параметры:
//  ИНН                - Строка - проверяемый индивидуальный номер налогоплательщика.
//  ЭтоЮридическоеЛицо - Булево - признак, является ли владелец ИНН юридическим лицом.
//
// Возвращаемое значение:
//  Булево - Истина, если соответствует.
//
&НаКлиенте
Функция СбисИННСоответствуетТребованиям(Знач ИНН, ЭтоЮридическоеЛицо) Экспорт

	СоответствуетТребованиям = Истина;
	
	ИНН      = СокрЛП(ИНН);
	ДлинаИНН = СтрДлина(ИНН);

	Если ЭтоЮридическоеЛицо = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;  
	
	ТолькоЦифрыВСтроке = СбисТолькоЦифрыВСтроке(ИНН);
	
	Если НЕ ТолькоЦифрыВСтроке Тогда
		СоответствуетТребованиям = Ложь;
	КонецЕсли;

	Если  ЭтоЮридическоеЛицо И ДлинаИНН <> 10 Тогда
		СоответствуетТребованиям = Ложь;
	ИначеЕсли НЕ ЭтоЮридическоеЛицо И ДлинаИНН <> 12 Тогда
		СоответствуетТребованиям = Ложь;  
	Иначе
		//
	КонецЕсли;

	Если НЕ СоответствуетТребованиям Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ЭтоЮридическоеЛицо Тогда

		КонтрольнаяСумма = 0;

		Для Индекс = 1 По 9 Цикл

			Если Индекс = 1 Тогда
				Множитель = 2;
			ИначеЕсли Индекс = 2 Тогда
				Множитель = 4;
			ИначеЕсли Индекс = 3 Тогда
				Множитель = 10;
			ИначеЕсли Индекс = 4 Тогда
				Множитель = 3;
			ИначеЕсли Индекс = 5 Тогда
				Множитель = 5;
			ИначеЕсли Индекс = 6 Тогда
				Множитель = 9;
			ИначеЕсли Индекс = 7 Тогда
				Множитель = 4;
			ИначеЕсли Индекс = 8 Тогда
				Множитель = 6;
			ИначеЕсли Индекс = 9 Тогда
				Множитель = 8;
			Иначе
				//
			КонецЕсли;

			Цифра = Число(Сред(ИНН, Индекс, 1));
			КонтрольнаяСумма = КонтрольнаяСумма + Цифра * Множитель;

		КонецЦикла;
		
		КонтрольныйРазряд = (КонтрольнаяСумма %11) %10;

		Если КонтрольныйРазряд <> Число(Сред(ИНН, 10, 1)) Тогда
			СоответствуетТребованиям = Ложь;
		КонецЕсли;

	Иначе

		КонтрольнаяСумма11 = 0;
		КонтрольнаяСумма12 = 0;

		Для Индекс = 1 По 11 Цикл

			// Расчет множителя для 11-го и 12-го разрядов.
			Если Индекс = 1 Тогда
				Множитель11 = 7;
				Множитель12 = 3;
			ИначеЕсли Индекс = 2 Тогда
				Множитель11 = 2;
				Множитель12 = 7;
			ИначеЕсли Индекс = 3 Тогда
				Множитель11 = 4;
				Множитель12 = 2;
			ИначеЕсли Индекс = 4 Тогда
				Множитель11 = 10;
				Множитель12 = 4;
			ИначеЕсли Индекс = 5 Тогда
				Множитель11 = 3;
				Множитель12 = 10;
			ИначеЕсли Индекс = 6 Тогда
				Множитель11 = 5;
				Множитель12 = 3;
			ИначеЕсли Индекс = 7 Тогда
				Множитель11 = 9;
				Множитель12 = 5;
			ИначеЕсли Индекс = 8 Тогда
				Множитель11 = 4;
				Множитель12 = 9;
			ИначеЕсли Индекс = 9 Тогда
				Множитель11 = 6;
				Множитель12 = 4;
			ИначеЕсли Индекс = 10 Тогда
				Множитель11 = 8;
				Множитель12 = 6;
			ИначеЕсли Индекс = 11 Тогда
				Множитель11 = 0;
				Множитель12 = 8; 
			Иначе
				//
			КонецЕсли;

			Цифра = Число(Сред(ИНН, Индекс, 1));
			КонтрольнаяСумма11 = КонтрольнаяСумма11 + Цифра * Множитель11;
			КонтрольнаяСумма12 = КонтрольнаяСумма12 + Цифра * Множитель12;

		КонецЦикла;

		КонтрольныйРазряд11 = (КонтрольнаяСумма11 %11) %10;
		КонтрольныйРазряд12 = (КонтрольнаяСумма12 %11) %10;

		Если КонтрольныйРазряд11 <> Число(Сред(ИНН, 11, 1)) Или КонтрольныйРазряд12 <> Число(Сред(ИНН, 12, 1)) Тогда
			СоответствуетТребованиям = Ложь;
		КонецЕсли;

	КонецЕсли;

	Возврат СоответствуетТребованиям;

КонецФункции 


&НаКлиенте
Функция ПолучитьСоставИдентификационныхНомеров()
	
	Результат = Новый Структура;
	Результат.Вставить("ИНН", Ложь);	
	Результат.Вставить("БИН", Ложь);	
	Результат.Вставить("ИИН", Ложь);	
	
	Возврат Результат;
	
КонецФункции

// Функция проверяет, содержит ли строка только цифры.
//
// Параметры:
//  Значение         - Строка - проверяемая строка.
//  ПробелыЗапрещены - Булево - если Ложь, то в строке допустимо наличие пробелов.
//
// Возвращаемое значение:
//   Булево - Истина - строка содержит только цифры или пустая, Ложь - строка содержит иные символы.
//
&НаКлиенте
Функция СбисТолькоЦифрыВСтроке(Знач Значение, ПробелыЗапрещены = Истина) Экспорт
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПробелыЗапрещены Тогда
		Значение = СтрЗаменить(Значение, " ", "");
	КонецЕсли;
		
	Если СтрДлина(Значение) = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Если содержит только цифры, то в результате замен должна быть получена пустая строка.
	// Проверять при помощи ПустаяСтрока нельзя, так как в исходной строке могут быть пробельные символы.
	Возврат СтрДлина(
		СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить(
		СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( 
			Значение, "0", ""), "1", ""), "2", ""), "3", ""), "4", ""), "5", ""), "6", ""), "7", ""), "8", ""), "9", "")) = 0;
	
КонецФункции

// Функция проверяет соответствие УНП требованиям.
//
// Параметры:
//  УНП                - Строка - проверяемый индивидуальный номер налогоплательщика.
//  ЭтоЮридическоеЛицо - Булево - признак, является ли владелец УНП юридическим лицом.
//
// Возвращаемое значение:
//  Булево - Истина, если соответствует.
//
&НаКлиенте
Функция СбисУНПСоответствуетТребованиям(Знач УНП, ЭтоЮридическоеЛицо) Экспорт
	
	УНП = СокрЛП(УНП); 
	ДлинаУНП = СтрДлина(УНП); 
	КорректнаяДлинаУНП = 9;
	Знаменатель = 11;
	
	Если НЕ СбисТолькоЦифрыВСтроке(УНП) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ДлинаУНП = КорректнаяДлинаУНП 
		И ЭтоЮридическоеЛицо Тогда
		
		КонтрольнаяСумма = 0;
		
		Для Индекс = 1 По 8 Цикл
			
			Множитель = ПолучитьМножительПоИндексу(Индекс);	
			Цифра = Число(Сред(УНП, Индекс, 1));
			КонтрольнаяСумма = КонтрольнаяСумма + Цифра * Множитель;
			
		КонецЦикла;
		
		КонтрольныйРазряд = (КонтрольнаяСумма % Знаменатель);
		
		Если КонтрольныйРазряд <> Число(Сред(УНП, 9, 1)) 
			Или КонтрольныйРазряд = 10 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли ДлинаУНП = КорректнаяДлинаУНП 
		И НЕ ЭтоЮридическоеЛицо Тогда
		
		КонтрольнаяСумма = 0;
		
		Для Индекс = 1 По 8 Цикл 
			
			Множитель = ПолучитьМножительПоИндексу(Индекс); 
			Буква = Сред(УНП, Индекс, 1); 
			 
			Цифра = ПолучитьКонтрольнуюЦифру(Индекс, Буква); 
			
			Если Цифра = Ложь Тогда
				Цифра = Число(Сред(УНП, Индекс, 1));  
			КонецЕсли;		
						
			КонтрольнаяСумма = КонтрольнаяСумма + Цифра * Множитель;
			
		КонецЦикла;
		
		КонтрольныйРазряд = (КонтрольнаяСумма % Знаменатель);
		
		Если КонтрольныйРазряд <> Число(Сред(УНП, 9, 1)) 
			Или КонтрольныйРазряд = 10 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;	
	
КонецФункции  

&НаКлиенте
Функция ПолучитьМножительПоИндексу(Индекс)     
	
	МассивМножителей = Новый Массив;
	
	МассивМножителей.Добавить(29);
	МассивМножителей.Добавить(23);
	МассивМножителей.Добавить(19);
	МассивМножителей.Добавить(17);
	МассивМножителей.Добавить(13);
	МассивМножителей.Добавить(7);
	МассивМножителей.Добавить(5);
	МассивМножителей.Добавить(3);  
	
	Если МассивМножителей.Количество() < Индекс Тогда
		Возврат Ложь;
	Иначе
		Возврат МассивМножителей[Индекс - 1];
	КонецЕсли;
			
КонецФункции    

&НаКлиенте
Функция ПолучитьКонтрольнуюЦифру(Индекс, Буква)  
	
	МассивИндексов = Новый Массив; 
	
	СоставПервичныхКлючей = Новый Соответствие;
	СоставПервичныхКлючей.Вставить("А", 10);
	СоставПервичныхКлючей.Вставить("В", 11); 
	СоставПервичныхКлючей.Вставить("С", 12);
	СоставПервичныхКлючей.Вставить("Е", 14);
	СоставПервичныхКлючей.Вставить("Н", 17);
	СоставПервичныхКлючей.Вставить("К", 10);
	СоставПервичныхКлючей.Вставить("М", 22); 
	
	СоставВторичныхКлючей = Новый Соответствие; 
	СоставВторичныхКлючей.Вставить("А", 0);
	СоставВторичныхКлючей.Вставить("В", 1); 
	СоставВторичныхКлючей.Вставить("С", 2);
	СоставВторичныхКлючей.Вставить("Е", 3);
	СоставВторичныхКлючей.Вставить("Н", 4);
	СоставВторичныхКлючей.Вставить("К", 5);
	СоставВторичныхКлючей.Вставить("М", 6); 
	СоставВторичныхКлючей.Вставить("О", 7);
	СоставВторичныхКлючей.Вставить("Р", 8);
	СоставВторичныхКлючей.Вставить("Т", 9); 

	
	МассивИндексов.Добавить(СоставПервичныхКлючей);
	МассивИндексов.Добавить(СоставВторичныхКлючей);
	
	Если МассивИндексов.Количество() < Индекс Тогда
		Возврат Ложь;
	Иначе
		Возврат МассивИндексов[Индекс - 1].Получить(Буква);
	КонецЕсли;
			
КонецФункции

// Функция - возвращает тип формируемого документа
//
// Параметры:
//  ПараметрыРасчета - Структура	 -  Набор параметров для расчета типа формируемого документа
//  ДопПараметры	 - Структура	 -  Набор параметров для расширения работы функции
// 
// Возвращаемое значение:
//  Структура - Результат работы функции (Тип и Подтип пакета)
//
&НаКлиенте
Функция ТипФормируемогоДокумента(ИниТекущегоРаздела, ДопПараметры = Неопределено) Экспорт
	
	МодульФункций		= МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	
	// Тип по-умолчанию
	ТипПакета	= "ДокОтгрИсх";
	ТипыПакета	= МодульФункций.РассчитатьЗначение("РеестрСБИС_Тип", ИниТекущегоРаздела);
	
	Если Не ТипыПакета = Неопределено Тогда
		
		МассивТипов = СбисРазложитьСтрокуВМассивПодстрок(ТипыПакета, ",");
		Если МассивТипов.Количество() Тогда
			
			ТипПакета = МассивТипов[0];
			
		КонецЕсли;
		
	КонецЕсли;
	ПодтипПакета = МодульФункций.РассчитатьЗначение("РеестрСБИС_Подтип", ИниТекущегоРаздела);
	
	Возврат Новый Структура("ТипПакета, ПодтипПакета", ТипПакета, ПодтипПакета);
	
КонецФункции

// Функция готовит структуру пакета электронных документов по комплекту документов 1С для просмотра и отправки контрагентам.
// Т.к. по одной строке документов 1С может быть сформировано несколько комплектов (оказание услуги), то структуры пакетов добавляются в массив.
//
// Параметры:
//  СтрокаСпискаДокументов	 - ДанныеФормыЭлементКоллекции - Параметры для формирования электронного документа
//  ДопПараметры			 - Структура - Набор расширений работы функции
// 
// Возвращаемое значение:
//  Массив - Набор сгенерированных пакетов
//
&НаКлиенте
Функция ЗапуститьПодготовкуДокументаСбисПоДанным1С(СтрокаСпискаДокументов, ДопПараметры) Экспорт 
	Перем ВерсияФормирования, ЗначениеИниТекущегоРеестра, ЗначениеИниПервогоДокумента, НеЗапускатьВДокументооборот, ОбработкаСвязанногоВложения;
	
	Кэш				= ПолучитьТекущийЛокальныйКэш(); 
	МодульФункций	= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
		
	МассивПакетов	= Новый Массив;
	
	ВерсияФормирования			= 1;
	ВнешниеФайлы				= Новый Массив;
	МассивСтатусРегламент		= ПолучитьЗначениеПараметраТекущегоСеанса("МассивСтатусРегламент");

	Если ТипЗнч(СтрокаСпискаДокументов) = Тип("Структура") И СтрокаСпискаДокументов.Свойство("ИмяИни") Тогда 
		ИниТекущегоРеестра			= СтрокаСпискаДокументов.ИмяИни;
	Иначе 
		ВыбранныйРазделГенерации	= Кэш.Текущий;       
		ИниТекущегоРеестра			= РазделГО_Получить(ВыбранныйРазделГенерации, "ИмяИни");
	КонецЕсли;

	Если ЗначениеЗаполнено(ИниТекущегоРеестра) Тогда
		
		// Отправка идет от РазделГО
		ЗначениеИниТекущегоРеестра	= Кэш.ФормаНастроек.Ини(Кэш, ИниТекущегоРеестра);
		Если ЗначениеЗаполнено(ЗначениеИниТекущегоРеестра) Тогда
			
			НеЗапускатьВДокументооборот = МодульФункций.РассчитатьЗначение("НеЗапускатьВДокументооборот", ЗначениеИниТекущегоРеестра, Кэш);
			
		КонецЕсли;
		
	КонецЕсли;  
	
	Если	ТипЗнч(СтрокаСпискаДокументов) = Тип("Структура") Тогда
		
		Если СтрокаСпискаДокументов.Свойство("ВерсияФормирования") Тогда
		
			ВерсияФормирования = СтрокаСпискаДокументов.ВерсияФормирования;
			
		КонецЕсли;
		
		// На основании для генерации пакета передан признак принудительного отключения запуска в ДО. в приоритете, даже если через ини получилось другое
		Если СтрокаСпискаДокументов.Свойство("НеЗапускатьВДокументооборот") Тогда
		
			НеЗапускатьВДокументооборот = СтрокаСпискаДокументов.НеЗапускатьВДокументооборот;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВерсияФормирования = 1 Тогда
				
		// Костылище с переопределением каталога обмена от реестра. Оставлено для старой отправки.
		Если Не ЗначениеИниТекущегоРеестра = Неопределено
			И	ЗначениеИниТекущегоРеестра.Свойство("КаталогОбмена") Тогда
			
			Кэш.ФормаОтправки = Кэш.ГлавноеОкно.сбисПолучитьФорму("ИнтеграцияКаталог");
			Кэш.Парам.КаталогОбмена = Кэш.ОбщиеФункции.РассчитатьЗначение("КаталогОбмена", ЗначениеИниТекущегоРеестра, Кэш);
			
		Иначе
			
			Кэш.ФормаОтправки = Кэш.Интеграция;
			
		КонецЕсли;
	
	КонецЕсли;
	
	ОшибкаРазбора = Ложь;
	Попытка
		
		ПараметрыГенерации	= Новый Структура("БолванкаДляПакетов, ИмяИни", СтрокаСпискаДокументов.СоставПакета, ИниТекущегоРеестра);
		НаборПакетов		= НовыйНаборПакетов(ПараметрыГенерации, ДопПараметры);
		
		НаборПакетов_Вставить(НаборПакетов, СтрокаСпискаДокументов.СоставПакета, "СоставПакета1С");
		НаборПакетов_Прочитать(НаборПакетов);
		
		Для Каждого ОписаниеОшибки Из НаборПакетов.Данные.Ошибки Цикл
		
			ОшибкаРазбора = Истина;
			ПараметрыДляПакет = Новый Структура("Ошибка, ОснованиеПакета", ОписаниеОшибки.Ошибка);
			
			Если Не ОписаниеОшибки.Свойство("Основание", ПараметрыДляПакет.ОснованиеПакета) Тогда
				
				ПараметрыДляПакет.ОснованиеПакета = НаборПакетов.Параметры.ОснованиеСсылка;
				
			КонецЕсли;
			
			МассивПакетов.Добавить(НовыйСоставПакета(ПараметрыДляПакет));
		
		КонецЦикла;
		
	Исключение
		
		ОшибкаРазбора		= Истина;
		ОшибкаПодготовки	= НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ЗапуститьПодготовкуДокументаСбисПоДанным1С");
		СоставПакета = НовыйСоставПакета(Новый Структура("ОснованиеПакета, Ошибка", СтрокаСпискаДокументов.СоставПакета[0].Значение, ОшибкаПодготовки));
		МассивПакетов.Добавить(СоставПакета);
		
	КонецПопытки;
		
	Если ОшибкаРазбора Тогда
		
		Если Кэш.Свойство("РезультатОтправки") Тогда
			
			Возврат МассивПакетов;

		КонецЕсли;
		
		// Если не массовая операция, то сообщаем накопленный пул ошибок.
		Для Каждого ОшибкаРазбора Из МассивПакетов Цикл
			
			СообщитьСбисИсключение(ОшибкаРазбора.Ошибка, Новый Структура("Отправлять", Ложь));
			
		КонецЦикла;
		
	КонецЕсли;	
		
	Если Кэш.Свойство("РезультатОтправки") Тогда
		
		ВремяОбработкиПакетов	= (НаборПакетов.Статистика.ВремяЧтенияИни + НаборПакетов.Статистика.ВремяОбработкиКодом) / 1000;
		Кэш.РезультатОтправки.ВремяПолученияДанных = Кэш.РезультатОтправки.ВремяПолученияДанных + ВремяОбработкиПакетов;
				
	КонецЕсли;
	
	МодульРаздела = НайтиФункциюСеансаОбработки("ТипФормируемогоДокумента", Кэш.Текущий.ФормыРаздела);  	
	ПараметрыРасчетаТипа = Новый Структура("ИниТекущегоРаздела, ИниДокумента", ЗначениеИниТекущегоРеестра, ЗначениеИниПервогоДокумента); 
	
	Если ЗначениеИниТекущегоРеестра = Неопределено Тогда
		
		ЗначениеИниТекущегоРеестра = ИниПоПараметрам(НаборПакетов.Параметры.ИмяИни);
		
	КонецЕсли;
	
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	ТипФормируемогоДокумента = ТипФормируемогоДокумента(ЗначениеИниТекущегоРеестра);
	ДопПараметры.Свойство("ОбработкаСвязанногоВложения", ОбработкаСвязанногоВложения);
	
	ПараметрыГенерацииПакетов = Новый Структура("Кэш", Кэш);
	ПараметрыГенерацииПакетов.Вставить("ОснованиеПакета",				НаборПакетов.Параметры.ОснованиеСсылка);
	ПараметрыГенерацииПакетов.Вставить("СтатусыРегламентов",			МассивСтатусРегламент);
	ПараметрыГенерацииПакетов.Вставить("Тип",							ТипФормируемогоДокумента.ТипПакета);
	ПараметрыГенерацииПакетов.Вставить("ИмяИни",						ИниТекущегоРеестра);
	ПараметрыГенерацииПакетов.Вставить("НеЗапускатьВДокументооборот",	ОписаниеТипаБулево.ПривестиЗначение(НеЗапускатьВДокументооборот));
	ПараметрыГенерацииПакетов.Вставить("ОбработкаСвязанногоВложения",	ОбработкаСвязанногоВложения);
	Если ЗначениеЗаполнено(ТипФормируемогоДокумента.ПодтипПакета) Тогда
		ПараметрыГенерацииПакетов.Вставить("ПодТип", ТипФормируемогоДокумента.ПодтипПакета);
	КонецЕсли;
	
	Для Каждого Пакет Из НаборПакетов.Данные.ПрочитанныеПакеты Цикл
		
		РезультатГенерации = СгенерироватьИсходящийПакет(Пакет, ПараметрыГенерацииПакетов);
		
		Если РезультатГенерации.Ошибки.Количество() Тогда
			
			//В пакете ошибки. Дальнейшее выполнение не имеет смысла
			Если Кэш.Свойство("РезультатОтправки") Тогда

				//Идёт отправка, добавить в пакет первую ошибку, с ней и упадём в отправке. При необходимости сделать в разрезе конкретного документа 1С, сделать нормальный проброс ошибок
				Для Каждого КлючИЗначение Из РезультатГенерации.Ошибки Цикл
					
					РезультатГенерации.ПолныйСоставПакета.Вставить("Ошибка", КлючИЗначение.Значение);
					Прервать;
					
				КонецЦикла;
				
			Иначе
				Для Каждого КлючИЗначение Из РезультатГенерации.Ошибки Цикл
					//Показываем первое сообщение, старая логика
					Кэш.ГлавноеОкно.СбисСообщитьОбОшибке(Кэш, КлючИЗначение.Значение, Новый Структура("Отправлять", Ложь));
					Прервать;
				КонецЦикла;
				Продолжить;//Просто сообщить, этого вполне достаточно.
			КонецЕсли;
		КонецЕсли;
		МассивПакетов.Добавить(РезультатГенерации.ПолныйСоставПакета);
	КонецЦикла;
	
	Возврат МассивПакетов;  
	
КонецФункции  

// Функция - генерирует состав пакета с заголовками на основании подготовленных данных
//
// Параметры:
//  ПараметрыВходящие			 - Структура -
//		Вложение						 - Массив			 - Список вложений для формирования документа СБИС
//		Конверт							 - КонвертСБИС(Н)	 - Структура для формирования документа СБИС
//		ПользовательскийИдентификатор	 - Строка(Н)		 - Задаваемый идентификатор для формируемого документа
//	ПараметрыГенерацииПакета	 - Структура -
//		НеЗапускатьВДокументооборот		 - Булево			 - признак проведения документа в СБИС после записи
//		Тип                     	     - Строка			 - Тип в заголовок формируемого пакета. Если на входящем пакете указан Конверт, то игнорируется.
//		ПодТип                	  	     - Строка			 - ПодТип в заголовок формируемого пакета. Если на входящем пакете указан Конверт, то игнорируется.
//		ОснованиеПакета	        	     - ДокументСсылка	 - основной документ пакета
//		Кэш                     	     - Структура		 - кэш обработки
//		Коверт							 - КонвертСБИС		 - Структура для формирования документа СБИС
//
// Возвращаемое значение:
//  Структура - 
//		Ошибки				- Соответствие	- ошибки в процессе, где ключ - ссылка на документ 1С
//		ПолныйСоставПакета	- Структура - готовый состав пакета с данными.
//
&НаКлиенте
Функция СгенерироватьИсходящийПакет(ПараметрыВходящие, ПараметрыГенерацииПакета)
	Перем РегламентНазвание, ПолныйСоставПакета, ОснованиеДляПакета, ОбработкаСвязанногоВложения; 
	
	Результат		= Новый Структура("Ошибки, ПолныйСоставПакета", Новый Соответствие, Новый Структура);
	ОснованиеПакета	= ПараметрыГенерацииПакета.ОснованиеПакета;
	
	Если ПараметрыВходящие.Свойство("Ошибка", ОснованиеДляПакета) Тогда
		
		// В итоговом пакете прокинутая ошибка
		Результат.ПолныйСоставПакета = Новый Структура("Документ1С", ОснованиеПакета);
		Результат.Ошибки.Вставить(ОснованиеПакета, ОснованиеДляПакета);
		Возврат Результат;
		
	КонецЕсли;
		
	МодульФункций	= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	Кэш				= ПолучитьТекущийЛокальныйКэш();

	ПараметрыГенерацииПакета.Свойство("ОбработкаСвязанногоВложения", ОбработкаСвязанногоВложения);
	
	//Сгенерировать XML вложений
	ПараметрыГенерацииВложений	= Новый Структура;
	Если ТипЗнч(ОснованиеПакета) <> Тип("Структура") Тогда
		ПараметрыГенерацииВложений.Вставить("ОснованиеПакета",			ОснованиеПакета);
	КонецЕсли;
	ПараметрыГенерацииВложений.Вставить("НаборВложений",				ПараметрыВходящие.Вложение);
	ПараметрыГенерацииВложений.Вставить("Результат",					Результат);
	ПараметрыГенерацииВложений.Вставить("ОбработкаСвязанногоВложения", 	ОбработкаСвязанногоВложения);
	
	РезультатГенерации = СгенерироватьВложенияВПакет(ПараметрыГенерацииВложений, Кэш);

	Если Результат.Ошибки.Количество() Тогда
		
		Возврат Результат;
		
	ИначеЕсли ПараметрыВходящие.Свойство("Конверт", ОснованиеДляПакета) Тогда
		
		Если Не ОбъектSABY_ЭтоТип(ОснованиеДляПакета, "КонвертСБИС") Тогда
			
			ОснованиеДляПакета = НовыйКонвертСБИС(ОснованиеДляПакета);
			
		КонецЕсли;
		
	Иначе
		
		ОснованиеДляПакета	= РезультатГенерации[0];
		
	КонецЕсли;
				
	Если ПараметрыВходящие.Свойство("ПользовательскийИдентификатор") Тогда
		
		ПараметрыГенерацииПакета.Вставить("ПользовательскийИдентификатор", ПараметрыВходящие.ПользовательскийИдентификатор);
		
	КонецЕсли;
	
	Попытка
		
		Результат.ПолныйСоставПакета = НовыйСоставПакета(ОснованиеДляПакета, ПараметрыГенерацииПакета);
		
	Исключение
		
		ОшибкаГенерацияПакета = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.СгенерироватьИсходящийПакет");
		Результат.Ошибки.Вставить(ОснованиеПакета, ОшибкаГенерацияПакета);
		Возврат Результат;
		
	КонецПопытки;
	
	ПараметрыГенерацииПакета.Удалить("ПользовательскийИдентификатор");

	//Если явно задана ошибка, то заменим последнюю по основанию, если такая была.
	СоставПакета_Обновить(Результат.ПолныйСоставПакета, Новый Структура("Вложения", РезультатГенерации)); 
	Результат.ПолныйСоставПакета.Вставить("Вложение", РезультатГенерации);

	СписокФорм = Новый Массив;
	СписокФорм.Добавить("Документ_" + ПараметрыГенерацииПакета.ИмяИни);
	СписокФорм.Добавить("Документ_Шаблон");
	ТочкаВходаВФК = ПользовательскаяТочкаВхода("СбисПослеФормированияПакетаДокументов", СписокФорм, Кэш);
	Если Не ТочкаВходаВФК = Неопределено Тогда
		
		Результат.ПолныйСоставПакета = ВызватьПользовательскуюТочкуВхода(ТочкаВходаВФК, Результат.ПолныйСоставПакета);
		
	КонецЕсли;
		
	Возврат Результат;

КонецФункции

// Функция - генерирует вложения в пакет на основании подготовленных данных
//
// Параметры:
//  ПараметрыГенерацииВложений	 - Структура	 - 
//		Пакет			- Структура - данные генерируемого пакета
//		ОснованиеПакета - ДокумнтСсылка	- основной документ пакета
//	Кэш							- Структура		- кэш обработки
//
// Возвращаемое значение:
//  Массив		- сгенерированные вложения для пакета
//
&НаКлиенте
Функция СгенерироватьВложенияВПакет(ПараметрыГенерацииВложений, Кэш)
	
	СписокВложенийВПакет = Новый Массив;
	Для Каждого Вложение Из ПараметрыГенерацииВложений.НаборВложений Цикл
		Попытка
			ПараметрыГенерацииВложений.Вставить("Вложение", Вложение);
			НаборВложенийВПакет = СгенерироватьНаборВложенийВПакет(ПараметрыГенерацииВложений);
			Для Каждого ВложениеДобавить Из НаборВложенийВПакет Цикл
				СписокВложенийВПакет.Добавить(ВложениеДобавить);
			КонецЦикла;
		Исключение
			ИнфоОбОшибке= ИнформацияОбОшибке();
			КлючОшибки	= ?(Вложение.Свойство("Документ1С"), Вложение.Документ1С, ПараметрыГенерацииВложений.ОснованиеПакета);
			ПараметрыГенерацииВложений.Результат.Ошибки.Вставить(КлючОшибки, НовыйСбисИсключение(ИнфоОбОшибке, "РаботаСДокументами1С.СгенерироватьВложенияВПакет"));
		КонецПопытки;
	КонецЦикла;
	
	Если	Не СписокВложенийВПакет.Количество()
		И	Не ПараметрыГенерацииВложений.Результат.Ошибки.Количество() Тогда
		//Нет вложений и ошибок в явном виде. Значит это пустой пакет (не заполнены табличные части)
		Если Кэш.Свойство("РезультатОтправки") Тогда
			//Сгенерировать пустое вложение для детализации
			СписокВложенийВПакет.Добавить(НовыйВложениеСБИС(, ПараметрыГенерацииВложений));
		КонецЕсли;
		ОшибкаПодготовки = НовыйСбисИсключение
			(715103,"РаботаСДокументами1С.СгенерироватьВложенияВПакет",,, 
			"В документе " + Строка(ПараметрыГенерацииВложений.ОснованиеПакета) + 
			" не заполнены табличные части. Проверьте заполнение табличной части документа и корректность раздела отправки.");
		ПараметрыГенерацииВложений.Результат.Ошибки.Вставить(ПараметрыГенерацииВложений.ОснованиеПакета, ОшибкаПодготовки);
	КонецЕсли;
	
	Если ПараметрыГенерацииВложений.ОбработкаСвязанногоВложения <> Истина И Кэш.ДопВложение.Количество() Тогда
		Для Каждого Вложение Из Кэш.ДопВложение Цикл
			СписокВложенийВПакет.Добавить(НовыйВложениеСБИС(Вложение));
		Конеццикла;
	КонецЕсли;
	
	ПараметрыСтатистики = Новый Структура;
 	ПараметрыСтатистики.Вставить("Вложения", СписокВложенийВПакет);
	ПараметрыСтатистики.Вставить("Действие", "СформированыВложения");
	
	СбисСтатистика_СформироватьИЗаписать(ПараметрыСтатистики);

	Возврат СписокВложенийВПакет;

КонецФункции

