
// Функция - определяет, используется ли генератор для вложения
//
// Параметры:
//  ВложениеДанные	 - ВложениеСБИС	 - структура вложения
// 
// Возвращаемое значение:
//  Булево - Истина - используется, Ложь - не используется
//
&НаКлиенте
Функция ИспользоватьГенераторДляВложения(ВложениеДанные) Экспорт
	Перем ГенераторНаВложении;
	
	Результат = 	(	ВложениеДанные.Свойство("ИспользоватьГенератор",			ГенераторНаВложении)	// Генератор установлен для вложения старым способом
				Или	(	ВложениеДанные.Свойство("Параметры") 											// На случай нетипового вложения, добавленного кодом
					И	ВложениеДанные.Параметры.Свойство("ИспользоватьГенератор",	ГенераторНаВложении)))
			И	ГенераторНаВложении = Истина
			И	Не ВложениеСБИС_Получить(ВложениеДанные, "ТипXML") = "Генератор"; // Вложение уже сформировано генератором
			
	Возврат Результат;
			
КонецФункции

// Функция - Сформировать и применить подстановку по экземпляру вложения
//
// Параметры:
//  Вложение	 - Структура - экземпляр Вложение
//  ДопПараметры - Структура
//		ФормыПоиска - Массив альтернативных форм для поиска функций генератора.
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Функция СформироватьИПрименитьПодстановкуПоВложению(Вложение, ДопПараметры) Экспорт
	Перем СбисФормыПоиска;
	
	ОшибкаФормирования = Ложь;
	
	Попытка
		фрм = ГлавноеОкно.СбисНайтиФормуФункцииСеанса(ГлавноеОкно.Кэш, "СформироватьНаборПодстановок", ДопПараметры.ФормыПоиска, Новый Структура, ОшибкаФормирования);
		Если ОшибкаФормирования Тогда
			ВызватьСбисИсключение(фрм, "ГлавноеОкно.СбисНайтиФормуФункцииСеанса.СформироватьИПрименитьПодстановкуПоВложению");
		ИначеЕсли фрм = Ложь Тогда
			ВызватьСбисИсключение(779, "ГлавноеОкно.СбисНайтиФормуФункцииСеанса.СформироватьИПрименитьПодстановкуПоВложению",,,"Не удалось определить модуль для формирования подстановки");
		КонецЕсли;
		
		НаборПодстановок = фрм.СформироватьНаборПодстановок(Вложение, ДопПараметры);
		
		Если	ДопПараметры.Свойство("МассоваяОтправка")
			И	ДопПараметры.МассоваяОтправка Тогда
			Возврат НаборПодстановок.Получить("Генератор");	
		КонецЕсли;
		
		ПараметрыДокумента = Новый Структура("ВерсияФормата, ТипДокумента, ПодТип, ПодВерсияФормата");
		ПараметрыДокумента.ВерсияФормата 	= Вложение.ВерсияФормата;
		ПараметрыДокумента.ТипДокумента 	= Вложение.Тип;
		ПараметрыДокумента.ПодТип 			= Вложение.ПодТип;
		ПараметрыДокумента.ПодВерсияФормата = Вложение.ПодВерсияФормата;
		
		РезультатПодставновки = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.Интеграция_ФЭДМультиСгенерировать(
			ПараметрыДокумента, 
			НаборПодстановок, 
			Новый Структура("Кэш", ГлавноеОкно.Кэш));
			
		Возврат РезультатПодставновки;
		
	Исключение
		ВызватьСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.СформироватьИПрименитьПодстановкуПоВложению");
	КонецПопытки;
			
КонецФункции

