
// Функция - Прочитать документ СБИС
//
// Параметры:
//  ОписаниеДокументаСБИС	 - Структура/СоставПакета	 - документ СБИС, либо болванка с полем Идентификатор для вызова
//  ДопПараметры			 - Структура				 - 
// 
// Возвращаемое значение:
// СоставПакета  - прочитанный документ СБИС. Кидает СбисИсключение при ошибке
//
&НаКлиенте
Функция ПрочитатьДокументСБИС(ОписаниеДокументаСБИС, ДопПараметры = Неопределено) Экспорт
	Перем НаборВложенийРазбор;
	
	Если	ТипЗнч(ОписаниеДокументаСБИС) = Тип("Строка")  Тогда
		
		ИдДок	= ОписаниеДокументаСБИС;
		
	Иначе
		
		ИдДок	= ОписаниеДокументаСБИС.Идентификатор;
		
	КонецЕсли;
	
	Если ДопПараметры = Неопределено Тогда
		
		// Параметры по-умолчанию
		ДопПараметры = Новый Структура;
		
	КонецЕсли;
	
	Если ДопПараметры.Свойство("ПерегенерироватьВложения") И ДопПараметры.ПерегенерироватьВложения Тогда
		ПараметрыЧтения = Новый Структура("Идентификатор, ДопПоля", Строка(ИдДок), "ЭтапВернутьВсеСертификаты,Лицо2,Лицо3");	
	Иначе
		ПараметрыЧтения = Новый Структура("Идентификатор, ДопПоля", Строка(ИдДок), "ЭтапВернутьВсеСертификаты,Лицо2,Лицо3,НеПерегенерироватьВложения");
	КонецЕсли;
	
	Если ДопПараметры.Свойство("Этап") Тогда
		
		ПараметрыЧтения.Вставить("Этап", ДопПараметры.Этап);
		
	КонецЕсли;
	
	Если Не ДопПараметры.Свойство("ДокументСБИС")
		И	ЭтоТипСбис(ОписаниеДокументаСБИС, "СоставПакета") Тогда
		
		ДопПараметры.Вставить("ДокументСБИС", ОписаниеДокументаСБИС);
		
	КонецЕсли;
	
	ДопПараметры.Вставить("ЕстьРезультат", Истина);
	
	Если	ПолучитьЗначениеПараметраСБИС("ПоддержкаОбменаЕИС")
		И	ДопПараметры.Свойство("РеализацияЕИС")
		И	ДопПараметры.РеализацияЕИС Тогда
		
		ПараметрыЧтения.ДопПоля = ПараметрыЧтения.ДопПоля + ",Расширение,ЕИС";
		ДопПараметры.Удалить("РеализацияЕИС");
		
	КонецЕсли;
	
	ИнтеграцияМодуль	= ПараметрSABY("Интеграция", "Сеанс");
	ОшибкаЧтения		= Ложь;
	
	оДокумент			= ИнтеграцияМодуль.СБИС_ПрочитатьДокумент(ПолучитьТекущийЛокальныйКэш(), ПараметрыЧтения, ДопПараметры, ОшибкаЧтения);
	Если	ОшибкаЧтения Тогда
		
		ОшибкаПолученияДокумента = НовыйСбисИсключение(оДокумент, "МодульОбъектаКлиент.ПрочитатьДокументСБИС");
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаПолученияДокумента);
		
	КонецЕсли;
	
	СоставПакета_ПослеПрочитатьДокумент(оДокумент, ДопПараметры);
	
	Возврат оДокумент;
	
КонецФункции

// Функция - Сбис получить список документов
//
// Параметры:
//  ПараметрыСписка	 - Структура - основные параметры списка:
//						- Фильтр - (не обязательный) фильтр событий - если хотите сформировать фильтр извне
//  ДопПараметры	 - Структура - дополнительные параметры
// 
// Возвращаемое значение:
//   - Структура:	 - Таблица_РеестрДокументов - Массив - документы с онлайна
//
&НаКлиенте
Функция ПолучитьСписокДокументовСБИС(ПараметрыСписка = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Отказ = Ложь;
	
	СписокДокументов		= Новый Структура("Таблица_РеестрДокументов", Новый Массив);
	лСведенияОбИнтеграции	= ПолучитьЗначениеПараметраТекущегоСеанса("СведенияОбИнтеграции").Параметры;
	
	Если		лСведенияОбИнтеграции.Свойство("РеестрыSABY")
		И	Не	лСведенияОбИнтеграции.РеестрыSABY Тогда
		
		Возврат СписокДокументов;
		
	КонецЕсли;
	
	Кэш	= ПолучитьТекущийЛокальныйКэш();
	ГлавноеОкно = Кэш.ГлавноеОкно;    
	
	НаборФормПоиска = Кэш.Текущий.ОписаниеРаздела.ФормыРаздела;
		
	Если Не ЗначениеЗаполнено(ПараметрыСписка) Тогда
		ПараметрыСписка = Новый Структура();
	КонецЕсли;
	Если Не ПараметрыСписка.Свойство("Фильтр") Тогда
		
		ДопФильтры = Новый Структура("Тип", Кэш.Текущий.ТипДок);
		ПараметрыСписка.Вставить("Фильтр", СформироватьФильтрДляРеестраОнлайна(ГлавноеОкно, Новый Структура("ДопФильтры", ДопФильтры)));
		
	КонецЕсли;
	
	ГлавноеОкно.ОтметитьВсе = Ложь;
	
	СтраницаНаФорме = ПараметрыСписка.Фильтр.Навигация.Страница;
	РазмерСтраницы = Число(ПараметрыСписка.Фильтр.Навигация.РазмерСтраницы); 
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	ДопПараметры.Вставить("ЕстьРезультат", Истина); 
	ДопПараметры.Вставить("ЭтоПерваяИтерация", Истина);
    ДопПараметры.Вставить("РазмерСтраницы", РазмерСтраницы);
	
	МаксимумДокументовЗаРаз	= РазмерСтраницы;
	ЧислоИтераций		= 1;
	Если РазмерСтраницы > 50 Тогда
		МаксимумДокументовЗаРаз	= 50;
		// Предполагается, что размер страницы > 50 может быть только кратным 50, чтобы правильно указать номер страницы
		ЧислоИтераций		= РазмерСтраницы / МаксимумДокументовЗаРаз;
	КонецЕсли;

	МассивДокументов = Новый Массив;
	НомерСтраницы = Число(СтраницаНаФорме) * ЧислоИтераций;
	СтруктураСпискаДокументов = Новый Структура();
	Для i = 1 По ЧислоИтераций Цикл
		
		Если НЕ i = 1 Тогда 
			
			ДопПараметры.ЭтоПерваяИтерация = Ложь; 
			
		КонецЕсли;
			
		ПараметрыСписка.Фильтр.Навигация.Страница		= Строка(НомерСтраницы);
		ПараметрыСписка.Фильтр.Навигация.РазмерСтраницы	= Строка(МаксимумДокументовЗаРаз);
				
		МодульЗапросаСписка = НайтиФункциюСеансаОбработки("ОбработчикЗапросаСпискаДокументов", НаборФормПоиска);
		
		Если МодульЗапросаСписка = Ложь Тогда			
			РеестрДокументов = Кэш.Интеграция.СБИС_СписокДокументов(Кэш, ПараметрыСписка.Фильтр, ДопПараметры, Отказ); 	
		Иначе
			РеестрДокументов = МодульЗапросаСписка.ОбработчикЗапросаСпискаДокументов(Кэш, ПараметрыСписка.Фильтр, ДопПараметры, Отказ);	
		КонецЕсли;
		
		Если Отказ Тогда
			ПоказатьСостояниеSABY();
			Прервать;		
		КонецЕсли;  
		
		Если НЕ РеестрДокументов.Навигация.Количество() Тогда
			
			Если СтруктураСпискаДокументов.Свойство("Навигация") Тогда
				
				СтруктураСпискаДокументов.Навигация.ЕстьЕще = Ложь; 
				
			КонецЕсли;
			
			Прервать;
			
		КонецЕсли;
		
		СтруктураСпискаДокументов = РеестрДокументов;
		
		Для Каждого ДокОнлайна Из СтруктураСпискаДокументов.Документ Цикл
			МассивДокументов.Добавить(ДокОнлайна);
		КонецЦикла;
		
		ЕстьЕще =	СтруктураСпискаДокументов.Навигация.Свойство("ЕстьЕще") 
						И (ТипЗнч(СтруктураСпискаДокументов.Навигация.ЕстьЕще) = Тип("Строка") 
						И НРег(СтруктураСпискаДокументов.Навигация.ЕстьЕще) = "да"
						Или СтруктураСпискаДокументов.Навигация.ЕстьЕще = Истина);
		
		Если Не ЕстьЕще Тогда
			Прервать;
		КонецЕсли;  
				
		НомерСтраницы = НомерСтраницы + 1;
		
	КонецЦикла;

	Если МассивДокументов.Количество() Тогда
		СтруктураСпискаДокументов.Документ = МассивДокументов;
		// Сделано, чтобы дальше это выгялядело, как будто мы действительно могли получить >50 документов за раз
		СтруктураСпискаДокументов.Навигация.Вставить("Страница", СтраницаНаФорме);
		СтруктураСпискаДокументов.Навигация.РазмерСтраницы = РазмерСтраницы;
		
		СписокДокументов = Кэш.ОбщиеФункции.ОбработатьСписокДокументов(Кэш, СтруктураСпискаДокументов);
	КонецЕсли;
	
	Возврат СписокДокументов;
	
КонецФункции

// Функция - Сбис получить список документов отгрузки
//
// Параметры:
//  ПараметрыСписка	 - Структура - основные параметры списка:
//						- Фильтр - (не обязательный) фильтр событий - если хотите сформировать фильтр извне
//  ДопПараметры	 - Структура - дополнительные параметры
// 
// Возвращаемое значение:
//   - Структура:	 - Таблица_РеестрСобытий - Массив - документы с онлайна
//
&НаКлиенте
Функция ПолучитьСписокДокументовОтгрузкиСБИС(ПараметрыСписка = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Отказ = Ложь;
	СписокДокументов = Новый Структура("Таблица_РеестрСобытий", Новый Массив);
	
	Кэш	= ПолучитьТекущийЛокальныйКэш();
	ГлавноеОкно = Кэш.ГлавноеОкно;
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ВернутьОшибку", Истина);
		ДопПараметры.Вставить("СообщатьПриОшибке", Ложь);
	КонецЕсли;
	ДопПараметры.Вставить("ЕстьРезультат", Истина);
	
	Если Не ЗначениеЗаполнено(ПараметрыСписка) Тогда
		ПараметрыСписка = Новый Структура();
	КонецЕсли;
	Если Не ПараметрыСписка.Свойство("Фильтр") Тогда
		ПараметрыСписка.Вставить("Фильтр", Кэш.ОбщиеФункции.ПолучитьФильтрСобытий(Кэш, Новый Структура("Тип", Кэш.Текущий.ТипДок)));
	КонецЕсли;
	
	ГлавноеОкно.ОтметитьВсе = Ложь;
	
	СтраницаНаФорме = ПараметрыСписка.Фильтр.Навигация.Страница;
	РазмерСтраницы = Число(ПараметрыСписка.Фильтр.Навигация.РазмерСтраницы);
	
	МаксимумДокументовЗаРаз	= РазмерСтраницы;
	ЧислоИтераций		= 1;
	Если РазмерСтраницы > 50 Тогда
		МаксимумДокументовЗаРаз	= 50;
		// Предполагается, что размер страницы > 50 может быть только кратным 50, чтобы правильно указать номер страницы
		ЧислоИтераций		= РазмерСтраницы / МаксимумДокументовЗаРаз;
	КонецЕсли;

	МассивДокументов = Новый Массив;
	НомерСтраницы = Число(СтраницаНаФорме) * ЧислоИтераций;
	СтруктураСпискаДокументов = Новый Структура();
	Для i = 1 По ЧислоИтераций Цикл
		
		ПараметрыСписка.Фильтр.Навигация.Страница		= Строка(НомерСтраницы);
		ПараметрыСписка.Фильтр.Навигация.РазмерСтраницы	= Строка(МаксимумДокументовЗаРаз);
		
		СтруктураСпискаДокументов = Кэш.Интеграция.СБИС_СписокДокументов(Кэш, ПараметрыСписка.Фильтр, ДопПараметры, Отказ);
		Если Отказ Тогда		
			ПараметрыСообщения = Новый Структура("ФормаВладелец", ГлавноеОкно);
			СбисСообщить(СтруктураСпискаДокументов, ПараметрыСообщения);
			ГлавноеОкно.сбисСпрятатьСостояние();
			Прервать;
		КонецЕсли;
		
		Для Каждого ДокОнлайна Из СтруктураСпискаДокументов.Документ Цикл
			МассивДокументов.Добавить(ДокОнлайна);
		КонецЦикла;
		
		ЕстьЕще =	ТипЗнч(СтруктураСпискаДокументов.Навигация.ЕстьЕще) = Тип("Строка") И НРег(СтруктураСпискаДокументов.Навигация.ЕстьЕще) = "да"
					Или СтруктураСпискаДокументов.Навигация.ЕстьЕще = Истина;
		
		Если Не ЕстьЕще Тогда
			Прервать;
		КонецЕсли;
		
		НомерСтраницы = НомерСтраницы + 1;
		
	КонецЦикла;

	Если МассивДокументов.Количество() Тогда
		СтруктураСпискаДокументов.Документ = МассивДокументов;
		// Сделано, чтобы дальше это выгялядело, как будто мы действительно могли получить >50 документов за раз
		СтруктураСпискаДокументов.Навигация.Страница		= СтраницаНаФорме;
		СтруктураСпискаДокументов.Навигация.РазмерСтраницы	= РазмерСтраницы;
		
		СписокДокументов = Кэш.ОбщиеФункции.ОбработатьСписокДокументовОтгрузки(Кэш, СтруктураСпискаДокументов);
	КонецЕсли;
	
	Возврат СписокДокументов;
	
КонецФункции

// Функция - Сбис получить список событий
//
// Параметры:
//  ПараметрыСписка	 - Структура - основные параметры списка:
//						- Фильтр - (не обязательный) фильтр событий - если хотите сформировать фильтр извне
//						- ТипРеестра - тип реестра, по умолчанию "Входящие"
//  ДопПараметры	 - Структура - дополнительные параметры
// 
// Возвращаемое значение:
//   - Структура:	 - Таблица_РеестрСобытий - Массив - документы с онлайна
//
&НаКлиенте
Функция ПолучитьСписокДокументовПоСобытиямСБИС(ПараметрыСписка = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Отказ = Ложь;
	СписокДокументов = Новый Структура("Таблица_РеестрСобытий", Новый Массив);
	ТипРеестра = "Входящие";
	
	Кэш	= ПолучитьТекущийЛокальныйКэш();
	ГлавноеОкно = Кэш.ГлавноеОкно;
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ВернутьОшибку", Истина);
		ДопПараметры.Вставить("СообщатьПриОшибке", Ложь);
	КонецЕсли;
	ДопПараметры.Вставить("ЕстьРезультат", Истина);
	
	Если Не ЗначениеЗаполнено(ПараметрыСписка) Тогда
		ПараметрыСписка = Новый Структура();
	КонецЕсли;
	Если ПараметрыСписка.Свойство("ТипРеестра") Тогда
		ТипРеестра = ПараметрыСписка.ТипРеестра;
	КонецЕсли;
	Если Не ПараметрыСписка.Свойство("Фильтр") Тогда
		ПараметрыСписка.Вставить("Фильтр", Кэш.ОбщиеФункции.ПолучитьФильтрСобытий(Кэш, Новый Структура("ТипРеестра", ТипРеестра)));
	КонецЕсли;
	
	ИмяИнтеграции = Кэш.ТекущийСеанс.СведенияОбИнтеграции.Имя;
	Если ИмяИнтеграции <> "ИнтеграцияКаталог" Тогда
		ГлавноеОкно.сбисПоказатьСостояние("Получение данных с " + Кэш.СБИС.ПараметрыИнтеграции.ПредставлениеСервера, ГлавноеОкно);
	КонецЕсли;
	
	ГлавноеОкно.ОтметитьВсе = Ложь;
	
	СтраницаНаФорме = ПараметрыСписка.Фильтр.Навигация.Страница;
	РазмерСтраницы = Число(ПараметрыСписка.Фильтр.Навигация.РазмерСтраницы);
	
	МаксимумДокументовЗаРаз	= РазмерСтраницы;
	ЧислоИтераций		= 1;
	Если РазмерСтраницы > 50 Тогда
		МаксимумДокументовЗаРаз	= 50;
		// Предполагается, что размер страницы > 50 может быть только кратным 50, чтобы правильно указать номер страницы
		ЧислоИтераций		= РазмерСтраницы / МаксимумДокументовЗаРаз;
	КонецЕсли;

	МассивДокументов = Новый Массив;
	НомерСтраницы = Число(СтраницаНаФорме) * ЧислоИтераций;
	СтруктураСпискаДокументов = Новый Структура();
	Для i = 1 По ЧислоИтераций Цикл
		
		ПараметрыСписка.Фильтр.Навигация.Страница		= Строка(НомерСтраницы);
		ПараметрыСписка.Фильтр.Навигация.РазмерСтраницы	= Строка(МаксимумДокументовЗаРаз);
		
		СтруктураСпискаДокументов = Кэш.Интеграция.СБИС_СписокДокументовПоСобытиям(Кэш, ПараметрыСписка.Фильтр, ДопПараметры, Отказ);
	
		Если Отказ Тогда
			ГлавноеОкно.сбисСпрятатьСостояние();                                                 
			МодульОбъектаКлиент().СообщитьСбисИсключение(СтруктураСпискаДокументов);
		КонецЕсли;
		
		Для Каждого ДокОнлайна Из СтруктураСпискаДокументов.Реестр Цикл
			МассивДокументов.Добавить(ДокОнлайна);
		КонецЦикла;
		
		ЕстьЕще =	ТипЗнч(СтруктураСпискаДокументов.Навигация.ЕстьЕще) = Тип("Строка") И НРег(СтруктураСпискаДокументов.Навигация.ЕстьЕще) = "да"
					Или СтруктураСпискаДокументов.Навигация.ЕстьЕще = Истина;
		
		Если Не ЕстьЕще Тогда
			Прервать;
		КонецЕсли;
		
		НомерСтраницы = НомерСтраницы + 1;
		
	КонецЦикла;
	
	Если МассивДокументов.Количество() Тогда
		СтруктураСпискаДокументов.Реестр = МассивДокументов;
		// Сделано, чтобы дальше это выгялядело, как будто мы действительно могли получить >50 документов за раз
		СтруктураСпискаДокументов.Навигация.Страница		= СтраницаНаФорме;
		СтруктураСпискаДокументов.Навигация.РазмерСтраницы	= РазмерСтраницы;
	КонецЕсли;
		
	СписокДокументов = Кэш.ОбщиеФункции.ОбработатьСписокСобытий(Кэш, СтруктураСпискаДокументов);
	
	Возврат СписокДокументов;
	
КонецФункции

