 
// Процедура - патчит пакеты документов для передачи в форму просмотра 
//
// Параметры:
//  МассивПакетов		- Массив пакетов для дозаполнения
//  ДопПараметры		- Структура дополнительных параметров
//  1189641556
//
&НаКлиенте
Процедура ПодготовитьДокументСбисКПросмотру(МассивПакетов,ДопПараметры) Экспорт
	
	ТекущийРаздел = ДопПараметры.ТекущийРаздел; 
		
	Если ТекущийРаздел = "Продажа" Тогда
		ПодготовитьДокументСбисВРазделеПродажа(МассивПакетов,ДопПараметры);
	ИначеЕсли ТекущийРаздел = "Полученные" Тогда
		ПодготовитьДокументСбисВРазделеПолученные(МассивПакетов,ДопПараметры);	
	Иначе
		Возврат;
	КонецЕсли;		

КонецПроцедуры	

//1189641556
&НаКлиенте
Процедура ПодготовитьДокументСбисВРазделеПродажа(МассивПакетов,ДопПараметры)

	Перем СсылкаНаПервоеВложение, Вложения;
	
	Кэш = ГлавноеОкно.Кэш; 
	ПолныйСоставПакета = МассивПакетов;
	
	Если ДопПараметры.Свойство("Вложения", Вложения)		
		И Вложения[0].Свойство("Документы1С", СсылкаНаПервоеВложение)
		И	СсылкаНаПервоеВложение.Количество() Тогда
		СсылкаНаПервоеВложение = СсылкаНаПервоеВложение[0].Значение;
		Отказ = Ложь;
		ПараметрыПакетаСБИС	= Кэш.ОбщиеФункции.ИдентификаторСБИСПоДокументу(Кэш, СсылкаНаПервоеВложение);
		ИдДок				= ПараметрыПакетаСБИС.ИдДокумента;
		Если ЗначениеЗаполнено(ИдДок) Тогда
			ДопПараметры = Новый Структура("СообщатьПриОшибке, ВернутьОшибку", Ложь, Истина);
			РезультатЧтенияПоИд = Кэш.Интеграция.ПрочитатьДокумент(Кэш, ИдДок, ДопПараметры, Отказ);
			Если Не Отказ
				И	ТипЗнч(РезультатЧтенияПоИд) = Тип("Структура")
				И	РезультатЧтенияПоИд.Свойство("Событие") Тогда
				ПолныйСоставПакета.Вставить("Событие", РезультатЧтенияПоИд.Событие);
			КонецЕсли;
			//1189641556
			Если Не Отказ
				И	ТипЗнч(РезультатЧтенияПоИд) = Тип("Структура")
				И	РезультатЧтенияПоИд.Свойство("Расширение") Тогда
				ПолныйСоставПакета.Вставить("Расширение", РезультатЧтенияПоИд.Расширение);
			КонецЕсли;  
			Если НЕ Отказ Тогда
				ПолныйСоставПакета.Вставить("Идентификатор", ИдДок);   
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Для Каждого Элемент Из Вложения Цикл
		Если ЗначениеЗаполнено(Элемент.XMLДокумента) Тогда
			ТекстHTML = Кэш.Интеграция.ПолучитьHTMLПоXML(Кэш, Элемент);
		Иначе
			ТекстHTML = "";
		КонецЕсли;
		Элемент.Вставить("ТекстHTML",ТекстHTML);
	КонецЦикла; 
	
КонецПроцедуры 

//1189641556
&НаКлиенте
Процедура ПодготовитьДокументСбисВРазделеПолученные(МассивПакетов,ДопПараметры)

	Перем СсылкаНаПервоеВложение, Вложения;
	
	Кэш = ГлавноеОкно.Кэш; 
	ПолныйСоставПакета = МассивПакетов;
	
	сч = 0;
	Для Каждого Элемент Из ПолныйСоставПакета.Вложение Цикл
		Если ПолныйСоставПакета.Свойство("Событие") Тогда
			Элемент.Вставить("Событие", ПолныйСоставПакета.Событие);
		КонецЕсли;
		ТекстHTML = Кэш.Интеграция.ПолучитьHTMLВложения(Кэш, ПолныйСоставПакета.Идентификатор, Элемент);
		ПолныйСоставПакета.Вложение[сч].Вставить("ТекстHTML",ТекстHTML);
		ПолныйСоставПакета.Вложение[сч].Вставить("Отмечен",Истина);
		сч = сч+1;
	КонецЦикла;
	
КонецПроцедуры

