 
// Процедура - патчит пакеты документов для передачи в форму просмотра 
//
// Параметры:
//  МассивПакетов		- Массив - пакеты для дозаполнения
//  ДопПараметры		- Структура - дополнительные параметры
//
&НаКлиенте
Процедура ПодготовитьДокументСбисКПросмотру(МассивПакетов,ДопПараметры) Экспорт
	
	ТекущийРаздел = ДопПараметры.ТекущийРаздел; 
		
	Если ТекущийРаздел = "Продажа" Тогда
		ПодготовитьДокументСбисВРазделеПродажа(МассивПакетов, ДопПараметры);
	ИначеЕсли ТекущийРаздел = "Полученные" Тогда
		ПодготовитьДокументСбисВРазделеПолученные(МассивПакетов, ДопПараметры);	
	Иначе
		Возврат;
	КонецЕсли;		

КонецПроцедуры	

&НаКлиенте
Процедура ДополнитьПолныйСоставПакетаДаннымиОнлайна(ПолныйСоставПакета, РезультатЧтенияПоИд)
	
	Если ТипЗнч(РезультатЧтенияПоИд) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ДопПоля = Новый Массив;
	ДопПоля.Добавить("Событие"); 
	ДопПоля.Добавить("Расширение"); 
	ДопПоля.Добавить("РеализацияЕИС"); 
	ДопПоля.Добавить("Идентификатор"); 
	ДопПоля.Добавить("Состояние");
	
	Для каждого Поле Из ДопПоля Цикл
		Если РезультатЧтенияПоИд.Свойство(Поле) Тогда
			ПолныйСоставПакета.Вставить(Поле, РезультатЧтенияПоИд[Поле]);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьДокументСбисВРазделеПродажа(МассивПакетов,ДопПараметры)

	Перем СсылкаНаПервоеВложение, Вложения;
	
	Кэш = ГлавноеОкно.Кэш; 
	ПолныйСоставПакета = МассивПакетов;
	
	Если ДопПараметры.Свойство("Вложения", Вложения)		
		И Вложения[0].Свойство("Документы1С", СсылкаНаПервоеВложение)
		И	СсылкаНаПервоеВложение.Количество() Тогда
		
		СсылкаНаПервоеВложение = СсылкаНаПервоеВложение[0].Значение;
		Отказ = Ложь;
		ПараметрыПакетаСБИС	= Кэш.ОбщиеФункции.ИдентификаторСБИСПоДокументу(Кэш, СсылкаНаПервоеВложение);
		ИдДок				= ПараметрыПакетаСБИС.ИдДокумента;
		Если ЗначениеЗаполнено(ИдДок) Тогда
			ДопПараметры = Новый Структура("СообщатьПриОшибке, ВернутьОшибку", Ложь, Истина);
			РезультатЧтенияПоИд = Кэш.Интеграция.ПрочитатьДокумент(Кэш, ИдДок, ДопПараметры, Отказ);
			Если Не Отказ Тогда
				ДополнитьПолныйСоставПакетаДаннымиОнлайна(ПолныйСоставПакета, РезультатЧтенияПоИд);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Для Каждого Элемент Из Вложения Цикл
		Если ЗначениеЗаполнено(Элемент.XMLДокумента) Тогда
			ТекстHTML = Кэш.Интеграция.ПолучитьHTMLПоXML(Кэш, Элемент);
		Иначе
			ТекстHTML = "";
		КонецЕсли;
		Элемент.Вставить("ТекстHTML", ТекстHTML);
	КонецЦикла; 
	
КонецПроцедуры 

&НаКлиенте
Процедура ПодготовитьДокументСбисВРазделеПолученные(МассивПакетов,ДопПараметры)
	
	Кэш = ГлавноеОкно.Кэш; 
	ПолныйСоставПакета = МассивПакетов;
	
	сч = 0;
	Для Каждого Элемент Из ПолныйСоставПакета.Вложение Цикл

		Если ПолныйСоставПакета.Свойство("Событие") Тогда
			Элемент.Вставить("Событие", ПолныйСоставПакета.Событие);
		КонецЕсли;

		ТекстHTML = Кэш.Интеграция.ПолучитьHTMLВложения(Кэш, ПолныйСоставПакета.Идентификатор, Элемент);
		ПолныйСоставПакета.Вложение[сч].Вставить("ТекстHTML", ТекстHTML);
		ПолныйСоставПакета.Вложение[сч].Вставить("Отмечен", Истина);
		сч = сч + 1;

	КонецЦикла;
	
КонецПроцедуры

