
&НаКлиенте
Процедура УтвердитьДокументСРасхождением(ПараметрыКоманды, ДопПараметры = Неопределено) Экспорт
	
	Кэш = ПолучитьТекущийЛокальныйКэш();  
	
	СписокОтмеченныхДокументов = ПараметрыКоманды.СписокСтрокРеестра;
	
	ОбработчикРезультатОтправки	= НовыйСбисОписаниеОповещения("УтвердитьДокументСРасхождением_Завершение", МодульОбъектаКлиент());
	
	МассивПакетов = Новый Массив;  // Массив пакетов для одной отправки (если в настройках указано отправлять пакеты по n штук)

	Для Каждого СтрокаВыбрана Из СписокОтмеченныхДокументов Цикл
		
		ИдПакета = СтрокаВыбрана.Значение.ИдСБИС; 
		
		ОперацииВыполнить = Новый СписокЗначений;
		ОперацииВыполнить.Добавить(Новый Структура("Операция", "ВыполнитьДействие"),	"ПрочитатьДокумент");
		ОперацииВыполнить.Добавить(,													"СформироватьРасхождение");
		ОперацииВыполнить.Добавить(Новый Структура("ИмяКоманды", "Утвердить"),			"ВыполнитьДействие");

		// Главное окно должно сообщить что требуется проверить документ на черновик
		СтрокаДобавить = Новый Структура("ИдентификаторСБИС", ИдПакета); 
		СтрокаДобавить.Вставить("Сценарии",	ОперацииВыполнить);			
	
		МассивПакетов.Добавить(СтрокаДобавить);
		
	КонецЦикла;

	ПараметрыОтправки = Новый Структура;
	ПараметрыОтправки.Вставить("ДанныеКОтправке",		Новый Структура("СписокПакетов", МассивПакетов));
	ПараметрыОтправки.Вставить("ОбработчикРезультата",	ОбработчикРезультатОтправки);
	ПараметрыОтправки.Вставить("ВерсияОтправки",		2);
	ПараметрыОтправки.Вставить("Реестр",				Кэш.Текущий);
	//ПараметрыОтправки.Вставить("МодульПодготовки",		Кэш.Текущий.Форма);
	
	РезультатОтправки = НовыйРезультатОтправки(ПараметрыОтправки);
	
	РезультатОтправки_МассоваяОтправка(РезультатОтправки);  
	
 КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьДокументы(ПараметрыКоманды, ДопПараметры = Неопределено) Экспорт
	
	СписокОтмеченныхДокументов = ПараметрыКоманды.СписокСтрокРеестра;
	
	Если ЗначениеЗаполнено(СписокОтмеченныхДокументов) Тогда
		
		ОписаниеОповещения = НовыйСбисОписаниеОповещения("ОтклонитьДокументы_Продолжить", МодульОбъектаКлиент(), ПараметрыКоманды);
		СбисПоказатьВводСтроки(ОписаниеОповещения, "", "Введите комментарий", 0, Истина);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьДокументы_Продолжить(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
	
		ВызватьСбисИсключение(, "МодульОбъектаКлиент",,
							"Не указан комментарий для действия ""Отклонить""",
							"Для отклоненя необходимо указать комментарий");
	
	КонецЕсли;
	
	Кэш = ПолучитьТекущийЛокальныйКэш();
	
	СписокОтмеченныхДокументов = ДопПараметры.СписокСтрокРеестра;
	
	ОбработчикРезультатОтправки	= НовыйСбисОписаниеОповещения("УтвердитьДокументСРасхождением_Завершение", МодульОбъектаКлиент());
	
	МассивПакетов = Новый Массив;  // Массив пакетов для одной отправки (если в настройках указано отправлять пакеты по n штук)

	Для Каждого СтрокаВыбрана Из СписокОтмеченныхДокументов Цикл
		
		ИдПакета = СтрокаВыбрана.Значение.ИдСБИС; 
		
		ОперацииВыполнить = Новый СписокЗначений;
		ОперацииВыполнить.Добавить(Новый Структура("Операция", "ВыполнитьДействие"),	"ПрочитатьДокумент");
		ОперацииВыполнить.Добавить(Новый Структура("ИмяКоманды", "Отклонить"),			"ВыполнитьДействие");

		// Главное окно должно сообщить что требуется проверить документ на черновик
		СтрокаДобавить = Новый Структура("ИдентификаторСБИС", ИдПакета); 
		СтрокаДобавить.Вставить("Сценарии",	ОперацииВыполнить);			
	
		МассивПакетов.Добавить(СтрокаДобавить);
		
	КонецЦикла;

	ПараметрыОтправки = Новый Структура;
	ПараметрыОтправки.Вставить("ДанныеКОтправке",		Новый Структура("СписокПакетов", МассивПакетов));
	ПараметрыОтправки.Вставить("ОбработчикРезультата",	ОбработчикРезультатОтправки);
	ПараметрыОтправки.Вставить("ВерсияОтправки",		2);
	ПараметрыОтправки.Вставить("Реестр",				Кэш.Текущий);
	//ПараметрыОтправки.Вставить("МодульПодготовки",		Кэш.Текущий.Форма);
	
	РезультатОтправки = НовыйРезультатОтправки(ПараметрыОтправки);
	
	ЦепочкаКомандОбработки_УстановитьДанные(РезультатОтправки, "Комментарий", Результат);
	
	РезультатОтправки_МассоваяОтправка(РезультатОтправки);  
	
 КонецПроцедуры

// Процедура - событие завершения отправки
//
// Параметры:
//  РезультатОтправки	 - РезультатОтправки	 - Экземпляр класса отправки
//  ДопПараметры		 - Структура	 - Кэш
//
&НаКлиенте
Процедура УтвердитьДокументСРасхождением_Завершение(РезультатОтправки, ДопПараметры) Экспорт
	
	Кэш = ПолучитьТекущийЛокальныйКэш();
	
	Кэш.Вставить("РезультатОтправки", РезультатОтправки);
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПоказатьРезультатОтправки","ФормаРезультатОтправки","", Кэш);
	фрм.ПоказатьРезультатОтправки(Кэш);	
	
КонецПроцедуры

