
//DynamicDirective

// Функция - Объединияет объекты в 1
//
// Параметры:
//  ОбъектОсновной		 - Произвольный объект универсальных коллекций	 - основа объединения
//  ОбъектОбъединения	 - Произвольный объект универсальных коллекций	 - что надо влить в основной объект
//  ДопПараметры	 	 - Структура	 								 - контекст дозаполнения: 
//		Копия			- скопировать основной объект только на верхнем уровне
//		ГлубокаяКопия	- скопировать основной объект на всех уровнях
// 
// Возвращаемое значение:
//  ОбъектОсновной с значениями объектов из ОбъектыОбъединения
//
Функция ОбъединитьОбъектыУниверсальныхКоллекций_Объект(ОбъектОсновной = Неопределено, ОбъектОбъединения, КонтекстОбъединить)

	Если ОбъектОсновной = Неопределено Тогда
		
		Если КонтекстОбъединить.ГлубокаяКопия Тогда
			
			Возврат СоздатьКопиюОбъекта_Объект(ОбъектОбъединения, КонтекстОбъединить);	
			
		КонецЕсли;
		
		ТипПроверка = ТипЗнч(ОбъектОбъединения);
		
		ОписаниеТипа	= Новый ОписаниеТипов(СтрЗаменить(ТипПроверка, " ", ""));
		ОбъектОсновной	= ОписаниеТипа.ПривестиЗначение();
		
	Иначе
		
		ТипПроверка = ТипЗнч(ОбъектОсновной);
		
		// Если типы не совпадают, то взять от второго объекта
		Если Не ТипПроверка = Тип(ОбъектОбъединения) Тогда
			
			Возврат СоздатьКопиюОбъекта_Объект(ОбъектОбъединения, КонтекстОбъединить);
			
		КонецЕсли;
		
	КонецЕсли;

	КонтекстОбъединить.Уровень = КонтекстОбъединить.Уровень + 1;
	
	Если		КонтекстОбъединить.ПростыеТипы.СодержитТип(ТипПроверка) Тогда
		
		// Простой тип - берётся от второго объекта
		Результат = ОбъектОбъединения;
		
	ИначеЕсли		ТипПроверка = Тип("Структура")		Тогда
		
		// Объединить структуры
		Результат = ОбъединитьОбъектыУниверсальныхКоллекций_Структура(ОбъектОсновной, ОбъектОбъединения, КонтекстОбъединить);
		
	ИначеЕсли	ТипПроверка = Тип("Соответствие")	Тогда
		
		// Объединить структуры
		Результат = ОбъединитьОбъектыУниверсальныхКоллекций_Соответствие(ОбъектОсновной, ОбъектОбъединения, КонтекстОбъединить);
		
	ИначеЕсли	ТипПроверка = Тип("Массив")	Тогда
		
		// Объединить структуры
		Результат = ОбъединитьОбъектыУниверсальныхКоллекций_Массив(ОбъектОсновной, ОбъектОбъединения, КонтекстОбъединить);
		
	ИначеЕсли	ТипПроверка = Тип("СписокЗначений")	Тогда
		
		// Объединить структуры
		Результат = ОбъединитьОбъектыУниверсальныхКоллекций_Список(ОбъектОсновной, ОбъектОбъединения, КонтекстОбъединить);

	ИначеЕсли	КонтекстОбъединить.ЕслиТипНеизвестен = "ошибка" Тогда
			
		ТекстОшибки = "Неизвестный тип """ + ТипПроверка + """ для объединения.";
		ОшибкаКопирования = НовыйСбисИсключение(767, "МодульОбъекта.СоздатьКопиюОбъекта_Объект",,,ТекстОшибки, КонтекстОбъединить.Путь);
		ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаКопирования);
			
	ИначеЕсли	КонтекстОбъединить.ЕслиТипНеизвестен = "пропустить" Тогда	
			
		Результат = NULL;
			
	Иначе
			
		Результат = ОбъектОбъединения;
		
	КонецЕсли; 
	
	КонтекстОбъединить.Уровень = КонтекстОбъединить.Уровень - 1;
	
	Возврат Результат;

КонецФункции

//DynamicDirective
Функция ОбъединитьОбъектыУниверсальныхКоллекций_Структура(ОбъектОсновной = Неопределено, ОбъектОбъединения, КонтекстОбъединения)
	Перем ЗначениеТекущееОсновной, ЗначениеТекущееОбъединить;

	ПутьТекущий = КонтекстОбъединения.Путь;
			
	Для Каждого КлючИЗначение Из ОбъектОбъединения Цикл
		
		КонтекстОбъединения.Путь = ПутьТекущий + "." + КлючИЗначение.Ключ;
		Если	ЗначениеЗаполнено(КонтекстОбъединения.КлючиПеренестиТолько)
			И	КонтекстОбъединения.КлючиПеренестиТолько.Найти(КлючИЗначение.Ключ) = Неопределено Тогда
			
			Продолжить;
			
		ИначеЕсли КонтекстОбъединения.КлючиПеренестиКакЕсть.Найти(КлючИЗначение.Ключ) = Неопределено Тогда
			
			ОбъектОсновной.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			Продолжить;
			
		Иначе
				
			ОбъектОсновной.Свойство(КлючИЗначение.Ключ, ЗначениеТекущееОсновной);
			ОбъектОсновной.Вставить(КлючИЗначение.Ключ, ОбъединитьОбъектыУниверсальныхКоллекций_Объект(ЗначениеТекущееОсновной, КлючИЗначение.Значение, КонтекстОбъединения));
			
		КонецЕсли;

	КонецЦикла;
		
	КонтекстОбъединения.Путь = ПутьТекущий;

	Возврат ОбъектОсновной;
	
КонецФункции

//DynamicDirective
Функция ОбъединитьОбъектыУниверсальныхКоллекций_Соответствие(ОбъектОсновной = Неопределено, ОбъектОбъединения, КонтекстОбъединения)
	Перем ЗначениеТекущееОсновной, ЗначениеТекущееОбъединить;
		
	ПутьТекущий = КонтекстОбъединения.Путь;
	
	Для Каждого КлючИЗначение Из ОбъектОбъединения Цикл
			
		КонтекстОбъединения.Путь	= ПутьТекущий + "." + КлючИЗначение.Ключ;
		ЗначениеТекущееОсновной		= ОбъектОсновной.Получить(КлючИЗначение.Ключ);
		ОбъектОсновной.Вставить(КлючИЗначение.Ключ, ОбъединитьОбъектыУниверсальныхКоллекций_Объект(ЗначениеТекущееОсновной, КлючИЗначение.Значение, КонтекстОбъединения));

	КонецЦикла;
	
	КонтекстОбъединения.Путь = ПутьТекущий;

	Возврат ОбъектОсновной;
	
КонецФункции

//DynamicDirective
Функция ОбъединитьОбъектыУниверсальныхКоллекций_Массив(ОбъектОсновной = Неопределено, ОбъектОбъединения, КонтекстОбъединения)
	Перем ЗначениеТекущееОсновной, ЗначениеТекущееОбъединить;
		
	Для Каждого ЗначениеТекущееОбъединить Из ОбъектОбъединения Цикл
		
		ОбъектОсновной.Добавить(ЗначениеТекущееОбъединить);

	КонецЦикла;

	Возврат ОбъектОсновной;
	
КонецФункции

//DynamicDirective
Функция ОбъединитьОбъектыУниверсальныхКоллекций_Список(ОбъектОсновной = Неопределено, ОбъектОбъединения, КонтекстОбъединения)
	Перем ЗначениеТекущееОсновной, ЗначениеТекущееОбъединить;
		
	Для Каждого ЗначениеТекущееОбъединить Из ОбъектОбъединения Цикл
		
		ОбъектОсновной.Добавить(ЗначениеТекущееОбъединить.Значение,
								ЗначениеТекущееОбъединить.Представление,
								ЗначениеТекущееОбъединить.Пометка,
								ЗначениеТекущееОбъединить.Картинка);

	КонецЦикла;

	Возврат ОбъектОсновной;
	
КонецФункции

