
&НаКлиенте
Функция СформироватьДокументДляГенератора(ПараметрыФормированияВходящие, Кэш) Экспорт
    Перем ТекДокументАдресДоставки;
	
	Док		= ПараметрыФормированияВходящие.Документ;
	Вложение= ПараметрыФормированияВходящие.Вложение;
	
	ТекДокумент = Док.Файл.Документ;
	ТекДокумент.Вставить("ДефНомИспрСФ",  "-");
	ТекДокумент.Вставить("ДефДатаИспрСФ", "-");
	ТекДокумент.Вставить("ПоФактХЖ", 	Вложение.Название);
	ТекДокумент.Вставить("НаимДокОпр", 	ТекДокумент.Название);
	
	//TODO удалить в 24.2100
	//Это не нужно, т.к. стороны должны определяться на стадии ПрочитатьДокумент, а не сгенерировать вложение.
	//Как временное решение, можно восстановить эту логику, но простановка ГП и ГО тут это ошибка
	//Если НЕ ТекДокумент.Свойство("Грузоотправитель") Тогда
	//	ТекДокумент.Вставить("Грузоотправитель", Новый Структура());
	//	Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(ТекДокумент.Грузоотправитель, Вложение.Отправитель);
	//КонецЕсли;
	//Если НЕ ТекДокумент.Свойство("Грузополучатель") Тогда
	//	ТекДокумент.Вставить("Грузополучатель", Новый Структура());
	//	Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(ТекДокумент.Грузополучатель, Вложение.Получатель);
	//КонецЕсли;
	
	Если ТекДокумент.Свойство("АдресДоставки", ТекДокументАдресДоставки) Тогда
		Если ЗначениеЗаполнено(ТекДокументАдресДоставки) И ТекДокумент.Свойство("Грузополучатель") Тогда
			//Заменяется адрес ГП на адрес доставки. Логика из XSLT.
			АдресСписок = Новый Массив;
			АдресСписок.Добавить(ТекДокумент.АдресДоставки);
			ТекДокумент.Грузополучатель.Вставить("Адрес", АдресСписок);
		КонецЕсли;
		ТекДокумент.Удалить("АдресДоставки");
	КонецЕсли;
	
	Если ФайлДокумент_ОтправительГрузоотправительОнЖе(ТекДокумент) Тогда
		ТекДокумент.Грузоотправитель.Вставить("ОнЖе", "он же");	
	КонецЕсли;
	
	ОшибкаФормирования = Ложь;
	Если ПараметрыФормированияВходящие.Свойство("ФормыПоиска") Тогда
		фрмПараметр = Кэш.ГлавноеОкно.СбисНайтиФормуФункцииСеанса(Кэш, "ЗаполнитьПоДокументПараметр", ПараметрыФормированияВходящие.ФормыПоиска, Новый Структура, ОшибкаФормирования)
	Иначе
		фрмПараметр = ЭтаФорма;
	КонецЕсли; 
	фрмПараметр.ЗаполнитьПоДокументПараметр(Док, Кэш); 
	
	ОшибкаФормирования = Ложь;
	Если ПараметрыФормированияВходящие.Свойство("ФормыПоиска") Тогда
		фрмОснования = Кэш.ГлавноеОкно.СбисНайтиФормуФункцииСеанса(Кэш, "ЗаполнитьПоДокументОснование", ПараметрыФормированияВходящие.ФормыПоиска, Новый Структура, ОшибкаФормирования);
	Иначе
		фрмОснования = ЭтаФорма;
	КонецЕсли;
	фрмОснования.ЗаполнитьПоДокументОснование(Док, Кэш);
	
	СчетчикБезНДС = 0;
	
	Для Каждого ТекСтрока ИЗ ТекДокумент.ТаблДок.СтрТабл Цикл
		ТекСтрока.Вставить("ДефСуммаЦен", 				"");
		ТекСтрока.Вставить("ДефНДС", 					"");
		ТекСтрока.Вставить("ДефЕдКод", 					"");
		ТекСтрока.Вставить("ДефКодСтраныПроизводства", 	"");
		ЗаполнитьПоСтрТаблПараметр(Кэш, ТекСтрока); 
		СформироватьИнфПол(Кэш, ТекСтрока);
		СформироватьСведПрослеж(Кэш, ТекСтрока);
		Если ТекСтрока.Свойство("СведПрослеж")
			И ЗначениеЗаполнено(ТекСтрока.СведПрослеж) Тогда
			ТекСтрока.Вставить("ГТД", "Прослеж");
		КонецЕсли;
		
		Если ТекСтрока.НДС.Свойство("Ставка") Тогда
			Если ТекСтрока.НДС.Ставка = "без НДС" Тогда
				ТекСтрока.Вставить("БезНДС", ТекСтрока.НДС.Ставка);
				СчетчикБезНДС = СчетчикБезНДС + 1;
			Иначе
				ТекСтрока.Вставить("БезНДС", "");
			КонецЕсли;
		Иначе
			ТекСтрока.Вставить("БезНДС", "");
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТекСтрока ИЗ ТекДокумент.ТаблДок.ИтогТабл Цикл
		
		Если СчетчикБезНДС = ТекДокумент.ТаблДок.СтрТабл.Количество() Тогда
			ТекСтрока.Вставить("БезНДС", "без НДС");	
		Иначе
			ТекСтрока.Вставить("БезНДС", "");
		КонецЕсли;
		
		ТекСтрока.Вставить("ДефСумма", "");
		ТекСтрока.Вставить("ДефНДС", "");
		
	КонецЦикла;
	
	ОшибкаФормирования = Ложь;
	Если ПараметрыФормированияВходящие.Свойство("ФормыПоиска") Тогда
		фрмОснования = Кэш.ГлавноеОкно.СбисНайтиФормуФункцииСеанса(Кэш, "СформироватьОснование", ПараметрыФормированияВходящие.ФормыПоиска, Новый Структура, ОшибкаФормирования)
	Иначе
		фрмОснования = ЭтаФорма;
	КонецЕсли;
	фрмОснования.СформироватьОснование(Док, Кэш);
    
	Если ПараметрыФормированияВходящие.Свойство("ФормыПоиска") Тогда
		фрмПараметров = Кэш.ГлавноеОкно.СбисНайтиФормуФункцииСеанса(Кэш, "СформироватьПараметры", ПараметрыФормированияВходящие.ФормыПоиска, Новый Структура, ОшибкаФормирования);
	Иначе
		фрмПараметров = ЭтаФорма;
	КонецЕсли;
	фрмПараметров.СформироватьПараметры(Док, Кэш);
	
	//Закоментировано в 24.2100, чтобы ПолучитьHTMLПоXML возвращал без подписантов 
	//ТекДокумент.Вставить("Подписант", Новый Структура("ОблПолн", 5));
	
	Возврат Док;
	
КонецФункции

#Область include_core2_ТребуетРефактор_ЗаполнениеПараметровПодстановки  
#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьПоДокументОснование(Док, Кэш) Экспорт
	Перем НомерУстановить, ДатаУстановить, НаборОснованийУстановить, ПараметрыФормирования;
	
	ТекДокумент = Док.Файл.Документ;

	Если	НЕ ТекДокумент.Свойство("Основание", НаборОснованийУстановить)
		Или	НЕ ЗначениеЗаполнено(НаборОснованийУстановить) Тогда
		Возврат;	
	КонецЕсли;
	
	мПРД = Новый Массив;
	мСчФ = Новый Массив;
	мПередатДокумОсн = Новый Массив;
	
	СчФ		= Новый Структура("Номер, Дата");
	ИспрСчФ = Новый Структура("НомИспрСФ, ДатаИспрСФ, ДефНомИспрСФ, ДефДатаИспрСФ");
		
	Для Каждого ТекСтрока ИЗ НаборОснованийУстановить Цикл
			
		Если	Не	ТекСтрока.Свойство("Номер", НомерУстановить)
			Или	Не ЗначениеЗаполнено(НомерУстановить) Тогда
			Продолжить;
		КонецЕсли; 
		
		НомерУстановить = ГенераторПривестиТип(НомерУстановить, "Номер"); 
		
		Если ПустаяСтрока(НомерУстановить) Тогда
			Продолжить;
		КонецЕсли; 
		
		ПараметрыФормирования = Новый Структура; 
		
		ПараметрыФормирования.Вставить("НомерУстановить", НомерУстановить); 
		ПараметрыФормирования.Вставить("ДатаУстановить", ТекСтрока.Дата);
		
		Если ТекСтрока.Свойство("Тип") Тогда
			Ключ = "Тип";	
		Иначе
			Ключ = "Название";	
		КонецЕсли;
		
		Если		ТекСтрока[Ключ] = "ПРД" Тогда 
			
			ПараметрыФормирования.Вставить("мПРД", мПРД);
				
			ЗаполнитьПоДокументОснование_ПРД(ПараметрыФормирования); 
			
		ИначеЕсли	ТекСтрока[Ключ] = "ДокПодтвОтгр" Тогда  
			
			ПараметрыФормирования.Вставить("ТекДокумент", ТекДокумент); 
			ПараметрыФормирования.Вставить("НаимДокОтгр", ТекСтрока.НаимДокОтгр);
			
			ЗаполнитьПоДокументОснование_ДокПодтвОтгр(ПараметрыФормирования);	
			
		ИначеЕсли	ТекСтрока[Ключ] = "СчФ" Тогда 
			
			ПараметрыФормирования.Вставить("СчФ", СчФ);
			
			ЗаполнитьПоДокументОснование_СчФ(ПараметрыФормирования); 
			
		ИначеЕсли	ТекСтрока[Ключ] = "ИспрСчФ" Тогда  
			
			ПараметрыФормирования.Вставить("ИспрСчФ", ИспрСчФ);
			
			ЗаполнитьПоДокументОснование_ИспрСчФ(ПараметрыФормирования);
			
		ИначеЕсли	ТекСтрока[Ключ] = "ИсхСчФ" Тогда
			
			ПараметрыФормирования.Вставить("мСчФ", мСчФ);
			ПараметрыФормирования.Вставить("Ключ", Ключ);  
			ПараметрыФормирования.Вставить("ТекДокумент", ТекДокумент);
          	ПараметрыФормирования.Вставить("ТекСтрока", ТекСтрока);
            ПараметрыФормирования.Вставить("мПередатДокумОсн", мПередатДокумОсн); 
			ПараметрыФормирования.Вставить("ИспрСчФ", ИспрСчФ);
			
			ЗаполнитьПоДокументОснование_ИсхСчФ(ПараметрыФормирования);
			
		ИначеЕсли	ТекСтрока[Ключ] = "Сделка"
				Или	Лев(ТекСтрока[Ключ], 5) = "Заказ" Тогда
				
			ПараметрыФормирования.Вставить("ТекущийДокумент", ТекДокумент);
          	ПараметрыФормирования.Вставить("ТекущаяСтрока", ТекСтрока);
				
			ЗаполнитьПоДокументОснование_Заказ(ПараметрыФормирования);
						
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПараметрыФормирования = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормирования.Вставить("ТекДокумент", ТекДокумент);  
	ПараметрыФормирования.Вставить("СчФ", СчФ); 
	ПараметрыФормирования.Вставить("ИспрСчФ", ИспрСчФ);
	ПараметрыФормирования.Вставить("мПРД", мПРД);
	ПараметрыФормирования.Вставить("мПередатДокумОсн", мПередатДокумОсн);  
	ПараметрыФормирования.Вставить("мСчФ", мСчФ);
	
	ЗаполнитьПоДокументОснование_ПослеФормирования(ПараметрыФормирования); 
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьПоДокументОснование_ПРД(ПараметрыФормирования) 
	
	мПРД				= ПараметрыФормирования.мПРД;
	НомерУстановить		= ПараметрыФормирования.НомерУстановить; 
	ДатаУстановить		= ПараметрыФормирования.ДатаУстановить;
	
	мПРД.Добавить(Новый Структура("НомерПРД, ДатаПРД", НомерУстановить, ДатаУстановить));  
	
КонецПроцедуры 
							
&НаКлиенте
Процедура ЗаполнитьПоДокументОснование_ДокПодтвОтгр(ПараметрыФормирования) 
	
	ТекДокумент		= ПараметрыФормирования.ТекДокумент;
	НомерУстановить	= ПараметрыФормирования.НомерУстановить;
	ДатаУстановить	= ПараметрыФормирования.ДатаУстановить;
	НаимДокОтгр		= ПараметрыФормирования.НаимДокОтгр;
	
	ТекДокумент.Вставить("ДокПодтвОтгр", Новый Структура());
	
	ТекДокумент.ДокПодтвОтгр.Вставить("ДатаДокОтгр", ДатаУстановить);
	ТекДокумент.ДокПодтвОтгр.Вставить("НомДокОтгр",  НомерУстановить);
	ТекДокумент.ДокПодтвОтгр.Вставить("НаимДокОтгр", НаимДокОтгр); 
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьПоДокументОснование_СчФ(ПараметрыФормирования) 
	
	СчФ					= ПараметрыФормирования.СчФ;
	НомерУстановить		= ПараметрыФормирования.НомерУстановить;
	ДатаУстановить		= ПараметрыФормирования.ДатаУстановить;
	
	СчФ.Номер	= НомерУстановить;
	СчФ.Дата	= ДатаУстановить; 
	
КонецПроцедуры   

&НаКлиенте
Процедура ЗаполнитьПоДокументОснование_ИспрСчФ(ПараметрыФормирования)
	
	ИспрСчФ				= ПараметрыФормирования.ИспрСчФ;
	НомерУстановить		= ПараметрыФормирования.НомерУстановить;
	ДатаУстановить		= ПараметрыФормирования.ДатаУстановить;
	
	ИспрСчФ.НомИспрСФ		= НомерУстановить;
	ИспрСчФ.ДатаИспрСФ		= ДатаУстановить;
	ИспрСчФ.ДефНомИспрСФ	= "";
	ИспрСчФ.ДефДатаИспрСФ	= "";   
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьПоДокументОснование_ИсхСчФ(ПараметрыФормирования) 
	 
	мПередатДокумОсн	= ПараметрыФормирования.мПередатДокумОсн;
	НомерУстановить		= ПараметрыФормирования.НомерУстановить;
	ДатаУстановить		= ПараметрыФормирования.ДатаУстановить; 
	ТекДокумент			= ПараметрыФормирования.ТекДокумент;
	ТекСтрока			= ПараметрыФормирования.ТекСтрока;
	ИспрСчФ				= ПараметрыФормирования.ИспрСчФ;
	Ключ				= ПараметрыФормирования.Ключ;
	мСчФ				= ПараметрыФормирования.мСчФ;
	
	мСчФ.Добавить(Новый Структура("Номер, Дата", НомерУстановить, ДатаУстановить));
			
	ЗаписьПередатДокум = Новый Структура("Номер, Дата, Название");
	ЗаполнитьЗначенияСвойств(ЗаписьПередатДокум, ТекСтрока);
	Если	Ключ = "Название"
		Или	ЗаписьПередатДокум.Название = Неопределено Тогда
		
		ЗаписьПередатДокум.Название = " ";//Нет названия, пробел для отрисовки пустого названия	
		
	КонецЕсли; 
	
	мПередатДокумОсн.Добавить(ЗаписьПередатДокум);
	
	ТекДокумент.Вставить("ПередатДокум", НомерУстановить + " от " + ТекСтрока.Дата); 
	
	ИсправлениеИсходногоДокумента = ТекСтрока.Свойство("НомерИспр")
									И ТекСтрока.Свойство("ДатаИспр")
									И ЗначениеЗаполнено(ТекСтрока.НомерИспр)
									И ЗначениеЗаполнено(ТекСтрока.ДатаИспр); 
									
	Если ИсправлениеИсходногоДокумента Тогда 
										
		ИспрСчФ.НомИспрСФ 	= ТекСтрока.НомерИспр;
		ИспрСчФ.ДатаИспрСФ	= ТекСтрока.ДатаИспр;
		
	КонецЕсли;				
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДокументОснование_Заказ(ПараметрыФормирования) 
	
	ТекущийДокумент		= ПараметрыФормирования.ТекущийДокумент;
	ТекущаяСтрока		= ПараметрыФормирования.ТекущаяСтрока;  
	НомерУстановить		= ПараметрыФормирования.НомерУстановить;
	ДатаУстановить		= ПараметрыФормирования.ДатаУстановить;
	
	Если Не ТекущийДокумент.Свойство("Параметр") Тогда
		ТекущийДокумент.Вставить("Параметр", Новый Массив);
	КонецЕсли;
	
	Если ТекущаяСтрока.Свойство("Номер")
		И Не ПустаяСтрока(НомерУстановить) Тогда
		ТекущийДокумент.Параметр.Добавить(Новый Структура("Имя, Значение", "ЗаказНомер", НомерУстановить));
	КонецЕсли;
	
	Если ТекущаяСтрока.Свойство("Дата")
		И Не ПустаяСтрока(ДатаУстановить) Тогда
		ТекущийДокумент.Параметр.Добавить(Новый Структура("Имя, Значение", "ЗаказДата",	ДатаУстановить));
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьПоДокументОснование_ПослеФормирования(ПараметрыФормирования) 
	
	ТекДокумент			= ПараметрыФормирования.ТекДокумент;
	СчФ					= ПараметрыФормирования.СчФ;  
	ИспрСчФ				= ПараметрыФормирования.ИспрСчФ;
	мПРД				= ПараметрыФормирования.мПРД;  
	мПередатДокумОсн	= ПараметрыФормирования.мПередатДокумОсн; 
	мСчФ				= ПараметрыФормирования.мСчФ; 
	
	Если	Не СчФ.Номер			= Неопределено 
		И	Не СчФ.Дата				= Неопределено 
		И	Не ИспрСчФ.НомИспрСФ	= Неопределено Тогда
		ТекДокумент.Вставить("НомИспрСФ",	  ИспрСчФ.НомИспрСФ);
		ТекДокумент.Вставить("ДатаИспрСФ",    ИспрСчФ.ДатаИспрСФ);
		ТекДокумент.ДефНомИспрСФ	= ИспрСчФ.ДефНомИспрСФ;
		ТекДокумент.ДефДатаИспрСФ	= ИспрСчФ.ДефДатаИспрСФ;
		
		Если ТекДокумент.Свойство("ДокПодтвОтгр") Тогда 
			ТекДокумент.ДокПодтвОтгр.Вставить("ДатаДокОтгр", Счф.Дата);
			ТекДокумент.ДокПодтвОтгр.Вставить("НомДокОтгр",  Счф.Номер);
		КонецЕсли;
	КонецЕсли;
	
	Если мПРД.Количество() <> 0 тогда
		ТекДокумент.Вставить("ПРД", мПРД);	
	КонецЕсли;
	
	Если мСчФ.Количество() <> 0 тогда
		ТекДокумент.Вставить("СчФ", мСчФ);	
	КонецЕсли;
	
	Если мПередатДокумОсн.Количество() <> 0 тогда
		ТекДокумент.Вставить("ПередатДокумОсн", мПередатДокумОсн);	
	КонецЕсли;
	
КонецПроцедуры

//Функция обогащает документ, у которого есть ПредСтрТабл
&НаКлиенте
Функция СформироватьТабличнуюЧастьТабличнаяЧастьДокументаИзменений(ПараметрыФормированияВходящие, Кэш) Экспорт
	Перем ПредСтрТабл;

	ТекДокумент = ПараметрыФормированияВходящие.Документ.Файл.Документ;
	ТекДокумент.ТаблДок.СтрТабл = СформироватьРазностнуюТабличнуюЧастьТабличнаяЧастьДокумента(ТекДокумент.ТаблДок.СтрТабл);	
	ИтогиСоответствие = Новый Соответствие;
	
	ВерсияФорматаПодстановки = ПараметрыФормированияВходящие.Документ.Файл.ВерсияФормата;	
	СбисОбщиеФункции	= Кэш.ТекущийСеанс.Модули.ФункцииДокументов;
	ИмяФормыПоФормату		= "Файл_"	+ СбисОбщиеФункции.СбисЗаменитьНедопустимыеСимволы(ПараметрыФормированияВходящие.Документ.Файл.Формат)
								+ "_"	+ СбисОбщиеФункции.СбисЗаменитьНедопустимыеСимволы(ВерсияФорматаПодстановки);
	СбисФормыПоиска = Новый Массив;
	СбисФормыПоиска.Добавить(ИмяФормыПоФормату);
	Если Не ВерсияФорматаПодстановки = "3.01" Тогда
		СбисФормыПоиска.Добавить("Файл_Шаблон_" + СтрЗаменить(ВерсияФорматаПодстановки, ".", "_"));
	КонецЕсли;
	СбисФормыПоиска.Добавить("Файл_Шаблон"); 
	ПараметрыПримененияПодстановок = Новый Структура;
	ПараметрыПримененияПодстановок.Вставить("ФормыПоиска", СбисФормыПоиска);
	ОшибкаФормирования		= Ложь;
	
	//Обогатить документ параметрами, которые не попадают в формат вложения подстановки, но нужны для более простой обработки
	фрм = Кэш.ГлавноеОкно.СбисНайтиФормуФункцииСеанса(Кэш, "СформироватьДокументДляГенератора", ПараметрыПримененияПодстановок.ФормыПоиска, Новый Структура, ОшибкаФормирования);
	
	СтрокБезНДС = 0;
	
	Для Каждого ТекСтрока ИЗ ТекДокумент.ТаблДок.СтрТабл Цикл 
		
		фрм.СформироватьПараметрыСтроки(Кэш, ТекСтрока);
		фрм.СформироватьИнфПол(Кэш, ТекСтрока);
		
		Если ТекСтрока.Свойство("ПредСтрТабл", ПредСтрТабл) Тогда
			
			фрм.СформироватьПараметрыСтроки(Кэш, ПредСтрТабл);
			
		Иначе  
			
			//Нет узла ПредСтрТабл, значит ничего не менялось
			ПредСтрТабл = ТекСтрока;  
			
		КонецЕсли; 
		
		СформироватьУвеличениеУменьшение(ТекСтрока, ПредСтрТабл, ИтогиСоответствие);
		
		Если ТекСтрока.Свойство("СведПрослеж") И ПредСтрТабл.Свойство("СведПрослеж") Тогда
			
			ПрослежТоварРасхождение(ТекСтрока.СведПрослеж, ПредСтрТабл.СведПрослеж); 
			
		КонецЕсли;  
		
		Если ТекСтрока.НДС.Ставка = "без НДС" Тогда 
			
			СтрокБезНДС = СтрокБезНДС + 1;  
			
		КонецЕсли;
		
	КонецЦикла; 
	
	ТекДокументБезНДС = СтрокБезНДС = ТекДокумент.ТаблДок.СтрТабл.Количество();
	
	Для Каждого ТекСтрока ИЗ ТекДокумент.ТаблДок.ИтогТабл Цикл 
		
		ЗаполнитьУвеличениеУменьшениеИтоги(ТекСтрока, ИтогиСоответствие, ТекДокументБезНДС);  
		
		ТекСтрока.Удалить("НДС");
		ТекСтрока.Удалить("ПредИтогТабл");
		ТекСтрока.Удалить("Сумма");
		ТекСтрока.Удалить("СуммаБезНал");   
		
	КонецЦикла;
КонецФункции	

&НаКлиенте
Процедура СформироватьОснование(Док, Кэш) Экспорт

	ОснованиеМассив = СформироватьОснование_Общее(Док);
	
	Если НЕ ОснованиеМассив.Количество() Тогда
		ОснованиеМассив.Добавить(Новый Структура("Название", "Без документа-основания"));
	КонецЕсли;
	
	Док.Файл.Документ.Вставить("Основание", ОснованиеМассив);
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьОснование_Общее(Док) Экспорт

	ТекДокумент = Док.Файл.Документ;
	Если НЕ ТекДокумент.Свойство("Основание") Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Исключения = ПолучитьИсключенияОснование();
	ОснованиеМассив = Новый Массив;
	
	Для Каждого ТекСтрока ИЗ ТекДокумент.Основание Цикл
		
		Если ТекСтрока.Свойство("Тип") Тогда
			Ключ = "Тип";	
		Иначе
			Ключ = "Название";	
		КонецЕсли;
		
		Если Исключения.Получить(ТекСтрока[Ключ]) = Истина Тогда
			Продолжить;	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Название) Тогда
			Продолжить;	
		КонецЕсли;
		
		Если НЕ ТекСтрока.Свойство("Дата") Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Дата) И ТекСтрока.Название <> "-" Тогда
			Продолжить;	
		КонецЕсли; 
		
		Основание = Новый Структура("Номер, Название, Дата, ДопСвед");
		Основание.Название 	= ТекСтрока.Название;
		Основание.Номер 	= ТекСтрока.Номер;
		Основание.Дата 		= ТекСтрока.Дата;
		
		ТекСтрока.Свойство("ДопСвед", Основание.ДопСвед);
		
		ОснованиеМассив.Добавить(Основание);
		
	КонецЦикла;
	
	Возврат ОснованиеМассив;
	
КонецФункции

&НаКлиенте
Процедура СформироватьПараметры(Док, Кэш) Экспорт
	
	ТекФайл		= Док.Файл;
	ТекДокумент = ТекФайл.Документ;

	Если НЕ ТекДокумент.Свойство("Параметр") Тогда
		Возврат;
	КонецЕсли;
	
	мПараметры = ТекДокумент.Параметр;

	ДобавитьПараметрДокументаПоПути(ТекДокумент, мПараметры, "Получатель.GLN",			"GLNПокуп",			Кэш);
	ДобавитьПараметрДокументаПоПути(ТекДокумент, мПараметры, "Грузополучатель.GLN",		"GLNГрузПолуч",		Кэш);
	ДобавитьПараметрДокументаПоПути(ТекДокумент, мПараметры, "Отправитель.GLN",			"GLNПост",			Кэш);
	ДобавитьПараметрДокументаПоПути(ТекДокумент, мПараметры, "Грузоотправитель.GLN",	"GLNГрузОтпр",		Кэш);

	//Выгрузка наименований для физ.лиц
	ДобавитьПолноеИмяФизЛицаПоПути(ТекДокумент, мПараметры, "Отправитель",		"НаимПост",			Кэш);
	ДобавитьПолноеИмяФизЛицаПоПути(ТекДокумент, мПараметры, "Получатель",		"НаимПокуп",		Кэш);
	ДобавитьПолноеИмяФизЛицаПоПути(ТекДокумент, мПараметры, "Грузоотправитель",	"НаимГрузОтпр",		Кэш);
	ДобавитьПолноеИмяФизЛицаПоПути(ТекДокумент, мПараметры, "Грузополучатель",	"НаимГрузПолуч",	Кэш);

	ДобавитьПараметрДокументаПоПути(ТекФайл,	мПараметры,	"КодФормы",	"ИдВизуализации",	Кэш);
		
	мПараметры = ПолучитьПараметрыБезПустыхЗаписей(Кэш, мПараметры);
	
	Если мПараметры.Количество() <> 0 Тогда
		ТекДокумент.Вставить("Параметры", мПараметры);
	КонецЕсли;
	
КонецПроцедуры

