
&НаКлиенте
Функция ФайлДокумент_ОтправительГрузоотправительОнЖе(ФайлДокумент) Экспорт
	
	Перем ГрузоотправительАдрес, ОтправительАдрес, Грузоотправитель, Отправитель;
	
	Если	Не ФайлДокумент.Свойство("Отправитель",			Отправитель)
		Или	Не ФайлДокумент.Свойство("Грузоотправитель",	Грузоотправитель) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ГрузоотправительИНН	= ПолучитьРеквизитПоИмениСтороны(Грузоотправитель,	"Грузоотправитель", "ИНН");
	ГрузоотправительКПП	= ПолучитьРеквизитПоИмениСтороны(Грузоотправитель,	"Грузоотправитель", "КПП");
	ОтправительИНН		= ПолучитьРеквизитПоИмениСтороны(Отправитель,		"Отправитель",		"ИНН");
	ОтправительКПП		= ПолучитьРеквизитПоИмениСтороны(Отправитель,		"Отправитель",		"КПП");
	
	Если Не (	ГрузоотправительИНН = ОтправительИНН
			И 	ГрузоотправительКПП = ОтправительКПП) Тогда
		Возврат Ложь;
	КонецЕсли;
	//ИНН/КПП совпали, проверить адрес
	
	Если	Грузоотправитель.Свойство("Адрес", ГрузоотправительАдрес)	И ГрузоотправительАдрес.Количество() 
		И 	Отправитель.Свойство("Адрес", ОтправительАдрес)				И ОтправительАдрес.Количество() Тогда 
		ЕстьАдресаГО = Истина;
		
		Если ТипЗнч(ГрузоотправительАдрес) = Тип("Массив") Тогда
			Если ГрузоотправительАдрес.Количество() Тогда
				//Считаем первый адрес актуальным
				ГрузоотправительАдрес = ГрузоотправительАдрес[0];
			Иначе
				ЕстьАдресаГО = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(ОтправительАдрес) = Тип("Массив") Тогда 
			Если ОтправительАдрес.Количество() Тогда
				//Считаем первый адрес актуальным
				ОтправительАдрес = ОтправительАдрес[0]
			ИначеЕсли ЕстьАдресаГО Тогда
				//У грузоотправителя адрес есть, а у отправителя нет. Разные лица.
				Возврат Ложь;
			Иначе
				//Нет адресов
				Возврат Истина;	
			КонецЕсли;
		КонецЕсли;
		
		СтруктураАдрГрузоотп	= ОпределитьСтруктуруАдреса(ГрузоотправительАдрес);
		СтруктураАдрОтп			= ОпределитьСтруктуруАдреса(ОтправительАдрес);

		Если		СтруктураАдрГрузоотп.Свойство("АдрТекст") И СтруктураАдрОтп.Свойство("АдрТекст") Тогда
			Возврат СтруктураАдрГрузоотп.АдрТекст = СтруктураАдрОтп.АдрТекст;
		ИначеЕсли   СтруктураАдрГрузоотп.Свойство("АдрТекст") Тогда
			//Разная структура адреса.
			Возврат Ложь;
		Иначе
			//Пока не обрабатываем, считаем что совпадает.
		КонецЕсли;
		
	КонецЕсли;

	Возврат Истина;	
	
КонецФункции

&НаКлиенте
Функция ПолучитьРеквизитПоИмениСтороны(Сторона, ИмяСтороны, ИмяРеквизита)
	
	Попытка
		Если Сторона.Свойство("СвЮл") Тогда
			Значение = Сторона.СвЮл[ИмяРеквизита];	
		ИначеЕсли Сторона.Свойство("СвФл") Тогда
			Значение = Сторона.СвФл[ИмяРеквизита];	
		ИначеЕсли Сторона.Свойство("СвИп") Тогда
			Значение = Сторона.СвИп[ИмяРеквизита];	
		Иначе
			Значение = Неопределено;	
		КонецЕсли;
	Исключение
		Значение = Неопределено;	
	КонецПопытки;
	
	Возврат Значение; 
	
КонецФункции

&НаКлиенте
Процедура СформироватьПараметрыСтроки(Кэш, ТекСтрока) Экспорт
	Перем мПараметрыСтроки;
	
	Если Не ТекСтрока.Свойство("Параметр", мПараметрыСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока.Параметр = ПолучитьПараметрыБезПустыхЗаписей(Кэш, мПараметрыСтроки);
	
КонецПроцедуры

// Процедура - формирует дополнительные параметры по строке табличной части документа
//
// Параметры:
//  Кэш			 - Структура	 -  Кэш обработки
//  ТекСтрока	 - Структура	 -  Обрабатываемая строка
//
&НаКлиенте
Процедура СформироватьИнфПол(Кэш, ТекСтрока) Экспорт 
	
	мИнфПол = Новый Массив; 
	
	Если ТекСтрока.Свойство("Идентификатор") Тогда
		мИнфПол.Добавить(Новый Структура("Имя, Значение", "ИД", ГенераторПривестиТип(ТекСтрока.Идентификатор)));
	КонецЕсли;
	
	Если ТекСтрока.Свойство("Параметр") Тогда
		Исключения = ПолучитьИсключенияИнфПол();
		Для Каждого ТекПараметр ИЗ ТекСтрока.Параметр Цикл
			
			Если Исключения.Получить(ТекПараметр.Имя) = Истина Тогда
				Продолжить;	
			КонецЕсли;
			
			мИнфПол.Добавить(Новый Структура("Имя, Значение", ТекПараметр.Имя,  ГенераторПривестиТип(ТекПараметр.Значение)));
			
		КонецЦикла;
	КонецЕсли;
	
	мИнфПол = ПолучитьПараметрыБезПустыхЗаписей(Кэш, мИнфПол);
	
	Если мИнфПол.Количество() <> 0 Тогда
		ТекСтрока.Вставить("ИнфПол", мИнфПол);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСведПрослеж(Кэш, ТекСтрока) Экспорт
	
	Если НЕ ТекСтрока.Свойство("СведПрослеж") Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеЧисел = Новый ОписаниеТипов("Число");
		
	Для Каждого ТекРНПТ ИЗ ТекСтрока.СведПрослеж Цикл
		
		Если ТекРНПТ.Свойство("СтТовБезНДСПрослеж")
			И ЗначениеЗаполнено(ТекРНПТ.СтТовБезНДСПрослеж)
			И ЗначениеЗаполнено(ОписаниеЧисел.ПривестиЗначение(ТекРНПТ.СтТовБезНДСПрослеж)) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекРНПТ.Свойство("ЕдИзмПрослеж")
			И ТекСтрока.Свойство("ОКЕИ")
			И ТекРНПТ.ЕдИзмПрослеж = ТекСтрока.ОКЕИ Тогда
			
			Цена				= ОписаниеЧисел.ПривестиЗначение(ТекСтрока.Цена);
			КолВЕдПрослеж		= ОписаниеЧисел.ПривестиЗначение(ТекРНПТ.КолВЕдПрослеж); 	
			КоличествоУчетное	= ОписаниеЧисел.ПривестиЗначение(ТекСтрока.Кол_во);
			СуммаБезНал 		= ОписаниеЧисел.ПривестиЗначение(ТекСтрока.СуммаБезНал);
			
			// Убедиться, что прослеживаемые комплекты, поддержанные в 25.3100 работают корректно.
			// Изначальный пересчет работает некорректно, т.к. цена и так рассчетная.
			
			Если КоличествоУчетное = КолВЕдПрослеж Тогда  
				
				ТекРНПТ.Вставить("СтТовБезНДСПрослеж", Формат(СуммаБезНал, "ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=")); 
				
			Иначе
				
				ТекРНПТ.Вставить("СтТовБезНДСПрослеж", Формат(Цена * КолВЕдПрослеж, "ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ="));    
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыБезПустыхЗаписей(Кэш, МассивПараметров) Экспорт 
	
	МассивПараметровИсходящий = Новый Массив;
	
	Для Каждого ТекСтрока ИЗ МассивПараметров Цикл
		
		Если НЕ ТекСтрока.Свойство("Имя") ИЛИ НЕ ТекСтрока.Свойство("Значение") Тогда
			Продолжить;	
		КонецЕсли;
		
		ФорматноеЗначение = ГенераторПривестиТип(ТекСтрока.Значение);
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Значение) Тогда
			Продолжить;	
		КонецЕсли;
		
		МассивПараметровИсходящий.Добавить(Новый Структура("Имя, Значение", ТекСтрока.Имя, ТекСтрока.Значение));
		
	КонецЦикла;
	
	Возврат МассивПараметровИсходящий;
	
КонецФункции

&НаКлиенте
Функция ПолучитьИсключенияИнфПол() Экспорт 
	
	ИсключенияИнфПол = Новый Соответствие;
	ИсключенияИнфПол.Вставить("ИдГосКон",				Истина);
	ИсключенияИнфПол.Вставить("СвТранГруз",				Истина);
	ИсключенияИнфПол.Вставить("ДатаПер",				Истина);
	ИсключенияИнфПол.Вставить("РабОргПрод_Должность",	Истина);
	ИсключенияИнфПол.Вставить("РабОргПрод_ФИО",			Истина);
	ИсключенияИнфПол.Вставить("ИнЛицо_Должность",		Истина);
	ИсключенияИнфПол.Вставить("ИнЛицо_ФИО",				Истина);
	ИсключенияИнфПол.Вставить("ИнЛицо_НаимОргПер",		Истина);
	ИсключенияИнфПол.Вставить("СвПерВещ",				Истина);
	ИсключенияИнфПол.Вставить("НомерГТД",				Истина); 
	ИсключенияИнфПол.Вставить("ОбстФормСЧФ",			Истина);  
	ИсключенияИнфПол.Вставить("СпОбстФСЧФ",				Истина);
	ИсключенияИнфПол.Вставить("СпОбстФСЧФДОП",			Истина);
	ИсключенияИнфПол.Вставить("СпОбстФДОП",				Истина);
	ИсключенияИнфПол.Вставить("КодВидТов",				Истина); 
	ИсключенияИнфПол.Вставить("СодОпер",				Истина);
	
	Возврат ИсключенияИнфПол;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьСведенияGLNПоИмениСтороны(Кэш, ТекДокумент, ИмяСтороны, МассивПараметров, Ключ)
    Перем Данные;
	
	Если	Не ТекДокумент.Свойство(ИмяСтороны, Данные)
		Или	Не Данные.Свойство("GLN") Тогда
		Возврат;	
	КонецЕсли;
	
	МассивПараметров.Добавить(Новый Структура("Имя, Значение", Ключ, Данные.GLN));
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПараметрДокументаПоПути(ТекДокумент, МассивПараметров, ПутьПараметра, ИмяПараметра, Кэш) Экспорт
    Перем Данные;
	
	лПутьПараметра	= СтрЗаменить(ПутьПараметра, ".", Символы.ПС);
	Данные			= ТекДокумент;
	Для Стр = 1 По СтрЧислоСтрок(лПутьПараметра) Цикл
		Если Не Данные.Свойство(СтрПолучитьСтроку(лПутьПараметра, Стр), Данные) Тогда
		Возврат;	
	КонецЕсли;
	КонецЦикла;
	
	МассивПараметров.Добавить(Новый Структура("Имя, Значение", ИмяПараметра, Данные));
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПолноеИмяФизЛицаПоПути(ТекДокумент, МассивПараметров, ПутьПараметра, ИмяПараметра, Кэш) Экспорт
    Перем Данные;
	
	Если	Не ТекДокумент.Свойство(ПутьПараметра, Данные)
		Или Не ЗначениеЗаполнено(Данные)
		Или	Не Данные.Свойство("СвФЛ") Тогда
		//Нет данных стороны, либо это не физ. лицо.
		Возврат;
	КонецЕсли;
	
	ДобавитьПараметрДокументаПоПути(Данные, МассивПараметров, "Название", ИмяПараметра, Кэш)
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСтрТаблПараметр(Кэш, ТекСтрока) Экспорт 
	
	Если НЕ ТекСтрока.Свойство("Параметр") тогда
		Возврат;	
	КонецЕсли;
	
	КоличествоПереложенныхПараметров = 0;
	
	Для Каждого ТекПараметр ИЗ ТекСтрока.Параметр Цикл
		
		Если ТекПараметр.Имя = "НомерГТД" Тогда
			ТекСтрока.Вставить("ГТД", СокрЛП(ТекПараметр.Значение));
			КоличествоПереложенныхПараметров = КоличествоПереложенныхПараметров + 1;
		КонецЕсли;
		
		Если ТекПараметр.Имя = "КодВидТов" Тогда
			ТекСтрока.Вставить("КодВидТов", СокрЛП(ТекПараметр.Значение));
			КоличествоПереложенныхПараметров = КоличествоПереложенныхПараметров + 1;
		КонецЕсли;
		
		Если КоличествоПереложенныхПараметров = 2 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИсключенияОснование() Экспорт 
	
	ИсключенияИнфПол = Новый Соответствие;
	ИсключенияИнфПол.Вставить("ПРД", Истина);
	ИсключенияИнфПол.Вставить("СчФ", Истина);
	ИсключенияИнфПол.Вставить("КСчФ", Истина);
	ИсключенияИнфПол.Вставить("ИспрСчФ", Истина);
	ИсключенияИнфПол.Вставить("ИсхСчФ", Истина);
	ИсключенияИнфПол.Вставить("ИспрИсхСчФ", Истина);
	ИсключенияИнфПол.Вставить("ДокПодтвОтгр", Истина);
	
	Возврат ИсключенияИнфПол;
	
КонецФункции

