
// Функция - расшифровывает указанный файл
//
// Параметры:
//  Кэш			 - ЛокальныйКэш	 - экземпляр кэш
//  ФайлЗначение - Структура	 - с полем Ссылка, ДвоичныеДанные(Н)
// 
// Возвращаемое значение:
//  Строка - расшифрованные данные, если успешно
//
&НаКлиенте
функция РасшифроватьФайлВложения(Кэш, ФайлВложения) экспорт
    Перем ДвоичныеДанныеBase64;
	
	ОшибкаРасшифровки = МодульОбъектаКлиент().НовыйСбисИсключение(	, 
																	"API3.РасшифроватьФайлВложения",
																	735,
																	,
																	"На способе обмена API отсутствует возможность работы с зашифрованными документами.",
																	,
																	"https://sbis.ru/help/integration/1C_set/modul/exchange");
	ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Представление(ОшибкаРасшифровки);
	
КонецФункции

// Функция - расшифровывает указанный файл
//
// Параметры:
//  ФайлЗначение - Структура	 - с полем Ссылка, ДвоичныеДанные(Н)
// 
// Возвращаемое значение:
//  Строка - расшифрованные данные, если успешно
//
&НаКлиенте
функция ПрочитатьФайлВложения(ФайлВложения, ДопПараметры = Неопределено) Экспорт 
    Перем ДвоичныеДанныеBase64;
	
	Возврат ПолучитьДанныеФайла(МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш(), ФайлВложения.Ссылка);
	
КонецФункции

