
//DynamicDirective

// Функция - Применить формат к строке
//
// Параметры:
//  ФорматнаяСтрока			 - Строка	 - к которой применяется формат
//  ПараметрыФорматнойСтроки - Структура/Соответствие/Массив	 - в зависимости от формата
//  КлючФормата				 - Строка	 - как отформатировать строку. Подробнее - смотреть по ключу в коде
// 
// Возвращаемое значение:
//  Строка - отформатированный результат
//
Функция ПрименитьФорматКСтроке(ФорматнаяСтрока, ПараметрыФорматнойСтроки = Неопределено, КлючФормата = "СтрШаблон") Экспорт
	
	КлючПроверка = НРег(КлючФормата);
	
	Если КлючПроверка = "стршаблон" Тогда
		
		// Применяет шаблон, в зависимости от типа ПараметрыФорматнойСтроки строки
		
		// ПараметрыФорматнойСтроки - Структура/Фиксированная структура/Соответствие - {"МойКлюч1": "Hello", "МойКлюч2": "world"}
		// Пример: "{МойКлюч1} {МойКлюч2}" - > "Hello world", 
		
		// ПараметрыФорматнойСтроки - Массив/Фиксированный Массив - ["Hello", "world"]
		// Пример "{0} {1}" - > "Hello world"
		
		// ПараметрыФорматнойСтроки - Строка - "sad" удалит из шаблона
		// Пример "Hello sad world" - > "Hello world"
		
		// Возможно, надо добавить выпиливание параметров, к которым не приминился шаблон
		НоваяФорматнаяСтрока = ФорматнаяСтрока;
		Если	ТипЗнч(ПараметрыФорматнойСтроки) = Тип("Структура")
			Или	ТипЗнч(ПараметрыФорматнойСтроки) = Тип("ФиксированнаяСтруктура")
			Или	ТипЗнч(ПараметрыФорматнойСтроки) = Тип("Соответствие") Тогда
			
			Для Каждого КлючИЗначение Из ПараметрыФорматнойСтроки Цикл
				
				НоваяФорматнаяСтрока = СтрЗаменить(НоваяФорматнаяСтрока, "{" + КлючИЗначение.Ключ + "}", КлючИЗначение.Значение);
				
			КонецЦикла;
			
		ИначеЕсли	ТипЗнч(ПараметрыФорматнойСтроки) = Тип("Массив")
			Или		ТипЗнч(ПараметрыФорматнойСтроки) = Тип("ФиксированныйМассив") Тогда
			
			Для ИндексСтрок = 0 По ПараметрыФорматнойСтроки.Количество() - 1 Цикл
				
				НоваяФорматнаяСтрока = СтрЗаменить(НоваяФорматнаяСтрока, "{" + ИндексСтрок + "}", ПараметрыФорматнойСтроки[ИндексСтрок]);
				
			КонецЦикла;
			
		Иначе
			
			НоваяФорматнаяСтрока = СтрЗаменить(НоваяФорматнаяСтрока, "{СтрШаблон}", ПараметрыФорматнойСтроки);
			
		КонецЕсли;
	
	ИначеЕсли	КлючПроверка = "стрзаменить" Тогда
		
		// Делает последовательно замены по ключу
		// Пример: "МойКлюч1 МойКлюч2" - "Hello world", 
		// ПараметрыФорматнойСтроки - Структура, Фиксированная структура, либо Соответствие - {"МойКлюч1": "Hello", "МойКлюч2": "world"}

		НоваяФорматнаяСтрока = ФорматнаяСтрока;
		
		Для Каждого КлючИЗначение Из ПараметрыФорматнойСтроки Цикл
			
			НоваяФорматнаяСтрока = СтрЗаменить(НоваяФорматнаяСтрока, КлючИЗначение.Ключ, КлючИЗначение.Значение);
			
		КонецЦикла;
		
	ИначеЕсли	КлючПроверка = "убрать" Тогда
		
		// Делает последовательно удаления символов из строки
		// Пример "He@l$lo world?" -> "Hello world"
		// ПараметрыФорматнойСтроки - Строка - "@$?"
		
		НоваяФорматнаяСтрока = ФорматнаяСтрока;
		Если ПараметрыФорматнойСтроки = Неопределено Тогда
			
			ПараметрыФорматнойСтроки =  "@/-?=\& ""'#№*(:|;).";
			
		КонецЕсли;
		
		Для	Шаг	= 1	По СтрДлина(ПараметрыФорматнойСтроки) Цикл
			
			НоваяФорматнаяСтрока = СтрЗаменить(НоваяФорматнаяСтрока, Сред(ПараметрыФорматнойСтроки, Шаг, 1), "");
			
		КонецЦикла;
		
	ИначеЕсли	КлючПроверка = "оставить" Тогда
		
		// Оставляет строку только с описанными символами
		// Пример "1H2e@3l4$5l6o w7o8r9l0d?" -> "Hello world"
		// ПараметрыФорматнойСтроки - Строка - "HhelloWworld "

		Если ПараметрыФорматнойСтроки = Неопределено Тогда
			
			Возврат ФорматнаяСтрока;
			
		КонецЕсли;
		
		НоваяФорматнаяСтрока = "";
		Для	Шаг	= 1	По СтрДлина(ФорматнаяСтрока) Цикл
			
			СимволПроверка = Сред(ФорматнаяСтрока, Шаг, 1);
			Если Не Найти(ПараметрыФорматнойСтроки, СимволПроверка) Тогда
				
				Продолжить;
				
			КонецЕсли;
			НоваяФорматнаяСтрока = НоваяФорматнаяСтрока + СимволПроверка;
			
		КонецЦикла;
		
	ИначеЕсли	КлючПроверка = "ключструктуры" Тогда
		
		// Приводит входящую строку так, чтобы ее можно использовать как ключ структуры
		// Пример "1H2e@3l4$5l6o w7o8r9l0d?" -> "Helloworld"

		НоваяФорматнаяСтрока = ПрименитьФорматКСтроке(ФорматнаяСтрока,, "Убрать");
		Если Найти("0123456789", Лев(НоваяФорматнаяСтрока, 1)) Тогда
			
			//Первый символ - число. Добавить префикс(в структуре ключ не может начинаться с числа)
			НоваяФорматнаяСтрока = "_" + НоваяФорматнаяСтрока;
			
		КонецЕсли;
		
	ИначеЕсли	КлючПроверка = "формат" Тогда
		
		// Обетка над формат
		НоваяФорматнаяСтрока = Формат(ФорматнаяСтрока, ПараметрыФорматнойСтроки);
		
	ИначеЕсли	КлючПроверка = "каталог" Тогда
		
		// Собрать путь к каталогу с разделителем
		ТипОС = СведенияОСКонтекста().Тип;
		
		сРазделитель = "\";
		Если ТипОС = "linux" Тогда
			
			сРазделитель = "/";
			
		КонецЕсли;
		
		НоваяФорматнаяСтрока = ФорматнаяСтрока + ?(Прав(ФорматнаяСтрока, 1) = сРазделитель, "", сРазделитель);
		Если Не ПараметрыФорматнойСтроки = Неопределено Тогда
			
			ФорматЗаменить = Новый Соответствие;
			ФорматЗаменить.Вставить("/", " ");
			ФорматЗаменить.Вставить("\", " ");
			
			Если ТипЗнч(ПараметрыФорматнойСтроки) = Тип("Массив") Тогда
			
				// Добавить путь к основному 
				Для Каждого ЭлементПути Из ПараметрыФорматнойСтроки Цикл
					
					НоваяФорматнаяСтрока = НоваяФорматнаяСтрока + ПрименитьФорматКСтроке(ЭлементПути, ФорматЗаменить, "СтрЗаменить") + сРазделитель;
					
				КонецЦикла;
				
			Иначе
				
				// Добавить путь к основному 
				НоваяФорматнаяСтрока = НоваяФорматнаяСтрока + ПрименитьФорматКСтроке(ПараметрыФорматнойСтроки, ФорматЗаменить, "СтрЗаменить") + сРазделитель;
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли	КлючПроверка = "файл" Тогда
		
		НоваяФорматнаяСтрока = ПрименитьФорматКСтроке(ФорматнаяСтрока, ПараметрыФорматнойСтроки, "Каталог");
		НоваяФорматнаяСтрока = Сред(НоваяФорматнаяСтрока, 1, СтрДлина(НоваяФорматнаяСтрока) - 1);

	Иначе
		
		НоваяФорматнаяСтрока = ФорматнаяСтрока;
		
	КонецЕсли;
	
	Возврат НоваяФорматнаяСтрока;	

КонецФункции

//DynamicDirective

//Функция преобразует строку формата "25.10.2023 21.20.54" или "25.10.2023" в дату 
//для способа обмена SabyHttpsClient, где дата в ответах приходит строкой
Функция ДатаИзСтроки(str) Экспорт
	
	Если ТипЗнч(str) = Тип("Дата") Тогда
		Возврат str;
	КонецЕсли;
	
	Результат = str;
	
	Если	Сред(str,3,1) = "."
		И	Сред(str,6,1) = "." Тогда
		//Переопределим значение как дату, если это действительно она
		Если		СтрДлина(str) = 10 Тогда
			Попытка
				Результат = Дата(Сред(str,7,4), Сред(str,4,2), Лев(str, 2));
			Исключение
				//В случае исключения, ничего не делаем. Это не дата, значение не меняется
			КонецПопытки;
		ИначеЕсли	СтрДлина(str) = 19 Тогда 
			Попытка
				Результат = Дата(Сред(str,7,4), Сред(str,4,2), Лев(str, 2), Сред(str,12, 2), Сред(str,15, 2), Сред(str,18, 2))
			Исключение
				//В случае исключения, ничего не делаем. Это не дата, значение не меняется
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

