
&НаКлиенте
Процедура Асинх_СБИС_СписокСертификатов(АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт
	
	ОшибкаВызова		= Ложь;
	МодульОбъектаКлиент	= МодульОбъектаКлиент();
	Кэш					= МодульОбъектаКлиент.ПолучитьТекущийЛокальныйКэш();
	АргументДляВызова	= АсинхроннаяСБИСКоманда.АргументВызова;
	Если АргументДляВызова = Неопределено Тогда
		АргументДляВызова = Новый Структура;
	КонецЕсли;
	
	КомандаПлагина	= НовыйКомандаСБИСПлагин(Кэш, АсинхроннаяСБИСКоманда, Новый Структура("Метод", "ReadCertList"));
	КомандаПлагина.Параметры	= Новый Структура("Filter", АргументДляВызова);
	РезультатВызова				= СБИС_ОтправитьКомандуБезОбработки(Кэш, КомандаПлагина, Новый Структура, ОшибкаВызова);
	
	АсинхроннаяСБИСКоманда.ВремяВызова = КомандаПлагина.ВремяВызова;
	
	Если ОшибкаВызова Тогда
		МодульОбъектаКлиент.ВызватьСбисИсключение(РезультатВызова, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_ОтправитьКоманду_Асинхронно");
	КонецЕсли;
	
КонецПроцедуры

