
//DynamicDirective

Функция ВыполнитьАвторизациюSABY(ПараметрыАвторизацииВходщие = Неопределено, Отказ)
	Перем РежимАвторизации, АвторизацияПоТокену, АвторизацияПоСертфиикату, 
		ИсточникПолейАвторизации, ОбработчикПродолжить, ОшибкаАвторизации,
		ЛогинЗначение, ПарольЗначение;

	Если Не ГлобальныйКэш.СБИС.ОбменВключен Тогда
		
		ОшибкаАвторизации = НовыйСбисИсключение("Не включен обмен с Saby", 
			"МодульОбъектаКлиент.АвторизоватьсяВSABY",
			412,
			,
			"Измените способ обмена в настройках соединения.");
		Отказ = Истина;
		Возврат ОшибкаАвторизации;
		
	КонецЕсли;

	АвторизацияПоТокенуАвто			= ПолучитьПараметрПользователя("ВходПоТокену");
	АвторизацияПоСертификатуАвто	= ПолучитьПараметрПользователя("ЗапомнитьСертификат");
	АвторизацияПоЛогинПарольАвто	= ПолучитьПараметрПользователя("ЗапомнитьПароль");

	Если ПараметрыАвторизацииВходщие = Неопределено Тогда
		
		АвторизацияПоТокену			= АвторизацияПоТокенуАвто;
		АвторизацияПоСертфиикату	= ПолучитьПараметрПользователя("ВходПоСертификату");
		ИсточникПолейАвторизации	= Новый ФиксированнаяСтруктура;
		
	Иначе
		
		ПараметрыАвторизацииВходщие.Свойство("Режим",				РежимАвторизации);
		ПараметрыАвторизацииВходщие.Свойство("ВходПоТокену",		АвторизацияПоТокену);
		ПараметрыАвторизацииВходщие.Свойство("ВходПоСертификату",	АвторизацияПоСертфиикату);
		ИсточникПолейАвторизации	= ПараметрыАвторизацииВходщие;

	КонецЕсли;
	
	Если РежимАвторизации = Неопределено Тогда
		
		// Определить режим для авторизации
		ОписаниеБулево = Новый ОписаниеТипов("Булево");
		Если ОписаниеБулево.ПривестиЗначение(АвторизацияПоТокену) Тогда
			
			РежимАвторизации = "ПоТокену";
			
		ИначеЕсли ОписаниеБулево.ПривестиЗначение(АвторизацияПоСертфиикату)  Тогда
			
			РежимАвторизации = "ПоСертификату";
			
		Иначе
			
			РежимАвторизации = "ПоЛогинуПаролю";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Кэш						= ПолучитьТекущийЛокальныйКэш();
	МодульИнтеграцииSaby	= ПараметрSABY("Интеграция", "Сеанс");
	РежимАвторизации		= НРег(РежимАвторизации);
	
	Отказ = Ложь;
	
	Если		РежимАвторизации = "потокену"			Тогда
		
		Результат = МодульИнтеграцииSaby.АвторизоватьсяПоТокену(Кэш, Отказ);
		
	ИначеЕсли	РежимАвторизации = "посертификату"		Тогда
		
		Если ИсточникПолейАвторизации.Свойство("Сертификат") Тогда
		
			СертификатАвторизации = ИсточникПолейАвторизации.Сертификат;
			
		ИначеЕсли АвторизацияПоСертификатуАвто Тогда
			
			// Берем сохраненный сертификат только при активной опции "Запомнить сертификат"
			СертификатАвторизации = ПолучитьПараметрПользователя("Сертификат");
			
		Иначе
			
			ОшибкаАвторизации = НовыйСбисИсключение(785, "МодульОбъектаКлиент.АвторизоватьсяВSABY",,"Не указан сертификат для авторизации");
			Отказ = Истина;
			Возврат ОшибкаАвторизации;
			
		КонецЕсли;
		
		Результат = МодульИнтеграцииSaby.АвторизоватьсяПоСертификату(Кэш, СертификатАвторизации, Отказ);
		
	ИначеЕсли	РежимАвторизации = "пологинупаролю"	Тогда
		
		Если	ИсточникПолейАвторизации.Свойство("Логин")
			И	ИсточникПолейАвторизации.Свойство("Пароль") Тогда
		
			ЛогинЗначение	= ИсточникПолейАвторизации.Логин;
			ПарольЗначение	= ИсточникПолейАвторизации.Пароль;
			
		ИначеЕсли АвторизацияПоЛогинПарольАвто Тогда
			
			ЛогинЗначение	= ПолучитьПараметрПользователя("Логин");
			ПарольЗначение	= ПолучитьПараметрПользователя("Пароль");
			
		Иначе
			
			//Может быть авторизация без логина пароля на каталоге
			
		КонецЕсли;                      	
		Результат		= АвторизоватьсяПоЛогинуПаролю(ЛогинЗначение, ПарольЗначение, Отказ);
		
		ЛогинЗначение	= "";
		ПарольЗначение	= "";
		
	Иначе
		
		ОшибкаАвторизации = НовыйСбисИсключение("Неизвестный способ авторизации в Saby",
			"МодульОбъектаКлиент.АвторизоватьсяВSABY",,,,
			Новый Структура("Режим", РежимАвторизации)); 
			
		Отказ = Истина;
		Возврат ОшибкаАвторизации;
		
	КонецЕсли;
	
	Возврат Результат;
			
КонецФункции

//DynamicDirective

// Авторизуется по логину/паролю	
Функция АвторизоватьсяПоЛогинуПаролю(Логин, Пароль, Отказ=Ложь)	

	Если Не ЗначениеЗаполнено(Логин) Тогда
	
		ОшибкаАвторизации = НовыйСбисИсключение(785, "МодульОбъекта.КлиентСервер.АвторизоватьсяПоЛогинуПаролю",,"Не указаны логин/пароль для авторизации");
		Отказ = Истина;
		Возврат ОшибкаАвторизации;
		
	КонецЕсли;
	
	СтруктураПараметровЗапроса = Новый Структура("Логин, Пароль", Логин, Пароль);
	Кэш = ПолучитьТекущийЛокальныйКэш();

	Аккаунты = ПараметрSaby("Аккаунты", "Технический");
	Если Не Аккаунты = Неопределено Тогда
		
		АккаунтПоЛогину = Аккаунты.Получить(СтруктураПараметровЗапроса.Логин);
		Если НЕ АккаунтПоЛогину = Неопределено Тогда
			
			СтруктураПараметровЗапроса.Вставить("Аккаунт", АккаунтПоЛогину);
			
		КонецЕсли;
		
	КонецЕсли;

	РезультатАвторизации = Новый Структура;
	РезультатАвторизации.Вставить("Результат", ВыполнитьСинхроннуюКомандуТранспорта(Кэш, "СБИС_Аутентифицировать", СтруктураПараметровЗапроса,,Отказ));
	
	Возврат ОценитьРезультатАвторизации(РезультатАвторизации, Отказ);
	
КонецФункции

//DynamicDirective

// Функция - выполняет расшировку токена авторизации средствами 1С
//
// Параметры:
//  ДвоичныеДанныеТокена - Строка(ДвоичныеДанные) - результат авторизации по сертификату/подтверждение авторизации по сертификату
// 
// Возвращаемое значение:
//  Строка(УИД) - полученный ИД сессии в готовом виде
//
Функция РасшироватьТокенАвторизации(ДвоичныеДанныеТокена) Экспорт
	
	ДвоичныеДанные		= Base64Значение(ДвоичныеДанныеТокена);  
	ИмяВрФ				= НовыйВременныйФайл(,"txt");
	МодульКриптографии	= ПолучитьЗначениеПараметраТекущегоСеанса("Криптография1С");
	
	Попытка
		
		МодульКриптографии.сбисРасшифровать(ПолучитьТекущийЛокальныйКэш(), ДвоичныеДанные, ИмяВрФ);
		
	Исключение
		
		ОшибкаРасшифровать = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.РасшироватьТокенАвторизации", 785);
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаРасшифровать);
		
	КонецПопытки;
	
	ЧтениеОтвета	= Новый ЧтениеТекста(ИмяВрФ, КодировкаТекста.UTF8, Символы.ПС);
	Результат		= ЧтениеОтвета.Прочитать();
	ЧтениеОтвета.Закрыть();
	
	ОсвободитьВременныйФайл(ИмяВрФ, Истина);
	
	Возврат Результат;
	
КонецФункции

//DynamicDirective

// Функция - проверка результата авторизации
//
// Параметры:
//  ПараметрыРезультата	 - Структура	 - Параметры оценки
//		Результат:			Строка/СбисИсключение	- результат выполнения методов авторизации - по логину/сертификату/токену/подтверждение и пр.
//		РасшифроватьТокен:	Булево					- необходимость выполнить расшифровку токена криптографией 1С
//  Отказ				 - Булево		 - признак наличия ошибки
// 
// Возвращаемое значение:
//  ИдСессии/СбисИсключение - результат авторизации
//
Функция ОценитьРезультатАвторизации(ПараметрыРезультата, Отказ) Экспорт
	
	РезультатАвторизации	= ПараметрыРезультата.Результат;
	РасшифроватьТокен		=	ПараметрыРезультата.Свойство("РасшифроватьТокен")
							И	ПараметрыРезультата.РасшифроватьТокен;

	Если Не Отказ Тогда
		
		Если РасшифроватьТокен Тогда
			
			Попытка
			
				РезультатАвторизации = РасшироватьТокенАвторизации(РезультатАвторизации);
				
			Исключение
				
				Отказ = Истина;
				Возврат НовыйСбисИсключение(ИнформацияОбОшибке(),
											"API.АвторизоватьсяПоСертификату",
											785,
											"Ошибка 1С при выполнении метода ""Расшифровать""")
				
			КонецПопытки;
			
		КонецЕсли;
		
		ИзменитьПараметрСбис("Авторизован",	Истина);
		
		Возврат РезультатАвторизации;
		
	ИначеЕсли РезультатАвторизации.code = 303 Тогда
		
		РезультатАвторизации.data.Вставить("РасшифроватьТокен", РасшифроватьТокен);
	
	ИначеЕсли РезультатАвторизации.details = "Для входа введите полученный код подтверждения." Тогда
		
		РезультатАвторизации.message= "Требуется подтверждение действия";
		РезультатАвторизации.code	= 303;
		
	КонецЕсли;
	
	Возврат РезультатАвторизации;
	
КонецФункции

