
//DynamicDirective

Функция ВыполнитьАвторизациюSABY(ПараметрыАвторизацииВходщие = Неопределено, Отказ)
	Перем РежимАвторизации, АвторизацияПоТокену, АвторизацияПоСертфиикату, 
		ИсточникПолейАвторизации, ОбработчикПродолжить, ОшибкаАвторизации,
		ЛогинЗначение, ПарольЗначение;

	Если Не ГлобальныйКэш.СБИС.ОбменВключен Тогда
		
		ОшибкаАвторизации = НовыйСбисИсключение(775102, 
			"МодульОбъектаКлиент.АвторизоватьсяВSABY",
			,,
			"Измените способ обмена в настройках соединения.");
		Отказ = Истина;
		Возврат ОшибкаАвторизации;
		
	КонецЕсли;

	АвторизацияПоТокенуАвто			= ПолучитьПараметрПользователя("ВходПоТокену");
	АвторизацияПоСертификатуАвто	= ПолучитьПараметрПользователя("ЗапомнитьСертификат");
	АвторизацияПоЛогинПарольАвто	= ПолучитьПараметрПользователя("ЗапомнитьПароль");

	Если ПараметрыАвторизацииВходщие = Неопределено Тогда
		
		АвторизацияПоТокену			= АвторизацияПоТокенуАвто;
		АвторизацияПоСертфиикату	= ПолучитьПараметрПользователя("ВходПоСертификату");
		ИсточникПолейАвторизации	= Новый ФиксированнаяСтруктура;
		
	Иначе
		
		ПараметрыАвторизацииВходщие.Свойство("Режим",				РежимАвторизации);
		ПараметрыАвторизацииВходщие.Свойство("ВходПоТокену",		АвторизацияПоТокену);
		ПараметрыАвторизацииВходщие.Свойство("ВходПоСертификату",	АвторизацияПоСертфиикату);
		ИсточникПолейАвторизации	= ПараметрыАвторизацииВходщие;

	КонецЕсли;
	
	Если РежимАвторизации = Неопределено Тогда
		
		// Определить режим для авторизации
		ОписаниеБулево = Новый ОписаниеТипов("Булево");
		Если ОписаниеБулево.ПривестиЗначение(АвторизацияПоТокену) Тогда
			
			РежимАвторизации = "ПоТокену";
			
		ИначеЕсли ОписаниеБулево.ПривестиЗначение(АвторизацияПоСертфиикату)  Тогда
			
			РежимАвторизации = "ПоСертификату";
			
		Иначе
			
			РежимАвторизации = "ПоЛогинуПаролю";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Кэш						= ПолучитьТекущийЛокальныйКэш();
	МодульИнтеграцииSaby	= ПараметрSABY("Интеграция", "Сеанс");
	РежимАвторизации		= НРег(РежимАвторизации);
	
	Отказ = Ложь;
	
	Если		РежимАвторизации = "потокену"			Тогда
		
		Результат = МодульИнтеграцииSaby.АвторизоватьсяПоТокену(Кэш, Отказ);
		
	ИначеЕсли	РежимАвторизации = "посертификату"		Тогда
		
		Если ИсточникПолейАвторизации.Свойство("Сертификат") Тогда
		
			СертификатАвторизации = ИсточникПолейАвторизации.Сертификат;
			
		ИначеЕсли АвторизацияПоСертификатуАвто Тогда
			
			// Берем сохраненный сертификат только при активной опции "Запомнить сертификат"
			СертификатАвторизации = ПолучитьПараметрПользователя("Сертификат");
			
		Иначе
			
			ОшибкаАвторизации = НовыйСбисИсключение(785, "МодульОбъектаКлиент.АвторизоватьсяВSABY",,"Не указан сертификат для авторизации");
			Отказ = Истина;
			Возврат ОшибкаАвторизации;
			
		КонецЕсли;
		
		Результат = МодульИнтеграцииSaby.АвторизоватьсяПоСертификату(Кэш, СертификатАвторизации, Отказ);
		
	ИначеЕсли	РежимАвторизации = "пологинупаролю"	Тогда
		
		Если	ИсточникПолейАвторизации.Свойство("Логин")
			И	ИсточникПолейАвторизации.Свойство("Пароль") Тогда
		
			ЛогинЗначение	= ИсточникПолейАвторизации.Логин;
			ПарольЗначение	= ИсточникПолейАвторизации.Пароль;
			
		ИначеЕсли АвторизацияПоЛогинПарольАвто Тогда
			
			ЛогинЗначение	= ПолучитьПараметрПользователя("Логин");
			ПарольЗначение	= ПолучитьПараметрПользователя("Пароль");
			
		Иначе
			
			//Может быть авторизация без логина пароля на каталоге
			
		КонецЕсли;                      	
		Результат		= АвторизоватьсяПоЛогинуПаролю(ЛогинЗначение, ПарольЗначение, Отказ);
		
		ЛогинЗначение	= "";
		ПарольЗначение	= "";
		
	Иначе
		
		ОшибкаАвторизации = НовыйСбисИсключение("Неизвестный способ авторизации в Saby",
			"МодульОбъектаКлиент.АвторизоватьсяВSABY",,,,
			Новый Структура("Режим", РежимАвторизации)); 
			
		Отказ = Истина;
		Возврат ОшибкаАвторизации;
		
	КонецЕсли;
	
	Возврат Результат;
			
КонецФункции

//DynamicDirective

// Авторизуется по логину/паролю	
Функция АвторизоватьсяПоЛогинуПаролю(Логин, Пароль, Отказ=Ложь)	

	
	СтруктураПараметровЗапроса = Новый Структура("Логин, Пароль", Логин, Пароль);
	Кэш = ПолучитьТекущийЛокальныйКэш();

	Если ЗначениеЗаполнено(Логин) Тогда
	
		// Авторизоваться можно по пустому логину/паролю, например на каталоге.
		// Но аккаунты запоминать только если есть логин
		Аккаунты = ПараметрSaby("Аккаунты", "Технический");
		Если Не Аккаунты = Неопределено Тогда
			
			АккаунтПоЛогину = Аккаунты.Получить(СтруктураПараметровЗапроса.Логин);
			Если НЕ АккаунтПоЛогину = Неопределено Тогда
				
				СтруктураПараметровЗапроса.Вставить("Аккаунт", АккаунтПоЛогину);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	РезультатАвторизации = Новый Структура;
	РезультатАвторизации.Вставить("Результат", ВыполнитьСинхроннуюКомандуТранспорта(Кэш, "СБИС_Аутентифицировать", СтруктураПараметровЗапроса,,Отказ));
	
	Возврат ОценитьРезультатАвторизации(РезультатАвторизации, Отказ);
	
КонецФункции

//DynamicDirective

// Функция - выполняет расшировку токена авторизации средствами 1С
//
// Параметры:
//  ДвоичныеДанныеТокена - Строка(ДвоичныеДанные) - результат авторизации по сертификату/подтверждение авторизации по сертификату
// 
// Возвращаемое значение:
//  Строка(УИД) - полученный ИД сессии в готовом виде
//
Функция РасшироватьТокенАвторизации(ДвоичныеДанныеТокена) Экспорт
	
	ДвоичныеДанные		= Base64Значение(ДвоичныеДанныеТокена);  
	ИмяВрФ				= НовыйВременныйФайл(,"txt");
	МодульКриптографии	= ПолучитьЗначениеПараметраТекущегоСеанса("Криптография1С");
	
	Попытка
		
		МодульКриптографии.сбисРасшифровать(ПолучитьТекущийЛокальныйКэш(), ДвоичныеДанные, ИмяВрФ);
		
	Исключение
		
		ОшибкаРасшифровать = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.РасшироватьТокенАвторизации", 785);
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаРасшифровать);
		
	КонецПопытки;
	
	ЧтениеОтвета	= Новый ЧтениеТекста(ИмяВрФ, КодировкаТекста.UTF8, Символы.ПС);
	Результат		= ЧтениеОтвета.Прочитать();
	ЧтениеОтвета.Закрыть();
	
	ОсвободитьВременныйФайл(ИмяВрФ, Истина);
	
	Возврат Результат;
	
КонецФункции

//DynamicDirective

// Функция - проверка результата авторизации
//
// Параметры:
//  ПараметрыРезультата	 - Структура	 - Параметры оценки
//		Результат:			Строка/СбисИсключение	- результат выполнения методов авторизации - по логину/сертификату/токену/подтверждение и пр.
//		РасшифроватьТокен:	Булево					- необходимость выполнить расшифровку токена криптографией 1С
//  Отказ				 - Булево		 - признак наличия ошибки
// 
// Возвращаемое значение:
//  ИдСессии/СбисИсключение - результат авторизации
//
Функция ОценитьРезультатАвторизации(ПараметрыРезультата, Отказ) Экспорт
	
	РезультатАвторизации	= ПараметрыРезультата.Результат;
	РасшифроватьТокен		=	ПараметрыРезультата.Свойство("РасшифроватьТокен")
							И	ПараметрыРезультата.РасшифроватьТокен;

	Если Не Отказ Тогда
		
		Если РасшифроватьТокен Тогда
			
			Попытка
			
				РезультатАвторизации = РасшироватьТокенАвторизации(РезультатАвторизации);
				
			Исключение
				
				Отказ = Истина;
				Возврат НовыйСбисИсключение(ИнформацияОбОшибке(),
											"API.АвторизоватьсяПоСертификату",
											785,
											"Ошибка 1С при выполнении метода ""Расшифровать""")
				
			КонецПопытки;
			
		КонецЕсли;
		
		Возврат РезультатАвторизации;
		
	ИначеЕсли РезультатАвторизации.code = 303 Тогда
		
		РезультатАвторизации.data.addinfo.Вставить("РасшифроватьТокен", РасшифроватьТокен);
	
	ИначеЕсли РезультатАвторизации.details = "Для входа введите полученный код подтверждения." Тогда
		
		РезультатАвторизации.message= "Требуется подтверждение действия";
		РезультатАвторизации.code	= 303;
		
	КонецЕсли;
	
	Возврат РезультатАвторизации;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокСертификатовДляДействия(ПараметрыДействия, ДопПараметры = Неопределено) Экспорт
	
	Перем СписокСертификатов;
	
	Если ПараметрыДействия.Действие = "Авторизация" Тогда
		Отказ = Ложь;
		МодульИнтеграции = ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция");
		Кэш = ПолучитьТекущийЛокальныйКэш();
		Параметры = Новый Структура;
		СписокСертификатов = МодульИнтеграции.СБИС_СписокСертификатов(Кэш, Параметры, ДопПараметры, Отказ);
		Если Отказ Тогда
			ОшибкаПолученияСертов = НовыйСбисИсключение(СписокСертификатов,"МодульОбъектаКлиент.ПолучитьСписокСертификатовДляДействия");
			ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаПолученияСертов);
		КонецЕсли;
		
		Если Не СписокСертификатов.Сертификат.Количество() Тогда
			ОшибкаПолученияСертов = НовыйСбисИсключение(760101,"МодульОбъектаКлиент.ПолучитьСписокСертификатовДляДействия",,,
			"Нет подходящих сертификатов для авторизации");
			ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаПолученияСертов);		
		КонецЕсли;
		
		СписокСертификатов = ОбработатьСписокСертификатов(Кэш, СписокСертификатов);
	Иначе
		ОшибкаПолученияСертов = НовыйСбисИсключение(,"МодульОбъектаКлиент.ПолучитьСписокСертификатовДляДействия",100,"Неизвестное действие",
		"Не удалось получить список сертификатов для выполнения действия");
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаПолученияСертов);		
		
	КонецЕсли;
	
	Возврат СписокСертификатов;

КонецФункции

&НаКлиенте
Функция ОбработатьСписокСертификатов(Кэш, СписокСертификатов)
	
	Object = СписокСертификатов;
	ObjectList = Неопределено;
	Object.Свойство("Сертификат",ObjectList);
	Если ObjectList<>Неопределено Тогда
		Размер = ObjectList.Количество();
		Для сч=0 По Размер-1 Цикл
			Сертификат = ObjectList[сч];
			Если Сертификат.Аутентификация.Зарегистрирован = "Да" Тогда
				Если Сертификат.Свойство("ДействителенПо") Тогда
					Если ТипЗнч(Сертификат.ДействителенПо)=Тип("Дата") Тогда
						ДействителенПо = Дата(Год(Сертификат.ДействителенПо), Месяц(Сертификат.ДействителенПо), День(Сертификат.ДействителенПо));
					Иначе
						ДействителенПо = Дата(Сред(Сертификат.ДействителенПо,7,4), Сред(Сертификат.ДействителенПо,4,2), Лев(Сертификат.ДействителенПо, 2));
					КонецЕсли;
				КонецЕсли;
				 СписокСертификатов.Добавить(Сертификат, Кэш.ОбщиеФункции.ПолучитьПредставлениеСертификата(Сертификат, "[ФИО].([Должность])., [Название].(ИНН [ИНН])., действителен до [ДействителенПо]", Истина, "ДЛФ=DD"));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;          
	
	Возврат СписокСертификатов;
	
КонецФункции

