
//DynamicDirective

// Функция - Глобальный кэш
// 
// Возвращаемое значение:
//  ГлобальныйКэш - в завивисмости от контекста вызова
//
Функция ГлобальныйКэш()

	#Если ТолстыйКлиентОбычноеПриложение Или Не НаСервере Тогда
		
		Возврат ГлобальныйКэш;
		
	#Иначе
		
		Возврат ПолучитьГлобальныйКэшНаСервере();
		
	#КонецЕсли
	
КонецФункции

//DynamicDirective

// Функция - возвращает строковое представление типа операционной системы, в зависимости от того, где находимся
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - сведения об ОС текущего контекста
//		"Тип": Строка - windows/linux/mac
//
Функция СведенияОСКонтекста()

	ТекущийГлобальныйКэш = ГлобальныйКэш();
	#Если ТолстыйКлиентОбычноеПриложение Или Не НаСервере Тогда
		
		ТекущиеСведения = ТекущийГлобальныйКэш.ПараметрыСистемы.Клиент;
		
	#Иначе
		
 		ТекущиеСведения = ТекущийГлобальныйКэш.ПараметрыСистемы.Сервер;

	#КонецЕсли
	
	ТипОС = "windows";
	Если ТекущиеСведения.ЭтоLinux Тогда
		ТипОС = "linux";
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура("Тип", ТипОС);
	
КонецФункции

//DynamicDirective

// Разбивает строку на несколько строк по указанному разделителю. Разделитель может иметь любую длину.
// В случаях, когда разделителем является строка из одного символа, и не используется параметр СокращатьНепечатаемыеСимволы,
// рекомендуется использовать функцию платформы СтрРазделить.
//
// Параметры:
//  Значение               - Строка - текст с разделителями.
//  Разделитель            - Строка - разделитель строк текста, минимум 1 символ.
//  ПропускатьПустыеСтроки - Булево - признак необходимости включения в результат пустых строк.
//    Если параметр не задан, то функция работает в режиме совместимости со своей предыдущей версией:
//     > для разделителя-пробела пустые строки не включаются в результат, для остальных разделителей пустые строки
//       включаются в результат;
//     > если параметр Строка не содержит значащих символов или не содержит ни одного символа (пустая строка), то в
//       случае разделителя-пробела результатом функции будет массив, содержащий одно значение "" (пустая строка), а
//       при других разделителях результатом функции будет пустой массив.
//  СокращатьНепечатаемыеСимволы - Булево - сокращать непечатаемые символы по краям каждой из найденных подстрок.
//
// Возвращаемое значение:
//  Массив из Строка
//
// Пример:
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(",один,,два,", ",")
//  - возвратит массив из 5 элементов, три из которых  - пустые: "", "один", "", "два", "";
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(",один,,два,", ",", Истина)
//  - возвратит массив из двух элементов: "один", "два";
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(" один   два  ", " ")
//  - возвратит массив из двух элементов: "один", "два";
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("")
//  - возвратит пустой массив;
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("",,Ложь)
//  - возвратит массив с одним элементом: ""(пустая строка);
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("", " ")
//  - возвратит массив с одним элементом: "" (пустая строка).
//
Функция СбисРазложитьСтрокуВМассивПодстрок(Знач Значение, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, 
	СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Если СтрДлина(Разделитель) = 1 
		И ПропускатьПустыеСтроки = Неопределено 
		И СокращатьНепечатаемыеСимволы Тогда 
		
		Результат = СбисРазложитьСтрокуВМассивРежимСовместимости(Значение, Разделитель);
		Для Индекс = 0 По Результат.ВГраница() Цикл
			Результат[Индекс] = СокрЛП(Результат[Индекс])
		КонецЦикла;
		Возврат Результат;
		
	КонецЕсли;
	
	Результат = Новый Массив;
	
	// Для обеспечения обратной совместимости.
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Значение) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	//
	
	Позиция = Найти(Значение, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Значение, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Результат.Добавить(СокрЛП(Подстрока));
			Иначе
				Результат.Добавить(Подстрока);
			КонецЕсли;
		КонецЕсли;
		Значение = Сред(Значение, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Значение, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Значение) Тогда
		Если СокращатьНепечатаемыеСимволы Тогда
			Результат.Добавить(СокрЛП(Значение));
		Иначе
			Результат.Добавить(Значение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//DynamicDirective

Функция СбисРазложитьСтрокуВМассивРежимСовместимости(Знач ИсходнаяСтрока, Разделитель = ",")
	
	Подстроки = Новый Массив;
	МногострочнаяСтрока = СтрЗаменить(ИсходнаяСтрока, Разделитель, Символы.ПС);
	
	Для Индекс = 1 По СтрЧислоСтрок(МногострочнаяСтрока) Цикл
		Подстроки.Добавить(СтрПолучитьСтроку(МногострочнаяСтрока, Индекс));
	КонецЦикла; 
	
	Возврат Подстроки;
	
КонецФункции

//DynamicDirective

// Функция - Это ссылка на справочник номенклатуры
//
// Параметры:
//  Ссылка						 - Предполагаемая ссылка на справочник номенклатуры
//  ВидыСправочниковНоменклатуры - Строка / Неопределено  - перечислены через запятую виды справочников
// 
// Возвращаемое значение:
//  - Булево
//
Функция СостояниеПрослеживаемостиПоКодуСтрокой(КодСостояния) Экспорт
	
	Если КодСостояния = "10" Тогда
		Возврат "Проверка не проводилась"; 
	ИначеЕсли КодСостояния = "11" Тогда
		Возврат "Идёт процесс регистрации"; 
	ИначеЕсли КодСостояния = "12" Тогда
		Возврат "Успешно зарегистрированы";
	ИначеЕсли КодСостояния = "13" Тогда
		Возврат "Есть ошибки при регистрации";
	ИначеЕсли КодСостояния = "21" Тогда
		Возврат "Идёт процесс проверки кодов РНПТ в ФНС";
	ИначеЕсли КодСостояния = "22" Тогда
		Возврат "Проверка пройдена для всех кодов успешно";
	ИначеЕсли КодСостояния = "23" Тогда
		Возврат "Проверка пройдена с некоторыми ошибками"; 
	ИначеЕсли КодСостояния = "30" Тогда
		Возврат "Ошибка транспорта/API ФНС";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции


//DynamicDirective

// Функция - Это ссылка на справочник номенклатуры
//
// Параметры:
//  Ссылка						 - Предполагаемая ссылка на справочник номенклатуры
//  ВидыСправочниковНоменклатуры - Строка / Неопределено  - перечислены через запятую виды справочников
// 
// Возвращаемое значение:
//  - Булево
//
Функция ЭтоСсылкаНаСправочникНоменклатуры(Ссылка, ВидыСправочниковНоменклатуры = Неопределено) Экспорт
	
	Результат = Ложь;
	
	Если ВидыСправочниковНоменклатуры = Неопределено Тогда
		Результат = Истина; // Заглушка, если нет узла в ини Конфигурация
	Иначе
		ВидыСправочниковНоменклатуры = СбисРазложитьСтрокуВМассивПодстрок(ВидыСправочниковНоменклатуры, ",");
	
		Для Каждого ВидСправочника Из ВидыСправочниковНоменклатуры Цикл
			Если ТипЗнч(Ссылка) = Тип(ВидСправочника) Тогда
				Результат = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция - Сбис идентификатор документа 1С
//
// Параметры:
//  Документ1С - ДокументСсылка, Структура - Документ 1С, который нужно идентифицировать
// 
// Возвращаемое значение:
//  ДокуентСсылка, Строка, УникальныйИдентификатор - Идентификатор документа 1С
//
//DynamicDirective
Функция СбисИдентификаторДокумента1С(Документ1С, ИмяИни = "") Экспорт
	Перем Результат;
	
	Если ТипЗнч(Документ1С) = Тип("Структура") Тогда
		
		Если Документ1С.Свойство("Идентификатор") Тогда
			
			Результат = Документ1С.Идентификатор;	
			
		КонецЕсли;
		
	Иначе
		
		Если ПустаяСтрока(ИмяИни) Тогда
			
			Результат = Документ1С;
			
		Иначе
			
			Результат = Документ1С.УникальныйИдентификатор();
			Результат = ИмяИни + "#" + Результат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция - Тип сбис в тип 1С
//
// Параметры:
//  ТипСбис	 - Строка - Имя типа из значения параметра СБИС
// 
// Возвращаемое значение:
//  ОписаниеТипа - Аналог типа в 1С
//
//DynamicDirective
Функция ТипСбисВТип1С(ТипСбис) Экспорт 

	ТипСбис = НРег(ТипСбис);
	
	Если	ТипСбис = "string"
		ИЛИ	ТипСбис = "str"
		ИЛИ	ТипСбис = "text" Тогда
	
		Результат = Новый ОписаниеТипов("Строка");
		
	ИначеЕсли ТипСбис = "int"
		ИЛИ ТипСбис = "number" Тогда 
		
		ПараметрыЧисла = Новый КвалификаторыЧисла(15, ?(ТипСбис = "number", 2, 0));
		Результат = Новый ОписаниеТипов("Число", ПараметрыЧисла);
		
	ИначеЕсли ТипСбис = "bool"
		ИЛИ ТипСбис = "logic" Тогда 

		Результат = Новый ОписаниеТипов("Булево");

	ИначеЕсли ТипСбис = "list"
		ИЛИ ТипСбис = "booleangroup" Тогда 
		
		Результат = Новый ОписаниеТипов("СписокЗначений");
		
	ИначеЕсли ТипСбис = "date" Тогда

		ПараметрыДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
		Результат = Новый ОписаниеТипов("Дата", , , ПараметрыДаты);

	ИначеЕсли ТипСбис = "daterange" Тогда
		
		Результат = Новый ОписаниеТипов("СтандартныйПериод");
		
	Иначе
		
		Результат = Новый ОписаниеТипов("Неопределено");
	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ТипСбисВТип1С()

//DynamicDirective
Функция МскаСбисВФормат1С(Маска)

	СоответствиеСиволов = Новый Массив;
	СоответствиеСиволов.Добавить(Новый Структура("СБИС, ВС", "DD", "dd"));
	СоответствиеСиволов.Добавить(Новый Структура("СБИС, ВС", "MM", "MM"));
	СоответствиеСиволов.Добавить(Новый Структура("СБИС, ВС", "YYYY", "yyyy"));
	СоответствиеСиволов.Добавить(Новый Структура("СБИС, ВС", "YY", "yy"));
	
	Формат = Маска;
	
	Для каждого Замена Из СоответствиеСиволов Цикл
	
		Формат = СтрЗаменить(Формат, Замена.СБИС, Замена.ВС);
	
	КонецЦикла;
	
	Возврат Формат;

КонецФункции // ()

#Область include_core2_vo2_МодульОбъекта_КлиентСервер_ОбщегоНазначения_РаботаСоСтроками
#КонецОбласти

