
//DynamicDirective

Функция ПроверитьСуществованиеФайлаSABY(ПутьКФайлу, ДопПараметры = Неопределено) Экспорт
	Перем ПроверитьЭтоКаталог;
	
	Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если НЕ ДопПараметры = Неопределено Тогда
		
		ДопПараметры.Свойство("ЭтоКаталог", ПроверитьЭтоКаталог);
		
	КонецЕсли;
	Если ПроверитьЭтоКаталог = Неопределено Тогда
		
		ПроверитьЭтоКаталог = Ложь;
		
	КонецЕсли;
	
	Файл = Новый Файл(ПутьКФайлу);
	
	Если Файл.Существует() Тогда
		
		Возврат		Не ПроверитьЭтоКаталог
				Или		ПроверитьЭтоКаталог
					И	Файл.ЭтоКаталог();
					
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции

