
&НаКлиенте
Процедура ПодробнееНажатие(Элемент) 
	
	ФормаПереходовПодробнее = Кэш.ГлавноеОкно.сбисПолучитьФорму("ФормаПереходыПодробнее_ДокОтгрВх",,СтруктураПодробнее,ЭтаФорма);
	ОбработчикЗавершения = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ОбработкаРезультата", ЭтаФорма);	
	ФормаПереходовПодробнее.ОписаниеОповещенияОЗакрытии = ОбработчикЗавершения;
	ФормаПереходовПодробнее.Показать();	
	
КонецПроцедуры  

&НаКлиенте
Функция ОбработкаРезультата(РезультатВвода, ДополнительныеПараметрыЗавершения = Неопределено) Экспорт
	
	СтруктураПодробнее = РезультатВвода;
	
КонецФункции

&НаКлиенте
Процедура ПереходыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Отказ = Ложь;
	
	Результат = ОбработкаВыбора(Кэш, Элемент.ТекущиеДанные.Значение, Отказ);
	ФормаЗакрытьУстановитьСтатусОк(Результат);
	Если Отказ Тогда
		СтандартнаяОбработка = Ложь;
		Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, Результат, Новый Структура("ФормаВладелец", ЭтаФорма));
	Иначе
		ЗакрыватьФорму = Истина;
		ЭтаФорма.Закрыть(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбработкаВыбора		= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ИсполнительНачалоВыбора_Результат", ЭтаФорма);
	
	МодульОбъектаКлиент().SABYВыбратьЗначение(ПараметрыФормы.ОтветственныйТип, Новый Структура("Обработчик", ОбработкаВыбора));
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительНачалоВыбора_Результат(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Исполнитель = РезультатВыбора;

КонецПроцедуры

///////////////////////////////////////////////////
//////////////Вспомогательные функции//////////////
///////////////////////////////////////////////////

&НаСервереБезКонтекста
Функция	ДанныеИсполнителя(ИсполнительСсылка)
	
	Если	Не	ЗначениеЗаполнено(ИсполнительСсылка)	Тогда
		Возврат	Неопределено;
	КонецЕсли;
	НедопустимыеСимволы	= "@/^|*\#!&(%_$)?""'" + Символы.НПП + Символы.Таб + Символы.ПС + Символы.ВТаб;
	
	Результат	= Новый	Структура("Фамилия,Имя,Отчество", "","","");
	
	НаименованиеИсполнителя	= СокрЛП(ИсполнительСсылка.Наименование);
	Для	шаг	= 1 По	СтрДлина(НедопустимыеСимволы)	Цикл//убрать лишние, системные символы, буде таковые имеются.
		НаименованиеИсполнителя	= СтрЗаменить(НаименованиеИсполнителя, Сред(НедопустимыеСимволы, шаг, 1), "");
	КонецЦикла;
	Пока СтрЧислоВхождений(НаименованиеИсполнителя, "  ") > 0 Цикл//сократить лишние пробелы перед разбивкой
		НаименованиеИсполнителя	= СтрЗаменить(НаименованиеИсполнителя, "  ", " ");
	КонецЦикла;
	
	НаименованиеИсполнителя	= СтрЗаменить(НаименованиеИсполнителя, " ", Символы.ПС);
	шаг = 0;
	Для	Каждого	КлючИЗначение	Из	Результат	Цикл
		шаг = шаг	+ 1;
		Если	СтрЧислоСтрок(НаименованиеИсполнителя)	< шаг	Тогда
			Прервать;
		КонецЕсли;
		Результат.Вставить(КлючИЗначение.Ключ, СтрПолучитьСтроку(НаименованиеИсполнителя, шаг));
	КонецЦикла;
	
	Результат.Вставить("Идентификатор", Строка(ИсполнительСсылка.УникальныйИдентификатор()));
	
	Возврат	Результат;
	
КонецФункции

&НаКлиенте
Функция ОбработкаВыбора(Кэш, ЗначениеВыбора, Отказ)
	
	РезультатВыбора = Новый Структура("Действие,Комментарий",ЗначениеВыбора, Комментарий);
	
	Если Не Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		Исполнитель	= ЭтаФорма.ЭлементыФормы.Исполнитель.Значение;//для ОФ реквизита нет, так как меняется тип поля ввода
	КонецЕсли;
	Если	ЗначениеВыбора.ТребуетКомментария = "Да"
		И	ПустаяСтрока(Комментарий) Тогда
			Отказ = Истина;
			ОшибкаОбработкиВыбора =  МодульОбъектаКлиент().НовыйСбисИсключение(,"ФормаПереходы.ОбработкаВыбора", 780, "Не заполнено обязательное поле", "Для выполнения операции, необходимо указать комментарий!");
			Возврат ОшибкаОбработкиВыбора;
	КонецЕсли;
	ДанныеИсполнителя = Неопределено;
	Если	ЗначениеВыбора.Свойство("ТребуетИсполнителя")
		И	ЗначениеВыбора.ТребуетИсполнителя = "Да" Тогда
		Если ЗначениеЗаполнено(Исполнитель)	Тогда
			ДанныеИсполнителя = ДанныеИсполнителя(Исполнитель);
		Иначе
			Отказ	= Истина;
			ОшибкаОбработкиВыбора =  МодульОбъектаКлиент().НовыйСбисИсключение(,"ФормаПереходы.ОбработкаВыбора", 780, "Не заполнено обязательное поле", "Для выполнения операции, необходимо указать исполнителя!");
			Возврат ОшибкаОбработкиВыбора;
   		КонецЕсли;
	КонецЕсли;
	Если ЗначениеВыбора.Название = "Аннулировать" Тогда
		РезультатЗапроса = Кэш.ОбщиеФункции.СформироватьЗапросНаАннулирование(Кэш, Новый Структура("ИдентификаторПакета, Действие", СоставПакета.Идентификатор, ЗначениеВыбора), Отказ);
		Если Отказ Тогда
			Возврат РезультатЗапроса;
		КонецЕсли;
		Для Каждого КлючИЗначение Из РезультатЗапроса Цикл 
			РезультатВыбора.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
	КонецЕсли;	
	
	Если  Не СтруктураПодробнее = Неопределено Тогда
		
		РезультатВыбора.Действие.Вставить("СтруктураПодробнее",СтруктураПодробнее);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеИсполнителя)	Тогда
		РезультатВыбора.Вставить("Исполнитель", ДанныеИсполнителя);
	КонецЕсли;
	Возврат РезультатВыбора;
		
КонецФункции

&НаКлиенте
Процедура ДатаПолученияПриИзменении(Элемент)
	
	Если СтруктураПодробнее = Неопределено Тогда
		СтруктураПодробнее = Новый Структура;
	КонецЕсли;
		
	СтруктураПодробнее.Вставить("ДатаПринят",Формат(ДатаПолучения, "ДЛФ=Д"));
	
КонецПроцедуры
	
