&НаКлиенте
Функция ПорядокАвтоматическогоСопоставленияПоУмолчаниюКлиент() Экспорт
	
	ПорядокАвтоматическогоСопоставления = Новый Массив;
	
	ПорядокАвтоматическогоСопоставления.Добавить("GTIN");
	ПорядокАвтоматическогоСопоставления.Добавить("КодПокупателя");
	ПорядокАвтоматическогоСопоставления.Добавить("Идентификатор");
	ПорядокАвтоматическогоСопоставления.Добавить("Артикул");
	ПорядокАвтоматическогоСопоставления.Добавить("Код");
	ПорядокАвтоматическогоСопоставления.Добавить("КодПоставщика");
	
	Возврат ПорядокАвтоматическогоСопоставления;
	
КонецФункции

&НаКлиенте
Функция СопоставлениеНоменклатуры_ВсеНоменклатурыСопоставлены(НаборСопоставлений) Экспорт
			
	Для Каждого КлассНоменклатуры Из НаборСопоставлений Цикл
		Если НЕ КлассНоменклатуры.Номенклатура1С.Количество() Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция НайтиСоздатьНоменклатуру1СПоНаборуКлассовСопоставления(ПараметрыМетода) Экспорт

	Результат = Новый Структура("Номенклатура1С, Сообщение");
	
	ВложениеСБИС = ПараметрыМетода.ВложениеСБИС;
	СоставПакета = ПараметрыМетода.СоставПакета;
	НоменклатураСБИС = ПараметрыМетода.НоменклатураСБИС;
	
	КлассыСопоставленияНоменклатур = ВложениеСБИС.КлассыСопоставленияНоменклатур;
	
	ИскомаяНоменклатура = Неопределено;

	// На случай если пользователь нажал случайно 
	ТекущийКлассСопоставления = Неопределено;
	Для Каждого КлассСопоставления Из КлассыСопоставленияНоменклатур Цикл
		
		Если КлассСопоставления.НоменклатураСБИС.Наименование = НоменклатураСБИС Тогда
			ИскомаяНоменклатура = КлассСопоставления.НоменклатураСБИС;
			ТекущийКлассСопоставления = КлассСопоставления;
			Если КлассСопоставления.Номенклатура1С.Количество() Тогда
				Результат.Сообщение = "У позиции " + ИскомаяНоменклатура.Наименование + " уже имеется карточка номенклатуры с таким же наименованием.";  
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	// ----------------------------------------------------------------------------------------------------------------------------------------------------
	
	// Поиск номенклатуры 1С в базе на случай, если номенклатура уже есть в базе, но не была сопоставлена (и выключен автоматический поиск) или пришла битая ссылка
	ФункцииДокумента 		= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	ИниКонфигурация 		= МодульОбъектаКлиент().ИниПоПараметрам("Конфигурация");
	
	Фрм = НайтиФункциюСеансаОбработки("сбисНайтиНоменклатуруПоНаименованию", "РаботаСДокументами1С");
	
	СоставОграниченийТипов	= Фрм.ТипыСправочниковНоменклатуры(ИниКонфигурация);
	ИмяСправочника			= Фрм.ОпределитьИмяТипаОбъекта(СоставОграниченийТипов[0]); 	

	Название = ИскомаяНоменклатура.Наименование;
	Номенклатура1С = Фрм.сбисНайтиНоменклатуруПоНаименованию(ИмяСправочника, Название);
	
	Если НЕ Номенклатура1С = Неопределено Тогда
		
		Результат.Номенклатура1С = Номенклатура1С;
		Результат.Сообщение = "Для позиции '" + Номенклатура1С + "' найдена карточка номенклатуры с таким же названием.
		| Для сопоставления номенклатуры нажмите кнопку ""Сохранить"".  
		| Для редактирования сопоставления нажмите ""Сопоставить""";;
		ПоместитьНайденнуюСозданнуюНоменклатуруВКлассСопоставления(ТекущийКлассСопоставления, Результат.Номенклатура1С);
		Возврат Результат;
		
	КонецЕсли;
	// -----------------------------------------------------------------------------------------------------------------------------------------------------
	
	// Создание новой номенклатуры 1С и добавление её в класс сопоставления
	ИниКонфигурация.Номенклатура_ОКЕИ.Значение = "[Номенклатура].ОКЕИ"; // Так как это локальная копия инишки конфигурация, то мне лень переписывать костыль с ОКЕИ в основном коде расчёта инишек
	
	ПараметрыМетода.Вставить("ИниКонфигурация", ИниКонфигурация);
	
	ПодготовленныеДанные 	= СтрокаСопоставленияСБИСКлиент_ВыгрузитьДанныеДляСозданияНоменклатуры1С(ИскомаяНоменклатура, ПараметрыМетода);
	
	ОписаниеОбъекта			= Новый Структура("Ключ, Значение, Ини", "Номенклатура", ПодготовленныеДанные, ИниКонфигурация);
	ДопПараметрыЗаполнить	= Новый Структура("Вложение, СоставПакета", ВложениеСБИС, СоставПакета);
	
	СтруктураНоменклатуры	= ЗаполнитьСтруктуруОбъектаПоИни(ОписаниеОбъекта, ДопПараметрыЗаполнить);
	
	Отказ = Ложь;
	
	ДополнительныеПараметрыСоздания = Новый Структура(	"ТипОбъекта,	ПодТипОбъекта,			Ини",
														"Справочник",	ИмяСправочника,	ИниКонфигурация);
	Результат = СоздатьОбъектИзСтруктуры(СтруктураНоменклатуры, ДополнительныеПараметрыСоздания, Отказ);
	
	ПоместитьНайденнуюСозданнуюНоменклатуруВКлассСопоставления(ТекущийКлассСопоставления, Результат.Номенклатура1С);
	
	Результат.Сообщение = Результат.Сообщение + Символы.ПС + "Для сопоставления созданной номенклатуры нажмите кнопку ""Сохранить"".
	| Для редактирования сопоставления нажмите ""Сопоставить"".";
	
	Возврат Результат;
	
КонецФункции

// Процедура - Поместить найденную созданную номенклатуру в класс сопоставления
// Ищет номенклатуру 1С в классе сопоставлений если она сопоставлена, но побилась ссылка или был перенос на новую базу 1С. 
// Если не нашёл - создаёт экземпляр класса ОписаниеНоменклатуры1С и заполняет её данными из номенклатуры загружаемого документа
//
// Параметры:
//  НоменклатураСБИС			 - Структура	 - Экземпляр класса НоменклатураСБИС
//  СсылкаНаНоменклатуруВБазе	 - Ссылка	 	 - Ссылка на номенклатуру 1С
//
&НаКлиенте
Процедура ПоместитьНайденнуюСозданнуюНоменклатуруВКлассСопоставления(ТекущийКлассСопоставления, СсылкаНаНоменклатуруВБазе);
	
	КлассНоменклатура1С = ТекущийКлассСопоставления.Номенклатура1С.Получить(СсылкаНаНоменклатуруВБазе);
	
	Если КлассНоменклатура1С = Неопределено Тогда
		КлассНоменклатура1С = НовыйОписаниеНоменклатуры1СКлиент();
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Номенклатура", СсылкаНаНоменклатуруВБазе);
	ДанныеЗаполнения.Вставить("Основное", Истина);
	ДанныеЗаполнения.Вставить("Цена", ТекущийКлассСопоставления.НоменклатураСБИС.Цена); 
	ДанныеЗаполнения.Вставить("Кол_во", ТекущийКлассСопоставления.НоменклатураСБИС.Кол_во);
	ДанныеЗаполнения.Вставить("Сумма", ТекущийКлассСопоставления.НоменклатураСБИС.Сумма);
	ДанныеЗаполнения.Вставить("СуммаБезНал", ТекущийКлассСопоставления.НоменклатураСБИС.СуммаБезнал);
	ДанныеЗаполнения.Вставить("СуммаНДС", ТекущийКлассСопоставления.НоменклатураСБИС.СуммаНДС);
	ДанныеЗаполнения.Вставить("СтавкаНДС", ТекущийКлассСопоставления.НоменклатураСБИС.СтавкаНДС);
	ДанныеЗаполнения.Вставить("GTIN", ТекущийКлассСопоставления.НоменклатураСБИС.GTIN); 
	
	СопоставлениеДляЕдиницы = Новый Структура("Владелец, Ссылка", СсылкаНаНоменклатуруВБазе, Неопределено); 
	КлючПоиска = "Единица";
	НайденнаяЕдиница = МодульОбъектаКлиент().СопоставлениеДляЕдиницыКлиент_Получить(СопоставлениеДляЕдиницы, КлючПоиска);
	ЕдиницаСтруктура = НовыйСопоставлениеДляЕдиницыКлиент();
	
	ОКЕИ = ОКЕИБазовойЕдиницыНоменклатуры1С(НайденнаяЕдиница);
	
	СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСтруктура, "Ссылка", НайденнаяЕдиница);
	СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСтруктура, "Владелец", СсылкаНаНоменклатуруВБазе);
	СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСтруктура, "ОКЕИ", ОКЕИ);             
	
	НазваниеЕдиницы = Строка(НайденнаяЕдиница);
	СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСтруктура, "Название", НазваниеЕдиницы);
	
	ЕдиницаСоответствие = Новый Соответствие;
	ЕдиницаСоответствие.Вставить(НайденнаяЕдиница, ЕдиницаСтруктура);
	
	ДанныеЗаполнения.Вставить("ЕдИзм1С", ЕдиницаСоответствие);
	
	ДанныеЗаполнения.Вставить("БазоваяЕдиницаОКЕИ", ОКЕИ);	 
		
	ОписаниеНоменклатуры1СКлиент_Заполнить(КлассНоменклатура1С, ДанныеЗаполнения);	
	ТекущийКлассСопоставления.Номенклатура1С.Вставить(СсылкаНаНоменклатуруВБазе, КлассНоменклатура1С);
	
КонецПроцедуры

&НаСервере
Функция ОКЕИБазовойЕдиницыНоменклатуры1С(ЕдиницаСсылка)

	СпрОбъект = ЕдиницаСсылка.ПолучитьОбъект();
	
	Возврат СпрОбъект.Код;
	
КонецФункции
