&НаКлиенте
Функция ПорядокАвтоматическогоСопоставленияПоУмолчаниюКлиент() Экспорт
	
	ПорядокАвтоматическогоСопоставления = Новый Массив;
	
	ПорядокАвтоматическогоСопоставления.Добавить("GTIN");
	ПорядокАвтоматическогоСопоставления.Добавить("КодПокупателя");
	ПорядокАвтоматическогоСопоставления.Добавить("Идентификатор");
	ПорядокАвтоматическогоСопоставления.Добавить("Артикул");
	ПорядокАвтоматическогоСопоставления.Добавить("Код");
	ПорядокАвтоматическогоСопоставления.Добавить("КодПоставщика");
	
	Возврат ПорядокАвтоматическогоСопоставления;
	
КонецФункции

&НаКлиенте
Функция СопоставлениеНоменклатуры_ВсеНоменклатурыСопоставлены(НаборСопоставлений) Экспорт
			
	Для Каждого КлассНоменклатуры Из НаборСопоставлений Цикл
		Если НЕ КлассНоменклатуры.Номенклатура1С.Количество() Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция НайтиСоздатьНоменклатуру1СПоНаборуКлассовСопоставления(ПараметрыМетода) Экспорт

	Результат = Новый Структура("Номенклатура1С, НайденаСоздана, Сообщение");
	
	ВложениеСБИС = ПараметрыМетода.ВложениеСБИС;
	СоставПакета = ПараметрыМетода.СоставПакета;
	НоменклатураСБИС = ПараметрыМетода.НоменклатураСБИС;
	
	КлассыСопоставленияНоменклатур = ВложениеСБИС.КлассыСопоставленияНоменклатур;
	
	ИскомаяНоменклатура = Неопределено;
	
	Для Каждого КлассСопоставления Из КлассыСопоставленияНоменклатур Цикл
		
		Если КлассСопоставления.НоменклатураСБИС.Наименование = НоменклатураСБИС Тогда
			ИскомаяНоменклатура = КлассСопоставления.НоменклатураСБИС; 
			Если КлассСопоставления.Номенклатура1С.Количество() Тогда
				Результат.НайденаСоздана = "Найдена";
				Результат.Сообщение = "Для позиции " + ИскомаяНоменклатура.Наименование + " найдена карточка номенклатуры с таким же названием.";  
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ФункцииДокумента 		= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	ИниКонфигурация 		= МодульОбъектаКлиент().ИниПоПараметрам("Конфигурация");
	
	Фрм = НайтиФункциюСеансаОбработки("сбисНайтиНоменклатуруПоНаименованию", "РаботаСДокументами1С");
	
	СоставОграниченийТипов	= Фрм.ТипыСправочниковНоменклатуры(ИниКонфигурация);
	ИмяСправочника			= Фрм.ОпределитьИмяТипаОбъекта(СоставОграниченийТипов[0]); 	

	Название = ИскомаяНоменклатура.Наименование;
	Номенклатура1С = Фрм.сбисНайтиНоменклатуруПоНаименованию(ИмяСправочника, Название);
	
	Если НЕ Номенклатура1С = Неопределено Тогда
		
		Результат.Номенклатура1С = Номенклатура1С;
		Результат.НайденаСоздана = "Найдена";
		Результат.Сообщение = "Для позиции '" + Номенклатура1С.Название + "' найдена карточка номенклатуры с таким же названием.";
		Возврат Результат;
		
	КонецЕсли;
	
	ИниКонфигурация.Номенклатура_ОКЕИ.Значение = "[Номенклатура].ОКЕИ"; // Так как это локальная копия инишки конфигурация, то мне лень переписывать костыль с ОКЕИ в основном коде расчёта инишек
	
	ПараметрыМетода.Вставить("ИниКонфигурация", ИниКонфигурация);
	
	ПодготовленныеДанные 	= СтрокаСопоставленияСБИСКлиент_ВыгрузитьДанныеДляСозданияНоменклатуры1С(ИскомаяНоменклатура, ПараметрыМетода);
	
	ОписаниеОбъекта			= Новый Структура("Ключ, Значение, Ини", "Номенклатура", ПодготовленныеДанные, ИниКонфигурация);
	ДопПараметрыЗаполнить	= Новый Структура("Вложение, СоставПакета", ВложениеСБИС, СоставПакета);
	
	СтруктураНоменклатуры	= ЗаполнитьСтруктуруОбъектаПоИни(ОписаниеОбъекта, ДопПараметрыЗаполнить);
	
	Отказ = Ложь;
	
	ДополнительныеПараметрыСоздания = Новый Структура(	"ТипОбъекта,	ПодТипОбъекта,			Ини",
														"Справочник",	ИмяСправочника,	ИниКонфигурация);
	Результат = СоздатьОбъектИзСтруктуры(СтруктураНоменклатуры, ДополнительныеПараметрыСоздания, Отказ);
	
	Возврат Результат;
	
КонецФункции
