&НаКлиенте
Функция ПорядокАвтоматическогоСопоставленияПоУмолчаниюКлиент() Экспорт
	
	ПорядокАвтоматическогоСопоставления = Новый Массив;
	
	ПорядокАвтоматическогоСопоставления.Добавить("GTIN");
	ПорядокАвтоматическогоСопоставления.Добавить("КодПокупателя");
	ПорядокАвтоматическогоСопоставления.Добавить("Идентификатор");
	ПорядокАвтоматическогоСопоставления.Добавить("Артикул");
	ПорядокАвтоматическогоСопоставления.Добавить("Код");
	ПорядокАвтоматическогоСопоставления.Добавить("КодПоставщика");
	
	Возврат ПорядокАвтоматическогоСопоставления;
	
КонецФункции

&НаКлиенте
Функция СопоставлениеНоменклатуры_ВсеНоменклатурыСопоставлены(НаборСопоставлений) Экспорт
			
	Для Каждого КлассНоменклатуры Из НаборСопоставлений Цикл
		Если НЕ КлассНоменклатуры.Номенклатура1С.Количество()
				Или Не ЗначениеЗаполнено(КлассНоменклатуры.НоменклатураСБИС.Код) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция НайтиСоздатьНоменклатуру1СПоНаборуКлассовСопоставления(ПараметрыМетода) Экспорт

	Результат = Новый Структура("Номенклатура1С, Сообщение");
	
	ВложениеСБИС 	 = ПараметрыМетода.ВложениеСБИС;
	СоставПакета 	 = ПараметрыМетода.СоставПакета;
	НоменклатураСБИС = ПараметрыМетода.НоменклатураСБИС;
	МассоваяЗагрузка = ПараметрыМетода.МассоваяЗагрузка; 
	
	КлассыСопоставленияНоменклатур = ВложениеСБИС.КлассыСопоставленияНоменклатур;
	
	Если МассоваяЗагрузка Тогда
		Результат.Сообщение = Новый Массив;
	КонецЕсли;
	
	// Заполнение метаданных 
	ФункцииДокумента 		= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	ИниКонфигурация 		= МодульОбъектаКлиент().ИниПоПараметрам("Конфигурация");
	ИниКонфигурация.Номенклатура_ОКЕИ.Значение = "[Номенклатура].ОКЕИ";

	Фрм = НайтиФункциюСеансаОбработки("сбисНайтиНоменклатуруПоНаименованию", "РаботаСДокументами1С");
	
	СоставОграниченийТипов	= Фрм.ТипыСправочниковНоменклатуры(ИниКонфигурация);
	ИмяСправочника			= Фрм.ОпределитьИмяТипаОбъекта(СоставОграниченийТипов[0]);
		
	ПараметрыМетода.Вставить("ИниКонфигурация", ИниКонфигурация); 
	// -----------------------------------------------------------------------------------------------------------------------------------
	
	// Параметры создания номенклатуры в 1С
	ДополнительныеПараметрыСоздания = Новый Структура(	"ТипОбъекта,	ПодТипОбъекта,			Ини",
														"Справочник",	ИмяСправочника,	ИниКонфигурация);
	ДопПараметрыЗаполнить	= Новый Структура("Вложение, СоставПакета", ВложениеСБИС, СоставПакета);
	// -----------------------------------------------------------------------------------------------------------------------------------
	
		// Точечный поиск
	ИскомаяНоменклатура 				= Неопределено; 
	ТекущийКлассСопоставления 			= Неопределено; 
	
		//Массовый поиск
	НоменклатураДляПоискаСоздания 		= Новый Массив; 
	ОбнаруженаНесопоставленнаяНоменклатура = Ложь;
	
	Для Каждого КлассСопоставления Из КлассыСопоставленияНоменклатур Цикл
		
		Если МассоваяЗагрузка 
			И НЕ КлассСопоставления.Номенклатура1С.Количество() Тогда
			НоменклатураДляПоискаСоздания.Добавить(КлассСопоставления.НоменклатураСБИС.Наименование);	
			ОбнаруженаНесопоставленнаяНоменклатура = Истина;
		ИначеЕсли НЕ МассоваяЗагрузка 
			И НЕ КлассСопоставления.НоменклатураСБИС.Наименование = НоменклатураСБИС Тогда
			Продолжить;
		ИначеЕсли НЕ МассоваяЗагрузка 
			И КлассСопоставления.НоменклатураСБИС.Наименование = НоменклатураСБИС
			И НЕ КлассСопоставления.Номенклатура1С.Количество() Тогда
			ИскомаяНоменклатура = КлассСопоставления.НоменклатураСБИС;
			ТекущийКлассСопоставления = КлассСопоставления;
			ОбнаруженаНесопоставленнаяНоменклатура = Истина;

		ИначеЕсли НЕ МассоваяЗагрузка 
			И КлассСопоставления.НоменклатураСБИС.Наименование = НоменклатураСБИС
			И КлассСопоставления.Номенклатура1С.Количество() Тогда // Если пользователь нажмёт на Создание номенклатуры по уже сопоставленной позиции

			Результат.Сообщение = "У позиции " + НоменклатураСБИС + " уже имеется карточка номенклатуры с таким же наименованием.";  
			Возврат Результат; 

		Иначе
			Результат.Сообщение = "Возникла непредвиденная ситуация, создание номенклатуры прервано: В документе СБИС не найдена номенклатура с этим именем";
			Возврат Результат;
		КонецЕсли;
		
	КонецЦикла;
	// -----------------------------------------------------------------------------------------------------------------------------------
	
	Если НЕ ОбнаруженаНесопоставленнаяНоменклатура Тогда
		Возврат Результат;
	КонецЕсли;
	
	//Поиск номенклатуры в базе 1С
	Если МассоваяЗагрузка Тогда
		Номенклатуры1С = Фрм.сбисНайтиНоменклатуруПоСпискуНаименований(ИмяСправочника, НоменклатураДляПоискаСоздания);
	Иначе
		Название = ИскомаяНоменклатура.Наименование;
		Номенклатура1С = Фрм.сбисНайтиНоменклатуруПоНаименованию(ИмяСправочника, Название);
		Результат.Номенклатура1С = Номенклатура1С;
	КонецЕсли;
	
	Если НЕ Номенклатура1С = Неопределено И НЕ МассоваяЗагрузка Тогда
		
		Результат.Номенклатура1С = Номенклатура1С;
		Результат.Сообщение = "Для позиции '" + Номенклатура1С + "' найдена карточка номенклатуры с таким же названием.
		| Для сопоставления номенклатуры нажмите кнопку ""Сохранить"".  
		| Для редактирования сопоставления нажмите ""Сопоставить""";;
		ПоместитьНайденнуюСозданнуюНоменклатуруВКлассСопоставления(ТекущийКлассСопоставления, Результат.Номенклатура1С);
		Возврат Результат;
		
	КонецЕсли;
	// -----------------------------------------------------------------------------------------------------------------------------------
	
	// Создание новой номенклатуры 1С и добавление её в класс сопоставления	
	ОписаниеОбъекта = Новый Структура("Ключ, Значение, Ини", "Номенклатура");
	ОписаниеОбъекта.Ключ = "Номенклатура";
	ОписаниеОбъекта.Ини = ИниКонфигурация;

	Отказ = Ложь;
	Если МассоваяЗагрузка Тогда                                      
		// Для начала поместим в КлассыСопоставления номенклатуры, найденные в базе 1С 
		Для Каждого Номенклатура1С Из Номенклатуры1С Цикл
			Для Каждого КлассСопоставления Из КлассыСопоставленияНоменклатур Цикл
				Если НЕ КлассСопоставления.Номенклатура1С.Количество() 
					И Номенклатура1С.Наименование = КлассСопоставления.НоменклатураСБИС.Наименование Тогда
					ПоместитьНайденнуюСозданнуюНоменклатуруВКлассСопоставления(КлассСопоставления, Номенклатура1С.Ссылка); 
					ИмяНом = КлассСопоставления.НоменклатураСБИС.Наименование; 
					Результат.Сообщение.Добавить("Для позиции " + ИмяНом + " найдена карточка номенклатуры с таким же наименованием" + Символы.ПС);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		// ---------------------------------------------------------------------------------------------------------------------------------- 
		
		// Те номенклатуры, которые найти не удалось - создадим и поместим в КлассыСопоставления
		Для Каждого КлассСопоставления Из КлассыСопоставленияНоменклатур Цикл
			Если НЕ КлассСопоставления.Номенклатура1С.Количество() Тогда
				
				НомСбис = КлассСопоставления.НоменклатураСБИС;
				ПодготовленныеДанные = СтрокаСопоставленияСБИСКлиент_ВыгрузитьДанныеДляСозданияНоменклатуры1С(НомСбис, ПараметрыМетода);
				
				ОписаниеОбъекта.Значение = ПодготовленныеДанные;
				
				СтруктураНоменклатуры	= ЗаполнитьСтруктуруОбъектаПоИни(ОписаниеОбъекта, ДопПараметрыЗаполнить);
				
				РезультатСозданияНоменклатуры = СоздатьОбъектИзСтруктуры(СтруктураНоменклатуры, ДополнительныеПараметрыСоздания, Отказ);
				
				ПоместитьНайденнуюСозданнуюНоменклатуруВКлассСопоставления(КлассСопоставления, РезультатСозданияНоменклатуры.Ссылка);
				
				Результат.Сообщение.Добавить("Создана карточка номенклатуры для позиции " + НомСбис.Наименование + Символы.ПС); 
				
			КонецЕсли;
			
		КонецЦикла;
		// ----------------------------------------------------------------------------------------------------------------------------------
	Иначе 
		
		ПодготовленныеДанные 	= СтрокаСопоставленияСБИСКлиент_ВыгрузитьДанныеДляСозданияНоменклатуры1С(ИскомаяНоменклатура, ПараметрыМетода);
		
		ОписаниеОбъекта.Значение = ПодготовленныеДанные;
		
		СтруктураНоменклатуры	= ЗаполнитьСтруктуруОбъектаПоИни(ОписаниеОбъекта, ДопПараметрыЗаполнить);
		
		Результат = СоздатьОбъектИзСтруктуры(СтруктураНоменклатуры, ДополнительныеПараметрыСоздания, Отказ);
		
		Если Отказ Тогда
			Результат.Сообщение = Результат.Сообщение + Символы.ПС;
			Возврат Результат;
		КонецЕсли;
		
		ПоместитьНайденнуюСозданнуюНоменклатуруВКлассСопоставления(ТекущийКлассСопоставления, Результат.Ссылка);
		
		Результат.Сообщение = Результат.Сообщение + Символы.ПС + "Для сопоставления созданной номенклатуры нажмите кнопку ""Сохранить"".
		| Для редактирования сопоставления нажмите ""Сопоставить"".";
		
	КонецЕсли;
	// -----------------------------------------------------------------------------------------------------------------------------------	

	Возврат Результат;
	
КонецФункции

// Процедура - Поместить найденную созданную номенклатуру в класс сопоставления
// Ищет номенклатуру 1С в классе сопоставлений если она сопоставлена, но побилась ссылка или был перенос на новую базу 1С. 
// Если не нашёл - создаёт экземпляр класса ОписаниеНоменклатуры1С и заполняет её данными из номенклатуры загружаемого документа
//
// Параметры:
//  НоменклатураСБИС			 - Структура	 - Экземпляр класса НоменклатураСБИС
//  СсылкаНаНоменклатуруВБазе	 - Ссылка	 	 - Ссылка на номенклатуру 1С
//
&НаКлиенте
Процедура ПоместитьНайденнуюСозданнуюНоменклатуруВКлассСопоставления(ТекущийКлассСопоставления, СсылкаНаНоменклатуруВБазе);
	
	КлассНоменклатура1С = ТекущийКлассСопоставления.Номенклатура1С.Получить(СсылкаНаНоменклатуруВБазе);
	
	Если КлассНоменклатура1С = Неопределено Тогда
		КлассНоменклатура1С = НовыйОписаниеНоменклатуры1СКлиент();
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Номенклатура", СсылкаНаНоменклатуруВБазе);
	ДанныеЗаполнения.Вставить("Основное", Истина);
	ДанныеЗаполнения.Вставить("Цена", ТекущийКлассСопоставления.НоменклатураСБИС.Цена); 
	ДанныеЗаполнения.Вставить("Кол_во", ТекущийКлассСопоставления.НоменклатураСБИС.Кол_во);
	ДанныеЗаполнения.Вставить("Сумма", ТекущийКлассСопоставления.НоменклатураСБИС.Сумма);
	ДанныеЗаполнения.Вставить("СуммаБезНал", ТекущийКлассСопоставления.НоменклатураСБИС.СуммаБезнал);
	ДанныеЗаполнения.Вставить("СуммаНДС", ТекущийКлассСопоставления.НоменклатураСБИС.СуммаНДС);
	ДанныеЗаполнения.Вставить("СтавкаНДС", ТекущийКлассСопоставления.НоменклатураСБИС.СтавкаНДС);
	ДанныеЗаполнения.Вставить("GTIN", ТекущийКлассСопоставления.НоменклатураСБИС.GTIN); 
	
	НайденнаяЕдиница = ПолучитьБазовуюЕдиницуДляНоменклатуры1СКлиент(СсылкаНаНоменклатуруВБазе);
	ЕдиницаСтруктура = НовыйСопоставлениеДляЕдиницыКлиент();
	
	ОКЕИ = ОКЕИБазовойЕдиницыНоменклатуры1С(НайденнаяЕдиница);
	
	СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСтруктура, "Ссылка", НайденнаяЕдиница);
	СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСтруктура, "Владелец", СсылкаНаНоменклатуруВБазе);
	СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСтруктура, "ОКЕИ", ОКЕИ);             
	
	НазваниеЕдиницы = Строка(НайденнаяЕдиница);
	СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСтруктура, "Название", НазваниеЕдиницы);
	
	ЕдиницаСоответствие = Новый Соответствие;
	ЕдиницаСоответствие.Вставить(НайденнаяЕдиница, ЕдиницаСтруктура);
	
	ДанныеЗаполнения.Вставить("ЕдИзм1С", ЕдиницаСоответствие);
	
	ДанныеЗаполнения.Вставить("БазоваяЕдиницаОКЕИ", ОКЕИ);	 
		
	ОписаниеНоменклатуры1СКлиент_Заполнить(КлассНоменклатура1С, ДанныеЗаполнения);	
	ТекущийКлассСопоставления.Номенклатура1С.Вставить(СсылкаНаНоменклатуруВБазе, КлассНоменклатура1С);
	
	СтрокаСопоставленияСБИСКлиент_Вставить(ТекущийКлассСопоставления, "НеобходимоСопоставление", Истина);
	
КонецПроцедуры

&НаСервере
Функция ОКЕИБазовойЕдиницыНоменклатуры1С(ЕдиницаСсылка) Экспорт
	
	// Если у пользователя нет единицы в номенклатуре - поставим ему Штуки принудительно
	Если НЕ ЗначениеЗаполнено(ЕдиницаСсылка) Тогда
		Возврат "796";
	КонецЕсли;
	
	СпрОбъект = ЕдиницаСсылка.ПолучитьОбъект();
	
	Возврат СпрОбъект.Код;
	
КонецФункции

// Функция - Получить базовую единицу для номенклатуры1 С
//
// Параметры:
//  Номенклатура - Ссылка - Ссылка на номенлкатуру 1С
// 
// Возвращаемое значение:
//   - Ссылка на базовую единицу номенклатуры, либо "шт" по умолчанию
//
&НаКлиенте
Функция ПолучитьБазовуюЕдиницуДляНоменклатуры1СКлиент(Номенклатура) Экспорт
	
	СопоставлениеДляЕдиницы = Новый Структура("Владелец, Ссылка", Номенклатура, Неопределено); 
	КлючПоиска = "Единица";
	НайденнаяЕдиница = СопоставлениеДляЕдиницыКлиент_Получить(СопоставлениеДляЕдиницы, КлючПоиска);
	
	Если Не ЗначениеЗаполнено(НайденнаяЕдиница) Тогда
		Попытка
			ДоступныеТипы1С = ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолей1С");
			СпрКлассификаторЕдиниц = ДоступныеТипы1С.КлассификаторЕдиницИзмерения.ТипыМассивСтрок[0];
			СпрКлассификаторЕдиниц = Сред(СпрКлассификаторЕдиниц, Найти(СпрКлассификаторЕдиниц, ".") + 1);
		Исключение
			СпрКлассификаторЕдиниц = "КлассификаторЕдиницИзмерения";
		КонецПопытки;
		НайденнаяЕдиница = ПолучитьЕдиницуИзмеренияШтуки(СпрКлассификаторЕдиниц);
	КонецЕсли;

	Возврат НайденнаяЕдиница;
	
КонецФункции

// Функция - Получить единицу измерения штуки
//
// Параметры:
//  СправочникКлассификаторЕдиницСтрокой - Строка - Имя справочника классификатора единиц измерений
// 
// Возвращаемое значение:
//   - Ссылка на единицу "шт"
//
&НаСервере
Функция ПолучитьЕдиницуИзмеренияШтуки(СправочникКлассификаторЕдиницСтрокой)

	Возврат МодульОбъектаСервер().ПодобратьЕдиницуИзмеренияПоОКЕИ("796", СправочникКлассификаторЕдиницСтрокой);

КонецФункции

