
#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_СопоставлениеНоменклатуры_СтруктураСтрок_СтрокаСопоставленияСБИС
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_СопоставлениеНоменклатуры_СтруктураСтрок_ОписаниеНоменклатуры1С
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_СопоставлениеНоменклатуры_СтруктураСтрок_СопоставлениеДляЕдиницы
#КонецОбласти

&НаКлиенте
Функция ПорядокАвтоматическогоСопоставленияПоУмолчаниюКлиент() Экспорт
	
	ПорядокАвтоматическогоСопоставления = Новый Массив;
	
	ПорядокАвтоматическогоСопоставления.Добавить("GTIN"); // Убрали, т.к. GTIN в отдельном поле
	ПорядокАвтоматическогоСопоставления.Добавить("КодПокупателя");
	ПорядокАвтоматическогоСопоставления.Добавить("Идентификатор");
	ПорядокАвтоматическогоСопоставления.Добавить("Артикул");
	ПорядокАвтоматическогоСопоставления.Добавить("Код");
	ПорядокАвтоматическогоСопоставления.Добавить("Наименование");
	ПорядокАвтоматическогоСопоставления.Добавить("КодПоставщика");
	
	Возврат ПорядокАвтоматическогоСопоставления;
	
КонецФункции

&НаКлиенте
Функция СопоставлениеНоменклатуры_ВсеНоменклатурыСопоставлены(НаборСопоставлений) Экспорт
			
	Для Каждого КлассНоменклатуры Из НаборСопоставлений Цикл
		Если НЕ КлассНоменклатуры.Номенклатура1С.Количество() Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции
