
&НаКлиенте
Функция СбисПослеФормированияТабличнойЧасти(Кэш, Контекст, ДопПараметры) Экспорт	
	Если Кэш.ОбщиеФункции.РассчитатьЗначение("EDI", Контекст.ФайлДанные) = Истина Тогда
		ДанныеТаблДокEDI = ПолучитьДанныеСделкиEDI(Кэш, Контекст);
		ДополнитьТабличнуюЧастьПараметрамиПоДаннымИсходногоЗаказа(Кэш, Контекст, Новый Структура("Формируемый, Исходный", ДопПараметры.ТаблДок, ДанныеТаблДокEDI));
	КонецЕсли;	
	// при необходимости пересчитываем в валюту учета
	Если	ДопПараметры.ПересчитатьВВалютеУчета
		И	ЗначениеЗаполнено(ДопПараметры.ИтогСумма) Тогда
		ПересчитатьТабличнуюЧастьВВалютеУчетаПоИтоговойСумме(Кэш, Контекст, ДопПараметры.ИтогСумма)
	КонецЕсли;
КонецФункции
