
// Процедура - Результат отправки асинх подобрать серфтикат
//
// Параметры:
//  РезультатОтправки		 - РезультатОтправки		 - структура отправки
//  ЦепочкаКомандОбработки	 - ЦепочкаКомандОбработки	 - структура команды
//
&НаКлиенте
Процедура МассоваяОперация_Асинх_ПодобратьСерфтикат(РезультатОтправки, ЦепочкаКомандОбработки) Экспорт
	
	ПараметрыВыполнить = ЦепочкаКомандОбработки.ДанныеКоманд.Получить("МассоваяОперация_Асинх_ПодобратьСерфтикат");
	Попытка
		
		СведенияОСертификате = СведенияСертификатаДляДействияСДокументомСБИС(ПараметрыВыполнить);
		
	Исключение
		
		ОшибкаВыполнитьДействие = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.МассоваяОперация_Асинх_ПодобратьСерфтикат");
		ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Ошибка", ОшибкаВыполнитьДействие);
		
	КонецПопытки;
	
КонецПроцедуры

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_МассоваяОперация_private_Асинх_ПрочитатьДокумент
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_МассоваяОперация_private_Асинх_ДополнитьДокументВложениями
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_МассоваяОперация_private_Асинх_ВыполнитьДействие
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_МассоваяОперация_private_Асинх_Сертификаты
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_МассоваяОперация_private_Асинх_ВводКомментария
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_МассоваяОперация_private_Асинх_РазобратьДляЗагрузки
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_МассоваяОперация_private_Асинх_СформироватьРасхождение
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_МассоваяОперация_private_Асинх_ПрогрессБар
#КонецОбласти

