
&НаКлиенте
Функция СертификатУстановленЛокально(СертификатВходящий, ДопПараметры = Неопределено) Экспорт
	
	Перем КэшСертификатовСБИС;
	
	Попытка
	 	СертПодходит = Ложь;
		Если Не ГлобальныйКэш.ТекущийСеанс.Свойство("КэшСертификатовСБИС",КэшСертификатовСБИС) Тогда
			ОбновитьКэшСертификатов();
		ИначеЕсли ТекущаяДата() - КэшСертификатовСБИС.ДатаПоследнегоОбновленияКэшаСерт > 60 Тогда
			ОбновитьКэшСертификатов(); 
		КонецЕсли;
		
		СертЛокальный = ГлобальныйКэш.ТекущийСеанс.КэшСертификатовСБИС.Сертификаты.Получить(СертификатВходящий.Отпечаток);
		Если СертЛокальный = Неопределено Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
		Возврат Истина 
	Исключение 
		Ошибка = ОписаниеОшибки();
		ВызватьСбисИсключение(ИнформацияОбОшибке(),"МодульОбъектаКлиент.СертификатУстановленЛокально");
	КонецПопытки;
	
КонецФункции   

&НаКлиенте
Процедура ОбновитьКэшСертификатов()
	
	СписокЛокальныхСертификатов = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ПолучитьСписокЛокальныхСертификатов(ГлавноеОкно.Кэш);
	
	СертификатыЛокальныеСоответствие = Новый Соответствие;
	Для Каждого Серт из СписокЛокальныхСертификатов Цикл
					
		СертификатыЛокальныеСоответствие.Вставить(Строка(Серт.Значение.Отпечаток),Серт); 
		
	КонецЦикла;
			
	КэшСертификатовСБИС = Новый Структура("Сертификаты, ДатаПоследнегоОбновленияКэшаСерт", СертификатыЛокальныеСоответствие, ТекущаяДата());
	ГлобальныйКэш.ТекущийСеанс.Вставить("КэшСертификатовСБИС",КэшСертификатовСБИС);
	
КонецПроцедуры

