
&НаКлиенте 
Функция ДанныеСертификатаДляДействияСДокументомСБИС(ВыбранныйСертификат, ДопПараметры=Неопределено)
	
	СведенияОбИнтеграции	= ПолучитьЗначениеПараметраТекущегоСеанса("СведенияОбИнтеграции");
	
	ПолучитьДанныеСертификата =			СведенияОбИнтеграции.Параметры.ВстроеннаяКриптография
								И Не	ВыбранныйСертификат.Ключ.Тип = "Отложенный"
								И Не	ВыбранныйСертификат.Ключ.Тип = "Серверный"
								И Не	ВыбранныйСертификат.Ключ.Тип = "ОтложенныйСПодтверждением";
		
	ДанныеРезультат = Новый Структура("Сертификат", ВыбранныйСертификат);
								
	Если ПолучитьДанныеСертификата Тогда
		
		Кэш					= ПолучитьТекущийЛокальныйКэш();
		МодульКриптография	= Кэш.ФормаЭП;
		Попытка
			
			СертификатДД = МодульКриптография.сбисДвоичныеДанныеСертификатаПоОтпечатку(Кэш, ВыбранныйСертификат.Отпечаток); 
			
		Исключение
			
			ДанныеОтпечаток = Новый Структура("Отпечаток", ВыбранныйСертификат.Отпечаток);
			ОшибкаПодбораДвоичныхДанных = НовыйСбисИсключение(ИнформацияОбОшибке(),
				"МодульОбъектаКлиент.ДанныеСертификатаДляДействияСДокументомСБИС",,,,ДанныеОтпечаток);
			ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаПодбораДвоичныхДанных);
			
		КонецПопытки;
				
		ДанныеРезультат.Вставить("ДвоичныеДанные",	СертификатДД);
		ДанныеРезультат.Вставить("Алгоритм",		МодульКриптография.сбисВыбратьНаборАлгоритмовДляСозданияПодписи(ВыбранныйСертификат.Алгоритм));
		
	КонецЕсли;
	
	Возврат ДанныеРезультат;
	
КонецФункции
	
// Функция - Подобрать сертификат для действия с документом СБИС
//
// Параметры:
//  ПараметрыДействия	 - Структура	 - 
//  ДопПараметры		 - Структура/Неопределено	 - 
// 
// Возвращаемое значение:
//  Структура/Неопределено - Сертификат, ДвоичныеДанные (при активной криптографии 1С), Алгоритм (при активной криптографии 1С)
//
&НаКлиенте 
Функция СведенияСертификатаДляДействияСДокументомСБИС(ПараметрыДействия, ДопПараметры = Неопределено) Экспорт
	Перем ДокументСБИСДействия, ДействиеДляПоискаСертификата, ПодходящийСертДок;
	
	ПараметрыДействия.Свойство("СоставПакета",	ДокументСБИСДействия);
	ПараметрыДействия.Свойство("Действие",		ДействиеДляПоискаСертификата);
	
	Если Не ПараметрыДействия.Свойство("Сертификат",	ПодходящийСертДок)
		Или	ПодходящийСертДок = Неопределено Тогда

		ПодходящийСертДок = ПодобратьСертификатДляДействияСБИС(ДействиеДляПоискаСертификата, ДопПараметры);
		Если	ПодходящийСертДок = Неопределено
			И	ЗначениеЗаполнено(ДокументСБИСДействия) Тогда
			
			ПодходящийСертДок = СоставПакета_Получить(ДокументСБИСДействия, "ПодходящийСертификат");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПодходящийСертДок = Неопределено Тогда
		
		ОшибкаВыполнитьДействие = НовыйСбисИсключение(731101, "МодульОбъектаКлиент.СведенияСертификатаДляДействияСДокументомСБИС",,,
		"Отсутствует сертификат для утверждения/отклонения пакета документов");
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаВыполнитьДействие);
		
	КонецЕсли;
	
	КэшСертификатов = КэшСертификатов_Данные(); 
	КлючКэш = "Данные_" + ПодходящийСертДок.Отпечаток;
	
	ДанныеСертификата = КэшСертификатов.Сертификаты.Получить(КлючКэш);
	Если ДанныеСертификата = Неопределено Тогда
		
		ДанныеСертификата = ДанныеСертификатаДляДействияСДокументомСБИС(ПодходящийСертДок);
		
		КэшСертификатов.Вставить(КлючКэш, ДанныеСертификата);
		
	КонецЕсли;
	
	Возврат ДанныеСертификата;
	
КонецФункции

// Функция - Подобрать сертификат для действия с документом СБИС
//
// Параметры:
//  ПараметрыДействия	 - Структура	 - 
//  ДопПараметры		 - Структура/Неопределено	 - 
// 
// Возвращаемое значение:
//  Структура/Неопределено - Сертификат, ДвоичныеДанные (при активной криптографии 1С), Алгоритм (при активной криптографии 1С)
//
&НаКлиенте 
Функция ПодобратьСертификатДляДействияСБИС(ДействиеСБИС, ДопПараметры = Неопределено) 
	Перем ПодходящийСертДок;
	
	Если ДействиеСБИС.Свойство("Сертификат") Тогда
		
		// Проверить серты на Действие
		Для Каждого Сертификат Из ДействиеСБИС.Сертификат Цикл
			
			Если СертификатУстановленЛокально(Сертификат) Тогда
				
				ПодходящийСертДок =  Сертификат;
				Прервать;
				
			КонецЕсли;
			
			Если Не ПодходящийСертДок = Неопределено Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			// Первый отложенный, либо серверный сертификат, если не удалось подобрать локальный
			Если	Сертификат.Ключ.Тип = "Отложенный" 
				Или Сертификат.Ключ.Тип = "ОтложенныйСПодтверждением"
				Или Сертификат.Ключ.Тип = "Серверный" Тогда // Проверка на отложенный сертификат 
				
				ПодходящийСертДок = Сертификат;
					
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ПодходящийСертДок;
	
КонецФункции

&НаКлиенте
Функция СертификатУстановленЛокально(СертификатВходящий, ДопПараметры = Неопределено) Экспорт
	Перем КэшСертификатовСБИС;
	
	СертПодходит = Ложь;
	
	Попытка
		
		КэшСертификатовСБИС	= КэшСертификатов_Данные(); 
		СертЛокальный		= КэшСертификатовСБИС.Сертификаты.Получить(СертификатВходящий.Отпечаток);
		Если СертЛокальный = Неопределено Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
		Возврат Истина;
		
	Исключение
		
		Ошибка = ОписаниеОшибки();
		ВызватьСбисИсключение(ИнформацияОбОшибке(),"МодульОбъектаКлиент.СертификатУстановленЛокально");
		
	КонецПопытки;
	
КонецФункции   

// Функция - возвращает кэш сертификатов. Раз в минуту проводит обновление. Инициирует кэш, если нет.
//
// Параметры:
//  ОбновитьПринудительно	 - Булево	 - Очистить кэш даже если минута еще не прошла
// 
// Возвращаемое значение:
//  Соответствие - кэш сертификатов по отпечатку и ИНН организации для действия
//
&НаКлиенте
Функция КэшСертификатов_Данные(ОбновитьПринудительно = Ложь)
	Перем КэшСертификатовСБИС;
	
	Если	ГлобальныйКэш.ТекущийСеанс.Свойство("КэшСертификатовСБИС", КэшСертификатовСБИС)
		И	ТекущаяДата() - КэшСертификатовСБИС.ДатаПоследнегоОбновленияКэшаСерт < 60
		И	Не ОбновитьПринудительно Тогда
		
		// Принудительно, или кэш не проинициирован, или прошла минута с момента последнего обновления
        Возврат КэшСертификатовСБИС;
		
	КонецЕсли;
	
	СписокЛокальныхСертификатов = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ПолучитьСписокЛокальныхСертификатов(ГлавноеОкно.Кэш);
	
	СертификатыЛокальныеСоответствие = Новый Соответствие;
	Для Каждого Серт из СписокЛокальныхСертификатов Цикл
					
		СертификатыЛокальныеСоответствие.Вставить(Строка(Серт.Значение.Отпечаток),Серт); 
		
	КонецЦикла;
			
	КэшСертификатовСБИС = Новый Структура("Сертификаты, ДатаПоследнегоОбновленияКэшаСерт", СертификатыЛокальныеСоответствие, ТекущаяДата());
	ГлобальныйКэш.ТекущийСеанс.Вставить("КэшСертификатовСБИС",КэшСертификатовСБИС);
	
	Возврат КэшСертификатовСБИС;

КонецФункции

