
//DynamicDirective
Процедура яИнтеграцияSABY_ОчиститьВременныйЧистыйКаталог(ИнтеграцияSABY, ДопПараметры = Неопределено)

	ПараметрыВыгрузки = МодульОбъектаКлиентСервер().ИнтеграцияSABY_Выгрузить(ИнтеграцияSABY, "ПараметрыДляЧтенияИни");
	Если ПараметрыВыгрузки.КаталогНастроек = ПараметрыВыгрузки.Идентификатор Тогда
		
		// На всякий случай дополнительная проверка. Если каталог настроек это общий каталог, то ничего с ним не делать.
		Возврат;
		
	КонецЕсли;
	
	УдалитьФайлыНаСервере(ПараметрыВыгрузки.КаталогНастроек);
	
КонецПроцедуры

