
// Функция - формирует Струкутру данных объекта по инишке
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - экземпляр вложения сбис
//  ДопПараметры - Структура	 - Расширение. СоставПакета - Экземпляр СоставПакета
// 
// Возвращаемое значение:
//  Структура - Договор, Дата, Контрагент
//
&НаКлиенте
Функция ВложениеСБИС_РассчитанныйОбъект(ВложениеСБИС, ДопПараметры)
	Перем ЗначениеВставить, РежимОпределенияОбъекта, СтруктураДокОбъект;
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;

	Если ВложениеСБИС.Параметры.Свойство("РассчитанныйОбъект", СтруктураДокОбъект) Тогда
		
		// Если есть рассчитанный объект, то он всегда более полный, чем базовые поля (они включаются туда)
		Возврат СтруктураДокОбъект;
		
	ИначеЕсли  	ДопПараметры.Свойство("Режим", РежимОпределенияОбъекта)		
			И	(	РежимОпределенияОбъекта = "Основание"
				Или	РежимОпределенияОбъекта = "Документ"  
				Или	РежимОпределенияОбъекта = "Фильтр") Тогда
			
		Если ВложениеСБИС.Параметры.Свойство("БазовыеПоляОбъекта", СтруктураДокОбъект) Тогда 
			
			Возврат СтруктураДокОбъект;
			
		КонецЕсли;
		
		// Попали в режим поиска основания, или документа, но при этом расчитанного объекта еще нет
		ЭтоПолныйРасчет = Ложь;
		
	Иначе
		
		ЭтоПолныйРасчет = Истина;

	КонецЕсли;
	
	СтатусВложения		= ВложениеСБИС_Получить(ВложениеСБИС, "Статус");
	СтруктураИниФайла	= ВложениеСБИС_Получить(ВложениеСБИС, "УстановленныйПодразделИни");
	Если	СтатусВложения = "Ошибка"
		Или	СтруктураИниФайла = Неопределено Тогда
		
		Возврат Новый Структура;
		
	КонецЕсли;
	

	Если Не ЭтоПолныйРасчет Тогда
		
		// Получим поля для поиска по шаблону узлов "Документ_", чтобы не считать лишнего
		ОписаниеОбъекта			= Новый Структура("Ключ, Значение, Ини", "Документ", ВложениеСБИС.СтруктураФайла, СтруктураИниФайла);
		ДопПараметрыЗаполнить	= Новый Структура("Вложение, СоставПакета", ВложениеСБИС, ДопПараметры.СоставПакета);
		СтруктураДокОбъект		= ЗаполнитьСтруктуруОбъектаПоИни(ОписаниеОбъекта, ДопПараметрыЗаполнить);
		
	ИначеЕсли		ВложениеСБИС.Параметры.РедактироватьДокумент
			И	Не	РежимОпределенияОбъекта = "Разбор" Тогда
		
		ДокументДляРедактирования = ВложениеСБИС_Получить(ВложениеСБИС, "ПодходящийДокумент", ДопПараметры);
		
		Если ДокументДляРедактирования = Неопределено Тогда
			
			Возврат Новый Структура;
			
		КонецЕсли;
		
		СтруктураДокОбъект = ПолучитьДанныеОбъекта1С(ДокументДляРедактирования);
		
	Иначе
		
		СтруктураДокОбъект			= Новый Структура; // Структура с названиями полей, как у создаваемого документа 1С
		ПараметрыДляРасчетаОбъекта	= Новый Структура("Режим", "Подготовка");
		СбисОбщиеФункции			= ПолучитьЗначениеПараметраСбис("ФункцииДокументов");
		СтруктураДанныхДокумента	= СбисОбщиеФункции.СкопироватьОбъектСПараметрамиКлиент(СтруктураИниФайла);
		
		ПараметрыПолучить	= Новый ФиксированнаяСтруктура("СоставПакета, ТипКратко", ДопПараметры.СоставПакета, Истина);
		ТипДокумента		= ВложениеСБИС_Получить(ВложениеСБИС, "ТипОбъекта", ПараметрыПолучить);
		
		ВложениеСБИС.Удалить("ВходящийКонтекст");
		ВложениеСБИС_ЗаполнитьПараметрыПередРасчетом(ВложениеСБИС, ДопПараметры);
	
		НаборФорм = Новый Массив;
		НаборФорм.Добавить("Документ_" + ТипДокумента);
		НаборФорм.Добавить("Документ_Шаблон");
		
		фрм = НайтиФункциюСеансаОбработки("ЗаполнитьДаннымиСтруктурыФайлаСтруктуруДокумента", НаборФорм);
		фрм.ЗаполнитьДаннымиСтруктурыФайлаСтруктуруДокумента(	ПолучитьТекущийЛокальныйКэш()
															,	ВложениеСБИС.СтруктураФайла
															,	СтруктураДанныхДокумента
															,	СтруктураДокОбъект
															,	Новый Массив
															,	ДопПараметры.СоставПакета
															,	ВложениеСБИС
															,	ПараметрыДляРасчетаОбъекта);
		
	КонецЕсли;
	
	Если ЭтоПолныйРасчет Тогда
		
		ВложениеСБИС.Параметры.Вставить("РассчитанныйОбъект", СтруктураДокОбъект);
		
	Иначе
		
		ВложениеСБИС.Параметры.Вставить("БазовыеПоляОбъекта", СтруктураДокОбъект);
		
	КонецЕсли;
	
	Возврат СтруктураДокОбъект;

КонецФункции

// Процедура - Заполняет ВложениеСБИС для открытия на форме просмотра
//
// Параметры:
//  ВложениеСБИС - 	 - 
//  ДопПараметры - 	 - 
//
&НаКлиенте
Процедура ВложениеСБИС_РазобратьДляПросмотра(ВложениеСБИС, ДопПараметры)
	
	ПараметрыДляПросмотра = Новый Структура;
	
	ВложениеСБИС.Вставить("Просмотр", ПараметрыДляПросмотра);
	
	ПараметрыДляПросмотра.Вставить("ПараметрыКонтрагент", Новый Структура("ПоказатьСозданиеКарточки", Ложь));
	
КонецПроцедуры

// Процедура - заполняет текущий экземпляр класса от входных данных
//
// Параметры:
//  ВложениеСБИС	 - Структура	- (О) экземпляр класса
//  ДанныеЗаполнить	 - Структура	- (О) входные данные заполнить
//  КлючЗаполнить	 - Строка	 	- (Н) ключ входных данных, если это не класс (невозможно определить что за класс)
//
&НаКлиенте
Функция ВложениеСБИС_ДанныеФайла(ВложениеСБИС) 
	
	ИнтеграцияМодуль	= ПолучитьЗначениеПараметраСбис("Интеграция");
	ФайлЗначение		= ВложениеСБИС_Получить(ВложениеСБИС, "Файл");
	Попытка
		Если ВложениеСБИС_Получить(ВложениеСБИС, "Зашифрован") Тогда
			
			XMLФайла = ИнтеграцияМодуль.РасшифроватьФайлВложения(ФайлЗначение);
			
		Иначе
			
			XMLФайла = ИнтеграцияМодуль.ПрочитатьФайлВложения(ФайлЗначение);
			
		КонецЕсли;
	Исключение
		
		ДампОшибки = Новый Структура("ФайлЗначение", ФайлЗначение);
		ОшибкаЗаписиДанных = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ВложениеСБИС_ДанныеФайла",,,"Не удалось прочитать данные файла.", ДампОшибки);
		ВызватьИсключение СбисИсключение_Представление(ОшибкаЗаписиДанных);
		
	КонецПопытки;
	
	Возврат XMLФайла;

КонецФункции

&НаКлиенте
Процедура ВложениеСБИС_Заполнить_ПоВложениеСБИС(ВложениеСБИС, ДанныеЗаполнить) 
	Перем Документы1СВложения;
	
	ЗаполнитьЗначенияСвойств(ВложениеСБИС, ДанныеЗаполнить);
	
	Если		ВложениеСБИС.Документы1С.Количество() Тогда
		
		//Создать копию списка оснований, чтобы разорвать связь со старым классом
		Документы1СВложенияКопия = Новый СписокЗначений;
		Документы1СВложенияКопия.ЗагрузитьЗначения(ВложениеСБИС.Документы1С.ВыгрузитьЗначения());
		ВложениеСБИС.Документы1С = Документы1СВложенияКопия;
		
	ИначеЕсли	ДанныеЗаполнить.Свойство("Документ1С") Тогда
		
		ВложениеСБИС_Заполнить(ВложениеСБИС, ДанныеЗаполнить.Документ1С, "Документ1С")
		
	КонецЕсли;
		
	//Необязательные поля
	Если	ДанныеЗаполнить.Свойство("ТребуетПодписания") Тогда
		
		ВложениеСБИС.Вставить("ТребуетПодписания", ДанныеЗаполнить.ТребуетПодписания);
		
	КонецЕсли; 
	
	//Необязательные поля
	Если	ДанныеЗаполнить.Свойство("ТребуетсяПриложить") Тогда
		
		ВложениеСБИС.Вставить("ТребуетсяПриложить", ДанныеЗаполнить.ТребуетсяПриложить);
		
	КонецЕсли; 
	
	Если	ДанныеЗаполнить.Свойство("Параметры") Тогда
		
		ВложениеСБИС.Параметры.ИспользоватьГенератор = ДанныеЗаполнить.Параметры.ИспользоватьГенератор = Истина;
		
	КонецЕсли;

	
	Если	ДанныеЗаполнить.Свойство("НоменклатураКодКонтрагента") Тогда
		
		ВложениеСБИС.Вставить("НоменклатураКодКонтрагента", ДанныеЗаполнить.НоменклатураКодКонтрагента);
		
	КонецЕсли;
	
	Если	ДанныеЗаполнить.Свойство("ДопПоля") Тогда
		
		ВложениеСБИС.Вставить("ДопПоля", ДанныеЗаполнить.ДопПоля);
		
	КонецЕсли;
	
	Если	ДанныеЗаполнить.Свойство("Провести") Тогда
		
		ВложениеСБИС.Вставить("Провести", ДанныеЗаполнить.Провести);
		
	КонецЕсли;
				
КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_ЗаписатьСостояниеЭД(Документ1С, СоставПакета, ВложениеСБИС)
	
	Кэш	= ПолучитьТекущийЛокальныйКэш();   
	
	Если ПолучитьЗначениеПараметраСбис("СостояниеЭД") Тогда
													   
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("ИмяФункции",	"ДублироватьСостояние");
		ПараметрыПоиска.Вставить("КлючФорм",	"Статусы_СостоянияЭД");
		ФормаЭД = Кэш.ОбщиеФункции.сбисНайтиФормуФункцииПодсистемы(Кэш, ПараметрыПоиска); 
		
		Если Не ФормаЭД = Ложь Тогда
			СтруктураФайла = ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
			ФормаЭД.ДублироватьСостояние(СоставПакета, Документ1С, ВложениеСБИС.XMLДокумента, СтруктураФайла);
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВложениеСБИС_ПодходящийДокумент(ВложениеСбис, ДопПараметры)
	Перем РежимПодбора, РежимПоиска;
	
	Если Не ДопПараметры.Свойство("Режим", РежимПодбора) Тогда
		
		РежимПодбора = "Документ";
		
	КонецЕсли;
	
	Если	РежимПодбора = "Документ"
		Или	РежимПодбора = "Разбор" Тогда
		
		Если ДопПараметры.Свойство("ПодходящийДокумент") Тогда
			
			// Не надо выполнять подбор, есть документ.
			Возврат ДопПараметры.ПодходящийДокумент;
			
		КонецЕсли;
		
		ПараметрыПросмотр = Неопределено;
		Если		ВложениеСбис.Параметры.Свойство("РедактируемыеПоля", ПараметрыПросмотр)
			И	Не	ПараметрыПросмотр = Неопределено
			И	Не	ПараметрыПросмотр.Документ = Неопределено
			И	Не	ПараметрыПросмотр.Документ.Значение = Неопределено Тогда
			
			// При пустой ссылке
			// Есть определенный вручную документ
			Возврат ПараметрыПросмотр.Документ.Значение;
			
		КонецЕсли;
		
		Если	ВложениеСбис.Параметры.ВозможноРедактироватьДокумент
			И	РежимПодбора = "Разбор" Тогда
			
			//Получить документ через узел Документ, если описан поиск ссылки, а не тип
			Документ_Модуль		= ПолучитьФормуОбработки("Документ_Шаблон");
			ЛокальныйКэш		= ПолучитьТекущийЛокальныйКэш();
			
			КонтекстДляРассчитать	= Новый Структура("Переменные, Документ, Ини, Вложение, СоставПакета", Новый Структура, Новый Структура);
			КонтекстДляРассчитать.Ини			= ВложениеСБИС_Получить(ВложениеСбис, "УстановленныйПодразделИни");
			КонтекстДляРассчитать.Вложение		= ВложениеСБИС;
			КонтекстДляРассчитать.СоставПакета	= ДопПараметры.СоставПакета;
			
			ИмяУзляРасчетаТипа	= "Документ";
			ЗначениеУзлаРасчета	= Неопределено;
			
			ЗначениеДокумент = Документ_Модуль.РассчитатьПараметрИни(ЛокальныйКэш, ИмяУзляРасчетаТипа, ЗначениеУзлаРасчета, КонтекстДляРассчитать, Новый Структура("ВызовСервера", Истина));
			Если		ЗначениеЗаполнено(ЗначениеДокумент)
				И	Не	ТипЗнч(ЗначениеДокумент) = Тип("Строка") Тогда
				
				Возврат ЗначениеДокумент;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка
		
		Если	Не	ДопПараметры.Свойство("ИскатьДокумент")
			Или		ДопПараметры.ИскатьДокумент Тогда
			
			ДокументыПодходят = ВложениеСБИС_НайтиПодходящиеДокументы(ВложениеСбис, ДопПараметры);
			Если ДокументыПодходят.Количество() Тогда
				
				Возврат ДокументыПодходят[0];
				
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		
		ОшибкаПоиска = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ВложениеСБИС_ПодходящийДокумент");
		// Может быть ошибка поиска документа, нет узлов для подбора. Игнорировать.
		Если Не ОшибкаПоиска.code = 760 Тогда
			
			ВызватьИсключение СбисИсключение_Представление(ОшибкаПоиска);
			
		КонецЕсли;
		
	КонецПопытки;
	
	//Проверить подходящий документ на пакете.
	ДопПараметры.Свойство("Режим", РежимПоиска);
	ПараметрыПоиска = Новый Структура("ВложениеСБИС, Режим", ВложениеСБИС, РежимПоиска);
	Если ДопПараметры.Свойство("ТекущийУзелИни") Тогда
		
		ПараметрыПоиска.Вставить("УзелИни", ДопПараметры.ТекущийУзелИни);
		
	КонецЕсли;
	
	Возврат СоставПакета_Получить(ДопПараметры.СоставПакета, "ДокументДляВложения", ПараметрыПоиска);
		
КонецФункции

&НаКлиенте
Процедура ПодготовитьСоответствиеРасхожденияДокумент1С_Вложение(Вложение, Документ1ССсылка, СоответствиеДокументДанные)
	
	ВходящийКонтекстРасчета = Новый Структура;
	мФайлДляРасчета = Найти_мФайлПоВложению(Вложение, Документ1ССсылка);                
	
	Если мФайлДляРасчета <> Неопределено Тогда
		СравнениеНеНужно = ГлавноеОкно.Кэш.Общиефункции.РассчитатьЗначение("СравнениеДокументаНеПоддерживается",мФайлДляРасчета.Значение);
		Если СравнениеНеНужно = Истина Тогда
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗначениеИниДокумента = Новый Структура;
	ЗначениеИниДокумента.Вставить("мФайл",											Новый Структура(мФайлДляРасчета.Ключ, мФайлДляРасчета.Значение));
	//ЗначениеИниДокумента.Вставить("Формат2019",										Новый Структура("Значение,РассчитанноеЗначение", Истина, Истина));
	//ЗначениеИниДокумента.Вставить("ФорматУКД2020",									Новый Структура("Значение,РассчитанноеЗначение", Истина, Истина));
	//ЗначениеИниДокумента.Вставить("ВходящийКонтекст",								Новый Структура("Значение,РассчитанноеЗначение", "", ВходящийКонтекстРасчета));
	//ЗначениеИниДокумента.Вставить("ИспользоватьШтрихкодыНоменклатурыКонтрагентов",	Новый Структура("Значение,РассчитанноеЗначение", ГлобальныйКэш.Парам.ИспользоватьШтрихкодыНоменклатурыКонтрагентов, ГлобальныйКэш.Парам.ИспользоватьШтрихкодыНоменклатурыКонтрагентов));
	
	ИниДокумента = СтрПолучитьСтроку(СтрЗаменить(ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.ПолучитьИмяИСПоСсылке(Документ1ССсылка), ".", Символы.ПС), 2);
	ИдентификаторДокумента = СбисИдентификаторДокумента1С(Документ1ССсылка, ИниДокумента);
	СоответствиеДокументДанные.Вставить(ИдентификаторДокумента, Новый Структура("ИмяИни, ДокументДанные",ИниДокумента,ЗначениеИниДокумента)); 	

КонецПроцедуры
	
// Функция - определяет сторону по указанной роли.
//
// Параметры:
//  ВложениеСБИС	 - ВложениеСБИС		 - структура с данными сторон
//  ПараметрыРоли	 - Строка/Структура	 - роль, которую надо извлечь
// 
// Возвращаемое значение:
//  класс сторона - структура для роли документооборота
//
&НаКлиенте
Функция ВложениеСБИС_СторонаПоРоли(ВложениеСБИС, ПараметрыРоли)
	Перем КлючРоли;

	Если ТипЗнч(ПараметрыРоли) = Тип("Строка") Тогда
		
		КлючРоли = ПараметрыРоли;
		
	ИначеЕсли Не ПараметрыРоли.Свойство("КлючРоли", КлючРоли) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Если КлючРоли = "СопоставлениеНоменклатуры" Тогда
		
		Возврат ВложениеСБИС_СторонаПоРоли_СопоставлениеНоменклатуры(ВложениеСБИС, ПараметрыРоли);
		
	Иначе

		Возврат ВложениеСБИС_СторонаПоРоли_Документооборот(ВложениеСБИС, ПараметрыРоли);

	КонецЕсли;
	
КонецФункции

// Функция - определяет документы по текущему типу. Делает поиск при отсутствии подходящих документов на вложении
//
// Параметры:
//  ВложениеСБИС - Структура	- класс вложение СБИС
//  ДопПараметры - Структура	- перекрывает ключи из Вложения:
//		СоставПакета		- Структура, состав пакета. Обязателен если нет явно определенных сторон Организация 1С и Контрагент 1С
//		ТипДокумента		- Строка, описание документа, который ищется
//		ВсеПодходящие		- Булево (Ложь) - продолжить поиск даже если на вложении есть уже подходящий документ
//		СтруктураИниФайла	- (Необязательный, возьмется от вложения)Раздел ини мДокумент для определения реквизитов и организации запроса
//		Контрагент1С		- Ссылка на сторону контрагента (партнера) 1С в явном виде
//		Организация1С		- Ссылка на сторону организации 1С в явном виде
//		КонтрагентСБИС		- Класс Сторона с описанием первичный и вспомогательных ключей стороны
//		ОрганизацияСБИС		- Класс Сторона с описанием первичный и вспомогательных ключей стороны
// 
// Возвращаемое значение:
//  класс сторона - структура для роли документооборота
//
&НаКлиенте
Функция ВложениеСБИС_НайтиПодходящиеДокументы(ВложениеСБИС, ДопПараметры)
	Перем	СоставПакета, ИмяРеквизитаРасчет, ИмяРеквизитаРасчетВспом,
			ЗначениеДата, ЗначениеДатаВх, ЗначениеНомер, ЗначениеНомерВх, РежимПоискаДокумента;
			
	Если Не ДопПараметры.Свойство("Режим", РежимПоискаДокумента) Тогда
		
		РежимПоискаДокумента = "Документ"
		
	КонецЕсли;

	Если	РежимПоискаДокумента = "Документ"
		Или	РежимПоискаДокумента = "Разбор" Тогда
		
		СсылкиПоТипу = ВложениеСБИС_НайтиПодходящиеДокументы_ПроверитьПоТипу(ВложениеСБИС, ДопПараметры);
		
		Если ЗначениеЗаполнено(СсылкиПоТипу) Тогда
			
			Возврат СсылкиПоТипу;
			
		КонецЕсли;
		
	КонецЕсли;

	Результат			= Новый Массив;		
	ПараметрыФильтра	= ВложениеСБИС_НайтиПодходящиеДокументы_ПараметрыФильтра(ВложениеСБИС, ДопПараметры);

	ВложениеСБИС_НайтиПодходящиеДокументы_УстановитьФильтрПоДатеНомеру(ВложениеСБИС, ПараметрыФильтра);
	
	//Обработка контрагента
	Если ПараметрыФильтра.ЕстьПоискПоКонтрагенту Тогда
		
		Попытка
			
			ВложениеСБИС_НайтиПодходящиеДокументы_УстановитьФильтрПоСтороне(ВложениеСБИС, ПараметрыФильтра);
			
		Исключение
			
			ВызватьСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ВложениеСБИС_НайтиПодходящиеДокументы");
			
		КонецПопытки;
		
	КонецЕсли;

	//Обработка организации
	Если ПараметрыФильтра.ЕстьПоискПоОрганизации Тогда

		Попытка
			
			ВложениеСБИС_НайтиПодходящиеДокументы_УстановитьФильтрПоСтороне(ВложениеСБИС, ПараметрыФильтра);
			
		Исключение
			
			ВызватьСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ВложениеСБИС_НайтиПодходящиеДокументы");
			
		КонецПопытки;
		
	КонецЕсли;
	
	Попытка
		
		РезультатПоиска = ОписаниеЗапроса_ВыполнитьЗапросСервер(ПараметрыФильтра.ОписаниеЗапроса);
		
	Исключение
		
		ВызватьСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ВложениеСБИС_НайтиПодходящиеДокументы");
		
	КонецПопытки;

	Для Каждого ЭлементНайден Из РезультатПоиска Цикл
		
		Если		ЭлементНайден.Свойство("ОбъектСсылка") Тогда
			
			Результат.Добавить(ЭлементНайден.ОбъектСсылка);
			
		ИначеЕсли   ЭлементНайден.Свойство("Ссылка") Тогда
			
			Результат.Добавить(ЭлементНайден.Ссылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция  ОписаниеЗапроса_ВыполнитьЗапросСервер(Знач ОписаниеЗапроса)
	
	ТекстЗапроса = ОписаниеЗапроса.Текст;
	Для Каждого ЭлементФормат Из ОписаниеЗапроса.Формат Цикл
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{" + ЭлементФормат.Ключ + "}", ЭлементФормат.Значение);
		
	КонецЦикла;
	Попытка
		
		Возврат МодульОбъектаСервер().ВыполнитьЗапросСПараметрами(ТекстЗапроса, ОписаниеЗапроса.Параметры, Новый Структура("Размер"));
		
	Исключение
		
		ВызватьИсключение(МодульОбъектаСервер().СбисИсключение_ВСтроку(ИнформацияОбОшибке(), "МодульОбъектаСервер.ВыполнитьЗапросСПараметрами")); 
		
	КонецПопытки;
	
КонецФункции

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ВложениеСБИС_private_ЗаполнитьПараметрыПередРасчетом
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ВложениеСБИС_private_ЗаполнитьПоДокументФайл
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ВложениеСБИС_private_НайтиПодходящиеДокументы
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ВложениеСБИС_private_Обновить
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ВложениеСБИС_private_Поля1С
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ВложениеСБИС_private_РазобратьНоменклатуру
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ВложениеСБИС_private_Получить
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ВложениеСБИС_private_СторонаПоРоли
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ВложениеСБИС_private_УстановитьИниЗагрузки
#КонецОбласти

