
// Процедура - Вложение СБИС объединить
// Объединяет однотипные вложения по формату
//
// Параметры:
//  ВложенияСБИС - Структура - Класс ВложениеСБИС
//  ДопПараметры - Структура - Набор параметров
//
&НаКлиенте
Процедура ВложениеСБИС_Объединить(ВложениеСБИС, ДобавляемоеВложение, ДопПараметры)
	Перем СбисТип, СбисВерсияФормат;
	
	Если Не	(ДобавляемоеВложение.Свойство("Тип", сбисТип)
		 И ДобавляемоеВложение.Свойство("ВерсияФормата", СбисВерсияФормат)
		 И ЗначениеЗаполнено(СбисВерсияФормат)) Тогда
		//В случае неформализованных вложений будет пустая версия формата
		Возврат;
	КонецЕсли;
	
	Если ВложениеСБИС = ДобавляемоеВложение Тогда
		
		Возврат;
		
	КонецЕсли;
		
	ИмяФункции = "ОбъединитьВложенияСБИС"; 
	ИмяФормыФормата = "Файл_Шаблон";
	
	фрм = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки(ИмяФункции, ИмяФормыФормата);
	
	Если НЕ фрм = Неопределено Тогда
		фрм.ОбъединитьВложенияСБИС(ВложениеСБИС, ДобавляемоеВложение, ДопПараметры);
	Иначе
		фрм = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки(ИмяФункции, "Файл_Шаблон.ОбъединитьВложенияСБИС");
		фрм.ОбъединитьВложенияСБИС(ВложениеСБИС, ДобавляемоеВложение, ДопПараметры);
	КонецЕсли;

КонецПроцедуры

// Функция - Вложение СБИС выгрузить
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - структура вложения из СоставаПакета 
//  КлючВыгрузки - Структура	 - 
//  ДопПараметры - Структура	 - 
// 
// Возвращаемое значение:
// Массив - Строки табличной части документа 1С на загрузку/выгрузку
//
&НаКлиенте
Функция ВложениеСБИС_Выгрузить_ТабличнаяЧасть(ВложениеСБИС, ДопПараметры)
		
	ЛокальныйКэш		= ПолучитьТекущийЛокальныйКэш();
	СбисОбщиеФункции	= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	СтруктураДокумента	= ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
	
	Если    ЗначениеЗаполнено(СтруктураДокумента)
		И	СтруктураДокумента.Файл.Документ.Свойство("СписокСтрТабл") Тогда
		
		ПутьТаблДок = "Файл.Документ.СписокСтрТабл.СтрТабл";
		ПутьИтоги = "Файл.Документ.СписокСтрТабл.ИтогТабл"; 
		
	Иначе
		
		ПутьТаблДок = "Файл.Документ.ТаблДок.СтрТабл";
		ПутьИтоги = "Файл.Документ.ТаблДок.ИтогТабл"; 
		
	КонецЕсли;	
	
	Если ВложениеСБИС.Свойство("ТаблДок") Тогда
		
		ТабличнаяЧастьИзФайла = ВложениеСБИС.ТаблДок; // Рассчитывался при подготовке к загрузке
		
	ИначеЕсли ДопПараметры.Свойство("ПолучитьИтоги") И ДопПараметры.ПолучитьИтоги Тогда
		
		 ТабличнаяЧастьИзФайла = СбисОбщиеФункции.РассчитатьЗначениеИзСтруктуры(ПутьИтоги, СтруктураДокумента); 
		
	Иначе

		ТабличнаяЧастьИзФайла = СбисОбщиеФункции.РассчитатьЗначениеИзСтруктуры(ПутьТаблДок, СтруктураДокумента);
		
	КонецЕсли;
	
	Если НЕ (ВложениеСБИС.Свойство("КлассыСопоставленияНоменклатур") 
			И ЗначениеЗаполнено(ВложениеСБИС.КлассыСопоставленияНоменклатур)) Тогда
			
		Возврат ТабличнаяЧастьИзФайла;
		
	КонецЕсли;

	НаборСопоставленийНоменклатуры = Новый Структура("ТабличнаяЧасть, НаборСопоставлений", ТабличнаяЧастьИзФайла, ВложениеСБИС.КлассыСопоставленияНоменклатур);
	
	ПараметрыПоискаФорм = ВложениеСбис_Получить(ВложениеСБИС, "ПараметрыИни");
	НаборФорм = Новый Массив;
	
	ИмяФормыПоФормату = "Файл_"	+ СбисОбщиеФункции.СбисЗаменитьНедопустимыеСимволы(ПараметрыПоискаФорм.Тип)
	+ "_"	+ СбисОбщиеФункции.СбисЗаменитьНедопустимыеСимволы(ПараметрыПоискаФорм.Версия);
	
	НаборФорм.Добавить(ИмяФормыПоФормату);
	
	Если Не ПараметрыПоискаФорм.Версия = "3.01" Тогда
		НаборФорм.Добавить("Файл_Шаблон_" + СтрЗаменить(ПараметрыПоискаФорм.Версия, ".", "_"));
	КонецЕсли;
	
	НаборФорм.Добавить("Файл_Шаблон");
	
	МодульФормы = НайтиФункциюСеансаОбработки("СформироватьТабличнуюЧастьПоНаборуСопоставленийНоменклатуры", НаборФорм);
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	Если ПараметрыПоискаФорм.Направление = "Входящий" Тогда
		ДопПараметры.Вставить("СвернутьСтроки", Ложь);
	Иначе
		ДопПараметры.Вставить("СвернутьСтроки", Истина);
	КонецЕсли;
	
	Если НЕ ДопПараметры = Неопределено 
		И ДопПараметры.Свойство("НаправлениеСворачивания") Тогда
		НаправлениеСворачивания = ДопПараметры.НаправлениеСворачивания;
	Иначе
		НаправлениеСворачивания = "СБИС";
	КонецЕсли;
	
	ДопПараметры.Вставить("НаправлениеСворачивания", НаправлениеСворачивания);
	
	Если ВложениеСБИС.Параметры.Свойство("ФайлПерегенерируется") Тогда
		ДопПараметры.Вставить("ФайлПерегенерируется", ВложениеСБИС.Параметры.ФайлПерегенерируется);
	Иначе
		ДопПараметры.Вставить("ФайлПерегенерируется",Истина);
	КонецЕсли;
	
	ДопПараметры.Вставить("ВложениеСБИС", ВложениеСБИС); 
	
	ТабличнаяЧасть = МодульФормы.СформироватьТабличнуюЧастьПоНаборуСопоставленийНоменклатуры(НаборСопоставленийНоменклатуры, ДопПараметры);
	
	Возврат ТабличнаяЧасть;
	
КонецФункции

&НаКлиенте
Функция ВложениеСБИС_Выгрузить_ЗаписьНаБЛ(ВложениеСБИС, ДопПараметры)
	Перем ИдВложения, ПараметрыПодготовкиВложений, СбисШифрование;
	
	
	СоставПакета = ДопПараметры.СоставПакета;
	
	Если Не ДопПараметры.Свойство("ПараметрыПодготовки", ПараметрыПодготовкиВложений) Тогда
		
		ПараметрыПодготовкиВложений	= Новый Структура;
		
	КонецЕсли;
	
	Если Не ДопПараметры.Свойство("ИдентификаторВложения", ИдВложения) Тогда
		
		// Ид вложения указан явно. Может быть выбрано для перезаписи существующего вложения с определенным ИД
		Если НЕ (	ВложениеСБИС.Свойство("Идентификатор", ИдВложения)
				И	ЗначениеЗаполнено(ИдВложения)) Тогда
				
			ИдВложения = Строка(Новый УникальныйИдентификатор());
			
		КонецЕсли;
		
	КонецЕсли;
	
	СбисМодульИнтеграции = ПараметрSABY("Интеграция", "Сеанс");
	ВложениеСБИС.Вставить("Идентификатор", ИдВложения);

	file		= Новый Структура;
	attachment	= Новый Структура("Идентификатор, Файл", ИдВложения, file);
	
	СбисПараметрыВложения = Новый Структура("Файл, Вложение, ВложениеВПакет", file, ВложениеСБИС, attachment);

	ТипДанных = ВложениеСБИС_Получить(ВложениеСБИС, "ТипДанных");
	Если		ТипДанных = "ВнешнийФайл" Тогда // внешний файл добавлен в пакет

		// Временный костыль с перекладыванием свойств файла
		ВложениеСБИС.Вставить("ПолноеИмяФайла",	ВложениеСБИС_Получить(ВложениеСБИС, "ПолноеИмяФайла"));
		ВложениеСБИС.Вставить("ИмяФайла",		ВложениеСБИС_Получить(ВложениеСБИС, "ИмяФайла"));
		file.Вставить("Имя", ВложениеСБИС.ИмяФайла);
		СбисМодульИнтеграции.Отправка_ОбработатьВнешнийФайл(ГлавноеОкно.Кэш, СбисПараметрыВложения, ПараметрыПодготовкиВложений);

	ИначеЕсли	ТипЗнч(ВложениеСБИС.XMLДокумента) = Тип("Соответствие") Тогда
		
		file.Вставить("Подстановка", ВложениеСБИС.XMLДокумента);
		
	Иначе  // сформирован xml
		
		ИмяФайла = ВложениеСБИС.СтруктураФайла.Файл.Имя + ".xml";
		file.Вставить("Имя", ИмяФайла);
		СбисМодульИнтеграции.Отправка_ОбработатьXMLФайл(ГлавноеОкно.Кэш, СбисПараметрыВложения, ПараметрыПодготовкиВложений);
		
	КонецЕсли;

	Если ВложениеСБИС.Свойство("Подпись") Тогда
		
		ЭЦП = Новый Массив;
		Для Каждого Запись из ВложениеСБИС.Подпись Цикл
			
			ЗаписьЭЦП = Новый Структура;
			Если Запись.Свойство("Направление") Тогда
				ЗаписьЭЦП.Вставить("Направление",Запись.Направление);
			КонецЕсли;
			ФайлЭЦП = Новый Структура;
			ФайлЭЦП.Вставить( "Имя", Запись.Файл.Имя ); 
			ФайлЭЦП.Вставить( "ДвоичныеДанные", ПолучитьBASE64ПоИмениФайлаКлиент(Запись.Файл.ПолноеИмяФайла)); 
			ЗаписьЭЦП.Вставить("Файл",ФайлЭЦП);
			ЭЦП.Добавить(ЗаписьЭЦП);
			
		КонецЦикла;
		attachment.Вставить("Подпись", ЭЦП);
		
	КонецЕсли;
	
	Если		ВложениеСБИС_Получить(ВложениеСБИС, "Зашифрован") Тогда
		
		// Вложение уже зашифровано. Просто прокинуть признак, никаких дополнительных действие не делается.
		attachment.Вставить("Зашифрован", "Да");

	ИначеЕсли	ВложениеСБИС_Получить(ВложениеСБИС, "Зашировать") Тогда
		
		// Вложение нужно зашифровать.
		attachment.Вставить("Шифрование", "Да");
		
		Если	ВложениеСБИС.Свойство("Тип")
			И	ВложениеСБИС.Свойство("ПодТип")
			И	ВложениеСБИС.Свойство("ВерсияФормата")
			И	ЗначениеЗаполнено(ВложениеСБИС.Тип)
			И	ЗначениеЗаполнено(ВложениеСБИС.ВерсияФормата) Тогда
			attachment.Вставить( "Тип",  ВложениеСБИС.Тип);
			attachment.Вставить( "Подтип",  ВложениеСБИС.ПодТип);
			attachment.Вставить( "ВерсияФормата",  ВложениеСБИС.ВерсияФормата);
			Если	ВложениеСБИС.Свойство("ПодВерсияФормата")
				И	ЗначениеЗаполнено(ВложениеСБИС.ПодВерсияФормата) Тогда
				attachment.Вставить( "ПодверсияФормата",  ВложениеСБИС.ПодВерсияФормата);
			КонецЕсли;
		КонецЕсли;
		
		Если	ВложениеСБИС.Свойство("Название")
			И	ЗначениеЗаполнено(ВложениеСБИС.Название) Тогда
			// для зашифрованных документов убираем сумму из названия
			ПозСуммы = Найти(ВложениеСБИС.Название, "на сумму");
			Если ПозСуммы Тогда
				ВложениеСБИС.Название = Лев(ВложениеСБИС.Название, ПозСуммы-1);
			КонецЕсли;
			attachment.Вставить("Название",  ВложениеСБИС.Название);
		КонецЕсли;
		
	Иначе
		
		attachment.Вставить("Шифрование", "Нет");
		
	КонецЕсли;
	
	Возврат attachment;
	
КонецФункции

// Функция - формирует Струкутру данных объекта по инишке
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - экземпляр вложения сбис
//  ДопПараметры - Структура	 - Расширение. СоставПакета - Экземпляр СоставПакета
// 
// Возвращаемое значение:
//  Структура - Договор, Дата, Контрагент
//
&НаКлиенте
Функция ВложениеСБИС_РассчитанныйОбъект(ВложениеСБИС, ДопПараметры)
	Перем ЗначениеВставить, РежимОпределенияОбъекта, СтруктураДокОбъект;
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;

	Если ВложениеСБИС.Параметры.Свойство("РассчитанныйОбъект", СтруктураДокОбъект) Тогда
		
		// Если есть рассчитанный объект, то он всегда более полный, чем базовые поля (они включаются туда)
		Возврат СтруктураДокОбъект;
		
	ИначеЕсли  	ДопПараметры.Свойство("Режим", РежимОпределенияОбъекта)		
			И	(	РежимОпределенияОбъекта = "Основание"
				Или	РежимОпределенияОбъекта = "Документ"  
				Или	РежимОпределенияОбъекта = "Фильтр") Тогда
			
		Если ВложениеСБИС.Параметры.Свойство("БазовыеПоляОбъекта", СтруктураДокОбъект) Тогда 
			
			Возврат СтруктураДокОбъект;
			
		КонецЕсли;
		
		// Попали в режим поиска основания, или документа, но при этом расчитанного объекта еще нет
		ЭтоПолныйРасчет = Ложь;
		
	Иначе
		
		ЭтоПолныйРасчет = Истина;

	КонецЕсли;
	
	СтатусВложения		= ВложениеСБИС_Получить(ВложениеСБИС, "Статус");
	СтруктураИниФайла	= ВложениеСБИС_Получить(ВложениеСБИС, "УстановленныйПодразделИни");
	Если	СтатусВложения = "Ошибка"
		Или	СтруктураИниФайла = Неопределено Тогда
		
		Возврат Новый Структура;
		
	КонецЕсли;
	

	Если Не ЭтоПолныйРасчет Тогда
		
		// Получим поля для поиска по шаблону узлов "Документ_", чтобы не считать лишнего
		ОписаниеОбъекта			= Новый Структура("Ключ, Значение, Ини", "Документ", ВложениеСБИС.СтруктураФайла, СтруктураИниФайла);
		ДопПараметрыЗаполнить	= Новый Структура("Вложение, СоставПакета", ВложениеСБИС, ДопПараметры.СоставПакета);
		СтруктураДокОбъект		= ЗаполнитьСтруктуруОбъектаПоИни(ОписаниеОбъекта, ДопПараметрыЗаполнить);
		
	ИначеЕсли		ВложениеСБИС.Параметры.РедактироватьДокумент
			И	Не	РежимОпределенияОбъекта = "Разбор" Тогда
		
		ДокументДляРедактирования = ВложениеСБИС_Получить(ВложениеСБИС, "ПодходящийДокумент", ДопПараметры);
		
		Если ДокументДляРедактирования = Неопределено Тогда
			
			Возврат Новый Структура;
			
		КонецЕсли;
		
		СтруктураДокОбъект = ПолучитьДанныеОбъекта1С(ДокументДляРедактирования);
		
	Иначе
		
		СтруктураДокОбъект			= Новый Структура; // Структура с названиями полей, как у создаваемого документа 1С
		ПараметрыДляРасчетаОбъекта	= Новый Структура("Режим", "Подготовка");
		СбисОбщиеФункции			= ПолучитьЗначениеПараметраСбис("ФункцииДокументов");
		СтруктураДанныхДокумента	= СбисОбщиеФункции.СкопироватьОбъектСПараметрамиКлиент(СтруктураИниФайла);
		
		ПараметрыПолучить	= Новый ФиксированнаяСтруктура("СоставПакета, ТипКратко", ДопПараметры.СоставПакета, Истина);
		ТипДокумента		= ВложениеСБИС_Получить(ВложениеСБИС, "ТипОбъекта", ПараметрыПолучить);
		
		ВложениеСБИС.Удалить("ВходящийКонтекст");
		ВложениеСБИС_ЗаполнитьПараметрыПередРасчетом(ВложениеСБИС, ДопПараметры);
	
		НаборФорм = Новый Массив;
		НаборФорм.Добавить("Документ_" + ТипДокумента);
		НаборФорм.Добавить("Документ_Шаблон");
		
		фрм = НайтиФункциюСеансаОбработки("ЗаполнитьДаннымиСтруктурыФайлаСтруктуруДокумента", НаборФорм);
		фрм.ЗаполнитьДаннымиСтруктурыФайлаСтруктуруДокумента(	ПолучитьТекущийЛокальныйКэш()
															,	ВложениеСБИС.СтруктураФайла
															,	СтруктураДанныхДокумента
															,	СтруктураДокОбъект
															,	Новый Массив
															,	ДопПараметры.СоставПакета
															,	ВложениеСБИС
															,	ПараметрыДляРасчетаОбъекта);
		
	КонецЕсли;
	
	Если ЭтоПолныйРасчет Тогда
		
		ВложениеСБИС.Параметры.Вставить("РассчитанныйОбъект", СтруктураДокОбъект);
		
	Иначе
		
		ВложениеСБИС.Параметры.Вставить("БазовыеПоляОбъекта", СтруктураДокОбъект);
		
	КонецЕсли;
	
	Возврат СтруктураДокОбъект;

КонецФункции

// Процедура - Заполняет ВложениеСБИС для открытия на форме просмотра
//
// Параметры:
//  ВложениеСБИС - 	 - 
//  ДопПараметры - 	 - 
//
&НаКлиенте
Процедура ВложениеСБИС_РазобратьДляПросмотра(ВложениеСБИС, ДопПараметры) Экспорт
	
	ПараметрыДляПросмотра = Новый Структура;
	
	ВложениеСБИС.Параметры.Вставить("ФормаПросмотрДокумента", ПараметрыДляПросмотра);
	
	Поля1С				= ВложениеСБИС_Получить(ВложениеСБИС, "Поля1С", ДопПараметры);
	ПараметрыВложения	= ВложениеСБИС_Получить(ВложениеСБИС, "Параметры");
	НастройкиИни		= ПараметрSABY("НастройкиИни", "Технический");
	СтруктураИниФайла	= ВложениеСБИС_Получить(ВложениеСБИС, "УстановленныйПодразделИни");
	
	РазделСохранен	= НЕ НастройкиИни = Неопределено
					И	НастройкиИни.Свойство("Загрузка")
					И	НастройкиИни.Загрузка.Свойство(ВложениеСБИС.ИмяИни);
					
	ДоступнаДата1С = (Не ЗначениеЗаполнено(Поля1С.Документ.Значение) 
	 				  И СтруктураИниФайла.Свойство("Документ_Дата"))
					  ИЛИ ЗначениеЗаполнено(ПараметрыВложения.РедактируемыеПоля.Дата.Значение);

	ПараметрыКарточки	= Новый Структура("ПоказатьСозданиеКарточки",		Поля1С.Контрагент.Доступность
																	И Не	ЗначениеЗаполнено(Поля1С.Контрагент.Значение));
	ПараметрыПрочиеПоля	= Новый Структура("ДоступнаДата1С, РазделСохранен", ДоступнаДата1С, РазделСохранен);																		
	
	
	ПараметрыДляПросмотра.Вставить("ПараметрыКонтрагент",	ПараметрыКарточки);
	ПараметрыДляПросмотра.Вставить("ПараметрыПрочихПолей",			ПараметрыПрочиеПоля);
	
КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_Заполнить_ПоВложениеСБИС(ВложениеСБИС, ДанныеЗаполнить) 
	Перем Документы1СВложения, ПараметрЗашифрован;
	
	ЗаполнитьЗначенияСвойств(ВложениеСБИС, ДанныеЗаполнить);
	
	Если		ВложениеСБИС.Документы1С.Количество() Тогда
		
		//Создать копию списка оснований, чтобы разорвать связь со старым классом
		Документы1СВложенияКопия = Новый СписокЗначений;
		Документы1СВложенияКопия.ЗагрузитьЗначения(ВложениеСБИС.Документы1С.ВыгрузитьЗначения());
		ВложениеСБИС.Документы1С = Документы1СВложенияКопия;
		
	ИначеЕсли	ДанныеЗаполнить.Свойство("Документ1С") Тогда
		
		ВложениеСБИС_Заполнить(ВложениеСБИС, ДанныеЗаполнить.Документ1С, "Документ1С")
		
	КонецЕсли;
		
	//Необязательные поля
	Если	ДанныеЗаполнить.Свойство("ТребуетПодписания") Тогда
		
		ВложениеСБИС.Вставить("ТребуетПодписания", ДанныеЗаполнить.ТребуетПодписания);
		
	КонецЕсли; 
	
	//Необязательные поля
	Если	ДанныеЗаполнить.Свойство("ТребуетсяПриложить") Тогда
		
		ВложениеСБИС.Вставить("ТребуетсяПриложить", ДанныеЗаполнить.ТребуетсяПриложить);
		
	КонецЕсли; 
	
	Если	ДанныеЗаполнить.Свойство("Параметры") Тогда
		
		ВложениеСБИС.Параметры.ИспользоватьГенератор = ДанныеЗаполнить.Параметры.ИспользоватьГенератор = Истина;
		
	КонецЕсли;
	
	Если	ДанныеЗаполнить.Свойство("НоменклатураКодКонтрагента") Тогда
		
		ВложениеСБИС.Вставить("НоменклатураКодКонтрагента", ДанныеЗаполнить.НоменклатураКодКонтрагента);
		
	КонецЕсли;
	
	Если	ДанныеЗаполнить.Свойство("ДопПоля") Тогда
		
		ВложениеСБИС.Вставить("ДопПоля", ДанныеЗаполнить.ДопПоля);
		
	КонецЕсли;
	
	Если	ДанныеЗаполнить.Свойство("Провести") Тогда
		
		ВложениеСБИС.Вставить("Провести", ДанныеЗаполнить.Провести);
		
	КонецЕсли;
	
	Если	ДанныеЗаполнить.Свойство("Зашифрован", ПараметрЗашифрован) Тогда
		
		БулевоПривести = Новый ОписаниеТипов("Булево");
		ПараметрЗашифрован = БулевоПривести.ПривестиЗначение(ПараметрЗашифрован);
		
	Иначе
		
		ПараметрЗашифрован = Ложь;
		
	КонецЕсли;
	
	Если ДанныеЗаполнить.Свойство("ПолноеИмяФайла") Тогда
		
		яВложениеСБИС_Заполнить_Файл(ВложениеСБИС, ДанныеЗаполнить);
		
	КонецЕсли;
	
	ВложениеСБИС.Вставить("Зашифрован", ПараметрЗашифрован);
				
КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_ЗаписатьСостояниеЭД(Документ1С, СоставПакета, ВложениеСБИС)
	
	Кэш	= ПолучитьТекущийЛокальныйКэш();   
	
	Если ПолучитьЗначениеПараметраСбис("СостояниеЭД") Тогда
													   
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("ИмяФункции",	"ДублироватьСостояние");
		ПараметрыПоиска.Вставить("КлючФорм",	"Статусы_СостоянияЭД");
		ФормаЭД = Кэш.ОбщиеФункции.сбисНайтиФормуФункцииПодсистемы(Кэш, ПараметрыПоиска); 
		
		Если Не ФормаЭД = Ложь Тогда
			СтруктураФайла = ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
			ФормаЭД.ДублироватьСостояние(СоставПакета, Документ1С, ВложениеСБИС.XMLДокумента, СтруктураФайла);
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВложениеСБИС_ПодходящийДокумент(ВложениеСбис, ДопПараметры)
	Перем РежимПодбора, РежимПоиска;
	
	Если Не ДопПараметры.Свойство("Режим", РежимПодбора) Тогда
		
		РежимПодбора = "Документ";
		
	КонецЕсли;
	
	Если	РежимПодбора = "Документ"
		Или	РежимПодбора = "Разбор" Тогда
		
		Если ДопПараметры.Свойство("ПодходящийДокумент") Тогда
			
			// Не надо выполнять подбор, есть документ.
			Возврат ДопПараметры.ПодходящийДокумент;
			
		КонецЕсли;
		
		ПараметрыПросмотр = Неопределено;
		Если		ВложениеСбис.Параметры.Свойство("РедактируемыеПоля", ПараметрыПросмотр)
			И	Не	ПараметрыПросмотр = Неопределено
			И	Не	ПараметрыПросмотр.Документ = Неопределено
			И	Не	ПараметрыПросмотр.Документ.Значение = Неопределено Тогда
			
			// При пустой ссылке
			// Есть определенный вручную документ
			Возврат ПараметрыПросмотр.Документ.Значение;
			
		КонецЕсли;
		
		Если	ВложениеСбис.Параметры.ВозможноРедактироватьДокумент
			И	РежимПодбора = "Разбор" Тогда
			
			//Получить документ через узел Документ, если описан поиск ссылки, а не тип
			Документ_Модуль		= ПолучитьФормуОбработки("Документ_Шаблон");
			ЛокальныйКэш		= ПолучитьТекущийЛокальныйКэш();
			
			КонтекстДляРассчитать	= Новый Структура("Переменные, Документ, Ини, Вложение, СоставПакета", Новый Структура, Новый Структура);
			КонтекстДляРассчитать.Ини			= ВложениеСБИС_Получить(ВложениеСбис, "УстановленныйПодразделИни");
			КонтекстДляРассчитать.Вложение		= ВложениеСБИС;
			КонтекстДляРассчитать.СоставПакета	= ДопПараметры.СоставПакета;
			
			ИмяУзляРасчетаТипа	= "Документ";
			ЗначениеУзлаРасчета	= Неопределено;
			
			ЗначениеДокумент = Документ_Модуль.РассчитатьПараметрИни(ЛокальныйКэш, ИмяУзляРасчетаТипа, ЗначениеУзлаРасчета, КонтекстДляРассчитать, Новый Структура("ВызовСервера", Истина));
			Если		ЗначениеЗаполнено(ЗначениеДокумент)
				И	Не	ТипЗнч(ЗначениеДокумент) = Тип("Строка") Тогда
				
				Возврат ЗначениеДокумент;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка
		
		ДокументыПодходят = ВложениеСБИС_НайтиПодходящиеДокументы(ВложениеСбис, ДопПараметры);
		Если ДокументыПодходят.Количество() Тогда
			
			Возврат ДокументыПодходят[0];
			
		КонецЕсли;
		
	Исключение
		
		ОшибкаПоиска = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ВложениеСБИС_ПодходящийДокумент");
		// Может быть ошибка поиска документа, нет узлов для подбора. Игнорировать.
		Если Не ОшибкаПоиска.code = 760 Тогда
			
			ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаПоиска);
			
		КонецЕсли;
		
	КонецПопытки;
		
	//Проверить подходящий документ на пакете.
	ДопПараметры.Свойство("Режим", РежимПоиска);
	ПараметрыПоиска = Новый Структура("ВложениеСБИС, Режим", ВложениеСБИС, РежимПоиска);
	Если ДопПараметры.Свойство("ТекущийУзелИни") Тогда
		
		ПараметрыПоиска.Вставить("УзелИни", ДопПараметры.ТекущийУзелИни);
		
	КонецЕсли;
	
	Возврат СоставПакета_Получить(ДопПараметры.СоставПакета, "ДокументДляВложения", ПараметрыПоиска);
		
КонецФункции

&НаКлиенте
Процедура ПодготовитьСоответствиеРасхожденияДокумент1С_Вложение(Вложение, Документ1ССсылка, СоответствиеДокументДанные)
	
	ВходящийКонтекстРасчета = Новый Структура;
	мФайлДляРасчета = Найти_мФайлПоВложению(Вложение, Документ1ССсылка);                
	
	Если мФайлДляРасчета <> Неопределено Тогда
		СравнениеНеНужно = ГлавноеОкно.Кэш.Общиефункции.РассчитатьЗначение("СравнениеДокументаНеПоддерживается",мФайлДляРасчета.Значение);
		Если СравнениеНеНужно = Истина Тогда
			ИмяДокумента = ГлавноеОкно.Кэш.Общиефункции.РассчитатьЗначение("Документ", мФайлДляРасчета.Значение);
			ВызватьСбисИсключение("Операция сравнения не поддерживается для документов типа: " + ИмяДокумента, "МодульОбъектаКлиент.ПолучитьСтруктуруДокумента1СПоПакетуСбис");
			
			Возврат;
			
		КонецЕсли;		
	КонецЕсли;
	
	ЗначениеИниДокумента = Новый Структура;
	ЗначениеИниДокумента.Вставить("мФайл",											Новый Структура(мФайлДляРасчета.Ключ, мФайлДляРасчета.Значение));
	//ЗначениеИниДокумента.Вставить("Формат2019",										Новый Структура("Значение,РассчитанноеЗначение", Истина, Истина));
	//ЗначениеИниДокумента.Вставить("ФорматУКД2020",									Новый Структура("Значение,РассчитанноеЗначение", Истина, Истина));
	//ЗначениеИниДокумента.Вставить("ВходящийКонтекст",								Новый Структура("Значение,РассчитанноеЗначение", "", ВходящийКонтекстРасчета));
	//ЗначениеИниДокумента.Вставить("ИспользоватьШтрихкодыНоменклатурыКонтрагентов",	Новый Структура("Значение,РассчитанноеЗначение", ГлобальныйКэш.Парам.ИспользоватьШтрихкодыНоменклатурыКонтрагентов, ГлобальныйКэш.Парам.ИспользоватьШтрихкодыНоменклатурыКонтрагентов));
	
	ИниДокумента = СтрПолучитьСтроку(СтрЗаменить(ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.ПолучитьИмяИСПоСсылке(Документ1ССсылка), ".", Символы.ПС), 2);
	ИдентификаторДокумента = СбисИдентификаторДокумента1С(Документ1ССсылка, ИниДокумента);
	СоответствиеДокументДанные.Вставить(ИдентификаторДокумента, Новый Структура("ИмяИни, ДокументДанные",ИниДокумента,ЗначениеИниДокумента)); 	

КонецПроцедуры
	
// Функция - определяет сторону по указанной роли.
//
// Параметры:
//  ВложениеСБИС	 - ВложениеСБИС		 - структура с данными сторон
//  ПараметрыРоли	 - Строка/Структура	 - роль, которую надо извлечь
// 
// Возвращаемое значение:
//  класс сторона - структура для роли документооборота
//
&НаКлиенте
Функция ВложениеСБИС_СторонаПоРоли(ВложениеСБИС, ПараметрыРоли)
	Перем КлючРоли;

	Если ТипЗнч(ПараметрыРоли) = Тип("Строка") Тогда
		
		КлючРоли = ПараметрыРоли;
		
	ИначеЕсли Не ПараметрыРоли.Свойство("КлючРоли", КлючРоли) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Если КлючРоли = "СопоставлениеНоменклатуры" Тогда
		
		Возврат ВложениеСБИС_СторонаПоРоли_СопоставлениеНоменклатуры(ВложениеСБИС, ПараметрыРоли);
		
	Иначе

		Возврат ВложениеСБИС_СторонаПоРоли_Документооборот(ВложениеСБИС, ПараметрыРоли);

	КонецЕсли;
	
КонецФункции

// Функция - определяет документы по текущему типу. Делает поиск при отсутствии подходящих документов на вложении
//
// Параметры:
//  ВложениеСБИС - Структура	- класс вложение СБИС
//  ДопПараметры - Структура	- перекрывает ключи из Вложения:
//		СоставПакета		- Структура, состав пакета. Обязателен если нет явно определенных сторон Организация 1С и Контрагент 1С
//		ТипДокумента		- Строка, описание документа, который ищется
//		ВсеПодходящие		- Булево (Ложь) (Н) - продолжить поиск даже если на вложении есть уже подходящий документ
//		СтруктураИниФайла	- Установленный раздел ини (Н) - (возьмется от вложения)Раздел ини мДокумент для определения реквизитов и организации запроса
//		Контрагент1С		- Ссылка на сторону контрагента (партнера) 1С в явном виде (Н) - 
//		Организация1С		- Ссылка на сторону организации 1С в явном виде (Н) - 
//		КонтрагентСБИС		- Класс Сторона (Н) - с описанием первичный и вспомогательных ключей стороны
//		ОрганизацияСБИС		- Класс Сторона (Н) - с описанием первичный и вспомогательных ключей стороны
//		Режим				- Строка (Н)("Документ") - определяет режим поиска документа:
//			"Разбор" поиск при разборе документа зависит от опций
//			"Документ" поиск по-умолчанию
//			"ВозможныеДокументы" - поиск всех возможных типов по ини, без привязки к разделу.
// 
// Возвращаемое значение:
//  класс сторона - структура для роли документооборота
//
&НаКлиенте
Функция ВложениеСБИС_НайтиПодходящиеДокументы(ВложениеСБИС, ДопПараметры) Экспорт
	Перем	СоставПакета, ИмяРеквизитаРасчет, ИмяРеквизитаРасчетВспом,
			ЗначениеДата, ЗначениеДатаВх, ЗначениеНомер, ЗначениеНомерВх, РежимПоискаДокумента;
			
	Если Не ДопПараметры.Свойство("Режим", РежимПоискаДокумента) Тогда
		
		РежимПоискаДокумента = "Документ"
		
	КонецЕсли;
	
	Если	РежимПоискаДокумента = "Документ"
		Или	РежимПоискаДокумента = "Разбор" Тогда
		
		СсылкиПоТипу = ВложениеСБИС_НайтиПодходящиеДокументы_ПроверитьПоТипу(ВложениеСБИС, ДопПараметры);
		
		Если ЗначениеЗаполнено(СсылкиПоТипу) Тогда
			
			Возврат СсылкиПоТипу;
			
		КонецЕсли;
		
		// Искать документ при разборе, или поиске документа, при активных опциях:
		// ПодборДокументаДляЗаполнения - опция не отключена, либо вынесен в ини и посчитан как Истина
		// ВозможноРедактироватьДокумент/РедактироватьТабЧасть - загрузка редактирует документ, либо таб.часть.
		ИскатьДокументыДальше = ВложениеСБИС.Параметры.ПодборДокументаДляЗаполнения
							Или	ВложениеСБИС.Параметры.ВозможноРедактироватьДокумент
							Или ВложениеСБИС.Параметры.РедактироватьТабЧасть
		
	Иначе
		
		// Во всех прочих режимах, ищем по ключам
		ИскатьДокументыДальше = Истина;
		
	КонецЕсли;

	Результат = Новый Массив;		
	Если Не ИскатьДокументыДальше Тогда
		
		Возврат Результат;
		
	КонецЕсли;		
	
	ПараметрыЗаполнить = ВложениеСБИС_НайтиПодходящиеДокументы_ОсновныеПоляФильтра(ВложениеСБИС, ДопПараметры);
	Если	РежимПоискаДокумента = "ВозможныеДокументы" Тогда
		
		ИниДокумента = ИниПоПараметрам(Новый Структура("Вложение", ВложениеСБИС));
		
		Для Каждого РазделМДокумент Из ИниДокумента.мДокумент Цикл
			
			ПараметрыЗаполнить.УзелИни = РазделМДокумент.Значение;
			НайтиПодходящиеДокументы_ЗаполнитьФильтры(ПараметрыЗаполнить);
						
		КонецЦикла;
		
	Иначе	
		
		ПараметрыЗаполнить.УзелИни	 = ВложениеСБИС_Получить(ВложениеСБИС, "УстановленныйПодразделИни");
		Если ДопПараметры.Свойство("ТипДокумента") Тогда
			
			ПараметрыЗаполнить.Вставить("Тип", ДопПараметры.ТипДокумента);
			
		КонецЕсли;
		
		НайтиПодходящиеДокументы_ЗаполнитьФильтры(ПараметрыЗаполнить);
		
	КонецЕсли;
		
	Попытка
		
		РезультатПоиска = ОписаниеЗапроса_ВыполнитьЗапросСервер(ПараметрыЗаполнить.ОписаниеЗапроса, Новый ФиксированнаяСтруктура);
		
	Исключение
		
		ВызватьСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ВложениеСБИС_НайтиПодходящиеДокументы");
		
	КонецПопытки;

	Для Каждого ЭлементНайден Из РезультатПоиска Цикл
		
		Если		ЭлементНайден.Свойство("ОбъектСсылка") Тогда
			
			Результат.Добавить(ЭлементНайден.ОбъектСсылка);
			
		ИначеЕсли   ЭлементНайден.Свойство("Ссылка") Тогда
			
			Результат.Добавить(ЭлементНайден.Ссылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция  ОписаниеЗапроса_ВыполнитьЗапросСервер(Знач ОписаниеЗапроса, Знач ДопПараметры = Неопределено)
	
	ТекстЗапроса = ОписаниеЗапроса.Текст;
	Для Каждого ЭлементФормат Из ОписаниеЗапроса.Формат Цикл
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{" + ЭлементФормат.Ключ + "}", ЭлементФормат.Значение);
		
	КонецЦикла;
	
	Если ДопПараметры = Неопределено Тогда
		
		ДопПараметрыВызова = Новый Структура("Размер", 1);
		
	Иначе
		
		ДопПараметрыВызова = ДопПараметры;
		
	КонецЕсли;
	
	Попытка
		
		Возврат МодульОбъектаСервер().ВыполнитьЗапросСПараметрами(ТекстЗапроса, ОписаниеЗапроса.Параметры, ДопПараметрыВызова);
		
	Исключение
		
		ВызватьИсключение(МодульОбъектаСервер().СбисИсключение_ВСтроку(ИнформацияОбОшибке(), "МодульОбъектаСервер.ВыполнитьЗапросСПараметрами")); 
		
	КонецПопытки;
	
КонецФункции

// Функция - получить данные приложенного файла вложения СБИС.
//
// Параметры:
//  ВложениеСБИС	 - ВложениеСБИС					 - (О) экземпляр класса
//  ДопПараметры	 - Неопределено/Строка/Структура - (О) расширение
//		РежимЧтенияДанных: Строка (xml). Ключ чтения данных файла. По-умолчанию считается как XML. Варианты: xml, ссылканафайл
// 
// Возвращаемое значение:
//  Строка - ссылка на диске на полученный файл, либо его данные
//
&НаКлиенте
Функция яВложениеСБИС_ДанныеФайла(ВложениеСБИС, ДопПараметры) 
	Перем ДанныеФайлаРезультат, СсылкаНаДиске;
	
	ИнтеграцияМодуль	= ПолучитьЗначениеПараметраСбис("Интеграция");
	ФайлЗначение		= ВложениеСБИС_Получить(ВложениеСБИС, "Файл");
	
	РежимЧтенияДанных	= "xml";
	Если Не ДопПараметры = Неопределено Тогда
		
		Если ТипЗнч(ДопПараметры) = Тип("Строка") Тогда
			
			РежимЧтенияДанных = НРег(ДопПараметры)
			
		Иначе
			
			ДопПараметры.Свойство("РежимЧтения", РежимЧтенияДанных);
			РежимЧтенияДанных = НРег(РежимЧтенияДанных);
			
		КонецЕсли;
		
	КонецЕсли;
		
	Попытка
		
		ОбработкаПослеЧтения = Ложь;
		Если ВложениеСБИС_Получить(ВложениеСБИС, "Зашифрован") Тогда
			
			// Зашифрованное вложение. Скачать и расшифровать.
			ДанныеФайлаРезультат = яВложениеСБИС_ДанныеФайла_Зашифрован(ВложениеСБИС);
				
		ИначеЕсли   Не	ФайлЗначение = Неопределено
				И		ФайлЗначение.Свойство("СсылкаНаФайл", ДанныеФайлаРезультат) Тогда
				
			// Указана существующая ссылка на файл. Если файл надо прочитать, то его нужно обработать после чтения
			ОбработкаПослеЧтения = Истина;
			
		Иначе
			
			ТипВложения = ВложениеСБИС_Получить(ВложениеСБИС, "ТипДанных");
			Если ТипВложения = "ВнешнийФайл" Тогда
				
				ДанныеФайлаРезультат = ВложениеСБИС_Получить(ВложениеСБИС, "ПолноеИмяФайла"); 
				
			ИначеЕсли ФайлЗначение = Неопределено Тогда
				
				ОшибкаПриложения = НовыйСбисИсключение(,
					МодульОбъектаКлиентСервер_Представление() + "ВложениеСБИС.ДанныеФайла",
					679,
					,
					"Отсутствуют данные файла у вложения """ + ВложениеСБИС_Получить(ВложениеСБИС, "Название") + """.");
				ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаПриложения);
				
			Иначе
			
				ПараметрыЗаписи = Новый Структура;
				Если ФайлЗначение.Свойство("Имя") Тогда
					
					ПараметрыЗаписи.Вставить("ИмяФайла", ФайлЗначение.Имя);
					
				КонецЕсли;

				ДанныеФайлаРезультат = СкачатьВФайлПоПараметрам(ФайлЗначение.Ссылка, ПараметрыЗаписи);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если РежимЧтенияДанных = "xml" Тогда
			
			ДанныеФайлаРезультат = ПрочитатьФайлКлиент(ДанныеФайлаРезультат, Новый ФиксированнаяСтруктура("Расширение", "xml"));
			Если ОбработкаПослеЧтения Тогда
				
				ДанныеФайлаРезультат = ИнтеграцияМодуль.ПолучитьДанныеФайла_ОбработкаПослеЧтения(ФайлЗначение, ДанныеФайлаРезультат);
				
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		
		ДампОшибки = Новый Структура("ФайлЗначение", ФайлЗначение);
		ОшибкаЗаписиДанных = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.яВложениеСБИС_ДанныеФайла",,,, ДампОшибки);
		ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаЗаписиДанных);
		
	КонецПопытки;
	
	Возврат ДанныеФайлаРезультат;
		
КонецФункции

&НаКлиенте
Функция яВложениеСБИС_ДанныеФайла_Зашифрован(ВложениеСБИС)
	Перем ДвоичныеДанныеBase64, СтрокаРезультат;
	
	ИнтеграцияМодуль	= ПолучитьЗначениеПараметраСбис("Интеграция");
	ФайлЗначение		= ВложениеСБИС_Получить(ВложениеСБИС, "Файл");
	
	Попытка
		
		Если Не ФайлЗначение.Свойство("ДвоичныеДанные", ДвоичныеДанныеBase64) Тогда
			
			ИмяФайла = СкачатьВФайлПоПараметрам(ФайлЗначение.Ссылка);
			
			ДД_Файла		= Новый ДвоичныеДанные(ИмяФайла);
			СтрокаBase64	= СтрЗаменить(СтрЗаменить(Base64Строка(ДД_Файла), Символы.ПС, ""), Символы.ВК, "");

			Отказ					= Ложь;
			ПараметрыЗапроса		= Новый Структура("encrypted_data", СтрокаBase64);
			ДопПараметрыЗапроса		= Новый Структура("СообщатьПриОшибке, ВернутьОшибку, ЕстьРезультат", Ложь, Истина, Истина);
			ДвоичныеДанныеBase64	= ИнтеграцияМодуль.СБИС_РасшифроватьФайл(ПолучитьТекущийЛокальныйКэш(), ПараметрыЗапроса, ДопПараметрыЗапроса, Отказ);
			
			Если Отказ Тогда
				
				ИнтеграцияИмя		= ПолучитьЗначениеПараметраСБИС("ИнтеграцияИмя");
				ОшибкаРасшифровки	= НовыйСбисИсключение(773, ИнтеграцияИмя + ".СБИС_РасшифроватьФайл");
				ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаРасшифровки);
				
			КонецЕсли;

			ФайлЗначение.Вставить("ДвоичныеДанные", ДвоичныеДанныеBase64);
			
		КонецЕсли;
		
		Если ФайлЗначение.Свойство("Имя") Тогда
			
			ИмяВремФайла = НовыйВременныйФайлКлиент(ФайлЗначение.Имя,,, Истина);
			
		Иначе
			
			// Имени файла нет, создать дефолтный XML
			ИмяВремФайла = НовыйВременныйФайлКлиент(, "xml");
			
		КонецЕсли;
		
		ДвоичныеДанныеФайла	= Base64Значение(ДвоичныеДанныеBase64);
		ДвоичныеДанныеФайла.Записать(ИмяВремФайла);
		
	Исключение
		
		ОшибкаРасшифровки	= НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.яВложениеСБИС_ДанныеФайла_Зашифрован");
		ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаРасшифровки);
		
	КонецПопытки;
		
	Возврат ИмяВремФайла;
	
КонецФункции

&НаКлиенте
Процедура яВложениеСБИС_Открыть_Приложение(ВложениеСБИС)
	Перем ФайлЗначение, ФайлИмя;
	
	ПолноеИмяФайла	= ВложениеСБИС_Получить(ВложениеСБИС, "ДанныеФайла", "СсылкаНаКаталог");
	
	Если ПолноеИмяФайла = Неопределено Тогда
		
		ОшибкаПриложения = НовыйСбисИсключение(,
			МодульОбъектаКлиентСервер_Представление() + "ВложениеСБИС.Открыть",
			678010,
			"Невозможно открыть файл во внешней программе.",
			"Невозможно открыть файл во внешней программе.");
		ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаПриложения);
		
	КонецЕсли;	
	
	Попытка

		ЗапуститьПриложение(ПолноеИмяФайла);
		
	Исключение
		
		ОшибкаПриложения = НовыйСбисИсключение(
			ИнформацияОбОшибке(),
			МодульОбъектаКлиентСервер_Представление() + "ВложениеСБИС.Открыть",
			678010,
			,
			"Не удалось открыть файл во внешней программе");
			
		ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаПриложения);
		
	КонецПопытки;
		
КонецПроцедуры

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ВложениеСБИС_private_ЗаполнитьПараметрыПередРасчетом
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ВложениеСБИС_private_ЗаполнитьПоДокументФайл
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ВложениеСБИС_private_НайтиПодходящиеДокументы
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ВложениеСБИС_private_Обновить
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ВложениеСБИС_private_Поля1С
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ВложениеСБИС_private_РазобратьНоменклатуру
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ВложениеСБИС_private_Получить
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ВложениеСБИС_private_СторонаПоРоли
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ВложениеСБИС_private_УстановитьИниЗагрузки
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ВложениеСБИС_private_сбисПослеФормированияДокумента
#КонецОбласти

