
// Функция - Вложение СБИС выгрузить
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - структура вложения из СоставаПакета 
//  КлючВыгрузки - Структура	 - 
//  ДопПараметры - Структура	 - 
// 
// Возвращаемое значение:
// Массив - Строки табличной части документа 1С на загрузку/выгрузку
//
&НаКлиенте
Функция ВложениеСБИС_Выгрузить(ВложениеСБИС, КлючВыгрузки, ДопПараметры = Неопределено) Экспорт
	
	Если КлючВыгрузки = "ТабличнаяЧасть" Тогда
		
		Возврат ВложениеСБИС_Выгрузить_ТабличнаяЧасть(ВложениеСБИС, ДопПараметры);
		
	ИначеЕсли КлючВыгрузки = "ЗаписьНаБЛ" Тогда
		
		Возврат ВложениеСБИС_Выгрузить_ЗаписьНаБЛ(ВложениеСБИС, ДопПараметры);
		
	КонецЕсли;
	
КонецФункции
	
// Процедура - заполняет текущий экземпляр класса от входных данных
//
// Параметры:
//  ВложениеСБИС	 - Структура	- (О) экземпляр класса
//  ДопПараметры	 - Структура	- (О) доп. параметры заполнить
//
&НаКлиенте
Процедура ВложениеСБИС_Записать(ВложениеСБИС, ДопПараметры) Экспорт 
	Перем СтруктураСвойств, РежимЗаписиВложения;
	
	Если Не ДопПараметры.Свойство("СтруктураСвойств", СтруктураСвойств) Тогда
		СтруктураСвойств = Новый Структура;
	КонецЕсли;
	
	Если Не ДопПараметры.Свойство("Режим", РежимЗаписиВложения) Тогда
		РежимЗаписиВложения = "СБИС";
	КонецЕсли;
	
	Кэш				= ПолучитьТекущийЛокальныйКэш();
	СоставПакета	= ДопПараметры.СоставПакета;
	
	Если РежимЗаписиВложения = "Сопоставление" Тогда
		
		//Дополним данными пакета и вложения
		СтруктураСвойств.Вставить("ДокументСБИС_Ид",			СоставПакета.Идентификатор);
		СтруктураСвойств.Вставить("ДокументСБИС_Статус",		СоставПакета.Состояние.Название);
		СтруктураСвойств.Вставить("ДокументСБИС_ИдВложения",	ВложениеСБИС.Идентификатор);
				
	ИначеЕсли РежимЗаписиВложения = "ЗаписьСвойств" Тогда
		
		Если Не ЗначениеЗаполнено(СтруктураСвойств) Тогда
			Возврат;
		КонецЕсли;
		
	Иначе
		
		ОшибкаЗаписи = НовыйСбисИсключение(735, "МодульОбъектаКлиент.ВложениеСБИС_Записать",,, "Режим записи " + РежимЗаписиВложения + " не определен.");
		ВызватьИсключение СбисИсключение_Представление(ОшибкаЗаписи);
		
	КонецЕсли;

	ДопПараметрыАккаунта = Новый Структура("ИдАккаунта", Кэш.Интеграция.ПолучитьИдТекущегоАккаунта(Кэш));
	ФормаЗаписи = ГлавноеОкно.сбисНайтиФормуФункции("ЗаписатьПараметрыДокументаСБИС", Кэш.ФормаРаботыСоСтатусами, "", Кэш);
	
	Если ДопПараметры.Свойство("Документ1С") Тогда
		
		ФормаЗаписи.ЗаписатьПараметрыДокументаСБИС(СтруктураСвойств,
		ДопПараметры.Документ1С,
		Кэш.Ини.Конфигурация,
		Кэш.Парам.КаталогНастроек,
		ДопПараметрыАккаунта);  
		
		ВложениеСБИС_ЗаписатьСостояниеЭД(ДопПараметры.Документ1С, СоставПакета, ВложениеСБИС);
		
	Иначе
		
		Для Каждого Документ1С Из ВложениеСБИС_Получить(ВложениеСБИС, "Документы1С") Цикл
			
			ФормаЗаписи.ЗаписатьПараметрыДокументаСБИС(СтруктураСвойств,
			Документ1С,
			Кэш.Ини.Конфигурация,
			ПолучитьЗначениеПараметраСбис("КаталогНастроек"),
			ДопПараметрыАккаунта);  
			
			ВложениеСБИС_ЗаписатьСостояниеЭД(Документ1С, СоставПакета, ВложениеСБИС);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры 

// Процедура - заполняет текущий экземпляр класса от входных данных
//
// Параметры:
//  ВложениеСБИС	 - Структура	- (О) экземпляр класса
//  ДанныеЗаполнить	 - Структура	- (О) входные данные заполнить
//  КлючЗаполнить	 - Строка	 	- (Н) ключ входных данных, если это не класс (невозможно определить что за класс)
//
&НаКлиенте
Процедура ВложениеСБИС_Заполнить(ВложениеСБИС, ДанныеЗаполнить, КлючЗаполнить="ВложениеСБИС") Экспорт 
	Перем Документы1СВложения;
	
	Если КлючЗаполнить = "ВложениеСБИС" Тогда
		
		ВложениеСБИС_Заполнить_ПоВложениеСБИС(ВложениеСБИС, ДанныеЗаполнить);
						
	ИначеЕсли КлючЗаполнить = "Структура" Тогда
		
		СтруктураФайлаКонтрагента = ПолучитьФормуОбработки("Файл_Шаблон").НовыйСтруктураФайла(ВложениеСБИС);
		
	ИначеЕсли КлючЗаполнить = "Документ1С" Тогда
		
		Если ВложениеСБИС.Документы1С.НайтиПоЗначению(ДанныеЗаполнить) = Неопределено Тогда
			ВложениеСБИС.Документы1С.Добавить(ДанныеЗаполнить);
		КонецЕсли;
		
	ИначеЕсли КлючЗаполнить = "СопоставлениеНоменклатуры" Тогда
		
		ВложениеСБИС_Заполнить_СопоставлениеНоменклатуры(ВложениеСБИС, ДанныеЗаполнить)
		
	ИначеЕсли ВложениеСбис.Свойство("Параметры") Тогда
		
		ВложениеСБИС.Параметры.Вставить(КлючЗаполнить, ДанныеЗаполнить);
		
	Иначе
		
		ВложениеСБИС.Вставить("Параметры", Новый Структура);
		ВложениеСбис.Параметры.Вставить(КлючЗаполнить, ДанныеЗаполнить);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - заполняет текущий экземпляр класса сопоставленной номенклатурой
//
// Параметры:
//  ВложениеСБИС	 - Структура	- (О) экземпляр класса
//  ДанныеЗаполнить	 - Структура	- (О) входные данные заполнить
//		СоставПакета:		 СоставПакета 
//		ПараметрыЗаполнить:	 Структура		- заполнение результата для старой логики
//
&НаКлиенте
Процедура ВложениеСБИС_Заполнить_СопоставлениеНоменклатуры(ВложениеСБИС, ДанныеЗаполнить) 
	Перем ПараметрыРезультатЗаполнить;
	
	ПараметрыНоменклатуры	= ВложениеСБИС_Получить(ВложениеСБИС, "ПараметрыНоменклатуры");
	ДанныеСтруктурыФайла	= ВложениеСБИС_Получить(ВложениеСБИС, "ДанныеСтруктурыФайла");
	
	Если Не ПараметрыНоменклатуры.НадоСопоставлять Тогда
		
		Возврат;
		
	КонецЕсли;
							
	РаботаСДокументами1С = ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции");
	
	Если Не ДанныеЗаполнить.Свойство("ПараметрыЗаполнить", ПараметрыРезультатЗаполнить) Тогда
		
		// Костыль, чтобы не сломать функции дальше. По факту, всё заполнение должно идти на текущее Вложение.
		ПараметрыРезультатЗаполнить = Новый Структура;
		
	КонецЕсли;
	
	СоставПакета = ДанныеЗаполнить.СоставПакета; 
	ИспользоватьНовоеСопоставление	= ИспользоватьНовоеСопоставлениеНоменклатуры();
	
	Если ИспользоватьНовоеСопоставление Тогда
		
		ИсходящиеПараметрыДляЗаполнить = Новый Структура("ПараметрыНоменклатуры, Результат, Вложение");
		ИсходящиеПараметрыДляЗаполнить.ПараметрыНоменклатуры	= ПараметрыНоменклатуры;
		ИсходящиеПараметрыДляЗаполнить.Результат				= ПараметрыРезультатЗаполнить;
		ИсходящиеПараметрыДляЗаполнить.Вложение					= ВложениеСБИС;
		Если ВложениеСБИС.Свойство("КлассыСопоставленияНоменклатур") Тогда
			
			РаботаСДокументами1С.РасширенныйФункционалСопоставления_ЕслиЕстьНесопоставленнаяНоменклатура(ИсходящиеПараметрыДляЗаполнить);
			
		Иначе
	
			ИсходящиеПараметрыДляЗаполнить.Вставить("СоставПакета",	СоставПакета);
			ИсходящиеПараметрыДляЗаполнить.Вставить("ПутьТаблДок",	ДанныеСтруктурыФайла.Синонимы.Получить("ТабличнаяЧасть_ПутьКДанным"));
			
			РаботаСДокументами1С.РасширенныйФункционалСопоставления_ОбработкаСопоставленияПоТаблДоку(ИсходящиеПараметрыДляЗаполнить); 
			
		КонецЕсли;
		
	Иначе
			
		ПараметрыЗаполнить = Новый Структура("СоставПакета", СоставПакета);
		Попытка
			
			ТаблДок = РаботаСДокументами1С.ЗаполнитьДанныеДляЗагрузкиПоУмолчанию_ТаблДок(ВложениеСБИС, ПараметрыЗаполнить);
			
			Если ЗначениеЗаполнено(ТаблДок) Тогда
				
				ПараметрыРезультатЗаполнить.Вставить("ТаблДок", ТаблДок);  
				
			Иначе
				
				ПараметрыНоменклатуры.НадоСопоставлять = Ложь;

			КонецЕсли;
			
		Исключение
			
			СбисИсключение = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ВложениеСБИС.Заполнить.СопоставлениеНоменклатуры");
			ВызватьИсключение СбисИсключение_Представление(СбисИсключение);
			
		КонецПопытки;
		
	КонецЕсли;
	
	Если 	Не СоставПакета.Свойство("НоменклатураСопоставлена")
			Или СоставПакета.НоменклатураСопоставлена Тогда
			
		СоставПакета.Вставить("НоменклатураСопоставлена", ПараметрыНоменклатуры.Сопоставлено);
		
	КонецЕсли;
	
	ПараметрыРезультатЗаполнить.Вставить("ПутьТаблДок", 			ДанныеСтруктурыФайла.Синонимы.Получить("ТабличнаяЧасть_ПутьКДанным"));
	ПараметрыРезультатЗаполнить.Вставить("ПараметрыНоменклатуры",	ПараметрыНоменклатуры);
	
КонецПроцедуры

// Процедура - заполнить параметры перед расчетом по инишке: Входящий контекст + ручные изменения в объект
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - Структура с описанием обрабатываемого вложения
//  ДопПараметры - Структура/ФиксированнаяСтруктура	 - расширение метода
//
&НаКлиенте
Процедура ВложениеСБИС_ЗаполнитьПараметрыПередРасчетом(ВложениеСБИС, ДопПараметры = Неопределено) Экспорт
    Перем ВходящийКонтекстИни, ДополнительныеПоляКонтекста, РассчитываемыйОбъект, ЗаполнитьКонтекст;
	
	Если Не ДопПараметры = Неопределено Тогда
		
		ДопПараметры.Свойство("ПоляРассчета",			ДополнительныеПоляКонтекста);
		ДопПараметры.Свойство("РассчитываемыйОбъект",	РассчитываемыйОбъект);
		ДопПараметры.Свойство("ЗаполнитьКонтекст",		ЗаполнитьКонтекст);
		
	КонецЕсли;
	
	ОчиститьТекущий		= Истина;
	ЗаполнитьКонтекст	= (ЗаполнитьКонтекст = Истина);
	
	Если Не ВложениеСБИС.Свойство("ВходящийКонтекст", ВходящийКонтекстИни) Тогда

		ВложениеСБИС.Вставить("ВходящийКонтекст", Новый Структура("РассчитанноеЗначение", Новый Структура));
		ЗаполнитьКонтекст = Истина;
		
	КонецЕсли;
	
	Если ЗаполнитьКонтекст Тогда
		
		ВложениеСБИС_ЗаполнитьПараметрыПередРасчетом_ВходящийКонтекст(ВложениеСБИС);
		
		ДанныеСторон = СоставПакета_Получить(ДопПараметры.СоставПакета, "ДанныеСторон");
		
		// Прокинуть данные сторон от пакета до вложения во входящий контекст, чтобы их можно было взять инишкой
		Если	ЗначениеЗаполнено(ДанныеСторон)
			И	ДоступнаПодстановкаСторонИзПакета(ДопПараметры.СоставПакета) Тогда
			
			ДанныеСторонДляДокумента1С	= Новый Структура;
			ДанныеДляПодготовки			= Новый Структура("ДанныеСторонСБИС, ДанныеСторон1С", ДанныеСторон, ДанныеСторонДляДокумента1С);
			ДопПараметрыПодготовки		= Новый Структура("ЕстьПартнеры", ИниПоПараметрам("Конфигурация").Свойство("Партнеры"));
			
			ПодготовитьСтороныКЗагрузкеДокумента(ДанныеДляПодготовки, ДопПараметрыПодготовки);
			
			ВложениеСБИС.ВходящийКонтекст.РассчитанноеЗначение.Вставить("ОрганизацияПоПакету",		ДанныеСторон.ДанныеОрганизации.Ссылка); 
			ВложениеСБИС.ВходящийКонтекст.РассчитанноеЗначение.Вставить("КонтрагентПоПакету",		ДанныеСторонДляДокумента1С.ДанныеКонтрагента); 
			ВложениеСБИС.ВходящийКонтекст.РассчитанноеЗначение.Вставить("ГрузополучательПоПакету",	ДанныеСторонДляДокумента1С.ДанныеГрузополучателя); 
			ВложениеСБИС.ВходящийКонтекст.РассчитанноеЗначение.Вставить("Партнер",					ДанныеСторонДляДокумента1С.ДанныеПартнера);
		
		КонецЕсли;
		
	КонецЕсли; 
	
	Если Не ДополнительныеПоляКонтекста = Неопределено Тогда
		
		Для Каждого КлючИЗначениеПолей Из ДополнительныеПоляКонтекста Цикл
			
			ВложениеСБИС.ВходящийКонтекст.РассчитанноеЗначение.Вставить(КлючИЗначениеПолей.Ключ, КлючИЗначениеПолей.Значение);
			
		КонецЦикла;
		
	КонецЕсли;	
	
	ВложениеСБИС_ЗаполнитьПараметрыПередРасчетом_РучныеПравки(ВложениеСБИС, РассчитываемыйОбъект);
	
КонецПроцедуры

// Функция - проверяет возможность загрузки вложения в 1С
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС				 - структура текущего вложения
//  ДопПараметры - Струкутра/Неопределено	 - структура, расширение
// 
// Возвращаемое значение:
//  Структура - описание, можем ли загрузить или нет.
//
&НаКлиенте
Функция ВложениеСБИС_МожемЗагрузитьВ1С(ВложениеСБИС, ДопПараметры = Неопределено) Экспорт
	
	Результат = Новый Структура("МожноЗагрузить, Проблемы, Статус", Ложь, Новый Структура, "");

	СтруктураИниФайла		= ВложениеСБИС_Получить(ВложениеСБИС, "УстановленныйПодразделИни");
	ДанныеФайла				= ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
	СтатусВложения			= ВложениеСБИС_Получить(ВложениеСБИС, "Статус");
	
	Если	СтатусВложения = "НеПоддерживается"  Тогда
		
		Результат.Статус = "Загрузка документа не поддерживается.";
		
	ИначеЕсли СтатусВложения = "Ошибка" Тогда
		
		Результат.Статус = "Ошибка разбора документа.";
		
	ИначеЕсли СтатусВложения = "Разобран" Тогда

		Результат.МожноЗагрузить = Истина;
		
		ПараметрыНоменклатуры	   = ВложениеСБИС_Получить(ВложениеСБИС, "ПараметрыНоменклатуры");
		Поля1С					   = ВложениеСбис_Получить(ВложениеСБИС, "Поля1С");
		ОрганизацияВложения		   = Поля1С.Организация.Значение;
		КонтрагентВложения		   = Поля1С.Контрагент.Значение; 
		ДанныеСтруктурыФайла       = ВложениеСБИС_Получить(ВложениеСБИС, "ДанныеСтруктурыФайла");
		РольОрганизацияВложения    = ДанныеСтруктурыФайла.Синонимы.Получить("Организация");
		РольКонтрагентВложения     = ДанныеСтруктурыФайла.Синонимы.Получить("Контрагент");
		РольСопоставлениеВложения  = ДанныеСтруктурыФайла.Синонимы.Получить("Сопоставление");
		
		Если НЕ ЗначениеЗаполнено(ОрганизацияВложения) ИЛИ ОрганизацияВложения = Ложь Тогда
			
			СтатусОрганизация = ""; 
			
			Если РольОрганизацияВложения = "" Тогда
				СтатусОрганизация = "Организация не заполняется";
			ИначеЕсли РольОрганизацияВложения = Неопределено Тогда
				СтатусОрганизация = "Нет роли организации";
			Иначе			
				ПараметрыИни = ВложениеСБИС_Получить(ВложениеСБИС, "ПараметрыИни");
				
				// Для исходящих документов статус организации пока отключен.
				Если НЕ ПараметрыИни.Направление = "Исходящий" Тогда
					
					СтатусОрганизация	= "Не найдена организация.";
					Результат.Проблемы.Вставить("Организация", СтатусОрганизация);
				КонецЕсли;					
			КонецЕсли;
			
			Если НЕ СтатусОрганизация = "" Тогда
				Результат.Статус = СокрЛП(Результат.Статус + " " + СтатусОрганизация);
			КонецЕсли; 
			
		КонецЕсли;
		
		Если НЕ	ЗначениеЗаполнено(КонтрагентВложения) ИЛИ КонтрагентВложения = Ложь Тогда 		
			
			СтатусКонтрагент = "";
			
			Если РольКонтрагентВложения = "" Тогда
				
				СтатусКонтрагент = "Контрагент не заполняется"; 
				
			ИначеЕсли РольКонтрагентВложения = Неопределено Тогда 
				
				СтатусКонтрагент = "Нет роли контрагента";	
				
			Иначе			          
				
				СтатусКонтрагент = "Не найден контрагент.";
				Результат.Проблемы.Вставить("Контрагент", СтатусКонтрагент);
				
			КонецЕсли;
			
			Если НЕ СтатусКонтрагент = "" Тогда  
				
				Результат.Статус = СокрЛП(Результат.Статус + " " + СтатусКонтрагент); 
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПараметрыНоменклатуры.НадоСопоставлять Тогда
			
			Если ПараметрыНоменклатуры.Сопоставлено Тогда
				
				СтатусНоменклатура = "Номенклатура сопоставлена.";	
				
			ИначеЕсли РольСопоставлениеВложения = Неопределено Тогда
				
				СтатусНоменклатура = "Сопоставление не требуется.";	
				
			ИначеЕсли РольСопоставлениеВложения = "" Тогда
				
				СтатусНоменклатура = "Сопоставление номенклатуры отключено.";				
				
			Иначе
				
				СтатусНоменклатура = "Не вся номенклатура сопоставлена.";
				Результат.Проблемы.Вставить("Номенклатура", СтатусНоменклатура);
				
			КонецЕсли;
			
		Иначе
					
			СтатусНоменклатура = "Сопоставление не требуется.";
			
		КонецЕсли;
		
		Результат.Статус = СокрЛ(Результат.Статус + " " + СтатусНоменклатура);
		
	Иначе
		
		Результат.Статус = "Документ не разобран.";
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции
	
// Процедура - обновляет вложение СБИС по новым данным
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - структура вложения
//  Изменения	 - Струкутра	 - с изменениями
//  ДопПараметры - Структура	 - расширение
//
&НаКлиенте
Процедура ВложениеСБИС_Обновить(ВложениеСБИС, Изменения, ДопПараметры = Неопределено) Экспорт
	Перем ТекущиеИзменения, КлючИзменения;
	
	Если ТипЗнч(ДопПараметры) = Тип("Строка") Тогда
		
		КлючИзменения = ДопПараметры;
		
	ИначеЕсли Не ДопПараметры = Неопределено Тогда
		
		ДопПараметры.Свойство("Ключ", КлючИзменения);
		
	КонецЕсли;
	
	Если КлючИзменения = "Статус" Тогда 
		
		ВложениеСБИС_Обновить_Статус(ВложениеСБИС, Изменения, ДопПараметры);
		Возврат;
		
	КонецЕсли;
		
	
	Если ТипЗнч(Изменения) = Тип("Файл") Тогда
		
		ВложениеСБИС.Вставить("ИмяФайла",		Изменения.Имя);
		ВложениеСБИС.Вставить("ПолноеИмяФайла",	Изменения.ПолноеИмя);
	
	ИначеЕсли	Изменения.Свойство("Номенклатура", ТекущиеИзменения) Тогда
		
		ВложениеСБИС_Обновить_Номенклатура(ВложениеСБИС, ТекущиеИзменения);
		ВложениеСБИС.Вставить("Перегенерировать", Истина);
		
	ИначеЕсли Изменения.Свойство("Поля1С") Тогда
		
		ВложениеСБИС_Обновить_Поля1С(ВложениеСБИС, Изменения, ДопПараметры);
		
	ИначеЕсли	Изменения.Свойство("СтрокаФормыПросмотра", ТекущиеИзменения) Тогда
		
		ВложениеСБИС.Параметры.Вставить("МожемЗагрузитьВ1С", Булево(ТекущиеИзменения.МожемЗагрузитьВ1С));
		
	ИначеЕсли	Изменения.Свойство("Организация")
		ИЛИ		Изменения.Свойство("Контрагент")
		ИЛИ		Изменения.Свойство("Грузополучатель") Тогда
		
		ВложениеСБИС_Обновить_Сторона(ВложениеСБИС, Изменения);
		
	ИначеЕсли Изменения.Свойство("ПеречитатьВизуализацию") Тогда
		
		ВложениеСБИС.Удалить("ТекстHTML");
		
		Визуализация = ВложениеСБИС_Получить(ВложениеСБИС, "ВизуализацияДокумента");
		ДанныеЗаполнить = Новый Структура("ТекстHTML", Визуализация);
		
		ВложениеСБИС_Заполнить(ВложениеСБИС, ДанныеЗаполнить);
		
	ИначеЕсли Изменения.Свойство("ПараметрыДокумента", ТекущиеИзменения) Тогда	
		
		ВложениеСБИС_Обновить_ПараметрыДокумента(ВложениеСБИС, ТекущиеИзменения);
		ВложениеСБИС.Вставить("Перегенерировать", Истина);
		
	ИначеЕсли Изменения.Свойство("Подпись", ТекущиеИзменения) Тогда	
		
		ВложениеСБИС.Вставить("Подпись", ТекущиеИзменения);  
		
	ИначеЕсли Изменения.Свойство("ТабличныеДанные") Тогда   
		
		ВложениеСБИС_ОбновитьТабличныеДанные(ВложениеСБИС, Изменения);
		
	КонецЕсли;
	
	Если Изменения.Свойство("ПодразделИни", ТекущиеИзменения) Тогда
		
		ВложениеСБИС_Обновить_ПодразделИни(ВложениеСБИС, ТекущиеИзменения, ДопПараметры);	
		
	КонецЕсли;		
		
	Если Изменения.Свойство("ЗапомнитьВыборДокумента") Тогда   
		
		ВложениеСБИС_Обновить_ДанныеДокументовПоУмолчанию(ВложениеСБИС, Изменения, ДопПараметры);
		
	КонецЕсли;	
		
КонецПроцедуры

// Процедура - читает данные XML вложения, приводит к объекту 1С. Заполняет поля:
//		XMLДокумента				 - Строка		 - прочитанные исходные данные титула вложения
//		СтруктураФайла				 - Структура	 - приведенные к известному формату (3.01/3.03) данные XML и разложенные парсером
//		ВерсияФорматаДляЗагрузки	 - Строка		 - значение ВерсияФормата из СтруктураФайла
//		ФорматДляЗагрузки			 - Строка    	 - значение Формат из СтруктураФайла
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - экземпляр класса вложения
//  ДопПараметры - Структура	 -расширение. Возможные поля:
//		СоставПакета - СоставПакета - основной документ СБИС, к которому принадлежит вложение
//
&НаКлиенте
Процедура ВложениеСБИС_ПрочитатьДанные(ВложениеСБИС, ДопПараметры) Экспорт
	Перем Файл_Формат, Файл_ВерсияФормата;
	
	Если ВложениеСБИС.Свойство("XMLДокумента") Тогда
		
		// Уже прочитано
		Возврат;
		
	КонецЕсли;
	
	ВложениеСБИС.Вставить("XMLДокумента", "");
	
	ПараметрыОписаниеИни	= ВложениеСБИС_Получить(ВложениеСБИС, "ПараметрыИни");
	Если Не ЗначениеЗаполнено(ПараметрыОписаниеИни.Тип) Тогда
		// Это неформалка, заполняем в тип = "неформатноеВложение"
		ВложениеСБИС.Вставить("Тип", "НеформатноеВложение");
		// Это документ, который точно не умеем грузить, пропускаем.
		Возврат;
		
	КонецЕсли;
	
	ФайлВложение		= ВложениеСБИС_Получить(ВложениеСБИС, "Файл");
	ИнтеграцияМодуль	= ПолучитьЗначениеПараметраСбис("Интеграция");
	СбисОбщиеФункции	= ПолучитьЗначениеПараметраСбис("ФункцииДокументов");
	Кэш					= ПолучитьТекущийЛокальныйКэш();
	ПолныйСоставПакета	= ДопПараметры.СоставПакета;
	
	XMLИсходногоФайла	= ВложениеСБИС_Получить(ВложениеСБИС, "ДанныеФайла");
	XMLФайла			= ВырезатьИсключенияXMLВложения(XMLИсходногоФайла);
	
	ЕстьXSLT	= Ложь;
	ИмяXSLT		= "";
	
	Файл_Формат			= СбисОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(ВложениеСБИС.Тип);
	ПодТип				= СбисОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(ВложениеСБИС.ПодТип);
	Файл_ВерсияФормата	= СбисОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(ВложениеСБИС.ВерсияФормата);		
	СтруктураФайла		= Новый Структура;
	
	Если ЗначениеЗаполнено(Файл_Формат) и ЗначениеЗаполнено(XMLФайла) Тогда
		ИмяXSLT	= СбисОбщиеФункции.СбисФорматСтроки(Файл_Формат + "_" + ПодТип + "_" + Файл_ВерсияФормата, "КлючСтруктуры");
		ЕстьXSLT = ЗначениеЗаполнено(XSLTПоПараметрам(ИмяXSLT));
		
		ОшибкаПреобразования= Ложь;
		ДопПараметрыXSLT	= Неопределено;
		Если Кэш.Парам.РежимОтладки Тогда
			
			ДопПараметрыXSLT = Новый Структура;
			ДопПараметрыXSLT.Вставить("Название", СбисОбщиеФункции.сбисФорматКаталога("Загрузка", Кэш.ПараметрыСистемы.Клиент));
			
			Если ПолныйСоставПакета.Свойство("Название") Тогда
				
				ДопПараметрыXSLT.Название = ПрименитьФорматКСтроке(ДопПараметрыXSLT.Название, ПолныйСоставПакета.Название, "Каталог");
				
			КонецЕсли;
			
		КонецЕсли;
		
		XMLФайла = СбисОбщиеФункции.сбисПрименитьXSLT(Кэш, XMLФайла, ИмяXSLT, ДопПараметрыXSLT, ОшибкаПреобразования);
		
		Если ОшибкаПреобразования Тогда
			
			Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, XMLФайла);
			XMLФайла = "";
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Файл_ВерсияФормата) Тогда
			
			ВложениеСБИС.XMLДокумента = XMLИсходногоФайла;
			
		КонецЕсли;
		
		Попытка
			СтруктураФайла	= СбисОбщиеФункции.ЗаполнитьСтруктуруФайла(XMLФайла);
		Исключение
			ОшибкаРазбора = НовыйСбисИсключение(ИнформацияОбОшибке(),"МодульОбъектаКлиент.ВложениеСБИС_ПрочитатьДанные",770,"Не удалось разобрать данные файла",,,);
			ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаРазбора);
		КонецПопытки;
		
	Иначе
		
		XMLФайла= "";
		
	КонецЕсли;
	
	//Пробуем преобразовать XML только если он есть, дабы избежать лишних вызовов сервера
	ВложениеСБИС.Вставить("СтруктураФайла", СтруктураФайла);
	Если	ЕстьXSLT 
		И	СтруктураФайла.Свойство("Файл")
		И	СтруктураФайла.Файл.Свойство("Формат")
		И	СтруктураФайла.Файл.Свойство("ВерсияФормата") Тогда
		
		Файл_Формат			= СбисОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(СтруктураФайла.Файл.Формат);
		Файл_ВерсияФормата	= СбисОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(СтруктураФайла.Файл.ВерсияФормата);
		
	ИначеЕсли ЗначениеЗаполнено(XMLФайла) Тогда	// XMLФайла может быть пустым, если вложение не удалось расшифровать
		
		Файл_Формат			= СбисОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(ВложениеСБИС.Тип);
		Файл_ВерсияФормата	= СбисОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(ВложениеСБИС.ВерсияФормата);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ВложениеСБИС.Вставить("ФорматДляЗагрузки",			Файл_Формат);
	ВложениеСБИС.Вставить("ВерсияФорматаДляЗагрузки",	Файл_ВерсияФормата);
	
КонецПроцедуры

//Функция возвращает разобрынные данные вложения XMLДокумента, СтруктураФайла, ФорматДляЗагрузки, ВерсияФорматаДляЗагрузки
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - Структура, описывает вложение в Документ СБИС
//  ДопПараметры - Структура	 - параметры расширения
//		СоставПакета	- ДокументСБИС, к которому относится вложение.
//		Просмотр		- булево (Ложь), определяет необходимость определения полей для редактирования, типов и всего необходимого для интерфейса
//
&НаКлиенте
Процедура ВложениеСБИС_РазобратьДляЗагрузки(ВложениеСБИС, ДопПараметры) Экспорт
	Перем ПоляВходящегоКонтекста;
	
	СтатусВложения = ВложениеСБИС_Получить(ВложениеСБИС, "Статус");
	Если СтатусВложения = "Ошибка" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ВложениеСБИС.Свойство("Параметры") Тогда
		
		ПараметрыВложения = Новый Структура;
		ПараметрыВложения.Вставить("Просмотр",						Ложь); // Документ формируется для формы просмотра
		ПараметрыВложения.Вставить("ВозможноРедактироватьДокумент", Ложь); // В ини установлена возможность редактировать документ (не перезаполняя его)
		ПараметрыВложения.Вставить("РедактироватьТабЧасть",			Ложь); // Установлена возможность редактировать табличную часть (не перезаполняя)
		ПараметрыВложения.Вставить("РедактироватьДокумент",			Ложь); // Установлен документ в редактируемых полях и есть возможность редактировать
		ПараметрыВложения.Вставить("ПодборДокументаДляЗаполнения",	Ложь); // Сопоствлять ли документ перед загрузкой, или нет.
		ВложениеСБИС.Вставить("Параметры", ПараметрыВложения);
		
	КонецЕсли;
	
	Если	ДопПараметры.Свойство("Просмотр")  Тогда
		
		ВложениеСБИС.Параметры.Просмотр = ДопПараметры.Просмотр;
		
	КонецЕсли;
	
	Попытка
		
		ВложениеСБИС_ПрочитатьДанные(ВложениеСБИС, ДопПараметры);
		ВложениеСБИС_УстановитьИниЗагрузки(ВложениеСБИС, ДопПараметры);
		
	Исключение
		
		ОшибкаРазбора = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ВложениеСБИС_РазобратьДляЗагрузки");
		ВложениеСБИС_Обновить(ВложениеСБИС, Новый ФиксированнаяСтруктура("Статус", ОшибкаРазбора));
		Возврат;
		
	КонецПопытки;
	
КонецПроцедуры

// Процедура - патчит новое сопоставление на выбранное вложение
//
// Параметры:
//  Вложение	 - ВложениеСБИС	 - структура вложения, которое патчится
//  ДопПараметры - Структура	 - расширение
//
&НаКлиенте
Процедура ВложениеСБИС_ПропатчитьНовымСопоставлением(Вложение, ДопПараметры = Неопределено) Экспорт		
	
	МестныйКэш = ПолучитьТекущийЛокальныйКэш();							
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	Если Вложение.Свойство("КлассыСопоставленияНоменклатур") 
		И Вложение.Параметры.НоменклатураСопоставлена Тогда
		НаборСопоставлений = Вложение.КлассыСопоставленияНоменклатур;
	Иначе
		// 1. Получим ТаблДоки в исходном виде из вложений и сформируем от них набор классов сопоставления номенклатуры. 
		// По возможности попытаемся их обогатить через "Массовый поиск"
		///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		ФормыПоиска = Новый Массив;
		ФормыПоиска.Добавить("Файл_Шаблон");
		
		фрм = НайтиФункциюСеансаОбработки("СформироватьНаборСопоставленийНоменклатурыПоТабличнойЧасти", ФормыПоиска);
		
		Если НЕ фрм = Ложь Тогда  
			НаборСопоставлений = фрм.СформироватьНаборСопоставленийНоменклатурыПоТабличнойЧасти(Вложение, МестныйКэш, ДопПараметры);
		Иначе
			ВызватьСбисИсключение(, "МодульОбъектаКлиент.ПропатчитьВложенияНовымСопоставлением",,,"Не найдена форма работы с форматом документа");
		КонецЕсли;
		
		Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("РежимОтладки") Тогда
			
			ДанныеЛогирования = Новый Структура;
			ДанныеЛогирования.Вставить("Тип", 			"СопоставлениеНоменклатуры");
			ДанныеЛогирования.Вставить("Идентификатор", МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "Название"));
			ДанныеЛогирования.Вставить("Вызов", 		НаборСопоставлений);
			ДанныеЛогирования.Вставить("Модуль", 		"Файл_Шаблон");
			
			МодульОбъектаКлиент().СохранитьОтладочныеДанныеСБИС(ДанныеЛогирования);
			
		КонецЕсли;
		
	КонецЕсли;   
	
	// 2. В полученных классах произведем пересчет по коэффициенту единиц измерения
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	Если (ДопПараметры.Свойство("КонтекстДляСопоставления") 
		И ДопПараметры.КонтекстДляСопоставления.Свойство("ПересчетПоДокументуОснованию")) 
		ИЛИ ДопПараметры.Свойство("ПересчетПоДокументуОснованию") Тогда
		МестныйКэш.ОбщиеФункции.ПересчетПоКоэффициентамЕдиницИзмерения(НаборСопоставлений, "Выгрузка");	
	Иначе	
		МестныйКэш.ОбщиеФункции.ПересчетПоКоэффициентамЕдиницИзмерения(НаборСопоставлений, "Загрузка");
		МестныйКэш.ОбщиеФункции.ПересчетНДСПоДаннымСтрокиСопоставления(НаборСопоставлений);
	КонецЕсли;
	
	Вложение.Вставить("КлассыСопоставленияНоменклатур", НаборСопоставлений); 
	НоменклатураСопоставлена = СопоставлениеНоменклатуры_ВсеНоменклатурыСопоставлены(НаборСопоставлений);
	Вложение.Параметры.Вставить("НоменклатураСопоставлена", НоменклатураСопоставлена);
	// 3. Обновленные данные выгрузим в ТаблДок и запишем его на вложение.
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ТаблДокНаОсновеКлассов = ВложениеСБИС_Выгрузить(Вложение, "ТабличнаяЧасть", ДопПараметры);
	
	Если Не ТаблДокНаОсновеКлассов.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Если Вложение.Свойство("СтруктураФайла") Тогда
		Вложение.СтруктураФайла.Файл.Документ.ТаблДок.Вставить("СтрТабл", ТаблДокНаОсновеКлассов);
	ИначеЕсли Вложение.СтруктураДокумента.Файл.Документ.Свойство("ТаблДок") Тогда
		Вложение.СтруктураДокумента.Файл.Документ.ТаблДок.Вставить("СтрТабл", ТаблДокНаОсновеКлассов);
	Иначе
		Вложение.СтруктураДокумента.Файл.Документ.СписокСтрТабл.Вставить("СтрТабл", ТаблДокНаОсновеКлассов);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - удаляет выбранные узлы из структуры данных (разобранные данные файла, или прочитанные данные документа)
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - Структура, вложение в которое устанавливаем параметры
//  УдаляемыеУзлы - Массив	 - Путь к удаляемым узлам в виде строки, через "."
//
&НаКлиенте
Процедура ВложениеСБИС_УдалитьУзлыИзСтруктурыДанных(ВложениеСБИС, УдаляемыеУзлы) Экспорт 
	
	ДанныеОчистить = МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
	Если ДанныеОчистить = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	МодульФункции = ПолучитьЗначениеПараметраСбис("ФункцииДокументов");
	// Удаление лишнего
	Для Каждого ПутьУзла Из УдаляемыеУзлы Цикл
		
		РазобранныйПутьУзла = Новый СписокЗначений;
		РазобранныйПутьУзла.ЗагрузитьЗначения(МодульФункции.РазбитьСтрокуВМассивНаКлиенте(ПутьУзла, "."));
		
		УдалитьУзелИзСтруктурыДанных(ДанныеОчистить, РазобранныйПутьУзла);

	КонецЦикла;
	
	
КонецПроцедуры

// ПЕРЕСМОТРЕТЬ место кода
// Функция - Получает структуру документа 1С по пакету СБИС
//
// Параметры:
//  ОписаниеПроверки - 	 - 
//  ДопПараметры	 - 	 - 
// 
// Возвращаемое значение:
//  ФайлДокумент - структура прочитанного документа
//
&НаКлиенте
Функция ПолучитьСтруктуруДокумента1СПоПакетуСбис(ОписаниеПроверки, ДопПараметры) Экспорт

	Кэш							= ГлавноеОкно.Кэш;
	Вложение					= ОписаниеПроверки.Вложение;
	СоставПакета				= ОписаниеПроверки.СоставПакета;
	ДанныеДокумента				= Новый Структура();
	СоответствиеДокументДанные	= Новый Соответствие;

	Если ОписаниеПроверки.Свойство("Документ1С") Тогда
		
		ПодготовитьСоответствиеРасхожденияДокумент1С_Вложение(Вложение, ОписаниеПроверки.Документ1С, СоответствиеДокументДанные);
		
	Иначе
		// TODO Это условие не имеет смысла, т.к. код дальше работать не будет, если зайдет сюда
		
		// Если документа нет, то проверить на вложении
		Для Каждого Документ1С Из Вложение.Документы1С Цикл
			
			ПодготовитьСоответствиеРасхожденияДокумент1С_Вложение(Вложение, Документ1С.Значение, СоответствиеДокументДанные);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не СоответствиеДокументДанные.Количество() Тогда
		
		МодульОбъектаКлиент().ВызватьСбисИсключение("Не найден файл для формирования расхождения " + Вложение.Название, "МодульОбъектаКлиент.ПолучитьСтруктуруДокумента1СПоПакетуСбис");
		
	КонецЕсли;
	
	// TODO Устаревшая странная хрень. Используется, потому что в ПодготовитьСоответствиеРасхожденияДокумент1С_Вложение так же
	ДокументСтрокой = ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.ПолучитьИмяИСПоСсылке(ОписаниеПроверки.Документ1С);
	ИмяИни = СтрПолучитьСтроку(СтрЗаменить(ДокументСтрокой, ".", Символы.ПС), 2);
	
	НовыйСоставПакета = Новый СписокЗначений;
	НовыйСоставПакета.Добавить(ОписаниеПроверки.Документ1С, ИмяИни);
	
	Контекст = Новый Структура("МассивПакетов", Новый Массив);
	//Кэш.КэшЗначенийИни.ТекущийПакет.Вставить("СоответствиеДокументДанные", СоответствиеДокументДанные);
	
	Кэш.ОбщиеФункции.ПолучитьДанныеДокументов1С(СоответствиеДокументДанные, Кэш.КэшЗначенийИни, НовыйСоставПакета, Кэш.Парам);
	Если	Не Кэш.ОбщиеФункции.ОбработатьДанныеДокументов1С(Кэш, Контекст, НовыйСоставПакета, СоответствиеДокументДанные)
		Или	Не ЗначениеЗаполнено(Контекст.МассивПакетов) Тогда
		ВызватьСбисИсключение(745, "МодульОбъектаКлиент.ПолучитьСтруктуруДокумента1СПоПакетуСбис",,, "Документ " + НовыйСоставПакета[0].Значение + " не обработан");
	КонецЕсли;  
                 
	ДанныеРезультат = Контекст.МассивПакетов[0];
	Если	Не ДанныеРезультат.Количество()
		Или Не ЗначениеЗаполнено(ДанныеРезультат)
		Или	Не ДанныеРезультат.Свойство("Вложение")
		Или	Не ДанныеРезультат.Вложение.Количество() Тогда;                       
		ВызватьСбисИсключение(745, "МодульОбъектаКлиент.ПолучитьСтруктуруДокумента1СПоПакетуСбис",,, "Не удалось сформировать " + Вложение.Тип + " от " + НовыйСоставПакета[0].Значение);
	КонецЕсли;
	
	Возврат ДанныеРезультат.Вложение[0].СтруктураДокумента.Файл.Документ;
	
КонецФункции

