
// Функция - Вложение СБИС выгрузить
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - структура вложения из СоставаПакета 
//  КлючВыгрузки - Структура	 - 
//  ДопПараметры - Структура	 - 
// 
// Возвращаемое значение:
// Массив - Строки табличной части документа 1С на загрузку/выгрузку
//
&НаКлиенте
Функция ВложениеСБИС_Выгрузить(ВложениеСБИС, КлючВыгрузки = Неопределено, ДопПараметры = Неопределено) Экспорт
		
	Если НЕ (ВложениеСБИС.Свойство("КлассыСопоставленияНоменклатур") 
			И ЗначениеЗаполнено(ВложениеСБИС.КлассыСопоставленияНоменклатур)) Тогда
		
		// Прокинуть исключение	
		Возврат Неопределено;
	КонецЕсли;

	ЛокальныйКэш		= ПолучитьТекущийЛокальныйКэш();
	СбисОбщиеФункции	= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	СтруктураДокумента	= ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
	
	Если    ЗначениеЗаполнено(СтруктураДокумента)
		И	СтруктураДокумента.Файл.Документ.Свойство("СписокСтрТабл") Тогда
		
		ПутьТаблДок = "Файл.Документ.СписокСтрТабл.СтрТабл";
		
	Иначе
		
		ПутьТаблДок = "Файл.Документ.ТаблДок.СтрТабл";
		
	КонецЕсли;	
	
	Если ВложениеСБИС.Свойство("ТаблДок") Тогда
		
		ТабличнаяЧастьИзФайла = ВложениеСБИС.ТаблДок; // Рассчитывался при подготовке к загрузке
		
	Иначе

		ТабличнаяЧастьИзФайла = СбисОбщиеФункции.РассчитатьЗначениеИзСтруктуры(ПутьТаблДок, СтруктураДокумента);
		
	КонецЕсли;
	
	НаборСопоставленийНоменклатуры = Новый Структура("ТабличнаяЧасть, НаборСопоставлений", ТабличнаяЧастьИзФайла, ВложениеСБИС.КлассыСопоставленияНоменклатур);
	
	ПараметрыПоискаФорм = ВложениеСбис_Получить(ВложениеСБИС, "ПараметрыИни");
	НаборФорм = Новый Массив;
	
	ИмяФормыПоФормату = "Файл_"	+ СбисОбщиеФункции.СбисЗаменитьНедопустимыеСимволы(ПараметрыПоискаФорм.Тип)
	+ "_"	+ СбисОбщиеФункции.СбисЗаменитьНедопустимыеСимволы(ПараметрыПоискаФорм.Версия);
	
	НаборФорм.Добавить(ИмяФормыПоФормату);
	
	Если Не ПараметрыПоискаФорм.Версия = "3.01" Тогда
		НаборФорм.Добавить("Файл_Шаблон_" + СтрЗаменить(ПараметрыПоискаФорм.Версия, ".", "_"));
	КонецЕсли;
	
	НаборФорм.Добавить("Файл_Шаблон");
	
	МодульФормы = НайтиФункциюСеансаОбработки("СформироватьТабличнуюЧастьПоНаборуСопоставленийНоменклатуры", НаборФорм);
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	Если ПараметрыПоискаФорм.Направление = "Входящий" Тогда
		ДопПараметры.Вставить("СвернутьСтроки", Ложь);
	Иначе
		ДопПараметры.Вставить("СвернутьСтроки", Истина);
	КонецЕсли;
	
	Если НЕ ДопПараметры = Неопределено 
		И ДопПараметры.Свойство("НаправлениеСворачивания") Тогда
		НаправлениеСворачивания = ДопПараметры.НаправлениеСворачивания;
	Иначе
		НаправлениеСворачивания = "СБИС";
	КонецЕсли;
	
	ДопПараметры.Вставить("НаправлениеСворачивания", НаправлениеСворачивания);
	
	Если ВложениеСБИС.Параметры.Свойство("ФайлПерегенерируется") Тогда
		ДопПараметры.Вставить("ФайлПерегенерируется", ВложениеСБИС.Параметры.ФайлПерегенерируется);
	Иначе
		ДопПараметры.Вставить("ФайлПерегенерируется",Истина);
	КонецЕсли;
	
	ТабличнаяЧасть = МодульФормы.СформироватьТабличнуюЧастьПоНаборуСопоставленийНоменклатуры(НаборСопоставленийНоменклатуры, ДопПараметры);
	
	Возврат ТабличнаяЧасть;
	
КонецФункции

// Процедура - заполняет текущий экземпляр класса от входных данных
//
// Параметры:
//  ВложениеСБИС	 - Структура	- (О) экземпляр класса
//  ДопПараметры	 - Структура	- (О) доп. параметры заполнить
//
&НаКлиенте
Процедура ВложениеСБИС_Записать(ВложениеСБИС, ДопПараметры) Экспорт 
	Перем СтруктураСвойств, РежимЗаписиВложения;
	
	Если Не ДопПараметры.Свойство("СтруктураСвойств", СтруктураСвойств) Тогда
		СтруктураСвойств = Новый Структура;
	КонецЕсли;
	
	Если Не ДопПараметры.Свойство("Режим", РежимЗаписиВложения) Тогда
		РежимЗаписиВложения = "СБИС";
	КонецЕсли;
	
	Кэш				= ПолучитьТекущийЛокальныйКэш();
	СоставПакета	= ДопПараметры.СоставПакета;
	
	Если РежимЗаписиВложения = "Сопоставление" Тогда
		
		//Дополним данными пакета и вложения
		СтруктураСвойств.Вставить("ДокументСБИС_Ид",			СоставПакета.Идентификатор);
		СтруктураСвойств.Вставить("ДокументСБИС_Статус",		СоставПакета.Состояние.Название);
		СтруктураСвойств.Вставить("ДокументСБИС_ИдВложения",	ВложениеСБИС.Идентификатор);
				
	ИначеЕсли РежимЗаписиВложения = "ЗаписьСвойств" Тогда
		
		Если Не ЗначениеЗаполнено(СтруктураСвойств) Тогда
			Возврат;
		КонецЕсли;
		
	Иначе
		
		ОшибкаЗаписи = НовыйСбисИсключение(735, "МодульОбъектаКлиент.ВложениеСБИС_Записать",,, "Режим записи " + РежимЗаписиВложения + " не определен.");
		ВызватьИсключение СбисИсключение_Представление(ОшибкаЗаписи);
		
	КонецЕсли;

	ДопПараметрыАккаунта = Новый Структура("ИдАккаунта", Кэш.Интеграция.ПолучитьИдТекущегоАккаунта(Кэш));
	ФормаЗаписи = ГлавноеОкно.сбисНайтиФормуФункции("ЗаписатьПараметрыДокументаСБИС", Кэш.ФормаРаботыСоСтатусами, "", Кэш);
	
	Если ДопПараметры.Свойство("Документ1С") Тогда
		
		ФормаЗаписи.ЗаписатьПараметрыДокументаСБИС(СтруктураСвойств,
		ДопПараметры.Документ1С,
		Кэш.Ини.Конфигурация,
		Кэш.Парам.КаталогНастроек,
		ДопПараметрыАккаунта);  
		
		ВложениеСБИС_ЗаписатьСостояниеЭД(ДопПараметры.Документ1С, СоставПакета, ВложениеСБИС);
		
	Иначе
		
		Для Каждого Документ1С Из ВложениеСБИС_Получить(ВложениеСБИС, "Документы1С") Цикл
			
			ФормаЗаписи.ЗаписатьПараметрыДокументаСБИС(СтруктураСвойств,
			Документ1С,
			Кэш.Ини.Конфигурация,
			ПолучитьЗначениеПараметраСбис("КаталогНастроек"),
			ДопПараметрыАккаунта);  
			
			ВложениеСБИС_ЗаписатьСостояниеЭД(Документ1С, СоставПакета, ВложениеСБИС);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры 

// Процедура - заполняет текущий экземпляр класса от входных данных
//
// Параметры:
//  ВложениеСБИС	 - Структура	- (О) экземпляр класса
//  ДанныеЗаполнить	 - Структура	- (О) входные данные заполнить
//  КлючЗаполнить	 - Строка	 	- (Н) ключ входных данных, если это не класс (невозможно определить что за класс)
//
&НаКлиенте
Процедура ВложениеСБИС_Заполнить(ВложениеСБИС, ДанныеЗаполнить, КлючЗаполнить="ВложениеСБИС") Экспорт 
	Перем Документы1СВложения;
	
	Если КлючЗаполнить = "ВложениеСБИС" Тогда
		
		ВложениеСБИС_Заполнить_ПоВложениеСБИС(ВложениеСБИС, ДанныеЗаполнить);
						
	ИначеЕсли КлючЗаполнить = "Структура" Тогда
		
		СтруктураФайлаКонтрагента = ПолучитьФормуОбработки("Файл_Шаблон").НовыйСтруктураФайла(ВложениеСБИС);
		
	ИначеЕсли КлючЗаполнить = "Документ1С" Тогда
		
		Если ВложениеСБИС.Документы1С.НайтиПоЗначению(ДанныеЗаполнить) = Неопределено Тогда
			ВложениеСБИС.Документы1С.Добавить(ДанныеЗаполнить);
		КонецЕсли;
		
	ИначеЕсли ВложениеСбис.Свойство("Параметры") Тогда
		
		ВложениеСБИС.Параметры.Вставить(КлючЗаполнить, ДанныеЗаполнить);
		
	Иначе
		
		ВложениеСБИС.Вставить("Параметры", Новый Структура);
		ВложениеСбис.Параметры.Вставить(КлючЗаполнить, ДанныеЗаполнить);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - заполнить параметры перед расчетом по инишке: Входящий контекст + ручные изменения в объект
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - Структура с описанием обрабатываемого вложения
//  ДопПараметры - Структура/ФиксированнаяСтруктура	 - расширение метода
//
&НаКлиенте
Процедура ВложениеСБИС_ЗаполнитьПараметрыПередРасчетом(ВложениеСБИС, ДопПараметры = Неопределено) Экспорт
    Перем ВходящийКонтекстИни, ДополнительныеПоляКонтекста, РассчитываемыйОбъект, ЗаполнитьКонтекст;
	
	Если Не ДопПараметры = Неопределено Тогда
		
		ДопПараметры.Свойство("ПоляРассчета",			ДополнительныеПоляКонтекста);
		ДопПараметры.Свойство("РассчитываемыйОбъект",	РассчитываемыйОбъект);
		ДопПараметры.Свойство("ЗаполнитьКонтекст",		ЗаполнитьКонтекст);
		
	КонецЕсли;
	
	ОчиститьТекущий		= Истина;
	ЗаполнитьКонтекст	= (ЗаполнитьКонтекст = Истина);
	
	Если Не ВложениеСБИС.Свойство("ВходящийКонтекст", ВходящийКонтекстИни) Тогда

		ВложениеСБИС.Вставить("ВходящийКонтекст", Новый Структура("РассчитанноеЗначение", Новый Структура));
		ЗаполнитьКонтекст = Истина;
		
	КонецЕсли;
	
	Если ЗаполнитьКонтекст Тогда
		
		ВложениеСБИС_ЗаполнитьПараметрыПередРасчетом_ВходящийКонтекст(ВложениеСБИС);
		
		ДанныеСторон = СоставПакета_Получить(ДопПараметры.СоставПакета, "ДанныеСторон");
		
		// Прокинуть данные сторон от пакета до вложения во входящий контекст, чтобы их можно было взять инишкой
		Если	ЗначениеЗаполнено(ДанныеСторон)
			И	ДоступнаПодстановкаСторонИзПакета(ДопПараметры.СоставПакета) Тогда
			
			ДанныеСторонДляДокумента1С	= Новый Структура;
			ДанныеДляПодготовки			= Новый Структура("ДанныеСторонСБИС, ДанныеСторон1С", ДанныеСторон, ДанныеСторонДляДокумента1С);
			ДопПараметрыПодготовки		= Новый Структура("ЕстьПартнеры", ИниПоПараметрам("Конфигурация").Свойство("Партнеры"));
			
			ПодготовитьСтороныКЗагрузкеДокумента(ДанныеДляПодготовки, ДопПараметрыПодготовки);
			
			ВложениеСБИС.ВходящийКонтекст.РассчитанноеЗначение.Вставить("ОрганизацияПоПакету",		ДанныеСторон.ДанныеОрганизации.Ссылка); 
			ВложениеСБИС.ВходящийКонтекст.РассчитанноеЗначение.Вставить("КонтрагентПоПакету",		ДанныеСторонДляДокумента1С.ДанныеКонтрагента); 
			ВложениеСБИС.ВходящийКонтекст.РассчитанноеЗначение.Вставить("ГрузополучательПоПакету",	ДанныеСторонДляДокумента1С.ДанныеГрузополучателя); 
			ВложениеСБИС.ВходящийКонтекст.РассчитанноеЗначение.Вставить("Партнер",					ДанныеСторонДляДокумента1С.ДанныеПартнера);
		
		КонецЕсли;
		
	КонецЕсли; 
	
	Если Не ДополнительныеПоляКонтекста = Неопределено Тогда
		
		Для Каждого КлючИЗначениеПолей Из ДополнительныеПоляКонтекста Цикл
			
			ВложениеСБИС.ВходящийКонтекст.РассчитанноеЗначение.Вставить(КлючИЗначениеПолей.Ключ, КлючИЗначениеПолей.Значение);
			
		КонецЦикла;
		
	КонецЕсли;	
	
	ВложениеСБИС_ЗаполнитьПараметрыПередРасчетом_РучныеПравки(ВложениеСБИС, РассчитываемыйОбъект);
	
КонецПроцедуры

// Функция - проверяет возможность загрузки вложения в 1С
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС				 - структура текущего вложения
//  ДопПараметры - Струкутра/Неопределено	 - структура, расширение
// 
// Возвращаемое значение:
//  Структура - описание, можем ли загрузить или нет.
//
&НаКлиенте
Функция ВложениеСБИС_МожемЗагрузитьВ1С(ВложениеСБИС, ДопПараметры = Неопределено) Экспорт
	
	Результат = Новый Структура("МожноЗагрузить, Проблемы, Статус", Ложь, Новый Структура, "");

	СтруктураИниФайла		= ВложениеСБИС_Получить(ВложениеСБИС, "УстановленныйПодразделИни");
	ДанныеФайла				= ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
	СтатусВложения			= ВложениеСБИС_Получить(ВложениеСБИС, "Статус");
	
	Если Не СтатусВложения = "Разобран" Тогда
		
		Результат.Статус = "Документ не разобран.";
		
	КонецЕсли;	
		
	Если	СтруктураИниФайла = Неопределено
		Или	ДанныеФайла = Неопределено Тогда
		
		Результат.Статус = "Загрузка документа не поддерживается.";
		
	ИначеЕсли СтатусВложения = "Ошибка" Тогда
		
		Результат.Статус = "Ошибка разбора документа.";
		
	Иначе
		
		Результат.МожноЗагрузить = Истина;
		
		ПараметрыНоменклатуры	= ВложениеСБИС_Получить(ВложениеСБИС, "ПараметрыНоменклатуры");
		Поля1С					= ВложениеСбис_Получить(ВложениеСБИС, "Поля1С");
		ОрганизацияВложения		= Поля1С.Организация.Значение;
		КонтрагентВложения		= Поля1С.Контрагент.Значение; 
		
		Если	Не	ЗначениеЗаполнено(ОрганизацияВложения)
			Или		ОрганизацияВложения = Ложь Тогда
			
			ПараметрыИни = ВложениеСБИС_Получить(ВложениеСБИС, "ПараметрыИни");
			
			// Для исходящих документов статус организации пока отключен.
			Если Не ПараметрыИни.Направление = "Исходящий" Тогда
				
				СтатусОрганизация	= "Не найдена организация.";
				Результат.Статус	= СокрЛП(Результат.Статус + " " + СтатусОрганизация);
				Результат.Проблемы.Вставить("Организация", СтатусОрганизация);
				
			КонецЕсли;

		КонецЕсли;
		
		Если	СтруктураИниФайла.Свойство("Контрагент_Роль")
			И	(	Не	ЗначениеЗаполнено(КонтрагентВложения)
				ИЛИ		КонтрагентВложения = Ложь) Тогда
				
			СтатусКонтрагент	= "Не найден контрагент.";	
			Результат.Статус	= СокрЛП(Результат.Статус + " " + СтатусКонтрагент);
			Результат.Проблемы.Вставить("Контрагент", СтатусКонтрагент);
			
		КонецЕсли;
			
		Если    ПараметрыНоменклатуры.НадоСопоставлять Тогда
			
			Если ПараметрыНоменклатуры.Сопоставлено Тогда
				
				СтатусНоменклатура = "Номенклатура сопоставлена.";
					
				
			Иначе
					
				СтатусНоменклатура = "Не вся номенклатура сопоставлена.";
				Результат.Проблемы.Вставить("Номенклатура", СтатусНоменклатура);
			
			КонецЕсли;
			
		Иначе
			
			СтатусНоменклатура = "Сопоставление не требуется.";
			
		КонецЕсли;
		
		Результат.Статус = СокрЛ(Результат.Статус + " " + СтатусНоменклатура);
			
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции
	
// Процедура - обновляет вложение СБИС по новым данным
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - структура вложения
//  Изменения	 - Струкутра	 - с изменениями
//  ДопПараметры - Структура	 - расширение
//
&НаКлиенте
Процедура ВложениеСБИС_Обновить(ВложениеСБИС, Изменения, ДопПараметры = Неопределено) Экспорт
	Перем ТекущиеИзменения;
	
	Если ТипЗнч(Изменения) = Тип("Файл") Тогда
		
		ВложениеСБИС.Вставить("ИмяФайла",		Изменения.Имя);
		ВложениеСБИС.Вставить("ПолноеИмяФайла",	Изменения.ПолноеИмя);
	
	ИначеЕсли	Изменения.Свойство("Номенклатура", ТекущиеИзменения) Тогда
		
		ВложениеСБИС_Обновить_Номенклатура(ВложениеСБИС, ТекущиеИзменения);
		ВложениеСБИС.Вставить("Перегенерировать", Истина);
		
	ИначеЕсли	Изменения.Свойство("Статус", ТекущиеИзменения) Тогда 
		
		ВложениеСБИС_Обновить_Статус(ВложениеСБИС, ТекущиеИзменения, ДопПараметры);
		
	ИначеЕсли Изменения.Свойство("ПодразделИни", ТекущиеИзменения) Тогда
		
		ВложениеСБИС_Обновить_ПодразделИни(ВложениеСБИС, ТекущиеИзменения, ДопПараметры);

	ИначеЕсли Изменения.Свойство("Поля1С") Тогда
		
		ВложениеСБИС_Обновить_Поля1С(ВложениеСБИС, Изменения, ДопПараметры);
		
	ИначеЕсли	Изменения.Свойство("СтрокаФормыПросмотра", ТекущиеИзменения) Тогда
		
		ВложениеСБИС.Параметры.Вставить("МожемЗагрузитьВ1С", Булево(ТекущиеИзменения.МожемЗагрузитьВ1С));
		
	ИначеЕсли	Изменения.Свойство("Организация")
		ИЛИ		Изменения.Свойство("Контрагент")
		ИЛИ		Изменения.Свойство("Грузополучатель") Тогда
		
		ВложениеСБИС_Обновить_Сторона(ВложениеСБИС, Изменения);
		
	ИначеЕсли Изменения.Свойство("ПеречитатьВизуализацию") Тогда
		
		ВложениеСБИС.Удалить("ТекстHTML");
		
		Визуализация = ВложениеСБИС_Получить(ВложениеСБИС, "ВизуализацияДокумента");
		ДанныеЗаполнить = Новый Структура("ТекстHTML", Визуализация);
		
		ВложениеСБИС_Заполнить(ВложениеСБИС, ДанныеЗаполнить);
		
	ИначеЕсли Изменения.Свойство("ПараметрыДокумента", ТекущиеИзменения) Тогда	
		
		ВложениеСБИС_Обновить_ПараметрыДокумента(ВложениеСБИС, ТекущиеИзменения);
		ВложениеСБИС.Вставить("Перегенерировать", Истина);
		
	ИначеЕсли Изменения.Свойство("Подпись", ТекущиеИзменения) Тогда	
		
		ВложениеСБИС.Вставить("Подпись", ТекущиеИзменения);  
		
	ИначеЕсли Изменения.Свойство("ТабличныеДанные") Тогда   
		
		ВложениеСБИС_ОбновитьТабличныеДанные(ВложениеСБИС, Изменения);
        
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - читает данные XML вложения, приводит к объекту 1С. Заполняет поля:
//		XMLДокумента				 - Строка		 - прочитанные исходные данные титула вложения
//		СтруктураФайла				 - Структура	 - приведенные к известному формату (3.01/3.03) данные XML и разложенные парсером
//		ВерсияФорматаДляЗагрузки	 - Строка		 - значение ВерсияФормата из СтруктураФайла
//		ФорматДляЗагрузки			 - Строка    	 - значение Формат из СтруктураФайла
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - экземпляр класса вложения
//  ДопПараметры - Структура	 -расширение. Возможные поля:
//		СоставПакета - СоставПакета - основной документ СБИС, к которому принадлежит вложение
//
&НаКлиенте
Процедура ВложениеСБИС_ПрочитатьДанные(ВложениеСБИС, ДопПараметры) Экспорт
	Перем Файл_Формат, Файл_ВерсияФормата;
	
	Если ВложениеСБИС.Свойство("XMLДокумента") Тогда
		
		// Уже прочитано
		Возврат;
		
	КонецЕсли;
	
	ВложениеСБИС.Вставить("XMLДокумента", "");
	
	ПараметрыОписаниеИни	= ВложениеСБИС_Получить(ВложениеСБИС, "ПараметрыИни");
	Если Не ЗначениеЗаполнено(ПараметрыОписаниеИни.Тип) Тогда
		
		// Это документ, который точно не умеем грузить, пропускаем.
		Возврат;
		
	КонецЕсли;
	
	ФайлВложение		= ВложениеСБИС_Получить(ВложениеСБИС, "Файл");
	ИнтеграцияМодуль	= ПолучитьЗначениеПараметраСбис("Интеграция");
	СбисОбщиеФункции	= ПолучитьЗначениеПараметраСбис("ФункцииДокументов");
	Кэш					= ПолучитьТекущийЛокальныйКэш();
	ПолныйСоставПакета	= ДопПараметры.СоставПакета;
	
	XMLИсходногоФайла	= ВложениеСБИС_Получить(ВложениеСБИС, "ДанныеФайла");
	XMLФайла			= ВырезатьИсключенияXMLВложения(XMLИсходногоФайла);
	
	ЕстьXSLT	= Ложь;
	ИмяXSLT		= "";
	
	Файл_Формат			= СбисОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(ВложениеСБИС.Тип);
	ПодТип				= СбисОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(ВложениеСБИС.ПодТип);
	Файл_ВерсияФормата	= СбисОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(ВложениеСБИС.ВерсияФормата);		
	СтруктураФайла		= Новый Структура;
	
	Если ЗначениеЗаполнено(Файл_Формат) и ЗначениеЗаполнено(XMLФайла) Тогда
		ИмяXSLT	= СбисОбщиеФункции.СбисФорматСтроки(Файл_Формат + "_" + ПодТип + "_" + Файл_ВерсияФормата, "КлючСтруктуры");
		ЕстьXSLT = ЗначениеЗаполнено(XSLTПоПараметрам(ИмяXSLT));
		
		ОшибкаПреобразования= Ложь;
		ДопПараметрыXSLT	= Неопределено;
		Если Кэш.Парам.РежимОтладки Тогда
			
			ДопПараметрыXSLT = Новый Структура;
			ДопПараметрыXSLT.Вставить("Название", СбисОбщиеФункции.сбисФорматКаталога("Загрузка", Кэш.ПараметрыСистемы.Клиент));
			
			Если ПолныйСоставПакета.Свойство("Название") Тогда
				
				ДопПараметрыXSLT.Название = ПрименитьФорматКСтроке(ДопПараметрыXSLT.Название, ПолныйСоставПакета.Название, "Каталог");
				
			КонецЕсли;
			
		КонецЕсли;
		
		XMLФайла = СбисОбщиеФункции.сбисПрименитьXSLT(Кэш, XMLФайла, ИмяXSLT, ДопПараметрыXSLT, ОшибкаПреобразования);
		
		Если ОшибкаПреобразования Тогда
			
			Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, XMLФайла);
			XMLФайла = "";
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Файл_ВерсияФормата) Тогда
			
			ВложениеСБИС.XMLДокумента = XMLИсходногоФайла;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(XMLФайла) Тогда
			
			Попытка
				
				СтруктураФайла	= СбисОбщиеФункции.ЗаполнитьСтруктуруФайла(XMLФайла);
				
			Исключение
				
				//Возможна ошибка транспорта строки не XML вложений на УФ
				СтруктураФайла	= Новый Структура;
				XMLФайла		= "";
				
			КонецПопытки;
			
		КонецЕсли;
		
	Иначе
		
		XMLФайла= "";
		
	КонецЕсли;
	
	//Пробуем преобразовать XML только если он есть, дабы избежать лишних вызовов сервера
	ВложениеСБИС.Вставить("СтруктураФайла", СтруктураФайла);
	Если	ЕстьXSLT 
		И	СтруктураФайла.Свойство("Файл")
		И	СтруктураФайла.Файл.Свойство("Формат")
		И	СтруктураФайла.Файл.Свойство("ВерсияФормата") Тогда
		
		Файл_Формат			= СбисОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(СтруктураФайла.Файл.Формат);
		Файл_ВерсияФормата	= СбисОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(СтруктураФайла.Файл.ВерсияФормата);
		
	ИначеЕсли ЗначениеЗаполнено(XMLФайла) Тогда	// XMLФайла может быть пустым, если вложение не удалось расшифровать
		
		Файл_Формат			= СбисОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(ВложениеСБИС.Тип);
		Файл_ВерсияФормата	= СбисОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(ВложениеСБИС.ВерсияФормата);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ВложениеСБИС.Вставить("ФорматДляЗагрузки",			Файл_Формат);
	ВложениеСБИС.Вставить("ВерсияФорматаДляЗагрузки",	Файл_ВерсияФормата);
	
КонецПроцедуры

//Функция возвращает разобрынные данные вложения XMLДокумента, СтруктураФайла, ФорматДляЗагрузки, ВерсияФорматаДляЗагрузки
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - Структура, описывает вложение в Документ СБИС
//  ДопПараметры - Структура	 - параметры расширения
//		СоставПакета	- ДокументСБИС, к которому относится вложение.
//		Просмотр		- булево (Ложь), определяет необходимость определения полей для редактирования, типов и всего необходимого для интерфейса
//
&НаКлиенте
Процедура ВложениеСБИС_РазобратьДляЗагрузки(ВложениеСБИС, ДопПараметры) Экспорт
	Перем ПоляВходящегоКонтекста;
	
	СтатусВложения = ВложениеСБИС_Получить(ВложениеСБИС, "Статус");
	Если СтатусВложения = "Ошибка" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ВложениеСБИС.Свойство("Параметры") Тогда
		
		ПараметрыВложения = Новый Структура;
		ПараметрыВложения.Вставить("Просмотр",						Ложь); // Документ формируется для формы просмотра
		ПараметрыВложения.Вставить("ВозможноРедактироватьДокумент", Ложь); // В ини установлена возможность редактировать документ (не перезаполняя его)
		ПараметрыВложения.Вставить("РедактироватьТабЧасть",			Ложь); // Установлена возможность редактировать табличную часть (не перезаполняя)
		ПараметрыВложения.Вставить("РедактироватьДокумент",			Ложь); // Установлен документ в редактируемых полях и есть возможность редактировать
		ПараметрыВложения.Вставить("СопоставлятьПередЗагрузкой",	Ложь); // Сопоствлять ли документ перед загрузкой, или нет.
		ВложениеСБИС.Вставить("Параметры", ПараметрыВложения);
		
	КонецЕсли;
	
	Если	ДопПараметры.Свойство("Просмотр")  Тогда
		
		ВложениеСБИС.Параметры.Просмотр = ДопПараметры.Просмотр;
		
	КонецЕсли;
	
	Попытка
		
		ВложениеСБИС_ПрочитатьДанные(ВложениеСБИС, ДопПараметры);
		ВложениеСБИС_УстановитьИниЗагрузки(ВложениеСБИС, ДопПараметры);
		
	Исключение
		
		ОшибкаРазбора = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ВложениеСБИС_РазобратьДляЗагрузки");
		ВложениеСБИС_Обновить(ВложениеСБИС, Новый ФиксированнаяСтруктура("Статус", ОшибкаРазбора));
		Возврат;
		
	КонецПопытки;
	
КонецПроцедуры

// Функция - получить значение по ключу от вложения
//
// Параметры:
//  ВложениеСбис			 - ВложениеСБИС	 - экземпляр, от которого надо получить значение
//  КлючПараметраПолучить	 - Строка		 - что хотим получить ПараметрыДанныхВложения, УстановленныйПодразделИни
//  ДопПараметры			 - Структура	 - Расширение
// 
// Возвращаемое значение:
//  Произвольный - Найденное значение. Неопределено, если ничего
//
&НаКлиенте
Функция ВложениеСБИС_Получить(ВложениеСбис, КлючПараметраПолучить, ДопПараметры = Неопределено) Экспорт
	Перем Результат, лПромежуточноеЗначение;
	
	Если		КлючПараметраПолучить = "ПараметрыИни"
			Или	КлючПараметраПолучить = "ПараметрыДанныхВложения" Тогда
		
		Возврат ВложениеСБИС_Получить_ПараметрыИни(ВложениеСБИС, ДопПараметры);
			
	ИначеЕсли КлючПараметраПолучить = "СтруктураФайла" Тогда
		
		// Считаем структурой файла структуру документа по данным 1С.
		Если	Не ВложениеСбис.Свойство("СтруктураФайла",		Результат)
			И	Не ВложениеСбис.Свойство("СтруктураДокумента",	Результат) Тогда 
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	ИначеЕсли	КлючПараметраПолучить = "Название" Тогда
		
		Если Не ВложениеСбис.Свойство("Название", Результат) Тогда 
			
			СтруктураФайла = ВложениеСБИС_Получить(ВложениеСбис, "СтруктураФайла");
			Если Не СтруктураФайла = Неопределено Тогда
			
				Результат = Результат.Файл.Имя;
				
			Иначе
				
				Результат = "";
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли	КлючПараметраПолучить = "Идентификатор" Тогда
		
		Если	Не ВложениеСбис.Свойство("Идентификатор", Результат)
			Или	Не ЗначениеЗаполнено(Результат) Тогда 
			
			Результат = ВложениеСБИС_Получить(ВложениеСбис, "Название");
			
        КонецЕсли;

	ИначеЕсли	КлючПараметраПолучить = "ТипВерсияВложения" Тогда

		//Если ЗначениеЗаполнено(ВложениеСБИС_Получить(ВложениеСбис, "XMLДокумента")) Тогда
			
			ПараметрыИни	= ВложениеСБИС_Получить(ВложениеСбис, "ПараметрыИни");
			Результат		= ПараметрыИни.Тип + "_" + ПараметрыИни.Версия;
			Результат		= СтрЗаменить(Результат, ".", "_");
			
		//КонецЕсли;
 
	ИначеЕсли	КлючПараметраПолучить = "ФайлИни" Тогда
		
		//Возвращает полную инишку для обработки вложения
		ИмяУстановленнойИни = ВложениеСБИС_Получить(ВложениеСБИС, "ИмяИни");
		
		Если ИмяУстановленнойИни = Неопределено Тогда
			
			Возврат ИниПоПараметрам(Новый Структура("Вложение", ВложениеСБИС));
			
		КонецЕсли;
		
		Возврат ИниПоПараметрам(ИмяУстановленнойИни);

	ИначеЕсли	КлючПараметраПолучить = "УстановленныйПодразделИни"
			Или	КлючПараметраПолучить = "СтруктураИниФайла" Тогда
		
		//Возвращает подраздел инишки вложения, который на текущий момент установлен для обработки
		ВложениеСбис.Свойство("СтруктураИниФайла", Результат);

	ИначеЕсли	КлючПараметраПолучить = "ПодходящийДокумент" Тогда
		
		// Возвращает подходищий по данным и установленному подразделу инишки документ
		Возврат ВложениеСБИС_ПодходящийДокумент(ВложениеСбис, ДопПараметры);
						
	ИначеЕсли	КлючПараметраПолучить = "Зашифрован" Тогда
		
		Возврат ВложениеСбис.Зашифрован = "Да";
		
	ИначеЕсли	КлючПараметраПолучить = "ДанныеФайла" Тогда
		
		Возврат ВложениеСБИС_ДанныеФайла(ВложениеСбис);
		
	ИначеЕсли	КлючПараметраПолучить = "СторонаПоРоли" Тогда
		
		Возврат ВложениеСБИС_СторонаПоРоли(ВложениеСбис, ДопПараметры);
		
	ИначеЕсли	КлючПараметраПолучить = "Поля1С" Тогда
		
		Возврат ВложениеСБИС_Получить_Поля1С(ВложениеСбис, ДопПараметры);
		
	ИначеЕсли	КлючПараметраПолучить = "РассчитанныйОбъект" Тогда
		
		Возврат ВложениеСБИС_РассчитанныйОбъект(ВложениеСбис, ДопПараметры);
		
	ИначеЕсли	КлючПараметраПолучить = "ТипОбъекта" Тогда
		
		Возврат ВложениеСБИС_Получить_ТипОбъекта(ВложениеСбис, ДопПараметры);

	ИначеЕсли	КлючПараметраПолучить = "Статус" Тогда
		
		Если ВложениеСбис.Свойство("СтатусыВложения") Тогда
			
			ВложениеСбис.СтатусыВложения.Свойство("Общий", Результат);
			
		КонецЕсли;
		
	ИначеЕсли КлючПараметраПолучить = "Модифицирован" Тогда
		
		Если НЕ ВложениеСбис.Свойство(КлючПараметраПолучить, Результат) Тогда
			Результат = Ложь;
		КонецЕсли;
		
	ИначеЕсли	КлючПараметраПолучить = "ТипВложения" Тогда 			

		СтруктураФайла = ВложениеСБИС_Получить(ВложениеСбис, "СтруктураФайла");	   
		
		Если ЗначениеЗаполнено(СтруктураФайла) Тогда
			
			// Пока как костыль берем формат от структуры файла, если по какой-то причине не заполнено на вложении. 
			Результат = СтруктураФайла.Файл.Формат;
			
		Иначе
			
			Результат = ПрименитьФорматКСтроке(ВложениеСбис.Тип, "-", "убрать");
			
		КонецЕсли;
				
	ИначеЕсли	КлючПараметраПолучить = "СтруктураРучныхПравок" Тогда
		
		Результат = Новый Структура;
		Если ВложениеСбис.Параметры.Свойство("РедактируемыеПоля") Тогда
			
			Для Каждого РучноеПоле Из ВложениеСбис.Параметры.РедактируемыеПоля Цикл
				
				Если	    РучноеПоле.Значение = Неопределено
					Или	Не	РучноеПоле.Значение.Свойство("Путь")
					Или		РучноеПоле.Значение.Путь = Неопределено Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				Результат.Вставить(РучноеПоле.Значение.Путь, РучноеПоле.Значение.Значение);
				
			КонецЦикла;
			
		КонецЕсли;

	ИначеЕсли	КлючПараметраПолучить = "ТекстHTML"
			Или	КлючПараметраПолучить = "ВизуализацияДокумента" Тогда
			
		Возврат ВложениеСБИС_Получить_ВизуализацияДокумента(ВложениеСБИС, ДопПараметры);	
			
	ИначеЕсли КлючПараметраПолучить = "ОбновитьВизуализацию" Тогда
		
		Если НЕ ВложениеСбис.Свойство(КлючПараметраПолучить, Результат) Тогда
			Результат = Ложь;
		КонецЕсли;
		
	ИначеЕсли КлючПараметраПолучить = "ПараметрыНоменклатуры" Тогда
		
		ПараметрыВложения = ВложениеСБИС_Получить(ВложениеСБИС, "Параметры");
		Если		ПараметрыВложения = Неопределено
			Или	Не	ПараметрыВложения.Свойство("Номенклатура", Результат)Тогда
			
			Возврат Неопределено;
			
		КонецЕсли;

	Иначе
		
		ВложениеСбис.Свойство(КлючПараметраПолучить, Результат);
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Процедура - патчит новое сопоставление на выбранное вложение
//
// Параметры:
//  Вложение	 - ВложениеСБИС	 - структура вложения, которое патчится
//  ДопПараметры - Структура	 - расширение
//
&НаКлиенте
Процедура ВложениеСБИС_ПропатчитьНовымСопоставлением(Вложение, ДопПараметры = Неопределено) Экспорт		
	
	МестныйКэш = ПолучитьТекущийЛокальныйКэш();							
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	Если Вложение.Свойство("КлассыСопоставленияНоменклатур") 
		И Вложение.Параметры.НоменклатураСопоставлена Тогда
		НаборСопоставлений = Вложение.КлассыСопоставленияНоменклатур;
	Иначе
		// 1. Получим ТаблДоки в исходном виде из вложений и сформируем от них набор классов сопоставления номенклатуры. 
		// По возможности попытаемся их обогатить через "Массовый поиск"
		///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		ФормыПоиска = Новый Массив;
		ФормыПоиска.Добавить("Файл_Шаблон");
		
		фрм = НайтиФункциюСеансаОбработки("СформироватьНаборСопоставленийНоменклатурыПоТабличнойЧасти", ФормыПоиска);
		
		Если НЕ фрм = Ложь Тогда  
			НаборСопоставлений = фрм.СформироватьНаборСопоставленийНоменклатурыПоТабличнойЧасти(Вложение, МестныйКэш, ДопПараметры);
		Иначе
			ВызватьСбисИсключение(, "МодульОбъектаКлиент.ПропатчитьВложенияНовымСопоставлением",,,"Не найдена форма работы с форматом документа");
		КонецЕсли;
		
		Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("РежимОтладки") Тогда
			
			ДанныеЛогирования = Новый Структура;
			ДанныеЛогирования.Вставить("Тип", 			"СопоставлениеНоменклатуры");
			ДанныеЛогирования.Вставить("Идентификатор", МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "Название"));
			ДанныеЛогирования.Вставить("Вызов", 		НаборСопоставлений);
			ДанныеЛогирования.Вставить("Модуль", 		"Файл_Шаблон");
			
			МодульОбъектаКлиент().СохранитьОтладочныеДанныеСБИС(ДанныеЛогирования);
			
		КонецЕсли;
		
	КонецЕсли;   
	
	// 2. В полученных классах произведем пересчет по коэффициенту единиц измерения
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	Если ДопПараметры.Свойство("ПересчетПоДокументуОснованию") Тогда
		МестныйКэш.ОбщиеФункции.ПересчетПоКоэффициентамЕдиницИзмерения(НаборСопоставлений, "Выгрузка");	
	Иначе	
		МестныйКэш.ОбщиеФункции.ПересчетПоКоэффициентамЕдиницИзмерения(НаборСопоставлений, "Загрузка");
	КонецЕсли;
	МестныйКэш.ОбщиеФункции.ПересчетНДСПоДаннымСтрокиСопоставления(НаборСопоставлений); 
	Вложение.Вставить("КлассыСопоставленияНоменклатур", НаборСопоставлений); 
	НоменклатураСопоставлена = СопоставлениеНоменклатуры_ВсеНоменклатурыСопоставлены(НаборСопоставлений);
	Вложение.Параметры.Вставить("НоменклатураСопоставлена", НоменклатураСопоставлена);
	// 3. Обновленные данные выгрузим в ТаблДок и запишем его на вложение.
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ТаблДокНаОсновеКлассов = ВложениеСБИС_Выгрузить(Вложение, , ДопПараметры);
	
	Если Не ТаблДокНаОсновеКлассов.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Если Вложение.Свойство("СтруктураФайла") Тогда
		Вложение.СтруктураФайла.Файл.Документ.ТаблДок.Вставить("СтрТабл", ТаблДокНаОсновеКлассов);
	ИначеЕсли Вложение.СтруктураДокумента.Файл.Документ.Свойство("ТаблДок") Тогда
		Вложение.СтруктураДокумента.Файл.Документ.ТаблДок.Вставить("СтрТабл", ТаблДокНаОсновеКлассов);
	Иначе
		Вложение.СтруктураДокумента.Файл.Документ.СписокСтрТабл.Вставить("СтрТабл", ТаблДокНаОсновеКлассов);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - удаляет выбранные узлы из структуры данных (разобранные данные файла, или прочитанные данные документа)
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - Структура, вложение в которое устанавливаем параметры
//  УдаляемыеУзлы - Массив	 - Путь к удаляемым узлам в виде строки, через "."
//
&НаКлиенте
Процедура ВложениеСБИС_УдалитьУзлыИзСтруктурыДанных(ВложениеСБИС, УдаляемыеУзлы) Экспорт 
	
	ДанныеОчистить = МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
	Если ДанныеОчистить = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	МодульФункции = ПолучитьЗначениеПараметраСбис("ФункцииДокументов");
	// Удаление лишнего
	Для Каждого ПутьУзла Из УдаляемыеУзлы Цикл
		
		РазобранныйПутьУзла = Новый СписокЗначений;
		РазобранныйПутьУзла.ЗагрузитьЗначения(МодульФункции.РазбитьСтрокуВМассивНаКлиенте(ПутьУзла, "."));
		
		УдалитьУзелИзСтруктурыДанных(ДанныеОчистить, РазобранныйПутьУзла);

	КонецЦикла;
	
	
КонецПроцедуры

// ПЕРЕСМОТРЕТЬ место кода
// Функция - Получает структуру документа 1С по пакету СБИС
//
// Параметры:
//  ОписаниеПроверки - 	 - 
//  ДопПараметры	 - 	 - 
// 
// Возвращаемое значение:
//  ФайлДокумент - структура прочитанного документа
//
&НаКлиенте
Функция ПолучитьСтруктуруДокумента1СПоПакетуСбис(ОписаниеПроверки, ДопПараметры) Экспорт

	Кэш							= ГлавноеОкно.Кэш;
	Вложение					= ОписаниеПроверки.Вложение;
	СоставПакета				= ОписаниеПроверки.СоставПакета;
	ДанныеДокумента				= Новый Структура();
	СоответствиеДокументДанные	= Новый Соответствие;

	Если ОписаниеПроверки.Свойство("Документ1С") Тогда
		
		ПодготовитьСоответствиеРасхожденияДокумент1С_Вложение(Вложение, ОписаниеПроверки.Документ1С, СоответствиеДокументДанные);
		
	Иначе
		// TODO Это условие не имеет смысла, т.к. код дальше работать не будет, если зайдет сюда
		
		// Если документа нет, то проверить на вложении
		Для Каждого Документ1С Из Вложение.Документы1С Цикл
			
			ПодготовитьСоответствиеРасхожденияДокумент1С_Вложение(Вложение, Документ1С.Значение, СоответствиеДокументДанные);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не СоответствиеДокументДанные.Количество() Тогда
		
		МодульОбъектаКлиент().ВызватьСбисИсключение("Не найден файл для формирования расхождения " + Вложение.Название, "МодульОбъектаКлиент.ПолучитьСтруктуруДокумента1СПоПакетуСбис");
		
	КонецЕсли;
	
	// TODO Устаревшая странная хрень. Используется, потому что в ПодготовитьСоответствиеРасхожденияДокумент1С_Вложение так же
	ДокументСтрокой = ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.ПолучитьИмяИСПоСсылке(ОписаниеПроверки.Документ1С);
	ИмяИни = СтрПолучитьСтроку(СтрЗаменить(ДокументСтрокой, ".", Символы.ПС), 2);
	
	НовыйСоставПакета = Новый СписокЗначений;
	НовыйСоставПакета.Добавить(ОписаниеПроверки.Документ1С, ИмяИни);
	
	Контекст = Новый Структура("МассивПакетов", Новый Массив);
	//Кэш.КэшЗначенийИни.ТекущийПакет.Вставить("СоответствиеДокументДанные", СоответствиеДокументДанные);
	
	Кэш.ОбщиеФункции.ПолучитьДанныеДокументов1С(СоответствиеДокументДанные, Кэш.КэшЗначенийИни, НовыйСоставПакета, Кэш.Парам);
	Если	Не Кэш.ОбщиеФункции.ОбработатьДанныеДокументов1С(Кэш, Контекст, НовыйСоставПакета, СоответствиеДокументДанные)
		Или	Не ЗначениеЗаполнено(Контекст.МассивПакетов) Тогда
		ВызватьСбисИсключение(745, "МодульОбъектаКлиент.ПолучитьСтруктуруДокумента1СПоПакетуСбис",,, "Документ " + НовыйСоставПакета[0].Значение + " не обработан");
	КонецЕсли;  
                 
	ДанныеРезультат = Контекст.МассивПакетов[0];
	Если	Не ДанныеРезультат.Количество()
		Или Не ЗначениеЗаполнено(ДанныеРезультат)
		Или	Не ДанныеРезультат.Свойство("Вложение")
		Или	Не ДанныеРезультат.Вложение.Количество() Тогда;                       
		ВызватьСбисИсключение(745, "МодульОбъектаКлиент.ПолучитьСтруктуруДокумента1СПоПакетуСбис",,, "Не удалось сформировать " + Вложение.Тип + " от " + НовыйСоставПакета[0].Значение);
	КонецЕсли;
	
	Возврат ДанныеРезультат.Вложение[0].СтруктураДокумента.Файл.Документ;
	
КонецФункции

