
// Функция - создает новые вложение СБИС
//
// Параметры:
//  ВходящиеПараметры	 - Структура	 - входные параметры
//  ДопПараметры		 - Структура	 - расширение
// 
// Возвращаемое значение:
//  ВложениеСБИС - Структура с параметрами и данными вложения
//
&НаКлиенте
Функция НовыйВложениеСБИС(ВходящиеПараметры = Неопределено, ДопПараметры = Неопределено) Экспорт 
	Перем ОписаниеТипаНаследование, Документы1СВложения;
	
	СтруктураВложения = ВложениеСБИС_Пустой();
	
	Если ДопПараметры = Неопределено Тогда
		
		ДопПараметры = Новый Структура;
		
	КонецЕсли;
	
	Если ДопПараметры.Свойство("_класс", ОписаниеТипаНаследование) Тогда
		
		Если Не Найти(СтруктураВложения._класс, ОписаниеТипаНаследование) Тогда
			
			СтруктураВложения._класс = ОписаниеТипаНаследование + Символы.ПС + СтруктураВложения._класс;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если	Не	ВходящиеПараметры = Неопределено Тогда
		
		Если		ЭтоТипСбис(ВходящиеПараметры, СтруктураВложения._класс) Тогда
		
			ВложениеСБИС_Заполнить(СтруктураВложения, ВходящиеПараметры, СтруктураВложения._класс);
			
		ИначеЕсли	ВходящиеПараметры.Свойство("ДокументФайл")
				И	ВходящиеПараметры.Свойство("ГрязныйИни") Тогда
				
			НовыйВложениеСБИС_ЗаполнитьПоДокументФайл(СтруктураВложения, ВходящиеПараметры, ДопПараметры);

		ИначеЕсли	ДопПараметры.Свойство("КлючЗаполнить") Тогда
			
			ВложениеСБИС_Заполнить(СтруктураВложения, ВходящиеПараметры, ДопПараметры.КлючЗаполнить);

		ИначеЕсли	ВходящиеПараметры.Свойство("Документ1С") Тогда
			
			// TODO переделать ПолучитьСтруктуруДокумента1СПоПакетуСбис в заполнение вложения по документу 1С
			ПараметрыИни = ВложениеСБИС_Получить(ДопПараметры.Вложение, "ПараметрыИни");
			ПараметрыЗаполнить = Новый ФиксированнаяСтруктура("Документ1С, ПараметрыИни", ВходящиеПараметры.Документ1С, ПараметрыИни);
			ВложениеСБИС_Заполнить(СтруктураВложения, ВходящиеПараметры, "ПоДокументу1С")
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Заполнить основание пакета, если прокинуто в доп. параметрах
	Если		ДопПараметры.Свойство("ОснованиеПакета")
		И   Не	СтруктураВложения.Документы1С.Количество() Тогда
		
		СтруктураВложения.Документы1С.Добавить(ДопПараметры.ОснованиеПакета);
		
	КонецЕсли;
		
	Возврат СтруктураВложения;
	
КонецФункции

// Процедура - Заполнение вложения СБИС по данным прочитанного файла
//
// Параметры:
//  ВложениеСБИС	 - ВложениеСБИС	 - Структура, экземпляр вложения для заполнения
//  ДанныеЗаполнить	 - Структура	 - Данные, по которым заполнить
//
&НаКлиенте
Процедура НовыйВложениеСБИС_ЗаполнитьПоДокументФайл(ВложениеСБИС, ДанныеЗаполнить, ДопПараметры)
	Перем ФайлДанные, ДокументДанные, СуммаВложения, НазваниеВложения;
	
	// Определить данные для заполнения вложения
	ДокументДанные = ДанныеЗаполнить.ДокументФайл;

	Если Не	ДокументДанные.Свойство("Файл",		ФайлДанные) Тогда
		
		// Нет свойства Файл, значит Документ сам по себе является данными, берем его для формирования
		ФайлДанные = ДокументДанные;
		
	КонецЕсли;
	ДанныеЗаполнить.Вставить("ФайлДанные", ФайлДанные);
	
	// Расчитать модули и точка входа перед формированием
	ВложениеСБИС_ЗаполнитьПоДокументФайл_МодулиВложения(ВложениеСБИС,				ДанныеЗаполнить);
	ВложениеСБИС_ЗаполнитьПоДокументФайл_ТочкаВходаПередФормированием(ВложениеСБИС,	ДанныеЗаполнить);
	
	Если Не	ФайлДанные.Свойство("Документ",		ДокументДанные) Тогда
		
		// Источник для забора Дата, Номер, Сумма, Название в грязной ини
		// Для пользовательских конвертов
		ДокументДанные  = Новый Структура;
		ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции").ЗаполнитьАтрибуты(
				ПолучитьТекущийЛокальныйКэш(),
				"Документ",
				ДанныеЗаполнить.ГрязныйИни,
				ДокументДанные);
		
	КонецЕсли;
	
	ДатаВложения	= ?(ДокументДанные.Свойство("Дата"),	ДокументДанные.Дата,			"");
	НомерВложения	= ?(ДокументДанные.Свойство("Номер"),	СокрЛП(ДокументДанные.Номер),	"");
	
	Если	Не ДанныеЗаполнить.Свойство	("СуммаВложения",	СуммаВложения)
		И	Не ДокументДанные.Свойство	("Сумма",			СуммаВложения) Тогда
		
		СуммаВложения = 0;
		
	КонецЕсли;	
	СуммаВложения		= Формат(СуммаВложения, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00");
	
	Если ДокументДанные.Свойство("Название", НазваниеВложения) Тогда
		
		НазваниеВложения = НазваниеВложения
							+ " № " +			НомерВложения
							+ " от " +			ДатаВложения
							+ " на сумму " +	СуммаВложения;
							
	Иначе
		
		НазваниеВложения	= "";
		
	КонецЕсли;
	
	ВложениеСБИС.Название				= НазваниеВложения;
	ВложениеСБИС.Дата					= ДатаВложения;
	ВложениеСБИС.Номер					= НомерВложения;
	ВложениеСБИС.Сумма					= СуммаВложения;
	ВложениеСБИС.Направление			= "Исходящий";
	ВложениеСБИС.Направление1С 			= "Исходящий";
	
	ВложениеСБИС_ЗаполнитьПоДокументФайл_РасчетныеПоля(ВложениеСБИС, ДанныеЗаполнить); 
	
	Если Не ЭтоТипСбис(ВложениеСБИС, "КонвертСБИС") Тогда
		
		// Если конверт, то сопоставления нет.
		ВложениеСБИС_ЗаполнитьПоДокументФайл_СопоставлениеНоменклатуры(ВложениеСБИС, ДанныеЗаполнить);
		ВложениеСБИС_ЗаполнитьПоДокументФайл_ОбратноеСопоставлениеНоменклатуры(ВложениеСБИС, ДанныеЗаполнить);
		
		ПропатчитьФайлВложенияСБИС(ВложениеСБИС, ДанныеЗаполнить);
		
	КонецЕсли;

	ВложениеСБИС_ЗаполнитьПоДокументФайл_ТочкаВходаПослеФормирования(ВложениеСБИС, ДанныеЗаполнить);
	
	Если ДопПараметры.Свойство("Контекст") Тогда
		
		Контекст = ДопПараметры.Контекст;
		Контекст.СоставПакета.Вложение.Добавить(ВложениеСБИС);
		
		ИмяФормыПоФормату	= "Файл_"	+ ПрименитьФорматКСтроке(ДанныеЗаполнить.ГрязныйИни.Файл_Формат,,"Убрать")
							+ "_"		+ ПрименитьФорматКСтроке(ДанныеЗаполнить.ГрязныйИни.Файл_ВерсияФормата,,"Убрать");
							
		ФормыТочки = Новый Массив;
		ФормыТочки.Добавить(ИмяФормыПоФормату);
		ФормыТочки.Добавить("Файл_Шаблон");
		
		ТочкаВходаВложение	= ПользовательскаяТочкаВхода("сбисПослеФормированияДокумента", ФормыТочки);
		Если Не ТочкаВходаВложение = Неопределено Тогда
			
			АргументыТочкиВхода = Новый Структура("Док, Кэш, Контекст", ДокументДанные, ПолучитьТекущийЛокальныйКэш(), ДопПараметры.Контекст);
			ВызватьПользовательскуюТочкуВхода(ТочкаВходаВложение, АргументыТочкиВхода);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Функция - формирует пустой экземпляр вложения СБИС
// 
// Возвращаемое значение:
//  Структура - объект с пустыми полями
//
&НаКлиенте
Функция ВложениеСБИС_Пустой()
	
	ВложениеСБИС = Новый Структура(
	"_класс, Идентификатор, Название, Направление, Направление1С, Тип, ПодТип, ВерсияФормата, ПодВерсияФормата, Дата, Номер, Сумма, Примечание,
	|Отправитель, Получатель, Ответственный, Подразделение, Регламент, ДокументОснование, Сертификат, Документы1С, Параметры",
	"ВложениеСБИС", "", "", "", "", "", "", "", "", "", "", "");
	ВложениеСБИС.Отправитель	= "Отправитель";
	ВложениеСБИС.Получатель		= "Получатель";
	ВложениеСБИС.Направление	= "Входящий";
	ВложениеСБИС.Направление1С  = "Входящий";
	ВложениеСБИС.Ответственный	= Новый Структура;
	ВложениеСБИС.Подразделение	= Новый Структура;
	ВложениеСБИС.Регламент		= Новый Структура;
	ВложениеСБИС.Сертификат		= Новый Структура;
	ВложениеСБИС.Параметры		= Новый Структура("ИспользоватьГенератор, ИспользоватьСопоставлениеНоменклатуры, НаборМодулейДляФормата, ФайлПерегенерируется", Ложь, Ложь, "", Ложь);
	
	ВложениеСБИС.ДокументОснование	= Новый Массив;
	ВложениеСБИС.Документы1С		= Новый СписокЗначений;

	Возврат ВложениеСБИС;
	
КонецФункции
	
