   
// Функция возвращает особенность учета номенклатуры, для использования при формировании кодов маркировки и параметра ТовГрМарк,
// для конфигураций, определяющих особенность учета в перечислении
//
// Параметры:
//  Контекст - Структура - контекст рассчитываемого документа
// 
// Возвращаемое значение:
//  Строка - текстовое значение особенности учета
//
&НаКлиенте
Функция ОсобенностьУчетаУТ(Контекст) Экспорт    
	
	Если НЕ ЗначениеЗаполнено(Контекст.ОсобенностьУчетаНоменклатуры) Тогда
		Возврат "";
	КонецЕсли;
	
	СбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "РассчитанныеЗначения.ОсобенностьУчетаНоменклатуры", Контекст.Номенклатура); 
	СбисОписаниеОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, СбисОписаниеОбъекта); 
	
	Если СбисОписаниеОбъекта.Значение = Неопределено Тогда
		
		СбисОписаниеОбъекта.Значение = ОсобенностьУчетаНоменклатурыУТ(Контекст.ОсобенностьУчетаНоменклатуры);  
		сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, СбисОписаниеОбъекта);
		
	КонецЕсли;
	
	Возврат ОсобенностьУчетаНоменклатурыПоИмени(СбисОписаниеОбъекта.Значение);  
	
КонецФункции  

// Функция возвращает особенность учета номенклатуры, для использования при формировании кодов маркировки и параметра ТовГрМарк,
// для конфигураций, определяющих особенность учета в перечислении
//
// Параметры:
//  ОсобенностьУчета - ПеречислениеСсылка - Рассчитанное значение перечисления
// 
// Возвращаемое значение:
//  Строка - Текстовое значение особенности учета
//
&НаСервере
Функция ОсобенностьУчетаНоменклатурыУТ(Знач ОсобенностьУчета) Экспорт  
		
	ИмяЗначения = МодульОбъектаСервер().СбисИмяЗначенияПеречисления(ОсобенностьУчета);    
	
	Возврат ИмяЗначения;
	
КонецФункции

&НаКлиенте
Функция ОсобенностьУчетаНоменклатурыПоИмени(ИмяЗначения)  
	
	ВидыПродукцииПоИСМП = ОсобенностьУчетаНоменклатурыИСМП();
	
	Результат = ВидыПродукцииПоИСМП.Получить(ИмяЗначения); 
	
	Если Результат = Неопределено Тогда
		
		Результат = "";
		
	КонецЕсли;
	
	Возврат Результат;  

КонецФункции  

// Функция возвращает особенность учета номенклатуры, для использования при формировании кодов маркировки и параметра ТовГрМарк,
// для конфигураций, определяющих особенность учета в реквизите элемента справочника
//
// Параметры:
//  Контекст - Структура - контекст рассчитываемого документа 
// 
// Возвращаемое значение:
//  Строка - текстовое значение особенности учета
//
&НаКлиенте
Функция ОсобенностьУчетаБП(Контекст) Экспорт  
	
 	СбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "РассчитанныеЗначения.ОсобенностьУчетаНоменклатуры", Контекст.Номенклатура); 
	СбисОписаниеОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, СбисОписаниеОбъекта); 
	
	Если СбисОписаниеОбъекта.Значение = Неопределено Тогда
		
		СбисОписаниеОбъекта.Значение = ОсобенностьУчетаНоменклатурыБП(Контекст.Номенклатура);  
		сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, СбисОписаниеОбъекта);
		
	КонецЕсли;
	
	Возврат СбисОписаниеОбъекта.Значение; 
	
КонецФункции

// Функция возвращает особенность учета номенклатуры, для использования при формировании кодов маркировки и параметра ТовГрМарк,
// для конфигураций, определяющих особенность учета в реквизите элемента справочника
//
// Параметры:
//  Номенклатура - СправочникСсылка - Ссылка на элемент справочника номенклатуры 
// 
// Возвращаемое значение:
//  Строка - Текстовое значение особенности учета
//
&НаСервере
Функция ОсобенностьУчетаНоменклатурыБП(Знач Номенклатура) Экспорт  
	
	ВидыПродукцииПоИСМП = ОсобенностьУчетаНоменклатурыИСМП();  
	
	ДопПараметрыПроверки = Новый Структура("НаборОбъектов, Объект", "Реквизиты", Номенклатура);
	
	Для Каждого ВидПродукции Из ВидыПродукцииПоИСМП Цикл
		
		Если МодульОбъектаСервер().СбисСуществуетОбъектКонфигурацииСервер(ВидПродукции.Ключ, ДопПараметрыПроверки)
			И Номенклатура[ВидПродукции.Ключ] Тогда 
			
			Возврат ВидПродукции.Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат "";
				
КонецФункции

// Функция возвращает особенность учета номенклатуры, для использования при формировании кодов маркировки и параметра ТовГрМарк,
// для конфигураций, определяющих особенность учета в реквизите элемента справочника
//
// Параметры:
//  Контекст - Структура - контекст рассчитываемого документа 
// 
// Возвращаемое значение:
//  Строка - текстовое значение особенности учета
//
&НаКлиенте
Функция ОсобенностьУчетаАА(Контекст) Экспорт  
	
 	СбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "РассчитанныеЗначения.ОсобенностьУчетаНоменклатуры", Контекст.Номенклатура); 
	СбисОписаниеОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, СбисОписаниеОбъекта); 
	
	Если СбисОписаниеОбъекта.Значение = Неопределено Тогда
		
		СбисОписаниеОбъекта.Значение = ОсобенностьУчетаНоменклатурыАА(Контекст.ТипНоменклатуры);  
		сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, СбисОписаниеОбъекта);
		
	КонецЕсли;
	
	Возврат СбисОписаниеОбъекта.Значение;
	
КонецФункции

// Функция возвращает особенность учета номенклатуры, для использования при формировании кодов маркировки и параметра ТовГрМарк,
// для конфигураций, определяющих особенность учета в реквизите элемента справочника
//
// Параметры:
//  ТипНоменклатуры - СправочникСсылка - Ссылка на элемент справочника типа номенклатуры 
// 
// Возвращаемое значение:
//  Строка - Текстовое значение особенности учета
//
&НаСервере
Функция ОсобенностьУчетаНоменклатурыАА(Знач ТипНоменклатуры) Экспорт  
	
	ВидыПродукцииПоИСМП = ОсобенностьУчетаНоменклатурыИСМП();  
	
	Если Не ЗначениеЗаполнено(ТипНоменклатуры.ТипМаркировки)
			Или ВидыПродукцииПоИСМП.Получить(ТипНоменклатуры.ТипМаркировки.Имя) = Неопределено Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Возврат ВидыПродукцииПоИСМП.Получить(ТипНоменклатуры.ТипМаркировки.Имя);
	
КонецФункции

// Функция - Возвращает перечень маркируемой продукции, оборот которой фиксируется в ИС МП.
// 
// Возвращаемое значение:
//  Соответствие - список видов маркируемой продукции ИСМП.
//
&НаКлиентеНаСервереБезКонтекста
Функция ОсобенностьУчетаНоменклатурыИСМП()  
	
	СоответствиеОсобенностиУчета = Новый Соответствие;    
	
	СоответствиеОсобенностиУчета.Вставить("ТабачнаяПродукция", "Табак"); 
	СоответствиеОсобенностиУчета.Вставить("Табак", "Табак");  
	СоответствиеОсобенностиУчета.Вставить("НикотиносодержащаяПродукция", "НикотиносодержащаяПродукция"); 
	СоответствиеОсобенностиУчета.Вставить("ОбувнаяПродукция", "Обувь");
    СоответствиеОсобенностиУчета.Вставить("Обувь", "Обувь"); 
	СоответствиеОсобенностиУчета.Вставить("ЛегкаяПромышленность", "ЛегкаяПромышленность"); 
	СоответствиеОсобенностиУчета.Вставить("ЛегкаяПромышленность2025", "ЛегкаяПромышленность"); 
	СоответствиеОсобенностиУчета.Вставить("Шины", "Шины"); 
	СоответствиеОсобенностиУчета.Вставить("Духи", "Духи");   
	СоответствиеОсобенностиУчета.Вставить("Фотоаппараты", "Фотоаппараты");   
	СоответствиеОсобенностиУчета.Вставить("МолочнаяПродукцияПодконтрольнаяВЕТИС", "Молоко"); 
    СоответствиеОсобенностиУчета.Вставить("МолочнаяПродукцияБезВЕТИС", "Молоко");  
	СоответствиеОсобенностиУчета.Вставить("Велосипеды", "Велосипеды"); 
	СоответствиеОсобенностиУчета.Вставить("КреслаКоляски", "КреслаКоляски");
	СоответствиеОсобенностиУчета.Вставить("МедицинскиеИзделия", "КреслаКоляски"); 
	СоответствиеОсобенностиУчета.Вставить("МедицинскиеИзделия20", "КреслаКоляски"); 
	СоответствиеОсобенностиУчета.Вставить("ТехническиеСредстваРеабилитации", "КреслаКоляски");
	СоответствиеОсобенностиУчета.Вставить("АльтернативныйТабак", "АльтернативныйТабак"); 
	СоответствиеОсобенностиУчета.Вставить("УпакованнаяВода", "УпакованнаяВода");  
	СоответствиеОсобенностиУчета.Вставить("Пиво", "Пиво");  
	СоответствиеОсобенностиУчета.Вставить("ПивоВПотребительскихУпаковках", "Пиво"); 
	СоответствиеОсобенностиУчета.Вставить("БезалкогольноеПиво", "БезалкогольноеПиво");   
	СоответствиеОсобенностиУчета.Вставить("Антисептики", "Антисептики");  
	СоответствиеОсобенностиУчета.Вставить("ДезинфицирующиеСредства", "Антисептики"); 
	СоответствиеОсобенностиУчета.Вставить("ПродукцияИзНатуральногоМеха", "ПродукцияИзНатуральногоМеха");    
	СоответствиеОсобенностиУчета.Вставить("БАДы", "БАДы");  
	СоответствиеОсобенностиУчета.Вставить("БАДы2025", "БАДы");
	СоответствиеОсобенностиУчета.Вставить("МорепродуктыПодконтрольныеВЕТИС", "Морепродукты");   
	СоответствиеОсобенностиУчета.Вставить("СоковаяПродукция", "СоковаяПродукция");  
	СоответствиеОсобенностиУчета.Вставить("БезалкогольныеНапитки", "СоковаяПродукция");
	СоответствиеОсобенностиУчета.Вставить("РастительныеМасла", "РастительныеМасла"); 
	СоответствиеОсобенностиУчета.Вставить("КонсервированнаяПродукцияПодконтрольнаяВЕТИС", "КонсервированнаяПродукция");     
	СоответствиеОсобенностиУчета.Вставить("КонсервированнаяПродукцияБезВЕТИС", "КонсервированнаяПродукция");
	СоответствиеОсобенностиУчета.Вставить("ВетеринарныеПрепараты", "ВетеринарныеПрепараты");      
	СоответствиеОсобенностиУчета.Вставить("КормаДляЖивотныхПодконтрольныеВЕТИС", "КормаДляЖивотных"); 
    СоответствиеОсобенностиУчета.Вставить("КормаДляЖивотныхБезВЕТИС", "КормаДляЖивотных");  
	СоответствиеОсобенностиУчета.Вставить("КормаДляЖивотныхВлажныеПодконтрольныеВЕТИС", "КормаДляЖивотных"); 
	СоответствиеОсобенностиУчета.Вставить("КормаДляЖивотныхВлажныеБезВЕТИС", "КормаДляЖивотных");
	СоответствиеОсобенностиУчета.Вставить("МясоПодконтрольноеВЕТИС", "Мясо");  
	СоответствиеОсобенностиУчета.Вставить("ОптоволокноИОптоволоконнаяПродукция", "Оптоволокно"); 
	СоответствиеОсобенностиУчета.Вставить("ПарфюмерныеИКосметическиеСредстваИБытоваяХимия", "БытоваяХимия"); 
	СоответствиеОсобенностиУчета.Вставить("ТитановаяМеталлопродукция", "ТитановаяМеталлопродукция");  
	СоответствиеОсобенностиУчета.Вставить("РадиоэлектроннаяПродукция", "РадиоэлектроннаяПродукция");
	СоответствиеОсобенностиУчета.Вставить("СладостиИКондитерскиеИзделия", "СладостиИКондитерскиеИзделия");   
	СоответствиеОсобенностиУчета.Вставить("КабельнаяПродукция", "КабельнаяПродукция");  
	СоответствиеОсобенностиУчета.Вставить("ИгрыИИгрушкиДляДетей", "ИгрыИИгрушкиДляДетей"); 
	СоответствиеОсобенностиУчета.Вставить("Бакалея", "Бакалея"); 
	СоответствиеОсобенностиУчета.Вставить("ОтопительныеПриборы", "ОтопительныеПриборы");  
	СоответствиеОсобенностиУчета.Вставить("СтроительныеМатериалы", "СтроительныеМатериалы");   
	СоответствиеОсобенностиУчета.Вставить("ПиротехническиеИзделияИСредстваПожарнойБезопасности", "ПиротехническиеИзделияИСредстваПожарнойБезопасности"); 
	СоответствиеОсобенностиУчета.Вставить("ПечатнаяПродукция", "ПечатнаяПродукция");  
	СоответствиеОсобенностиУчета.Вставить("ТелефоныИНоутбуки", "Радиоэлектроника");   
	СоответствиеОсобенностиУчета.Вставить("ПечатныеПлаты", "Радиоэлектроника");
    СоответствиеОсобенностиУчета.Вставить("РадиоэлектроннаяПродукция", "Радиоэлектроника"); 
	СоответствиеОсобенностиУчета.Вставить("МоторныеМасла", "МоторныеМасла");
	//+ АА
	СоответствиеОсобенностиУчета.Вставить("Парфюмерия", "Духи");
	СоответствиеОсобенностиУчета.Вставить("ИзделияИзМеха", "ПродукцияИзНатуральногоМеха");
	СоответствиеОсобенностиУчета.Вставить("ОбувныеТовары", "Обувь");
	СоответствиеОсобенностиУчета.Вставить("ШиныИАвтопокрышки", "Шины");
	//- АА
	
	СоответствиеОсобенностиУчета.Вставить("БезОсобенностейУчета", "");
	
	Возврат СоответствиеОсобенностиУчета;  

КонецФункции

// Функция возвращает значение для параметра ТовГрМарк по особенности учета номенклатуры
//
// Параметры:
//  Контекст - Структура - контекст рассчитываемого документа 
// 
// Возвращаемое значение:
//  Строка - текстовое значение параметра
//
&НаКлиенте
Функция ТоварнаяГруппаНоменклатуры(Контекст) Экспорт  
	
	ОсобенностьУчета = РассчитатьЗначение("ОсобенностьУчета", Контекст, МестныйКэш);   
	
	СоответствиеОсобенностиУчета = Новый Соответствие;    
	
	СоответствиеОсобенностиУчета.Вставить("Табак", "tobacco");     
    СоответствиеОсобенностиУчета.Вставить("Обувь", "shoes"); 
	СоответствиеОсобенностиУчета.Вставить("ЛегкаяПромышленность", "lp");  
	СоответствиеОсобенностиУчета.Вставить("Шины", "tires"); 
	СоответствиеОсобенностиУчета.Вставить("Духи", "perfumery");   
	СоответствиеОсобенностиУчета.Вставить("Фотоаппараты", "electronics");   
	СоответствиеОсобенностиУчета.Вставить("Молоко", "milk");  
	СоответствиеОсобенностиУчета.Вставить("Велосипеды", "bicycle"); 
	СоответствиеОсобенностиУчета.Вставить("КреслаКоляски", "wheelchairs"); 
	СоответствиеОсобенностиУчета.Вставить("АльтернативныйТабак", "otp"); 
	СоответствиеОсобенностиУчета.Вставить("УпакованнаяВода", "water");  
	СоответствиеОсобенностиУчета.Вставить("Пиво", "beer");
    СоответствиеОсобенностиУчета.Вставить("НикотиносодержащаяПродукция", "ncp");   
	СоответствиеОсобенностиУчета.Вставить("Антисептики", "antiseptic");  
	СоответствиеОсобенностиУчета.Вставить("ПродукцияИзНатуральногоМеха", "furs");    
	СоответствиеОсобенностиУчета.Вставить("БАДы", "bio"); 
	СоответствиеОсобенностиУчета.Вставить("БезалкогольноеПиво", "nabeer");  
	СоответствиеОсобенностиУчета.Вставить("Морепродукты", "seafood");   
	СоответствиеОсобенностиУчета.Вставить("СоковаяПродукция", "softdrinks");   
	СоответствиеОсобенностиУчета.Вставить("КонсервированнаяПродукция", "conserve");
	СоответствиеОсобенностиУчета.Вставить("ВетеринарныеПрепараты", "vetpharma");       
    СоответствиеОсобенностиУчета.Вставить("КормаДляЖивотных", "petfood");    
	СоответствиеОсобенностиУчета.Вставить("РастительныеМасла", "vegetableoil");  
    СоответствиеОсобенностиУчета.Вставить("ТабачноеСырье", "tobaccoraw");  
	СоответствиеОсобенностиУчета.Вставить("Мясо", "meat");  
	СоответствиеОсобенностиУчета.Вставить("Оптоволокно", "opticfiber"); 
	СоответствиеОсобенностиУчета.Вставить("БытоваяХимия", "chemistry");  
	СоответствиеОсобенностиУчета.Вставить("ТитановаяМеталлопродукция", "titan"); 
	СоответствиеОсобенностиУчета.Вставить("РадиоэлектроннаяПродукция", "radio"); 
	СоответствиеОсобенностиУчета.Вставить("СладостиИКондитерскиеИзделия", "sweets");  
	СоответствиеОсобенностиУчета.Вставить("КабельнаяПродукция", "cableraw"); 
	СоответствиеОсобенностиУчета.Вставить("ИгрыИИгрушкиДляДетей", "toys");  
	СоответствиеОсобенностиУчета.Вставить("Бакалея", "grocery");  
	СоответствиеОсобенностиУчета.Вставить("ОтопительныеПриборы", "heater"); 
	СоответствиеОсобенностиУчета.Вставить("СтроительныеМатериалы", "construction"); 
	СоответствиеОсобенностиУчета.Вставить("ПиротехническиеИзделияИСредстваПожарнойБезопасности", "fire"); 
	СоответствиеОсобенностиУчета.Вставить("ПечатнаяПродукция", "books");  
	СоответствиеОсобенностиУчета.Вставить("Радиоэлектроника", "radio"); 
	СоответствиеОсобенностиУчета.Вставить("МоторныеМасла", "autofluids");
	
	СоответствиеОсобенностиУчета.Вставить("БезОсобенностейУчета", "");
	
	Результат = СоответствиеОсобенностиУчета.Получить(ОсобенностьУчета); 
	
	Если Результат = Неопределено Тогда
		
		Результат = "";
		
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции   

