   
// Функция возвращает особенность учета номенклатуры, для использования при формировании кодов маркировки и параметра ТовГрМарк,
// для конфигураций, определяющих особенность учета в перечислении
//
// Параметры:
//  Контекст - Структура - контекст рассчитываемого документа
// 
// Возвращаемое значение:
//  Строка - текстовое значение особенности учета
//
&НаКлиенте
Функция ОсобенностьУчетаУТ(Контекст) Экспорт    
	
	Если НЕ ЗначениеЗаполнено(Контекст.ОсобенностьУчетаНоменклатуры) Тогда
		Возврат "";
	КонецЕсли;
	
	СбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "РассчитанныеЗначения.ОсобенностьУчетаНоменклатуры", Контекст.Номенклатура); 
	СбисОписаниеОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, СбисОписаниеОбъекта); 
	
	Если СбисОписаниеОбъекта.Значение = Неопределено Тогда
		
		СбисОписаниеОбъекта.Значение = ОсобенностьУчетаНоменклатурыУТ(Контекст.ОсобенностьУчетаНоменклатуры);  
		сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, СбисОписаниеОбъекта);
		
	КонецЕсли;
	
	Возврат ОсобенностьУчетаНоменклатурыПоИмени(СбисОписаниеОбъекта.Значение);  
	
КонецФункции  

// Функция возвращает особенность учета номенклатуры, для использования при формировании кодов маркировки и параметра ТовГрМарк,
// для конфигураций, определяющих особенность учета в перечислении
//
// Параметры:
//  ОсобенностьУчета - ПеречислениеСсылка - Рассчитанное значение перечисления
// 
// Возвращаемое значение:
//  Строка - Текстовое значение особенности учета
//
&НаСервере
Функция ОсобенностьУчетаНоменклатурыУТ(Знач ОсобенностьУчета) Экспорт  
		
	ИмяЗначения = МодульОбъектаСервер().СбисИмяЗначенияПеречисления(ОсобенностьУчета);    
	
	Возврат ИмяЗначения;
	
КонецФункции

&НаКлиенте
Функция ОсобенностьУчетаНоменклатурыПоИмени(ИмяЗначения)  
	
	ВидыПродукцииПоИСМП = ОсобенностьУчетаНоменклатурыИСМП();
	
	Результат = ВидыПродукцииПоИСМП.Получить(ИмяЗначения); 
	
	Если Результат = Неопределено Тогда
		
		Результат = "";
		
	КонецЕсли;
	
	Возврат Результат;  

КонецФункции  

// Функция возвращает особенность учета номенклатуры, для использования при формировании кодов маркировки и параметра ТовГрМарк,
// для конфигураций, определяющих особенность учета в реквизите элемента справочника
//
// Параметры:
//  Контекст - Структура - контекст рассчитываемого документа 
// 
// Возвращаемое значение:
//  Строка - текстовое значение особенности учета
//
&НаКлиенте
Функция ОсобенностьУчетаБП(Контекст) Экспорт  
	
 	СбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "РассчитанныеЗначения.ОсобенностьУчетаНоменклатуры", Контекст.Номенклатура); 
	СбисОписаниеОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, СбисОписаниеОбъекта); 
	
	Если СбисОписаниеОбъекта.Значение = Неопределено Тогда
		
		СбисОписаниеОбъекта.Значение = ОсобенностьУчетаНоменклатурыБП(Контекст.Номенклатура);  
		сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, СбисОписаниеОбъекта);
		
	КонецЕсли;
	
	Возврат СбисОписаниеОбъекта.Значение; 
	
КонецФункции

// Функция возвращает особенность учета номенклатуры, для использования при формировании кодов маркировки и параметра ТовГрМарк,
// для конфигураций, определяющих особенность учета в реквизите элемента справочника
//
// Параметры:
//  Номенклатура - СправочникСсылка - Ссылка на элемент справочника номенклатуры 
// 
// Возвращаемое значение:
//  Строка - Текстовое значение особенности учета
//
&НаСервере
Функция ОсобенностьУчетаНоменклатурыБП(Знач Номенклатура) Экспорт  
	
	ВидыПродукцииПоИСМП = ОсобенностьУчетаНоменклатурыИСМП();  
	
	ДопПараметрыПроверки = Новый Структура("НаборОбъектов, Объект", "Реквизиты", Номенклатура);
	
	Для Каждого ВидПродукции Из ВидыПродукцииПоИСМП Цикл
		
		Если МодульОбъектаСервер().СбисСуществуетОбъектКонфигурацииСервер(ВидПродукции.Ключ, ДопПараметрыПроверки)
			И Номенклатура[ВидПродукции.Ключ] Тогда 
			
			Возврат ВидПродукции.Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат "";
				
КонецФункции

// Функция возвращает особенность учета номенклатуры, для использования при формировании кодов маркировки и параметра ТовГрМарк,
// для конфигураций, определяющих особенность учета в реквизите элемента справочника
//
// Параметры:
//  Контекст - Структура - контекст рассчитываемого документа 
// 
// Возвращаемое значение:
//  Строка - текстовое значение особенности учета
//
&НаКлиенте
Функция ОсобенностьУчетаАА(Контекст) Экспорт  
	
 	СбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "РассчитанныеЗначения.ОсобенностьУчетаНоменклатуры", Контекст.Номенклатура); 
	СбисОписаниеОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, СбисОписаниеОбъекта); 
	
	Если СбисОписаниеОбъекта.Значение = Неопределено Тогда
		
		СбисОписаниеОбъекта.Значение = ОсобенностьУчетаНоменклатурыАА(Контекст.ТипНоменклатуры);  
		сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, СбисОписаниеОбъекта);
		
	КонецЕсли;
	
	Возврат СбисОписаниеОбъекта.Значение;
	
КонецФункции

// Функция возвращает особенность учета номенклатуры, для использования при формировании кодов маркировки и параметра ТовГрМарк,
// для конфигураций, определяющих особенность учета в реквизите элемента справочника
//
// Параметры:
//  ТипНоменклатуры - СправочникСсылка - Ссылка на элемент справочника типа номенклатуры 
// 
// Возвращаемое значение:
//  Строка - Текстовое значение особенности учета
//
&НаСервере
Функция ОсобенностьУчетаНоменклатурыАА(Знач ТипНоменклатуры) Экспорт  
	
	ВидыПродукцииПоИСМП = ОсобенностьУчетаНоменклатурыИСМП();  
	
	Если Не ЗначениеЗаполнено(ТипНоменклатуры.ТипМаркировки)
			Или ВидыПродукцииПоИСМП.Получить(ТипНоменклатуры.ТипМаркировки.Имя) = Неопределено Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Возврат ВидыПродукцииПоИСМП.Получить(ТипНоменклатуры.ТипМаркировки.Имя);
	
КонецФункции

// Функция - Возвращает перечень маркируемой продукции, оборот которой фиксируется в ИС МП.
// 
// Возвращаемое значение:
//  Соответствие - список видов маркируемой продукции ИСМП.
//
&НаКлиентеНаСервереБезКонтекста
Функция ОсобенностьУчетаНоменклатурыИСМП()  
	
	СоответствиеОсобенностиУчета = Новый Соответствие;    
	
	СоответствиеОсобенностиУчета.Вставить("ТабачнаяПродукция", "Табак"); 
	СоответствиеОсобенностиУчета.Вставить("Табак", "Табак");  
	СоответствиеОсобенностиУчета.Вставить("НикотиносодержащаяПродукция", "НикотиносодержащаяПродукция"); 
	СоответствиеОсобенностиУчета.Вставить("ОбувнаяПродукция", "Обувь");
    СоответствиеОсобенностиУчета.Вставить("Обувь", "Обувь"); 
	СоответствиеОсобенностиУчета.Вставить("ЛегкаяПромышленность", "ЛегкаяПромышленность"); 
	СоответствиеОсобенностиУчета.Вставить("ЛегкаяПромышленность2025", "ЛегкаяПромышленность"); 
	СоответствиеОсобенностиУчета.Вставить("Шины", "Шины"); 
	СоответствиеОсобенностиУчета.Вставить("Духи", "Духи");   
	СоответствиеОсобенностиУчета.Вставить("Фотоаппараты", "Фотоаппараты");   
	СоответствиеОсобенностиУчета.Вставить("МолочнаяПродукцияПодконтрольнаяВЕТИС", "Молоко"); 
    СоответствиеОсобенностиУчета.Вставить("МолочнаяПродукцияБезВЕТИС", "Молоко");  
	СоответствиеОсобенностиУчета.Вставить("Велосипеды", "Велосипеды"); 
	СоответствиеОсобенностиУчета.Вставить("КреслаКоляски", "КреслаКоляски");
	СоответствиеОсобенностиУчета.Вставить("МедицинскиеИзделия", "КреслаКоляски"); 
	СоответствиеОсобенностиУчета.Вставить("МедицинскиеИзделия20", "КреслаКоляски"); 
	СоответствиеОсобенностиУчета.Вставить("ТехническиеСредстваРеабилитации", "КреслаКоляски");
	СоответствиеОсобенностиУчета.Вставить("АльтернативныйТабак", "АльтернативныйТабак"); 
	СоответствиеОсобенностиУчета.Вставить("УпакованнаяВода", "УпакованнаяВода");  
	СоответствиеОсобенностиУчета.Вставить("Пиво", "Пиво");  
	СоответствиеОсобенностиУчета.Вставить("ПивоВПотребительскихУпаковках", "Пиво"); 
	СоответствиеОсобенностиУчета.Вставить("БезалкогольноеПиво", "БезалкогольноеПиво");   
	СоответствиеОсобенностиУчета.Вставить("Антисептики", "Антисептики");  
	СоответствиеОсобенностиУчета.Вставить("ДезинфицирующиеСредства", "Антисептики"); 
	СоответствиеОсобенностиУчета.Вставить("ПродукцияИзНатуральногоМеха", "ПродукцияИзНатуральногоМеха");    
	СоответствиеОсобенностиУчета.Вставить("БАДы", "БАДы");  
	СоответствиеОсобенностиУчета.Вставить("БАДы2025", "БАДы");
	СоответствиеОсобенностиУчета.Вставить("МорепродуктыПодконтрольныеВЕТИС", "Морепродукты");   
	СоответствиеОсобенностиУчета.Вставить("СоковаяПродукция", "СоковаяПродукция");  
	СоответствиеОсобенностиУчета.Вставить("БезалкогольныеНапитки", "СоковаяПродукция");
	СоответствиеОсобенностиУчета.Вставить("РастительныеМасла", "РастительныеМасла"); 
	СоответствиеОсобенностиУчета.Вставить("КонсервированнаяПродукцияПодконтрольнаяВЕТИС", "КонсервированнаяПродукция");     
	СоответствиеОсобенностиУчета.Вставить("КонсервированнаяПродукцияБезВЕТИС", "КонсервированнаяПродукция");
	СоответствиеОсобенностиУчета.Вставить("ВетеринарныеПрепараты", "ВетеринарныеПрепараты");      
	СоответствиеОсобенностиУчета.Вставить("КормаДляЖивотныхПодконтрольныеВЕТИС", "КормаДляЖивотных"); 
    СоответствиеОсобенностиУчета.Вставить("КормаДляЖивотныхБезВЕТИС", "КормаДляЖивотных");  
	СоответствиеОсобенностиУчета.Вставить("КормаДляЖивотныхВлажныеПодконтрольныеВЕТИС", "КормаДляЖивотных"); 
	СоответствиеОсобенностиУчета.Вставить("КормаДляЖивотныхВлажныеБезВЕТИС", "КормаДляЖивотных");
	СоответствиеОсобенностиУчета.Вставить("МясоПодконтрольноеВЕТИС", "Мясо");  
	СоответствиеОсобенностиУчета.Вставить("ОптоволокноИОптоволоконнаяПродукция", "Оптоволокно"); 
	СоответствиеОсобенностиУчета.Вставить("ПарфюмерныеИКосметическиеСредстваИБытоваяХимия", "БытоваяХимия"); 
	СоответствиеОсобенностиУчета.Вставить("ТитановаяМеталлопродукция", "ТитановаяМеталлопродукция");  
	СоответствиеОсобенностиУчета.Вставить("СладостиИКондитерскиеИзделия", "СладостиИКондитерскиеИзделия");   
	СоответствиеОсобенностиУчета.Вставить("КабельнаяПродукция", "КабельнаяПродукция");  
	СоответствиеОсобенностиУчета.Вставить("ИгрыИИгрушкиДляДетей", "ИгрыИИгрушкиДляДетей"); 
	СоответствиеОсобенностиУчета.Вставить("Бакалея", "Бакалея"); 
	СоответствиеОсобенностиУчета.Вставить("ОтопительныеПриборы", "ОтопительныеПриборы");  
	СоответствиеОсобенностиУчета.Вставить("СтроительныеМатериалы", "СтроительныеМатериалы");   
	СоответствиеОсобенностиУчета.Вставить("ПиротехническиеИзделияИСредстваПожарнойБезопасности", "ПиротехническиеИзделияИСредстваПожарнойБезопасности"); 
	СоответствиеОсобенностиУчета.Вставить("ПечатнаяПродукция", "ПечатнаяПродукция");  
	СоответствиеОсобенностиУчета.Вставить("ПечатныеПлаты", "Радиоэлектроника");
    СоответствиеОсобенностиУчета.Вставить("РадиоэлектроннаяПродукция", "Радиоэлектроника"); 
	СоответствиеОсобенностиУчета.Вставить("МоторныеМасла", "МоторныеМасла");
	СоответствиеОсобенностиУчета.Вставить("ПолимерныеТрубы", "ПолимерныеТрубы");
	СоответствиеОсобенностиУчета.Вставить("АвтозапчастиИКомплектующиеТранспортныхСредств", "АвтозапчастиИКомплектующиеТранспортныхСредств");
	СоответствиеОсобенностиУчета.Вставить("ТелефоныИНоутбуки", "НоутбукиИСмартфоны");
	//+ АА
	СоответствиеОсобенностиУчета.Вставить("Парфюмерия", "Духи");
	СоответствиеОсобенностиУчета.Вставить("ИзделияИзМеха", "ПродукцияИзНатуральногоМеха");
	СоответствиеОсобенностиУчета.Вставить("ОбувныеТовары", "Обувь");
	СоответствиеОсобенностиУчета.Вставить("ШиныИАвтопокрышки", "Шины");
	//- АА
	
	// TODO На 17.03.2026 этих видов продукции нет в 1С. Доработается по задаче 03176187
	//СоответствиеОсобенностиУчета.Вставить("", "ЭлектронныеСистемыДоставкиНикотина"); 
	//СоответствиеОсобенностиУчета.Вставить("", "ТоварыДляДомаИИнтерьера"); 
	//СоответствиеОсобенностиУчета.Вставить("", "КормовыеДобавки");  
	//СоответствиеОсобенностиУчета.Вставить("", "Удобрения"); 
	//СоответствиеОсобенностиУчета.Вставить("", "МясныеИзделия");
	//СоответствиеОсобенностиУчета.Вставить("", "ПромышленноеОборудование");
	//СоответствиеОсобенностиУчета.Вставить("", "Полуфабрикаты");
	//
	
	СоответствиеОсобенностиУчета.Вставить("БезОсобенностейУчета", "");
	
	Возврат СоответствиеОсобенностиУчета;  

КонецФункции

// Функция возвращает особенность учета номенклатуры, для использования при формировании кодов маркировки и параметра ТовГрМарк,
// для конфигураций, определяющих особенность учета в регистрах
//
// Параметры:
//  Контекст - Структура - контекст рассчитываемого документа 
// 
// Возвращаемое значение:
//  Строка - текстовое значение особенности учета
//
&НаКлиенте
Функция ОсобенностьУчетаУНФ(Контекст) Экспорт  
	
 	СбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "РассчитанныеЗначения.ОсобенностьУчетаНоменклатуры", Контекст.Номенклатура); 
	СбисОписаниеОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, СбисОписаниеОбъекта); 
	
	Если СбисОписаниеОбъекта.Значение = Неопределено Тогда
		
		ТоварнаяГруппаНоменклатуры = ТоварнаяГруппаНоменклатурыУНФ(Контекст);
		
		СбисОписаниеОбъекта.Значение = ОсобенностьУчетаНоменклатурыИСМППоТоварнойГруппе(ТоварнаяГруппаНоменклатуры);
		
		сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, СбисОписаниеОбъекта);
		
	КонецЕсли;
	
	Возврат СбисОписаниеОбъекта.Значение;
	
КонецФункции

// Функция возвращает по запросу товарную группу номенклатуры (ТовГрМарк) для тех конфигураций, где все связи товарных групп,
//	номенклатуры и особенностей учета сделаны через регистры
//
// Параметры:
//  Контекст - ТоварнаяГруппаНоменклатуры - Строка - товарная группа строкой 
// 
// Возвращаемое значение:
//  Строка - текстовое значение параметра
//
&НаКлиенте
Функция ТоварнаяГруппаНоменклатурыУНФ(Контекст) Экспорт
	
	Возврат ТоварнаяГруппаНоменклатурыУНФНаСервере(Контекст.Номенклатура);
	
КонецФункции

&НаСервереБезКонтекста
Функция ТоварнаяГруппаНоменклатурыУНФНаСервере(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЗначенияЭлементовКонструктораВидовПродукцииИС.Значение.Имя КАК ТоварнаяГруппа
		|ИЗ
		|	РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктораВидовПродукцииИС
		|		ПО (ОписаниеНоменклатурыИС.Номенклатура = &Номенклатура)
		|			И (ЗначенияЭлементовКонструктораВидовПродукцииИС.ЭлементКонструктора = ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.ТоварныеГруппыГИСМТ))
		|			И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ = ЗначенияЭлементовКонструктораВидовПродукцииИС.ВидПродукции";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ТоварнаяГруппа;
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает особенность учета номенклатуры по товарной группе номенклатуры (ТовГрМарк)
//
// Параметры:
//  Контекст - ТоварнаяГруппаНоменклатуры - Строка - товарная группа строкой 
// 
// Возвращаемое значение:
//  Строка - текстовое значение параметра
//
&НаКлиенте
Функция ОсобенностьУчетаНоменклатурыИСМППоТоварнойГруппе(ТоварнаяГруппаНоменклатуры) Экспорт  
	
	СоответствиеОсобенностиУчета = Новый Соответствие;    
	
	СоответствиеОсобенностиУчета.Вставить("tobacco", "Табак");     
    СоответствиеОсобенностиУчета.Вставить("shoes", "Обувь"); 
	СоответствиеОсобенностиУчета.Вставить("lp", "ЛегкаяПромышленность");  
	СоответствиеОсобенностиУчета.Вставить("tires", "Шины"); 
	СоответствиеОсобенностиУчета.Вставить("perfumery", "Духи");   
	СоответствиеОсобенностиУчета.Вставить("electronics", "Фотоаппараты");   
	СоответствиеОсобенностиУчета.Вставить("milk", "Молоко");  
	СоответствиеОсобенностиУчета.Вставить("bicycle", "Велосипеды"); 
	СоответствиеОсобенностиУчета.Вставить("wheelchairs", "КреслаКоляски"); 
	СоответствиеОсобенностиУчета.Вставить("otp", "АльтернативныйТабак"); 
	СоответствиеОсобенностиУчета.Вставить("water", "УпакованнаяВода");  
	СоответствиеОсобенностиУчета.Вставить("beer", "Пиво");
    СоответствиеОсобенностиУчета.Вставить("ncp", "НикотиносодержащаяПродукция");   
	СоответствиеОсобенностиУчета.Вставить("antiseptic", "Антисептики");  
	СоответствиеОсобенностиУчета.Вставить("furslp", "ПродукцияИзНатуральногоМеха");
	СоответствиеОсобенностиУчета.Вставить("furs", "ПродукцияИзНатуральногоМеха");
	СоответствиеОсобенностиУчета.Вставить("bio", "БАДы"); 
	СоответствиеОсобенностиУчета.Вставить("nabeer", "БезалкогольноеПиво");  
	СоответствиеОсобенностиУчета.Вставить("seafood", "Морепродукты");   
	СоответствиеОсобенностиУчета.Вставить("softdrinks", "СоковаяПродукция");   
	СоответствиеОсобенностиУчета.Вставить("conserve", "КонсервированнаяПродукция");
	СоответствиеОсобенностиУчета.Вставить("vetpharma", "ВетеринарныеПрепараты");       
    СоответствиеОсобенностиУчета.Вставить("petfood", "КормаДляЖивотных");    
	СоответствиеОсобенностиУчета.Вставить("vegetableoil", "РастительныеМасла");  
    СоответствиеОсобенностиУчета.Вставить("tobaccoraw", "ТабачноеСырье");  
	СоответствиеОсобенностиУчета.Вставить("meat", "Мясо");  
	СоответствиеОсобенностиУчета.Вставить("opticfiber", "Оптоволокно"); 
	СоответствиеОсобенностиУчета.Вставить("chemistry", "БытоваяХимия");  
	СоответствиеОсобенностиУчета.Вставить("titan", "ТитановаяМеталлопродукция"); 
	СоответствиеОсобенностиУчета.Вставить("sweets", "СладостиИКондитерскиеИзделия");  
	СоответствиеОсобенностиУчета.Вставить("cableraw", "КабельнаяПродукция"); 
	СоответствиеОсобенностиУчета.Вставить("toys", "ИгрыИИгрушкиДляДетей");  
	СоответствиеОсобенностиУчета.Вставить("grocery", "Бакалея");  
	СоответствиеОсобенностиУчета.Вставить("heater", "ОтопительныеПриборы"); 
	СоответствиеОсобенностиУчета.Вставить("construction", "СтроительныеМатериалы"); 
	СоответствиеОсобенностиУчета.Вставить("fire", "ПиротехническиеИзделияИСредстваПожарнойБезопасности"); 
	СоответствиеОсобенностиУчета.Вставить("books", "ПечатнаяПродукция");  
	СоответствиеОсобенностиУчета.Вставить("radio", "Радиоэлектроника"); 
	СоответствиеОсобенностиУчета.Вставить("autofluids", "МоторныеМасла");
	СоответствиеОсобенностиУчета.Вставить("gadgets", "НоутбукиИСмартфоны");
	СоответствиеОсобенностиУчета.Вставить("nicotindev", "ЭлектронныеСистемыДоставкиНикотина"); 
	СоответствиеОсобенностиУчета.Вставить("homeware", "ТоварыДляДомаИИнтерьера");
	СоответствиеОсобенностиУчета.Вставить("vetbio", "КормовыеДобавки");
	СоответствиеОсобенностиУчета.Вставить("fertilizers", "Удобрения");
	СоответствиеОсобенностиУчета.Вставить("meat", "МясныеИзделия");
	СоответствиеОсобенностиУчета.Вставить("industrial", "ПромышленноеОборудование"); 
	СоответствиеОсобенностиУчета.Вставить("frozen", "Полуфабрикаты");
	
	СоответствиеОсобенностиУчета.Вставить("", "БезОсобенностейУчета");
	
	Результат = СоответствиеОсобенностиУчета.Получить(ТоварнаяГруппаНоменклатуры); 
	
	Если Результат = Неопределено Тогда
		Результат = "";
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

// Функция возвращает значение для параметра ТовГрМарк по особенности учета номенклатуры
//
// Параметры:
//  Контекст - Структура - контекст рассчитываемого документа 
// 
// Возвращаемое значение:
//  Строка - текстовое значение параметра
//
&НаКлиенте
Функция ТоварнаяГруппаНоменклатуры(Контекст) Экспорт  
	
	ОсобенностьУчета = РассчитатьЗначение("ОсобенностьУчета", Контекст, МестныйКэш);   
	
	СоответствиеОсобенностиУчета = Новый Соответствие;    
	
	СоответствиеОсобенностиУчета.Вставить("Табак", "tobacco");     
    СоответствиеОсобенностиУчета.Вставить("Обувь", "shoes"); 
	СоответствиеОсобенностиУчета.Вставить("ЛегкаяПромышленность", "lp");  
	СоответствиеОсобенностиУчета.Вставить("Шины", "tires"); 
	СоответствиеОсобенностиУчета.Вставить("Духи", "perfumery");   
	СоответствиеОсобенностиУчета.Вставить("Фотоаппараты", "electronics");   
	СоответствиеОсобенностиУчета.Вставить("Молоко", "milk");  
	СоответствиеОсобенностиУчета.Вставить("Велосипеды", "bicycle"); 
	СоответствиеОсобенностиУчета.Вставить("КреслаКоляски", "wheelchairs"); 
	СоответствиеОсобенностиУчета.Вставить("АльтернативныйТабак", "otp"); 
	СоответствиеОсобенностиУчета.Вставить("УпакованнаяВода", "water");  
	СоответствиеОсобенностиУчета.Вставить("Пиво", "beer");
    СоответствиеОсобенностиУчета.Вставить("НикотиносодержащаяПродукция", "ncp");   
	СоответствиеОсобенностиУчета.Вставить("Антисептики", "antiseptic");  
	СоответствиеОсобенностиУчета.Вставить("ПродукцияИзНатуральногоМеха", "furslp");    
	СоответствиеОсобенностиУчета.Вставить("БАДы", "bio"); 
	СоответствиеОсобенностиУчета.Вставить("БезалкогольноеПиво", "nabeer");  
	СоответствиеОсобенностиУчета.Вставить("Морепродукты", "seafood");   
	СоответствиеОсобенностиУчета.Вставить("СоковаяПродукция", "softdrinks");   
	СоответствиеОсобенностиУчета.Вставить("КонсервированнаяПродукция", "conserve");
	СоответствиеОсобенностиУчета.Вставить("ВетеринарныеПрепараты", "vetpharma");       
    СоответствиеОсобенностиУчета.Вставить("КормаДляЖивотных", "petfood");    
	СоответствиеОсобенностиУчета.Вставить("РастительныеМасла", "vegetableoil");  
    СоответствиеОсобенностиУчета.Вставить("ТабачноеСырье", "tobaccoraw");  
	СоответствиеОсобенностиУчета.Вставить("Мясо", "meat");  
	СоответствиеОсобенностиУчета.Вставить("Оптоволокно", "opticfiber"); 
	СоответствиеОсобенностиУчета.Вставить("БытоваяХимия", "chemistry");  
	СоответствиеОсобенностиУчета.Вставить("ТитановаяМеталлопродукция", "titan"); 
	СоответствиеОсобенностиУчета.Вставить("СладостиИКондитерскиеИзделия", "sweets");  
	СоответствиеОсобенностиУчета.Вставить("КабельнаяПродукция", "cableraw"); 
	СоответствиеОсобенностиУчета.Вставить("ИгрыИИгрушкиДляДетей", "toys");  
	СоответствиеОсобенностиУчета.Вставить("Бакалея", "grocery");  
	СоответствиеОсобенностиУчета.Вставить("ОтопительныеПриборы", "heater"); 
	СоответствиеОсобенностиУчета.Вставить("СтроительныеМатериалы", "construction"); 
	СоответствиеОсобенностиУчета.Вставить("ПиротехническиеИзделияИСредстваПожарнойБезопасности", "fire"); 
	СоответствиеОсобенностиУчета.Вставить("ПечатнаяПродукция", "books");  
	СоответствиеОсобенностиУчета.Вставить("Радиоэлектроника", "radio"); 
	СоответствиеОсобенностиУчета.Вставить("МоторныеМасла", "autofluids");
	СоответствиеОсобенностиУчета.Вставить("ПолимерныеТрубы", "polymer");
	СоответствиеОсобенностиУчета.Вставить("АвтозапчастиИКомплектующиеТранспортныхСредств", "carparts");
	СоответствиеОсобенностиУчета.Вставить("НоутбукиИСмартфоны", "gadgets");
	СоответствиеОсобенностиУчета.Вставить("ЭлектронныеСистемыДоставкиНикотина", "nicotindev"); 
	СоответствиеОсобенностиУчета.Вставить("ТоварыДляДомаИИнтерьера", "homeware"); 
	СоответствиеОсобенностиУчета.Вставить("КормовыеДобавки", "vetbio");  
	СоответствиеОсобенностиУчета.Вставить("Удобрения", "fertilizers"); 
	СоответствиеОсобенностиУчета.Вставить("МясныеИзделия", "meat");
	СоответствиеОсобенностиУчета.Вставить("ПромышленноеОборудование", "industrial");
	СоответствиеОсобенностиУчета.Вставить("Полуфабрикаты", "frozen");
	
	СоответствиеОсобенностиУчета.Вставить("БезОсобенностейУчета", "");
	
	Результат = СоответствиеОсобенностиУчета.Получить(ОсобенностьУчета); 
	
	Если Результат = Неопределено Тогда
		
		Результат = "";
		
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции   

