
Функция ЗаполнитьКодГТДУТ11(Контекст) Экспорт
	НомерГТД = ЗаполнитьНомерГТДУТ11(Контекст);
	Если ЗначениеЗаполнено(НомерГТД) Тогда
		Возврат НомерГТД.Код;
	КонецЕсли;
КонецФункции

Функция ЗаполнитьКодСтраныПроисхожденияУТ11(Контекст) Экспорт
	НомерГТД = ЗаполнитьНомерГТДУТ11(Контекст);
	Если ЗначениеЗаполнено(НомерГТД) Тогда
		Возврат НомерГТД.СтранаПроисхожденияКод;
	КонецЕсли;
КонецФункции

Функция ЗаполнитьНомерГТДУТ11(Контекст) Экспорт
	Результат = Новый Структура("Код, СтранаПроисхожденияКод, СтранаПроисхожденияНаименование");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыЗапасов.НомерСтроки КАК НомерСтроки,
	               |	ВидыЗапасов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	ВидыЗапасов.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	               |	ВидыЗапасов.Упаковка КАК Упаковка,
	               |	ВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
	               |	ВидыЗапасов.НомерГТД КАК НомерГТД
	               |ПОМЕСТИТЬ ВсеВидыЗапасов
	               |ИЗ
	               |	Документ.КорректировкаРеализации.ВидыЗапасовКорректировкаВыручки КАК ВидыЗапасов
	               |ГДЕ
	               |	ВидыЗапасов.Ссылка = &КорректировкаРеализации
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВидыЗапасов.НомерСтроки,
	               |	ВидыЗапасов.АналитикаУчетаНоменклатуры,
	               |	ВидыЗапасов.АналитикаУчетаНаборов,
	               |	ВидыЗапасов.Упаковка,
	               |	ВидыЗапасов.ВидЗапасов,
	               |	ВидыЗапасов.НомерГТД
	               |ИЗ
	               |	Документ.КорректировкаРеализации.ВидыЗапасовОприходование КАК ВидыЗапасов
	               |ГДЕ
	               |	ВидыЗапасов.Ссылка = &КорректировкаРеализации
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВидыЗапасов.НомерСтроки,
	               |	ВидыЗапасов.АналитикаУчетаНоменклатуры,
	               |	ВидыЗапасов.АналитикаУчетаНаборов,
	               |	ВидыЗапасов.Упаковка,
	               |	ВидыЗапасов.ВидЗапасов,
	               |	ВидыЗапасов.НомерГТД
	               |ИЗ
	               |	Документ.КорректировкаРеализации.ВидыЗапасовСписание КАК ВидыЗапасов
	               |ГДЕ
	               |	ВидыЗапасов.Ссылка = &КорректировкаРеализации
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВидыЗапасов.НомерСтроки,
	               |	ВидыЗапасов.АналитикаУчетаНоменклатуры,
	               |	ВидыЗапасов.АналитикаУчетаНаборов,
	               |	ВидыЗапасов.Упаковка,
	               |	ВидыЗапасов.ВидЗапасов,
	               |	ВидыЗапасов.НомерГТД
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК ВидыЗапасов
	               |ГДЕ
	               |	ВидыЗапасов.Ссылка = &ДокументОснование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ВсеВидыЗапасов.НомерСтроки) КАК НомерСтроки,
	               |	ВсеВидыЗапасов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	ВсеВидыЗапасов.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	               |	ВсеВидыЗапасов.Упаковка КАК Упаковка,
	               |	ВсеВидыЗапасов.НомерГТД КАК НомерГТД,
	               |	ВсеВидыЗапасов.ВидЗапасов КАК ВидЗапасов
	               |ПОМЕСТИТЬ ВтВидыЗапасов
	               |ИЗ
	               |	ВсеВидыЗапасов КАК ВсеВидыЗапасов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВсеВидыЗапасов.АналитикаУчетаНоменклатуры,
	               |	ВсеВидыЗапасов.АналитикаУчетаНаборов,
	               |	ВсеВидыЗапасов.Упаковка,
	               |	ВсеВидыЗапасов.НомерГТД,
	               |	ВсеВидыЗапасов.ВидЗапасов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаДокумента.НомерГТД КАК НомерГТД
	               |ИЗ
	               |	ВтВидыЗапасов КАК ТаблицаДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	               |		ПО ТаблицаДокумента.АналитикаУчетаНоменклатуры = Аналитика.КлючАналитики
	               |ГДЕ
	               |	Аналитика.Номенклатура = &Номенклатура
	               |	И Аналитика.Характеристика = &Характеристика
	               |	И ТаблицаДокумента.Упаковка = &Упаковка";
	
	Запрос.УстановитьПараметр("КорректировкаРеализации", Контекст.Документ);
	Запрос.УстановитьПараметр("ДокументОснование", Контекст.Документ.ДокументОснование);
	Запрос.УстановитьПараметр("Номенклатура", Контекст.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Контекст.Характеристика);
	Запрос.УстановитьПараметр("Упаковка", Контекст.Упаковка);
	
	ВидыЗапасов = Запрос.Выполнить().Выбрать();
	Пока ВидыЗапасов.Следующий() Цикл
		Результат.Код = ВидыЗапасов.НомерГТД.Код;
		Результат.СтранаПроисхожденияКод = ВидыЗапасов.НомерГТД.СтранаПроисхождения.Код;
		Результат.СтранаПроисхожденияНаименование = ВидыЗапасов.НомерГТД.СтранаПроисхождения.Наименование;
		Возврат Результат;
	КонецЦикла;
КонецФункции

&НаКлиенте
Функция сбисВычислитьПредЦенуУТ11(Контекст) Экспорт
	Если Контекст.СуммаВключаетНДС Тогда
		Кол_во = сбисВычислитьПредКоличествоУТ11(Контекст);
		Сумма = сбисВычислитьПредСуммуУТ11(Контекст);
		СуммаНДС = сбисВычислитьПредСуммуНДСУТ11(Контекст);
		ЦенаБезНДС = ?(Число(Кол_во) = 0, (Сумма-СуммаНДС), (Сумма-СуммаНДС) / Кол_во);
		Возврат Формат(ЦенаБезНДС,"ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00");	
	Иначе
		// alo <<
		если Контекст.свойство("Расхождение_Цена") тогда
			Возврат Формат(Контекст.Цена - Контекст.Расхождение_Цена,"ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00");
		иначе
			Кол_во = сбисВычислитьПредКоличествоУТ11(Контекст);
			Сумма = сбисВычислитьПредСуммуУТ11(Контекст);
			ЦенаБезНДС = ?(Число(Кол_во) = 0, Сумма, Сумма / Кол_во);
			Возврат Формат(ЦенаБезНДС,"ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00");	
		конецесли;
		// >> alo
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция сбисВычислитьПредКоличествоУТ11(Контекст) Экспорт
	Попытка
		Кол_во = Число(Контекст.ТаблДок_Кол_во);
	Исключение
		Кол_во = 0;
	КонецПопытки;
	Возврат Формат(Кол_во - Число(Контекст.Расхождение_Кол_во),"ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.000");
КонецФункции

&НаКлиенте
Функция сбисВычислитьПредСуммуУТ11(Контекст) Экспорт
	Попытка
		Сумма = Число(Контекст.ТаблДок_Сумма);
	Исключение
		Сумма = 0;
	КонецПопытки;
	Возврат Формат(Сумма - Контекст.Расхождение_Сумма,"ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00");
КонецФункции

&НаКлиенте
Функция сбисВычислитьПредСуммуНДСУТ11(Контекст) Экспорт
	Попытка
		СуммаНДС = Число(Контекст.СуммаНДС);
	Исключение
		СуммаНДС = 0;
	КонецПопытки;
	Возврат Формат(СуммаНДС - Контекст.Расхождение_СуммаНДС,"ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00");
КонецФункции

&НаСервереБезКонтекста
функция сбисЗаполнитьТаблицуВзаиморасчетовУТ11(Контекст) Экспорт
	// Функция формирует табличную часть акта сверки для конфигурации УТ11	
	ДанныеТЧ = сбисПолучитьДанныеВзаиморасчетовУТ11(Контекст);
	Возврат ДанныеТЧ.ТабЧастьДокумента;
КонецФункции

&НаСервереБезКонтекста
функция сбисЗаполнитьНачальныйОстатокУТ11(Контекст) Экспорт
	// Функция возвращает остаток на начало периода сверки взаиморасчетов для конфигурации УТ11	
	ДанныеТЧ = сбисПолучитьДанныеВзаиморасчетовУТ11(Контекст);
	Возврат ДанныеТЧ.НачальныйОстаток;
КонецФункции

&НаСервереБезКонтекста
функция сбисПолучитьДанныеВзаиморасчетовУТ11(Контекст)
	// Функция формирует данные акта сверки для конфигурации УТ11	
	ИмяДокументаПоступления = "ПоступлениеТоваровУслуг";
	Если Метаданные.Документы.Найти("ПоступлениеТоваровУслуг")= Неопределено Тогда
		ИмяДокументаПоступления = "ПриобретениеТоваровУслуг";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапросаОтборПоАналитике(Новый Структура("АналитикаДоговор", Ложь)) + "
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка					КАК Документ,
	|	ДанныеДокумента.НомерВходящегоДокумента	КАК Номер,
	|	ДанныеДокумента.ДатаВходящегоДокумента  КАК Дата,
	|	Истина									КАК ЭтоВходящийДокумент
	|
	|ПОМЕСТИТЬ ДокументыИнтеркампани
	|
	|ИЗ
	|	Документ.ОтчетПоКомиссииМеждуОрганизациями КАК ДанныеДокумента                 
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Организация = &Организация
	|	И ДанныеДокумента.Контрагент = &Контрагент
	|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериодаСверки И &КонецПериодаСверки
	|	И ДанныеДокумента.РасчетыЧерезОтдельногоКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка					КАК Документ,
	|	ДанныеДокумента.Номер 					КАК Номер,
	|	ДанныеДокумента.Дата 					КАК Дата,
	|	Ложь									КАК ЭтоВходящийДокумент
	|ИЗ
	|	Документ.ОтчетПоКомиссииМеждуОрганизациями КАК ДанныеДокумента                 
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Комиссионер = &Организация
	|	И ДанныеДокумента.Контрагент = &Контрагент
	|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериодаСверки И &КонецПериодаСверки
	|	И ДанныеДокумента.РасчетыЧерезОтдельногоКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка					КАК Документ,
	|	ДанныеДокумента.НомерВходящегоДокумента КАК Номер,
	|	ДанныеДокумента.ДатаВходящегоДокумента 	КАК Дата,
	|	Истина									КАК ЭтоВходящийДокумент
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями КАК ДанныеДокумента                 
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.ОрганизацияПолучатель = &Организация
	|	И ДанныеДокумента.Контрагент = &Контрагент
	|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериодаСверки И &КонецПериодаСверки
	|	И ДанныеДокумента.РасчетыЧерезОтдельногоКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка					КАК Документ,
	|	ДанныеДокумента.Номер 					КАК Номер,
	|	ДанныеДокумента.Дата 					КАК Дата,
	|	Ложь									КАК ЭтоВходящийДокумент
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями КАК ДанныеДокумента                 
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Организация = &Организация
	|	И ДанныеДокумента.Контрагент = &Контрагент
	|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериодаСверки И &КонецПериодаСверки
	|	И ДанныеДокумента.РасчетыЧерезОтдельногоКонтрагента
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиОстаткиИОбороты.Период КАК Период,
	|	ЕСТЬNULL(РасчетыСКлиентамиОстаткиИОбороты.Регистратор, Неопределено) КАК Документ,
	|	ВЫБОР КОГДА ДокументыИнтеркампани.Документ ЕСТЬ NULL ТОГДА
	|		ВЫБОР КОГДА РасчетыСКлиентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств ТОГДА
	|			РасчетыСКлиентамиОстаткиИОбороты.Регистратор.Номер
	|		ИНАЧЕ
	|			ЕСТЬNULL(РасчетыСКлиентамиОстаткиИОбороты.Регистратор.НомерВходящегоДокумента,
	|				РасчетыСКлиентамиОстаткиИОбороты.Регистратор.Номер)
	|		КОНЕЦ
	|	ИНАЧЕ
	|		ДокументыИнтеркампани.Номер
	|	КОНЕЦ КАК Номер,
	|	ВЫБОР КОГДА ДокументыИнтеркампани.Документ ЕСТЬ NULL ТОГДА
	|		ВЫБОР КОГДА РасчетыСКлиентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств ТОГДА
	|			РасчетыСКлиентамиОстаткиИОбороты.Регистратор.Дата
	|		ИНАЧЕ
	|			ЕСТЬNULL(РасчетыСКлиентамиОстаткиИОбороты.Регистратор.ДатаВходящегоДокумента,
	|				РасчетыСКлиентамиОстаткиИОбороты.Регистратор.Дата)
	|		КОНЕЦ
	|	ИНАЧЕ
	|		ДокументыИнтеркампани.Дата
	|	КОНЕЦ КАК Дата,
	|	РегистрАналитикаУчетаПоПартнерам.Партнер 	 КАК Партнер,
	|	ВЫБОР КОГДА РасчетыСКлиентамиОстаткиИОбороты.ЗаказКлиента ССЫЛКА Справочник.ДоговорыКонтрагентов ТОГДА
	|		РасчетыСКлиентамиОстаткиИОбороты.ЗаказКлиента
	|	ИНАЧЕ
	|		РасчетыСКлиентамиОстаткиИОбороты.ЗаказКлиента.Договор
	|	КОНЕЦ										 КАК Договор,
	|	РасчетыСКлиентамиОстаткиИОбороты.Валюта 	 КАК Валюта,
	|	ВЫБОР КОГДА ДокументыИнтеркампани.Документ ЕСТЬ NULL ТОГДА
	|		ВЫБОР КОГДА РасчетыСКлиентамиОстаткиИОбороты.Регистратор.НомерВходящегоДокумента ЕСТЬ NULL
	|		 ИЛИ РасчетыСКлиентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств ТОГДА
	|			Ложь
	|		ИНАЧЕ
	|			Истина
	|		КОНЕЦ
	|	ИНАЧЕ
	|		ДокументыИнтеркампани.ЭтоВходящийДокумент
	|	КОНЕЦ КАК ЭтоВходящийДокумент,
	|	РасчетыСКлиентамиОстаткиИОбороты.СуммаПриход КАК СуммаДолгПартнера,
	|	РасчетыСКлиентамиОстаткиИОбороты.СуммаРасход КАК СуммаНашДолг,
	|	РасчетыСКлиентамиОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	РасчетыСКлиентамиОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ЕСТЬNULL(РеализацияТоваровУслугРеглУчет.Организация, Неопределено) КАК ОрганизацияРеглУчет
	|
	|ПОМЕСТИТЬ РасчетыСПартнерами
	|
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.ОстаткиИОбороты(
	|			&НачалоПериодаСверки,
	|			&ГраницаКонецПериода,
	|			Регистратор,
	|			ДвиженияИГраницыПериода,
	|			АналитикаУчетаПоПартнерам В
	|				(ВЫБРАТЬ
	|					ОтборПоАналитике.КлючАналитики
	|				ИЗ
	|					ОтборПоАналитике)
	|			И (&НеИспользоватьОтборПоДоговору
	|				ИЛИ	ВЫБОР КОГДА ЗаказКлиента ССЫЛКА Справочник.ДоговорыКонтрагентов ТОГДА
	|					ЗаказКлиента
	|				ИНАЧЕ
	|					ЗаказКлиента.Договор
	|				КОНЕЦ = &Договор)
	|	) КАК РасчетыСКлиентамиОстаткиИОбороты
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|		ПО РасчетыСКлиентамиОстаткиИОбороты.АналитикаУчетаПоПартнерам = РегистрАналитикаУчетаПоПартнерам.КлючАналитики
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДокументыИнтеркампани КАК ДокументыИнтеркампани
	|		ПО РасчетыСКлиентамиОстаткиИОбороты.Регистратор = ДокументыИнтеркампани.Документ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслугРеглУчет
	|		ПО РасчетыСКлиентамиОстаткиИОбороты.Регистратор = РеализацияТоваровУслугРеглУчет.Ссылка
	|		И РеализацияТоваровУслугРеглУчет.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|		И &Организация = ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСПоставщикамиОстаткиИОбороты.Период КАК Период,
	|	ЕСТЬNULL(РасчетыСПоставщикамиОстаткиИОбороты.Регистратор, Неопределено) КАК Документ,
	|	ВЫБОР КОГДА ДокументыИнтеркампани.Документ ЕСТЬ NULL ТОГДА
	|		ВЫБОР КОГДА РасчетыСПоставщикамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств ТОГДА
	|			РасчетыСПоставщикамиОстаткиИОбороты.Регистратор.Номер
	|		ИНАЧЕ
	|			ЕСТЬNULL(РасчетыСПоставщикамиОстаткиИОбороты.Регистратор.НомерВходящегоДокумента,
	|				РасчетыСПоставщикамиОстаткиИОбороты.Регистратор.Номер)
	|		КОНЕЦ
	|	ИНАЧЕ
	|		ДокументыИнтеркампани.Номер
	|	КОНЕЦ КАК Номер,
	|	ВЫБОР КОГДА ДокументыИнтеркампани.Документ ЕСТЬ NULL ТОГДА
	|		ВЫБОР КОГДА РасчетыСПоставщикамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств ТОГДА
	|			РасчетыСПоставщикамиОстаткиИОбороты.Регистратор.Дата
	|		ИНАЧЕ
	|			ЕСТЬNULL(РасчетыСПоставщикамиОстаткиИОбороты.Регистратор.ДатаВходящегоДокумента,
	|				РасчетыСПоставщикамиОстаткиИОбороты.Регистратор.Дата)
	|		КОНЕЦ
	|	ИНАЧЕ
	|		ДокументыИнтеркампани.Дата
	|	КОНЕЦ КАК Дата,
	|	РегистрАналитикаУчетаПоПартнерам.Партнер 	 КАК Партнер,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиОстаткиИОбороты.ЗаказПоставщику ССЫЛКА Справочник.ДоговорыКонтрагентов ТОГДА
	|		РасчетыСПоставщикамиОстаткиИОбороты.ЗаказПоставщику
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиОстаткиИОбороты.ЗаказПоставщику.Договор
	|	КОНЕЦ										 КАК Договор,
	|	РасчетыСПоставщикамиОстаткиИОбороты.Валюта 	 КАК Валюта,
	|	ВЫБОР КОГДА ДокументыИнтеркампани.Документ ЕСТЬ NULL ТОГДА
	|		ВЫБОР КОГДА РасчетыСПоставщикамиОстаткиИОбороты.Регистратор.НомерВходящегоДокумента ЕСТЬ NULL
	|		 ИЛИ РасчетыСПоставщикамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств ТОГДА
	|			Ложь
	|		ИНАЧЕ
	|			Истина
	|		КОНЕЦ
	|	ИНАЧЕ
	|		ДокументыИнтеркампани.ЭтоВходящийДокумент
	|	КОНЕЦ КАК ЭтоВходящийДокумент,
	|	РасчетыСПоставщикамиОстаткиИОбороты.СуммаПриход КАК СуммаДолгПартнера,
	|	РасчетыСПоставщикамиОстаткиИОбороты.СуммаРасход КАК СуммаНашДолг,
	|	РасчетыСПоставщикамиОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	РасчетыСПоставщикамиОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ЕСТЬNULL(ПоступлениеТоваровУслугРеглУчет.Организация, Неопределено) КАК ОрганизацияРеглУчет
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.ОстаткиИОбороты(
	|			&НачалоПериодаСверки,
	|			&ГраницаКонецПериода,
	|			Регистратор,
	|			ДвиженияИГраницыПериода,
	|			АналитикаУчетаПоПартнерам В
	|				(ВЫБРАТЬ
	|					ОтборПоАналитике.КлючАналитики
	|				ИЗ
	|					ОтборПоАналитике)
	|			И (&НеИспользоватьОтборПоДоговору
	|				ИЛИ	ВЫБОР КОГДА ЗаказПоставщику ССЫЛКА Справочник.ДоговорыКонтрагентов ТОГДА
	|					ЗаказПоставщику
	|				ИНАЧЕ
	|					ЗаказПоставщику.Договор
	|				КОНЕЦ = &Договор)
	|	) КАК РасчетыСПоставщикамиОстаткиИОбороты
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|		ПО РасчетыСПоставщикамиОстаткиИОбороты.АналитикаУчетаПоПартнерам = РегистрАналитикаУчетаПоПартнерам.КлючАналитики
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДокументыИнтеркампани КАК ДокументыИнтеркампани
	|		ПО РасчетыСПоставщикамиОстаткиИОбороты.Регистратор = ДокументыИнтеркампани.Документ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ."+ИмяДокументаПоступления+" КАК ПоступлениеТоваровУслугРеглУчет
	|		ПО РасчетыСПоставщикамиОстаткиИОбороты.Регистратор = ПоступлениеТоваровУслугРеглУчет.Ссылка
	|		И ПоступлениеТоваровУслугРеглУчет.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет)
	|		И &Организация = ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|
	|ГДЕ
	|	НЕ РасчетыСПоставщикамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.АвансовыйОтчет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Дата				КАК Период,
	|	ДанныеДокумента.Ссылка				КАК Документ,
	|	Расшифровка.НомерВходящегоДокумента	КАК Номер,
	|	Расшифровка.ДатаВходящегоДокумента	КАК Дата,
	|	Расшифровка.Поставщик				КАК Партнер,
	|	ВЫБОР КОГДА Расшифровка.Заказ ССЫЛКА Справочник.ДоговорыКонтрагентов ТОГДА
	|		Расшифровка.Заказ
	|	ИНАЧЕ
	|		Расшифровка.Заказ.Договор
	|	КОНЕЦ								КАК Договор,
	|	Расшифровка.ВалютаВзаиморасчетов	КАК Валюта,
	|	Истина								КАК ЭтоВходящийДокумент,
	|	Расшифровка.СуммаВзаиморасчетов		КАК СуммаДолгПартнера,
	|	0									КАК СуммаНашДолг,
	|	0									КАК СуммаНачальныйОстаток,
	|	0									КАК СуммаКонечныйОстаток,
	|	Неопределено						КАК ОрганизацияРеглУчет
	|ИЗ
	|	Документ.АвансовыйОтчет КАК ДанныеДокумента
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АвансовыйОтчет.ОплатаПоставщикам КАК Расшифровка
	|		ПО Расшифровка.Ссылка = ДанныеДокумента.Ссылка
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Организация = &Организация
	|	И Расшифровка.Контрагент = &Контрагент
	|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериодаСверки И &КонецПериодаСверки
	|	И (&НеИспользоватьОтборПоДоговору
	|		ИЛИ ВЫБОР КОГДА Расшифровка.Заказ ССЫЛКА Справочник.ДоговорыКонтрагентов ТОГДА
	|			Расшифровка.Заказ
	|		ИНАЧЕ
	|			Расшифровка.Заказ.Договор
	|		КОНЕЦ = &Договор)
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	РасчетыСПартнерами.Период				 		КАК Период,
	|	РасчетыСПартнерами.Документ				 		КАК Документ,
	|	РасчетыСПартнерами.Номер				 		КАК Номер,
	|	РасчетыСПартнерами.Дата					 		КАК Дата,
	|	%ПолеПартнер%
	|	%ПолеДоговор%
	|	РасчетыСПартнерами.Валюта				 		КАК Валюта,
	|	РасчетыСПартнерами.ЭтоВходящийДокумент	 		КАК ЭтоВходящийДокумент,
	|	СУММА(РасчетыСПартнерами.СуммаДолгПартнера)	 	КАК СуммаДолгПартнера,
	|	СУММА(РасчетыСПартнерами.СуммаНашДолг)			КАК СуммаНашДолг,
	|	СУММА(РасчетыСПартнерами.СуммаНачальныйОстаток) КАК СуммаНачальныйОстаток,
	|	СУММА(РасчетыСПартнерами.СуммаКонечныйОстаток)	КАК СуммаКонечныйОстаток,
	|	РасчетыСПартнерами.ОрганизацияРеглУчет			КАК ОрганизацияРеглУчет
	|ИЗ
	|	РасчетыСПартнерами КАК РасчетыСПартнерами
	|
	|СГРУППИРОВАТЬ ПО
	|	Период, Документ, Номер, Дата, %Партнер% %Договор% Валюта, ЭтоВходящийДокумент, ОрганизацияРеглУчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|
	|ИТОГИ ПО
	|	%Партнер%
	|	%Договор%
	|	Валюта
	|";
	Возврат сбисОбработатьЗапросВзаиморасчетов(Контекст, ТекстЗапроса);
	
КонецФункции

&НаКлиенте
Функция сбисРасчетСрокаХранения(Контекст) Экспорт
	
	СекундВСутках 		= 86400;
	
	Попытка
		СрокХраненияВСекундах = НачалоДня(Контекст.ТаблДок_СрокГодности) - НачалоДня(Контекст.ТаблДок_ДатаПроизводства);
		СрокХраненияВДнях 	  = СрокХраненияВСекундах / СекундВСутках;
	Исключение
		СрокХраненияВДнях		= 0;
	КонецПопытки; 
	
	Возврат СрокХраненияВДнях;
	
КонецФункции 

