
//Авторизуется по логину/паролю	
&НаКлиенте
Функция АвторизоватьсяПоЛогинуПаролю(Кэш,Логин,Пароль,Отказ=Ложь) Экспорт

	Если Не ЗначениеЗаполнено(Логин) Тогда
	
		ОшибкаАвторизации = МодульОбъектаКлиент().НовыйСбисИсключение(785, "API3.АвторизоватьсяПоЛогинуПаролю",,"Не указаны логин/пароль для авторизации");
		Отказ = Истина;
		Возврат ОшибкаАвторизации;
		
	КонецЕсли;

	ДопПараметры = Новый Структура("СообщатьПриОшибке, ВернутьОшибку, БезАвторизации", Ложь, Истина, Истина);
	МестныйКэш = Кэш;
	
	ДопПараметры.Вставить("ОчиститьПараметры", Истина);
	ПараметрыРезультат = Новый Структура(	"Метод,				Параметры,											ДополнительныеПараметры", 
											"AuthByPassword",	Новый Структура("Login,Password", Логин, Пароль),	ДопПараметры);
	Возврат СбисОтправитьИОбработатьКоманду(Кэш, ПараметрыРезультат.Метод, ПараметрыРезультат.Параметры, ДопПараметры, Отказ);
	
КонецФункции

// Функция - расшифровывает указанный файл
//
// Параметры:
//  ФайлЗначение - Структура	 - с полем Ссылка, ДвоичныеДанные(Н)
// 
// Возвращаемое значение:
//  Строка - расшифрованные данные, если успешно
//
&НаКлиенте
функция ПрочитатьФайлВложения(ФайлВложения, ДопПараметры = Неопределено) Экспорт 
    Перем ДвоичныеДанныеBase64;
	
	Возврат ПолучитьДанныеФайла(МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш(), ФайлВложения.Ссылка);
	
КонецФункции

