
//Авторизуется по логину/паролю	
&НаКлиенте
Функция АвторизоватьсяПоЛогинуПаролю(Кэш,Логин,Пароль,Отказ=Ложь) Экспорт

	Если Не ЗначениеЗаполнено(Логин) Тогда
	
		ОшибкаАвторизации = МодульОбъектаКлиент().НовыйСбисИсключение(785, "API3.АвторизоватьсяПоЛогинуПаролю",,"Не указаны логин/пароль для авторизации");
		Отказ = Истина;
		Возврат ОшибкаАвторизации;
		
	КонецЕсли;

	ДопПараметры = Новый Структура("СообщатьПриОшибке, ВернутьОшибку, БезАвторизации", Ложь, Истина, Истина);
	МестныйКэш = Кэш;
	
	ДопПараметры.Вставить("ОчиститьПараметры", Истина);
	ПараметрыРезультат = Новый Структура(	"Метод,				Параметры,											ДополнительныеПараметры", 
											"AuthByPassword",	Новый Структура("Login,Password", Логин, Пароль),	ДопПараметры);
	Возврат СбисОтправитьИОбработатьКоманду(Кэш, ПараметрыРезультат.Метод, ПараметрыРезультат.Параметры, ДопПараметры, Отказ);
	
КонецФункции

// Функция - расшифровывает указанный файл
//
// Параметры:
//  ФайлЗначение - Структура	 - с полем Ссылка, ДвоичныеДанные(Н)
// 
// Возвращаемое значение:
//  Строка - расшифрованные данные, если успешно
//
&НаКлиенте
функция ПрочитатьФайлВложения(ФайлВложения, ДопПараметры = Неопределено) Экспорт 
    Перем ДвоичныеДанныеBase64;
	
	Возврат ПолучитьДанныеФайла(МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш(), ФайлВложения.Ссылка);
	
КонецФункции

// Читать HTML нужно от типа "ВложениеСБИС" - ВложениеСБИС_Получить с ключом "ВизуализацияДокумента"

&НаКлиенте
функция ПолучитьHTMLПоXML(Кэш, Вложение) Экспорт 
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат", Истина);
	
	Если ТипЗнч(Вложение) = Тип("Структура") Тогда
		
		XMLДокумента = СтрЗаменить(МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "XMLДокумента"), "UTF-8", "windows-1251");
		document = Новый Структура("XML, Тип, Подтип, ВерсияФормата, ПодВерсияФормата", XMLДокумента, "", "", "", "");
		ЗаполнитьЗначенияСвойств(document, Вложение);
		//Костыль на случай, если ПодВерсия есть, но неопределена
		Если document.ПодВерсияФормата = Неопределено Тогда
			 document.ПодВерсияФормата = "";
		КонецЕсли;
		
	Иначе   // для совместимости с внешними функциями (СформироватьРасхождение)
		
		document = Новый Структура("XML", Вложение);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(document) Тогда
		
		Возврат "";
		
	КонецЕсли;

	Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("Шифрование") Тогда
		
		РезультатЗапроса = СБИС_СформироватьHTMLИзXML_Локально(Кэш, document,, Отказ);
		
	Иначе
		
		РезультатЗапроса = СБИС_СформироватьHTMLИзXML(Кэш, document,, Отказ);
		
	КонецЕсли;
	
	Если Отказ Тогда

		Если РезультатЗапроса.code = 306302 Тогда
			ОшибкаСПравами = МодульОбъектаКлиент().НовыйСбисИсключение(РезультатЗапроса, "ExtSDK2.ПолучитьHTMLПоXML",,,
			"У текущего пользователя недостаточно прав доступа для просмотра документа");
			ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(ОшибкаСПравами);
		Иначе 
			ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(РезультатЗапроса);
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат РезультатЗапроса;
	
КонецФункции

