  
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Хвост_" + НазваниеЭтапа).Картинка 
		= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Хвост" + СтатусЭтапа).Картинка;  
		
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ГруппаНадпись_" + НазваниеЭтапа).ЦветФона = ФонГруппы;
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Надпись_" + НазваниеЭтапа).Заголовок = НазваниеЭтапа;
		
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Острие_" + НазваниеЭтапа).Картинка 
		= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Острие" + СтатусЭтапа + АктивностьЭтапа).Картинка;	
		
