&НаКлиенте 
Процедура Показать(ПараметрыОткрытия) Экспорт

	СбисУстановитьФорму(ПараметрыОткрытия);
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ОткрытьМодально();
	#Иначе
		Открыть();
	#КонецЕсли
	
КонецПроцедуры 

&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыОткрытия)
	
	МодульОбъектаКлиент = МодульОбъектаКлиент();
	
	Кэш						= МодульОбъектаКлиент.ПолучитьТекущийЛокальныйКэш();
	
	ЭтаФорма.Заголовок		= ПараметрыОткрытия.ЗаголовокФормы;
	Контрагент				= ПараметрыОткрытия.Контрагент;
	ИдентификаторДокумента	= ПараметрыОткрытия.ИдентификаторДокумента;
	ПараметрыРасхождения	= ПараметрыОткрытия.ПараметрыРасхождения;
	Вложение1С 				= ПараметрыОткрытия.Вложение1С;
	
	Если ПараметрыОткрытия.Свойство("ВложениеСБИС") Тогда
		ВложениеСБИС		= ПараметрыОткрытия.ВложениеСБИС;
	Иначе
		ВложениеСБИС		= Неопределено;
	КонецЕсли;
	
	
	ЛокальнаяПеременная = Ложь;
	Если ПараметрыОткрытия.Свойство("ТребуетсяЗаписьВРасхождение", ЛокальнаяПеременная) Тогда
		ТребуетсяЗаписьВРасхождение = ЛокальнаяПеременная;
	Иначе
		ТребуетсяЗаписьВРасхождение = Истина;
	КонецЕсли;
	
	КнопкаЗаписатьНажата = Ложь;
	
	// Получим ТаблДок1С
	Если Вложение1С.Свойство("СтруктураДокумента") Тогда
		КореньДанныхДокумента1С = Вложение1С.СтруктураДокумента;
	Иначе
		КореньДанныхДокумента1С = Вложение1С.СтруктураФайла;
	КонецЕсли;
	Если КореньДанныхДокумента1С.Файл.Документ.Свойство("ТаблДок") Тогда		
		ТаблДок1С = КореньДанныхДокумента1С.Файл.Документ.ТаблДок.СтрТабл;		
	ИначеЕсли КореньДанныхДокумента1С.Файл.Документ.Свойство("СписокСтрТабл") Тогда
		ТаблДок1С = КореньДанныхДокумента1С.Файл.Документ.СписокСтрТабл.СтрТабл;
	Иначе
		ТаблДок1С = Неопределено;
		СбисИсключение = МодульОбъектаКлиент.НовыйСбисИсключение(500, "ФормаОбратногоСопоставления.СбисУстановитьФорму",,,"На вложении не обнаружен табличный документ.");
		ВызватьИсключение МодульОбъектаКлиент.СбисИсключение_ВСтроку(СбисИсключение);
	КонецЕсли;
	
	// Получим ТаблДокСБИС
	Если ВложениеСБИС = Неопределено Тогда
		ТаблДокСБИС = Неопределено;
	Иначе
		Если ВложениеСБИС.Свойство("СтруктураДокумента") Тогда
			КореньДанныхДокументаСБИС = ВложениеСБИС.СтруктураДокумента;
		Иначе
			КореньДанныхДокументаСБИС = ВложениеСБИС.СтруктураФайла;
		КонецЕсли;
		Если КореньДанныхДокументаСБИС.Файл.Документ.Свойство("ТаблДок") Тогда		
			ТаблДокСБИС = КореньДанныхДокументаСБИС.Файл.Документ.ТаблДок.СтрТабл;		
		ИначеЕсли КореньДанныхДокументаСБИС.Файл.Документ.Свойство("СписокСтрТабл") Тогда
			ТаблДокСБИС = КореньДанныхДокументаСБИС.Файл.Документ.СписокСтрТабл.СтрТабл;
		Иначе
			ТаблДокСБИС = Неопределено;
		КонецЕсли;
	КонецЕсли;
	Если ТаблДокСБИС = Неопределено Тогда
		СбисИсключение = МодульОбъектаКлиент.НовыйСбисИсключение(500, "ФормаОбратногоСопоставления.СбисУстановитьФорму",,,"На документе основании не обнаружен табличный документ.");
		ВызватьИсключение МодульОбъектаКлиент.СбисИсключение_ВСтроку(СбисИсключение);
	КонецЕсли;
	
	// Для УФ сначала получаем группу НоменклатураСБИС, а потом изменяем уже подчиненный элемент
	ЭлементНоменклатураСБИС = МодульОбъектаКлиент.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставлений.ТаблицаСопоставленийНоменклатураСБИС");
	Если ЭлементНоменклатураСБИС = Неопределено Тогда
		ЭлементНоменклатураСБИС = ЭтаФорма;
		НазваниеНоменклатураКонтрагента = "ТаблицаСопоставлений.НоменклатураКонтрагента";
		НазваниеТипКодаСБИС = "ТаблицаСопоставлений.ТипКодаСБИС";
	Иначе
		НазваниеНоменклатураКонтрагента = "ТаблицаСопоставленийНоменклатураКонтрагента";
		НазваниеТипКодаСБИС = "ТаблицаСопоставленийТипКодаСБИС";
	КонецЕсли;
	
	// Заполняем список ТипКодаСБИС
	ПорядокАвтоСопоставления = МодульОбъектаКлиент.ПолучитьЗначениеПараметраСБИС("ПорядокАвтоматическогоСопоставления");
	Если Не ЗначениеЗаполнено(ПорядокАвтоСопоставления) Тогда
		ПорядокАвтоСопоставления = МодульОбъектаКлиент.ПорядокАвтоматическогоСопоставленияПоУмолчаниюКлиент();
	Иначе
		ПорядокАвтоСопоставления = МодульОбъектаКлиент.СбисРазложитьСтрокуВМассивПодстрок(ПорядокАвтоСопоставления, ",");
	КонецЕсли;
	ПорядокАвтоСопоставления.Добавить("Название"); // Поле, по которому должна быть возможность сопоставить, но не автоматически

	ЭлементТипКода = МодульОбъектаКлиент.ПолучитьЭлементФормыОбработки(ЭлементНоменклатураСБИС, НазваниеТипКодаСБИС);
	ОписаниеПараметраИзменить = Новый ФиксированнаяСтруктура("Форма, Реквизит", ЭлементНоменклатураСБИС, НазваниеТипКодаСБИС);
	ПараметрыИзменить = Новый Структура("СписокВыбора", ПорядокАвтоСопоставления);
	МодульОбъектаКлиент.ИзменитьЭлементФормыОбработки(ОписаниеПараметраИзменить, ПараметрыИзменить);
	
	// Заполняем список НоменклатураКонтрагента
	Если Не ТаблДокСБИС = Неопределено Тогда
		ОписаниеПараметраИзменить = Новый ФиксированнаяСтруктура("Форма, Реквизит", ЭлементНоменклатураСБИС, НазваниеНоменклатураКонтрагента);
		СписокСтрокДокументаКонтрагента = Новый СписокЗначений;
		Для Каждого СтрТаблДокСБИС из ТаблДокСБИС Цикл
			СписокСтрокДокументаКонтрагента.Добавить(СтрТаблДокСБИС, СтрТаблДокСБИС.Название); 
		КонецЦикла;
		ПараметрыИзменить = Новый Структура("СписокВыбора", СписокСтрокДокументаКонтрагента);
		МодульОбъектаКлиент.ИзменитьЭлементФормыОбработки(ОписаниеПараметраИзменить, ПараметрыИзменить);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Результат", Неопределено);
	
	ЗаполнитьТаблицуСопоставленийПоУмолчанию();
	
	Если ХарактеристикиИспользуютсяВДокументе Тогда
		МодульОбъектаКлиент.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставлений.Характеристика1С").Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуСопоставленийПоУмолчанию(Команда = Неопределено)
	
	МодульОбъектаКлиент = МодульОбъектаКлиент();
	
	ТаблицаСопоставлений.Очистить();
	
	ФормаРаботыСНоменклатурой = МодульОбъектаКлиент.ПолучитьЗначениеПараметраСбис("МодульСопоставлениеНоменклатуры");
	
	Если Вложение1С.Свойство("КлассыСопоставленияНоменклатур") Тогда
		ОбогащенныеДанныеНоменклатурыДляСопоставления = Вложение1С.КлассыСопоставленияНоменклатур;
	Иначе
		ОбогащенныеДанныеНоменклатурыДляСопоставления = Вложение1С.Параметры.КлассыСопоставленияНоменклатур;
		Вложение1С.Вставить("КлассыСопоставленияНоменклатур", ОбогащенныеДанныеНоменклатурыДляСопоставления);
	КонецЕсли;
	
	Если МодульОбъектаКлиент.ПолучитьЗначениеПараметраСбис("РежимОтладки") Тогда
		
		ДанныеЛогирования = Новый Структура;
		ДанныеЛогирования.Вставить("Тип", 			"СопоставлениеНоменклатуры");
		ДанныеЛогирования.Вставить("Идентификатор", МодульОбъектаКлиент.ВложениеСБИС_Получить(Вложение1С, "Название"));
		ДанныеЛогирования.Вставить("Вызов", 		ОбогащенныеДанныеНоменклатурыДляСопоставления);
		ДанныеЛогирования.Вставить("Модуль", 		"Файл_Шаблон");
		
		МодульОбъектаКлиент.СохранитьОтладочныеДанныеСБИС(ДанныеЛогирования);
	КонецЕсли;
	
	НомерСтрокиТаблДок = 0;
	Для Каждого СтокаСопоставления Из ОбогащенныеДанныеНоменклатурыДляСопоставления Цикл
		НСтрокаТаблицы = ТаблицаСопоставлений.Добавить();
		
		КоличествоВДокументе1С  = Число(ТаблДок1С[НомерСтрокиТаблДок].Кол_во);
		ЦенаВДокументе1С 	    = Число(ТаблДок1С[НомерСтрокиТаблДок].Цена);
		НСтрокаТаблицы.ИдСтроки = НомерСтрокиТаблДок;
		НомерСтрокиТаблДок 	    = НомерСтрокиТаблДок + 1;
		
		НСтрокаТаблицы.КоличествоВДокументе1С		= КоличествоВДокументе1С;
		НСтрокаТаблицы.ЦенаВДокументе1С				= ЦенаВДокументе1С;
		
		НСтрокаТаблицы.НоменклатураСБИС				= СтокаСопоставления.НоменклатураСБИС.Наименование;
		НСтрокаТаблицы.GTIN_СБИС					= СтокаСопоставления.НоменклатураСБИС.GTIN;
		НСтрокаТаблицы.КодСБИС						= СтокаСопоставления.НоменклатураСБИС.Код;
		НСтрокаТаблицы.ТипКодаСБИС					= СтокаСопоставления.НоменклатураСБИС.ТипКода;
		НСтрокаТаблицы.НоменклатураСБИСЗначение     = Новый Структура(СтокаСопоставления.НоменклатураСБИС.ТипКода, СтокаСопоставления.НоменклатураСБИС.Код);

		Для Каждого Номенклатура1С Из СтокаСопоставления.Номенклатура1С Цикл
			НСтрокаТаблицы.Номенклатура1С			= Номенклатура1С.Ключ;       
			НСтрокаТаблицы.Коэффициент1СкСБИС       = Номенклатура1С.Значение.Коэффициент;
			Для Каждого Характеристика1С Из Номенклатура1С.Значение.Характеристики Цикл
				НСтрокаТаблицы.Характеристика1С		= Характеристика1С;
				Прервать;
			КонецЦикла;
			Если Номенклатура1С.Значение.Единицы.Количество() Тогда
				Для Каждого Единица1С Из Номенклатура1С.Значение.Единицы Цикл
					НСтрокаТаблицы.Единица1С		= Единица1С.Ключ;
					Коэффициент1С = Число(Единица1С.Значение.Коэффициент);
					НСтрокаТаблицы.Коэффициент1С	= ?(Коэффициент1С = 0, 1, Коэффициент1С);
					Прервать;
				КонецЦикла;
			Иначе
				НСтрокаТаблицы.Коэффициент1С = 1;
			КонецЕсли;
			
			Прервать;
		КонецЦикла;
		
		Если СтокаСопоставления.НоменклатураСБИС.Единицы.Количество() Тогда
			Для Каждого ЕдиницаСБИС Из СтокаСопоставления.НоменклатураСБИС.Единицы Цикл
				//КоэффициентСБИС = Число(ЕдиницаСБИС.Значение.Коэффициент);
				//НСтрокаТаблицы.КоэффициентСБИС			= ?(КоэффициентСБИС = 0, 1, КоэффициентСБИС);
				НСтрокаТаблицы.НаименованиеЕдиницыСБИС	= ЕдиницаСБИС.Значение.Название;
				НСтрокаТаблицы.ОКЕИ_ЕдиницыСБИС			= ЕдиницаСБИС.Значение.ОКЕИ;
				НСтрокаТаблицы.КоэффициентСБИС			= Число(ЕдиницаСБИС.Значение.Коэффициент);
				Прервать;
			КонецЦикла;
		Иначе
			НСтрокаТаблицы.КоэффициентСБИС = 1;
		КонецЕсли;
		
		// Оставлено на случай, если понадобится 2 коэффициента
		//Если ЗначениеЗаполнено(НСтрокаТаблицы.Коэффициент1С)
		//		И ЗначениеЗаполнено(НСтрокаТаблицы.КоэффициентСБИС) Тогда
		//	НСтрокаТаблицы.Коэффициент1СкСБИС		= НСтрокаТаблицы.Коэффициент1С / НСтрокаТаблицы.КоэффициентСБИС;
		//Иначе
		//	НСтрокаТаблицы.Коэффициент1СкСБИС		= 1;
		//КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НСтрокаТаблицы.Коэффициент1СкСБИС) Тогда
            НСтрокаТаблицы.Коэффициент1СкСБИС = 1;
		КонецЕсли;
		
		НСтрокаТаблицы.КоличествоПересчитанное		= НСтрокаТаблицы.КоличествоВДокументе1С / НСтрокаТаблицы.Коэффициент1СкСБИС;
		НСтрокаТаблицы.ЦенаПересчитанная			= НСтрокаТаблицы.ЦенаВДокументе1С * НСтрокаТаблицы.Коэффициент1СкСБИС;
	КонецЦикла;
	
КонецПроцедуры

