
&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	
	КнопкаЗаписатьНажата = Истина;
	
	ОшибкиЗаполнения = ОшибкиЗаполненияДанныхСопоставления();
	Если ОшибкиЗаполнения.Количество() Тогда
		МодульОбъектаКлиент().СбисСообщить("Имеются ошибки, которые необходимо исправить перед сохранением результата:");
		Для Каждого Ошибка Из ОшибкиЗаполнения Цикл
			МодульОбъектаКлиент().СбисСообщить(Ошибка + Символы.ПС);
		КонецЦикла;
		КнопкаЗаписатьНажата = Ложь;
		Возврат;
	КонецЕсли;
	
	ЗаписатьСопоставленияИПоложитьВДокументДанные();
	
	ПараметрыРасхождения.Вставить("ДокументДанные", ДокументДанные);
	
	ПараметрыФормы.Результат = ПараметрыРасхождения;
	
	Закрыть(ПараметрыФормы.Результат);
	
КонецПроцедуры

// Функция - Проверить наличие критических ошибок
// Проверяет наличие ошибок, при которых запрещено сохранять внесённые вручную изменения сопоставлений 
//
// Возвращаемое значение:
// СписокОшибок  - строковый массив ошибок, при которых будем запрещать запись данных по сопоставлению
//
&НаКлиенте
Функция ОшибкиЗаполненияДанныхСопоставления()
	
	ОчиститьСообщения();
	СписокОшибок = Новый Массив; 
	СчетчикСтрок = 1;
	
	Для Каждого Строка Из ТаблицаСопоставлений Цикл
		
		Если Не ЗначениеЗаполнено(Строка.НоменклатураСБИС) Тогда
			// Не проверяем, если не заполнено основное поле, т.к. в таком случае мы берем данные из документа 1С
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.ОКЕИ_ЕдиницыСБИС) Тогда
			Если Не ЗначениеЗаполнено(Строка.НаименованиеЕдиницыСБИС) Тогда
				СписокОшибок.Добавить("При заполненном поле ""ОКЕИ"", поле ""Единица""(наим.) также должно быть заполнено в строке № " + СчетчикСтрок);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Строка.Коэффициент1СкСБИС) Тогда
				СписокОшибок.Добавить("При заполненном поле ""ОКЕИ"", поле ""Коэфф."" также должно быть заполнено в строке № " + СчетчикСтрок);
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(Строка.НаименованиеЕдиницыСБИС)
				И Не ЗначениеЗаполнено(Строка.Коэффициент1СкСБИС) Тогда
			СписокОшибок.Добавить("При заполненном поле ""Единица""(наим.), поле ""Коэфф."" также должно быть заполнено в строке № " + СчетчикСтрок);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.КодСБИС)
				И Не ЗначениеЗаполнено(Строка.ТипКодаСБИС) Тогда
			СписокОшибок.Добавить("При заполненном поле ""Код"", поле ""Тип кода"" также должно быть заполнено в строке № " + СчетчикСтрок);
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Строка.КодСБИС) И Не ЗначениеЗаполнено(Строка.GTIN_СБИС) Тогда
			СписокОшибок.Добавить("Одно из полей: ""Код"" или ""Штрихкод"" - должно быть заполнено в строке № " + СчетчикСтрок);
		КонецЕсли;
		
		СчетчикСтрок = СчетчикСтрок + 1;
		
	КонецЦикла;
	
	Возврат СписокОшибок;
	
КонецФункции

