
&НаКлиенте
Функция РаботаСГосКонтрактами(СоставПакета) Экспорт
	
	// Допилить позже на доп параметры состава пакета, когда будет приходить
	Возврат ПолучитьЗначениеПараметраСБИС("ПоддержкаОбменаЕИС")
		И НРег(СоставПакета_Получить(СоставПакета, "РеализацияЕИС")) = "да";
	
КонецФункции

&НаКлиенте
Функция ПозГКПоОписаниюНоменклатурыДокумента(СтрокаДокумента, ДопПараметры = Неопределено) Экспорт

	Если ТипЗнч(СтрокаДокумента) <> Тип("Структура") Тогда
		Возврат 0;
	КонецЕсли;

	ПараметрыНоменклатуры = Неопределено;

	Если Не СтрокаДокумента.Свойство("НоменклатураДокументаРасш_Параметры", ПараметрыНоменклатуры) Тогда
		Возврат 0;
	КонецЕсли;

	ПараметрыНоменклатуры = СтрЗаменить(ПараметрыНоменклатуры, ",", Символы.ПС);
	ПараметрыСоответствием = Новый Соответствие;
	
	Для НомерПараметра = 1 По СтрЧислоСтрок(ПараметрыНоменклатуры) Цикл

		КлючЗначение = СтрЗаменить(СокрЛП(СтрПолучитьСтроку(ПараметрыНоменклатуры, НомерПараметра)), "=>", Символы.ПС);
		Ключ = СтрПолучитьСтроку(КлючЗначение, 1);
		Значение = СтрПолучитьСтроку(КлючЗначение, 2);
		ПараметрыСоответствием.Вставить(Сред(Ключ, 2, СтрДлина(Ключ) - 2), Сред(Значение, 2, СтрДлина(Значение) - 2));

	КонецЦикла;
	
	Если ПараметрыСоответствием.Получить("inf_ПозГК") = Неопределено Тогда
		Возврат 0;
	Иначе
		Возврат Число(ПараметрыСоответствием.Получить("inf_ПозГК"));
	КонецЕсли;

КонецФункции
