
// Функция - заполняет список доступных параметров выбытия кодов маркировки
// 
// Возвращаемое значение:
//  Массив - список параметров причин выбытия кодов маркировки
//  
&НаКлиенте 
Функция ПричиныВыводаИзОборота(ПараметрыДокумента = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Кэш = ГлавноеОкно.Кэш; 
	ТекущийРаздел = Кэш.Текущий.Раздел;
	
	Если ТекущийРаздел = "1" Тогда
		ПричиныВывода = ПричиныВыводаВходящихДокументов(ПараметрыДокумента, ДопПараметры);	
	Иначе
		ПричиныВывода = ПричиныВыводаИсходящихДокументов(ПараметрыДокумента, ДопПараметры);	
	КонецЕсли;
		
	Возврат ПричиныВывода;  
	
КонецФункции

&НаКлиенте
Функция ПричиныВыводаВходящихДокументов(ПараметрыДокумента, ДопПараметры)    
	
	ПричиныВывода = Новый Массив();
	ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Без вывода из оборота",Истина,"0"));
	ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Приобретение гос предприятием",Ложь,"1")); 
	ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Использование для собственных нужд",Ложь,"2"));  
	ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Безвозмездная передача",Ложь,"3"));   
	ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Передача комиссионеру/агенту",Ложь,"9"));
	ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Возврат комитенту/принципалу",Ложь,"10"));	 
	ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Для производственных нужд",Ложь,"12"));
	
	Возврат ПричиныВывода;
	
КонецФункции

&НаКлиенте
Функция ПричиныВыводаИсходящихДокументов(ПараметрыДокумента, ДопПараметры)     
	
	Перем КодУчастника, лИностраннаяОрганизация; 
	
	Если НЕ ПараметрыДокумента = Неопределено
		И ПараметрыДокумента.Свойство("to_not_participant") Тогда
		КодУчастника = ПараметрыДокумента.to_not_participant;
	КонецЕсли;   
	
	Если НЕ ДопПараметры = Неопределено
		И ДопПараметры.Свойство("ИностраннаяОрганизация") Тогда
		лИностраннаяОрганизация = ДопПараметры.ИностраннаяОрганизация;
	КонецЕсли; 
	
	лИностраннаяОрганизация = лИностраннаяОрганизация = Истина;
	
	ПричиныВывода = Новый Массив();
	
	Если НЕ КодУчастника = Неопределено
		И НРЕГ(КодУчастника) = "true"
		И НЕ лИностраннаяОрганизация Тогда
		
		ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Собственные нужды покупателя",Истина,"2"));  
		ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Безвозмездная передача",Ложь,"3"));  
		ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Дистанционная торговля",Ложь,"4")); 
		ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Продажа по образцам",Ложь,"11")); 
		ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Производственные нужды покупателя",Ложь,"12"));  
		ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Гос. контракт с выводом из оборота",Ложь,"16")); 
		
	ИначеЕсли лИностраннаяОрганизация Тогда
		
		ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Вывод из оборота",Ложь,"14"));  
		ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Трансграничная торговля",Ложь,"15"));  
		
	Иначе 
		
		ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Без вывода из оборота",Истина,"0")); 
		ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Собственные нужды покупателя",Ложь,"2"));  
		ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Безвозмездная передача",Ложь,"3"));
		ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Дистанционная торговля",Ложь,"4"));
		ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Передача комиссионеру/агенту",Ложь,"9"));
		ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Возврат комитенту/принципалу",Ложь,"10")); 
		ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Продажа по образцам",Ложь,"11")); 
		ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Производственные нужды покупателя",Ложь,"12"));  
		ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Гос. контракт с выводом из оборота",Ложь,"16")); 
		ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Гос. контракт без вывода из оборота",Ложь,"17"));   
		ПричиныВывода.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Немаркированная табачная продукция и сырье",Ложь,"18")); 
		
	КонецЕсли;
	
	Возврат ПричиныВывода; 
	
КонецФункции

// Функция - заполняет список доступных параметров участников оборота маркируемой продукции
// 
// Возвращаемое значение:
//  Массив - список параметров участников оборота маркируемой продукции
// 
&НаКлиенте
Функция ПараметрыУчастиковОборота() Экспорт
	ПараметрыУчастиков = Новый Массив(); 
	ПараметрыУчастиков.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Покупатель зарегистрирован в ГИС МТ",Истина,"false"));
	ПараметрыУчастиков.Добавить(Новый Структура("Причина,ПоУмолчанию,КодПричины","Покупатель не зарегистрирован в ГИС МТ",Ложь,"true")); 
	Возврат ПараметрыУчастиков; 
КонецФункции  

// Функция - возвращает список для получения складских параметров документа СБИС Онлайн
// 
// Возвращаемое значение:
//  Массив - список складских параметров
//
&НаКлиенте
Функция СписокСкладскихПараметров()  
	СписокПараметров = Новый Массив;
	СписокПараметров.Добавить("marking_shipment_reason");    
	СписокПараметров.Добавить("to_not_participant");
	СписокПараметров.Добавить("markingContractNumber");
	Возврат СписокПараметров;
КонецФункции 

//Функция возвращает складские параметры документа СБИС Онлайн, для вкладки Маркировка формы просмотра документа
//
// Параметры:
//  СоставПакета
//
//	ЗапрашиваемыеПараметры   - Структура, с массивом запрашиваемых параметров метода
//               
//  ДопПараметры   - Структура, Неопределено - Доп параметры
//
// Возвращаемое значение:
//   Структура
//
&НаКлиенте
Функция ПолучитьСкладскиеПараметрыДокумента(СоставПакета, ДопПараметры = Неопределено) Экспорт
	
	Перем лКонтрагент, лИностраннаяОрганизация;
		
	ПараметрыДокументаСбис = ПрочитатьСкладскиеПараметрыДокумента(СоставПакета, ДопПараметры);   
	
	Если СоставПакета.Свойство("Контрагент", лКонтрагент) Тогда 
		лИностраннаяОрганизация = МодульОбъектаКлиент().ПрочитатьДополнительныйПараметрСтороны(лКонтрагент, "ИностраннаяОрганизация");
	КонецЕсли; 
	
	ДопПараметрыСтороны = Новый Структура; 
	ДопПараметрыСтороны.Вставить("ИностраннаяОрганизация", лИностраннаяОрганизация);
	
	ИдентификаторГосконтракта	= ПолучитьИдентификаторГосконтракта(ПараметрыДокументаСбис);  
	УчастникиОборота			= ЗаполнитьУчастникОборота(ПараметрыДокументаСбис);  
	ПричиныВывода				= ЗаполнитьСписокПричинВывода(ПараметрыДокументаСбис, ДопПараметрыСтороны);
	
	Если ЗначениеЗаполнено(ПараметрыДокументаСбис) Тогда
		
		СкладскиеПараметрыДокумента = ПараметрыДокументаСбис;
		
	Иначе  
		
	СкладскиеПараметрыДокумента = Новый Структура;   
	
	КонецЕсли;		
	
	СкладскиеПараметрыДокумента.Вставить("ПричиныВыводаИзОборота", 		ПричиныВывода.СписокПричинВывода); 
	СкладскиеПараметрыДокумента.Вставить("ПараметрыУчастниковОборота", 	УчастникиОборота.СписокУчастников);
	СкладскиеПараметрыДокумента.Вставить("ОтправитьКодыМаркировки", 	УчастникиОборота.ОтправитьКодыМаркировки);
	СкладскиеПараметрыДокумента.Вставить("ИдентификаторГосконтракта", 	ИдентификаторГосконтракта);  
	СкладскиеПараметрыДокумента.Вставить("ПричинаВывода", 				ПричиныВывода.ПричинаВыводаПоУмолчанию); 
	СкладскиеПараметрыДокумента.Вставить("КодПричиныВывода", 			ПричиныВывода.КодПричиныВывода);
	СкладскиеПараметрыДокумента.Вставить("УчастникОборота", 			УчастникиОборота.УчастникОборотаПоУмолчанию); 
	СкладскиеПараметрыДокумента.Вставить("ПоказатьГосконтракт", 		ПричиныВывода.ПоказатьГосконтракт); 
	
	Возврат СкладскиеПараметрыДокумента;

КонецФункции  

// Функция возвращает результат работы метода ExtSysMarking.GetParams
//
// Параметры:
//  СоставПакета  - Структура - обрабатываемый пакет (документ)
//  ДопПараметры  - Структура - Набор полей, работа с которыми может расширить результат работы функции.
//
// Возвращаемое значение:
//   Структура   - Результат вызова. Код результата или ошибка
//
&НаКлиенте
Функция ПрочитатьСкладскиеПараметрыДокумента(СоставПакета, ДопПараметры = Неопределено) 
	
	Кэш = ГлавноеОкно.Кэш;  
	
	ЗапрашиваемыеПараметры = СписокСкладскихПараметров();

	ПараметрыВызова = Новый Структура;  
	ПараметрыВызова.Вставить("ИдДок",СоставПакета.Идентификатор);
	ПараметрыВызова.Вставить("paramsList",ЗапрашиваемыеПараметры);
	 
	ФлагОшибки = Ложь;
	РезультатВызова = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ExtSysMarking_GetParams(ПараметрыВызова, Новый Структура("Кэш", Кэш), ФлагОшибки);
	Если ФлагОшибки Тогда
		ВызватьСбисИсключение(РезультатВызова, "МодульОбъектаКлиент.ПрочитатьСкладскиеПараметрыДокумента");
	КонецЕсли;   
	
	Возврат РезультатВызова;
	
КонецФункции

// Функция, из полученных параметров документа СБИС, возвращает номер госконтракта
//
// Параметры:
//  СкладскиеПараметрыДокумента	 - Структура - Складские параметры документа СБИС
//
&НаКлиенте
 Функция ПолучитьИдентификаторГосконтракта(ПараметрыДокумента) 
	 
	Перем НомерГосконтракта; 
	 
	Если ПараметрыДокумента.Свойство("markingContractNumber",НомерГосконтракта) 
		И НЕ НомерГосконтракта = Неопределено Тогда 
		ИдентификаторГосконтракта = НомерГосконтракта;   
	Иначе
		ИдентификаторГосконтракта = "";
	КонецЕсли;
	
	Возврат ИдентификаторГосконтракта;
		
КонецФункции

// Функция возвращает список параметров участников оборота маркируемой продукции, для вкладки Маркировка, формы просмотра документа
//
// Параметры:
//  СкладскиеПараметрыДокумента	 - Массив - данные документа, полученные при вычитывании складских параметров документа СБИС Онлайн 
// 
&НаКлиенте
Функция ЗаполнитьУчастникОборота(ПараметрыДокумента) 
	
	Перем КодУчастника; 
	
	УчастникиОборота = Новый Структура;
	СписокУчастников = Новый Массив;
	
	МассивПараметровУчастиковОборота = ПараметрыУчастиковОборота();
	
	ОбновлятьПричину = Истина;
	Для Каждого ЭлМасс ИЗ МассивПараметровУчастиковОборота Цикл
		СписокУчастников.Добавить(ЭлМасс.Причина);  
		Если ПараметрыДокумента.Свойство("to_not_participant",КодУчастника) 
			И НЕ КодУчастника = Неопределено
			И ЭлМасс.КодПричины = НРЕГ(КодУчастника) Тогда
			УчастникОборота = ЭлМасс.Причина; 
			ОбновлятьПричину = Ложь;
		ИначеЕсли ЭлМасс.ПоУмолчанию И ОбновлятьПричину Тогда
			УчастникОборота = ЭлМасс.Причина;  
		Иначе
			//
		КонецЕсли; 
	КонецЦикла;	 
	
	Если НРЕГ(КодУчастника) = "true" Тогда
		ОтправитьКодыМаркировки = Истина; 
	Иначе
		ОтправитьКодыМаркировки = Ложь;
	КонецЕсли; 
	
	УчастникиОборота.Вставить("СписокУчастников", СписокУчастников);
	УчастникиОборота.Вставить("УчастникОборотаПоУмолчанию", УчастникОборота); 
	УчастникиОборота.Вставить("ОтправитьКодыМаркировки", ОтправитьКодыМаркировки);
	
	Возврат УчастникиОборота;	
		
КонецФункции 

// Функция возвращает список причин выдода из оборота, для вкладки Маркировка, формы просмотра документа
//
// Параметры:
//  СкладскиеПараметрыДокумента	 - Массив - данные документа, полученные при вычитывании складских параметров документа СБИС Онлайн 
// 
&НаКлиенте
Функция ЗаполнитьСписокПричинВывода(ПараметрыДокумента,ДопПараметры = Неопределено) 
	
	Перем КодПричиныВывода, ПричинаВывода; 
	
	Кэш = ГлавноеОкно.Кэш;
	
	ПричиныВывода = Новый Структура;
	СписокПричинВывода = Новый Массив; 
	
	Если НЕ ПараметрыДокумента = Неопределено
		И ПараметрыДокумента.Свойство("marking_shipment_reason",КодПричиныВывода) 
		И (КодПричиныВывода = "1"
		Или КодПричиныВывода = "16"
		Или КодПричиныВывода = "17") Тогда
		ПоказатьГосконтракт = Истина;
	Иначе
		ПоказатьГосконтракт = Ложь;
	КонецЕсли;

	МассивПричинВыводаИзОборота = ПричиныВыводаИзОборота(ПараметрыДокумента, ДопПараметры);
	
	Индекс = Кэш.ОбщиеФункции.ВыбратьДанныеСертификата(МассивПричинВыводаИзОборота,КодПричиныВывода,"КодПричины");  
	
	Если Индекс = Неопределено Тогда
		Индекс = Кэш.ОбщиеФункции.ВыбратьДанныеСертификата(МассивПричинВыводаИзОборота,Истина,"ПоУмолчанию"); 
		//Тут подумать над установкой причины, т.к. она не совпадает с типом участника оборота, завязавшись на КодПричиныВывода, раз она там есть 
	КонецЕсли;
	
	Если НЕ Индекс = Неопределено Тогда // Временный костыль для имитации поведения онлайна при определении причины вывода для ЕАЭС
		ПричинаВывода = МассивПричинВыводаИзОборота[Индекс].Причина; 
		КодВывода = МассивПричинВыводаИзОборота[Индекс].КодПричины;
	КонецЕсли;	
		
	
	Для Каждого ЭлМасс ИЗ МассивПричинВыводаИзОборота Цикл    
		СписокПричинВывода.Добавить(ЭлМасс.Причина);  
	КонецЦикла;	 
					
   	ПричиныВывода.Вставить("СписокПричинВывода",СписокПричинВывода);
	ПричиныВывода.Вставить("ПричинаВыводаПоУмолчанию",ПричинаВывода);
	ПричиныВывода.Вставить("ПоказатьГосконтракт",ПоказатьГосконтракт);
	ПричиныВывода.Вставить("КодПричиныВывода",КодВывода);
	
	Возврат ПричиныВывода;
	
КонецФункции

// Получение состояния проверки из ДокументРасширение.Параметры.CrptState
//
// Параметры:
//  СоставПакета  - Структура
//               
//  ДопПараметры   - Структура, Неопределено - Доп параметры
//
// Возвращаемое значение:
//   Строка
//
&НаКлиенте
Функция ЗапроситьСостояниеПроверки(СоставПакета, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;   

	ПараметрыВызова = Новый Структура;  
	ПараметрыВызова.Вставить("ИдДок",СоставПакета.Идентификатор);
	
	Возврат Кэш.Интеграция.ExtSysMarking_CheckState(ПараметрыВызова, Новый Структура("Кэш", Кэш));

КонецФункции     

// Функция возвращает список номенклатуры документа СБИС
//
// Параметры:
//  СоставПакета  - Структура
//               
//  ДопПараметры   - Структура, Неопределено - Доп параметры
//
// Возвращаемое значение:
//   Структура
//
&НаКлиенте
Функция СоставМаркируемыхПозиций(СоставПакета, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;   
	
	ПараметрыФильтра = Новый Структура; 
	ПараметрыФильтра.Вставить("docflowId",СоставПакета.Идентификатор);

    ПараметрыВызова = Новый Структура; 	
	ПараметрыВызова.Вставить("Фильтр",ПараметрыФильтра);
	
	Возврат Кэш.Интеграция.ExtSysMarking_NumList(ПараметрыВызова, Новый Структура("Кэш", Кэш));

КонецФункции     

// Получение параметров из SerialNumber.CustomList
//
// Параметры:
//  СоставПакета  - Структура
//               
//  ДопПараметры   - Структура, Неопределено - Доп параметры
//
// Возвращаемое значение:
//   Структура
//
&НаКлиенте
Функция ВернутьПараметрыНоменклатуры(СоставПакета, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;   

	ПараметрыВызова = Новый Структура;  
	ПараметрыВызова.Вставить("ИдДок",СоставПакета.Идентификатор); 
	ПараметрыВызова.Вставить("КодНоменклатуры",ДопПараметры.НоменклатураСбис); 
	
	Отказ = Ложь;
	РезультатВызова = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ExtSysMarking_NomCheckStateByNomDoc(ПараметрыВызова, Новый Структура("Кэш", Кэш), Отказ);
	Если Отказ Тогда
		ВызватьСбисИсключение(РезультатВызова, "МодульОбъектаКлиент.ВернутьПараметрыНоменклатуры");
	КонецЕсли;
	
	Возврат РезультатВызова;

КонецФункции        

//Установка складских параметров документа ExtSysMarking.SetParam
//
// Параметры:
//  СоставПакета  - Структура
//  УстанавливаемыеПараметры   - Структура
//		КодПричины
//		КодУчастикаОборота
//
// Возвращаемое значение:
//   Структура
//
&НаКлиенте
Функция ИзменитьСкладскойПараметрДокумента(СоставПакета, УстанавливаемыеПараметры) Экспорт 
	Перем ЛНовоеЗначениеУстановить; 
	
	ПараметрыВызова = Новый Структура("ИдДок, name, value",СоставПакета.Идентификатор);  
	Если		УстанавливаемыеПараметры.Свойство("КодПричины",			ЛНовоеЗначениеУстановить) Тогда
		ПараметрыВызова.Вставить("name",	"marking_shipment_reason");
		ПараметрыВызова.Вставить("value",	ЛНовоеЗначениеУстановить);
	ИначеЕсли   УстанавливаемыеПараметры.Свойство("КодУчастикаОборота", ЛНовоеЗначениеУстановить) Тогда
		ПараметрыВызова.Вставить("name",	"to_not_participant");
		ПараметрыВызова.Вставить("value",	ЛНовоеЗначениеУстановить);
	ИначеЕсли   УстанавливаемыеПараметры.Свойство("ИдентификаторГосконтракта", ЛНовоеЗначениеУстановить) Тогда
		ПараметрыВызова.Вставить("name",	"markingContractNumber");
		ПараметрыВызова.Вставить("value",	ЛНовоеЗначениеУстановить);
	Иначе
		ВызватьСбисИсключение(700, "МодульОбъектаКлиент.ИзменитьСкладскойПараметрДокумента",,,"Неизвестный параметр складского документа", УстанавливаемыеПараметры);
	КонецЕсли;	
	
	ФлагОшибки = Ложь;
	РезультатВызова = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ExtSysMarking_SetParam(ПараметрыВызова, Новый Структура("Кэш", ГлавноеОкно.Кэш), ФлагОшибки);
	Если ФлагОшибки Тогда
		ВызватьСбисИсключение(РезультатВызова, "МодульОбъектаКлиент.ИзменитьСкладскойПараметрДокумента");
	КонецЕсли;

КонецФункции   

// Получение состояния и наличия токена в ГИС МТ
//
// Параметры:
//  СоставПакета  - Структура
//               
//  ДопПараметры   - Структура, Неопределено - Доп параметры
//
// Возвращаемое значение:
//   Строка
//
&НаКлиенте
Функция ПроверитьНаличиеТокена(СоставПакета, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;   

	ПараметрыВызова = Новый Структура;  
	ПараметрыВызова.Вставить("ИдДок",СоставПакета.Идентификатор);
	
	Возврат Кэш.Интеграция.ExtSysMarking_CheckGisSetting(ПараметрыВызова, Новый Структура("Кэш", Кэш));

КонецФункции 

// Запуск проверки кодов маркировки в ГИС МТ
//
// Параметры:
//  СоставПакета  - Структура
//               
//  ДопПараметры   - Структура, Неопределено - Доп параметры
//
// Возвращаемое значение:
//   Строка
//
&НаКлиенте
Функция ИнициироватьПроверкуКодовМаркировки(СоставПакета, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;   

	ПараметрыВызова = Новый Структура;  
	ПараметрыВызова.Вставить("ИдДок",СоставПакета.Идентификатор);
	
	Возврат Кэш.Интеграция.ExtSysMarking_CheckSnCRPT(ПараметрыВызова, Новый Структура("Кэш", Кэш));

КонецФункции   

// Получение информации по отпечатку сертификата
//
// Параметры:
//  СоставПакета  - Структура
//               
//  ДопПараметры   - Структура, Неопределено - Доп параметры
//
// Возвращаемое значение:
//   Массив
//
&НаКлиенте
Функция ПолучитьДанныеСертификатаСбис(Отпечаток, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;   

	ПараметрыВызова = Новый Структура;  
	ПараметрыВызова.Вставить("Отпечаток",Отпечаток);
	
	Возврат Кэш.Интеграция.Сертификат_ПрочитатьПоОтпечатку(ПараметрыВызова, Новый Структура("Кэш", Кэш));

КонецФункции     

// Получение информации по созданию токена ГИС МТ
//
// Параметры:
//  СоставПакета  - Структура
//               
//  ДопПараметры   - Структура, Неопределено - Доп параметры
//
// Возвращаемое значение:
//   Массив
//
&НаКлиенте
Функция ПолучитьРезультатСозданияТокена(СоставПакета, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;   

	ПараметрыВызова = Новый Структура;  
	ПараметрыВызова.Вставить("ИдДок",СоставПакета.Идентификатор);
	
	Возврат Кэш.Интеграция.ExtSysMarking_CheckGisTask(ПараметрыВызова, Новый Структура("Кэш", Кэш));

КонецФункции      

// Получение статуса проверки документа ГИС МТ
//
// Параметры:
//  СоставПакета  - Структура
//               
//  ДопПараметры   - Структура, Неопределено - Доп параметры
//
// Возвращаемое значение:
//   Массив
//
&НаКлиенте
Функция ПроверитьСтатусПроверкиГИСМТ(СоставПакета, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;   

	ПараметрыВызова = Новый Структура;  
	ПараметрыВызова.Вставить("ИдДок",СоставПакета.Идентификатор);
	
	Возврат Кэш.Интеграция.ExtSysMarking_GetResendingConfigForGIS(ПараметрыВызова, Новый Структура("Кэш", Кэш));

КонецФункции    

// Отправка кодов маркировки в ГИС МТ
//
// Параметры:
//  СоставПакета  - Структура
//               
//  ДопПараметры   - Структура, Неопределено - Доп параметры
//
// Возвращаемое значение:
//   Массив
//
&НаКлиенте
Функция ОтправитьКодыМаркировкиВГИС(СоставПакета, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;   

	ПараметрыВызова = Новый Структура;  
	ПараметрыВызова.Вставить("ИдДок",СоставПакета.Идентификатор); 
	
	ФлагОшибки = Ложь;
    РезультатВызова = Кэш.Интеграция.ExtSysMarking_SendToGIS(ПараметрыВызова, Новый Структура("Кэш", Кэш),ФлагОшибки);
    Если ФлагОшибки Тогда
        ВызватьСбисИсключение(РезультатВызова, "МодульОбъектаКлиент.ОтправитьКодыМаркировкиВГИС");
    КонецЕсли;
    
    Возврат РезультатВызова;


КонецФункции

// Функция вызывает создание токена в СБИС, для взаимодействия с ГИС МТ
//
// Параметры:
//  СоставПакета  - Структура
//  ПараметрыСоздания - Структура, данные сертификата, для создания токена             
//  ДопПараметры   - Структура, Неопределено - Доп параметры
//
// Возвращаемое значение:
//   Строка - Результат вызова. Дата/время вызова или ошибка
//
&НаКлиенте
Функция СоздатьТокенСбис(СоставПакета, ПараметрыСоздания, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;   

	ПараметрыВызова = Новый Структура;  
	ПараметрыВызова.Вставить("docflowId",СоставПакета.Идентификатор); 
	ПараметрыВызова.Вставить("thumbprint",ПараметрыСоздания.thumbprint);
	ПараметрыВызова.Вставить("hashOID",ПараметрыСоздания.hashOID); 
	ПараметрыВызова.Вставить("validFrom",ПараметрыСоздания.validFrom);
	ПараметрыВызова.Вставить("validTo",ПараметрыСоздания.validTo);
	ПараметрыВызова.Вставить("certData",ПараметрыСоздания.certData); 
	
	ФлагОшибки = Ложь;
	РезультатВызова = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ExtSysMarking_CreateGisSetting(ПараметрыВызова, Новый Структура("Кэш", Кэш), ФлагОшибки);
	Если ФлагОшибки Тогда
		ВызватьСбисИсключение(РезультатВызова, "МодульОбъектаКлиент.СоздатьТокенСбис");
	КонецЕсли;

КонецФункции  

// Функция - возвращает представление ставки НДС по ее значению
//
// Параметры:
//  Значение - Число - значение атрибута структуры номенклатуры документа СБИС Онлайн 
// 
// Возвращаемое значение:
//  Строка - представление ставки НДС по ее значению
//
&НаКлиенте
Функция СтавкаНДСПоПараметруМаркировки(Значение) Экспорт
		
	Возврат СоответсвиеСтавокНДСSaby().Получить(Значение);

КонецФункции 

&НаКлиенте
Функция СоответсвиеСтавокНДСSaby()

	СписокСтавокНДС = Новый Соответствие;
	
	СписокСтавокНДС.Вставить(0, "0%");
	СписокСтавокНДС.Вставить(1, "10%");
	СписокСтавокНДС.Вставить(2, "18%");
	СписокСтавокНДС.Вставить(3, "20%"); 
	СписокСтавокНДС.Вставить(4, "10/110");
	СписокСтавокНДС.Вставить(5, "18/118");
	СписокСтавокНДС.Вставить(6, "без НДС");
	СписокСтавокНДС.Вставить(7, "ЕНВД"); 
	СписокСтавокНДС.Вставить(8, "Патент");
	СписокСтавокНДС.Вставить(9, "20/120"); 
	СписокСтавокНДС.Вставить(10, "5%");
	СписокСтавокНДС.Вставить(11, "7%");
	СписокСтавокНДС.Вставить(12, "5/105");
	СписокСтавокНДС.Вставить(13, "7/107");
	СписокСтавокНДС.Вставить(14, "22%"); 
	СписокСтавокНДС.Вставить(15, "22/122"); 
	
	Возврат СписокСтавокНДС;

КонецФункции

// Определяет, если работа с маркировкой в документе
//
// Параметры:
//  СоставПакета - Структура - Объект класса СоставПакета
//
// Возвращаемое значение:
//  Булево - Истина, если есть работа с маркировкой
&НаКлиенте
Функция РаботаСМаркировкой(СоставПакета) Экспорт
	Перем лМаркировка;
	
	СбисРасширение = СоставПакета_Получить(СоставПакета, "Расширение");
	Если НЕ ЗначениеЗаполнено(СбисРасширение)
		ИЛИ НЕ СбисРасширение.Свойство("Маркировка", лМаркировка)
		ИЛИ НЕ лМаркировка = "Да" Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

// Функция убирает парные разделители идентификаторов "(", ")" из кода маркировки.
// 
// Параметры:
//  Штрихкод - Строка - Код маркировки.
//  ПараметрыШтрихкода - Массив - На входе пустой массив. 
// Возвращаемое значение:
//  Массив - Результат выполнения функции.  
&НаКлиенте
Функция ШтрихкодБезСкобок(Знач Штрихкод, ПараметрыШтрихкода) Экспорт
		
	ПозицияНачало = ПозицияПервогоИдентификатораПрименения(Штрихкод);
	Если ПозицияНачало > 0 Тогда
		ПозицияКонец = СбисСтрНайти(Штрихкод, ")", , ПозицияНачало);
	Иначе
		Возврат ПараметрыШтрихкода;
	КонецЕсли; 
	
	КлючДоРазделителя =  Лев(Штрихкод, ПозицияНачало - 1);		
	КлючИдентификатора = Сред(Штрихкод, ПозицияНачало + 1, ПозицияКонец - ПозицияНачало - 1);	
	Штрихкод = Сред(Штрихкод, ПозицияКонец + 1);
	
	ПозицияНачалоСледующего = ПозицияПервогоИдентификатораПрименения(Штрихкод);
	
	Если ПозицияНачалоСледующего <> 0 Тогда
		СтроковоеЗначениеПараметра = Сред(Штрихкод, 1, ПозицияНачалоСледующего - 1);
		Штрихкод = Сред(Штрихкод, ПозицияНачалоСледующего);
	Иначе
		СтроковоеЗначениеПараметра = Штрихкод;
		Штрихкод = "";
	КонецЕсли;
	
	ПараметрыШтрихкода.Добавить(КлючДоРазделителя);  
	ПараметрыШтрихкода.Добавить(КлючИдентификатора);     
	ПараметрыШтрихкода.Добавить(СтроковоеЗначениеПараметра);

	Если Не ПустаяСтрока(Штрихкод) Тогда
		ШтрихкодБезСкобок(Штрихкод, ПараметрыШтрихкода);
	КонецЕсли;
	
	Возврат ПараметрыШтрихкода;
	
КонецФункции

&НаКлиенте
Функция ПозицияПервогоИдентификатораПрименения(Знач Штрихкод)
	
	ПозицияСледующегоИдентификатора = Найти(Штрихкод, "(");
	
	ПравильныйИдентификатор = Ложь;
	Пока ПозицияСледующегоИдентификатора > 0 И Не ПравильныйИдентификатор Цикл
		
		ПозицияЗакрывающегоИдентификатора = СбисСтрНайти(Штрихкод, ")", , ПозицияСледующегоИдентификатора);
		
		Если ПозицияЗакрывающегоИдентификатора = 0 Тогда
			ПозицияСледующегоИдентификатора = 0;
			Прервать;
		КонецЕсли;
		
		ПредполагаемыйИдентификатор = Сред(
			Штрихкод,
			ПозицияСледующегоИдентификатора + 1,
			ПозицияЗакрывающегоИдентификатора - ПозицияСледующегоИдентификатора - 1);
		
		ПравильныйИдентификатор = СтрДлина(ПредполагаемыйИдентификатор) > 1
		                        И СтрДлина(ПредполагаемыйИдентификатор) < 5;
		
		Если ПозицияСледующегоИдентификатора >= СтрДлина(Штрихкод) Тогда
			ПозицияСледующегоИдентификатора = 0;
		ИначеЕсли Не ПравильныйИдентификатор Тогда
			ПозицияСледующегоИдентификатора = СбисСтрНайти(Штрихкод, "(",, ПозицияСледующегоИдентификатора  + 1);  
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПозицияСледующегоИдентификатора;
	
КонецФункции 

// Функция - Определяет является ли код маркировки в формате ОСУ
//
// Параметры:
//  Код	 - Строка - Код маркировки
// 
// Возвращаемое значение:
//  Булево - результат работы функции
//
&НаКлиенте
Функция СбисЭтоКодОСУ(Код) Экспорт 
	
	ЭтоКодОСУ = Ложь;
	
	Если ЗначениеЗаполнено(Код) 
		И СтрДлина(Код) > 18
		И СтрДлина(Код) < 25 // Количество товара в единице измерения упаковки от 1 до 8 цифр 
		И Лев(Код, 2) = "02" 
		И Сред(Код, 17, 2) = "37" Тогда
		
		ЭтоКодОСУ = Истина;
		
	КонецЕсли;
	
	Возврат ЭтоКодОСУ;
	
КонецФункции   

// Универсальная функция расчета контрольной цифры GTIN.
// GTIN допускает в формате GTIN-8, GTIN-12, GTIN-13, GTIN-14 c контрольным символом.
//
// Параметры:
//  GTIN - Строка - Текстовая строка с GTIN(c контрольным символом). Может содержать числа от 0 до 9.
// 
// Возвращаемое значение:
//  Число - Контрольный символ (число) рассчитанный по алгоритму для GTIN.
//  
&НаКлиенте
Функция СбисРассчитатьКонтрольныйСимволGTIN(Знач GTIN) Экспорт
	
	Сумма = 0;
	ДлиннаGTIN = СтрДлина(GTIN);
	Коэффициент = ?(ДлиннаGTIN % 2 = 0, 3, 1); 
	
	Для Сч = 1 По ДлиннаGTIN - 1 Цикл
		ВремКодСимвола = КодСимвола(GTIN, Сч);
		Сумма  = Сумма + Коэффициент * (ВремКодСимвола - 48);
		Коэффициент = 4 - Коэффициент;
	КонецЦикла;
	Сумма = (10 - Сумма % 10) % 10;
	КонтрольныйСимвол = Символ(Сумма + 48);
	
	Возврат КонтрольныйСимвол;
	
КонецФункции

// Функция проверяет корректность GTIN.
// GTIN допускает в формате GTIN-8, GTIN-12, GTIN-13, GTIN-14 c контрольным символом.
//
// Параметры:
//  GTIN - Строка - Текстовая строка с GTIN(c контрольным символом). Может содержать числа от 0 до 9.
// 
// Возвращаемое значение:
//  Булево - Результат работы функции 
//
&НаКлиенте
Функция СбисПроверитьКорректностьGTIN(Знач GTIN) Экспорт
	
	Результат = (СтрДлина(GTIN) = 8) Или (СтрДлина(GTIN) = 12) Или (СтрДлина(GTIN) = 13) Или (СтрДлина(GTIN) = 14);
	Возврат Результат И СбисРассчитатьКонтрольныйСимволGTIN(GTIN) = Прав(GTIN, 1);
	
КонецФункции   

// Процедура - Заполняет структуру набора средств идентификации товаров
//
// Параметры:
//  НомСредИдентТов		 - 	Массив - массив для наполнения
//  ДанныеПоМаркировке	 - 	Соответствие - исходные данные для формирования структуры кодов
//
&НаКлиенте
Процедура ЗаполнитьНомСредИдентТов_ИдентТрансУпак(НомСредИдентТов, ДанныеПоМаркировке) Экспорт
	
	Если НЕ ДанныеПоМаркировке.ИдентТрансУпак.Количество() Тогда 
		
		Возврат;
		
	КонецЕсли;
		
	Для Каждого Элемент Из ДанныеПоМаркировке.ИдентТрансУпак Цикл
		
		НомСредИдентТов.Добавить(Новый Структура("ИдентТрансУпак", Элемент.Значение));
		
	КонецЦикла;
	
КонецПроцедуры   

// Процедура - Заполняет структуру набора средств идентификации товаров
//
// Параметры:
//  НомСредИдентТов		 - 	Массив - массив для наполнения
//  ДанныеПоМаркировке	 - 	Соответствие - исходные данные для формирования структуры кодов
//
&НаКлиенте
Процедура ЗаполнитьНомСредИдентТов_НомУпак(НомСредИдентТов, ДанныеПоМаркировке) Экспорт
	
	Если НЕ ДанныеПоМаркировке.НомУпак.Количество() Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеДобавить = Новый Массив; 
	ДанныеОчистить = Новый Массив;   
			
	Для Каждого Элемент Из ДанныеПоМаркировке.НомУпак Цикл 
		
		ДанныеДобавить.Добавить(Новый Структура("Значение", Элемент.Значение));   				
		ДанныеОчистить.Добавить(Элемент);
		
		Если СбисЭтоКодОСУ(Элемент.Значение) Тогда   // коды объемно-сортового учета раскладываются по одному на строку 
			
			Прервать; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Для Каждого Элемент Из ДанныеОчистить Цикл  
		
		ДанныеПоМаркировке.НомУпак.Удалить(Элемент);  // Чтобы одни и те же коды не попадали на разные строки с одним товаром, почистим уже использованные   
		
	КонецЦикла;

	НомСредИдентТов.Добавить(Новый Структура("НомУпак", ДанныеДобавить));
	
КонецПроцедуры

// Процедура - Заполняет структуру набора средств идентификации товаров
//
// Параметры:
//  НомСредИдентТов		 - 	Массив - массив для наполнения
//  ДанныеПоМаркировке	 - 	Соответствие - исходные данные для формирования структуры кодов
//
&НаКлиенте
Процедура ЗаполнитьНомСредИдентТов_КИЗ(НомСредИдентТов, ДанныеПоМаркировке, Количество) Экспорт
	
	Если НЕ ДанныеПоМаркировке.КИЗ.Количество() Тогда 
		
		Возврат;
		
	КонецЕсли;
		
	ДанныеДобавить = Новый Массив;
	ДанныеОчистить = Новый Массив; 
	
	Для Каждого Элемент Из ДанныеПоМаркировке.КИЗ Цикл
		
		ДанныеДобавить.Добавить(Новый Структура("Значение", Элемент.Значение));
		ДанныеОчистить.Добавить(Элемент);
		
		Если ДанныеДобавить.Количество() = Количество Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла; 
		
	Для Каждого Элемент Из ДанныеОчистить Цикл
		
		ДанныеПоМаркировке.КИЗ.Удалить(Элемент);  // чтобы одни и те же КИЗы не попадали на разные строки с одним товаром, почистим уже использованные
		
	КонецЦикла;   
	
	НомСредИдентТов.Добавить(Новый Структура("КИЗ", ДанныеДобавить));
				
КонецПроцедуры  

// Процедура - Заполняет структуру набора средств идентификации товаров
//
// Параметры:
//  НомСредИдентТов		 - 	Массив - массив для наполнения
//  ДанныеПоМаркировке	 - 	Соответствие - исходные данные для формирования структуры кодов
//
&НаКлиенте
Процедура ЗаполнитьНомСредИдентТов_КолВедМарк(НомСредИдентТов, ДанныеПоМаркировке) Экспорт
	
	Если НЕ ДанныеПоМаркировке.Свойство("КолВедМарк")
		Или НЕ ДанныеПоМаркировке.КолВедМарк.Количество() Тогда 
		
		Возврат;
		
	КонецЕсли;
			
	ДанныеОчистить = Новый Массив;
	
	Для Каждого Элемент Из ДанныеПоМаркировке.КолВедМарк Цикл 
		
		НомСредИдентТов.Добавить(Новый Структура("КолВедМарк", Элемент.Значение));  
		ДанныеОчистить.Добавить(Элемент);   
		
	КонецЦикла;
	
	Для Каждого Элемент Из ДанныеОчистить Цикл 
		
		ДанныеПоМаркировке.КолВедМарк.Удалить(Элемент);
		
	КонецЦикла; 
	
КонецПроцедуры 

// Процедура - Заполняет структуру набора средств идентификации товаров
//
// Параметры:
//  НомСредИдентТов		 - 	Массив - массив для наполнения
//  ДанныеПоМаркировке	 - 	Соответствие - исходные данные для формирования структуры кодов
//
&НаКлиенте
Процедура ЗаполнитьНомСредИдентТов_ПрПартМарк(НомСредИдентТов, ДанныеПоМаркировке) Экспорт
	
	Если НЕ ДанныеПоМаркировке.Свойство("ПрПартМарк") 
		Или НЕ ДанныеПоМаркировке.ПрПартМарк.Количество() Тогда 
		
		Возврат;
		
	КонецЕсли;
				
	Для Каждого Элемент Из ДанныеПоМаркировке.ПрПартМарк Цикл
		
		НомСредИдентТов.Добавить(Новый Структура("ПрПартМарк", Элемент.Значение));
		
	КонецЦикла;  
				
КонецПроцедуры 

// Функция возвращает типы вложений Saby, где применяется узел КолВедМарк
// 
// Возвращаемое значение:
//  Соответствие - список типов вложений
//
&НаКлиенте
Функция ПрименяетсяЭлемент_КолВедМарк() Экспорт
	
	ТипыВложенийСБИС = Новый Массив;
	
	ТипыВложенийСБИС.Добавить("упддоп");
	ТипыВложенийСБИС.Добавить("эдонакл");  
	
	Возврат ТипыВложенийСБИС;
	
КонецФункции

// Функция - Определяет доступность арегации в наборы для товарной группы
//
// Параметры:
//  ОсобенностьУчета - Строка - Представление товарной группы
// 
// Возвращаемое значение:
//  Булево - результат работы функции
//
&НаКлиенте
Функция УпаковкаДоступнаТоварнымГруппам_Наборы(ОсобенностьУчета) Экспорт

	СписокТоварныхГрупп = СписокТоварныхГрупп_Наборы();
	
	Если НЕ СписокТоварныхГрупп.Найти(ОсобенностьУчета) = Неопределено Тогда
	
		Возврат Истина;	
	
	КонецЕсли;  
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция СписокТоварныхГрупп_Наборы()

	СписокТоварныхГрупп = Новый Массив;
	
	СписокТоварныхГрупп.Добавить("Антисептики");
	СписокТоварныхГрупп.Добавить("БАДы");   
	СписокТоварныхГрупп.Добавить("Бакалея"); 
	СписокТоварныхГрупп.Добавить("БезалкогольноеПиво");
	СписокТоварныхГрупп.Добавить("Духи");
	СписокТоварныхГрупп.Добавить("ИгрыИИгрушкиДляДетей");
	СписокТоварныхГрупп.Добавить("КонсервированнаяПродукция"); 
	СписокТоварныхГрупп.Добавить("КормаДляЖивотных");
    СписокТоварныхГрупп.Добавить("БытоваяХимия");  
	СписокТоварныхГрупп.Добавить("Молоко"); 
	СписокТоварныхГрупп.Добавить("Морепродукты");
	СписокТоварныхГрупп.Добавить("МоторныеМасла"); 
	СписокТоварныхГрупп.Добавить("НикотиносодержащаяПродукция");	
	СписокТоварныхГрупп.Добавить("ЛегкаяПромышленность"); 
	СписокТоварныхГрупп.Добавить("ПечатнаяПродукция");
	СписокТоварныхГрупп.Добавить("ПиротехническиеИзделияИСредстваПожарнойБезопасности"); 
	СписокТоварныхГрупп.Добавить("РастительныеМасла"); 
	СписокТоварныхГрупп.Добавить("СладостиИКондитерскиеИзделия"); 
	СписокТоварныхГрупп.Добавить("СоковаяПродукция");  
	СписокТоварныхГрупп.Добавить("Фотоаппараты");
	
	Возврат СписокТоварныхГрупп;
	
КонецФункции

// Процедура - инициирует проверку кодов маркировки или вызывает создание токена ГИС МТ 
//
// Параметры:
//  РезультатПроверкиТокена	 - Структура - результат проверки токена и описание ошибки
//
&НаКлиенте
Процедура ОбработатьРезультатПроверкиТокена(СоставПакета, РезультатПроверкиТокена, ДопПараметры = Неопределено) Экспорт 
	
	Перем РезультатНаличияТокена; 
	
	РезультатПроверкиТокена.Свойство("Result", РезультатНаличияТокена);
	
	Если НРег(РезультатНаличияТокена) = "ok" Тогда   
		
		Попытка
			
			ИнициироватьПроверкуКодовМаркировки(СоставПакета); 
			
			ФормыПросмотра = Новый Массив;
			ФормыПросмотра.Добавить("ФормаПросмотрДокумента"); 
			
			Если ИспользоватьНовоеСопоставлениеНоменклатуры() Тогда
				ФормыПросмотра.Вставить(0, "ФормаПросмотрДокументаРасширенноеСопоставление");
			КонецЕсли; 
			
			ФормаПросмотрДокумента = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ЗаполнитьМаркировку", ФормыПросмотра);
			ФормаПросмотрДокумента.ЗаполнитьМаркировку(СоставПакета); 
	
		Исключение  
			
			ОшибкаПроверки = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ОбработатьРезультатПроверкиТокена"); 
			ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаПроверки);
			
		КонецПопытки; 
		
		Возврат; 
		
	ИначеЕсли НРег(РезультатНаличияТокена) = "error" Тогда  
		
		СтруктураОшибки = Новый Структура("code,details,extCode");
		
		СтруктураОшибки.code	= 310;
		СтруктураОшибки.extCode	= РезультатПроверкиТокена.Code; 
		СтруктураОшибки.details	= РезультатПроверкиТокена.Description;   
		
		ОшибкаОбмена 	=  НовыйСбисИсключение(СтруктураОшибки, "МодульОбъектаКлиент.ОбработатьРезультатПроверкиТокена",, СтруктураОшибки.details);

		СообщитьСбисИсключение(ОшибкаОбмена); 
			
		Возврат;	
		
	Иначе  
		
		Если ДопПараметры = Неопределено Тогда
		
			ДопПараметры = Новый Структура;	
		
		КонецЕсли;
		
		ДопПараметры.Вставить("СоставПакета", СоставПакета);	
		
		ОбработчикДиалога 	= НовыйСбисОписаниеОповещения("СоздатьТокенГИСМТ", МодульОбъектаКлиент(), ДопПараметры);
		ТекстВопроса 		= "Токен, для проверки сведений ГИС МТ, не найден. Создать новый?";   
		
		СбисПоказатьВопрос(ОбработчикДиалога, ТекстВопроса, РежимДиалогаВопрос.ДаНет);  
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - получает список сертификатов и запускает окно выбора сертификата для создания токена 
//
&НаКлиенте
Процедура СоздатьТокенГИСМТ(РезультатДиалога, ДопПараметры) Экспорт  
	
	Если Не РезультатДиалога = КодВозвратаДиалога.Да Тогда
		
		Возврат; 
		
	КонецЕсли;
	
	Если Не ПолучитьЗначениеПараметраСбис("ОбменВключен") Тогда
		
		СтруктураОшибки = Новый Структура("code, message, details", 100, "Не включен обмен с Saby", "Сертификаты не найдены. Выберите способ обмена в настройках соединения.");
		ОшибкаОбмена 	= НовыйСбисИсключение(СтруктураОшибки, "МодульОбъектаКлиент.СоздатьТокенГИСМТ"); 
		
		СообщитьСбисИсключение(ОшибкаОбмена, Новый Структура("Отложенно", Истина)); 
		Возврат;
		
	КонецЕсли;
	
	//Получим список 
	Кэш = ПолучитьТекущийЛокальныйКэш();
	
	СбисМодульИнтеграции	= ПараметрSABY("Интеграция", "Сеанс");
	СписокСертификатовСырой = СбисМодульИнтеграции.ПолучитьСписокСертификатовДляАвторизации(Кэш, "");    

	ФормаВыборИзСписка = МодульОбъектаКлиент().ПолучитьФормуОбработки("Форма_ВыборИзСписка"); 
	ФормаВыборИзСписка.ОписаниеОповещенияОЗакрытии = НовыйСбисОписаниеОповещения("РезультатВыбораСертификата", МодульОбъектаКлиент(), ДопПараметры); 
	ПараметрыОткрыть = Новый Структура("СписокДляВыбора, Заголовок", СписокСертификатовСырой, "Выберите сертификат для создания токена ГИС МТ");
	
	ФормаВыборИзСписка.Показать(Новый Структура("ПараметрыФормы", ПараметрыОткрыть));

КонецПроцедуры   

// Процедура - обрабатывает результат выбора сертификата для создания токена  
//
&НаКлиенте
Процедура РезультатВыбораСертификата(Результат, ДопПараметры) Экспорт 
		
	МодульФункций = ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	
	Если Результат = Неопределено Тогда 
		
		ОшибкаПроверки = НовыйСбисИсключение(, "МодульОбъектаКлиент.РезультатВыбораСертификата",,, "Не активирован сертификат для подписания документов.");
		СообщитьСбисИсключение(ОшибкаПроверки, Новый Структура("Отложенно", Истина)); 
		Возврат;
		
	КонецЕсли;  
	
	Попытка
		
		ДанныеСертификатаСбис = ПолучитьДанныеСертификатаСбис(Результат.Отпечаток);  
		
	Исключение
		 
		ОшибкаПроверки = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.РезультатВыбораСертификата"); 
		ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаПроверки);

	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ДанныеСертификатаСбис) Тогда
		
		ОшибкаПроверки = НовыйСбисИсключение(, "МодульОбъектаКлиент.РезультатВыбораСертификата",,, "Сертификат, по отпечатку, не найден в Saby");
		СообщитьСбисИсключение(ОшибкаПроверки, Новый Структура("Отложенно", Истина)); 
		Возврат;
		
	КонецЕсли;  
	
	ИндексСтрокиХэшаАлгоритма	= МодульФункций.ВыбратьДанныеСертификата(ДанныеСертификатаСбис.s,"HashAlgOID","n"); 
	ИндексСтрокиДвоичныхДанных	= МодульФункций.ВыбратьДанныеСертификата(ДанныеСертификатаСбис.s,"Файл","n"); 
	ИндексСтрокиДействителенС	= МодульФункций.ВыбратьДанныеСертификата(ДанныеСертификатаСбис.s,"ДействителенС","n");  
	ИндексСтрокиДействителенПо	= МодульФункций.ВыбратьДанныеСертификата(ДанныеСертификатаСбис.s,"ДействителенПо","n");
	
	Если НЕ ИндексСтрокиХэшаАлгоритма = Неопределено Тогда
		ХэшАлгоритмаШифрования = ДанныеСертификатаСбис.d[ИндексСтрокиХэшаАлгоритма]; 
	Иначе
		ХэшАлгоритмаШифрования = ДанныеСертификатаСбис.d.HashAlgOID;
	КонецЕсли;
	
	Если НЕ ИндексСтрокиДействителенС = Неопределено Тогда
		ДвоичныеДанныеСертификата = ДанныеСертификатаСбис.d[ИндексСтрокиДвоичныхДанных];  
	Иначе
		ДвоичныеДанныеСертификата = ДанныеСертификатаСбис.d.Файл;
	КонецЕсли;	  
	
	Если НЕ ИндексСтрокиДвоичныхДанных = Неопределено Тогда
		ДействителенС = ДанныеСертификатаСбис.d[ИндексСтрокиДействителенС];  
	Иначе
		ДействителенС = ДанныеСертификатаСбис.d.ДействителенС;
	КонецЕсли;  
	
	Если НЕ ИндексСтрокиДвоичныхДанных = Неопределено Тогда
		ДействителенПо = ДанныеСертификатаСбис.d[ИндексСтрокиДействителенПо];  
	Иначе
		ДействителенПо = ДанныеСертификатаСбис.d.ДействителенПо;
	КонецЕсли;
	
	ПараметрыСертификата = Новый Структура();   
	ПараметрыСертификата.Вставить("thumbprint",	Результат.Отпечаток);
	ПараметрыСертификата.Вставить("hashOID",	ХэшАлгоритмаШифрования); 
	ПараметрыСертификата.Вставить("validFrom",	ДействителенС);
	ПараметрыСертификата.Вставить("validTo", 	ДействителенПо);  
	ПараметрыСертификата.Вставить("certData", 	ДвоичныеДанныеСертификата);
	
	СоставПакета = ДопПараметры.СоставПакета;
	
	Попытка
		
		СоздатьТокенСбис(СоставПакета, ПараметрыСертификата); 
		
	Исключение  
		
		ОшибкаПроверки = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.РезультатВыбораСертификата"); 
		ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаПроверки);
		
	КонецПопытки;   
	
	ОбработатьРезультатСозданияТокена(СоставПакета);  
	
КонецПроцедуры

// Процедура - обрабатывает результат создания токена в ГИС МТ  
//  
&НаКлиенте
Процедура ОбработатьРезультатСозданияТокена(СоставПакета)
	
	Результат = Неопределено;
	ТокенСоздан = Ложь; 
	ВремяВызова = ТекущаяДата(); 
	
	Пока Истина Цикл
		
		Попытка
			
			Результат = ПолучитьРезультатСозданияТокена(СоставПакета); 
			
		Исключение
			
			ОшибкаПроверки = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ОбработатьРезультатСозданияТокена"); 
			ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаПроверки);  
			
		КонецПопытки;
		
		РезультатСозданияТокена = (Не Результат = Неопределено 
			И Результат.Свойство("Result")); 
		
		Если РезультатСозданияТокена 
			И ВРЕГ(Результат.Result) = "OK" Тогда 
			
			//Получен ответ на запрос, или делаем один проход на чтение	  
			ТокенСоздан = Истина;
			Прервать;   
			
		ИначеЕсли РезультатСозданияТокена 
			И Результат.Result = "Error" Тогда 
			
			ОшибкаПроверки = НовыйСбисИсключение(, "МодульОбъектаКлиент.ОбработатьРезультатСозданияТокена",,, Результат.Description);
			ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаПроверки);

		ИначеЕсли ТекущаяДата() - ВремяВызова > 10 Тогда   
			
			//Установленный на команде таймаут
			ОшибкаПроверки = НовыйСбисИсключение(, "МодульОбъектаКлиент.ОбработатьРезультатСозданияТокена",,, "ExtSysMarking.CheckGisTask() не вернул ответ за разумное время");
			ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаПроверки);

		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
	КонецЦикла;  
	
	ФормыПросмотра = Новый Массив;
	ФормыПросмотра.Добавить("ФормаПросмотрДокумента"); 
	
	Если ИспользоватьНовоеСопоставлениеНоменклатуры() Тогда
		ФормыПросмотра.Вставить(0, "ФормаПросмотрДокументаРасширенноеСопоставление");
	КонецЕсли; 
	
	ФормаПросмотрДокумента = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ЗаполнитьМаркировку", ФормыПросмотра);
	ФормаПросмотрДокумента.ЗаполнитьМаркировку(СоставПакета); 
		
КонецПроцедуры   

