
// Функция возвращает результат работы метода ExtSysMarking.SendDocumentRNPT
//
// Параметры:
//  СоставПакета  - Структура - обрабатываемый пакет (документ)
//  ДопПараметры  - Структура - Набор полей, работа с которыми может расширить результат работы функции.
//
// Возвращаемое значение:
//   Структура   - Результат вызова. Код результата или ошибка
//
&НаКлиенте
Функция ПроверитьПрослеживаемыеПозиции(СоставПакета, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;   

	ПараметрыВызова = Новый Структура;  
	ПараметрыВызова.Вставить("ИдДок",СоставПакета.Идентификатор);  
	
	ФлагОшибки = Ложь;
	РезультатВызова = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ExtSysMarking_SendDocumentRNPT(ПараметрыВызова, Новый Структура("Кэш", Кэш), ФлагОшибки);
	Если ФлагОшибки Тогда
		ВызватьСбисИсключение(РезультатВызова, "МодульОбъектаКлиент.ПроверитьПрослеживаемыеПозиции");
	КонецЕсли;   
	
	Возврат РезультатВызова;

КонецФункции   

// Функция возвращает результат работы метода ExtSysMarking.ExtSysMarking_NumList
//
// Параметры:
//  СоставПакета - Структура - обрабатываемый пакет (документ) 
//  ДопПараметры - Структура - Набор полей, работа с которыми может расширить результат работы функции. 
// 
// Возвращаемое значение:
//   Структура   - Результат вызова. Код результата или ошибка 
//
&НаКлиенте
Функция СоставПрослеживаемыхПозиций(СоставПакета, ДопПараметры = Неопределено) Экспорт 

	Кэш = ГлавноеОкно.Кэш;  
		
	ПараметрыФильтра = Новый Структура;  
	 
	Если НЕ ДопПараметры = Неопределено 
		И ДопПараметры.Свойство("Фильтр") Тогда
		ПараметрыФильтра = ДопПараметры.Фильтр;
	КонецЕсли;
	
	ПараметрыФильтра.Вставить("docflowId",СоставПакета.Идентификатор);

    ПараметрыВызова = Новый Структура; 	
	ПараметрыВызова.Вставить("ДопПоля",Новый Массив());
	ПараметрыВызова.Вставить("Фильтр",ПараметрыФильтра); 
	ПараметрыВызова.Вставить("Сортировка",Новый Массив());
	ПараметрыВызова.Вставить("Навигация",Новый Массив());
		
	ФлагОшибки = Ложь;
	РезультатВызова = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ExtSysMarking_NumList(ПараметрыВызова, Новый Структура("Кэш", ГлавноеОкно.Кэш), ФлагОшибки);
	Если ФлагОшибки Тогда
		ВызватьСбисИсключение(РезультатВызова, "МодульОбъектаКлиент.СоставПрослеживаемыхПозиций");
	КонецЕсли; 
	
	Возврат РезультатВызова;

КонецФункции 

