
&НаКлиенте
Процедура ПодготовитьЗаписиМаппингПоДокументу(ПараметрыЗаписи) Экспорт
	
	Кэш				= ПолучитьТекущийЛокальныйКэш();
	Документ1С		= ПараметрыЗаписи.Документ1С;
	СоставПакета	= ПараметрыЗаписи.СоставПакета;
	
	ФункцииДокументов = ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	РезультатДействия = Кэш.РезультатДействия;
	
	ТипАПИзОбъекта = СоставПакета_Получить(СоставПакета, "ТипAPI3Объекта");
	
	// Без типа не пишем в маппинг
	Если ТипАПИзОбъекта = Неопределено
		ИЛИ НЕ РезультатДействия.Свойство("ДанныеМаппинга") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДокумента = Новый Структура("ИмяСБИС", ТипАПИзОбъекта);
	СтруктураОбъекта1С = ФункцииДокументов.СбисПолучитьСтруктуруОбъекта1С(Документ1С, СтруктураДокумента, Ложь);
	
	СведенияОбъектаСБИС = Новый Структура;
	СведенияОбъектаСБИС.Вставить("ИмяСБИС", ТипАПИзОбъекта);
	СведенияОбъектаСБИС.Вставить("Дата", СоставПакета_Получить(СоставПакета, "Дата"));
	СведенияОбъектаСБИС.Вставить("Номер", СоставПакета_Получить(СоставПакета, "Номер"));
	СведенияОбъектаСБИС.Вставить("Идентификатор", СоставПакета_Получить(СоставПакета, "ИдентификаторСБИС"));
	СведенияОбъектаСБИС.Вставить("Название", СоставПакета_Получить(СоставПакета, "Название"));
	
	Контрагент		= СоставПакета_Получить(СоставПакета, "Контрагент");
	НашаОрганизация	= СоставПакета_Получить(СоставПакета, "НашаОрганизация");
	СведенияОбъектаСБИС.Вставить("Контрагент", СторонаSABY_Выгрузить(Контрагент));
	СведенияОбъектаСБИС.Вставить("НашаОрганизация", СторонаSABY_Выгрузить(НашаОрганизация));
	
	ДанныеОбъекта = Новый Структура("СБИС, ИС", СведенияОбъектаСБИС, СтруктураОбъекта1С);
	ДопПараметрыЗаписи = Новый Структура("Назначение, ДанныеОбъекта", "Документы", ДанныеОбъекта);
	СписокMappingObject_Добавить(РезультатДействия.ДанныеМаппинга, ДопПараметрыЗаписи);
	
КонецПроцедуры

