
&НаСервере
Функция яОписаниеИниФайловВКаталоге(ПараметрыЧтения, ДопПараметры = Неопределено)
	
	МассивУстановленныхИниФайлов	= Новый Массив();
	
	Каталог = ПараметрыЧтения.Идентификатор;
	
	МассивФайловВКаталоге				= НайтиФайлы(Каталог,"ВО8*.xml");
	МассивУстановленныхТиповыхИниФайлов	= НайтиФайлы(Каталог,"ВО8*.sbis3.xml");
	
	СписокУстановленныхИниФайлов				= Новый Соответствие();
	СписокУстановленныхИниФайловБезПрефиксов	= Новый Соответствие();
	СписокУстановленныхТиповыхИниФайлов			= Новый СписокЗначений();
	
	Для Каждого ИниФайл Из МассивФайловВКаталоге Цикл
		СписокУстановленныхИниФайлов.Вставить(ИниФайл.Имя,ИниФайл);
		СписокУстановленныхИниФайловБезПрефиксов.Вставить(Сред(ИниФайл.Имя, Найти(ИниФайл.Имя, "_")+1),ИниФайл);
	КонецЦикла;
	
	ФильтрПоИменамИни = Неопределено;
	Если		ДопПараметры = Неопределено
		Или	Не	ДопПараметры.Свойство("ФильтрПоИменамИни", ФильтрПоИменамИни) Тогда
		//Отбираем все
		//ФильтрПоИменамИни = Новый Массив;
	КонецЕсли;
	
	СписокУстановленныхТиповыхИниФайлов.ЗагрузитьЗначения(МассивУстановленныхТиповыхИниФайлов);
	
	//пробегаем по списку установленных типовых ини файлов (.sbis3.xml) и в общем списке установленных ини файлов
	//ищем соответствующие ини файлы клиента, затем из общего списка удаляем записи типовых ини файлов и, если нашли, ини файл клиента
	//к концу цикла в общем списке установленных ини файлов останутся неопределенные ини файлы
	Для Каждого ИниФайл Из СписокУстановленныхТиповыхИниФайлов Цикл
		ИмяФайлаНастроекКлиента			= СтрЗаменить(ИниФайл.Значение.Имя,".sbis3.xml",".xml");
		ИмяФайлаБезРасширения			= Лев(ИниФайл.Значение.Имя,Найти(ИниФайл.Значение.Имя,".")-1);
		ИмяФайлаБезРасширенияБезПрефикса= Сред(ИмяФайлаБезРасширения, Найти(ИмяФайлаБезРасширения, "_")+1);
		НайденыйФайлНастроекКлиента		= СписокУстановленныхИниФайловБезПрефиксов.Получить(ИмяФайлаБезРасширенияБезПрефикса+".xml");
		
		НоваяСтрока = Новый Структура();
		НоваяСтрока.Вставить("Имяфайла",				ИниФайл.Значение.Имя);
		НоваяСтрока.Вставить("ИмяфайлаБезРасширения",	ИмяФайлаБезРасширения);
		НоваяСтрока.Вставить("Автообновление",			ПараметрыЧтения.Автообновление); 
		НоваяСтрока.Вставить("ПутьДоИниФайла",			ИниФайл.Значение.Путь);
		НоваяСтрока.Вставить("ДатаФайла",				ИниФайл.Значение.ПолучитьВремяИзменения() );
		НоваяСтрока.Вставить("Стандартная",				Истина);
		НоваяСтрока.Вставить("Ини_ИмяИни",				ИмяИниИзИмениФайла(ИниФайл.Значение.Имя));
		
		// Из общего списка ини файлов удаляем .saby.ini
		СписокУстановленныхИниФайлов.Удалить(ИниФайл.Значение.Имя);
		
		// Если в общем списке нашли ини файл клиента то удаляем его из этого списка
		Если НайденыйФайлНастроекКлиента = Неопределено Тогда
			НоваяСтрока.Вставить("ЕстьИзменения",	 Ложь);
			НоваяСтрока.Вставить("Пользовательская", 0);
			НоваяСтрока.Вставить("ДатаФайлаКлиент",	 "" );
			НоваяСтрока.Вставить("ИмяФайлаКлиента",	 "" );
		Иначе
			НоваяСтрока.Вставить("ЕстьИзменения",	 Истина);
			НоваяСтрока.Вставить("Пользовательская", 1 + (Не ПараметрыЧтения.ВключеныДоработки));
			НоваяСтрока.Вставить("ДатаФайлаКлиент",	 НайденыйФайлНастроекКлиента.ПолучитьВремяИзменения() );
			НоваяСтрока.Вставить("ИмяФайлаКлиента",	 НайденыйФайлНастроекКлиента.Имя );
			СписокУстановленныхИниФайлов.Удалить(НайденыйФайлНастроекКлиента.Имя);

		КонецЕсли;
		
		НоваяСтрока.Вставить("Ини_ИмяБезРасширения",	Сред(НоваяСтрока.ИмяФайла,1,Найти(НоваяСтрока.ИмяФайла,".")-1));
		Если	ЗначениеЗаполнено(ФильтрПоИменамИни)
			И 	ФильтрПоИменамИни.Найти(ВРег(НоваяСтрока.Ини_ИмяИни)) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
			
		МассивУстановленныхИниФайлов.Добавить(НоваяСтрока);
		
	КонецЦикла;	
	
	//в общем списке всех ини файлов останутся не определенные ини файлы
	//добавляем их таблицу отдельными строками
	Для Каждого Элемент из СписокУстановленныхИниФайлов Цикл 
		НоваяСтрока = Новый Структура();
		НоваяСтрока.Вставить("Имяфайла",				Элемент.Значение.Имя);
		НоваяСтрока.Вставить("ИмяфайлаБезРасширения",	Элемент.Значение.ИмяБезРасширения);
		НоваяСтрока.Вставить("Автообновление",			Ложь);
		НоваяСтрока.Вставить("ЕстьИзменения",			Ложь);
		НоваяСтрока.Вставить("Стандартная",				Ложь);
		НоваяСтрока.Вставить("Пользовательская",		1 + ПараметрыЧтения.ВключеныДоработки);
		НоваяСтрока.Вставить("ПутьДоИниФайла",			Элемент.Значение.Путь);
		НоваяСтрока.Вставить("ДатаФайла",				"");
		НоваяСтрока.Вставить("ДатаФайлаКлиент",			Элемент.Значение.ПолучитьВремяИзменения());
		НоваяСтрока.Вставить("ИмяФайлаКлиента",			"");
		НоваяСтрока.Вставить("Ини_ИмяИни",				ИмяИниИзИмениФайла(Элемент.Ключ));
		НоваяСтрока.Вставить("Ини_ИмяБезРасширения",	Сред(НоваяСтрока.ИмяФайла,1,Найти(НоваяСтрока.ИмяФайла,".")-1));
		Если НЕ Найти(НоваяСтрока.ИмяфайлаБезРасширения, ".") = 0
			ИЛИ (ЗначениеЗаполнено(ФильтрПоИменамИни)
			И ФильтрПоИменамИни.Найти(ВРег(НоваяСтрока.Ини_ИмяИни)) = Неопределено) Тогда
			Продолжить;
		КонецЕсли;
		МассивУстановленныхИниФайлов.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	Если МассивУстановленныхИниФайлов.Количество() Тогда
		
		ПервыйИни		= МассивУстановленныхИниФайлов[0];
		ПрефиксНастроек = Сред(ПервыйИни.Имяфайла, 5, Найти(ПервыйИни.Имяфайла, "_") - 5);
		
	КонецЕсли;
	
	Результат = Новый Структура("МассивУстановленныхИниФайлов, ПрефиксНастроек", МассивУстановленныхИниФайлов, ПрефиксНастроек);
	
	Возврат Результат;
	
КонецФункции

