
&НаКлиенте
Процедура Готово(Команда)
	
	Отказ = Ложь;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Организация", ФильтрОрганизация);
	ПараметрыМетода.Вставить("ИдТорговойСети", Формат(ТорговаяСеть.ИдСБИС, "ЧГ="));
	ПараметрыМетода.Вставить("Цепочка", Цепочка);
	ПараметрыМетода.Вставить("Количество", Количество);
	
	СписокДокументовПолучен = МодульОбъектаКлиент().ПолучитьСписокЗаказовДемо(ПараметрыМетода); 
	РезультатИзменения = Новый Структура("СписокДокументовПолучен", СписокДокументовПолучен);
	
  	Закрыть(РезультатИзменения);
		
 
	   
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры


