
&НаКлиенте
Процедура РезультатОтправки_Асинх_ПодготовитьСтруктуруДокумента(РезультатОтправки, ПараметрыКоманды) Экспорт

	ДатаНачалаФормированияПакета	= ПолучитьДатуВМиллисекундах();
    ЦепочкаКомандОбработки			= ПараметрыКоманды.ЦепочкаКомандОбработки;
	ДанныеКоманды					= ПараметрыКоманды.ДанныеКоманды;
	
	ПараметрыВыполнить	= Новый Структура("СоставПакета", ДанныеКоманды.СоставПакета);
	
	// Передлать на асинхронную подготовку структуры документа, т.к. есть вызов ФЭД.Сгенерировать БЛ.
	МассивПодготовленныхПакетов			= ДанныеКоманды.МодульПодготовки.ПодготовитьСтруктуруДокумента(ПараметрыВыполнить, ПолучитьТекущийЛокальныйКэш());
	ДатаОкончанияФормированияПакета		= ПолучитьДатуВМиллисекундах();
	
	РезультатОтправки.ВремяФормирования = РезультатОтправки.ВремяФормирования + (ДатаОкончанияФормированияПакета - ДатаНачалаФормированияПакета) / 1000;
	
	// Генерируются новые команды отправки, завершается команда подготовки
	Для Каждого ПодготовленныйПакет Из МассивПодготовленныхПакетов Цикл
		
		НовоеЦепочкаКомандОбработки = НовыйЦепочкаКомандОбработки();
		
		СписокФорм = Новый Массив;
		СписокФорм.Добавить("Документ_" + ДанныеКоманды.ИмяПослеФормирования);
		СписокФорм.Добавить("Документ_Шаблон");
		МодульПослеФормирования = НайтиФункциюСеансаОбработки("СбисПослеФормированияПакетаДокументов", СписокФорм);
		
		Если МодульПослеФормирования = Ложь Тогда
			
			ПолныйСоставПакета = ПодготовленныйПакет;
			
		Иначе
			
			Кэш = ПолучитьТекущийЛокальныйКэш();
			Попытка
				
				ПолныйСоставПакета = МодульПослеФормирования.СбисПослеФормированияПакетаДокументов(ПодготовленныйПакет, Кэш);
				
			Исключение
				
				ОшибкаПодготовки	= НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.РезультатОтправки_Асинх_ПодготовитьСтруктуруДокумента");
				ПараметрыОшибки		= Новый Структура("Подготовка, Исключение", Истина, ОшибкаПодготовки);
				ЦепочкаКомандОбработки_Установить(НовоеЦепочкаКомандОбработки, "Ошибка", ПараметрыОшибки);
				РезультатОтправки_УстановитьОбъект(РезультатОтправки, НовоеЦепочкаКомандОбработки);
				Продолжить;
				
			КонецПопытки;
			
		КонецЕсли;
	
		РезультатОтправки.Счетчики.СформированоПакетов = РезультатОтправки.Счетчики.СформированоПакетов + 1;
		ЦепочкаКомандОбработки_УстановитьДанные(НовоеЦепочкаКомандОбработки, "СоставПакета", ПолныйСоставПакета);
		РезультатОтправки_СгенерироватьКомандыДляДействия(РезультатОтправки, НовоеЦепочкаКомандОбработки);
		
	КонецЦикла;
	
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "Завершено");

КонецПроцедуры

//Готовит пакет к отправке, формиует события-обработчики, делает вызов
//ПараметрыОтправки - СоставПакета, ДокументОтправить
&НаКлиенте
Процедура РезультатОтправки_Асинх_ПодготовитьОтправку(РезультатОтправки, ПараметрыКоманды) Экспорт
	Перем ДокументСБИС;
	
    ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;
	ДанныеКоманды			= ПараметрыКоманды.ДанныеКоманды;

	ДокументСБИС = ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "ДокументСБИС");
	Если ДокументСБИС = Неопределено Тогда
		
		Попытка
			
			ПараметрыПодготовки	= Новый Структура("Шифрование", ПолучитьЗначениеПараметраСбис("Шифрование"));
			ПараметрыОтправки	= СоставПакета_ПодготовитьКОтправке(ДанныеКоманды, ПараметрыПодготовки);
			ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "ДокументСБИС", ПараметрыОтправки);
			ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "СоставПакета", ДанныеКоманды);
			
		Исключение
			
			ОшибкаПодготовки	= НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.РезультатОтправки_Асинх_ПодготовитьОтправку");
			ПараметрыОшибки		= Новый Структура("Подготовка, Исключение", Истина, ОшибкаПодготовки);
			ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Ошибка", ПараметрыОшибки);
			Возврат;
			
		КонецПопытки;
		
	Иначе
		
		ПараметрыОтправки = ДокументСБИС;
		
	КонецЕсли;
	
	Если Не РезультатОтправки_ПроверкаСертификатаПродолжитьОтправку(РезультатОтправки, ЦепочкаКомандОбработки) Тогда
		
		СтатусЦепочки = ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "Статус");
		Если Не СтатусЦепочки = "Ошибка" Тогда
			
			// Требуется проверка сертификата, установлена подписка на действие сертификатов
			ИмяКомандыПосле = "РезультатОтправки_Асинх_ПодготовитьОтправку";
			ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, ИмяКомандыПосле, РезультатОтправки);
			
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
	ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "РезультатОтправки_Асинх_Отправка", ПараметрыОтправки);
	
КонецПроцедуры

//Готовит пакет к отправке, формиует события-обработчики, делает вызов
//ПараметрыОтправки - СоставПакета, ДокументОтправить
&НаКлиенте
Процедура РезультатОтправки_Асинх_Отправка(РезультатОтправки, ПараметрыКоманды) Экспорт

    ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;
	ДанныеКоманды			= ПараметрыКоманды.ДанныеКоманды;
	МодульОтправки			= ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция");
	
	ПараметрыОтправки	= Новый Структура("Кэш, РезультатОтправки", ПолучитьТекущийЛокальныйКэш(), РезультатОтправки);
	ОбработчикОтправки	= НовыйСбисОписаниеОповещения("WriteDocumentEx", МодульОтправки, ПараметрыОтправки);
	Сбис3Команда		= РезультатОтправки_НовыйАсинхроннаяСбисКоманда(РезультатОтправки, ДанныеКоманды, ОбработчикОтправки);
	
	ЦепочкаКомандОбработки_УстановитьДанные(Сбис3Команда, 			"ЦепочкаКомандОбработки",	ЦепочкаКомандОбработки);
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки,	"ДокументСБИС",				ДанныеКоманды);
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки,	"СтатусДокумента",			"ПервичнаяОтправка");

	РезультатОтправки_УстановитьОбъект(РезультатОтправки, Сбис3Команда);

КонецПроцедуры

//Готовит пакет к отправке, формиует события-обработчики, делает вызов
//ПараметрыОтправки - СоставПакета, ДокументОтправить
&НаКлиенте
Процедура РезультатОтправки_Асинх_ОтправкаЧерновика(РезультатОтправки, ЦепочкаКомандОбработки)
	
	Модифицирован = СоставПакета_Получить(ЦепочкаКомандОбработки.СоставПакета, "Модифицирован");
	
	Если Модифицирован Тогда	
		
		ПараметрыОтправки	= Новый Структура("Кэш, РезультатОтправки", ГлавноеОкно.Кэш, РезультатОтправки);
		ОбработчикОтправки	= НовыйСбисОписаниеОповещения("WriteAttachment", ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция, ПараметрыОтправки);
		
		Результат = Новый Структура;
		Результат.Вставить("Message",		Новый Структура("Функция, ФункцияОшибки",	"WriteAttachment_Message", "РезультатОтправки_Асинх_Ошибка"));
		                                                                                                             
		Сбис3Команда		= РезультатОтправки_НовыйАсинхроннаяСбисКоманда(РезультатОтправки, ЦепочкаКомандОбработки, ОбработчикОтправки);
		АсинхроннаяСбисКоманда_Установить(Сбис3Команда, "События", Результат);
		
	Иначе
		
		ПараметрыОтправки	= Новый Структура("Кэш, РезультатОтправки", ГлавноеОкно.Кэш, РезультатОтправки);
		ОбработчикОтправки	= НовыйСбисОписаниеОповещения("ExecuteActionEx", ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция, ПараметрыОтправки);
		Сбис3Команда		= РезультатОтправки_НовыйАсинхроннаяСбисКоманда(РезультатОтправки, ЦепочкаКомандОбработки, ОбработчикОтправки);
		
	КонецЕсли;
	
	Попытка
		
		АсинхроннаяСбисКоманда_Выполнить(Сбис3Команда);
		
	Исключение
		
		//Упала отправка в поток, сами пропишем ошибку
		АсинхронноеСбисСобытие = НовыйАсинхронноеСбисСобытие(Сбис3Команда.Идентификатор, НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.РезультатОтправки_Асинх_ОтправкаЧерновика"), "Error");
		АсинхроннаяСбисКоманда_ВызватьСобытие(Сбис3Команда, АсинхронноеСбисСобытие);
		
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Функция РезультатОтправки_НовыйАсинхроннаяСбисКоманда(РезультатОтправки, АргументСбисКоманды=Неопределено, ОбработчикОтправки=Неопределено) Экспорт
	
	Если ОбработчикОтправки = Неопределено Тогда
		
		КлючСобытийИнтеграции	= ЦепочкаКомандОбработки_Получить(АргументСбисКоманды, "Действие");
		
	Иначе
		
		КлючСобытийИнтеграции	= ОбработчикОтправки.ИмяПроцедуры;
		
	КонецЕсли;
	ПодпискиКоманд	= ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "ПодпискиДляКоманд");

	//Для готового пакета вызываем отправку
	ПараметрыКоманды = Новый Структура("АргументВызова, ВремяОжиданияОтвета, ПодпискиНаСобытия");
	ПараметрыКоманды.АргументВызова			= АргументСбисКоманды;
	ПараметрыКоманды.ВремяОжиданияОтвета	= РезультатОтправки.ПараметрыОтправки.ОжиданиеОтвета;
	ПараметрыКоманды.ПодпискиНаСобытия		= ПодпискиКоманд.Получить(КлючСобытийИнтеграции);
	
	Если ОбработчикОтправки = Неопределено Тогда
		Если ЭтоТипСбис(АргументСбисКоманды, "ЦепочкаКомандОбработки") Тогда
			
			ПараметрыКоманды.Вставить("Идентификатор", ЦепочкаКомандОбработки_Получить(АргументСбисКоманды, "Идентификатор"));
			
		Иначе
			
			ПараметрыКоманды.Вставить("Идентификатор", Строка(Новый УникальныйИдентификатор));
			
		КонецЕсли;
	КонецЕсли;
		
	Сбис3Команда = НовыйАсинхроннаяСбисКоманда(ОбработчикОтправки, ПараметрыКоманды);
	
	//Если умная отправка, то подписки по-умолчанию. Иначе события на команду требуется установить руками. 
	ПараметрыСобытий		= Новый Структура("Кэш, РезультатОтправки, Команда", ГлавноеОкно.Кэш, РезультатОтправки, Сбис3Команда);
	КлючСобытийИнтеграции	= КлючСобытийИнтеграции + "_УстановитьПодпискиСобытий";
	
	МодульСобытияОтправки = НайтиФункциюСеансаОбработки(КлючСобытийИнтеграции,  ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя"));
	Если МодульСобытияОтправки = Ложь Тогда
		
		Если Не ОбработчикОтправки = Неопределено Тогда 
			
			// Установить подписки по-умолчанию по обработчику. Должны быть в модуле вызова.
			ПодпискиВызова = Новый Структура;
			ПодпискиВызова.Вставить("Error",		Новый Структура("Функция, Модуль",					
				ОбработчикОтправки.ИмяПроцедуры + "_Error",
				ОбработчикОтправки.Модуль));
			ПодпискиВызова.Вставить("Message",	Новый Структура("Функция, ФункцияОшибки, Модуль",	
				ОбработчикОтправки.ИмяПроцедуры + "_Message",
				ОбработчикОтправки.ИмяПроцедуры + "_Error",
				ОбработчикОтправки.Модуль));

			АсинхроннаяСбисКоманда_Установить(Сбис3Команда, "События", ПодпискиВызова);
			
		КонецЕсли;
		
	Иначе
		
		ОбработчикУстановить = НовыйСбисОписаниеОповещения(КлючСобытийИнтеграции, МодульСобытияОтправки);
		ВыполнитьСбисОписаниеОповещения(Сбис3Команда, ОбработчикУстановить);
		
	КонецЕсли;
	АсинхроннаяСбисКоманда_Установить(Сбис3Команда, "ПараметрыСобытий", ПараметрыСобытий);
	
	Возврат Сбис3Команда;

КонецФункции

//Отправляет пакет в свободный поток или добавляет в очередь
&НаКлиенте
Процедура РезультатОтправки_ДокументВСвободныйПоток(РезультатОтправки, ЦепочкаКомандОбработки)
	
	РезультатОтправки_ОжиданиеПотоков(РезультатОтправки);
	РезультатОтправки_Асинх_Отправка(РезультатОтправки, ЦепочкаКомандОбработки);

КонецПроцедуры

// Процедура - ожидание нужного числа потоков для отправки.
//
// Параметры:
//  РезультатОтправки			- экземпляр класса РезультатОтправки (Структура)
//  СвободныхПотоковТребуется	- Число	 - ожидание требуемого количества потоков отправки
// Вызывает исключение, если за значение параметра времени ожидания ответа не удалось получить нужное количество к отправке.
&НаКлиенте
Процедура РезультатОтправки_ОжиданиеПотоков(РезультатОтправки, СвободныхПотоковТребуется = 1)
	
	ВремяНачалаОжиданияПотока	= ТекущаяДата();
	//ОбновитьОтображение			= Истина;
	//ПараметрыИндикатора			= Новый Структура("Прерывать", Ложь);
	Пока	РезультатОтправки.ПараметрыОтправки.КоличествоПотоков - ГлобальныйКэш.СБИС.ДанныеИнтеграции.Потоки.Количество() < СвободныхПотоковТребуется Цикл 
		ОсталосьОжидать = РезультатОтправки.ПараметрыОтправки.ОжиданиеОтвета - Цел(ТекущаяДата() - ВремяНачалаОжиданияПотока);
		Если ОсталосьОжидать < 0 Тогда
			
			ВызватьСбисИсключение(775, "МодульОбъектаКлиент.РезультатОтправки_ОжиданиеПотоков",,, "Не удалось получить потоки для отправки за разумное время.");
			
		КонецЕсли;
		РезультатОтправки_ОбработкаПрерывания(РезультатОтправки);
		
		//Если ОсталосьОжидать < РезультатОтправки.ПараметрыОтправки.ОжиданиеОтвета - 10 Тогда 
		//	//Покажем отсчёт до прерывания отправки с ошибкой
		//	Если ОбновитьОтображение Тогда
		//		РезультатОтправки_СпрятатьСтатус(РезультатОтправки);
		//	КонецЕсли;
		//	ОбновитьОтображение = Ложь;
		//	РезультатОтправки_ПоказатьСтатус(РезультатОтправки, "Ожидание свободных потоков", ОсталосьОжидать / РезультатОтправки.ПараметрыОтправки.ОжиданиеОтвета * 100,,ПараметрыИндикатора);
		////Иначе
		////	ГлавноеОкно.СбисПоказатьСостояние("Ожидание свободных потоков");
		//КонецЕсли;
		
		РезультатОтправки_ОбработатьОтветы_Асинхронно(РезультатОтправки);
		РезультатОтправки_ЗаписатьНакопленныеСтатусы(РезультатОтправки);
	КонецЦикла;
		
КонецПроцедуры

