
&НаКлиенте
Процедура РезультатОтправки_Асинх_ВводКомментария_Подготовить(РезультатОтправки, ЦепочкаКомандОбработки)
	Перем ДействиеАктивировать;
	
	// Подключить подписку на обработку проверки сертификатов.
	КомандаВыполнить		= "РезультатОтправки_Асинх_ВводКомментария";
	КомандаЗавершить		= "РезультатОтправки_Асинх_ВводКомментария_Завершить";

	ОчередьДействий			= ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "Очередь");
	ДействиеАктивировать	= ОчередьДействий.Получить(КомандаВыполнить);
		
	Если ДействиеАктивировать = Неопределено Тогда
		
		ДействиеАктивировать = НовыйЦепочкаКомандОбработки(КомандаВыполнить,,10);

		ЦепочкаКомандОбработки_УстановитьКоманду(ДействиеАктивировать, КомандаВыполнить, РезультатОтправки);
		ЦепочкаКомандОбработки_УстановитьКоманду(ДействиеАктивировать, КомандаЗавершить, РезультатОтправки);
		
		РезультатОтправки_УстановитьОбъект(РезультатОтправки, ДействиеАктивировать);
		
	КонецЕсли;

	ЦепочкаКомандОбработки_УстановитьПодпискуДействия(ДействиеАктивировать, ЦепочкаКомандОбработки, КомандаЗавершить);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОтправки_Асинх_ВводКомментария(РезультатОтправки, ПараметрыКоманды) Экспорт
	
	//РезультатОтправки_ПоказатьСтатус(РезультатОтправки, "Проверка сертификатов");
	
	ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;
	ДанныеКоманды			= ПараметрыКоманды.ДанныеКоманды;
	СертификатыАктивировать = ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "КэшСертификатов");
	ИННФильтр				= СертификатыАктивировать.ИННАктивировать.ВыгрузитьЗначения();
	
	Если ИННФильтр.Количество() Тогда
		
		СертификатыАктивировать.ИННВОбработке.ЗагрузитьЗначения(ИННФильтр);
			
		// Подключить обработчик Интеграции для запуска
		ОбработчикПолучитьДокумент	= НовыйСбисОписаниеОповещения("Асинх_СБИС_СписокСертификатов", ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция"));
		Сбис3Команда				= РезультатОтправки_НовыйАсинхроннаяСбисКоманда(РезультатОтправки,, ОбработчикПолучитьДокумент);
		
		ЦепочкаКомандОбработки_УстановитьДанные(Сбис3Команда, "ЦепочкаКомандОбработки",	ЦепочкаКомандОбработки);

		ИмяФункцииОшибки	= "РезультатОтправки_Асинх_ПроверитьСертификаты_Ошибка";
		Подписки_Прочитать	= Новый Структура;
		Подписки_Прочитать.Вставить("Error",	Новый Структура("Функция, Модуль",	ИмяФункцииОшибки,										МодульОбъектаКлиент()));
		Подписки_Прочитать.Вставить("Message",	Новый Структура("Функция, Модуль",	"РезультатОтправки_Асинх_ПроверитьСертификаты_Ответ",	МодульОбъектаКлиент()));
		Подписки_Прочитать.Message.Вставить("ФункцияОшибки", ИмяФункцииОшибки);
		
		АсинхроннаяСбисКоманда_Установить(Сбис3Команда, "События", Подписки_Прочитать);
		
		РезультатОтправки_УстановитьОбъект(РезультатОтправки, Сбис3Команда);
		
		ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ОжидаетОтвета");
		
	КонецЕсли;
	
КонецПроцедуры

