
&НаКлиенте
Процедура РезультатОтправки_Асинх_ВыполнитьДействие(РезультатОтправки, ПараметрыКоманды) Экспорт
	Перем КомментарийДокумента, ДействиеВыполнить, ЭтапВыполнить, Сертификат, Комментарий;
	
	ЦепочкаКомандОбработки		= ПараметрыКоманды.ЦепочкаКомандОбработки;
	ПараметрыВыполнить			= ПараметрыКоманды.ДанныеКоманды;
	ИмяДействияСБИСВыполнить	= ПараметрыВыполнить.ИмяКоманды;
	
	ДокументСБИС		= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки,	"ДокументСБИС");	
	ОбработаныСлужебные	= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки,	"ОбработаныСлужебные");
	
	ГотовоКВыполнению	= Истина;
	ПараметрыВыполнить.Свойство("Сертификат", Сертификат);
	
	Если Не ПараметрыВыполнить.Свойство("Этап", ЭтапВыполнить) Тогда
		
		Если ДокументСБИС.Свойство("Этап", ЭтапВыполнить) Тогда
			
			ЭтапВыполнить = ЭтапВыполнить[0];
			
		Иначе
			
			ОшибкаВыполнитьДействие = НовыйСбисИсключение(	735,
															"МодульОбъектаКлиент.РезультатОтправки_Асинх_ВыполнитьДействие",
															,
															,
															"На документе СБИС отсутствуют активные этапы.");
			ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Ошибка", ОшибкаВыполнитьДействие);
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ПараметрыВыполнить.Свойство("Действие", ДействиеВыполнить) Тогда
		
		// Найти действие по его названию
		Для Каждого ЭлДействие Из ЭтапВыполнить.Действие Цикл
			
			Если ЭлДействие.Название = ИмяДействияСБИСВыполнить Тогда
				
				ДействиеВыполнить = ЭлДействие;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ДействиеВыполнить = Неопределено Тогда

		ТекстОшибки	= "На документе СБИС отсутствует действие " + ИмяДействияСБИСВыполнить;
		ОшибкаВыполнитьДействие = НовыйСбисИсключение(	735,
														"МодульОбъектаКлиент.РезультатОтправки_Асинх_ВыполнитьДействие",
														,
														ТекстОшибки,
														ТекстОшибки);
		ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Ошибка", ОшибкаВыполнитьДействие);
		Возврат;
				
	КонецЕсли;
	
	ПараметрыВыполнить.Вставить("Этап",			ЭтапВыполнить);
	ПараметрыВыполнить.Вставить("Действие",		ДействиеВыполнить);
 	ПараметрыВыполнить.Вставить("СоставПакета",	ДокументСБИС);

	Если	НРег(ДействиеВыполнить.ТребуетКомментария) = "да" Тогда
		
		ГотовоКВыполнению	= Ложь;
		РезультатОтправки_Асинх_ВводКомментария_Подготовить(РезультатОтправки, ЦепочкаКомандОбработки);
		
	КонецЕсли;

	Если	НРег(ДействиеВыполнить.ТребуетПодписания) = "да"
		И	Сертификат = Неопределено Тогда
			
		Сертификат = ПодобратьСертификатДляДействияСДокументомСБИС(ПараметрыВыполнить);
		
		Если Сертификат = Неопределено Тогда
			
			ТекстОшибки	= "Отсутствует сертификат ЭЦП для утверждения/отклонения пакета документов " + ЦепочкаКомандОбработки.ПредставлениеПакета;
			ОшибкаВыполнитьДействие = НовыйСбисИсключение(755, "МодульОбъектаКлиент.РезультатОтправки_Асинх_ПодобратьСерфтикат",,, ТекстОшибки);
			ЦепочкаКомандОбработки_Установить("Ошибка", ОшибкаВыполнитьДействие);
			
		КонецЕсли;
		
		ПараметрыВыполнить.Вставить("Сертификат", Сертификат);
	
	КонецЕсли;
	
	Если ОбработаныСлужебные = Неопределено Тогда
		
		ГотовоКВыполнению	= Ложь;
		
		// Установить цепочки для продолжения
		ЦепочкаКомандОбработки_УстановитьКоманду(	ЦепочкаКомандОбработки,
													"РезультатОтправки_Асинх_ОбработатьСлужебныеДокументыПоПакету",
													ДокументСБИС,
													Новый ФиксированнаяСтруктура("ПорядокВызова", 0));
		
	КонецЕсли;
	
	Если Не ГотовоКВыполнению Тогда
		
		// Переподключить текущую команду
		ЦепочкаКомандОбработки_УстановитьКоманду(	ЦепочкаКомандОбработки,
													"РезультатОтправки_Асинх_ВыполнитьДействие",
													ПараметрыВыполнить);
		Возврат;
		
	КонецЕсли;

	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки,	"СтатусДокумента", "ВыполнитьДействие");
	
	// Пока вызываем синхронное выполнить действие. Разбить на асинхронные команды
	Попытка
		
		ВыполнитьДействиеСДокументомСБИС(ПараметрыВыполнить);
		
	Исключение
		
		ОшибкаВыполнитьДействие = НовыйСбисИсключение(	ИнформацияОбОшибке(),
														"МодульОбъектаКлиент.РезультатОтправки_Асинх_ВыполнитьДействие");
		ЦепочкаКомандОбработки_Установить("Ошибка", ОшибкаВыполнитьДействие);
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОтправки_Асинх_ОбработатьСлужебныеДокументыПоПакету(РезультатОтправки, ПараметрыКоманды) Экспорт

	ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;
	ДокументСБИС			= ПараметрыКоманды.ДанныеКоманды;
	
	// Подключить обработчик Интеграции для запуска
	ОбработчикПолучитьДокумент	= НовыйСбисОписаниеОповещения("ProcessServiceStagesEx", ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция"));
	Сбис3Команда				= РезультатОтправки_НовыйАсинхроннаяСбисКоманда(РезультатОтправки, ДокументСБИС, ОбработчикПолучитьДокумент);
	
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки,	"СтатусДокумента",			"ОбработкаСлужебныхДокументов");
	ЦепочкаКомандОбработки_УстановитьДанные(Сбис3Команда,			"ЦепочкаКомандОбработки",	ЦепочкаКомандОбработки);

	ИмяТекущейКоманды	= "РезультатОтправки_Асинх_ОбработатьСлужебныеДокументыПоПакету";
	ОписаниеОшибки		= Новый Структура("Функция, Модуль",				"РезультатОтправки_Асинх_Ошибка",						МодульОбъектаКлиент());
	ОписаниеОтвет		= Новый Структура("Функция, ФункцияОшибки, Модуль",	ИмяТекущейКоманды + "_Ответ",	ОписаниеОшибки.Функция, МодульОбъектаКлиент());
	
	Подписки_Служебки = Новый Структура;
	Подписки_Служебки.Вставить("Error",		ОписаниеОшибки);
	Подписки_Служебки.Вставить("Message",	ОписаниеОтвет);
	
	АсинхроннаяСбисКоманда_Установить(Сбис3Команда, "События", Подписки_Служебки);
	
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ОжидаетОтвета");
	
	РезультатОтправки_УстановитьОбъект(РезультатОтправки, Сбис3Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОтправки_Асинх_ОбработатьСлужебныеДокументыПоПакету_Ответ(АсинхронноеСбисСобытие, ПараметрыВызова) Экспорт

	РезультатОтправки	= ПараметрыВызова.РезультатОтправки;
	КомандаЗавершена	= ПараметрыВызова.Команда;
	
	ЦепочкаКомандОбработки = ЦепочкаКомандОбработки_ПолучитьДанные(КомандаЗавершена, "ЦепочкаКомандОбработки");
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки,	"ОбработаныСлужебные", АсинхронноеСбисСобытие.Данные);

 	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");
		
КонецПроцедуры

