
// Процедура - Результат отправки асинх подобрать серфтикат
//
// Параметры:
//  РезультатОтправки	 - РезультатОтправки - структура отправки
//  ПараметрыКоманды	 - ПараметрыКоманды	 - структура ЦепочкаКомандОбработки, ДанныеКоманды
//
&НаКлиенте
Процедура РезультатОтправки_Асинх_ПрочитатьДокумент(РезультатОтправки, ПараметрыКоманды) Экспорт
	
	ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;
	ПараметрыЧтения			= ПараметрыКоманды.ДанныеКоманды;
	
	// Подключить обработчик Интеграции для запуска
	ОбработчикПолучитьДокумент	= НовыйСбисОписаниеОповещения("Асинх_СБИС_ПрочитатьДокумент", ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция"));
	Сбис3Команда				= РезультатОтправки_НовыйАсинхроннаяСбисКоманда(РезультатОтправки, ПараметрыЧтения, ОбработчикПолучитьДокумент);

	// Установить подписки ПрочитатьДокумент
	ПодпискаОтвет	= Новый Структура("Функция, ФункцияОшибки, Модуль",
					"РезультатОтправки_Асинх_ПрочитатьДокумент_Ответ",
					"РезультатОтправки_Асинх_ПрочитатьДокумент_Ошибка",
					МодульОбъектаКлиент());
	ПодпискаОшибка	= Новый Структура("Функция, ФункцияОшибки, Модуль",
					ПодпискаОтвет.ФункцияОшибки,
					РезультатОтправки.ПараметрыОтправки.ИмяОбработчикаФатальныхОшибок,
					МодульОбъектаКлиент());
	ПодпискиВызова	= Новый Структура;
	ПодпискиВызова.Вставить("Message",	ПодпискаОтвет);
	ПодпискиВызова.Вставить("Error",	ПодпискаОшибка);

	АсинхроннаяСбисКоманда_Установить(Сбис3Команда, "События", ПодпискиВызова);
			
	ЦепочкаКомандОбработки_УстановитьДанные(Сбис3Команда, "ЦепочкаКомандОбработки",	ЦепочкаКомандОбработки);

	Если ЭтоТипСбис(ПараметрыЧтения, "СоставПакета") Тогда
		
		// Документ уже прочитан, берем его как есть и вызываем событие ответа
		АсинхронноеСбисСобытие = НовыйАсинхронноеСбисСобытие(Сбис3Команда.Идентификатор, ПараметрыЧтения, "Message");
		АсинхроннаяСбисКоманда_ВызватьСобытие(Сбис3Команда, АсинхронноеСбисСобытие);
		Возврат;
		
	КонецЕсли;
		
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки,	"СтатусДокумента", "ЧтениеДокумента");
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ОжидаетОтвета");
    РезультатОтправки_УстановитьОбъект(РезультатОтправки, Сбис3Команда);
		
КонецПроцедуры

// Процедура - обработка ответа на ПрочитатьДокумент
//
// Параметры:
//  АсинхронноеСбисСобытие	 - АсинхронноеСбисСобытие - структура события ответа
//  ПараметрыКоманды		 - ПараметрыКоманды	 - структура ЦепочкаКомандОбработки, ДанныеКоманды
//
&НаКлиенте
Процедура РезультатОтправки_Асинх_ПрочитатьДокумент_Ответ(АсинхронноеСбисСобытие, ПараметрыВызова) Экспорт

	КомандаЗавершена		= ПараметрыВызова.Команда;
	РезультатОтправки		= ПараметрыВызова.РезультатОтправки;
	ДокументСБИС			= АсинхронноеСбисСобытие.Данные;
	
	ПараметрыДокумет = СоставПакета_Получить(ДокументСБИС, "Параметры");
	ПараметрыДокумет.Вставить("Прочитан", Истина);
	
	ЦепочкаКомандОбработки	= ЦепочкаКомандОбработки_ПолучитьДанные(КомандаЗавершена, "ЦепочкаКомандОбработки");
	
	// Стоит опция проверки черновика.
	ПроверятьЧерновик = ЦепочкаКомандОбработки_УдалитьДанные(ЦепочкаКомандОбработки, "ПроверитьЧерновик");
	Если ПроверятьЧерновик = Истина Тогда
		
		Если СоставПакета_Получить(ДокументСБИС, "ЭтоЧерновик") Тогда
			
			// Если это черновик, то перегенерировть цепочку по прочитанному документу
			ЦепочкаКомандОбработки_УдалитьКоманду(ЦепочкаКомандОбработки,	"РезультатОтправки_Асинх_ПодготовитьСтруктуруДокумента");
			РезультатОтправки_СгенерироватьКомандыДляДействия(РезультатОтправки, ЦепочкаКомандОбработки, ДокументСБИС);
			
		Иначе
			
			// Следующая команда будет подготовка структуры документов. Установить готовность, прочитанный документ больше не понадобится
			ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");

		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "ДокументСБИС",		ДокументСБИС);
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки,	"СтатусДокумента",	"ДокументПрочитан");
	
	ПараметрыЗапустить	= Новый ФиксированнаяСтруктура("ЦепочкаКомандОбработки", ЦепочкаКомандОбработки);	
	РезультатОтправки_Асинх_ПрочитатьДокумент_Продолжить(РезультатОтправки, ПараметрыЗапустить);
	
КонецПроцедуры

// Процедура - обработка ответа на ПрочитатьДокумент
//
// Параметры:
//  АсинхронноеСбисСобытие	 - АсинхронноеСбисСобытие - структура события ответа
//  ПараметрыКоманды		 - ПараметрыКоманды	 - структура ЦепочкаКомандОбработки, ДанныеКоманды
//
&НаКлиенте
Процедура РезультатОтправки_Асинх_ПрочитатьДокумент_Ошибка(АсинхронноеСбисСобытие, ПараметрыВызова) Экспорт
	Перем ОснованиеСоставПакета;
	
	КомандаЗавершена		= ПараметрыВызова.Команда;
	РезультатОтправки		= ПараметрыВызова.РезультатОтправки;
	
	// Прочитать исключение и перегенерировать его для уточнения сценария ошибки
	ИсключениеПрочитать		= НовыйСбисИсключение(АсинхронноеСбисСобытие.Данные, "МодульОбъектаКлиент.РезультатОтправки_Асинх_ПрочитатьДокумент_Ошибка");
	ЦепочкаКомандОбработки	= ЦепочкаКомандОбработки_ПолучитьДанные(КомандаЗавершена, "ЦепочкаКомандОбработки");

	// Ошибка чтения документа. Установить сценарий отправки черновика для обработки детализации.
	СоставПакетаГенерируемый	= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "ОснованиеГенерацииСоставПакета");
	ПроверитьЧерновик			= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "ПроверитьЧерновик") = Истина;
	Если Не СоставПакетаГенерируемый = Неопределено Тогда
		
		ОснованиеСоставПакета	= СоставПакетаГенерируемый[0].Значение;
		
	КонецЕсли;
	ПараметрыИсключение		= Новый Структура("Основание, Черновик", ОснованиеСоставПакета, ПроверитьЧерновик);
	ИсключениеПрочитать		= ПерегенерироватьСбисИсключение_ПрочитатьДокумент(ИсключениеПрочитать, ПараметрыИсключение);
	
	РезультатОтправки_ОбработатьОшибку_ДокументСБИС(РезультатОтправки, ИсключениеПрочитать, ПараметрыВызова);
	РезультатОтправки_УдалитьПоток(РезультатОтправки, АсинхронноеСбисСобытие)
	
КонецПроцедуры

// Процедура - после ПрочитатьДокумент, проверить серфтикат и установовить проверку серта, если надо
//
// Параметры:
//  АсинхронноеСбисСобытие	 - АсинхронноеСбисСобытие - структура события ответа
//  ПараметрыКоманды		 - ПараметрыКоманды	 - структура ЦепочкаКомандОбработки, ДанныеКоманды
//
&НаКлиенте
Процедура РезультатОтправки_Асинх_ПрочитатьДокумент_Продолжить(РезультатОтправки, ПараметрыКоманды) Экспорт

	ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;

	Если Не РезультатОтправки_ПроверкаСертификатаПродолжитьОтправку(РезультатОтправки, ЦепочкаКомандОбработки) Тогда
		
		СтатусЦепочки = ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "Статус");
		Если Не СтатусЦепочки = "Ошибка" Тогда
			
			// Требуется проверка сертификата, установлена подписка на действие сертификатов
			ИмяКомандыПосле					= "РезультатОтправки_Асинх_ПрочитатьДокумент_Продолжить";
			ПараметрыУстановитьПродолжить	= Новый ФиксированнаяСтруктура("ПорядокВызова", 0);
			ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, ИмяКомандыПосле, РезультатОтправки, ПараметрыУстановитьПродолжить);
			
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
 	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");
		
КонецПроцедуры	

