
// Процедура - Результат отправки асинх подобрать серфтикат
//
// Параметры:
//  РезультатОтправки	 - РезультатОтправки - структура отправки
//  ПараметрыКоманды	 - ПараметрыКоманды	 - структура ЦепочкаКомандОбработки, ДанныеКоманды
//
&НаКлиенте
Процедура РезультатОтправки_Асинх_ПрочитатьДокумент(РезультатОтправки, ПараметрыКоманды) Экспорт
	
	ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;
	ПараметрыЧтения			= ПараметрыКоманды.ДанныеКоманды;
		
	// Подключить обработчик Интеграции для запуска
	ОбработчикПолучитьДокумент	= НовыйСбисОписаниеОповещения("Асинх_СБИС_ПрочитатьДокумент", ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция"));
	Сбис3Команда				= РезультатОтправки_НовыйАсинхроннаяСбисКоманда(РезультатОтправки, ПараметрыЧтения, ОбработчикПолучитьДокумент);

	// Установить подписки ПрочитатьДокумент
	ПодпискиВызова = Новый Структура;
	ПодпискиВызова.Вставить("Message",	Новый Структура("Функция, ФункцияОшибки, Модуль",
			"РезультатОтправки_Асинх_ПрочитатьДокумент_Ответ",
			"РезультатОтправки_Асинх_Ошибка",
			МодульОбъектаКлиент()));
	ПодпискиВызова.Вставить("Error", Новый Структура("Функция, Модуль", ПодпискиВызова.Message.ФункцияОшибки, ПодпискиВызова.Message.Модуль));

	АсинхроннаяСбисКоманда_Установить(Сбис3Команда, "События", ПодпискиВызова);
			

	ЦепочкаКомандОбработки_УстановитьДанные(Сбис3Команда, 			"ЦепочкаКомандОбработки",	ЦепочкаКомандОбработки);
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки,	"СтатусДокумента",			"ЧтениеДокумента");

	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ОжидаетОтвета");
    РезультатОтправки_УстановитьОбъект(РезультатОтправки, Сбис3Команда);
		
КонецПроцедуры

// Процедура - обработка ответа на ПрочитатьДокумент
//
// Параметры:
//  АсинхронноеСбисСобытие	 - АсинхронноеСбисСобытие - структура события ответа
//  ПараметрыКоманды		 - ПараметрыКоманды	 - структура ЦепочкаКомандОбработки, ДанныеКоманды
//
&НаКлиенте
Процедура РезультатОтправки_Асинх_ПрочитатьДокумент_Ответ(АсинхронноеСбисСобытие, ПараметрыВызова) Экспорт

	КомандаЗавершена		= ПараметрыВызова.Команда;
	РезультатОтправки		= ПараметрыВызова.РезультатОтправки;
	ДокументСБИС			= АсинхронноеСбисСобытие.Данные;
	
	ЦепочкаКомандОбработки	= ЦепочкаКомандОбработки_ПолучитьДанные(КомандаЗавершена, "ЦепочкаКомандОбработки");
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "ДокументСБИС",	ДокументСБИС);
	
	ПараметрыЗапустить	= Новый ФиксированнаяСтруктура("ЦепочкаКомандОбработки", ЦепочкаКомандОбработки);	
	РезультатОтправки_Асинх_ПрочитатьДокумент_Продолжить(РезультатОтправки, ПараметрыЗапустить);
	
КонецПроцедуры

// Процедура - после ПрочитатьДокумент, проверить серфтикат и установовить проверку серта, если надо
//
// Параметры:
//  АсинхронноеСбисСобытие	 - АсинхронноеСбисСобытие - структура события ответа
//  ПараметрыКоманды		 - ПараметрыКоманды	 - структура ЦепочкаКомандОбработки, ДанныеКоманды
//
&НаКлиенте
Процедура РезультатОтправки_Асинх_ПрочитатьДокумент_Продолжить(РезультатОтправки, ПараметрыКоманды) Экспорт

	ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;

	Если Не РезультатОтправки_ПроверкаСертификатаПродолжитьОтправку(РезультатОтправки, ЦепочкаКомандОбработки) Тогда
		
		СтатусЦепочки = ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "Статус");
		Если Не СтатусЦепочки = "Ошибка" Тогда
			
			// Требуется проверка сертификата, установлена подписка на действие сертификатов
			ИмяКомандыПосле					= "РезультатОтправки_Асинх_ПрочитатьДокумент_Продолжить";
			ПараметрыУстановитьПродолжить	= Новый ФиксированнаяСтруктура("ПорядокВызова", 0);
			ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, ИмяКомандыПосле, РезультатОтправки, ПараметрыУстановитьПродолжить);
			
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
 	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");
		
КонецПроцедуры	

