
&НаКлиенте
Процедура РезультатОтправки_Асинх_ПодготовитьРасхождение(РезультатОтправки, ПараметрыКоманды) Экспорт
	
	//РезультатОтправки_ПоказатьСтатус(РезультатОтправки, "Проверка сертификатов");
	
	ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;
	ДанныеКоманды			= ПараметрыКоманды.ДанныеКоманды;

	ДокументСБИС			= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки,	"ДокументСБИС");
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");
	
	ДопПараметрыРасхождения	= Новый Структура("СоставПакета", ДокументСБИС);
	ОбработчикРезультатаРасхождения	= НовыйСбисОписаниеОповещения(
										"РезультатОтправки_Асинх_ПодготовитьРасхождение_Ответ",
										МодульОбъектаКлиент(),
										ДопПараметрыРасхождения);
	
	СтрокиОтмечены	= Новый Массив;

	ВложенияСБИС	= СоставПакета_Получить(ДокументСБИС, "Вложения");
	Для Каждого ВложениеСБИС Из ВложенияСБИС Цикл
		
		СтрокаДляРасхождения	= Новый Структура("Вложение, Документы1С", Новый СписокЗначений, Новый СписокЗначений);
		СтрокаДляРасхождения.Вложение.Добавить(ВложениеСБИС);
		СтрокаДляРасхождения.Документы1С.ЗагрузитьЗначения(ВложениеСБИС_Получить(ВложениеСБИС, "Документы1С").ВыгрузитьЗначения());
		СтрокиОтмечены.Добавить(СтрокаДляРасхождения);
		
	КонецЦикла;
	
	СписокДляРасхождения	= СформироватьСписокДляВызоваРасхождений(СтрокиОтмечены, ДопПараметрыРасхождения);
	
	Если ЗначениеЗаполнено(СписокДляРасхождения) Тогда
		
		// Пока втупую брать первый по списку. Надо прикрутить нормальный выбор
		ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки,	"РезультатОтправки_Асинх_СформироватьРасхождение", СписокДляРасхождения[0]);
		
		//Если СписокДляРасхождения.Количество() = 1 Тогда
		//	
		//	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки,	"ДанныеДляРасхождения", СписокДляРасхождения[0]);
		//	
		//Иначе
		//	
		//	СообщениеДетализации	= "Выбор варианта расхождения не доступен. Требуется отлючить один из файлов настроек: ";
		//	
		//	Для Каждого ЭлементСписка Из СписокДляРасхождения Цикл
		//		
		//		СообщениеДетализации = СообщениеДетализации + ЭлементСписка.Представление + ", ";
		//		
		//	КонецЦикла;
		//	
		//	СообщениеДетализации = Лев(СообщениеДетализации, СтрДлина(СообщениеДетализации) - 2) + ".";
		//	
		//	ИсключениеВыбора		= НовыйСбисИсключение(735, "МодульОбъектаКлиент.РезультатОтправки_Асинх_ПодготовитьРасхождение",,,СообщениеДетализации);
		//	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Ошибка", ИсключениеВыбора);
		//	Возврат;
		//	
		////	ДействиеОтправитьУоО = НовыйПользовательскоеДействие(СбисИсключение, ДопПараметры);
		////	ДействиеОтправитьУоО.Идентификатор = "ОтправитьУведомлениеОбОтгрузке";
		////	ДействиеОтправитьУоО.Представление = "Отправить Уведомление об отгрузке";
		////	ДействиеОтправитьУоО.Параметры.Вставить("Статус", "Завершено");
		////
		////	ДействиеОтправитьОтмена = НовыйПользовательскоеДействие(СбисИсключение, ДопПараметры);
		////	ДействиеОтправитьОтмена.Идентификатор = "Отмена";
		////	ДействиеОтправитьОтмена.Представление = "Отмена";
		////	ДействиеОтправитьОтмена.Параметры.Вставить("Статус", "Ошибка");
		////																		
		////	ПользовательскиеДействия.Добавить(ДействиеОтправитьУоО);
		////	ПользовательскиеДействия.Добавить(ДействиеОтправитьОтмена);
		////	
		//
		//КонецЕсли;
		
	КонецЕсли;
	
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОтправки_Асинх_СформироватьРасхождение(РезультатОтправки, ПараметрыКоманды) Экспорт
	
	ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;
	ДанныеКоманды			= ПараметрыКоманды.ДанныеКоманды;
	
	Если ДанныеКоманды = Неопределено Тогда
		
		// Завершено, никаких иных операций не требуется, перейти к следующему действию
		ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");
		
	КонецЕсли;
	ДокументСБИС			= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки,	"ДокументСБИС");
	
	ПараметрыОбработчика	= Новый ФиксированнаяСтруктура("РезультатОтправки, ЦепочкаКомандОбработки", РезультатОтправки, ЦепочкаКомандОбработки);
	ОбработчикРасхождения	= НовыйСбисОписаниеОповещения("РезультатОтправки_Асинх_СформироватьРасхождение_ОбработатьРезультат", МодульОбъектаКлиент(), ПараметрыОбработчика);
	
	ПараметрыРасхождение	= Новый Структура("СоставПакета, ОбработчикРезультата", ДокументСБИС, ОбработчикРасхождения);
	
	СформироватьРасхождениеСДокументомСБИС(ДанныеКоманды, ПараметрыРасхождение);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОтправки_Асинх_СформироватьРасхождение_ОбработатьРезультат(РезультатРасхождение, ПараметрыОбработчика) Экспорт
	
	ЦепочкаКомандОбработки	= ПараметрыОбработчика.ЦепочкаКомандОбработки;
	
	Если		ЭтоТипСбис(РезультатРасхождение, "СбисИсключение") Тогда
		
		// Не удалось сформировать расхождение, т.к. не хватило данных, то просто перейдём к следующему этапу
		Если Не РезультатРасхождение.code = 726 Тогда
			
			// Упала ошибка, обломать цепочку
			ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Ошибка", РезультатРасхождение);
			Возврат;
			
		КонецЕсли;
		
	ИначеЕсли	ЭтоТипСбис(РезультатРасхождение, "ВложениеСБИС") Тогда	
		
		ДокументСБИС			= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки,	"ДокументСБИС");
		Если	РезультатРасхождение.Свойство("ЕстьРасхождения")
			И	РезультатРасхождение.ЕстьРасхождения Тогда
			
			ДокументСБИС.Вставить("ЕстьРасхождения", Истина);
			
		КонецЕсли;
		
		ДокументСБИС.Вложение.Добавить(РезультатРасхождение);
		
	КонецЕсли;
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОтправки_Асинх_ПодготовитьРасхождение_Ответ(АсинхронноеСбисСобытие, ПараметрыВызова) Экспорт
                      	
	РезультатОтправки		= ПараметрыВызова.РезультатОтправки;
	КомандаЗавершена		= ПараметрыВызова.Команда;
	ЦепочкаКомандОбработки	= ПараметрыВызова.ЦепочкаКомандОбработки;
	
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");

КонецПроцедуры

&НаКлиенте
Процедура РезультатОтправки_Асинх_ПодготовитьРасхождение_Ошибка(АсинхронноеСбисСобытие, ПараметрыВызова) Экспорт

	РезультатОтправки		= ПараметрыВызова.РезультатОтправки;
	КомандаЗавершена		= ПараметрыВызова.Команда;
	ЦепочкаКомандОбработки	= ПараметрыВызова.ЦепочкаКомандОбработки;
	
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");

КонецПроцедуры

