
// Процедура - Устанавлениет режим для закрытия формы с вызовом описания оповещения
//
// Параметры:
//  ПараметрыОткрытия	 - Структура	 - Параметры для настройки и открытия формы
//
&НаКлиенте 
Процедура ФормаЗакрытьУстановитьСтатусОк(АргументЗакрытия = Неопределено)

	ПараметрыФормы.Вставить("РежимЗакрытия",	"ОК");
	ПараметрыФормы.Вставить("Результат",		АргументЗакрытия);

КонецПроцедуры

&НаКлиенте 
Процедура ФормаЗакрытьУстановитьСтатусОтмена()

	ПараметрыФормы.Вставить("РежимЗакрытия", "Отмена");

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемРазблокироватьИнтерфейс(Отказ, Параметр1, Параметр2 = "", Параметр3 = Истина)
	
	Попытка
		
		СбисРазблокироватьИнтерфейс(ПараметрыФормы);
		
	Исключение
		
		ИсключениеРазблокировки = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), НазваниеКратко() + ".ПередЗакрытиемРазблокироватьИнтерфейс");
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИсключениеРазблокировки, Новый Структура("Отложенно", Истина));
		
	КонецПопытки;;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииПроверитьСтатус(Отказ = Ложь)
	Перем ФормаИнициирована;
	
	Если	Не	ПараметрыФормы = Неопределено
		И		ПараметрыФормы.Свойство("Инициирована", ФормаИнициирована)
		И		ФормаИнициирована Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Отказ = Истина;
	ИсключениеОткрытие = МодульОбъектаКлиент().НовыйСбисИсключение(735, НазваниеКратко() + ".ПриОткрытииПроверитьСтатус",,,"Форма " + НазваниеКратко() + " не была инициирована.");
	МодульОбъектаКлиент().СообщитьСбисИсключение(ИсключениеОткрытие, Новый Структура("Отложенно", Истина));
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Закрыть();
		
	#КонецЕсли
	
КонецПроцедуры

