
// Процедура - Устанавлениет режим для закрытия формы с вызовом описания оповещения
//
// Параметры:
//  ПараметрыОткрытия	 - Структура	 - Параметры для настройки и открытия формы
//
&НаКлиенте 
Процедура ФормаЗакрытьУстановитьСтатусОк(АргументЗакрытия = Неопределено, ЗакрытьФорму = Ложь)

	ПараметрыФормы.Вставить("РежимЗакрытия",	"ОК");
	ПараметрыФормы.Вставить("Результат",		АргументЗакрытия);
	
	Если ЗакрытьФорму Тогда
		
		Закрыть(АргументЗакрытия);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте 
Процедура ФормаЗакрытьУстановитьСтатусОтмена()

	ПараметрыФормы.Вставить("РежимЗакрытия",	"Отмена");
	ПараметрыФормы.Вставить("Результат",		Неопределено);

КонецПроцедуры

// Процедура - Устанавлениет режим для закрытия формы с вызовом описания оповещения
//
// Параметры:
//  ПараметрыОткрытия	 - Структура	 - Параметры для настройки и открытия формы
//
&НаКлиенте 
Процедура ФормаЗакрытьУстановитьСтатусЗавершить()

	ПараметрыФормы.Вставить("РежимЗакрытия",	"Завершить");
	ПараметрыФормы.Вставить("Результат",		Неопределено);
	
	Закрыть();

КонецПроцедуры

&НаКлиенте 
Функция ФормаУстановитьОбщее(ПараметрыОткрытия, ДопПараметры = Неопределено, ИмяМетодаПродолжить = "")
	Перем ФормаИнициирована;
	
	Если ВладелецФормы = Неопределено Тогда
		
		ВызватьИсключение "Для открытия формы интерфейса необходимо, чтобы был установлен владелец.";
		
	КонецЕсли;
	
	Если Не ДопПараметры = Неопределено Тогда
		
		ДопПараметры.Свойство("Инициировать", ФормаИнициирована);
		
		Если ОписаниеОповещенияОЗакрытии = Неопределено Тогда
			
			ДопПараметры.Свойство("ОбработчикЗакрыть", ОписаниеОповещенияОЗакрытии);
			
		КонецЕсли;
		
		Если	ДопПараметры.Свойство("Отложенно")
			И	ДопПараметры.Отложенно Тогда
			
			КлючДействия		= НазваниеКратко() + "_" + ИмяМетодаПродолжить;
			ОтложенноеОткрытие	= МодульОбъектаКлиент().ПолучитьОтложенноеДействие(КлючДействия);
			Если ОтложенноеОткрытие = Неопределено Тогда

				ПараметрыОткрытияФормы = Новый Структура();
				ПараметрыОткрытияФормы.Вставить("ИмяПроцедуры",				ИмяМетодаПродолжить);
				ПараметрыОткрытияФормы.Вставить("ИдентификаторДействия",	КлючДействия);
				ПараметрыОткрытияФормы.Вставить("Модуль",					ЭтаФорма);  
				ПараметрыОткрытияФормы.Вставить("Аргумент",					ПараметрыОткрытия);  
				
				ОтложенноеОткрытие = МодульОбъектаКлиент().НовыйОтложенноеДействие(ПараметрыОткрытияФормы);
				МодульОбъектаКлиент().ПодключитьОтложенноеДействие(ОтложенноеОткрытие);
				
			КонецЕсли;
			
			// Выйти из процедуры запуска, т.к. форма откроется после завершения текущей обработки кода
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ФормаИнициирована = Неопределено Тогда
		
		ФормаИнициирована = Ложь;
		
	КонецЕсли;

	ПараметрыФормы.Инициирована = ФормаИнициирована;
	ФормаЗакрытьУстановитьСтатусОтмена();
	//Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытииПроверитьСтатус(Отказ = Ложь)
	Перем ФормаИнициирована;
	
	Если	Не	ПараметрыФормы = Неопределено
		И		ПараметрыФормы.Свойство("Инициирована", ФормаИнициирована)
		И		ФормаИнициирована Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Отказ = Истина;
	ИсключениеОткрытие = МодульОбъектаКлиент().НовыйСбисИсключение(735, НазваниеКратко() + ".ПриОткрытииПроверитьСтатус",,,"Форма " + НазваниеКратко() + " не была инициирована.");
	МодульОбъектаКлиент().СообщитьСбисИсключение(ИсключениеОткрытие, Новый Структура("Отложенно", Истина));
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Закрыть();
		
	#КонецЕсли
	
КонецПроцедуры

