
//Область служит для подключения описания оповещения после закрытия формы для обычных и управляемых форм.
//Для работы обработчика после закрытия, на форме должен быть определен реквизит "ПараметрыФормы" с типом Струкутра и полем Результат.
//Для ОФ должен быть определен реквизит ОписаниеОповещенияОЗакрытии с произвольным типом
//Для использования необходимо подключить событие ПриЗакрытииВыполнитьОповещениеОЗакрытии как обработчик формы ПриЗакрытии,
//либо вызвать процедуру ПриЗакрытии из своего обработчика ПриЗакрытии

&НаКлиенте
Процедура ПриЗакрытииВыполнитьОповещениеОЗакрытии(ЗавершениеРаботы = Ложь) Экспорт
	
	ОбработчикЗавершения	= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПослеЗакрытияВыполнитьОповещениеОЗакрытии", ЭтаФорма);
	НовыйОтложенноеДействие = МодульОбъектаКлиент().НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения", ОбработчикЗавершения));
	МодульОбъектаКлиент().ПодключитьОтложенноеДействие(НовыйОтложенноеДействие);
	
КонецПроцедуры

// Процедура - после закрытия почистить форму
//
// Параметры:
//  Аргумент	 - Не требуется	 - 
//  ДопПараметры - Не требуется	 - 
//
&НаКлиенте
Процедура ПослеЗакрытияВыполнитьОповещениеОЗакрытии(Аргумент=Неопределено, ДопПараметры=Неопределено) Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		//Вызвать описание оповещения о закрытии вручную.
		Если	Не	ОписаниеОповещенияОЗакрытии = Неопределено
			И		ПараметрыФормы.РежимЗакрытия = "ОК" Тогда
			МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(ПараметрыФормы.Результат, ОписаниеОповещенияОЗакрытии);
		КонецЕсли;
	#КонецЕсли
	
	ПараметрыФормы				= Неопределено;
	ОписаниеОповещенияОЗакрытии	= Неопределено;
	
КонецПроцедуры

