
// Процедура - Показывает форму в отдельном окне, не зависимо от общего интерфейса
//
// Параметры:
//  ПараметрыОткрытия	 - Структура	 - Параметры для настройки и открытия формы
//
&НаКлиенте 
Процедура Показать(ПараметрыОткрытия = Неопределено, ДопПараметры = Неопределено) Экспорт

	Если Не ФормаУстановитьОбщее(ПараметрыОткрытия, ДопПараметры, "Показать") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	//Необходимо реализовать оббработчики СбисУстановитьФорму и СбисЗаблокироватьИнтерфейс на текущем модуле 
	Попытка
		
		СбисУстановитьФорму(ПараметрыОткрытия);
		ПараметрыФормы.Инициирована = Истина;
		БлокировкаИнтерфейсаВыполнена = СбисЗаблокироватьИнтерфейс(РежимОткрытияОкнаФормы.Независимый, ПараметрыОткрытия);
		
	Исключение
		
		ИсключениеПоказать = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), НазваниеКратко() + ".Показать", 776);
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИсключениеПоказать, Новый Структура("Отложенно", Истина));
		Возврат;
		
	КонецПопытки;

	Если Открыта() Тогда
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			ЭтаФорма.Обновить();
			
		#Иначе
			
			ОбновитьОтображениеДанных();
			
		#КонецЕсли
		
	Иначе	
	
		Открыть();
		
	КонецЕсли;

КонецПроцедуры

// Процедура - Показать поверх
//
// Параметры:
//  ПараметрыОткрытия	 - Структура	 - Параметры для настройки и открытия формы
//
&НаКлиенте 
Процедура ПоказатьПоверх(ПараметрыОткрытия = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если Не ФормаУстановитьОбщее(ПараметрыОткрытия, ДопПараметры, "ПоказатьПоверх") Тогда
		
		Возврат;
		
	КонецЕсли;
		
	//Необходимо реализовать оббработчики СбисУстановитьФорму и СбисЗаблокироватьИнтерфейс на текущем модуле 
	
	Попытка
		
		СбисУстановитьФорму(ПараметрыОткрытия); 
		ПараметрыФормы.Инициирована = Истина;
		БлокировкаИнтерфейсаВыполнена = СбисЗаблокироватьИнтерфейс(РежимОткрытияОкнаФормы.БлокироватьОкноВладельца, ПараметрыОткрытия);
		
	Исключение
		
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), Новый Структура("ИмяКоманды, Отложенно", НазваниеКратко() + ".ПоказатьПоверх", Истина));
		Возврат;
		
	КонецПопытки;
	
	Если Не БлокировкаИнтерфейсаВыполнена Тогда
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			Если Открыта() Тогда 
				
				ЭтаФорма.Обновить();
				
			Иначе

				ОткрытьМодально();//Для ОФ требуется самостоятельная реализация блокировки окна владельца. Пока можно открыть форму модально.
				
			КонецЕсли;
			
			Возврат;
			
		#КонецЕсли
		
		ИсключениеОткрытия = МодульОбъектаКлиент().НовыйСбисИсключение(776, НазваниеКратко() + ".ПоказатьПоверх",,,,"Не удалось заблокировать окно владельца!");
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИсключениеОткрытия, Новый Структура("ИмяКоманды, Отложенно", НазваниеКратко() + ".ПоказатьПоверх", Истина));
		Возврат;
		
	КонецЕсли;
	
	Если Открыта() Тогда
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			ЭтаФорма.Обновить();
			
		#Иначе
			
			ОбновитьОтображениеДанных();
			
		#КонецЕсли
		
	Иначе	
	
		Открыть();
		
	КонецЕсли;

КонецПроцедуры

