
&НаКлиенте
Процедура ОбработкаОповещенияОбработчик(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "SABY.КоннекшенSaby.ПеречитатьНастройки" Тогда
		
		Если Параметр.Свойство("Ошибка") Тогда
			
			МодульОбъектаКлиент().СбисСообщить(Параметр.Ошибка);
			Возврат;
			
		КонецЕсли;
		
		// Перечитан установленный класс. Надо обновить отображение по нему.
		ТекущийКлассНастроекНаФорме = Кэш.КэшНастроек.ВыбранныеНастройки;
		Если Не ТекущийКлассНастроекНаФорме = Параметр.Коннекшен Тогда
			
			Возврат;
			
		КонецЕсли;
		
		АктивныеИни = МодульОбъектаКлиент().КоннекшенSABY_Получить(ТекущийКлассНастроекНаФорме, "Ини");
		Кэш.Вставить("Ини", АктивныеИни);
	
		Если Открыта() Тогда
			
			СбисОбновитьОтображение();
			
		КонецЕсли;
		
		Возврат;

	КонецЕсли;

	ОбработкаОповещенияТиповойОбработчик(ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

