
&НаКлиенте
Процедура ОбработкаОповещенияОбработчик(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "SABY.КоннекшенSaby.ПеречитатьНастройки" Тогда
		
		Если Параметр.Свойство("Ошибка") Тогда
			
			МодульОбъектаКлиент().СбисСообщить(Параметр.Ошибка);
			Возврат;
			
		КонецЕсли;
		
		ПараметрыДляПОлучения	= Новый Структура("Кэш, Тип", Кэш, "Настройки");
		ВыбранныеНастройки		= МодульОбъектаКлиент().ПараметрSaby("ВыбранныеНастройки", ПараметрыДляПОлучения);

		// Перечитан установленный класс. Надо обновить отображение по нему.
		Если Не ВыбранныеНастройки = Параметр.Коннекшен Тогда
			
			Возврат;
			
		КонецЕсли;
		
		АктивныеИни = МодульОбъектаКлиент().КоннекшенSABY_Получить(ВыбранныеНастройки, "Ини");
		Кэш.Вставить("Ини", АктивныеИни);
	
		Если Открыта() Тогда
			
			СбисОбновитьОтображение();
			
		КонецЕсли;
		
		Возврат;

	КонецЕсли;

	ОбработкаОповещенияТиповойОбработчик(ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

