&НаКлиенте
Перем МестныйКэш;

#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

// функции для совместимости кода 
&НаКлиенте
Функция сбисПолучитьФорму(ИмяФормы)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Попытка
			ЭтотОбъект="";
		Исключение
		КонецПопытки;
		Возврат ПолучитьФорму("ВнешняяОбработка.СБИС.Форма."+ИмяФормы);
	КонецЕсли;
	Возврат ЭтотОбъект.ПолучитьФорму(ИмяФормы);
КонецФункции
&НаКлиенте
Функция сбисЭлементФормы(Форма,ИмяЭлемента)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Форма.Элементы.Найти(ИмяЭлемента);
	КонецЕсли;
	Возврат Форма.ЭлементыФормы.Найти(ИмяЭлемента);
КонецФункции
&НаКлиенте
Функция сбисПолучитьСтраницу(Элемент, ИмяСтраницы)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Элемент.ПодчиненныеЭлементы[ИмяСтраницы];
	КонецЕсли;
	Возврат Элемент.Страницы[ИмяСтраницы];
КонецФункции
//------------------------------------------------------
&НаКлиенте
Функция ОбновитьКонтент(Кэш, ДопПараметры = Неопределено) Экспорт 
	Перем СбисТекущийЭтап, Стороны;
	МестныйКэш = Кэш;
	ГлавноеОкно = Кэш.ГлавноеОкно;
	Фильтр = Кэш.ОбщиеФункции.ПолучитьФильтрСобытий(Кэш, Новый Структура("Тип, Направление, ДопПоля",
																		"ConsignmentNote",
																		"Исходящий",
																		"Стороны,ТекущиеЭтапы"));
	
	ПараметрыСписка = Новый Структура("Фильтр", Фильтр);
	СтруктураДанныхПолученная = МодульОбъектаКлиент().ПолучитьСписокДокументовСБИС(ПараметрыСписка);
	
	ГлавноеОкно.ОтметитьВсе = Ложь;
	СтруктураДляОбновленияФормы = Новый Структура("Таблица_РеестрСобытий");
	Если Не СтруктураДанныхПолученная.Свойство("Таблица_РеестрДокументов", СтруктураДляОбновленияФормы.Таблица_РеестрСобытий) Тогда
		СтруктураДляОбновленияФормы.Таблица_РеестрСобытий = Новый Массив;
	КонецЕсли;
	
	// Заказчик и Перевозчик
	Для Индекс = 0 По СтруктураДляОбновленияФормы.Таблица_РеестрСобытий.ВГраница() Цикл
		ОбрабатываемоеСобытие = СтруктураДляОбновленияФормы.Таблица_РеестрСобытий[Индекс];
		ОбрабатываемоеСобытие.СоставПакета[0].Значение.Свойство("Стороны", Стороны); 
		Если ЗначениеЗаполнено(Стороны) Тогда
			Если Стороны.Свойство("Заказчик") Тогда
				ОбрабатываемоеСобытие.Вставить("Заказчик",			Кэш.ОбщиеФункции.СбисНазваниеСтороны(Стороны.Заказчик));
			КонецЕсли;
			Если Стороны.Свойство("Перевозчик") Тогда
				ОбрабатываемоеСобытие.Вставить("Перевозчик",		Кэш.ОбщиеФункции.СбисНазваниеСтороны(Стороны.Перевозчик));
			КонецЕсли;
			Если Стороны.Свойство("Отправитель") Тогда
				ОбрабатываемоеСобытие.Вставить("НашаОрганизация",	Кэш.ОбщиеФункции.СбисНазваниеСтороны(Стороны.Отправитель));
			КонецЕсли;
			Если Стороны.Свойство("Получатель") Тогда
				ОбрабатываемоеСобытие.Вставить("Контрагент",		Кэш.ОбщиеФункции.СбисНазваниеСтороны(Стороны.Получатель));
			КонецЕсли;
		КонецЕсли;
		Если		ОбрабатываемоеСобытие.СоставПакета[0].Значение.Свойство("ТекущиеЭтапы", СбисТекущийЭтап) Тогда
			Если ТипЗнч(СбисТекущийЭтап) = Тип("Массив")
				И	СбисТекущийЭтап.Количество() Тогда
				
				ОбрабатываемоеСобытие.Вставить("ТекущийЭтап", СбисТекущийЭтап[0].Наименование);
			ИначеЕсли ТипЗнч(СбисТекущийЭтап) = Тип("Структура")
				И СбисТекущийЭтап.Свойство("Наименование", СбисТекущийЭтап) Тогда 
				
				ОбрабатываемоеСобытие.Вставить("ТекущийЭтап", СбисТекущийЭтап);
			Иначе
				// Пришло что-то новое, этап не ставим, но и не падаем
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Кэш.ОбщиеФункции.ОбновитьПанельНавигации(Кэш);
	Контент = сбисЭлементФормы(ГлавноеОкно, "Контент");
	Контент.ТекущаяСтраница = сбисПолучитьСтраницу(Контент, "РеестрСобытий");	
	Кэш.ТаблДок = сбисЭлементФормы(ГлавноеОкно,"Таблица_РеестрСобытий");
	ГлавноеОкно.СписокДопОперацийРеестра.Очистить();
	Возврат СтруктураДляОбновленияФормы;
КонецФункции

&НаКлиенте	
Процедура НастроитьКолонки(Кэш) Экспорт 
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрСобытий.Вложения").Видимость = Ложь;
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрСобытий.НашаОрганизация").ТекстШапки = "Отправитель";
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрСобытий.Контрагент").ТекстШапки = "Получатель";
	#Иначе
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрСобытий.НашаОрганизация").Заголовок = "Отправитель";
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрСобытий.Контрагент").Заголовок = "Получатель";
	#КонецЕсли
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрСобытий.Комментарий").Видимость = Ложь;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрСобытий.Ответственный").Видимость = Ложь;
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрСобытий.Расхождение").Видимость = Ложь;	 
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрСобытий.СтатусВГосСистеме").Видимость = Ложь;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрСобытий.Сумма").Видимость = Ложь;
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("Перевозчик");
	МассивРеквизитов.Добавить("Заказчик");
	
	Кэш.ГлавноеОкно.НастроитьКолонкиФормы(Новый Структура("ИмяТаблицы, СтруктураПолей", "Таблица_РеестрСобытий", Новый Структура("КолонкиДобавить", МассивРеквизитов))); 
	
КонецПроцедуры

&НаКлиенте
Процедура НавигацияУстановитьПанель(Кэш) Экспорт
	ГлавноеОкно = Кэш.ГлавноеОкно;
	сбисЭлементФормы(ГлавноеОкно,"ПанельНавигации").Видимость=Истина;
	сбисЭлементФормы(ГлавноеОкно,"ЗаписейНаСтранице1С").Видимость=Ложь;
	сбисЭлементФормы(ГлавноеОкно,"ЗаписейНаСтранице").Видимость=Истина;
КонецПроцедуры	

&НаКлиенте
Функция ПолучитьСтруктуруТаблицыСобытий(Кэш) Экспорт//При переходе в раздел задач, установить таблицу событий
	
	КолонкиИзменить	= Новый	Массив;
	Если  ТипЗнч(Кэш.ГлавноеОкно) = Тип("УправляемаяФорма") Тогда
		ДобавитьКИмениКолонки = "Таблица_РеестрСобытий";
		ПараметрИзменить = "Заголовок";
		ПутьККолонкам	= "Элементы.Таблица_РеестрСобытий.ПодчиненныеЭлементы";
	Иначе
		ДобавитьКИмениКолонки = "";
		ПараметрИзменить = "ТекстШапки";
		ПутьККолонкам	= "ЭлементыФормы.Таблица_РеестрСобытий.Колонки";
	КонецЕсли;
	КолонкиИзменить.Добавить(Новый Структура("ПолноеИмяКолонки, ИмяКолонки, ПараметрыИзменить", ДобавитьКИмениКолонки + "Заказчик", "Контрагент", Новый Структура(ПараметрИзменить, "Заказчик")));
	КолонкиИзменить.Добавить(Новый Структура("ПолноеИмяКолонки, ИмяКолонки, ПараметрыИзменить", ДобавитьКИмениКолонки + "Перевозчик", "НашаОрганизация", Новый Структура(ПараметрИзменить, "Перевозчик")));
	
	СтруктураОбновления	= Новый	Структура();
	СтруктураОбновления.Вставить("ИмяТаблицы",		"Таблица_РеестрСобытий");
	СтруктураОбновления.Вставить("СтруктураПолей",	Новый	Структура("КолонкиИзменить", КолонкиИзменить));
	СтруктураОбновления.Вставить("ПутьККолонкам",	ПутьККолонкам);
	
	Возврат	СтруктураОбновления;

КонецФункции

// Функция заполняет данные о прохождении документа	
&НаКлиенте
Функция ЗаполнитьПрохождение(СоставПакета) Экспорт
	Возврат МестныйКэш.ОбщиеФункции.ЗаполнитьПрохождение(МестныйКэш, СоставПакета, Новый Структура);
КонецФункции

&НаКлиенте
Процедура НаСменуРаздела(Кэш) Экспорт 

	ПодготовитьФильтрРаздела(Кэш);
	
	ПанельМассовыхОпераций = сбисЭлементФормы(Кэш.ГлавноеОкно,"ПанельМассовыхОпераций");
	ПанельМассовыхОпераций.ТекущаяСтраница = Кэш.ГлавноеОкно.сбисПолучитьСтраницу(ПанельМассовыхОпераций,"Полученные_ЭТрН");
КонецПроцедуры

// Процедура для заполнения списков выбора в фильтре. Восстанавливает последние установки фильтра раздела
// 
// Параметры:
//  Кэш  - Структура - Кэш обработки
//
&НаКлиенте
Процедура ПодготовитьФильтрРаздела(Кэш) Экспорт

	СписокСостояний = Новый СписокЗначений();
	СписокСостояний.Добавить("Все документы");
	СписокСостояний.Добавить("Внутренняя обработка");
	СписокСостояний.Добавить("Недоставленные");
	СписокСостояний.Добавить("Не получен ответ");
	СписокСостояний.Добавить("Утвержденные");
	СписокСостояний.Добавить("Отклоненные");
	СписокСостояний.Добавить("С ошибками");
	СписокСостояний.Добавить("Удаленные");
	СписокСостояний.Добавить("Черновики");
			
	Кэш.ГлавноеОкно.СписокСостояний = СписокСостояний;
	
	//+ Установка списка значений записей на странице 
	СписокЗаписейНаСтранице = Новый Массив;
	СписокЗаписейНаСтранице.Добавить(25);
	СписокЗаписейНаСтранице.Добавить(50);
	СписокЗаписейНаСтранице.Добавить(100);
	СписокЗаписейНаСтранице.Добавить(200);
	СписокЗаписейНаСтранице.Добавить(500);
	
	ОписаниеПараметраИзменить = Новый ФиксированнаяСтруктура("Форма, Реквизит", Кэш.ГлавноеОкно, "ЗаписейНаСтранице");
	ПараметрыИзменить = Новый Структура("СписокВыбора", СписокЗаписейНаСтранице);
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеПараметраИзменить, ПараметрыИзменить);
	
	// На ОФ почему-то нужно переопределять количество записей после установки списка, чтобы обновилось отображение на форме
	Кэш.ГлавноеОкно.ЗаписейНаСтранице = Кэш.ГлавноеОкно.ЗаписейНаСтранице;
	//-
	
	Кэш.ГлавноеОкно.ФильтрОбновитьПанель()
	
КонецПроцедуры // ПодготовитьФильтрРаздела()
