
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

// функции для совместимости кода 
&НаКлиенте
Функция сбисЭлементФормы(Форма,ИмяЭлемента)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Форма.Элементы.Найти(ИмяЭлемента);
	КонецЕсли;
	Возврат Форма.ЭлементыФормы.Найти(ИмяЭлемента);
КонецФункции

&НаКлиенте
Функция сбисПолучитьСтраницу(Элемент, ИмяСтраницы)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Элемент.ПодчиненныеЭлементы[ИмяСтраницы];
	КонецЕсли;
	Возврат Элемент.Страницы[ИмяСтраницы];
КонецФункции
//------------------------------------------------------
&НаКлиенте
Функция ОбновитьКонтент(Кэш, ДопПараметры = Неопределено) Экспорт
// функция обновляет контент для раздела Отправленные	
	СтруктураДляОбновленияФормы = МодульОбъектаКлиент().ПолучитьСписокДокументовПоСобытиямСБИС(Новый Структура("ТипРеестра", "Ответы контрагента"));
	Кэш.ОбщиеФункции.ОбновитьПанельНавигации(Кэш);
	ГлавноеОкно = Кэш.ГлавноеОкно;
	Контент = сбисЭлементФормы(ГлавноеОкно, "Контент");
	Контент.ТекущаяСтраница = сбисПолучитьСтраницу(Контент, "РеестрСобытий");	
	Кэш.ТаблДок = сбисЭлементФормы(ГлавноеОкно,"Таблица_РеестрСобытий");
	Кэш.ГлавноеОкно.СписокДопОперацийРеестра.Очистить();
	Возврат СтруктураДляОбновленияФормы;
КонецФункции

&НаКлиенте
Процедура НаСменуРаздела(Кэш) Экспорт
// Процедура обновляет панель массовых операций, панель фильтра, контекстное меню при смене раздела		
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("НаСменуРаздела","Раздел_Отправленные_Отправленные","", Кэш);
	фрм.НаСменуРаздела(Кэш);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьКолонки(Кэш) Экспорт 
	Если НЕ Кэш.Текущий.ОписаниеРаздела.Номер = Кэш.Текущий.ПредыдущийРаздел.ОписаниеРаздела.Номер Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрСобытий.Сумма").Видимость = Ложь;	
	КонецЕсли;
КонецПроцедуры

// Процедура устанавливает панель навигации на 1ую страницу	
&НаКлиенте
Процедура НавигацияУстановитьПанель(Кэш) Экспорт
	
	ГлавноеОкно = Кэш.ГлавноеОкно;
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "ПанельНавигации").Видимость			= Истина;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "ЗаписейНаСтранице1С").Видимость		= Ложь;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "ЗаписейНаСтранице").Видимость			= Истина;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "КоманднаяПанельНавигация").Видимость	= Истина;
	
КонецПроцедуры	

&НаКлиенте
Функция ПодготовитьСтруктуруДокумента(СтрокаСпискаДокументов, Кэш) Экспорт
// функция формирует структуру данных по пакету электронных документов, необходимую для его предварительного просмотра		
	Возврат Кэш.ОбщиеФункции.ПодготовитьСтруктуруДокументаСбис(СтрокаСпискаДокументов, Кэш);	
КонецФункции
