
// Функция для получения списка всех сопоставлений по данным контрагента.
//
// Параметры:
//  params  - Структура - Параметры метода: данные контрагента, фильтр и ключи для постраничной навигации
//  ДопПараметры  - Структура - Набор полей, работа с которыми может расширить результат работы функции.
//
// Возвращаемое значение:
//   Массив структур   - Результат вызова.
//	 Структура - ошибка	
&НаКлиенте
Функция ContractorNomenclatureCollation_List(Кэш, ПараметрыМетода, ДопПараметры, Отказ=Ложь) Экспорт  
	
	ПараметрыВызова = Новый Массив;
	ПараметрыВызова.Добавить(ПараметрыМетода.Contractor);
	ПараметрыВызова.Добавить(ПараметрыМетода.Filter);
	ПараметрыВызова.Добавить(ПараметрыМетода.Navigation);
		
	Возврат СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, "ContractorNomenclatureCollation.List", ПараметрыВызова, ДопПараметры, Отказ);

КонецФункции

// Функция для поиска сопоставлений по данным 1C.
//
// Параметры:
//  params  - Структура - Параметры метода: данные о контрагенте и список строк номенклатуры для обогащения
//  ДопПараметры  - Структура - Набор полей, работа с которыми может расширить результат работы функции.
//
// Возвращаемое значение:
//   Массив структур   - Результат вызова.
//	 Структура - ошибка	
&НаКлиенте
Функция ContractorNomenclatureCollation_SearchByOwnerData(Кэш, ПараметрыМетода, ДопПараметры, Отказ=Ложь) Экспорт  
	
	ПараметрыВызова = Новый Массив;
	ПараметрыВызова.Добавить(ПараметрыМетода.Contractor);
	ПараметрыВызова.Добавить(ПараметрыМетода.Data);
		
	Возврат СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, "ContractorNomenclatureCollation.SearchByOwnerData", ПараметрыВызова, ДопПараметры, Отказ);

КонецФункции

// Функция для поиска сопоставлений по данным контрагента.
//
// Параметры:
//  params  - Структура - Параметры метода: данные о контрагенте и список строк номенклатуры для обогащения
//  ДопПараметры  - Структура - Набор полей, работа с которыми может расширить результат работы функции.
//
// Возвращаемое значение:
//   Массив структур   - Результат вызова.
//	 Структура - ошибка	
&НаКлиенте
Функция ContractorNomenclatureCollation_SearchByContractorData(Кэш, ПараметрыМетода, ДопПараметры, Отказ=Ложь) Экспорт  
	
	ПараметрыВызова = Новый Массив;
	ПараметрыВызова.Добавить(ПараметрыМетода.Contractor);
	ПараметрыВызова.Добавить(ПараметрыМетода.Data);
		
	Возврат СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, "ContractorNomenclatureCollation.SearchByContractorData", ПараметрыВызова, ДопПараметры, Отказ);

КонецФункции

// Функция для для записи / обновления сопоставлений.
//
// Параметры:
//  params  - Структура - Параметры метода: данные о контрагенте и список строк номенклатуры для записи
//  ДопПараметры  - Структура - Набор полей, работа с которыми может расширить результат работы функции.
//
// Возвращаемое значение:
//	 Структура - список ошибок возникшних при записи
&НаКлиенте
Функция ContractorNomenclatureCollation_MassUpdate(Кэш, ПараметрыМетода, ДопПараметры, Отказ=Ложь) Экспорт  
	
	ПараметрыВызова = Новый Массив;
	ПараметрыВызова.Добавить(ПараметрыМетода.Contractor);
	ПараметрыВызова.Добавить(ПараметрыМетода.Data);
		
	Возврат СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, "ContractorNomenclatureCollation.MassUpdate", ПараметрыВызова, ДопПараметры, Отказ);

КонецФункции

// Функция для удаления сопоставлений.
//
// Параметры:
//  params  - Структура - Параметры метода: данные о контрагенте и список строк номенклатуры для удаления
//  ДопПараметры  - Структура - Набор полей, работа с которыми может расширить результат работы функции.
//
// Возвращаемое значение:
//	 Структура - список ошибок возникшних при записи
&НаКлиенте
Функция ContractorNomenclatureCollation_MassDelete(Кэш, ПараметрыМетода, ДопПараметры, Отказ=Ложь) Экспорт  
	
	ПараметрыВызова = Новый Массив;
	ПараметрыВызова.Добавить(ПараметрыМетода.Contractor);
	ПараметрыВызова.Добавить(ПараметрыМетода.Data);
		
	Возврат СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, "ContractorNomenclatureCollation.MassDelete", ПараметрыВызова, ДопПараметры, Отказ);

КонецФункции

