
&НаКлиенте
Процедура ОбновитьСписокДоступныхДоменов()
	
	РазобранныйАдрес = СбисПолучитьСтруктуруРазобраногоАдреса();
	
	Домены = МодульОбъектаКлиент().СбисПроверитьДоступностьЭлементовАдресаСервера(РазобранныйАдрес);
	
	ЭлементDomain = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Domain");
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ЭлементDomain, Новый Структура("СписокВыбора", Домены.СтруктураДоменов));
	
КонецПроцедуры

&НаКлиенте
Функция ЭлементДоменСтендКонтурПоСписку(ЭлементЗначение, СписокВариантов)
	
	Если Не СписокВариантов.Количество() Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Если	ЭлементЗначение = ""
		Или	СписокВариантов.НайтиПоЗначению(ЭлементЗначение) = Неопределено Тогда
		
		Возврат СписокВариантов[0].Значение;
		
	КонецЕсли;
	
	Возврат ЭлементЗначение;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСписокДоступныхСтендов()
	
	РазобранныйАдрес = СбисПолучитьСтруктуруРазобраногоАдреса();
	
	СтруктураСтендов = МодульОбъектаКлиент().СбисПолучитьСписокДоступныхСтендов();	
	ЭлементContour = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Contour");
	ЭлементНадписьContour = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "НадписьContour");
	Если	testContour 
		И	ЗначениеЗаполнено(СтруктураСтендов) Тогда
		
		ЭлементContour.Видимость = Истина;
		Если НЕ ЭлементНадписьContour = Неопределено Тогда
			ЭлементНадписьContour.Видимость = Истина;
		КонецЕсли;
		ЭлементContour.СписокВыбора.Очистить();
		Для Каждого Стенд Из СтруктураСтендов Цикл
			ЭлементContour.СписокВыбора.Добавить(СтрЗаменить(Стенд.Ключ, "_", "-"), Стенд.Значение);	
		КонецЦикла;
		
	Иначе
		Contour = "online";
		ЭлементContour.Видимость = Ложь;
		Если НЕ ЭлементНадписьContour = Неопределено Тогда
			ЭлементНадписьContour.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если	Contour = ""
		И	ЭлементContour.СписокВыбора.Количество() Тогда
		
		Contour = ЭлементContour.СписокВыбора[0].Значение;
		
	КонецЕсли;
		
КонецПроцедуры  

&НаКлиенте
Процедура СбисДополнитьРеквизитыСтран()
		
	СтруктураСтран = МодульОбъектаКлиент().СбисПолучитьСписокДоступныхСтран();
	ЭлементContry = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Country");
	ЭлементContry.СписокВыбора.Очистить();
	Для Каждого Страна Из СтруктураСтран Цикл
		
		ЭлементContry.СписокВыбора.Добавить(Страна.Ключ, Страна.Значение);
		
	КонецЦикла;
	
		
КонецПроцедуры

