
//DynamicDirective

// Функция - конструктор прикладного объекта SABY
//
// Параметры:
//  ТипДляНовогоОбъекта	 - Строка	 - тип наследника от базового объекта
// 
// Возвращаемое значение:
//  ПрикладнойОбъектSABY - Структура с предопределенными свойствами
//
Функция НовыйОбъектSABY(ВходящиеПараметры = Неопределено, ДопПараметры = Неопределено) Экспорт 
	Перем ТипНовогоОбъекта, НаборСвойствОбъекта;
	
	ОбъектSABY = Новый Структура(яОбъектSABY_СтатичныйМетод_Свойства(), "объектsaby", Новый УникальныйИдентификатор);
	
	Если ОбъектSABY_ЭтоТип(ВходящиеПараметры, ОбъектSABY._тип) Тогда
		
		// Создание от другого объекта
		НаборСвойствОбъекта	= ВходящиеПараметры;
		ОбъектSABY._тип		= ВходящиеПараметры._тип;
	
	ИначеЕсли ТипЗнч(ВходящиеПараметры) = Тип("ФиксированнаяСтруктура") Тогда
		
		ВходящиеПараметры.Свойство("Тип", 		ТипНовогоОбъекта);
		ВходящиеПараметры.Свойство("Свойства",	НаборСвойствОбъекта);
		
	Иначе
		
		ТипНовогоОбъекта = ВходящиеПараметры;
		
	КонецЕсли;
	
	Если Не ТипНовогоОбъекта = Неопределено Тогда
		
		ОбъектSABY_Установить(ОбъектSABY, "Тип", ТипНовогоОбъекта);
		
	КонецЕсли;

	Если Не НаборСвойствОбъекта = Неопределено Тогда
		
		Если ТипЗнч(НаборСвойствОбъекта) = Тип("Строка") Тогда
			
			НаборСвойствОбъекта = СтрЗаменить(НаборСвойствОбъекта, ",", Символы.ПС);
			
		КонецЕсли;
		
		Если ТипЗнч(НаборСвойствОбъекта) = Тип("Строка") Тогда
			
			Для СчетчикСтрокСвойств = 1 ПО СтрЧислоСтрок(НаборСвойствОбъекта) Цикл
				
				Свойство = СтрПолучитьСтроку(НаборСвойствОбъекта, СчетчикСтрокСвойств);
				Если Лев(Свойство, 1) = "_" Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				ОбъектSABY.Вставить(Свойство);
				
			КонецЦикла;
			
		Иначе
			
			Для Каждого Свойство Из НаборСвойствОбъекта Цикл
				
				Если Лев(Свойство.Ключ, 1) = "_" Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				ОбъектSABY.Вставить(Свойство.Ключ);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОбъектSABY;
	
КонецФункции

#Область include_core2_vo2_МодульОбъекта_КлиентСервер_Классы_БазовыйОбъект_АПИ
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_КлиентСервер_Классы_БазовыйОбъект_ПриватныеМетоды
#КонецОбласти

