
//DynamicDirective

// Функция - создает прикладной объект - интеграция
//
// Параметры:
//  ВходящиеПараметры	 - Структура	 - входные параметры
//  ДопПараметры		 - Структура	 - расширение
// 
// Возвращаемое значение:
//  ВложениеСБИС - Структура с параметрами и данными вложения
//
Функция НовыйИнтеграцияSABY(ВходящиеПараметры = Неопределено, ДопПараметры = Неопределено) Экспорт 
	
	ИнтеграцияSABY	= НовыйПрикладнойОбъектSABY("ИнтеграцияSABY");

	//Статус				- возможные значнения: "Новый"(по-умолч), "Активен"(актуален), "Удален"(был удалён в процессе работы с БЛ)
	//ТипНастроек			- возможные значнения: "Стандартные"(по-умолч), "Пользовательские", "Шаблон", "Неизвестно"("Пользовательские"/"Шаблон", при чтении)
	//Автообновление		- возможные значнения: True/False - признак автооподбора config под текущую версию
	//Изменен				- возможные значнения: True/False - признак того, менялся ли класс из интерфейса
	//Инициирован			- возможные значнения: True/False - признак того, инитился ли класс по его слепку с БЛ
	//ДатаИзмененияНастроек - Дата. Последнее изменение настроек
	//Шаблон				- УИД шаблона коннекшена, если есть.
	//Пользователь			- ИД пользователя, которому принадлежит коннекшен.
	//ВерсияКонфиг			- Номер версии конфига, из которого был создан коннешен. При отключенном автообновлении берётся версия отсюда.
	ПараметрыРаботыIntegrationConnection = Новый Структура	
	(	"Автообновление,	Изменен, ИнициированаШапка, ИнициированыДанные, ДатаИзмененияНастроек, Пользователь, ВерсияКонфиг, Демо",
		Истина,		 		Ложь,	 Ложь,				Ложь,			  	ТекущаяДата());
	ПараметрыРаботыIntegrationConnection.Вставить("ПроверитьИниПриСохранении", Ложь);
	//Определяет работу с настройкой:
	//Отправлять- если нет необходимости записывать на сервис, то флаг переключить в ложь. Тогда изменения будут кэшироваться в выбранном подключении
	//Обновить	- флаг изменения в параметрах. Если переключен в истину, то будет проведена отправка на сервис.
	ПараметрыРаботыIntegrationConnection.Вставить("СбисПараметры",	Новый Структура("Обновить, Отправлять", Ложь, Истина));
	ПараметрыРаботыIntegrationConnection.Вставить("СбисМеню",		Новый Структура("Обновить, Отправлять", Ложь, Истина));
	//Список ини, которые требуется отправить на БЛ при записи.
	ПараметрыРаботыIntegrationConnection.Вставить("СбисИни",			Новый Структура("СписокОтправить", Новый Массив));
	
	ПараметрыКонфигурации = Новый Структура("service, subsystem, version", "-");

	ИнтеграцияSABY.Вставить("Название",					"");
	ИнтеграцияSABY.Вставить("ПараметрыРаботы",			ПараметрыРаботыIntegrationConnection);
	ИнтеграцияSABY.Вставить("ПараметрыКонфигурации",	ПараметрыКонфигурации);
	
	ЧтениеПоТребованию			= ПараметрSABY("ЧтениеНастроекПоТребованию");
	АвтообновлениеИни			= ПараметрSABY("НастройкиАвтообновление");
	ПрефиксИни					= "-";
	ЕстьДоработки				= Ложь;
	ИдентификаторПодключения	= "";

	Если ОбъектSABY_ЭтоТип(ВходящиеПараметры, ИнтеграцияSABY) Тогда
		
		// Основание - другой объект ИнтеграцияSaby
		ЗаполнитьЗначенияСвойств(ИнтеграцияSABY.ПараметрыРаботы, ВходящиеПараметры.ПараметрыРаботы);
		ИнтеграцияSABY.ПараметрыКонфигурации = СоздатьКопиюОбъекта(ВходящиеПараметры.ПараметрыКонфигурации);
		
		ЧтениеПоТребованию			= ИнтеграцияSABY_Получить(ВходящиеПараметры, "ЧтениеПоТребованию");
		АвтообновлениеИни			= ИнтеграцияSABY_Получить(ВходящиеПараметры, "Автообновление");
		ПрефиксИни					= ИнтеграцияSABY_Получить(ВходящиеПараметры, "ПрефиксНастроек");
		ЕстьДоработки				= ИнтеграцияSABY_Получить(ВходящиеПараметры, "ЕстьДоработки");
		ИдентификаторПодключения	= ИнтеграцияSABY_Получить(ВходящиеПараметры, "Идентификатор");

	Иначе
		
		КэшНастроек = ГлобальныйКэш_Получить("КэшНастроек");
		ЗаполнитьЗначенияСвойств(ПараметрыКонфигурации, КэшНастроек.ПараметрыКонфигурации);
		Если ТипЗнч(ВходящиеПараметры) = Тип("Структура") Тогда
		
			Если ВходящиеПараметры.Свойство("Идентификатор") Тогда
				
				ИдентификаторПодключения = ВходящиеПараметры.Идентификатор;
				
			КонецЕсли;
			
		ИначеЕсли	ТипЗнч(ВходящиеПараметры) = Тип("Строка")
			Или		ТипЗнч(ВходящиеПараметры) = Тип("УникальныйИдентификатор") Тогда
			
			ИдентификаторПодключения = ВходящиеПараметры;

		КонецЕсли;
		
	КонецЕсли;

	ПрикладнойОбъектSABY_Установить(ИнтеграцияSABY, "ЕстьДоработки",		ЕстьДоработки);
	ПрикладнойОбъектSABY_Установить(ИнтеграцияSABY, "ЧтениеПоТребованию",	ЧтениеПоТребованию);
	ПрикладнойОбъектSABY_Установить(ИнтеграцияSABY, "ПрефиксНастроек",		ПрефиксИни);
	
	ИнтеграцияSABY_Установить(ИнтеграцияSABY, "Идентификатор",		ИдентификаторПодключения);
	ИнтеграцияSABY_Установить(ИнтеграцияSABY, "Автообновление",		АвтообновлениеИни);
	
	Возврат ИнтеграцияSABY;
	
КонецФункции

//DynamicDirective

// Функция - получить значение по ключу
//
// Параметры:
//  ИнтеграцияSABY			 - ИнтеграцияSABY	 - экземпляр, от которого надо получить значение
//  КлючПараметраПолучить	 - Строка			 - что хотим получить
//  ДопПараметры			 - Структура		 - Расширение
// 
// Возвращаемое значение:
//  Произвольный - Найденное значение. Неопределено, если ничего
//
Функция ИнтеграцияSABY_Получить(ИнтеграцияSABY, КлючПараметраПолучить, ДопПараметры = Неопределено) Экспорт
	
	Если	КлючПараметраПолучить = "Ини"
		Или	КлючПараметраПолучить = "Меню" 
		Или	КлючПараметраПолучить = "ПараметрыSaby" Тогда
		
		ДанныеИни = ПрикладнойОбъектSABY_Получить(ИнтеграцияSABY, КлючПараметраПолучить, "Данные");
		Если ДанныеИни = Неопределено Тогда
			
			ДанныеИни = Новый Структура;
			ПрикладнойОбъектSABY_Установить(ИнтеграцияSABY, КлючПараметраПолучить, ДанныеИни, "Данные");
			
		КонецЕсли; 
		Возврат ДанныеИни;

	ИначеЕсли  КлючПараметраПолучить = "ОписаниеИни" Тогда
		
		ОписаниеИни = ПрикладнойОбъектSABY_Получить(ИнтеграцияSABY, КлючПараметраПолучить, "Данные");
		
		Если ОписаниеИни = Неопределено Тогда
			
			// Собрать информацию об установленных ини
			ОписаниеИниФайлов	= ПараметрSABY("Настройки").ОписаниеИниФайлов(ИнтеграцияSABY);
			МассивИниФайлов		= ОписаниеИниФайлов.МассивУстановленныхИниФайлов;
			ПрефиксНастроек		= ОписаниеИниФайлов.ПрефиксНастроек;
			
		 //   Если Не МассивИниФайлов.Количество() Тогда
		 //   	
		 //   	ОшибкаИни = НовыйСбисИсключение(, "ФайлыНастроекКаталог.ИнтеграцияSABY.Прочитать", 747200,, "Отсутствуют установленные файлы настроек");
		 //   	ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаИни);
		 //
		 //   КонецЕсли;
		 //   
			ИнтеграцияSABY_Установить(ИнтеграцияSABY, "ОписаниеИни",		МассивИниФайлов);
			ИнтеграцияSABY_Установить(ИнтеграцияSABY, "ПрефиксНастроек",	ПрефиксНастроек);
			
			ОписаниеИни = ПрикладнойОбъектSABY_Получить(ИнтеграцияSABY, КлючПараметраПолучить, "Данные");
			
		КонецЕсли;
	
		Возврат ОписаниеИни;
		
	ИначеЕсли КлючПараметраПолучить = "ОтключеныДоработки" Тогда
		
		Возврат ПрикладнойОбъектSABY_Получить(ИнтеграцияSABY, КлючПараметраПолучить) = Истина;

	ИначеЕсли	КлючПараметраПолучить = "Статус"
			Или	КлючПараметраПолучить = "Автообновление"
			Или	КлючПараметраПолучить = "Изменен"
			Или	КлючПараметраПолучить = "ДатаИзмененияНастроек"
			Или	КлючПараметраПолучить = "ИнициированыДанные" Тогда
		
		Возврат ИнтеграцияSABY.ПараметрыРаботы[КлючПараметраПолучить];

	КонецЕсли;
	
	Возврат ПрикладнойОбъектSABY_Получить(ИнтеграцияSABY, КлючПараметраПолучить, ДопПараметры);
	
КонецФункции

//DynamicDirective

// Функция - установить значение по ключу
//
// Параметры:
//  ИнтеграцияSABY				 - ИнтеграцияSABY	 - экземпляр, от которого надо получить значение
//  КлючПараметраУстановить		 - Строка			 - что хотим установить
//	ЗначениеПараметраУстановить	 - Произвольный		 - значение что хотим установить
//  ДопПараметры				 - Структура		 - Расширение
// 
// Возвращаемое значение:
//  Произвольный - Найденное значение. Неопределено, если ничего
//
Процедура ИнтеграцияSABY_Установить(ИнтеграцияSABY, КлючПараметраУстановить, ЗначениеПараметраУстановить, ДопПараметры = Неопределено) Экспорт
	Перем ЗначениеСвойстваПроверка;
	
	Если КлючПараметраУстановить = "ОтключеныДоработки" Тогда
		
		// Чистим данные, где было прочитано с или без проклейки дельты для перечитывания
		ОписаниеИни = ИнтеграцияSABY_Получить(ИнтеграцияSABY, "ОписаниеИни", "Данные");
		ДанныеИни	= ИнтеграцияSABY_Получить(ИнтеграцияSABY, "Ини");
		Если Не ОписаниеИни = Неопределено Тогда
			
			Для Каждого ИниКастом Из ОписаниеИни.Кастомные Цикл
				
				ДанныеИни.Вставить(ИниКастом, Неопределено);
				
			КонецЦикла;
			
		КонецЕсли;
		ИнтеграцияSABY_Установить(ИнтеграцияSABY, "Изменен", Истина);
		
	ИначеЕсли КлючПараметраУстановить = "ОписаниеИни" Тогда
		
		ОписаниеИниФайлов = Новый Структура("Установлены", ЗначениеПараметраУстановить);
		ОписаниеИниФайлов.Вставить("ПолноеОписание",Новый Структура);
		ОписаниеИниФайлов.Вставить("Кастомные",		Новый Массив);
		ОписаниеИниФайлов.Вставить("Типовые",		Новый Массив);
		
		Для Каждого УстановленныйИни Из ЗначениеПараметраУстановить Цикл 
			
			Если УстановленныйИни.Пользовательская Тогда
				
				ОписаниеИниФайлов.Кастомные.Добавить(УстановленныйИни.Ини_ИмяИни);
				
			КонецЕсли;
			
			Если УстановленныйИни.Стандартная Тогда
				
				ОписаниеИниФайлов.Типовые.Добавить(УстановленныйИни.Ини_ИмяИни);
				
			КонецЕсли;
			
			ОписаниеИниФайлов.ПолноеОписание.Вставить(УстановленныйИни.Ини_ИмяИни, УстановленныйИни);

		КонецЦикла;

		ПрикладнойОбъектSABY_Установить(ИнтеграцияSABY, "ОписаниеИни",		ОписаниеИниФайлов, "Данные");
		ПрикладнойОбъектSABY_Установить(ИнтеграцияSABY, "ЕстьДоработки",	Булево(ОписаниеИниФайлов.Кастомные.Количество()));
		
		Возврат
		
	ИначеЕсли КлючПараметраУстановить = "Ини" Тогда
		
		ДанныеИни = ИнтеграцияSABY_Получить(ИнтеграцияSABY, КлючПараметраУстановить);
		Если ТипЗнч(ДопПараметры) = Тип("Строка") Тогда
			
			ДанныеИни.Вставить(ДопПараметры, ЗначениеПараметраУстановить);
			
		Иначе
			Для Каждого КлючИЗначение Из ЗначениеПараметраУстановить Цикл
				
				ДанныеИни.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
				
			КонецЦикла;
		КонецЕсли;
		Возврат;
		
	ИначеЕсли КлючПараметраУстановить = "ПараметрыКонфигурации" Тогда
		
		ТекущиеПараметры = ИнтеграцияSABY_Получить(ИнтеграцияSABY, "ПараметрыКонфигурации");
		ЗаполнитьЗначенияСвойств(ТекущиеПараметры, ЗначениеПараметраУстановить);
		Если ТипЗнч(ТекущиеПараметры.version) = Тип("Число") Тогда
			
			ТекущиеПараметры.version = ПараметрSABY("ФункцииДокументов").СериализоватьВерсию(ТекущиеПараметры.version, "ЧислоВСтроку");
			
		КонецЕсли;
		ПараметрыДляПрефикса = Новый Структура("subsystem, version");
		ЗаполнитьЗначенияСвойств(ПараметрыДляПрефикса, ТекущиеПараметры);
		
		ИнтеграцияSABY_Установить(ИнтеграцияSABY, "ПрефиксНастроек", ПараметрSABY("МодульУправленияНастройками").СформироватьПрефиксСистемыКлиент(ПараметрыДляПрефикса));
		
		Возврат;
		
	ИначеЕсли КлючПараметраУстановить = "ПараметрыSaby" Тогда
		
		// Раз попали в обновление параметров saby в типе интеграции, то считаем что мы на шаблоне.
		КэшНастроек					 = ГлобальныйКэш_Получить("КэшНастроек");
		ПараметрыНаИнтеграции		 = КэшНастроек.СписокПараметровХранящихсяНаШаблоне;
		ПараметрыИНтеграцииДанные	 = ИнтеграцияSABY_Получить(ИнтеграцияSABY, "ПараметрыSaby");
		Для Каждого Элемент Из ЗначениеПараметраУстановить Цикл
			
			// Параметры для шаблона добавляем только на шаблон
			Если ПараметрыНаИнтеграции.Найти(НРег(Элемент.Ключ)) = Неопределено Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Если	Не ПараметрыИНтеграцииДанные.Свойство(Элемент.Ключ, ЗначениеСвойстваПроверка)
				Или	Не ЗначениеСвойстваПроверка = Элемент.Значение Тогда
				
				ПараметрыИНтеграцииДанные.Вставить(Элемент.Ключ, ЗначениеСвойстваПроверка);
				ИнтеграцияSABY.ПараметрыРаботы.СбисПараметры.Обновить = Истина;
				
			КонецЕсли;

		КонецЦикла;

	ИначеЕсли КлючПараметраУстановить = "Идентификатор" Тогда
		
		ИдентификаторБыл = ИнтеграцияSABY_Получить(ИнтеграцияSABY, "Идентификатор");
		Если ЗначениеЗаполнено(ЗначениеПараметраУстановить) Тогда
			
			ИдентификаторПослеУстановки	 = ПараметрSABY("Настройки").ПроверитьИдентификаторНастроек(ЗначениеПараметраУстановить);
			
		КонецЕсли;
		ПрикладнойОбъектSABY_Установить(ИнтеграцияSABY, КлючПараметраУстановить, ИдентификаторПослеУстановки);
		
		Если Не ИдентификаторБыл = ИдентификаторПослеУстановки Тогда
			
			ИнтеграцияSABY_Очистить(ИнтеграцияSABY);
			
		КонецЕсли;
		
		Возврат;

	ИначеЕсли	КлючПараметраУстановить = "Статус"
			Или	КлючПараметраУстановить = "Автообновление"
			Или	КлючПараметраУстановить = "Изменен"
			Или	КлючПараметраУстановить = "ДатаИзмененияНастроек"
			Или	КлючПараметраУстановить = "ИнициированыДанные" Тогда
		
		ТекущиеПараметры = ИнтеграцияSABY_Получить(ИнтеграцияSABY, "ПараметрыРаботы");
		ТекущиеПараметры[КлючПараметраУстановить] = ЗначениеПараметраУстановить;
		Возврат;

	КонецЕсли;
		
	ПрикладнойОбъектSABY_Установить(ИнтеграцияSABY, КлючПараметраУстановить, ЗначениеПараметраУстановить, ДопПараметры);
	
КонецПроцедуры

//DynamicDirective

// Функция - очистить значение по ключу и получить очищенный результат
//
// Параметры:
//  ИнтеграцияSABY				 - ИнтеграцияSABY	 - экземпляр, от которого надо получить значение
//  КлючПараметраОчистить		 - Строка			 - что хотим очистить
//  ДопПараметры				 - Структура		 - Расширение
// 
// Возвращаемое значение:
//  Произвольный - Найденное значение. Неопределено, если ничего
//
Функция ИнтеграцияSABY_Очистить(ИнтеграцияSABY, КлючПараметраОчистить = Неопределено, ДопПараметры = Неопределено) Экспорт
	Перем Результат;
	
	Если КлючПараметраОчистить = "Ини" Тогда
		
		ДанныеИни = ИнтеграцияSABY_Получить(ИнтеграцияSABY, "Ини");
		Если ТипЗнч(ДопПараметры) = Тип("Строка") Тогда
			
			ДанныеИни.Свойство(ДопПараметры, Результат);
			ДанныеИни.Удалить(ДопПараметры);
			
		Иначе
			
			ДанныеИни.Очистить();
			
		КонецЕсли;
		
		Возврат Результат;
		
	ИначеЕсли  КлючПараметраОчистить = "ОписаниеИни" Тогда
		
		ИнтеграцияSABY_Очистить(ИнтеграцияSABY, "Ини");
		Возврат ПрикладнойОбъектSABY_Очистить(ИнтеграцияSABY, КлючПараметраОчистить, "Данные");
		
	ИначеЕсли  КлючПараметраОчистить = Неопределено Тогда	
		
		// Полная очистка объекта
		ИнтеграцияSABY_Очистить(ИнтеграцияSABY, "Ини");
		ИнтеграцияSABY_Очистить(ИнтеграцияSABY, "ОписаниеИни");
		Возврат ИнтеграцияSABY;
		
	КонецЕсли;
	
	Возврат ПрикладнойОбъектSABY_Очистить(ИнтеграцияSABY, КлючПараметраОчистить, ДопПараметры);
	
КонецФункции

//DynamicDirective

// Функция - выгрузить объект по ключу
//
// Параметры:
//  КоннекшенSABY				 - КоннекшенSABY	 - экземпляр, от которого надо очистить значение
//  КлючПараметраВыгрузки		 - Строка			 - формат выгрузки класса
//  ДопПараметры				 - Структура		 - Расширение
// 
// Возвращаемое значение:
//  Произвольный - результат выгрузки
//
Функция ИнтеграцияSABY_Выгрузить(ИнтеграцияSABY, КлючПараметраВыгрузки = Неопределено, ДопПараметры = Неопределено) Экспорт
	Перем Результат;
	
	Если КлючПараметраВыгрузки = "ПараметрыДляЧтенияИни" Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("ВключеныДоработки",		Не ИнтеграцияSABY_Получить(ИнтеграцияSABY, "ОтключеныДоработки") = Истина);
		Результат.Вставить("ЧтениеПоТребованию",	ИнтеграцияSABY_Получить(ИнтеграцияSABY, "ЧтениеПоТребованию"));
		Результат.Вставить("Автообновление",		ИнтеграцияSABY_Получить(ИнтеграцияSABY, "Автообновление"));
		Результат.Вставить("Идентификатор",			ИнтеграцияSABY_Получить(ИнтеграцияSABY, "Идентификатор"));
		Результат.Вставить("ДатаИзмененияНастроек",	ИнтеграцияSABY_Получить(ИнтеграцияSABY, "ДатаИзмененияНастроек"));
		Если Не ДопПараметры = Неопределено
			И	ДопПараметры.Свойство("ПоТребованию") Тогда
			
			Результат.ЧтениеПоТребованию = ДопПараметры.ПоТребованию;
			
		КонецЕсли;
		Возврат Результат;
		
	ИначеЕсли КлючПараметраВыгрузки = "СписокИниДляИнтерфейса" Тогда
		
		ОписаниеИни			= ИнтеграцияSABY_Получить(ИнтеграцияSABY, "ОписаниеИни");
		ОтключеныДоработки	= ИнтеграцияSABY_Получить(ИнтеграцияSABY, "ОтключеныДоработки") = Истина;
		
		НаборСтрок = Новый Массив;
		Для Каждого СтрокаИни Из ОписаниеИни.Установлены Цикл
			
			НоваяСтрокаИнтерфейс = Новый Структура("Фл, ЕстьИзменения, Автообновление, ИмяФайла, ИмяФайлаБезРасширения, Стандартная, Пользовательская");
			ЗаполнитьЗначенияСвойств(НоваяСтрокаИнтерфейс, СтрокаИни);
			Если НоваяСтрокаИнтерфейс.Пользовательская Тогда 
				
				НоваяСтрокаИнтерфейс.Пользовательская = Число(НоваяСтрокаИнтерфейс.Пользовательская) + ОтключеныДоработки;
				
			Иначе
				
				НоваяСтрокаИнтерфейс.Пользовательская = 0;
				
			КонецЕсли;
			НаборСтрок.Добавить(НоваяСтрокаИнтерфейс);
			
		КонецЦикла;
			
		Возврат НаборСтрок;
		
	ИначеЕсли КлючПараметраВыгрузки = "ЗаписьБазовая" Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("Идентификатор", ИнтеграцияSABY_Получить(ИнтеграцияSABY, "Идентификатор"));
		Результат.Вставить("ДатаИзменения", ИнтеграцияSABY_Получить(ИнтеграцияSABY, "ДатаИзмененияНастроек"));
		Возврат Результат;

	КонецЕсли;
	
	Возврат ПрикладнойОбъектSABY_Выгрузить(ИнтеграцияSABY, КлючПараметраВыгрузки);
	
КонецФункции

