
//DynamicDirective

// Функция - создает прикладной объект - интеграция
//
// Параметры:
//  ВходящиеПараметры	 - Структура	 - входные параметры
//  ДопПараметры		 - Структура	 - расширение
// 
// Возвращаемое значение:
//  ВложениеСБИС - Структура с параметрами и данными вложения
//
Функция НовыйКоннекшенSABY(ВходящиеПараметры = Неопределено, ДопПараметры = Неопределено) Экспорт 
	
	КоннекшенSABY = НовыйИнтеграцияSABY(ВходящиеПараметры);
	ОбъектSABY_Установить(КоннекшенSABY, "Тип", "КоннекшенSABY");

	// Определить тип подключения
	ПрикладнойОбъектSABY_Установить(КоннекшенSABY, "Тип", "БЛ");
	Если	Не	ВходящиеПараметры = Неопределено Тогда 
		
		Если ОбъектSABY_ЭтоТип(ВходящиеПараметры, "КлассIntegrationConnection") Тогда
			
			ДанныеИни = ВходящиеПараметры.Данные.Ини;
			КоннекшенSABY_Установить(КоннекшенSABY, "Ини", ДанныеИни);
			
		ИначеЕсли ВходящиеПараметры.Свойство("Каталог") Тогда
			
			ПрикладнойОбъектSABY_Установить(КоннекшенSABY, "Тип",		"Каталог");
			КоннекшенSABY_Установить(КоннекшенSABY, "Идентификатор",	ВходящиеПараметры.Каталог);
			
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат КоннекшенSABY
	
КонецФункции

//DynamicDirective

// Функция - получить значение по ключу
//
// Параметры:
//  КоннекшенSABY			 - КоннекшенSABY	 - экземпляр, от которого надо получить значение
//  КлючПараметраПолучить	 - Строка			 - что хотим получить
//  ДопПараметры			 - Структура		 - Расширение
// 
// Возвращаемое значение:
//  Произвольный - Найденное значение. Неопределено, если ничего
//
Функция КоннекшенSABY_Получить(КоннекшенSABY, КлючПараметраПолучить, ДопПараметры = Неопределено) Экспорт
	
	Если	КлючПараметраПолучить = "Идентификатор" Тогда 
		
		Если	КоннекшенSABY.Свойство(КлючПараметраПолучить) Тогда
		
			// Для сохранения старой логики с Идентификатором на классе
			Возврат КоннекшенSABY.Идентификатор;
			
		КонецЕсли;
		// Если идентификатора на классе нет, то должно быть установлено как на прикладной объект.
		
	ИначеЕсли КлючПараметраПолучить = "ПодключениеНаБЛ" Тогда
		
		// Запрос коннекшена к БЛ. Это либо текущий, либо подготовленный специально для БЛ
		ТипПодключения = КоннекшенSABY_Получить(КоннекшенSABY, "Тип");
		Если ТипПодключения = "Каталог" Тогда
			
			Возврат ПрикладнойОбъектSABY_Получить(КоннекшенSABY, "ПодключениеНаБЛ", "Данные");
			
		КонецЕсли;
		
		Возврат КоннекшенSABY;
		
	ИначеЕсли	КлючПараметраПолучить = "Интеграция" Тогда
		
		ОбъектИнтеграцииSaby = ПрикладнойОбъектSABY_Получить(КоннекшенSABY, КлючПараметраПолучить, "Данные");
		Если ОбъектИнтеграцииSaby = Неопределено Тогда
			
			ИдИнтеграции		 = КоннекшенSABY_Получить(КоннекшенSABY, "ИдентификаторИнтеграции");
			ОбъектИнтеграцииSaby = НовыйИнтеграцияSABY(КоннекшенSABY);
			ИнтеграцияSABY_Установить(ОбъектИнтеграцииSaby, "Идентификатор", ИдИнтеграции);
			ПараметрSABY("Настройки", "Сеанс").ИнтеграцияSABY_Прочитать(ОбъектИнтеграцииSaby);
			ПрикладнойОбъектSABY_Установить(КоннекшенSABY, КлючПараметраПолучить, ОбъектИнтеграцииSaby, "Данные")
			
		КонецЕсли;
		
		Возврат ОбъектИнтеграцииSaby;
		
	ИначеЕсли  ЭтоТипСбис(КоннекшенSABY, "КлассIntegrationConnection") Тогда
		
		// Это временный костыль с проверкой в родителе типа наследника для безболезненного переезда на новые классы в дальнейшем.
		Если КлючПараметраПолучить = "Ини" Тогда
			
			ДанныеИни = КоннекшенSABY.Данные.Ини;
			Если ДанныеИни = Неопределено Тогда
				
				ДанныеИни = Новый Структура;
				КоннекшенSABY.Данные.Ини = ДанныеИни;
				
			КонецЕсли;
			
			Возврат ДанныеИни;
			
		ИначеЕсли КлючПараметраПолучить = "Меню" Тогда	
			
			ДанныеМеню = КоннекшенSABY.Данные.Меню;
			Возврат ДанныеМеню;

		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИнтеграцияSABY_Получить(КоннекшенSABY, КлючПараметраПолучить, ДопПараметры);
	
КонецФункции

//DynamicDirective

// Процедура - устновить значение по ключу
//
// Параметры:
//  КоннекшенSABY				 - КоннекшенSABY	 - экземпляр, от которого надо получить значение
//  КлючПараметраУстановить		 - Строка			 - что хотим установить
//	ЗначениеПараметраУстановить	 - Произвольный		 - значение что хотим установить
//  ДопПараметры				 - Структура		 - Расширение
// 
Процедура КоннекшенSABY_Установить(КоннекшенSABY, КлючПараметраУстановить, ЗначениеПараметраУстановить, ДопПараметры = Неопределено) Экспорт
	
	Если КлючПараметраУстановить = "Интеграция" Тогда
		
		// Установить объект интеграции
		ПрикладнойОбъектSABY_Установить(КоннекшенSABY, КлючПараметраУстановить, ЗначениеПараметраУстановить, "Данные");
		Возврат;
		
	ИначеЕсли КлючПараметраУстановить = "Идентификатор" Тогда
		
		ИдентификаторБыл = КоннекшенSABY_Получить(КоннекшенSABY, "Идентификатор");
		ИнтеграцияSABY_Установить(КоннекшенSABY, КлючПараметраУстановить, ЗначениеПараметраУстановить, ДопПараметры);
		
		ИдентификаторПослеУстановки = КоннекшенSABY_Получить(КоннекшенSABY, "Идентификатор");
		// Это временный костыль с проверкой в родителе типа наследника для безболезненного переезда на новые классы в дальнейшем.
		Если ЭтоТипСбис(КоннекшенSABY, "КлассIntegrationConnection") Тогда
			
			// Дополнительно обновить для основного ИД.
			КоннекшенSABY.Идентификатор = ИдентификаторПослеУстановки;
			
		КонецЕсли;

		Если Не ИдентификаторБыл = ИдентификаторПослеУстановки Тогда
			
			КоннекшенSABY_Очистить(КоннекшенSABY, "Данные");
			
		КонецЕсли;
		
		Возврат;

	ИначеЕсли КлючПараметраУстановить = "ПодключениеНаБЛ" Тогда
		
		// Если текущее подключение - каталог, то нужно установить подключение к БЛ
		ТипПодключения = КоннекшенSABY_Получить(КоннекшенSABY, "Тип");
		Если ТипПодключения = "Каталог" Тогда
			
			ПрикладнойОбъектSABY_Установить(КоннекшенSABY, КлючПараметраУстановить, ЗначениеПараметраУстановить, "Данные");
			
		КонецЕсли;
		
		Возврат;
		
	ИначеЕсли КлючПараметраУстановить = "ОтключеныДоработки" Тогда
		
		// Дубль от Интеграция, т.к. получение Ини зависит от типа коннекшена
		ОписаниеИни = КоннекшенSABY_Получить(КоннекшенSABY, "ОписаниеИни", "Данные");
		ДанныеИни	= КоннекшенSABY_Получить(КоннекшенSABY, "Ини");
		Если Не ОписаниеИни = Неопределено Тогда
			
			Для Каждого ИниКастом Из ОписаниеИни.Кастомные Цикл
				
				ДанныеИни.Вставить(ИниКастом, Неопределено);
				
			КонецЦикла;
			
			Если Не ОписаниеИни.Кастомные.Найти("Конфигурация") = Неопределено Тогда
				
				КоннекшенSABY_Установить(КоннекшенSABY, "ИнициированыДанные", Ложь);
				
			КонецЕсли;
			
		КонецЕсли;
		
		КоннекшенSABY_Установить(КоннекшенSABY, "Изменен", Истина);
		
		ПрикладнойОбъектSABY_Установить(КоннекшенSABY, КлючПараметраУстановить, ЗначениеПараметраУстановить, ДопПараметры);
		Возврат;
		
	ИначеЕсли  ЭтоТипСбис(КоннекшенSABY, "КлассIntegrationConnection") Тогда
		
		// Это временный костыль с проверкой в родителе типа наследника для безболезненного переезда на новые классы в дальнейшем.
		Если КлючПараметраУстановить = "Ини" Тогда
			
			Если КоннекшенSABY.Данные.Ини = Неопределено Тогда
				
				КоннекшенSABY.Данные.Ини = ЗначениеПараметраУстановить;
				
			ИначеЕсли ЗначениеПараметраУстановить = Неопределено Тогда
				
				КоннекшенSABY_Очистить(КоннекшенSABY, "Ини");
				
			Иначе
				
				Для Каждого КлючИЗначение Из ЗначениеПараметраУстановить Цикл
					
					КоннекшенSABY.Данные.Ини.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(КоннекшенSABY.Данные.Ини) Тогда
				
				КоннекшенSABY_Установить(КоннекшенSABY, "ИнициированыДанные", Истина);

			КонецЕсли;
			Возврат;
			
		ИначеЕсли КлючПараметраУстановить = "Меню" Тогда	
			
			КоннекшенSABY.Данные.Меню = ЗначениеПараметраУстановить;
			Возврат;

		КонецЕсли;
		
	КонецЕсли;
	
	ИнтеграцияSABY_Установить(КоннекшенSABY, КлючПараметраУстановить, ЗначениеПараметраУстановить, ДопПараметры);
	
КонецПроцедуры

//DynamicDirective

// Функция - очистить значение по ключу и получить очищенный результат
Функция КоннекшенSABY_Очистить(КоннекшенSABY, КлючПараметраОчистить, ДопПараметры = Неопределено) Экспорт
	Перем Результат;
	
	Если КлючПараметраОчистить = "Данные" Тогда
		
		КоннекшенSABY_Очистить(КоннекшенSABY, "Ини");
		КоннекшенSABY_Очистить(КоннекшенSABY, "Меню");
		КоннекшенSABY_Очистить(КоннекшенSABY, "Параметры");
		
		УстановленноеПодключение = ПараметрSaby("ВыбранныеНастройки", "Настройки");
		Если ОбъектыСбисРавны(КоннекшенSABY, УстановленноеПодключение) Тогда
			
			// Это установленное подключение, то нужно в т.ч. очистить ини глобально и указать что их нужно переустановить
			МодульОбъектаКлиентСервер().ИзменитьПараметрSABY("ИниВПорядке", Ложь);
			МодульОбъектаКлиентСервер().ИзменитьПараметрSABY("ДанныеИни", Новый Структура, "Настройки");
			
		КонецЕсли;
		Возврат Результат;
	
	ИначеЕсли  ЭтоТипСбис(КоннекшенSABY, "КлассIntegrationConnection") Тогда

		Если КлючПараметраОчистить = "Ини" Тогда
			
			ДанныеИни	= КоннекшенSABY.Данные.Ини;
			Результат	= ДанныеИни;
			Если ТипЗнч(ДопПараметры) = Тип("Строка") Тогда
				
				ДанныеИни.Свойство(ДопПараметры, Результат);
				ДанныеИни.Удалить(ДопПараметры);
				
			Иначе
				
				КоннекшенSABY.Данные.Ини = Неопределено;
				
			КонецЕсли;
			Возврат Результат;

		ИначеЕсли КлючПараметраОчистить = "Меню" Тогда
			
			Результат = КоннекшенSABY.Данные.Меню;
			КоннекшенSABY.Данные.Меню = Неопределено;
			
			Возврат Результат;
			
		ИначеЕсли КлючПараметраОчистить = "Параметры" Тогда
			
			Результат = КоннекшенSABY.Данные.Параметры;
			КоннекшенSABY.Данные.Параметры = Неопределено;
			Возврат Результат;
			
		КонецЕсли;

	ИначеЕсли  КлючПараметраОчистить = "ОписаниеИни" Тогда
		
		// Чистится описание ини, значит и данные тоже должны быть перечитаны.
		КоннекшенSABY_Очистить(КоннекшенSABY, "Данные");
		Возврат ПрикладнойОбъектSABY_Очистить(КоннекшенSABY, КлючПараметраОчистить, "Данные");
		
	КонецЕсли;
	
	Возврат ИнтеграцияSABY_Очистить(КоннекшенSABY, КлючПараметраОчистить, ДопПараметры);
	
КонецФункции

//DynamicDirective

// Функция - выгрузить объект по ключу
//
// Параметры:
//  КоннекшенSABY				 - КоннекшенSABY	 - экземпляр, от которого надо очистить значение
//  КлючПараметраВыгрузки		 - Строка			 - формат выгрузки класса
//  ДопПараметры				 - Структура		 - Расширение
// 
// Возвращаемое значение:
//  Произвольный - результат выгрузки
//
Функция КоннекшенSABY_Выгрузить(КоннекшенSABY, КлючПараметраВыгрузки = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если КлючПараметраВыгрузки = "ОписаниеИниДляБЛ" Тогда
		
		РезультатОписание = Новый Структура("active, format, data, type, name", Истина, КоннекшенSABY.ПараметрыКонфигурации.service);
		Если ДопПараметры = "Меню" Тогда
			
			РезультатОписание.type = ДопПараметры;
			РезультатОписание.name = "сбисМеню";
			
		ИначеЕсли ДопПараметры = "Конфигурация" Тогда	
			
			РезультатОписание.type = "Система";
			РезультатОписание.name = ДопПараметры;
			
		Иначе
			
			ОшибкаВыгрузки = НовыйСбисИсключение(, МодульОбъектаКлиентСервер_Представление() + "КоннекшенSABY.Выгрузить",,, "Отсутствуют описание для выгрузки типа");
			ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаВыгрузки);
			
		КонецЕсли;
	
		Возврат РезультатОписание;
		
	ИначеЕсли  ЭтоТипСбис(КоннекшенSABY, "КлассIntegrationConnection") Тогда
		
		Если КлючПараметраВыгрузки = "ПараметрыДляЧтенияИни" Тогда
			
			// Если запрашивается меню, то сразу запросить конфигурацию
			МенюДанные	= КоннекшенSaby_Получить(КоннекшенSaby, "Меню");
			ИниДанные	= КоннекшенSaby_Получить(КоннекшенSaby, "Ини");
			
			ЗапроситьМеню			=	МенюДанные = Неопределено;
			ЗапроситьКонфигурацию	=		ЗапроситьМеню
									Или		ИниДанные = Неопределено
									Или	Не	ИниДанные.Свойство("Конфигурация")
									Или		ИниДанные.Конфигурация = Неопределено;
									
			СписокИниПолучить = Новый Массив;
			Если ЗапроситьМеню Тогда
			
				СписокИниПолучить.Добавить(КоннекшенSABY_Выгрузить(КоннекшенSABY, "ОписаниеИниДляБЛ", "Меню"));
				
			КонецЕсли;
			
			Если ЗапроситьКонфигурацию Тогда
				
				СписокИниПолучить.Добавить(КоннекшенSABY_Выгрузить(КоннекшенSABY, "ОписаниеИниДляБЛ", "Конфигурация"));
				
			КонецЕсли;
			
			Если Не СписокИниПолучить.Количество() Тогда
				
				СписокИниПолучить = Неопределено; // Иначе придут все ини
				
			КонецЕсли;
			
			РезультатВыгрузки = ИнтеграцияSABY_Выгрузить(КоннекшенSABY, КлючПараметраВыгрузки, ДопПараметры);
			РезультатВыгрузки.Вставить("СписокИни", СписокИниПолучить);
			РезультатВыгрузки.Идентификатор = КоннекшенSABY.Идентификатор;
			
			Возврат РезультатВыгрузки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИнтеграцияSABY_Выгрузить(КоннекшенSABY, КлючПараметраВыгрузки, ДопПараметры);
	
КонецФункции


