
//DynamicDirective

// Функция - создает прикладной объект - интеграция
//
// Параметры:
//  ВходящиеПараметры	 - Структура	 - входные параметры
//  ДопПараметры		 - Структура	 - расширение
// 
// Возвращаемое значение:
//  ВложениеСБИС - Структура с параметрами и данными вложения
//
Функция НовыйКоннекшенSABY(ВходящиеПараметры = Неопределено, ДопПараметры = Неопределено) Экспорт 
	
	КоннекшенSABY = НовыйИнтеграцияSABY(ВходящиеПараметры);
	ОбъектSABY_Установить(КоннекшенSABY, "Тип", "КоннекшенSABY");

	// Определить тип подключения
	Если	Не	ВходящиеПараметры = Неопределено Тогда 
		
		Если ОбъектSABY_ЭтоТип(ВходящиеПараметры, "КлассIntegrationConnection") Тогда
			
			ДанныеИни = ВходящиеПараметры.Данные.Ини;
			КоннекшенSABY_Установить(КоннекшенSABY, "Ини", ДанныеИни);
			
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат КоннекшенSABY
	
КонецФункции

//DynamicDirective

// Функция - получить значение по ключу
//
// Параметры:
//  КоннекшенSABY			 - КоннекшенSABY	 - экземпляр, от которого надо получить значение
//  КлючПараметраПолучить	 - Строка			 - что хотим получить
//  ДопПараметры			 - Структура		 - Расширение
// 
// Возвращаемое значение:
//  Произвольный - Найденное значение. Неопределено, если ничего
//
Функция КоннекшенSABY_Получить(КоннекшенSABY, КлючПараметраПолучить, ДопПараметры = Неопределено) Экспорт
	
	КлючПараметровТест = НРег(КлючПараметраПолучить);
	Если		КлючПараметровТест = "подключениенабл" Тогда
		
		// Запрос коннекшена к БЛ. Это либо текущий, либо подготовленный специально для БЛ
		ТипПодключения = КоннекшенSABY_Получить(КоннекшенSABY, "Тип");
		Если ТипПодключения = "Каталог" Тогда
			
			Возврат ПрикладнойОбъектSABY_Получить(КоннекшенSABY, "ПодключениеНаБЛ", "Данные");
			
		КонецЕсли;
		
		Возврат КоннекшенSABY;
		
	ИначеЕсли	КлючПараметровТест = "интеграция" Тогда
		
		ОбъектИнтеграцииSaby = ПрикладнойОбъектSABY_Получить(КоннекшенSABY, КлючПараметраПолучить, "Данные");
		Если ОбъектИнтеграцииSaby = Неопределено Тогда
			
			ИдИнтеграции		 = КоннекшенSABY_Получить(КоннекшенSABY, "ИдентификаторИнтеграции");
			ОбъектИнтеграцииSaby = НовыйИнтеграцияSABY(КоннекшенSABY);
			ИнтеграцияSABY_Установить(ОбъектИнтеграцииSaby, "Идентификатор", ИдИнтеграции);
			ПараметрSABY("Настройки", "Сеанс").ИнтеграцияSABY_Прочитать(ОбъектИнтеграцииSaby);
			ПрикладнойОбъектSABY_Установить(КоннекшенSABY, КлючПараметраПолучить, ОбъектИнтеграцииSaby, "Данные")
			
		КонецЕсли;
		
		Возврат ОбъектИнтеграцииSaby;
		
	ИначеЕсли  ЭтоТипСбис(КоннекшенSABY, "КлассIntegrationConnection") Тогда
		
		// Это временный костыль с проверкой в родителе типа наследника для безболезненного переезда на новые классы в дальнейшем.
		Если		КлючПараметровТест = "ини" Тогда
			
			ДанныеИни = КоннекшенSABY.Данные.Ини;
			Если ДанныеИни = Неопределено Тогда
				
				ДанныеИни = Новый Структура;
				КоннекшенSABY.Данные.Ини = ДанныеИни;
				
			КонецЕсли;
			
			Возврат ДанныеИни;
			
		ИначеЕсли	КлючПараметровТест = "меню" Тогда	
			
			Возврат КоннекшенSABY.Данные.Меню;

		ИначеЕсли	КлючПараметровТест = "сбиспараметры"
				Или	КлючПараметровТест = "параметрыsaby" Тогда	
			
			Возврат КоннекшенSABY.Данные.Параметры;
			
		ИначеЕсли	КлючПараметровТест = "идентификатор" Тогда 
			
			// Для сохранения старой логики с Идентификатором на классе
			Возврат КоннекшенSABY.Идентификатор;

		ИначеЕсли	КлючПараметровТест = "типнастроек" Тогда 
			
			Возврат КоннекшенSABY.ПараметрыРаботы[КлючПараметраПолучить];
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИнтеграцияSABY_Получить(КоннекшенSABY, КлючПараметраПолучить, ДопПараметры);
	
КонецФункции

//DynamicDirective

// Процедура - устновить значение по ключу
//
// Параметры:
//  КоннекшенSABY				 - КоннекшенSABY	 - экземпляр, от которого надо получить значение
//  КлючПараметраУстановить		 - Строка			 - что хотим установить
//	ЗначениеПараметраУстановить	 - Произвольный		 - значение что хотим установить
//  ДопПараметры				 - Структура		 - Расширение
// 
Процедура КоннекшенSABY_Установить(КоннекшенSABY, КлючПараметраУстановить, ЗначениеПараметраУстановить, ДопПараметры = Неопределено) Экспорт
	
	Если КлючПараметраУстановить = "Интеграция" Тогда
		
		// Установить объект интеграции
		ПрикладнойОбъектSABY_Установить(КоннекшенSABY, КлючПараметраУстановить, ЗначениеПараметраУстановить, "Данные");
		Возврат;
		
	ИначеЕсли КлючПараметраУстановить = "Идентификатор" Тогда
		
		ИдентификаторБыл = КоннекшенSABY_Получить(КоннекшенSABY, "Идентификатор");
		ИнтеграцияSABY_Установить(КоннекшенSABY, КлючПараметраУстановить, ЗначениеПараметраУстановить, ДопПараметры);
		
		ИдентификаторПослеУстановки = КоннекшенSABY_Получить(КоннекшенSABY, "Идентификатор");
		// Это временный костыль с проверкой в родителе типа наследника для безболезненного переезда на новые классы в дальнейшем.
		Если ЭтоТипСбис(КоннекшенSABY, "КлассIntegrationConnection") Тогда
			
			// Дополнительно обновить для основного ИД.
			КоннекшенSABY.Идентификатор = ИдентификаторПослеУстановки;
			
		КонецЕсли;

		Если Не ИдентификаторБыл = ИдентификаторПослеУстановки Тогда
			
			КоннекшенSABY_Очистить(КоннекшенSABY, "Данные");
			
		КонецЕсли;
		
		Возврат;

	ИначеЕсли КлючПараметраУстановить = "ПодключениеНаБЛ" Тогда
		
		// Если текущее подключение - каталог, то нужно установить подключение к БЛ
		ТипПодключения = КоннекшенSABY_Получить(КоннекшенSABY, "ТипДанных");
		Если ТипПодключения = "Каталог" Тогда
			
			ПрикладнойОбъектSABY_Установить(КоннекшенSABY, КлючПараметраУстановить, ЗначениеПараметраУстановить, "Данные");
			
		КонецЕсли;
		
		Возврат;
		
	ИначеЕсли КлючПараметраУстановить = "ОтключеныДоработки" Тогда
		
		КоннекшенSABY_Очистить(КоннекшенSABY, "Ини", "Пользовательские");
		
	ИначеЕсли  ЭтоТипСбис(КоннекшенSABY, "КлассIntegrationConnection") Тогда
		
		// Это временный костыль с проверкой в родителе типа наследника для безболезненного переезда на новые классы в дальнейшем.
		Если КлючПараметраУстановить = "Ини" Тогда
			
			Если КоннекшенSABY.Данные.Ини = Неопределено Тогда
				
				КоннекшенSABY.Данные.Ини = ЗначениеПараметраУстановить;
				
			ИначеЕсли ЗначениеПараметраУстановить = Неопределено Тогда
				
				КоннекшенSABY_Очистить(КоннекшенSABY, "Ини");
				
			Иначе
				
				Для Каждого КлючИЗначение Из ЗначениеПараметраУстановить Цикл
					
					КоннекшенSABY.Данные.Ини.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
					
				КонецЦикла;
				
			КонецЕсли;
			
			КоннекшенSABY_Установить(КоннекшенSABY, "ИнициированыДанные", ЗначениеЗаполнено(КоннекшенSABY.Данные.Ини));
			ВыбранныеНастройкиГлобально = ПараметрSABY("ВыбранныеНастройки", "Настройки");
			Если ВыбранныеНастройкиГлобально = КоннекшенSABY Тогда
				
				ИзменитьПараметрSABY("ДанныеИни", КоннекшенSABY.Данные.Ини, "Настройки");
				
			КонецЕсли;
			
			Возврат;
			
		ИначеЕсли КлючПараметраУстановить = "Меню" Тогда	
			
			КоннекшенSABY.Данные.Меню = ЗначениеПараметраУстановить;
			Возврат;

		КонецЕсли;
		
	КонецЕсли;
	
	ИнтеграцияSABY_Установить(КоннекшенSABY, КлючПараметраУстановить, ЗначениеПараметраУстановить, ДопПараметры);
	
КонецПроцедуры

// Функция - очистить значение по ключу и получить очищенный результат
//DynamicDirective
Функция КоннекшенSABY_Очистить(КоннекшенSABY, КлючПараметраОчистить, ДопПараметры = Неопределено) Экспорт
	Перем Результат;
	
	Если КлючПараметраОчистить = "Данные" Тогда
		
		КоннекшенSABY_Очистить(КоннекшенSABY, "Ини");
		КоннекшенSABY_Очистить(КоннекшенSABY, "Меню");
		КоннекшенSABY_Очистить(КоннекшенSABY, "Параметры");
		
		КоннекшенSaby_Установить(КоннекшенSaby, "ИнициированыДанные", Ложь);
		
		УстановленноеПодключение = ПараметрSaby("ВыбранныеНастройки", "Настройки");
		Если ОбъектыСбисРавны(КоннекшенSABY, УстановленноеПодключение) Тогда
			
			// Это установленное подключение, то нужно в т.ч. очистить ини глобально и указать что их нужно переустановить
			МодульОбъектаКлиентСервер().ИзменитьПараметрSABY("ИниВПорядке", Ложь);
			МодульОбъектаКлиентСервер().ИзменитьПараметрSABY("ДанныеИни", Новый Структура, "Настройки");
			
		КонецЕсли;
		Возврат Результат;
	
	ИначеЕсли  КлючПараметраОчистить = "Ини" Тогда
		
		КлючОчистить = Неопределено;
		Если Не ДопПараметры = Неопределено Тогда
			
			Если ТипЗнч(ДопПараметры) = Тип("Строка") Тогда
				
				КлючОчистить = ДопПараметры;
				
			Иначе
				
				// Указано имя ини, или определнный ключ
				ДопПараметры.Свойство("КлючОчистить", КлючОчистить);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если КлючОчистить = Неопределено Тогда
			
			// Очищаем ини совсем.
			КоннекшенSABY_Установить(КоннекшенSABY, "ИнициированыДанные", Ложь);
			Если  ЭтоТипСбис(КоннекшенSABY, "КлассIntegrationConnection") Тогда
				
				КоннекшенSABY.Данные.Ини = Неопределено;
				
			Иначе
				
				ПрикладнойОбъектSABY_Очистить(КоннекшенSABY, КлючПараметраОчистить);
				
			КонецЕсли;
			
		Иначе
			
			ДанныеИни = КоннекшенSABY_Получить(КоннекшенSABY, "Ини");
		
			Если Не ЗначениеЗаполнено(ДанныеИни) Тогда
				
				Возврат ДанныеИни;
				
			КонецЕсли;
			
			Если КлючОчистить = "Пользовательские" Тогда 
				
				ОписаниеИни = КоннекшенSABY_Получить(КоннекшенSABY, "ОписаниеИни");
				Для Каждого ИниКастом Из ОписаниеИни.Кастомные Цикл
					
					Если ДанныеИни.Свойство(ИниКастом) Тогда
						
						ДанныеИни.Вставить(ИниКастом, Неопределено);
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ДанныеИни.Свойство(КлючОчистить) Тогда
				
				ДанныеИни.Вставить(КлючОчистить);
				
			КонецЕсли;
			
			Если	Не ДанныеИни.Свойство("Конфигурация")
				Или	Не ЗначениеЗаполнено(ДанныеИни.Конфигурация) Тогда
				
				КоннекшенSABY_Установить(КоннекшенSABY, "ИнициированыДанные", Ложь);
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли  КлючПараметраОчистить = "ЗавершитьРаботуSABY" Тогда
		
		// Dispose объекта
		ПараметрSABY("Настройки").КоннекшенSABY_ЗавершитьРаботу(КоннекшенSABY);

	ИначеЕсли  ЭтоТипСбис(КоннекшенSABY, "КлассIntegrationConnection") Тогда

		Если КлючПараметраОчистить = "Меню" Тогда
			
			Результат = КоннекшенSABY.Данные.Меню;
			КоннекшенSABY.Данные.Меню = Неопределено;
			
			Возврат Результат;
			
		ИначеЕсли КлючПараметраОчистить = "Параметры" Тогда
			
			Результат = КоннекшенSABY.Данные.Параметры;
			КоннекшенSABY.Данные.Параметры = Неопределено;
			Возврат Результат;
			
		КонецЕсли;

	КонецЕсли;
	
	Возврат ИнтеграцияSABY_Очистить(КоннекшенSABY, КлючПараметраОчистить, ДопПараметры);
	
КонецФункции

// Функция - выгрузить объект по ключу
//
// Параметры:
//  КоннекшенSABY				 - КоннекшенSABY	 - экземпляр, от которого надо очистить значение
//  КлючПараметраВыгрузки		 - Строка			 - формат выгрузки класса
//  ДопПараметры				 - Структура		 - Расширение
// 
// Возвращаемое значение:
//  Произвольный - результат выгрузки
//
//DynamicDirective
Функция КоннекшенSABY_Выгрузить(КоннекшенSABY, КлючПараметраВыгрузки = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если КлючПараметраВыгрузки = "ОписаниеИниДляБЛ" Тогда
		
		РезультатОписание = Новый Структура("active, format, data, type, name", Истина, КоннекшенSABY.ПараметрыКонфигурации.service);
		Если ДопПараметры = "Меню" Тогда
			
			РезультатОписание.type = ДопПараметры;
			РезультатОписание.name = "сбисМеню";
			
		ИначеЕсли ДопПараметры = "Конфигурация" Тогда	
			
			РезультатОписание.type = "Система";
			РезультатОписание.name = ДопПараметры;
			
		Иначе
			
			ОшибкаВыгрузки = НовыйСбисИсключение(, МодульОбъектаКлиентСервер_Представление() + "КоннекшенSABY.Выгрузить",,, "Отсутствуют описание для выгрузки типа");
			ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаВыгрузки);
			
		КонецЕсли;
	
		Возврат РезультатОписание;
		
	ИначеЕсли  КлючПараметраВыгрузки = "ЗаписьWriteConnection" Тогда
		
		Возврат яКоннекшенSABY_Выгрузить_ЗаписьWriteConnection(КоннекшенSABY, ДопПараметры);
		
	ИначеЕсли  ЭтоТипСбис(КоннекшенSABY, "КлассIntegrationConnection") Тогда
		
		Если КлючПараметраВыгрузки = "ПараметрыДляЧтенияИни" Тогда
			
			// Если запрашивается меню, то сразу запросить конфигурацию
			МенюДанные	= КоннекшенSaby_Получить(КоннекшенSaby, "Меню");
			ИниДанные	= КоннекшенSaby_Получить(КоннекшенSaby, "Ини");
			
			ЗапроситьМеню			=	МенюДанные = Неопределено;
			ЗапроситьКонфигурацию	=		ЗапроситьМеню
									Или		ИниДанные = Неопределено
									Или	Не	ИниДанные.Свойство("Конфигурация")
									Или		ИниДанные.Конфигурация = Неопределено;
									
			СписокИниПолучить = Новый Массив;
			Если ЗапроситьМеню Тогда
			
				СписокИниПолучить.Добавить(КоннекшенSABY_Выгрузить(КоннекшенSABY, "ОписаниеИниДляБЛ", "Меню"));
				
			КонецЕсли;
			
			Если ЗапроситьКонфигурацию Тогда
				
				СписокИниПолучить.Добавить(КоннекшенSABY_Выгрузить(КоннекшенSABY, "ОписаниеИниДляБЛ", "Конфигурация"));
				
			КонецЕсли;
			
			Если Не СписокИниПолучить.Количество() Тогда
				
				СписокИниПолучить = Неопределено; // Иначе придут все ини
				
			КонецЕсли;
			
			РезультатВыгрузки = ИнтеграцияSABY_Выгрузить(КоннекшенSABY, КлючПараметраВыгрузки, ДопПараметры);
			РезультатВыгрузки.Вставить("СписокИни", СписокИниПолучить);
			РезультатВыгрузки.Идентификатор = КоннекшенSABY.Идентификатор;
			
			Возврат РезультатВыгрузки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИнтеграцияSABY_Выгрузить(КоннекшенSABY, КлючПараметраВыгрузки, ДопПараметры);
	
КонецФункции

// Функция - сохранить изменения объекта
//
// Параметры:
//  КоннекшенSABY				 - КоннекшенSABY			 - сохраняемый экземпляр
//  ДопПараметры				 - Неопределено, Структура	 - расширение
// 
//DynamicDirective
Процедура КоннекшенSABY_Сохранить(КоннекшенSABY, ДопПараметры = Неопределено) Экспорт
    Перем КлючВыгрузкиЗаписи;
	
	Если Не КоннекшенSaby_Получить(КоннекшенSaby, "Изменен") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ДопПараметры = Неопределено Тогда
		Если ТипЗнч(ДопПараметры) = Тип("Строка") Тогда
			
			КлючВыгрузкиЗаписи = ДопПараметры;
			
		Иначе
			
			ДопПараметры.Свойство("КлючВыгрузки", КлючВыгрузкиЗаписи);
			
		КонецЕсли;
	КонецЕсли;
	Если КлючВыгрузкиЗаписи = Неопределено Тогда 
		
		КлючВыгрузкиЗаписи = "Полный";
		
	КонецЕсли;
	
	КлючВыгрузкиЗаписи	= НРег(КлючВыгрузкиЗаписи);
	ТипДанных			= КоннекшенSaby_Получить(КоннекшенSaby, "ТипДанных");
	Кэш					= ПолучитьТекущийЛокальныйКэш();
	
	Если ТипДанных = "БЛ" Тогда
		
		ПараметрыОтправки = КоннекшенSaby_Выгрузить(КоннекшенSaby, "ЗаписьWriteConnection", КлючВыгрузкиЗаписи);
		Отказ = Ложь;
		
		Результат = ПараметрSaby("Интеграция").ЗаписатьConnection(Кэш, ПараметрыОтправки, Новый Структура, Отказ);
		Если Отказ Тогда
			
			ОшибкаЗаписи = NewExtException(Результат, МодульОбъектаКлиентСервер_Представление() + "КоннекшенSABY.Сохранить");
			ВызватьИсключение ExtException_Dump(ОшибкаЗаписи);
			
		КонецЕсли;
		
	ИначеЕсли ТипДанных = "Каталог" Тогда
		
		Если КлючВыгрузкиЗаписи = "параметры" Тогда
			
			МодульНастройкиКаталог	= ПолучитьФормуОбработки("ФайлыНастроекКаталог");
			КаталогНастроек			= КоннекшенSABY_Получить(КоннекшенSaby, "Идентификатор");
			СтруктураНастроек		= яКоннекшенSABY_Выгрузить_Запись_ПараметрыПодключения(КоннекшенSABY);
			
			МодульНастройкиКаталог.КоннекшенSABY_СохранитьПараметрыSaby(КоннекшенSaby, СтруктураНастроек);
			
		Иначе
			
			ОшибкаЗаписи = NewExtException(, МодульОбъектаКлиентСервер_Представление() + "КоннекшенSABY.Сохранить", 747,, "Неверно указан ключ записи подключения. Запись невозможна.");
			ВызватьИсключение ExtException_Dump(ОшибкаЗаписи);
			
		КонецЕсли;
		
	Иначе
		
		ОшибкаЗаписи = NewExtException(, МодульОбъектаКлиентСервер_Представление() + "КоннекшенSABY.Сохранить", 747,, "Неизвестный тип данных подключения. Запись невозможна.");
		ВызватьИсключение ExtException_Dump(ОшибкаЗаписи);
		
	КонецЕсли;
	
	Если КлючВыгрузкиЗаписи = "параметры" Тогда
		
		КоннекшенSaby.ПараметрыРаботы.СбисПараметры.Обновить = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#Область include_core2_vo2_МодульОбъекта_КлиентСервер_Классы_КоннекшенSABY_private
#КонецОбласти

