
//DynamicDirective

Функция КэшСБИС_Получить(КэшСБИС, КлючВходящий) Экспорт
	
	КлючПроверить = НРег(КлючВходящий);
	
	Если КлючПроверить = "ключиконнекшеновпользователя" Тогда
		
		// В разрезе аккаунта
		ШаблонКлюча = "{КодСервиса}{ИдПользователя}_{ИдАккаунта}";
		ПараметрыПрименить = КэшСБИС.ПараметрыИнтеграции;

		Результат = Новый Массив;
		КлючДобавить = ПрименитьФорматКСтроке(ШаблонКлюча, ПараметрыПрименить);
		Если ЗначениеЗаполнено(КлючДобавить) Тогда
			
			Результат.Добавить(КлючДобавить);
			
		КонецЕсли;
		
		Если		ЗначениеЗаполнено(КэшСБИС.ПараметрыИнтеграции.Пользователь) Тогда
			
			КлючНастроек = КэшСБИС.ПараметрыИнтеграции.Пользователь;
			
		ИначеЕсли	ЗначениеЗаполнено(ПолучитьТекущийЛокальныйКэш().ГлавноеОкно.Пользователь) Тогда
			
			КлючНастроек = ПолучитьТекущийЛокальныйКэш().ГлавноеОкно.Пользователь;
			
		ИначеЕсли	КэшСБИС.ОбменВключен
				И	КэшСБИС.Авторизован Тогда
				
			КлючНастроек = ПараметрSABY("Интеграция", "Сеанс").ИнформацияОТекущемПользователе(ПолучитьТекущийЛокальныйКэш());

		Иначе
			
			КлючНастроек = "";
			
		КонецЕсли;
		
		// Старый шаблон - сервис и пользователь
		ШаблонКлюча		= "{КодСервиса}{ИдПользователя}";
		ПараметрыФормат = Новый Структура("КодСервиса, ИдПользователя", "", "", "");
		ПараметрыПрименить = ПараметрыФормат;
		Если ЗначениеЗаполнено(КлючНастроек) Тогда
			ПараметрыФормат.КодСервиса		= КэшСБИС.ПараметрыИнтеграции.КодСервиса;
			ПараметрыФормат.ИдПользователя	= НРег(СтрЗаменить(СтрЗаменить(СтрЗаменить(КлючНастроек, " ", ""), Символы.ПС, ""), Символы.Таб, ""));
			Результат.Добавить(ПрименитьФорматКСтроке(ШаблонКлюча, ПараметрыПрименить));
			ПараметрыФормат.КодСервиса = "";
			Результат.Добавить(ПрименитьФорматКСтроке(ШаблонКлюча, ПараметрыПрименить));
		КонецЕсли;
		
		Если Не ПараметрSABY("ВходПоСертификату") Тогда
			
			// Совсем старый шаблон - по логину
			ПараметрыФормат.ИдПользователя	= НРег(ПараметрSABY("Логин"));
			Результат.Добавить(ПрименитьФорматКСтроке(ШаблонКлюча, ПараметрыПрименить));
			
		КонецЕсли;
		
		Возврат Результат;
	
	КонецЕсли;
	
КонецФункции

//DynamicDirective

Процедура КэшСБИС_Вставить(КэшСБИС, КлючВставить, ЗначениеВставить)
	
	Если КлючВставить = "ИдентификаторНастроек" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	КэшСБИС[КлючВставить] = ЗначениеВставить;
	
КонецПроцедуры

//DynamicDirective

Процедура КэшСБИС_ОчиститьОбъект(КэшСБИС)
	
	КэшСБИС.МодульОбъектаКлиент = Неопределено;
	
КонецПроцедуры

