
//DynamicDirective

Функция НовыйСбисИсключение_РазборОшибки(БазоваяОшибка, ОшибкаПоВходнымПараметрам, КонтекстОбъединения);
	
	// Проверить перегрузки для конструктора
	
	Если БазоваяОшибка = Неопределено Тогда
		
		// Базовая ошибка неопределена, это генерация нового исключения
		СбисОсновнаяОшибка	= СбисИсключение_ПоВходнымПараметры(ОшибкаПоВходнымПараметрам);

	ИначеЕсли	ТипЗнч(БазоваяОшибка) = Тип("ИнформацияОбОшибке")	Тогда
		
		СбисОсновнаяОшибка = СбисИсключение_ИнформацияОбОшибке(БазоваяОшибка, ОшибкаПоВходнымПараметрам, КонтекстОбъединения);
		
	ИначеЕсли	ТипЗнч(БазоваяОшибка) = Тип("Строка")				Тогда
		
		СбисОсновнаяОшибка = СбисИсключение_Строка(БазоваяОшибка, ОшибкаПоВходнымПараметрам);
		
	ИначеЕсли	ТипЗнч(БазоваяОшибка) = Тип("Число")				Тогда
		
		СбисОсновнаяОшибка = СбисИсключение_Число(БазоваяОшибка);
		
	ИначеЕсли	ЭтоТипСбис(БазоваяОшибка, "SbisWarning") Тогда
		
		СбисОсновнаяОшибка = СбисИсключение_SbisWarning(БазоваяОшибка, ОшибкаПоВходнымПараметрам)
		
	ИначеЕсли	ТипЗнч(БазоваяОшибка) = Тип("Структура")			Тогда
		
		СбисОсновнаяОшибка = СбисИсключение_Структура(БазоваяОшибка, ОшибкаПоВходнымПараметрам);
		
	ИначеЕсли	ТипЗнч(БазоваяОшибка) = Тип("Соответствие")			Тогда
		
		СбисОсновнаяОшибка = СбисИсключение_Соответствие(БазоваяОшибка);
		
	Иначе
		
		//Неизвестная ошибка
		СбисОсновнаяОшибка		= СбисИсключение_Пустое();
		СбисОсновнаяОшибка.dump = НовыйДампОшибки(БазоваяОшибка);
		
	КонецЕсли;
	
	Если КонтекстОбъединения.ПодобратьРешение Тогда
		
		СбисИсключение_ЗаполнитьРешениеПроблемы(СбисОсновнаяОшибка);
		
	КонецЕсли;
	
	Возврат СбисОсновнаяОшибка;
	
КонецФункции

