
// Базовый объект для всех прочих

//DynamicDirective

// Функция - конструктор прикладного объекта SABY
//
// Параметры:
//  ТипДляНовогоОбъекта	 - Строка	 - тип наследника от базового объекта
// 
// Возвращаемое значение:
//  ПрикладнойОбъектSABY - Структура с предопределенными свойствами
//
Функция НовыйПрикладнойОбъектSABY(ВходящиеПараметры = Неопределено, ДопПараметры = Неопределено) Экспорт 
	
	Результат = НовыйОбъектSABY("ПрикладнойОбъектSABY");
	Результат.Вставить("_параметры",	Новый Структура);				// Простые свойства объекта, для регистронезависимой проверки
	Результат.Вставить("_данные",		Новый Соответствие);    		// Составные свойства объекта со сложным ключом
	
	Если Не ВходящиеПараметры = Неопределено Тогда
		
		Если ТипЗнч(ВходящиеПараметры) = Тип("Строка") Тогда
			
			ОбъектSABY_Установить(Результат, "Тип", ВходящиеПараметры);
			
		ИначеЕсли ОбъектSABY_ЭтоТип(ВходящиеПараметры, Результат) Тогда
			
			Результат._тип			= ВходящиеПараметры._тип;
			Результат._параметры	= СоздатьКопиюОбъекта(ВходящиеПараметры._параметры);
			Результат._данные		= СоздатьКопиюОбъекта(ВходящиеПараметры._данные);
			
		КонецЕсли;
	
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Классы_ПрикладнойОбъект_АПИ
#КонецОбласти

