
//DynamicDirective

// Функция - конструктор исключения
//
// Параметры:
//  ВозникшаяОшибка		 - СбисИсключение/ExtSysException/ИнформацияОбОшибке/Структура/Строка/Число	 - описание возникшей проблемы
//  ОснованиеДляОшибки	 - СбисИсключение/Строка	 - что именно пошло не так. 
//		Это может быть готовое исключение, которое надо добавить в текущую проблему
//		Это может быть строка с именем метода где возникла проблема. 
//			Тогда основная ошибка формируется по прочим полям, 
//			а возникшая ошибка добавляется к новой в виде записи в стек 
//			с возможным переопределеним свойств кода, текста, детализации
//  СбисКод				 - Число/Неопределено		 - устанавливаемый код ошибки.
//		Не используется, если ОснованиеДляОшибки готовое исключение
//  СбисСообщение		 - Строка/Неопределено		 - устанавливаемое сообщение для ошибки. Если не задано явно, то определяется по коду и расширенному коду.
//		Не используется, если ОснованиеДляОшибки готовое исключение
//  СбисДетализация		 - Строка/Неопределено		 - устанавливаемое расширенное сообщение для ошибки. Если не задано явно, то берется сообщение. 
//		Не используется, если ОснованиеДляОшибки готовое исключение
//  СбисДанные			 - Структура/Неопределено	 - устанавливаемые данные ошибки. Если не задано явно, то берется от возникшей ошибки.
//		Не используется, если ОснованиеДляОшибки готовое исключение
//  СбисХелп			 - Строка/Неопределено		 - ссылка на Help.
//		Не используется, если ОснованиеДляОшибки готовое исключение
// 
// Возвращаемое значение:
//  СбисИсключение - экземпляр класса ошибки.
//
Функция НовыйСбисИсключение(ВозникшаяОшибка	= Неопределено,	ОснованиеДляОшибки	= Неопределено,
							СбисКод			= Неопределено,	СбисСообщение		= Неопределено, СбисДетализация = Неопределено, СбисДанные = Неопределено, СбисХелп = Неопределено) Экспорт
							
	КонтекстОбъединения	= Новый Структура("СообщениеУказаноЯвно, ДетализацияУказанаЯвно", Истина, Истина);

	Если ОбъектSABY_ЭтоТип(ОснованиеДляОшибки, "СбисИсключение") Тогда
		
		// Перегрузка для объединенения ошибок. Тогда второй аргумент должен быть обязательно типом "СбисИсключение"
		// Все прочие параметры (кроме первых 2) игнорируются
		ОсновнаяОшибка			= НовыйСбисИсключение_РазборОшибки(ВозникшаяОшибка, ОснованиеДляОшибки);
		ВспомогательнаяОшибка	= ОснованиеДляОшибки;
		
	Иначе
		
		// Ошибка с параметрами, где 2 аргумент это имя метода в стек
		ОсновнаяОшибка			= СбисИсключение_Пустое(СбисКод, СбисСообщение, СбисДетализация, ОснованиеДляОшибки, СбисДанные);
		Если ОбъектSABY_ЭтоТип(ВозникшаяОшибка, "СбисИсключение") Тогда
			
			ВспомогательнаяОшибка	= ВозникшаяОшибка;

		Иначе
			
			ВспомогательнаяОшибка	= НовыйСбисИсключение_РазборОшибки(ВозникшаяОшибка, ОсновнаяОшибка);
			
		КонецЕсли;
		
		// Если сообщения указаны явно в конструкторе, то они не обновляются.
		КонтекстОбъединения.СообщениеУказаноЯвно	= ЗначениеЗаполнено(СбисСообщение);
		КонтекстОбъединения.ДетализацияУказанаЯвно	= ЗначениеЗаполнено(СбисДетализация);
		
	КонецЕсли;
	
	НовыйСбисИсключение_ОбъединитьОшибки(ОсновнаяОшибка, ВспомогательнаяОшибка, КонтекстОбъединения);
	
	Возврат ОсновнаяОшибка;
	
КонецФункции

#Область include_core2_vo2_МодульОбъекта_КлиентСервер_Классы_МетодыКонструктора
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_КлиентСервер_Классы_СбисИсключение_АПИ
#КонецОбласти

//DynamicDirective

//Процедура генерирует и вызывает ExtSysException(СбисИсключение)
Процедура ВызватьСбисИсключение(БазоваяОшибка=Неопределено, СбисИмяКоманды,
								СбисКод=Неопределено, СбисСообщение=Неопределено, СбисДетализация=Неопределено, СбисДамп=Неопределено, СбисХелп=Неопределено) Экспорт
								
	ИсключениеВызов = НовыйСбисИсключение(БазоваяОшибка, СбисИмяКоманды, СбисКод, СбисСообщение, СбисДетализация, СбисДамп, СбисХелп);
	ВызватьИсключение(СбисИсключение_ВСтроку(ИсключениеВызов));
	
КонецПроцедуры

//DynamicDirective

Функция НовыйДампОшибки(ОснованиеДампа = Неопределено,
						ДетализацияОшибки = Неопределено, ИсходнаяСтрока= Неопределено, НомерСтроки = Неопределено, ИмяМодуля = Неопределено)
							
	СбисОснованиеОшибки = Новый Структура(
	"ДетализацияОшибки, ИсходнаяСтрока, НомерСтроки, ИмяМодуля",
	ДетализацияОшибки, ИсходнаяСтрока, НомерСтроки, ИмяМодуля);
							
	Если ТипЗнч(ОснованиеДампа) = Тип("ИнформацияОбОшибке") Тогда						

		ЗаполнитьЗначенияСвойств(СбисОснованиеОшибки, ОснованиеДампа);
		СбисОснованиеОшибки.ИсходнаяСтрока = СокрЛП(СбисОснованиеОшибки.ИсходнаяСтрока);
		
	ИначеЕсли ЭтоТипСбис(ОснованиеДампа, "СбисИсключение") Тогда
		
		СбисОснованиеОшибки.ИмяМодуля = ОснованиеДампа.methodName;
		Если ДетализацияОшибки = Неопределено Тогда
			
			СбисОснованиеОшибки.ДетализацияОшибки = ОснованиеДампа.details;
			
		КонецЕсли;
		
	ИначеЕсли ОснованиеДампа = Неопределено Тогда
		
		
	Иначе
		
		// Не знаем, что за основание, добавить в дамп
		СбисОснованиеОшибки.Вставить("Основание", ОснованиеДампа);
		
		Если СбисОснованиеОшибки.ИмяМодуля = Неопределено Тогда
			
			СбисОснованиеОшибки.ИмяМодуля = "МодульОбъектаКлиент.НовыйДампОшибки";
			
		КонецЕсли;
		
		Если СбисОснованиеОшибки.ИсходнаяСтрока = Неопределено Тогда
			
			Попытка
				
				СбисОснованиеОшибки.ИсходнаяСтрока	= Строка(ОснованиеДампа);
				
			Исключение
				
				СбисОснованиеОшибки.ИсходнаяСтрока	= ОписаниеОшибки();
				
			КонецПопытки;
			
		КонецЕсли;

	КонецЕсли;
	
	Возврат СбисОснованиеОшибки;
		
КонецФункции			

//DynamicDirective

Процедура НовыйСбисИсключение_ОбъединитьОшибки(СбисИсключение, СбисОсновнаяОшибка, КонтектОбъединения)
	Перем СбисСтек;
	
	ОбновитьТекстСообщения = Не КонтектОбъединения.СообщениеУказаноЯвно;
	
	//Если не указаны основные поля для новой ошибки
	Если СбисИсключение.code = Неопределено Тогда
		
		СбисИсключение.code		= СбисОсновнаяОшибка.code;
		СбисИсключение.extCode	= СбисОсновнаяОшибка.extCode;
		
	ИначеЕсли СбисОсновнаяОшибка.code = СбисИсключение.code
			И ЗначениеЗаполнено(СбисОсновнаяОшибка.extCode) Тогда
			
		// Код не меняется и есть код-расширение ошибки, то взять перегенерированное сообщение
		ОбновитьТекстСообщения	= Ложь;
		СбисИсключение.extCode	= СбисОсновнаяОшибка.extCode;
		СбисИсключение.message	= СбисОсновнаяОшибка.message;
		
	Иначе
		
		// Код был изменен, код расширения так же никуда не идет, останется в стэке.
		
	КонецЕсли;
	
	Если СбисИсключение.message = Неопределено Тогда
		
		// Нет сообщения ни в основной, ни в обрабатываемой ошибке
		Если СбисОсновнаяОшибка.message = Неопределено Тогда
			
			ОбновитьТекстСообщения = Истина;
			
		ИначеЕсли Не СбисИсключение_СообщениеПоКоду(СбисОсновнаяОшибка.code) = СбисОсновнаяОшибка.message Тогда 
			
			СбисИсключение.message	= СбисОсновнаяОшибка.message;
			ОбновитьТекстСообщения	= Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбновитьТекстСообщения Тогда
		
		СбисИсключение.message = СбисИсключение_ТекстСообщения(СбисИсключение);
		
	КонецЕсли;
	
	Если Не	КонтектОбъединения.ДетализацияУказанаЯвно Тогда
		
		Если СбисОсновнаяОшибка.details = Неопределено Тогда
		
			СбисИсключение.details = СбисИсключение.message;
			
		Иначе
			
			СбисИсключение.details = СбисОсновнаяОшибка.details;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Если СбисИсключение.help = Неопределено Тогда
		
		Если	СбисОсновнаяОшибка.Свойство("help") Тогда
			
			СбисИсключение.help = СбисОсновнаяОшибка.help;
			
		КонецЕсли;
		
	КонецЕсли;
		
	// В ошибке не своего стека, проинитим с добавлением основной ошибки в стек
	СбисИсключение_ДобавитьВСтек(СбисИсключение, СбисОсновнаяОшибка);
	
	// data от ошибки прокидывается на верхний уровень всегда.
	Если СбисИсключение.data = Неопределено Тогда
		
		СбисИсключение.data = СбисОсновнаяОшибка.data;
		
	КонецЕсли;
		
КонецПроцедуры
	
//DynamicDirective

// Функция - особенности генерации исключений для метода СБИС.ПрочитатьДокумент
//
// Параметры:
//  СбисИсключение	 - СбисИсключение	 - ошибка, полученная от БЛ
// 
// Возвращаемое значение:
//  СбисИсключение - после проверки с обновленным кодом.
//
Функция ПерегенерироватьСбисИсключение_ПрочитатьДокумент(СбисИсключение, ДопПараметры = Неопределено) Экспорт
	Перем ПараметрИзДоп, ИсключениеРезультат, РасширениеКод;

	ИсключениеРезультат = СбисИсключение_Пустое(СбисИсключение);
	ИсключениеРезультат.methodName = "МодульОбъектаКлиент.ПерегенерироватьСбисИсключение_ПрочитатьДокумент";
	ИсключениеРезультат.Вставить("stack", СоздатьКопиюОбъекта(СбисИсключение.stack));
	
	// Для прочитать документ есть документ 1С
	Если		ДопПараметры.Свойство("Основание", ПараметрИзДоп)
		И	Не	ПараметрИзДоп = Неопределено Тогда
		
		Если ДопПараметры.Черновик Тогда
			
			РасширениеКод = 203;
			ИсключениеРезультат.details	= "Отправка черновика невозможна.";
			//ИсключениеРезультат.details	= ПрименитьФорматКСтроке("Для отправки документа {СтрШаблон}, необходимо очистить сопоставление.", ДопПараметры.Основание);
			
		Иначе
			
			РасширениеКод = 001;
			
		КонецЕсли;
		
		ДампРезультат				= Новый ФиксированнаяСтруктура("ИсходноеИсключение", СбисИсключение);
		ИсключениеРезультат.dump	= ДампРезультат;
		
	КонецЕсли; 
	
	ИсключениеРезультат.extCode	= РасширениеКод;
	ИсключениеРезультат = СбисИсключение_Пустое(ИсключениеРезультат);
	
	Если	Не ИсключениеРезультат.code		= СбисИсключение.code
		Или	Не ИсключениеРезультат.extCode	= СбисИсключение.extCode Тогда
		
		// Изменился код, обновить записи в стеке
		СбисИсключение_ДобавитьВСтек(ИсключениеРезультат, СбисИсключение);
		
	КонецЕсли;
	
	Возврат ИсключениеРезультат;
	
КонецФункции
						
//DynamicDirective

// Функция - возвращает пустое исключение
// 
// Возвращаемое значение:
//   - 
//
Функция СбисИсключение_Пустое(	СбисОснование = 100,			СбисСообщение = Неопределено,	СбисДетализация = Неопределено,
								СбисИмяКоманды = Неопределено,	СбисДанные = Неопределено,		РасширениеКода = Неопределено)

	КлючиЭкземпляра = 
	"code
	|message
	|details
	|methodName
	|dump
	|help
	|data
	|extCode
	|stack";							
								
	НовыйИсключение		= НовыйОбъектSABY(Новый ФиксированнаяСтруктура("Тип, Свойства", "СбисИсключение", КлючиЭкземпляра));
	СвойстваИсключить	= ОбъектSABY_Получить(НовыйИсключение, "Свойства");
	
	Если ТипЗнч(СбисОснование) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(НовыйИсключение, СбисОснование);
		НовыйИсключение.dump = Неопределено; // dump от ошибки в виде структуры будет data
		
	ИначеЕсли ТипЗнч(СбисОснование) = Тип("Соответствие") Тогда
		
		СвойстваИгнорировать = Saby_СтрРазделить82(СвойстваИсключить,",");
		Для СчетчикСтрокСвойств = 1 ПО СтрЧислоСтрок(КлючиЭкземпляра) Цикл
			
			Свойство = СтрПолучитьСтроку(КлючиЭкземпляра, СчетчикСтрокСвойств);
			Если СвойстваИгнорировать.Найти(Свойство) = Неопределено Тогда
				
				ОбъектSABY_Установить(НовыйИсключение, Свойство, СбисОснование[Свойство]);
				
			КонецЕсли;
			
		КонецЦикла;
		
		НовыйИсключение.dump = Неопределено; // dump от ошибки в виде структуры будет data

	Иначе
		
		// Составной код исключения
		Если	ТипЗнч(СбисОснование) = Тип("Число") 
			И	СбисОснование > 999 Тогда
				
			КодыРазделены = Формат(СбисОснование, "ЧГ=0");
			НовыйИсключение.code	= Число(Лев(СбисОснование, 3));
			НовыйИсключение.extCode = Число(Прав(СбисОснование, 3));
			
		Иначе
			
			НовыйИсключение.code	 = СбисОснование;
			НовыйИсключение.extCode	 = РасширениеКода;
			
		КонецЕсли;
		
		Если		СбисСообщение = Неопределено
			И	Не	НовыйИсключение.code = Неопределено Тогда

			ТекстОшибкиПоДопКоду		= СбисИсключение_СообщениеПоДополнительномуКоду(НовыйИсключение.code, НовыйИсключение.extCode);
			СсылкаНаРешениеОшибки		= СбисИсключение_РешениеПроблемыПоИсключению(НовыйИсключение);
			
			// Оставил для поддержки старой логики в некоторых ошибках
			НовыйИсключение.message     = ТекстОшибкиПоДопКоду;
			
			НовыйИсключение.help = Новый Структура("type, text, action", "url", ТекстОшибкиПоДопКоду, СсылкаНаРешениеОшибки);
			
		Иначе
			
			НовыйИсключение.message		= СбисСообщение;
			
		КонецЕсли;
		НовыйИсключение.details		= СбисДетализация;
		НовыйИсключение.data		= СбисДанные;
		НовыйИсключение.methodName	= СбисИмяКоманды;
		
	КонецЕсли;
	
	Если НовыйИсключение.details = Неопределено Тогда
		
		НовыйИсключение.details = НовыйИсключение.message;
		
	КонецЕсли;
	
	Если НовыйИсключение.stack = Неопределено Тогда
		
		НовыйИсключение.stack = Новый Массив;
		
	КонецЕсли;
	
	Возврат НовыйИсключение;

КонецФункции

//DynamicDirective

Процедура СбисИсключение_ДобавитьВСтек(СбисИсключение, ИсключениеДобавить)
	Перем СтарыйСбисСтек;
	
	СбисСтек = СбисИсключение.stack;
	СбисСтек.Вставить(0, яСбисИсключение_СтатичныйМетод_ЗаписьВСтек(ИсключениеДобавить));
	Если	ИсключениеДобавить.Свойство("stack", СтарыйСбисСтек)
		И	ЗначениеЗаполнено(СтарыйСбисСтек) Тогда
		
		// Пробросить в конец элементы от старого стека
		Для Каждого ЭлементСтарогоСтека Из СтарыйСбисСтек Цикл
			
			СбисСтек.Добавить(яСбисИсключение_СтатичныйМетод_ЗаписьВСтек(ЭлементСтарогоСтека));
			
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры

//DynamicDirective

Функция СбисИсключение_ИзСтроки(СтрокаСбисИсключение, ДопПарамеры = Неопределено) Экспорт 

	#Если НаСервере Тогда
		
		Возврат СбисИсключение_ИзСтрокиСервер(СтрокаСбисИсключение, ДопПарамеры);

	#Иначе
		
		Возврат СбисИсключение_ИзСтрокиВызовСервера(СтрокаСбисИсключение, ДопПарамеры);
		
	#КонецЕсли
	
КонецФункции

//DynamicDirective

Функция СбисИсключение_ПрочитатьJSON(СбисИсключение) 
	
	#Если НаСервере Тогда
		
		Возврат сбисПрочитатьJSON(СбисИсключение);
		
	#Иначе
		
		Возврат СбисРаботаСJSON.сбисПрочитатьJSON(СбисИсключение);
		
	#КонецЕсли
	
КонецФункции

//DynamicDirective

// Функция - генерирует ExtSysException из информации об ошибке
//
// Параметры:
//  ВыбранныйИнформацияОбОшибке	 - ИнформацияОбОшибке	 - вызванное исключение, которое не является запакованным ExtSysException
// 
// Возвращаемое значение:
//  Структура - ExtSysException
//
Функция СбисИсключение_ИнформацияОбОшибке(БазоваяОшибка, ГенерируемоеИсключение)
	
	Если	ТипЗнч(БазоваяОшибка.Описание) = Тип("Строка")
		И	Лев(БазоваяОшибка.Описание, 5) = "{""#""," Тогда
		
		Попытка
			
			ВосстановленноеИсключение = СбисИсключение_ИзСтроки(БазоваяОшибка.Описание);
			
			Если ЭтоТипСбис(ВосстановленноеИсключение, "СбисИсключение") Тогда
				
				НовоеИсключение = ВосстановленноеИсключение;
				
			Иначе
				
				НовоеИсключение = СбисИсключение_Пустое(ВосстановленноеИсключение);
				
			КонецЕсли;
			
			НовоеИсключение.dump = НовыйДампОшибки(БазоваяОшибка);
			
			Возврат НовоеИсключение;
			
		Исключение
			
			//Это не завёрнутый ExtSysException, дальше разбираем как 1С-ное исключение
		
		КонецПопытки;
			
	КонецЕсли;

    Возврат СбисИсключение_ИнформацияОбОшибке_ЗаполнитьНаОсновании(БазоваяОшибка, ГенерируемоеИсключение);
	
КонецФункции 

//DynamicDirective

// Функция - гадание на кофейной гуще для стартового определения кода, если ловим 1С-ное исключение.
//
// Параметры:
//  СообщениеОбОшибке	 - Строка				 - сообщение ошибки
//  ДетализацияОшибки	 - Строка				 - детализация ошибки
//  ПредполагаемыйКод	 - Число/Неопределено	 - код предполагаемой ошибки, требующий уточнения
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - основной код и расширение
//
Функция СбисИсключение_ОпределитьКодыПоСообщениям(ОснованиеОшибки, ДетализацияДоп = Неопределено, КодДоп = Неопределено, КодНовогоИсключения = 100)
	Перем КодРасширения, ПредполагаемыйСценарий;
	
	Если ЭтоТипСбис(ОснованиеОшибки, "СбисИсключение") Тогда
		
		СообщениеОбОшибке		= ОснованиеОшибки.message;
		ДетализацияОшибки		= ОснованиеОшибки.details;
		ПредполагаемыйКод		= ОснованиеОшибки.code;
		ПредполагаемыйСценарий	= ОснованиеОшибки.extCode;
		
	Иначе
		
		СообщениеОбОшибке = ОснованиеОшибки;
		ДетализацияОшибки = ДетализацияДоп;
		ПредполагаемыйКод = КодДоп;
		
	КонецЕсли;
	
	Если Не ПредполагаемыйСценарий = Неопределено Тогда
		
		// Уже есть код расширения для нового исключения.
		// Вынести нижестоящее гадание по коду и тексту в статичный метод яСбисИсключение_СтатичныйМетод_ОпределитьСценарий.
		// Пока не трогаю. т.к. могут быть конфликты
		
	ИначеЕсли ПредполагаемыйКод = 400 Тогда
		
		КодНовогоИсключения = ПредполагаемыйКод;
		Если Найти(ДетализацияОшибки, "SSL connect error") Тогда
			
			КодНовогоИсключения	= 301;
			КодДоп				= 301;
			КодРасширения		= 101;
			

		ИначеЕсли Найти(ДетализацияОшибки, "Couldn't resolve host name") Тогда
				
			КодНовогоИсключения = 401;
			КодРасширения = 101;
			
		ИначеЕсли Найти(ДетализацияОшибки, "Ошибка установки соединения") Тогда
				
			КодРасширения = 402;
			
		ИначеЕсли Найти(ДетализацияОшибки, "Превышен таймаут")
			Или Найти(ДетализацияОшибки, "Request Timeout") Тогда
				
			КодРасширения = 403; 
			
		КонецЕсли;

	ИначеЕсли ПредполагаемыйКод = 501 Тогда
		
		Если Найти(ДетализацияОшибки, "недостаточно прав") Тогда
		
			КодРасширения = 100;
			
		ИначеЕсли Найти(ДетализацияОшибки, "значение параметра") Тогда
			
			КодНовогоИсключения = 608;
			КодРасширения = 100;
			
		КонецЕсли;
		
	ИначеЕсли ПредполагаемыйКод = 615 Тогда
		
		// Ошибка создания объекта
		Если	Найти(ДетализацияОшибки, "Не найден")
			И	Найти(ДетализацияОшибки, "метод") Тогда
			
			// Упал конструктор описания оповещения
			КодНовогоИсключения	= 624;
			КодРасширения		= 100;
			
		КонецЕсли;

	ИначеЕсли ПредполагаемыйКод = 710 Тогда
		
		Если Найти(СообщениеОбОшибке, "Отсустствуют активные этапы") Тогда
			
			КодНовогоИсключения	= ПредполагаемыйКод;
			КодРасширения		= 101;
			
		КонецЕсли;
		
	ИначеЕсли ПредполагаемыйКод = 719 Тогда
		
		КодНовогоИсключения = ПредполагаемыйКод;
		Если	Найти(ДетализацияОшибки, "отменено") Тогда
			
			КодРасширения		= 104;
			
		КонецЕсли;
		
	ИначеЕсли ПредполагаемыйКод = 747 Тогда
		
		КодНовогоИсключения = ПредполагаемыйКод;
		Если	(	Найти(ДетализацияОшибки, "Отсутствует")
				Или Найти(ДетализацияОшибки, "не удалось получить"))
			И	Найти(ДетализацияОшибки, "ини файл") Тогда
			
			КодРасширения		= 200;
			
		ИначеЕсли Найти(ДетализацияОшибки,"не установлена") Тогда
			
			КодРасширения		= 101;
			
		КонецЕсли;
		
	ИначеЕсли ПредполагаемыйКод = 767 Тогда
		
		Если Найти(ДетализацияОшибки, НСтр("ru = 'Недостаточно прав'"))
			Или Найти(ДетализацияОшибки, НСтр("ru = 'Нарушение прав'")) Тогда
			
			КодНовогоИсключения = ПредполагаемыйКод;
			КодРасширения		= 301;
			
		КонецЕсли;

	ИначеЕсли ПредполагаемыйКод = 770 Тогда
		
		Если Найти(СообщениеОбОшибке, НСтр("ru = 'ЗагрузитьТаблицуСтилейXSLИзСтроки' en = 'LoadXSLStylesheetFromString'")) Тогда
			
			КодНовогоИсключения = ПредполагаемыйКод;
			КодРасширения		= 101;
			
		ИначеЕсли Найти(СообщениеОбОшибке, НСтр("ru = 'Ошибка разбора XML'")) Тогда
			
			КодНовогоИсключения = ПредполагаемыйКод;
			КодРасширения		= 104;
			
		КонецЕсли;	
		
	ИначеЕсли ПредполагаемыйКод = 765 Тогда
		
		Если Найти(ДетализацияОшибки, "СпособСопоставленияНоменклатуры") Тогда
		
			КодНовогоИсключения = ПредполагаемыйКод;
			КодРасширения = 101;
			
		КонецЕсли;
		
	ИначеЕсли ПредполагаемыйКод = 779 Тогда
		
		Если Найти(ДетализацияОшибки, "Значение поля ""Контрагент"" не может быть пустым!") Тогда
		
			КодНовогоИсключения = ПредполагаемыйКод;
			КодРасширения = 301;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если КодРасширения = Неопределено Тогда
		
		Если		Найти(ДетализацияОшибки, "ODBC")
			И	 Не Найти(ДетализацияОшибки, "dbf' уже существует") Тогда
				
			КодНовогоИсключения	= 776;
			КодРасширения		= 101;
			
		ИначеЕсли ДетализацияОшибки = "Не подключен файл статусов DBF." Тогда
			
			КодНовогоИсключения	= 753;
			КодРасширения		= 101;
			
		ИначеЕсли Найти(ДетализацияОшибки, "Недостаточно прав") Тогда
			
			КодНовогоИсключения	= 753;
			Если Найти(ОснованиеОшибки, "(Выполнить)") Тогда
				
				КодРасширения = 101;
				
			КонецЕсли; 
			
		ИначеЕсли Найти(ДетализацияОшибки, "Ошибка доступа к файлу") Тогда
			
			КодНовогоИсключения	= 772;
			Если Найти(ОснованиеОшибки, "СоздатьКаталог") Тогда
				
				КодРасширения = 104;
				
			КонецЕсли;
			
		ИначеЕсли Найти(ДетализацияОшибки, "Не найден контейнер ключа электронной подписи.") Тогда
			
			КодНовогоИсключения	= 731;
			КодРасширения = 110;
			
		ИначеЕсли Найти(ДетализацияОшибки, "Тип не определен") Тогда
			
			КодНовогоИсключения	= 612;
			
		ИначеЕсли Найти(ДетализацияОшибки, "евозможно расшифровать файл") Тогда
	
			КодНовогоИсключения	= 735;
			КодРасширения		= 101;
			
		ИначеЕсли Найти(ДетализацияОшибки, "В файле настроек некорректно указан путь к табличной части документа") Тогда	
			
			КодРасширения = 300;
			
		КонецЕсли;
		
	КонецЕсли;

	Если КодРасширения = Неопределено Тогда
		
		Если		КодНовогоИсключения = 100
			И	Не	ПредполагаемыйКод = 100
			И	Не	ПредполагаемыйКод = Неопределено Тогда
			
			// Не удалось определить код, но при этом предполагаемый код не дефолтный. Установить его как результат
			КодНовогоИсключения = ПредполагаемыйКод;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура("code, extCode", КодНовогоИсключения, КодРасширения);
	
КонецФункции

//DynamicDirective

// Функция - генерирует ExtSysException из информации об ошибке
//
// Параметры:
//  ВыбранныйИнформацияОбОшибке	 - ИнформацияОбОшибке	 - вызванное исключение, которое не является запакованным ExtSysException
// 
// Возвращаемое значение:
//  Структура - ExtSysException
//
Функция СбисИсключение_ИнформацияОбОшибке_ЗаполнитьНаОсновании(БазоваяОшибка, ГенерируемоеИсключение)
	Перем СообщениеОбОшибке;
	
	СложнаяСтруктура = Ложь;
	
	СтруктураОшибкиСообщения = БазоваяОшибка;
	Пока ТипЗнч(СтруктураОшибкиСообщения.Причина) = Тип("ИнформацияОбОшибке") Цикл
		СтруктураОшибкиСообщения = СтруктураОшибкиСообщения.Причина;
		СложнаяСтруктура = Истина;
	КонецЦикла;
	
	Если СложнаяСтруктура Тогда
		
		СообщениеОбОшибке	= БазоваяОшибка.Описание;
		ДетализацияОшибки	= СтруктураОшибкиСообщения.Описание;
		
	ИначеЕсли БазоваяОшибка.Причина = Неопределено Тогда
		
		ДетализацияОшибки	= БазоваяОшибка.Описание;
		
	Иначе
		
		СообщениеОбОшибке	= БазоваяОшибка.Описание;
		ДетализацияОшибки	= БазоваяОшибка.Причина;
		
	КонецЕсли;
	
	// Так как тут упало в 1С-ное ИнформацияОбОшибке, то проводим анализ, где кодом по-умолчанию будет 600 - Неизвестная ошибка приложения 
	КодыНовогоИсключения = СбисИсключение_ОпределитьКодыПоСообщениям(СообщениеОбОшибке, ДетализацияОшибки, ГенерируемоеИсключение.code, 600);
	
	Если    Не КодыНовогоИсключения.code = 600
		И	Не КодыНовогоИсключения.code = ГенерируемоеИсключение.code Тогда
		
		// По предполагаемой ошибке смогли подобрать другой код на основании Информации об ошибке 1С.
		ГенерируемоеИсключение.stack.Добавить(яСбисИсключение_СтатичныйМетод_ЗаписьВСтек(ГенерируемоеИсключение));
		ГенерируемоеИсключение.code		= Неопределено;
		ГенерируемоеИсключение.message	= Неопределено;
		
	ИначеЕсли ЗначениеЗаполнено(КодыНовогоИсключения.extCode) Тогда
		
		// Сообщение должно быть установлено по кодам
		СообщениеОбОшибке = Неопределено;   
	
	ИначеЕсли	КодыНовогоИсключения.code = 776 Тогда
		
		СообщениеОбОшибке = ДетализацияОшибки;
		
	ИначеЕсли	КодыНовогоИсключения.code	= 717 Тогда
		
		ДетализацияОшибки	= СообщениеОбОшибке + " " + ДетализацияОшибки;
		СообщениеОбОшибке	= Неопределено;	
		
	КонецЕсли;

	СбисОсновнаяОшибка = СбисИсключение_Пустое(	КодыНовогоИсключения.code, СообщениеОбОшибке, ДетализацияОшибки,
												БазоваяОшибка.ИмяМодуля,, КодыНовогоИсключения.extCode);
												
	СбисОсновнаяОшибка.dump	= НовыйДампОшибки(БазоваяОшибка, ДетализацияОшибки);
	СбисОсновнаяОшибка.help	= СбисИсключение_РешениеПроблемыПоИсключению(СбисОсновнаяОшибка);												
	Если ЗначениеЗаполнено(КодыНовогоИсключения.extCode) Тогда
		
		СбисОсновнаяОшибка.message	= СбисИсключение_ТекстСообщения(СбисОсновнаяОшибка);
		
	КонецЕсли;
	
	Возврат СбисОсновнаяОшибка;
	
КонецФункции
	
//DynamicDirective

Функция СбисИсключение_ТекстСообщения(СбисИсключение)
	
	Если ЗначениеЗаполнено(СбисИсключение.extCode) Тогда
		
		Возврат СбисИсключение_СообщениеПоДополнительномуКоду(СбисИсключение.code, СбисИсключение.extCode);
		
	КонецЕсли;
	
	Возврат СбисИсключение_СообщениеПоКоду(СбисИсключение.code);
	
КонецФункции

//DynamicDirective

// Функция - возвращает текст сообщения по коду https://wiki.razgovorov.ru/index.php/Коды_ошибок 
//
// Параметры:
//  СбисКодОшибки	 - Число	 - код ошибки
// 
// Возвращаемое значение:
//  Строка - текст ошибки по коду
//
Функция СбисИсключение_СообщениеПоКоду(СбисКодОшибки) Экспорт
	Если		СбисКодОшибки = 100 Тогда
		Возврат "Неизвестная ошибка системы";
	ИначеЕсли	СбисКодОшибки = 300 Тогда
		Возврат "Неизвестная ошибка БЛ";
	ИначеЕсли	СбисКодОшибки = 301 Тогда
		Возврат "Сервис Saby.Диск временно недоступен"; 
	ИначеЕсли	СбисКодОшибки = 302 Тогда
		Возврат "Сайт на техническом обслуживании. Повторите попытку позднее";  
	ИначеЕсли	СбисКодОшибки = 303 Тогда	
		Возврат "Аутентификация не выполнена. Требуется подтверждение действия";
	ИначеЕсли	СбисКодОшибки = 304 Тогда
		Возврат "Фатальная ошибка при аутентификации";
	ИначеЕсли	СбисКодОшибки = 305 Тогда
		Возврат "Аутентификация не выполнена. Неправильные логин/пароль.";
	ИначеЕсли   СбисКодОшибки = 306 Тогда
		Возврат "Ошибка прав доступа БЛ";
	ИначеЕсли	СбисКодОшибки = 310 Тогда
		Возврат "Фатальная ошибка входных параметров";
	ИначеЕсли	СбисКодОшибки = 315 Тогда
		Возврат "Фатальная ошибка криптографии";
	ИначеЕсли	СбисКодОшибки = 320 Тогда
		Возврат "Фатальная ошибка модуля работы с формализованными документами";
	ИначеЕсли 	СбисКодОшибки = 325 Тогда
		Возврат "Фатальная ошибка запуска в документооборот"; 
	ИначеЕсли 	СбисКодОшибки = 330 Тогда
		Возврат "Фатальная ошибка поиска абонентского ящика";
	ИначеЕсли 	СбисКодОшибки = 335 Тогда
		Возврат "Фатальная ошибка лицензирования";
	ИначеЕсли 	СбисКодОшибки = 340 Тогда
		Возврат "Фатальная ошибка ФЛК.";
	ИначеЕсли 	СбисКодОшибки = 346 Тогда
		Возврат "Невозможно выполнить преобразование."; 
	ИначеЕсли 	СбисКодОшибки = 350 Тогда
		Возврат "Неизвестная нефатальная ошибка БЛ";
	ИначеЕсли 	СбисКодОшибки = 355 Тогда
		Возврат "Неизвестная ошибка внутреннего сервиса";	
	ИначеЕсли 	СбисКодОшибки = 356 Тогда
		Возврат "Запрос обрабатывается. Повторите позже";
	ИначеЕсли 	СбисКодОшибки = 357 Тогда
		Возврат "Нефатальная ошибка аутентификации.";
	ИначеЕсли	СбисКодОшибки = 400 Тогда
		Возврат "Неизвестная ошибка транспорта";
    ИначеЕсли	СбисКодОшибки = 401 Тогда
        Возврат "Отсутствует подключение к сети";
	ИначеЕсли	СбисКодОшибки = 412 Тогда
		Возврат	"Не включен обмен с SABY";
	ИначеЕсли	СбисКодОшибки = 409 Тогда
		Возврат "Сеанс с учетной системой завершен";
	ИначеЕсли	СбисКодОшибки = 500 Тогда
		Возврат "Неизвестная ошибка окружения";
	ИначеЕсли	СбисКодОшибки = 502 Тогда
		Возврат "Ошибка записи информационной системы";
	ИначеЕсли	СбисКодОшибки = 510 Тогда
		Возврат "Неподдерживаемое окружение";
	ИначеЕсли	СбисКодОшибки = 600 Тогда
		Возврат "Неизвестная ошибка приложения";
	ИначеЕсли	СбисКодОшибки = 604 Тогда
		Возврат "Ошибка получения данных из ИС";
	ИначеЕсли	СбисКодОшибки = 608 Тогда
		Возврат "Некорректное описание параметра в файле настроек";
	ИначеЕсли	СбисКодОшибки = 610 Тогда
		Возврат "Отсутствует файл настроек для данного типа данных";		
	ИначеЕсли	СбисКодОшибки = 612 Тогда
		Возврат "Не удалось определить тип ИС";		
	ИначеЕсли	СбисКодОшибки = 615 Тогда
		Возврат "Ошибка создания объекта";		
	ИначеЕсли	СбисКодОшибки = 616 Тогда
		Возврат "Ошибка записи";		
	ИначеЕсли	СбисКодОшибки = 623 Тогда
		Возврат "Ошибка обработки объекта";		
	ИначеЕсли	СбисКодОшибки = 678 Тогда
		Возврат "Ошибка подключаемого модуля";
	ИначеЕсли	СбисКодОшибки = 679 Тогда
		Возврат "Объект не найден";
	ИначеЕсли	СбисКодОшибки = 700 Тогда
		Возврат "Неизвестная ошибка подключения";
	ИначеЕсли 	СбисКодОшибки = 702 Тогда
		Возврат "Неверно указано имя пользователя или пароль";
	ИначеЕсли	СбисКодОшибки = 703 Тогда
		Возврат "Ошибка создания подключения к ИС";
	ИначеЕсли	СбисКодОшибки = 709 Тогда
		Возврат "Ошибка в ограничении доступа к данным";
	ИначеЕсли	СбисКодОшибки = 710 Тогда
		Возврат "Ошибка блокировки данных";
	ИначеЕсли	СбисКодОшибки = 717 Тогда
		Возврат "Несовместимая версия файла базы данных";
	ИначеЕсли	СбисКодОшибки = 718 Тогда
		Возврат "Ошибка выполнения действия с документом";
	ИначеЕсли	СбисКодОшибки = 719 Тогда
		Возврат "Ошибка интерфейса";
	ИначеЕсли	СбисКодОшибки = 721 Тогда
		Возврат "Неверно указан ИНН";
	ИначеЕсли	СбисКодОшибки = 723 Тогда
		Возврат "Ошибка обработки объекта";
	ИначеЕсли	СбисКодОшибки = 724 Тогда
		Возврат "Организация неопределена";
	ИначеЕсли	СбисКодОшибки = 726 Тогда
		Возврат "Вложения неопределены";
	ИначеЕсли	СбисКодОшибки = 729 Тогда
		Возврат "Ошибка ФЛК";
	ИначеЕсли	СбисКодОшибки = 735 Тогда
		Возврат "Данная операция недоступна";
	ИначеЕсли	СбисКодОшибки = 744 Тогда
		Возврат "Ошибка записи или чтения 1С";
	ИначеЕсли	СбисКодОшибки = 746 Тогда
		Возврат "Ошибка HTTP соединения";
	ИначеЕсли	СбисКодОшибки = 747 Тогда
		Возврат "Ошибка файлов настроек";
	ИначеЕсли	СбисКодОшибки = 755 Тогда
		Возврат "Не найден сертификат ЭП";
	ИначеЕсли	СбисКодОшибки = 756 Тогда
		Возврат "Подключение недоступно";
	ИначеЕсли	СбисКодОшибки = 759 Тогда
		Возврат "Невозможно соединиться с удаленным сервером";
	ИначеЕсли	СбисКодОшибки = 760 Тогда
		Возврат "Неверные параметры фильтра";
	ИначеЕсли	СбисКодОшибки = 762 Тогда
		Возврат "Версия системы не поддерживается";
	ИначеЕсли	СбисКодОшибки = 765 Тогда
		Возврат "Значение не найдено в таблице настроек";
	ИначеЕсли	СбисКодОшибки = 767 Тогда
		Возврат "Ошибка при создании объекта";
	ИначеЕсли	СбисКодОшибки = 770 Тогда
		Возврат "Ошибка XSLT";
	ИначеЕсли	СбисКодОшибки = 772 Тогда
		Возврат "Ошибка работы с файловой системой";
	ИначеЕсли	СбисКодОшибки = 773 Тогда
		Возврат "Неизвестная ошибка при выполнении метода";	
	ИначеЕсли	СбисКодОшибки = 775 Тогда
		Возврат "Ошибка транспорта";	
	ИначеЕсли	СбисКодОшибки = 776 Тогда
		Возврат "Запуск программы/функции/метода не удался";	
	ИначеЕсли	СбисКодОшибки = 779 Тогда
		Возврат "Не найден объект";	
	ИначеЕсли	СбисКодОшибки = 780 Тогда
		Возврат "Не заполнено обязательное поле";
	ИначеЕсли 	СбисКодОшибки = 784 Тогда
		Возврат "Ошибка в настройках соединения";
	ИначеЕсли 	СбисКодОшибки = 785 Тогда
		Возврат "Ошибка во входящих данных";
	ИначеЕсли	СбисКодОшибки = 790 Тогда
		Возврат "Обработка прервана пользователем"
	КонецЕсли;
	Возврат "Неизвестная ошибка системы";
КонецФункции

//DynamicDirective

Функция СбисИсключение_СообщениеПоДополнительномуКоду(ОсновнойКодОшибки, ДополнительныйКодОшибки) Экспорт
	
	Если ОсновнойКодОшибки = 301 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Ошибка работы с защищенным соединением.";
		
		КонецЕсли;

	ИначеЕсли ОсновнойКодОшибки = 304 Тогда
		
		Если ДополнительныйКодОшибки = 103 Тогда
			
			Возврат "Пользователь не авторизован";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 306 Тогда
		
		Если ДополнительныйКодОшибки = 103 Тогда
			
			Возврат "У вас нет прав на создание документов требуемого типа. Настройте их в личном кабинете Saby по инструкции";
			
		ИначеЕсли ДополнительныйКодОшибки = 302 Тогда
			
			Возврат "Недостаточно прав для работы с документами";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 325 Тогда
        
		Если ДополнительныйКодОшибки = 401 Тогда
            
			Возврат "В документе есть маркированные товары без кодов.";
			
		ИначеЕсли ДополнительныйКодОшибки = 201 Тогда
            
			Возврат "Указанный идентификатор абонентского ящика не соответствует ИНН.";
			
		ИначеЕсли ДополнительныйКодОшибки = 150 Тогда
            
			Возврат "Ошибка создания редакции документа.";
        
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 401 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
            
			Возврат "Наш сервис обновляется";
			
		КонецЕсли;
		          
	ИначеЕсли ОсновнойКодОшибки = 400 Тогда
        
		Если ДополнительныйКодОшибки = 402 Тогда
            
			Возврат "Отсутствует соединение";
			
		ИначеЕсли ДополнительныйКодОшибки = 403 Тогда
            
			Возврат "Истекло время ожидания запроса";
        
		КонецЕсли;
	
	ИначеЕсли ОсновнойКодОшибки = 412 Тогда
		
		Если ДополнительныйКодОшибки = 100 Тогда
			
			Возврат "Не удалось запустить приложение Saby";
			
		ИначеЕсли ДополнительныйКодОшибки = 101 Тогда	
			
			Возврат "Работа приложения Saby была остановлена";
			
		КонецЕсли;
	
	ИначеЕсли ОсновнойКодОшибки = 502 Тогда
		
		Если ДополнительныйКодОшибки = 100 Тогда
			
			Возврат "Недостаточно прав для записи данных";
						
		КонецЕсли;

	ИначеЕсли ОсновнойКодОшибки = 510 Тогда
		
		Если ДополнительныйКодОшибки = 100 Тогда
			
			Возврат "Операционная система не поддерживается";
			
		ИначеЕсли ДополнительныйКодОшибки = 701 Тогда	
			
			Возврат "Отсутствуют ИД интеграции и ИД подключения";
			
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 608 Тогда
		
		Если ДополнительныйКодОшибки = 100 Тогда
			
			Возврат "Недостаточно параметров для вызова запроса 1С";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 615 Тогда
		
		Если ДополнительныйКодОшибки = 200 Тогда
			
			Возврат "Вложение SABY не сформировано";
			
		ИначеЕсли ДополнительныйКодОшибки = 201 Тогда
			
			Возврат "Конверт не сформирован";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 616 Тогда
		
		Если ДополнительныйКодОшибки = 301 Тогда
			
			Возврат "Ошибка записи параметров SABY";
			
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 678 Тогда

		Если ДополнительныйКодОшибки = 10 Тогда
		
			Возврат "Ошибка запуска стороннего приложения";
		
		ИначеЕсли ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Ошибка вызова пользовательской обработки";
		
		КонецЕсли;

	ИначеЕсли ОсновнойКодОшибки = 703 Тогда
		
		Если ДополнительныйКодОшибки = 102 Тогда
			
			Возврат "Возникла проблема при работе с COM-объектом «ADODB.Connection";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 709 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Недостаточно прав для записи объекта";
		
		КонецЕсли;
			
	
	ИначеЕсли ОсновнойКодОшибки = 710 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Отсустствуют активные этапы для запуска в документооборот";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 711 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Версия SABY Plugin не поддерживается";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 715 Тогда
		
		Если ДополнительныйКодОшибки = 103 Тогда
			
			Возврат "Вложение неопределено";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 717 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Ошибка подключения файла статусов DBF.";
		
		КонецЕсли;

	ИначеЕсли ОсновнойКодОшибки = 718 Тогда
		
		Если ДополнительныйКодОшибки = 103 Тогда
			
			Возврат "Не удалось найти регламент документа";
		
		КонецЕсли;

	ИначеЕсли ОсновнойКодОшибки = 719 Тогда
		
		Если ДополнительныйКодОшибки = 104 Тогда
			
			Возврат "Действие отменено";
			
		ИначеЕсли ДополнительныйКодОшибки = 103 Тогда
			
			Возврат "Действие не требуется";
			
		ИначеЕсли ДополнительныйКодОшибки = 102 Тогда
			
			Возврат "Действие заблокировано";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 723 Тогда
		
		Если ДополнительныйКодОшибки = 300 Тогда
			
			Возврат "В файле настроек некорректно указан путь к табличной части документа";
			
		ИначеЕсли ДополнительныйКодОшибки = 301 Тогда
			
			Возврат "Отсутствует документ основание";
			
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 731 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Не найден подходящий сертификат ЭП";
			
		ИначеЕсли ДополнительныйКодОшибки = 102 Тогда
			
			Возврат "Ошибка в настройках локального подписания";
			
		ИначеЕсли ДополнительныйКодОшибки = 110 Тогда
			
			Возврат "Не удалось загрузить сертификат из контейнера";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 735 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Работа с зашифрованными файлами не поддерживается на текущем способе обмена.";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 746 Тогда
		
		Если ДополнительныйКодОшибки = 002 Тогда
			
			Возврат "Наш сервис обновляется. Попробуйте повторить позже.";
			
		ИначеЕсли ДополнительныйКодОшибки = 404 Тогда
			
			Возврат "Запрашиваемый ресурс не найден";
			
		ИначеЕсли ДополнительныйКодОшибки = 503
			Или ДополнительныйКодОшибки = 502 Тогда
			
			Возврат "Сервис не доступен";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 747 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Для документа отсутствует настройка";
			
		ИначеЕсли ДополнительныйКодОшибки = 200 Тогда
			
			Возврат "Отсутствует ини файл";
		
		КонецЕсли;

	ИначеЕсли ОсновнойКодОшибки = 753 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Недостаточно прав для выполнения запроса.";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 760 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Список сертификатов пуст";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 767 Тогда
		
		Если ДополнительныйКодОшибки = 301 Тогда
			
			Возврат "Ошибка создания дополнительных свойств";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 770 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Не удалось загрузить описание преобразования XSL из строки.";
			
		ИначеЕсли ДополнительныйКодОшибки = 103 Тогда
			
			Возврат "Не удалось выполнить преобразования XSL";
			
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 772 Тогда
		
		Если ДополнительныйКодОшибки = 102 Тогда
			
			Возврат "Ошибка работы с файловой системой";
			
		ИначеЕсли ДополнительныйКодОшибки = 104 Тогда
			
			Возврат "Недостаточно прав для доступа к каталогу или файлу";
		
		КонецЕсли;

	ИначеЕсли ОсновнойКодОшибки = 775 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Не получен ответ от плагина";
		
		ИначеЕсли ДополнительныйКодОшибки = 102 Тогда
			
			Возврат "Не включен обмен с SABY.";
		
		КонецЕсли;

	ИначеЕсли ОсновнойКодОшибки = 765 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Ошибка установки пользовательского параметра.";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 776 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Возникла проблема при работе с COM-объектом «ADODB.Connection";

		КонецЕсли;		

	ИначеЕсли ОсновнойКодОшибки = 779 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Не удалось прочитать документ. Возможно, что он недоступен для Вашего пользователя, или был удален.";
			
		ИначеЕсли ДополнительныйКодОшибки = 102 Тогда
			
			Возврат "Ошибка отправки черновика. Возможно, документ был сопоставлен некорректно, или был удален.";
			
		ИначеЕсли ДополнительныйКодОшибки = 108 Тогда
			
			Возврат "Архив настроек не найден, не хватает настроек в каталоге или они не обновлены, необходимо скачать файлы xslt";
			
		ИначеЕсли ДополнительныйКодОшибки = 103 Тогда
			
			Возврат "Каталог не найден";
			
		ИначеЕсли ДополнительныйКодОшибки = 201 Тогда
			
			Возврат "Неправильно указана сторона фильтрации";
			
		ИначеЕсли ДополнительныйКодОшибки = 203 Тогда
			
			Возврат "Не найден документ в SABY";
			
		ИначеЕсли ДополнительныйКодОшибки = 204 Тогда
			
			Возврат "Не найдена организация в SABY";
			
		КонецЕсли;
				
	КонецЕсли;
	
	Возврат СбисИсключение_СообщениеПоКоду(ОсновнойКодОшибки);
	
КонецФункции

//DynamicDirective

// Функция - возвращает код ошибки https://wiki.razgovorov.ru/index.php/Коды_ошибок по https://saby.ru/help/integration/api/error_code
//
// Параметры:
//  СбисКодОшибки	 - Строка	 - код ошибки Warning
// 
// Возвращаемое значение:
//  Число - коду ошибки
//
Функция СбисИсключение_КодПоAPIСБИС(КодApiSBIS) Экспорт

	КодApiSBIS_Полный	= ВРег(КодApiSBIS);
	КодApiSBIS_33		= Лев(КодApiSBIS_Полный, 33);
	КодApiSBIS_28		= Лев(КодApiSBIS_Полный, 28);
	

	Если КодApiSBIS_Полный = "{В-0000-1AA0000F1002}" Тогда
		Возврат 710;   
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000001002}" Тогда
		Возврат 303; 
	ИначеЕсли	КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000001000}" Тогда
		Возврат 304;
	ИначеЕсли	КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000001001}" Тогда
		Возврат 305;
    ИначеЕсли	КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000120001}" Тогда
        Возврат 325401;
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA0000A0001}" Тогда
		Возврат 346; 
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1AA0000F1002}" Тогда
		Возврат 356; 
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1AA000001000}" Тогда
		Возврат 357;
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1AA000010000}" Тогда
		Возврат 746002;
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA0000E0003}" Тогда
		Возврат 306103;
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000010007}" Тогда
		Возврат 779203;
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA0000E0000}" Тогда
		Возврат 306302;
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000010000}" Тогда
		Возврат 779204;
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000070000}" Тогда
		Возврат 779201;
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000060000}" Тогда
		Возврат 325150;
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000080000}" Тогда
		Возврат 325201;
		

	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA00001" Тогда
		Возврат 310;
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA00002" Тогда
		Возврат 315;
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA00003" Тогда
		Возврат 320;
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA00004" Тогда
		Возврат 325; 
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA00008" Тогда
		Возврат 330;
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA0000D" Тогда
		Возврат 335;
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA0000F" Тогда
		Возврат 340;
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1AA00001" Тогда
		Возврат 355;	
	ИначеЕсли   КодApiSBIS_28 = "{00000000-0000-0000-0000-1AA" Тогда
		Возврат 350; 		
	Иначе
		Возврат 100;
	КонецЕсли;
КонецФункции
	
//DynamicDirective

// Функция - генерирует ExtSysException из информации об ошибке
//
// Параметры:
//  ВыбранныйИнформацияОбОшибке	 - ИнформацияОбОшибке	 - вызванное исключение, которое не является запакованным ExtSysException
// 
// Возвращаемое значение:
//  Структура - ExtSysException
//
Функция СбисИсключение_РешениеПроблемыПоИсключению(СбисИсключение)
	
	Если СбисИсключение.code = 301 Тогда
		
		Если СбисИсключение.extCode  = 101 Тогда
			
			Возврат "https://saby.ru/help/integration/1C_set/modul/typical_errors/internet_error";
			
		КонецЕсли; 
		
	ИначеЕсли СбисИсключение.code = 306 Тогда
		
		Если СбисИсключение.extCode  = 101 Тогда
			
			Возврат "https://online.sbis.ru/article/8d3fc255-3db6-4f0f-8dcc-119dd9d233ca/a90c74a8-cf82-4d6f-9141-f0090c8aa482";
			
		ИначеЕсли СбисИсключение.extCode  = 103 Тогда
			
			Возврат "https://online.sbis.ru/article/f3817cb5-02be-4c93-95ac-ef7caa3efea7/e50b4023-d32e-4b69-b7fe-243f87e9aafc";
			
		ИначеЕсли СбисИсключение.extCode  = 302 Тогда
			
			Возврат "https://online.sbis.ru/article/f3817cb5-02be-4c93-95ac-ef7caa3efea7/1d9d5639-2df1-45d1-9630-01030f0d8879";
			
		КонецЕсли; 
		                                     		
	ИначеЕсли СбисИсключение.code = 310 Тогда
		
		Если СбисИсключение.extCode  = 75 Тогда
			
			Возврат "https://saby.ru/help/data_exchange/marking/start/nastr?tb=tab2";
			
		КонецЕсли;
		
	ИначеЕсли СбисИсключение.code = 325 Тогда
		
		Если СбисИсключение.extCode  = 150 Тогда
			
			Возврат "https://saby.ru/help/integration/1C_set/modul/resend";
			
		ИначеЕсли СбисИсключение.extCode  = 201 Тогда
			
			Возврат "https://link.sbis.ru/article/f3817cb5-02be-4c93-95ac-ef7caa3efea7/e85c917b-53bc-4d78-98c0-6cecaa7e1258";
			
		КонецЕсли;
	
	ИначеЕсли СбисИсключение.code = 502 Тогда
		
		Если СбисИсключение.extCode  = 100 Тогда
			
			Возврат "https://saby.ru/help/integration/1C_set/modul/rights";
			
		КонецЕсли;	
		
	ИначеЕсли СбисИсключение.code = 703 Тогда
		
		Если СбисИсключение.extCode  = 102 Тогда
			
			Возврат "https://saby.ru/help/integration/catalog/driver_not_found";
			
		КонецЕсли;
		
	ИначеЕсли СбисИсключение.code = 709 Тогда
		
		Если СбисИсключение.extCode  = 101 Тогда
			
			Возврат "https://saby.ru/help/integration/1C_set/modul/rights";
			
		КонецЕсли;
		
	ИначеЕсли СбисИсключение.code = 711 Тогда
		
		Если СбисИсключение.extCode  = 101 Тогда
			
			Возврат "https://saby.ru/help/plugin/sbis3plugin/install";
			
		КонецЕсли;
		
	ИначеЕсли СбисИсключение.code = 731 Тогда
                                                        
		Если СбисИсключение.extCode = 102 Тогда
			
			Возврат "https://saby.ru/help/integration/1C_set/modul/local_vo";
			
		ИначеЕсли СбисИсключение.extCode = 101 Тогда
			
			Возврат "https://online.sbis.ru/article/f3817cb5-02be-4c93-95ac-ef7caa3efea7/0d7c6671-13af-488c-8aec-c4db3bd5bc06";
			
		КонецЕсли;
		
	ИначеЕсли СбисИсключение.code = 735 Тогда

		Если	СбисИсключение.extCode = 101 Тогда
			
			Возврат "https://saby.ru/help/integration/1C_set/modul/exchange";
			
		КонецЕсли; 
		
	ИначеЕсли СбисИсключение.code = 747 Тогда

		Если	СбисИсключение.extCode = 101 Тогда
			
			Возврат "https://online.sbis.ru/article/f3817cb5-02be-4c93-95ac-ef7caa3efea7/0df8c1b2-fecd-4583-8635-e258594465d5";
			
		КонецЕсли;
		
	ИначеЕсли СбисИсключение.code = 760 Тогда

		Если	СбисИсключение.extCode = 101 Тогда
			
			Возврат "https://saby.ru/help/integration/1C_set/modul/typical_errors/cert_not_found_vo";
			
		КонецЕсли;
				
	ИначеЕсли СбисИсключение.code = 770 Тогда

		Если	СбисИсключение.extCode = 103 Тогда
			
			Возврат "https://online.sbis.ru/article/8a37d386-6b03-4aa6-969a-51b4bcbe6277/d82ac9ec-1169-4027-9582-66abf8b2d60b";
			
		КонецЕсли;
		
	ИначеЕсли СбисИсключение.code = 772 Тогда

		Если	СбисИсключение.extCode = 102 Тогда
			
			Возврат "https://online.sbis.ru/article/f3817cb5-02be-4c93-95ac-ef7caa3efea7/0f6f72b7-d5d8-4893-a226-cde0e415c3c0";
			
		ИначеЕсли СбисИсключение.extCode = 104 Тогда
			
			Возврат "https://saby.ru/help/integration/1C_set/modul/check_catalog";
			
		КонецЕсли;
		
	ИначеЕсли СбисИсключение.code = 773 Тогда
		
		Если СбисИсключение.extCode  = 101 Тогда
			
			Возврат "https://saby.ru/help/integration/1C_set/modul/rights";
			
		КонецЕсли;
		
	ИначеЕсли СбисИсключение.code = 775 Тогда
		
		Если СбисИсключение.extCode  = 101 Тогда
			
			Возврат "https://saby.ru/help/integration/1C_set/modul/typical_errors/plugin_answer";
			
		КонецЕсли;

	ИначеЕсли СбисИсключение.code = 776 Тогда
		
		Если	СбисИсключение.extCode = 101 Тогда
			
			Возврат "https://saby.ru/help/integration/catalog/driver_not_found";
			
		КонецЕсли;
		
	ИначеЕсли СбисИсключение.code = 775 Тогда
		
		Если	СбисИсключение.extCode = 102 Тогда
			
			Возврат "https://online.saby.ru/reg/?check=ExtSDK";
			
		КонецЕсли;
		
	ИначеЕсли СбисИсключение.code = 779 Тогда
		                                                     
		Если	СбисИсключение.extCode = 301
			Или СбисИсключение.extCode = 201 Тогда
			
			Возврат "https://online.sbis.ru/article/f3817cb5-02be-4c93-95ac-ef7caa3efea7/a79d02b8-c289-4b48-ae9c-f3d69f3409e1";
			
		ИначеЕсли СбисИсключение.extCode = 203 Тогда
			
			Возврат "https://saby.ru/help/integration/1C_set/modul/typical_errors/identerr";
			
		ИначеЕсли СбисИсключение.extCode = 204 Тогда
			
			Возврат "https://link.sbis.ru/article/f3817cb5-02be-4c93-95ac-ef7caa3efea7/803ac165-6efb-40d2-974f-789f60e56a0c";
			
		ИначеЕсли СбисИсключение.extCode = 108 Тогда
			
			Возврат "https://saby.ru/help/integration/1C_set/modul/download";
			
		ИначеЕсли СбисИсключение.extCode = 103 Тогда
			
			Возврат "https://saby.ru/help/integration/1C_set/modul/update_edits";
			
		КонецЕсли;		
	КонецЕсли;
	
КонецФункции

//DynamicDirective

// Функция - генерирует ExtSysException из строки
//
// Параметры:
//  БазоваяОшибка	 - Строка	 - исключение, которое может быть сериализованнйо в JSON строкой, либо просто сообщением.
// 
// Возвращаемое значение:
//  Структура - ExtSysException
//
Функция СбисИсключение_Строка(БазоваяОшибкаВходящая, ГенерируемоеИсключение)
    Перем СтрокаРазбора, ДампОшибки, ДампДетализация, ДампИмяМодуля, ДампНомерСтроки, ДампИсходнаяСтрока, КодОшибкиНаш, ИмяМетодаОшибки;
	
	БазоваяОшибка = БазоваяОшибкаВходящая;
	Если Лев(БазоваяОшибка, 4) = "http" Тогда
		
		КодОшибкиHTTP	= Сред(БазоваяОшибка,5,3);
		КодыОшибок		= СбисИсключение_КодыПоHTTP(КодОшибкиHTTP);
		КодОшибкиНаш	= Число(Строка(КодыОшибок.code) + Строка(КодыОшибок.extcode));
		ИмяМетодаОшибки	= "HTTPСоединение.ОтправитьДляОбработки";
		БазоваяОшибка	= Неопределено;
		
	ИначеЕсли Лев(БазоваяОшибка, 1) = "{" Тогда		
		
		//Это JSON - объект с ошибкой
		СтрокаРазбора = БазоваяОшибка;
		
	ИначеЕсли	Лев(БазоваяОшибка,35) = "callBLObject(): Метод бизнес логики"
		И		Найти(БазоваяОшибка,"вернул ошибку") Тогда
		
		ИмяМодуля		= СтрЗаменить(БазоваяОшибка, "callBLObject(): Метод бизнес логики", Символы.ПС);
		ИмяМодуля		= СтрЗаменить(БазоваяОшибка, "вернул ошибку", Символы.ПС);
		
		//Это ошибка от БЛ в формате JSON
		СтрокаРазбора	= Сред(БазоваяОшибка, Найти(БазоваяОшибка,"{"));
		СтрокаРазбора	= Лев(СтрокаРазбора, СтрДлина(СтрокаРазбора)-1);
		
		ДампДетализация		= Лев(БазоваяОшибка, Найти(БазоваяОшибка,"{") - 1);
		ДампИмяМодуля		= СтрПолучитьСтроку(ИмяМодуля, 2);
		ДампИмяМодуля		= "Saby." + ИмяМодуля;
		ДампИсходнаяСтрока	= "callBLObject(): Метод бизнес логики " + ИмяМодуля + "вернул ошибку";
		ДампОшибки			= НовыйДампОшибки(, ДампДетализация, ДампИсходнаяСтрока,  ДампНомерСтроки, ДампИмяМодуля);
		
		
	ИначеЕсли Найти(БазоваяОшибка, "{""jsonrpc"":") Тогда
		
		//Это ошибка от БЛ в формате JSON
		НачалоТелаСтроки	= Найти(БазоваяОшибка,"{""jsonrpc"":");
		СтрокаРазбора		= Сред(БазоваяОшибка, НачалоТелаСтроки);
		ДампДетализация		= Лев(БазоваяОшибка, НачалоТелаСтроки - 1);
		ДампИсходнаяСтрока	= "{""jsonrpc"":";
		ДампОшибки			= НовыйДампОшибки(, ДампДетализация, ДампИсходнаяСтрока,  ДампНомерСтроки, ДампИмяМодуля);
		
	КонецЕсли;
	
	Если СтрокаРазбора = Неопределено Тогда
		
		//Это сообщение неизвестной ошибки.
		СбисОсновнаяОшибка = СбисИсключение_Пустое(КодОшибкиНаш, БазоваяОшибка,,ИмяМетодаОшибки);
		
	Иначе
		
		Попытка
			
			СбисОшибкаИзJSON = СбисИсключение_ПрочитатьJSON(СтрокаРазбора);
			Если СбисОшибкаИзJSON.Свойство("Error") Тогда
				
				СбисОшибкаИзJSON = СбисОшибкаИзJSON.Error;
				
			КонецЕсли;
			
			Если ЭтоТипСбис(СбисОшибкаИзJSON, "SbisWarning") Тогда
				
				СбисОсновнаяОшибка = СбисИсключение_SbisWarning(СбисОшибкаИзJSON, ГенерируемоеИсключение);
				
			ИначеЕсли СбисОшибкаИзJSON = "Not authorized." Тогда
				
				СбисОсновнаяОшибка = СбисИсключение_Пустое(304103);

			Иначе	
				
				СбисОсновнаяОшибка = СбисИсключение_Пустое(СбисОшибкаИзJSON);
				
			КонецЕсли;	
			
		Исключение
			
			СбисОсновнаяОшибка = СбисИсключение_Пустое(,БазоваяОшибка);
			
		КонецПопытки;
		
	КонецЕсли; 

	СбисОсновнаяОшибка.dump	= ДампОшибки;
	
	Возврат СбисОсновнаяОшибка;
	
КонецФункции	

//DynamicDirective

Функция СбисИсключение_Число(БазоваяОшибка)
	
	СбисОсновнаяОшибка = СбисИсключение_Пустое(БазоваяОшибка);
    Возврат СбисОсновнаяОшибка;
	
КонецФункции

//DynamicDirective

// Функция - генерирует ExtSysException из структуры
//
// Параметры:
//  БазоваяОшибка	 - Строка	 - исключение, которое может быть сериализованнйо в JSON строкой, либо просто сообщением.
// 
// Возвращаемое значение:
//  Структура - ExtSysException
//
Функция СбисИсключение_Структура(БазоваяОшибка, ГенерируемоеИсключение)
    Перем ДампОшибки, ДампДетализация, ДампИмяМодуля, ДампНомерСтроки, ДампИсходнаяСтрока;
	
	Если ЭтоТипСбис(БазоваяОшибка, "СоставПакета") Тогда	
		
		// Оборачивание ошибок типа Документ СБИС. Возможно, вынести в отдельную функцию.
		КодыНовогоИсключения	= СбисИсключение_ОпределитьКодыПоСообщениям(ГенерируемоеИсключение);
		ТекстОшибки				= СбисИсключение_СообщениеПоДополнительномуКоду(КодыНовогоИсключения.code, КодыНовогоИсключения.extCode);
		СбисОсновнаяОшибка		= СбисИсключение_Пустое(КодыНовогоИсключения.code, ТекстОшибки,,,,КодыНовогоИсключения.extCode);
		
	ИначеЕсли	БазоваяОшибка.Свойство("code")
			И	БазоваяОшибка.Свойство("detail") Тогда
			
		// Это ошибка плагина, модуля (ExtSDK2)
		СбисОсновнаяОшибка = СбисИсключение_ExtException(БазоваяОшибка);

	Иначе
		
		СбисОсновнаяОшибка = СбисИсключение_Пустое(БазоваяОшибка);
		
	КонецЕсли;  
	
	СбисОсновнаяОшибка.help	= СбисИсключение_РешениеПроблемыПоИсключению(СбисОсновнаяОшибка);	
	
	Возврат СбисОсновнаяОшибка;
	
КонецФункции 

//DynamicDirective

// Функция - генерирует ExtSysException из структуры
//
// Параметры:
//  БазоваяОшибка
// 
// Возвращаемое значение:
//  Структура - ExtSysException
//
Функция СбисИсключение_ExtException(БазоваяОшибка)
	Перем ДампОшибки, ДампДетализация, ДампИмяМодуля, ДампНомерСтроки, ДампИсходнаяСтрока, КодОшибки;
	
	СбисОсновнаяОшибка = СбисИсключение_Пустое(БазоваяОшибка);
	СбисОсновнаяОшибка.details = БазоваяОшибка.detail;
	ТипЧисла = Новый ОписаниеТипов("Число");
	Если БазоваяОшибка.Свойство("original_error") Тогда
		
		КодОшибки = СбисИсключение_КодПоAPIСБИС("{" + БазоваяОшибка.original_error.classid + "}");
		
		Если Не КодОшибки = 100 Тогда
			СбисОсновнаяОшибка = СбисИсключение_Пустое(КодОшибки,,БазоваяОшибка.detail);
		КонецЕсли;
	КонецЕсли;

	Если БазоваяОшибка.Свойство("dump") Тогда
		
		// Переложить дамп ошибки в data, т.к. для плагина это оно и есть
		ДампОшибки = БазоваяОшибка.dump;
		
		// Если http запрос упал в плагине
		Если БазоваяОшибка.dump.Свойство("data")
			И БазоваяОшибка.dump.data.Свойство("StatusCode") Тогда
			
			СбисОсновнаяОшибка = СбисИсключение_Пустое(ТипЧисла.ПривестиЗначение("746"+Строка(БазоваяОшибка.dump.data.StatusCode)),,БазоваяОшибка.detail);	
			
		КонецЕсли;
		
		Если Не ДампОшибки.Свойство("addinfo") Тогда
			
			// Восстановим структуру ошибки БЛ, которую сломал плагин
			Если БазоваяОшибка.code = 303 Тогда
			
				// Если код ошибки - 303, значит ожидается подтверждение аутентификации.
				addInfo = Новый Структура;
				addInfo.Вставить("Идентификатор",		ДампОшибки.ResourceID);
				addInfo.Вставить("ИдентификаторСессии",	ДампОшибки.SessionID);
				addInfo.Вставить("МетодВалидации",		ДампОшибки.MethodToValidate);
				
				ДампОшибки = Новый Структура("addinfo", addinfo);
				
			//Иначе
			//	
			//	ДампОшибки = Новый Структура("addinfo", ДампОшибки);
			//	
			КонецЕсли;
			
		КонецЕсли;
				
		СбисОсновнаяОшибка.data = ДампОшибки;		
				
	КонецЕсли;
	
	Если БазоваяОшибка.Свойство("method_name") Тогда
		
		СбисОсновнаяОшибка.methodName = БазоваяОшибка.method_name;
		
	КонецЕсли;
	
	// Код - неизвестная ошибка системы
	Если	(	Не	ЗначениеЗаполнено(СбисОсновнаяОшибка.code)
			Или		СбисОсновнаяОшибка.code = 100) Тогда
			
		КодОшибкиСтека = яСбисИсключение_СтатичныйМетод_ИзвлечьКодИзСтекаExtException(БазоваяОшибка);
		
		Если КодОшибкиСтека = 300 Тогда
			
			//http ошибка 
			КодИзDetail = Лев(БазоваяОшибка.detail, 3);
			
			КодОшибкиHTTP = ТипЧисла.ПривестиЗначение(КодИзDetail);
			СбисОсновнаяОшибка = СбисИсключение_Строка("http"+Строка(КодОшибкиHTTP), СбисОсновнаяОшибка);

		ИначеЕсли ТипЗнч(КодОшибкиСтека) = Тип("Число") Тогда
			
			СбисОсновнаяОшибка.code = КодОшибкиСтека;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Не смогли получить КодОшибки из стека подбираем код по тексту из detail
	Если Не БазоваяОшибка.detail = Неопределено Тогда
		
		
		Если Найти(БазоваяОшибка.detail, "заблокирован согласно назначеннным правам") Тогда
			
			СбисОсновнаяОшибка.code = 306;
			СбисОсновнаяОшибка.extcode = 302;
			СбисОсновнаяОшибка.message = "Недостаточно прав для осуществления вызова БЛ";
			СбисОсновнаяОшибка.details = "Метод " + СбисОсновнаяОшибка.methodName + " заблокирован согласно назначенным правам";
			
		ИначеЕсли Найти(БазоваяОшибка.detail, "Не хватает подписи под") Тогда			 
			
			СбисОсновнаяОшибка.code = 731;
			СбисОсновнаяОшибка.extcode = 101;
			СбисОсновнаяОшибка.message = СбисИсключение_СообщениеПоДополнительномуКоду(СбисОсновнаяОшибка.code, СбисОсновнаяОшибка.extcode);
			СбисОсновнаяОшибка.details = "Отсутствует сертификат для утверждения/отклонения пакета документов";
			
		ИначеЕсли Найти(БазоваяОшибка.detail, "зашифрованном виде необходим локальный сертификат") Тогда
			
			СбисОсновнаяОшибка.code = 731;
			СбисОсновнаяОшибка.extcode = 101;
			СбисОсновнаяОшибка.message = СбисИсключение_СообщениеПоДополнительномуКоду(СбисОсновнаяОшибка.code, СбисОсновнаяОшибка.extcode);
			СбисОсновнаяОшибка.details = "Не найден сертификат для шифрования";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СбисОсновнаяОшибка;
	
КонецФункции

//DynamicDirective

Функция СбисИсключение_КодыПоHTTP(КодОшибкиHTTP)
	
	ОписаниеЧисло = Новый ОписаниеТипов("Число");
	КодОшибки = ОписаниеЧисло.ПривестиЗначение(КодОшибкиHTTP);
	КодыОшибки = Новый Структура("code, extcode", 746, КодОшибки);
	
	Если КодОшибки = 401 Тогда
		
		КодыОшибки.code		= 304;
		КодыОшибки.extcode	= 103;		
		
	КонецЕсли;                     
	
	Возврат КодыОшибки;
	
КонецФункции

//DynamicDirective

// Функция - генерирует ExtSysException из структуры
//
// Параметры:
//  БазоваяОшибка			 - SbisWarning		 - исключение в виде структуры, присылаемое БЛ
//  ГенерируемоеИсключение	 - СбисИсключение	 - текущее формируемое исключение
// 
// Возвращаемое значение:
//  СбисИсключение - ExtSysException в виде структуры
//
Функция СбисИсключение_SbisWarning(БазоваяОшибка, ГенерируемоеИсключение)
    Перем ДампОшибки, ДампДетализация, ДампИмяМодуля, ДампНомерСтроки, ДампИсходнаяСтрока;
	
	СбисОсновнаяОшибка			= СбисИсключение_Пустое(БазоваяОшибка);
	СбисОсновнаяОшибка.details	= БазоваяОшибка.message;
	ДампИсходнаяСтрока			= БазоваяОшибка.data.classid;
	ДампИмяМодуля				= "Saby.Warning";
	СбисОсновнаяОшибка.code		= СбисИсключение_КодПоAPIСБИС(ВРег(ДампИсходнаяСтрока)); 
	
	Если	ТипЗнч(СбисОсновнаяОшибка.code) = Тип("Число") 
		И	СбисОсновнаяОшибка.code > 999 Тогда
		
		КодыРазделены = Формат(СбисОсновнаяОшибка.code, "ЧГ=0");
		СбисОсновнаяОшибка.extCode = Число(Прав(СбисОсновнаяОшибка.code, 3));
		СбисОсновнаяОшибка.code	= Число(Лев(СбисОсновнаяОшибка.code, 3)); 
		
		
	КонецЕсли;

	Если	БазоваяОшибка.Свойство("details", ДампДетализация)
		И	Лев(ДампДетализация, "1") = "{"
		И	Прав(ДампДетализация, "1") = "}" Тогда
		
		// Проверить наличие запакованного ExtException.
		ЗапакованныеЗначения = СбисПрочитатьJSON(ДампДетализация);
		Если ЭтоТипСбис(ЗапакованныеЗначения, "ExtException") Тогда
			
			// Не удалось определить ошибку по ClsID БЛ, п
			СбисОсновнаяОшибка.code		= ЗапакованныеЗначения.code;
			СбисОсновнаяОшибка.message	= ЗапакованныеЗначения.message;
			ДампДетализация				= ЗапакованныеЗначения.detail;
			ДампИмяМодуля				= "Integration.ExtException";

			БазоваяОшибка = ЗапакованныеЗначения;
			
		Иначе
			
			Если СбисОсновнаяОшибка.data = Неопределено Тогда
				
				СбисОсновнаяОшибка.data = Новый Структура("addinfo")
				
			КонецЕсли;
			СбисОсновнаяОшибка.data.addinfo = ЗапакованныеЗначения;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если БазоваяОшибка.Свойство("stack") Тогда
		
		СбисОсновнаяОшибка.Вставить("stack", БазоваяОшибка.stack);
		
	КонецЕсли;
	
	СбисОсновнаяОшибка.message = СбисИсключение_СообщениеПоДополнительномуКоду(СбисОсновнаяОшибка.code, СбисОсновнаяОшибка.extcode);
	СбисОсновнаяОшибка.help = СбисИсключение_РешениеПроблемыПоИсключению(СбисОсновнаяОшибка);
	СбисОсновнаяОшибка.dump = НовыйДампОшибки(, ДампДетализация, ДампИсходнаяСтрока, ДампНомерСтроки, ДампИмяМодуля);
		
	Возврат СбисОсновнаяОшибка;
	
КонецФункции

//DynamicDirective
Функция СбисИсключение_Соответствие(БазоваяОшибка)
		
	Источник = БазоваяОшибка; 
	Если Источник["Error"] <> Неопределено Тогда
		
		Источник = БазоваяОшибка["Error"]; 
		
	КонецЕсли;

	СбисОсновнаяОшибка = СбисИсключение_Пустое(Источник); 

	Если СбисОсновнаяОшибка.message = СбисОсновнаяОшибка.details Тогда
		
		Ошибкаdetail = Источник["detail"];
		Если Не Ошибкаdetail = Неопределено Тогда
			
			ОбъектSABY_Установить(СбисОсновнаяОшибка, "details", Ошибкаdetail);
			
		КонецЕсли;

	КонецЕсли;
	
	Возврат СбисОсновнаяОшибка;
	
КонецФункции

// Функция - перегенерирует ошибку на основании ТОЛЬКО входящих параметров, когда базовая ошибка в конструкторе была неопределена
//
// Параметры:
//  БазоваяОшибка	 - СбисИсключение	 - Класс, заполнененный теми параметрами, что пришли на вход в конструктор и которые нужно проверить
// 
// Возвращаемое значение:
//  СбисИсключение - готовое исключение с уточненным сценарием, текстами и ссылкой на решение
//
//DynamicDirective
Функция СбисИсключение_ПоВходнымПараметры(БазоваяОшибка)

	КодыНовогоИсключения	= СбисИсключение_ОпределитьКодыПоСообщениям(БазоваяОшибка.message, БазоваяОшибка.details, БазоваяОшибка.code);
	СбисОсновнаяОшибка		= СбисИсключение_Пустое(КодыНовогоИсключения.code,
													СбисИсключение_СообщениеПоДополнительномуКоду(КодыНовогоИсключения.code, КодыНовогоИсключения.extCode),
													БазоваяОшибка.details,
													БазоваяОшибка.methodName,,КодыНовогоИсключения.extCode);
	СбисОсновнаяОшибка.help	= СбисИсключение_РешениеПроблемыПоИсключению(СбисОсновнаяОшибка);												
	СбисОсновнаяОшибка.dump = НовыйДампОшибки(БазоваяОшибка);
	
	Возврат СбисОсновнаяОшибка;
	
КонецФункции

//DynamicDirective
Функция СбисИсключение_ОшибкаВJSON(БазоваяОшибка) Экспорт

	ТекстОшибкиВJSON = ЗначениеВJSON(БазоваяОшибка);
	
	Возврат ТекстОшибкиВJSON;
	
КонецФункции

#Область include_core2_vo2_МодульОбъекта_КлиентСервер_Классы_СбисИсключение_ПриватныеМетоды
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_КлиентСервер_Классы_СбисИсключение_СтатичныеМетоды
#КонецОбласти

