
//DynamicDirective

// Функция - Конструктор класс описание оповещения с учетом старых ОФ
//
// Параметры: аналогично ОписаниеОповещения
// 
// Возвращаемое значение:
// СбисОписаниеОповещения  - экземпляр класса
//
Функция НовыйСбисОписаниеОповещения(СбисПроцедура, СбисМодуль, СбисДопПараметры = Неопределено, СбисПроцедураИсключения = Неопределено, СбисМодульИсключения = Неопределено) Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Если ГлобальныйКэш().СовместимостьМетодов.Объекты1С.ОписаниеОповещения Тогда
			
			СтрокаВычислить = "Новый ОписаниеОповещения(СбисПроцедура, СбисМодуль, СбисДопПараметры)";
			Если Не СбисПроцедураИсключения = Неопределено Тогда
				
				СбисМодульИсключенияУстановить = СбисМодульИсключения;
				Если СбисМодульИсключенияУстановить = Неопределено Тогда 
					
					СбисМодульИсключенияУстановить = СбисМодуль;
					СтрокаВычислить = СтрЗаменить(СтрокаВычислить, ")", ", СбисПроцедураИсключения, СбисМодульИсключенияУстановить)");
					
				КонецЕсли;
				
			КонецЕсли;
			//Вычислить для маскировки от синтаксиса
			Попытка
				
				ОписаниеОповещенияРезультат = Вычислить(СтрокаВычислить);
				
			Исключение
				
				ДанныеОшибки = Новый Структура("Метод", СбисПроцедура);
				ОшибкаСозданияОбъекта = НовыйСбисИсключение(	ИнформацияОбОшибке(),
																МодульОбъектаКлиентСервер_Представление() + "Новый_ОписаниеОповещения",
																615,
																"Ошибка вызова конструктора ""ОписаниеОповещения""",
																,ДанныеОшибки);
				ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаСозданияОбъекта);
				
			КонецПопытки;
			
		Иначе
			
			ОписаниеОповещенияРезультат = _СбисОписаниеОповещения_СоздатьСтруктуру(СбисПроцедура, СбисМодуль, СбисДопПараметры, СбисПроцедураИсключения, СбисМодульИсключения);
			
		КонецЕсли;
		
	#ИначеЕсли НаКлиенте Тогда
		
		Если СбисПроцедураИсключения = Неопределено Тогда
			
			Попытка
				
				ОписаниеОповещенияРезультат = Новый ОписаниеОповещения(СбисПроцедура, СбисМодуль, СбисДопПараметры);
				
			Исключение
				
				ДанныеОшибки = Новый Структура("Метод", СбисПроцедура);
				ОшибкаСозданияОбъекта = НовыйСбисИсключение(	ИнформацияОбОшибке(),
																МодульОбъектаКлиентСервер_Представление() + "Новый_ОписаниеОповещения",
																615,
																"Ошибка вызова конструктора ""ОписаниеОповещения""",
																,ДанныеОшибки);
				ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаСозданияОбъекта);
				
			КонецПопытки;
			
		Иначе
			
			СбисМодульИсключенияУстановить = СбисМодульИсключения;
			Если СбисМодульИсключенияУстановить = Неопределено Тогда 
				
				СбисМодульИсключенияУстановить = СбисМодуль;
				
			КонецЕсли;
			
			Попытка
				
				ОписаниеОповещенияРезультат = Новый ОписаниеОповещения(СбисПроцедура, СбисМодуль, СбисДопПараметры, СбисПроцедураИсключения, СбисМодульИсключенияУстановить);
				
			Исключение
				
				ДанныеОшибки = Новый Структура("Метод", СбисПроцедура);
				ОшибкаСозданияОбъекта = НовыйСбисИсключение(	ИнформацияОбОшибке(),
																МодульОбъектаКлиентСервер_Представление() + "Новый_ОписаниеОповещения",
																615,
																"Ошибка вызова конструктора ""ОписаниеОповещения""",
																,ДанныеОшибки);
				ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаСозданияОбъекта);
				
			КонецПопытки;
			
		КонецЕсли;
		
	#Иначе
		
		ОписаниеОповещенияРезультат = _СбисОписаниеОповещения_СоздатьСтруктуру(СбисПроцедура, СбисМодуль, СбисДопПараметры, СбисПроцедураИсключения, СбисМодульИсключения);
		
	#КонецЕсли
	
	Возврат ОписаниеОповещенияРезультат;
	
КонецФункции

//DynamicDirective

// Процедура - Выполняет описание оповещения.
//	Обработка результата функций через Возврат не поддерживается. 
//	Для получения результата требуется проброска в ДополнительныеПараметры ОписанияОповещения тега Результат с заполнением в обработчике
//
// Параметры:
//  РезультатВызова			 - Произвольный				- первый аргумент в вызове
//  СбисОписаниеОповещения	 - СбисОписаниеОповещения	- вызываемый экземпляр описания оповещения для обработки
//
Процедура ВыполнитьСбисОписаниеОповещения(РезультатВызова=Неопределено, СбисОписаниеОповещения) Экспорт
	
	Если СбисОписаниеОповещения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если ГлобальныйКэш.СовместимостьМетодов.Объекты1С.ОписаниеОповещения Тогда
			
			Выполнить("ВыполнитьОбработкуОповещения(СбисОписаниеОповещения, РезультатВызова)");//Через Выполнить для старых платформ. Маскировка от синтаксиса. 
			
		Иначе
			
			_СбисОписаниеОповещения_Выполнить_Струкутра(РезультатВызова, СбисОписаниеОповещения);
			
		КонецЕсли;
		
	#ИначеЕсли НаКлиенте Тогда
		
		ВыполнитьОбработкуОповещения(СбисОписаниеОповещения, РезультатВызова);
		
	#Иначе
		
		_СбисОписаниеОповещения_Выполнить_Струкутра(РезультатВызова, СбисОписаниеОповещения);
		
	#КонецЕсли
	
КонецПроцедуры

#Область include_core2_vo2_МодульОбъекта_КлиентСервер_Классы_СбисОписаниеОповещения_private
#КонецОбласти

