
//DynamicDirective

// Функция - создает класс чтения XML
//
// Параметры:
//  СтрокаXML	 - Строка		 - XML для создания чтения
//  ДопПараметры - Структура	 - Расширение
// 
// Возвращаемое значение:
//  ЧтениеXMLSABY - экземпляр класса для чтения XML
//
Функция НовыйЧтениеXMLSABY(СтрокаXML, ДопПараметры = Неопределено) Экспорт 
	
	Результат = Новый Структура("_класс, Правила, ЧтениеXML", "ЧтениеXMLSABY", Новый Структура);
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	Если Не ДопПараметры = Неопределено Тогда
		
		Для Каждого ПараметрУстановить Из ДопПараметры Цикл
			
			 ЧтениеXMLSABY_Вставить(Результат, ПараметрУстановить.Ключ, ПараметрУстановить.Значение); 
			
		КонецЦикла;
		
	КонецЕсли;
	
	Результат.ЧтениеXML = ЧтениеXML;
	
	Возврат Результат;
	
КонецФункции

//DynamicDirective

// Функция - создает класс чтения XML
//
// Параметры:
//  ЧтениеXMLSABY	 - ЧтениеXMLSABY - Экземпляр класса чтения
//  КлючВставить	 - Строка		 - что изменить в классе
//  ЗначениеВставить - Произвольный	 - что вставить
// 
// Возвращаемое значение:
//  ЧтениеXMLSABY - экземпляр класса для чтения XML
//
Процедура ЧтениеXMLSABY_Вставить(ЧтениеXMLSABY, КлючВставить, ЗначениеВставить) Экспорт 
	
	Если КлючВставить = "Правила" Тогда
		
		Если ЗначениеВставить = Неопределено Тогда
			
			ЧтениеXMLSABY.Правила.Очистить();
			Возврат;
			
		КонецЕсли;
		
		Для Каждого КлючИЗначение Из ЗначениеВставить Цикл
			
			ЧтениеXMLSABY.Правила.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

//DynamicDirective

// Функция - запустить чтение XML, вернуть итог
//
// Параметры:
//  ЧтениеXMLSABY		 - ЧтениеXMLSABY	 - Экземпляр класса
//  КонтекстПриведения	 - Структура		 - Контекст
// 
// Возвращаемое значение:
//   - 
//
Функция ЧтениеXMLSABY_Прочитать(ЧтениеXMLSABY, ДопПараметры = Неопределено) Экспорт 
	Перем ЭлементыВКонтекст;
	
	ЧтениеXMLSABY.Вставить("ПутьДоУзлов", Новый Массив);
	КонтекстДляУзлов = ЧтениеXMLSABY_Прочитать_ПроверитьПравилаИСформироватьДопКонтекст(ЧтениеXMLSABY);
	
	Попытка
		
		СтруктураФайла = ЧтениеXMLSABY_Прочитать_ЗначениеУзла(ЧтениеXMLSABY, КонтекстДляУзлов);
		
	Исключение
		
		ОшибкаПрочитать = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъекта.ЧтениеXMLSABY.Прочитать",,,,ЧтениеXMLSABY.ПутьДоУзлов);
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаПрочитать);
		
	КонецПопытки;

	Возврат СтруктураФайла;
	
КонецФункции

//DynamicDirective

Функция ЧтениеXMLSABY_Прочитать_ЗначениеУзла(ЧтениеXMLSABY, ДополнительныйКонтекст = Неопределено)
	
	ИсходнаяГлубина	= ЧтениеXMLSABY.ПутьДоУзлов.Количество() - 1;
	Результат		= ЧтениеXMLSABY_Прочитать_НаборАтрибутов(ЧтениеXMLSABY);
	
	Пока ЧтениеXMLSABY.ЧтениеXML.Прочитать() Цикл
		
		Если	Не	ЧтениеXMLSABY_Прочитать_НачалоЭлемента(ЧтениеXMLSABY, Результат, ДополнительныйКонтекст)
			И		ЧтениеXMLSABY_Прочитать_КонецЭлемента(ЧтениеXMLSABY, ИсходнаяГлубина) Тогда
				
			Прервать;
				
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

//DynamicDirective

Функция ЧтениеXMLSABY_Прочитать_НачалоЭлемента(ЧтениеXMLSABY, ПосчитанныйРодительскийУзел, ДополнительныйКонтекстРодитель)
	
	Если Не ЧтениеXMLSABY.ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
	
		Возврат Ложь;
		
	КонецЕсли;
	
	ТекущееИмяУзла = ЧтениеXMLSABY.ЧтениеXML.Имя;
	
	ЧтениеXMLSABY.ПутьДоУзлов.Вставить(0, ТекущееИмяУзла);
	
	ДополнительныйКонтекст	= ЧтениеXMLSABY_Прочитать_ПроверитьПравилаИСформироватьДопКонтекст(ЧтениеXMLSABY, ТекущееИмяУзла, ДополнительныйКонтекстРодитель);
	ПосчитанныйТекущийУзел	= ЧтениеXMLSABY_Прочитать_ЗначениеУзла(ЧтениеXMLSABY, ДополнительныйКонтекст);

	ЧтениеXMLSABY_Прочитать_ПроверитьПравилаИЗаполнить(ЧтениеXMLSABY, ПосчитанныйРодительскийУзел, ТекущееИмяУзла, ПосчитанныйТекущийУзел, ДополнительныйКонтекстРодитель);
	
	Возврат Истина;
				
КонецФункции

//DynamicDirective

Процедура ЧтениеXMLSABY_Прочитать_ПроверитьПравилаИЗаполнить(ЧтениеXMLSABY, ПосчитанныйРодительскийУзел, ТекущееИмяУзла, ПосчитанныйТекущийУзел, ДополнительныйКонтекст)
	Перем ТекущееЗначениеУзла, ПравилоСвернуть;
	
	УзелДобавить = ПосчитанныйТекущийУзел;
	
	Если ЧтениеXMLSABY.Правила.Свернуть.Свойство(ТекущееИмяУзла, ПравилоСвернуть) Тогда
		
		// Параметры дополнить, обрезав имена атрибутов. Имя это ключ.
		Если Не ПосчитанныйРодительскийУзел.Свойство(ТекущееИмяУзла, ТекущееЗначениеУзла) Тогда
			
			ТекущееЗначениеУзла = Новый Структура;
			ПосчитанныйРодительскийУзел.Вставить(ТекущееИмяУзла, ТекущееЗначениеУзла);
			
		КонецЕсли;
		
		КлючДляСворачивания = Неопределено;
		ЗначениеУстановить	= Неопределено;
		Если	Не	ПосчитанныйТекущийУзел.Свойство(ПравилоСвернуть.Ключ,		КлючДляСворачивания)
			Или	Не	ПосчитанныйТекущийУзел.Свойство(ПравилоСвернуть.Значение,	ЗначениеУстановить) Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ЧтениеXMLSABY_Прочитать_ВставитьЗначение(ЧтениеXMLSABY, ТекущееЗначениеУзла, КлючДляСворачивания, ЗначениеУстановить);
			
		УзелДобавить = ТекущееЗначениеУзла;
		
	ИначеЕсли ПосчитанныйРодительскийУзел.Свойство(ТекущееИмяУзла, ТекущееЗначениеУзла) Тогда
			
		Если ТипЗнч(ТекущееЗначениеУзла) = Тип("Массив") Тогда
	
			ТекущееЗначениеУзла.Добавить(УзелДобавить);
			Возврат;
			
		КонецЕсли;
		
	ИначеЕсли		ДополнительныйКонтекст.ФормироватьМассив
			Или	Не	ЧтениеXMLSABY.Правила.УзелКакМассив.Найти(ТекущееИмяУзла) = Неопределено Тогда 
			
		ТекущееЗначениеУзла = Новый Массив;
		ТекущееЗначениеУзла.Добавить(УзелДобавить);
		УзелДобавить = ТекущееЗначениеУзла;
		
	ИначеЕсли 		ДополнительныйКонтекст.ПереложитьЭлементы Тогда
		
		// Перенести узлы как есть, игнорируя "списочный" узел
		Для Каждого КлючИЗначениеПосчитаны Из УзелДобавить Цикл
			
			ПосчитанныйРодительскийУзел.Вставить(КлючИЗначениеПосчитаны.Ключ, КлючИЗначениеПосчитаны.Значение);
			
		КонецЦикла;
		
		ДополнительныйКонтекст.ПереложитьЭлементы  = Ложь;
		
		Возврат;
		
	КонецЕсли; 

	
	ПосчитанныйРодительскийУзел.Вставить(ТекущееИмяУзла, УзелДобавить);
				
КонецПроцедуры

//DynamicDirective

Функция ЧтениеXMLSABY_Прочитать_ПроверитьПравилаИСформироватьДопКонтекст(ЧтениеXMLSABY, ТекущееИмяУзла = "", КонтекстТекущегоУзла = Неопределено)
	Перем КонтекстДляПодузлов;
	
	КонтекстДляПодузлов = Новый Структура("ФормироватьМассив, ПереложитьЭлементы", Ложь, Ложь);
	
	Если Лев(ТекущееИмяУзла, 6) = "Список" Тогда
		
		КонтекстДляПодузлов.ФормироватьМассив	= Истина;
		КонтекстТекущегоУзла.ПереложитьЭлементы	= Истина;
		
	КонецЕсли;

	Возврат КонтекстДляПодузлов
				
КонецФункции

//DynamicDirective

Функция ЧтениеXMLSABY_Прочитать_КонецЭлемента(ЧтениеXMLSABY, ИсходнаяГлубина)
	
	Результат = Ложь;
	Если ЧтениеXMLSABY.ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
		
		ЧтениеXMLSABY.ПутьДоУзлов.Удалить(0);
		Результат = ЧтениеXMLSABY.ПутьДоУзлов.Количество() = ИсходнаяГлубина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//DynamicDirective

Функция ЧтениеXMLSABY_Прочитать_НаборАтрибутов(ЧтениеXMLSABY)
	
	НаборАтрибутов = Новый Структура;
	Если ЧтениеXMLSABY.ЧтениеXML.ПервыйАтрибут() Тогда
		
		ЧтениеXMLSABY_Прочитать_ВставитьЗначение(ЧтениеXMLSABY, НаборАтрибутов, ЧтениеXMLSABY.ЧтениеXML.Имя, ЧтениеXMLSABY.ЧтениеXML.Значение);
		
		Пока ЧтениеXMLSABY.ЧтениеXML.СледующийАтрибут() Цикл
			
			ЧтениеXMLSABY_Прочитать_ВставитьЗначение(ЧтениеXMLSABY, НаборАтрибутов, ЧтениеXMLSABY.ЧтениеXML.Имя, ЧтениеXMLSABY.ЧтениеXML.Значение)
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат НаборАтрибутов;
	
КонецФункции

//DynamicDirective

Процедура ЧтениеXMLSABY_Прочитать_ВставитьЗначение(ЧтениеXMLSABY, ПрименикЗначения, КлючЗначения, ЗначениеВставить)
	
	Попытка
		
		ПрименикЗначения.Вставить(КлючЗначения, ЗначениеВставить);
		
	Исключение
		
		ПрименикЗначения.Вставить(ПрименитьФорматКСтроке_Ключ(КлючЗначения), ЗначениеВставить);
		
	КонецПопытки;
	
КонецПроцедуры

