
&НаКлиенте
Процедура ПользовательскиеДействия_ОтправитьУведомлениеОбОтгрузке(ПользовательскоеДействие, ДопПараметры)
	
	РезультатОтправки		= ДопПараметры.РезультатОтправки;
	СтрокаВыбора			= ДопПараметры.СтрокаВыбора;
	ЦепочкаКомандОбработки	= ДопПараметры.ЦепочкаКомандОбработки;
	
	ЦепочкаКомандОбработки_УдалитьДанные(ЦепочкаКомандОбработки);
	
	СтрокаВыбора.СоставПакета[0].Представление = "УведомлениеОбОтгрузке";
	
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");
	РезультатОтправки_СгенерироватьКомандыДляДействия(РезультатОтправки, ЦепочкаКомандОбработки, СтрокаВыбора);

КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_Отмена(ПользовательскоеДействие, ДопПараметры)

	ЦепочкаКомандОбработки	= ДопПараметры.ЦепочкаКомандОбработки;
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Ошибка", ПользовательскоеДействие.Основание);

КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_ЗагрузитьВ1С(ПользовательскоеДействие, ДопПараметры)

	// Перенесено из Главного окна, за неимением лучшего
	МодульФункцииДокументов = ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	Кэш = ПолучитьТекущийЛокальныйКэш();
	
	ПараметрыРезультатаДействия = Новый Структура("ПредставлениеОперации, ПрикладнаяСтатистика",
													"ЗагрузкаДокумента",
													НовыйПрикладнаяСтатистика());
	РезультатЗагрузки = МодульФункцииДокументов.РезультатДействия_Получить(Кэш, ПараметрыРезультатаДействия, Истина);  
	
	СписокОтмеченныхДокументов = ДопПараметры.СписокСтрокРеестра;
	Всего = СписокОтмеченныхДокументов.Количество();
	ОбновитьКонтент = Ложь;
	
	ПараметрыСообщения = Новый Структура("ФормаВладелец, Текст", ГлавноеОкно);
		
	Документ_Шаблон = НайтиФункциюСеансаОбработки("ЗагрузитьДокументыВ1С", "Документ_Шаблон");
	ПараметрыЗагрузки = Новый Структура("РежимНоменклатуры, РежимДокументов",
										ПолучитьЗначениеПараметраСбис("СпособЗагрузки"),
										ПолучитьЗначениеПараметраСбис("РежимЗагрузки"));
	РезультатЗагрузки = Документ_Шаблон.ЗагрузитьДокументыВ1С(Кэш, СписокОтмеченныхДокументов, ПараметрыЗагрузки);
	
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		
		ПараметрыСообщить = Новый Структура("СообщитьНеВыполнено", Ложь);
		МодульФункцииДокументов.РезультатДействия_СообщитьРезультат(РезультатЗагрузки, ПараметрыСообщить);
		
		ПараметрыСообщения.Текст = "Загружено комплектов " + Строка(РезультатЗагрузки.Всего.Выполнено) + " из " + Строка(Всего);
		СбисСообщить(ПараметрыСообщения);
		ОбновитьКонтент = Булево(РезультатЗагрузки.Всего.Выполнено);
		
	Иначе // Если пришли не структура, то ЗагрузитьДокументыВ1С вынесена. Поддержка старых функций
		ОбновитьКонтент = РезультатЗагрузки;
	КонецЕсли;
	
	Кэш.Удалить("РезультатДействия");
	
	Если ОбновитьКонтент Тогда
		ГлавноеОкно.ОбновитьКонтент();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_Утвердить(ПользовательскоеДействие, ДопПараметры)

	

КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_Отклонить(ПользовательскоеДействие, ДопПараметры)

	

КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_СвязатьСОтгрузкой(ПользовательскоеДействие, ДопПараметры)

	

КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_Отгрузить(ПользовательскоеДействие, ДопПараметры)

	

КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_ОбработатьРезультатыПриемки(ПользовательскоеДействие, ДопПараметры)

	

КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_Отправить(ПользовательскоеДействие, ДопПараметры)

	

КонецПроцедуры

