
&НаКлиенте
Процедура ПользовательскиеДействия_ОтправитьУведомлениеОбОтгрузке(ПользовательскоеДействие, ДопПараметры)
	
	РезультатОтправки		= ДопПараметры.РезультатОтправки;
	СтрокаВыбора			= ДопПараметры.СтрокаВыбора;
	ЦепочкаКомандОбработки	= ДопПараметры.ЦепочкаКомандОбработки;
	
	ЦепочкаКомандОбработки_УдалитьДанные(ЦепочкаКомандОбработки);
	
	СтрокаВыбора.СоставПакета[0].Представление = "УведомлениеОбОтгрузке";
	
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");
	МассоваяОперация_ПроверитьИПодготовитьКоманду(РезультатОтправки, ЦепочкаКомандОбработки, СтрокаВыбора);

КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_ОтправитьНовыйДокумент(ПользовательскоеДействие, ДопПараметры)
	
	РезультатОтправки		= ДопПараметры.РезультатОтправки;
	ЦепочкаКомандОбработки	= ДопПараметры.ЦепочкаКомандОбработки;
	СоставПакета			= ДопПараметры.СоставПакета;
	СтрокаВыбора 			= ДопПараметры.СтрокаВыбора;
	
	ПараметрыПакета = СоставПакета_Получить(СоставПакета, "Параметры");
	ПараметрыПакета.Вставить("ЭтоРедакция", Ложь);
	
	Если СоставПакета.Свойство("ПользовательскийИдентификатор") Тогда
		СоставПакета.Удалить("ПользовательскийИдентификатор");
	КонецЕсли;
	
	Если СоставПакета.Свойство("Идентификатор") Тогда
		СоставПакета.Удалить("Идентификатор");
	КонецЕсли;
	
	Если СоставПакета.Свойство("ВременныйИдентификатор") Тогда
		СоставПакета.ВременныйИдентификатор = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	ЦепочкаКомандОбработки_УдалитьДанные(ЦепочкаКомандОбработки);
	
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");
	МассоваяОперация_ПроверитьИПодготовитьКоманду(РезультатОтправки, ЦепочкаКомандОбработки, СоставПакета);

КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_Отмена(ПользовательскоеДействие, ДопПараметры)

	ЦепочкаКомандОбработки	= ДопПараметры.ЦепочкаКомандОбработки;
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Ошибка", ПользовательскоеДействие.Основание);

КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_ЗагрузитьВ1С(ПользовательскоеДействие, ДопПараметры)
	
	СписокОтмеченныхДокументов = ДопПараметры.СписокСтрокРеестра;
	ДокументыДляЗагрузки = Новый СписокЗначений;
	
	Для каждого ОтмеченнаяСтрока Из СписокОтмеченныхДокументов Цикл
	
		Если ОтмеченнаяСтрока.Значение.ТекущееДействие <> "ЗагрузитьВ1С"
			И ЗначениеЗаполнено(ОтмеченнаяСтрока.Значение.Документы1С) Тогда
			
			Продолжить;

		КонецЕсли;

		ДокументыДляЗагрузки.Добавить(ОтмеченнаяСтрока.Значение);
	
	КонецЦикла;
	
	ДопПараетрыДляЗагрузки = Новый Структура("ДокументыДляЗагрузки, СписокОтмеченныхДокументов",
											ДокументыДляЗагрузки,
											СписокОтмеченныхДокументов);
	СбисОписаниеОповещения = НовыйСбисОписаниеОповещения("ПользовательскиеДействия_ЗагрузитьВ1С_Завершить",
														 МодульОбъектаКлиент(),
														  ДопПараетрыДляЗагрузки);

	Если ДокументыДляЗагрузки.Количество() = СписокОтмеченныхДокументов.Количество() Тогда
		ВыполнитьСбисОписаниеОповещения(КодВозвратаДиалога.Да, СбисОписаниеОповещения);
	Иначе
		СбисПоказатьВопрос(СбисОписаниеОповещения,
							"Перезагружать уже загруженные документы?",
							РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_ЗагрузитьВ1С_Завершить(Результат, ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ДокументыДляЗагрузки = ДопПараметры.СписокОтмеченныхДокументов;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ДокументыДляЗагрузки = ДопПараметры.ДокументыДляЗагрузки;
	Иначе
		Возврат;
	КонецЕсли;

	// Перенесено из Главного окна, за неимением лучшего
	МодульФункцииДокументов = ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	Кэш = ПолучитьТекущийЛокальныйКэш();
	
	ПараметрыРезультатаДействия = Новый Структура("ПредставлениеОперации, ПрикладнаяСтатистика",
													"ЗагрузкаДокумента",
													НовыйПрикладнаяСтатистика());
	РезультатЗагрузки = МодульФункцииДокументов.РезультатДействия_Получить(Кэш, ПараметрыРезультатаДействия, Истина);  

	Всего = ДокументыДляЗагрузки.Количество();
	ОбновитьКонтент = Ложь;
	
	ПараметрыСообщения = Новый Структура("ФормаВладелец, Текст", ГлавноеОкно);
		
	Документ_Шаблон = НайтиФункциюСеансаОбработки("ЗагрузитьДокументыВ1С", "Документ_Шаблон");
	ПараметрыЗагрузки = Новый Структура("РежимНоменклатуры, РежимДокументов",
										ПолучитьЗначениеПараметраСбис("СпособЗагрузки"),
										ПолучитьЗначениеПараметраСбис("РежимЗагрузки"));
	РезультатЗагрузки = Документ_Шаблон.ЗагрузитьДокументыВ1С(Кэш, ДокументыДляЗагрузки, ПараметрыЗагрузки);
	
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		
		ПараметрыСообщить = Новый Структура("СообщитьНеВыполнено", Ложь);
		МодульФункцииДокументов.РезультатДействия_СообщитьРезультат(РезультатЗагрузки, ПараметрыСообщить);
		
		ПараметрыСообщения.Текст = "Загружено комплектов " + Строка(РезультатЗагрузки.Всего.Выполнено) + " из " + Строка(Всего);
		СбисСообщить(ПараметрыСообщения);
		ОбновитьКонтент = Булево(РезультатЗагрузки.Всего.Выполнено);
		
	Иначе // Если пришли не структура, то ЗагрузитьДокументыВ1С вынесена. Поддержка старых функций
		ОбновитьКонтент = РезультатЗагрузки;
	КонецЕсли;
	
	Кэш.Удалить("РезультатДействия");
	
	Если ОбновитьКонтент Тогда
		ГлавноеОкно.ОбновитьКонтент();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_Утвердить(ПользовательскоеДействие, ДопПараметры)

	УтвердитьДокументСРасхождением(ДопПараметры);

КонецПроцедуры   

&НаКлиенте
Процедура ПользовательскиеДействия_ИгнорироватьРасхождения(ПользовательскоеДействие, ДопПараметры)
	
	Кэш = ПолучитьТекущийЛокальныйКэш(); 
	
	СписокОтмеченныхДокументов = ДопПараметры.СписокСтрокРеестра;  
		
	МассивПакетов = Новый Массив;  // Массив пакетов для одной отправки (если в настройках указано отправлять пакеты по n штук)

	Для Каждого СтрокаВыбрана Из СписокОтмеченныхДокументов Цикл
		
		Заказ = СтрокаВыбрана.Значение.СоставПакета[0].Значение;
		
		СвязанныеДокументыСБИС = Неопределено;
		Заказ.Свойство("LinkedOutflows", СвязанныеДокументыСБИС);
		ИдСвязанногоДокумента = ?(ЗначениеЗаполнено(СвязанныеДокументыСБИС), СвязанныеДокументыСБИС[0], Неопределено);
		
		ОперацииВыполнить = Новый СписокЗначений;
		ОперацииВыполнить.Добавить(Новый Структура("ДопПараметрыВызова", Новый Структура("ИдентификаторПакета,ФлагРасхождения", ИдСвязанногоДокумента, Ложь)), "УстановитьФлагЕстьРасхождения");

		// Главное окно должно сообщить что требуется проверить документ на черновик
		СтрокаДобавить = Новый Структура("ИдентификаторСБИС", ИдСвязанногоДокумента); 
		СтрокаДобавить.Вставить("Сценарии",	ОперацииВыполнить);			
	
		МассивПакетов.Добавить(СтрокаДобавить);
		
	КонецЦикла;   
	
	МодульОбработчика = НайтиФункциюСеансаОбработки("ЗавершитьДействияНадДокументами", Кэш.Текущий.ФормыРаздела);
	
	Если МодульОбработчика = Ложь Тогда
		ОбработчикРезультатОтправки	= НовыйСбисОписаниеОповещения("ЗапуститьМассовуюОтправкуДокументов_Завершение", МодульОбъектаКлиент());
	Иначе
		ОбработчикРезультатОтправки	= НовыйСбисОписаниеОповещения("ЗавершитьДействияНадДокументами", МодульОбработчика);
	КонецЕсли;

	ПараметрыОтправки = Новый Структура;
	ПараметрыОтправки.Вставить("ДанныеКОтправке",		Новый Структура("СписокПакетов", МассивПакетов));
	ПараметрыОтправки.Вставить("ОбработчикРезультата",	ОбработчикРезультатОтправки);
	ПараметрыОтправки.Вставить("ВерсияОтправки",		2);
	ПараметрыОтправки.Вставить("Реестр",				Кэш.Текущий);
	
	РезультатОтправки = НовыйМассоваяОперация(ПараметрыОтправки);
	
	МассоваяОперация_МассоваяОтправка(РезультатОтправки);  
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_Отклонить(ПользовательскоеДействие, ДопПараметры)

	ОтклонитьДокументы(ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_СвязатьСОтгрузкой(ПользовательскоеДействие, ДопПараметры)
	
	Отказ = Ложь;   
	
	КлючИни = "УведомлениеОбОтгрузке"; 
	
	НаборПодходящихИни = МодульОбъектаКлиент().ИниПоПараметрам(КлючИни);
	
	ТипыДокументов1С = НаборПодходящихИни.Реестр1С_Тип.Значение;
	
	СписокТиповДокумента1С = СбисРазложитьСтрокуВМассивПодстрок(ТипыДокументов1С, ",");   
	
	ТипДокумента1С = СтрЗаменить(СписокТиповДокумента1С[0], "'", "");
	
	СписокОтмеченныхДокументов = ДопПараметры.СписокСтрокРеестра;  
	
	ДопПараметрыСоздания = Новый Структура("ТипОбъекта, ПодТипОбъекта, ЗаполнитьДаннымиДругогоОбъекта", "Документ", ТипДокумента1С, Истина);  
	
	СтруктураОбъекта1С = Новый Структура();
	
	Для Каждого Строка Из СписокОтмеченныхДокументов Цикл  
		
		Документы1С = Строка.Значение.Документы1С;
		
		ДопПараметрыСоздания.Вставить("ДокументОснование", Документы1С[0].Значение); 
		
		Документ1СПоОснованию = СоздатьОбъектИзСтруктуры(СтруктураОбъекта1С, ДопПараметрыСоздания, Отказ);   
		
		Если Отказ Тогда 
			
			ВызватьИсключение СбисИсключение_Представление(Документ1СПоОснованию);  
			
		КонецЕсли;
		
	КонецЦикла;   
	
	ГлавноеОкно.ОбновитьКонтент();
		
КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_Отгрузить(ПользовательскоеДействие, ДопПараметры) 
	
	Кэш = ПолучитьТекущийЛокальныйКэш();
	
	МассивПакетов = Новый Массив;
	
	Для Каждого ЭлементСписка Из ДопПараметры.СписокСтрокРеестра Цикл
	
		Заказ 						= ЭлементСписка.Значение.СоставПакета[0].Значение;
		ИдентификаторЗаказа 		= СоставПакета_Получить(Заказ, "ИдентификаторСБИС");
		ТипыДокументов				= ПолучитьСписокФорматовДокументовОтгрузки(ИдентификаторЗаказа);
		
		СписокСвязанныхДокументов 	= Новый СписокЗначений;
		
		// Получить весь перечень документов 1С
		Документы1С 				= СоставПакета_Получить(Заказ, "Документы1С");
		
		Если ЗначениеЗаполнено(Документы1С) Тогда
		
			Для Каждого ЭлементСпискаДокументов Из Документы1С Цикл 
				
				СписокСвязанныхДокументов.Добавить(ЭлементСпискаДокументов.Значение); 
				
			КонецЦикла;
		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭлементСписка.Значение.СвязанныеДокументы) Тогда
		
			Для Каждого СвязанныйДокумент1С Из ЭлементСписка.Значение.СвязанныеДокументы Цикл 
				
				Если НЕ СписокСвязанныхДокументов.НайтиПоЗначению(СвязанныйДокумент1С.Значение) = Неопределено Тогда  
					
					Продолжить;   
					
				КонецЕсли; 
				
				СписокСвязанныхДокументов.Добавить(СвязанныйДокумент1С.Значение);   
				
			КонецЦикла;
		
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТипыДокументов)
			ИЛИ НЕ ЗначениеЗаполнено(Документы1С) Тогда 
			
			Продолжить; 
			
		КонецЕсли;
		
		ПараметрыПоиска 			= Новый Структура("Документы1С, ТипыВложенийСБИС", СписокСвязанныхДокументов, ТипыДокументов);
		ДопОтборИни 				= Новый Структура("РеестрСБИС_Тип", "ДокОтгрИсх");
		ДопПараметрыПолученияДанных = Новый Структура("ДопОтборИни", ДопОтборИни); 
		
		ДанныеДокументаОтгрузки 	= ДанныеДокументаОтгрузкиПоПриоритету(ПараметрыПоиска, ДопПараметрыПолученияДанных);  
		
		ПакетОтгрузки 				= Новый Структура("СоставПакета", ДанныеДокументаОтгрузки);
		
		МассивПакетов.Добавить(ПакетОтгрузки);
	
	КонецЦикла;
	
	ФормаРазделаПродажи = МодульОбъектаКлиент().ПолучитьФормуОбработки("Раздел_Продажа_Шаблон");
	
	СтруктураРеестра = НовыйРазделГО("АккордеонПродажаДок033", Новый Структура("ИмяИни", ДанныеДокументаОтгрузки[0].Представление));	
	ПараметрыОтправки = Новый Структура("Реестр, ИмяРеестра, МодульПодготовки", СтруктураРеестра, ДанныеДокументаОтгрузки[0].Представление, ФормаРазделаПродажи); 
	
	МодульОбработчика = НайтиФункциюСеансаОбработки("ЗавершитьДействияНадДокументами", Кэш.Текущий.ФормыРаздела);
	
	Если МодульОбработчика <> Ложь Тогда

		ОбработчикРезультатОтправки	= НовыйСбисОписаниеОповещения("ЗавершитьДействияНадДокументами", МодульОбработчика);
		ПараметрыОтправки.Вставить("ОбработчикРезультата", ОбработчикРезультатОтправки);

	КонецЕсли;

	ЗапуститьМассовуюОтправкуДокументов(МассивПакетов, ПараметрыОтправки);

КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_ОбработатьРезультатыПриемки(ПользовательскоеДействие, ДопПараметры) 	
	
	Кэш = ПолучитьТекущийЛокальныйКэш();  
	
	МодульФункцииДокументов = ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");

	СписокОтмеченныхДокументов = ДопПараметры.СписокСтрокРеестра;
	Всего = СписокОтмеченныхДокументов.Количество();
	ОбновитьКонтент = Ложь;
	
	ПараметрыСообщения = Новый Структура("ФормаВладелец, Текст", ГлавноеОкно);
		
	Документ_Шаблон = ПолучитьФормуОбработки("Документ_Шаблон"); 
	
	ПараметрыЗагрузки = Новый Структура("РежимНоменклатуры, РежимДокументов, ИзменениеВДокумент",
										ПолучитьЗначениеПараметраСбис("СпособЗагрузки"),
										0,
										КодВозвратаДиалога.Да); 
										
	РезультатЗагрузки = Документ_Шаблон.ЗагрузитьДокументыВ1С(Кэш, СписокОтмеченныхДокументов, ПараметрыЗагрузки);
	
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		
		ПараметрыСообщить = Новый Структура("СообщитьНеВыполнено", Ложь);
		МодульФункцииДокументов.РезультатДействия_СообщитьРезультат(РезультатЗагрузки, ПараметрыСообщить);
		
		ПараметрыСообщения.Текст = "Загружено комплектов " + Строка(РезультатЗагрузки.Всего.Выполнено) + " из " + Строка(Всего);
		СбисСообщить(ПараметрыСообщения);
		ОбновитьКонтент = Булево(РезультатЗагрузки.Всего.Выполнено);
		
	Иначе // Если пришли не структура, то ЗагрузитьДокументыВ1С вынесена. Поддержка старых функций
		ОбновитьКонтент = РезультатЗагрузки;
	КонецЕсли;
	
	Кэш.Удалить("РезультатДействия");
	
	Если ОбновитьКонтент Тогда
		ГлавноеОкно.ОбновитьКонтент();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_ОтправитьЮЗДДляЗаказов(ПользовательскоеДействие, ДопПараметры)

	МассивПакетов = Новый Массив;
	
	Для каждого ЭлементСписка Из ДопПараметры.СписокСтрокРеестра Цикл
	
		Заказ = ЭлементСписка.Значение.СоставПакета[0].Значение;
		ИдентификаторЗаказа = СоставПакета_Получить(Заказ, "ИдентификаторСБИС");
		ТипыДокументов = ПолучитьСписокФорматовДокументовОтгрузки(ИдентификаторЗаказа);
		
		// Получить весь перечень документов 1С
		СписокСвязанныхДокументов = Новый СписокЗначений;
		
		Документы1С = СоставПакета_Получить(Заказ, "Документы1С");
		
		Если ЗначениеЗаполнено(Документы1С) Тогда
		
			Для каждого ЭлементСпискаДокументов Из Документы1С Цикл
				СписокСвязанныхДокументов.Добавить(ЭлементСпискаДокументов.Значение);
			КонецЦикла;
		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭлементСписка.Значение.СвязанныеДокументы) Тогда
		
			Для Каждого СвязанныйДокумент1С Из ЭлементСписка.Значение.СвязанныеДокументы Цикл 
				
				Если НЕ СписокСвязанныхДокументов.НайтиПоЗначению(СвязанныйДокумент1С.Значение) = Неопределено Тогда  
					
					Продолжить;   
					
				КонецЕсли; 
				
				СписокСвязанныхДокументов.Добавить(СвязанныйДокумент1С.Значение);   
				
			КонецЦикла;
		
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТипыДокументов)
			ИЛИ НЕ ЗначениеЗаполнено(Документы1С) Тогда
			Продолжить;
		ИначеЕсли НЕ ТипыДокументов.Найти(НРег("УведомлОтгр")) = Неопределено Тогда
			ТипыДокументов.Удалить(ТипыДокументов.Найти(НРег("УведомлОтгр")));
		КонецЕсли;
		
		ПараметрыПоиска = Новый Структура("Документы1С, ТипыВложенийСБИС", СписокСвязанныхДокументов, ТипыДокументов);
		ДопОтборИни = Новый Структура("РеестрСБИС_Тип", "ДокОтгрИсх");
		ДопПараметрыПолученияДанных = Новый Структура("ДопОтборИни", ДопОтборИни);
		ДанныеДокументаОтгрузки = ДанныеДокументаОтгрузкиПоПриоритету(ПараметрыПоиска, ДопПараметрыПолученияДанных);
		
		СвязанныеДокументыСБИС = Неопределено;
		Заказ.Свойство("LinkedOutflows", СвязанныеДокументыСБИС);
		ИдСвязанногоДокумента = ?(ЗначениеЗаполнено(СвязанныеДокументыСБИС), СвязанныеДокументыСБИС[0], Неопределено);
		ДопПараметрыВызова = Новый Структура("ПерегенерироватьВложения", Ложь);
		
		ОперацииВыполнить = Новый СписокЗначений;  
		ОперацииВыполнить.Добавить(Новый Структура("Операция, ДопПараметрыВызова", "Черновик", ДопПараметрыВызова),	"ПрочитатьДокумент");  
		ОперацииВыполнить.Добавить(Новый Структура("ДопПараметрыВызова", Новый Структура("ФлагИзменен", Ложь)),		"УстановитьФлагДокументаИзменен");
		ОперацииВыполнить.Добавить(,																				"ДополнитьДокументВложениями"); 
		ОперацииВыполнить.Добавить(Новый Структура("ИмяКоманды", "Отправить"),										"ВыполнитьДействие");
			
		ПакетОтгрузки = Новый Структура("СоставПакета, ИдентификаторСБИС, Сценарии", ДанныеДокументаОтгрузки, ИдСвязанногоДокумента, ОперацииВыполнить);
		
		МассивПакетов.Добавить(ПакетОтгрузки);
	
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ДанныеДокументаОтгрузки) Тогда 
		
		СообщениеОшибки		= "Отсутствуют документы, требующие отправки. Вы можете создать или загрузить новые, отредактировать уже имеющиеся";
		ОшибкаПодготовки 	= НовыйСбисИсключение(СообщениеОшибки, "МодульОбъектаКлиент.ПользовательскиеДействия_ОтправитьЮЗДДляЗаказов");	
		ВызватьИсключение СбисИсключение_Представление(ОшибкаПодготовки, "Сообщение");
		
	КонецЕсли;
	
	Кэш = ПолучитьТекущийЛокальныйКэш();  
	
	РазделОтправки = НовыйРазделГО(Неопределено, Новый Структура("ИмяИни", ДанныеДокументаОтгрузки[0].Представление));

	МодульОбработчика = НайтиФункциюСеансаОбработки("ЗавершитьДействияНадДокументами", Кэш.Текущий.ФормыРаздела);
	
	Если МодульОбработчика = Ложь Тогда
		ОбработчикРезультатОтправки	= НовыйСбисОписаниеОповещения("ЗапуститьМассовуюОтправкуДокументов_Завершение", МодульОбъектаКлиент());
	Иначе
		ОбработчикРезультатОтправки	= НовыйСбисОписаниеОповещения("ЗавершитьДействияНадДокументами", МодульОбработчика);
	КонецЕсли;

	ПараметрыОтправки = Новый Структура;
	ПараметрыОтправки.Вставить("ДанныеКОтправке",		Новый Структура("СписокПакетов", МассивПакетов));
	ПараметрыОтправки.Вставить("ВерсияОтправки",		2);
	ПараметрыОтправки.Вставить("Реестр",				РазделОтправки);
	ПараметрыОтправки.Вставить("МодульПодготовки",		РазделОтправки.Форма);
	ПараметрыОтправки.Вставить("ОбработчикРезультата",	ОбработчикРезультатОтправки);
	
	РезультатОтправки = НовыйМассоваяОперация(ПараметрыОтправки);
	
	МассоваяОперация_МассоваяОтправка(РезультатОтправки);

КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_ОбработатьМассово(ПользовательскоеДействие, ДопПараметры)

	СписокОтмеченныхДокументов = ДопПараметры.СписокСтрокРеестра;
	
	СписокиДокументовПоДействиям = Новый Структура;
	
	Для каждого СтрокаРеестра Из СписокОтмеченныхДокументов Цикл
	
		СоставПакета = СтрокаРеестра.Значение.СоставПакета[0].Значение;
		
		Действия = СоставПакета_Получить(СоставПакета, "ТекущееДействие");
		
		Если НЕ ЗначениеЗаполнено(Действия)
			ИЛИ НЕ ЭтоТипСбис(Действия[0], "ПользовательскоеДействие") Тогда
		
			Продолжить;
		
		КонецЕсли;
		
		ИдДействия = Действия[0].Идентификатор;
		
		Если НЕ СписокиДокументовПоДействиям.Свойство(ИдДействия) Тогда
		
			СписокиДокументовПоДействиям.Вставить(ИдДействия, Новый Структура);
			СписокиДокументовПоДействиям[ИдДействия].Вставить("Список",		Новый СписокЗначений);
			СписокиДокументовПоДействиям[ИдДействия].Вставить("Действие",	Действия[0]);
		
		КонецЕсли;
		
		СписокиДокументовПоДействиям[ИдДействия].Список.Добавить(СтрокаРеестра.Значение,
																 СтрокаРеестра.Представление);
	
	КонецЦикла;
	
	Для каждого Элемент Из СписокиДокументовПоДействиям Цикл
	
		ПараметрыДействия = Новый Структура("СписокСтрокРеестра", Элемент.Значение.Список);
		ПользовательскиеДействия_Выполнить(Элемент.Значение.Действие, ПараметрыДействия);
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_ОткрытьСсылкуОплаты(ПользовательскоеДействие, ДопПараметры)
	
	ЗапуститьПриложение(ДопПараметры.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_Видеозвонок(ПользовательскоеДействие, ДопПараметры)
	
	ЗапуститьПриложение(ДопПараметры.Контакт.Видеозвонок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеДействия_КарточкаМенеджера(ПользовательскоеДействие, ДопПараметры)
	
	ЗапуститьПриложение(ДопПараметры.Контакт.Ссылка);
	
КонецПроцедуры

