
&НаКлиенте
Функция ДельтаВыделенныхСтрок(ВыделенныеСтрокиМассив_1, ВыделенныеСтрокиМассив_2, КлючСравнения = ",1левсоед2,")
	
	ДельтаСтрок = Новый Массив;
	
	Если Найти(КлючСравнения, ",1левсоед2,") Тогда
		
		Для каждого Строка Из ВыделенныеСтрокиМассив_2 Цикл
			
			Если ВыделенныеСтрокиМассив_1.Найти(Строка) = Неопределено Тогда
				ДельтаСтрок.Добавить(Строка);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Найти(КлючСравнения, ",2левсоед1,") Тогда
		
		Для каждого Строка Из ВыделенныеСтрокиМассив_1 Цикл 
			Если	ВыделенныеСтрокиМассив_2.Найти(Строка) = Неопределено
				И	ДельтаСтрок.Найти(Строка) = Неопределено Тогда
				ДельтаСтрок.Добавить(Строка);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ДельтаСтрок;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтроки(ТабличнаяЧасть, ПараметрыПоиска) 	

	Если ТипЗнч(ПараметрыПоиска) = Тип("Массив") Тогда
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			Возврат ПараметрыПоиска;
			
		#КонецЕсли  

		НовыйНаборСтрок = Новый Массив;
		Для Каждого СтрокаИндекс Из ПараметрыПоиска Цикл 
			
			СтрокаДанные = ТабличнаяЧасть.НайтиПоИдентификатору(СтрокаИндекс);	
			НовыйНаборСтрок.Добавить(СтрокаДанные);
			
		КонецЦикла;
		
	Иначе
		
		НовыйНаборСтрок = ТабличнаяЧасть.НайтиСтроки(ПараметрыПоиска);
	
	КонецЕсли;
	
	Возврат НовыйНаборСтрок;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьСтроки(Строки, УстанавливаемоеСостояние)
	
	Если	ТипЗнч(Строки) = Тип("Массив")
		Или	ТипЗнч(Строки) = Тип("ДанныеФормыКоллекция") Тогда
		Для Каждого стр из Строки Цикл	
			
			Если НЕ Стр = Неопределено Тогда
				
				стр.Отмечен = УстанавливаемоеСостояние;
				Если Не УстанавливаемоеСостояние Тогда
					
					// Если снимается галка, то нужно автоматом удалить и из отмеченных флажком
					ИзменитьОтмеченФлажком(стр);
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЦикла;
		
	Иначе
		
		Строки.Отмечен = УстанавливаемоеСостояние;
		Если Не УстанавливаемоеСостояние  Тогда
			
			// Если снимается галка, то нужно автоматом удалить и из отмеченных флажком
			ИзменитьОтмеченФлажком(Строки);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ИзменитьОтмеченФлажком(Строки)
	
	Если	ТипЗнч(Строки) = Тип("Массив")
		Или	ТипЗнч(Строки) = Тип("ДанныеФормыКоллекция") Тогда
		
		Для Каждого СтрокаТчИзМассива Из Строки Цикл
			
			ИзменитьОтмеченФлажком(СтрокаТчИзМассива);
			
		КонецЦикла;
		Возврат;
		
	КонецЕсли;
	
	ВыделяемыеФлажком		= РаботаВыделенияСтрок.ОтмеченныеФлажком;
	ИндексОтмечалсяРанее	= ВыделяемыеФлажком.Найти(Строки);
	Если Строки.Отмечен Тогда
		
		Если ИндексОтмечалсяРанее = Неопределено Тогда
			
			ВыделяемыеФлажком.Добавить(Строки);
			
		КонецЕсли;
		
	Иначе
		
		Если Не ИндексОтмечалсяРанее = Неопределено Тогда
			
			// Убрать строку из отмечаемых флажком
			ВыделяемыеФлажком.Удалить(ИндексОтмечалсяРанее);
			
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ИнициализацияРаботыВыделенияСтрок() 
	
	РаботаВыделенияСтрок = Новый Структура("ПредыдущиеВыделенныеСтроки, ОтмеченныеФлажком", Новый Массив, Новый Массив);
	
КонецПроцедуры


