
&НаСервере
Процедура СбисУстановитьФорму(ПараметрыУстановки) Экспорт
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
	КонецЕсли;
	Если ПараметрыУстановки.Свойство("СертификатИмя", СертификатИмя) Тогда
		сбисЗаголовок = "Введите код активации сертификата ";
		Если Не Лев(СертификатИмя, СтрДлина(сбисЗаголовок)) = сбисЗаголовок Тогда
			СертификатИмя = сбисЗаголовок + СертификатИмя;
		КонецЕсли;
	ИначеЕсли Не ПараметрыУстановки.Свойство("ЗаголовокВвода", СертификатИмя) Тогда
		СертификатИмя = "Введите код активации";
	КонецЕсли;
	Если ПараметрыУстановки.Свойство("счСертификатов") Тогда
		ПараметрыФормы.Вставить("счСертификатов", ПараметрыУстановки.счСертификатов);
	Иначе
		ПараметрыФормы.Вставить("счСертификатов", 0);
	КонецЕсли;
	Если Не ПараметрыУстановки.Свойство("Заголовок", Заголовок) Тогда
		Заголовок = "";
	КонецЕсли;
	Если Не ПараметрыУстановки.Свойство("Режим") Тогда
		ПараметрыФормы.Вставить("Режим", "ВводПинкода");
	Иначе
		ПараметрыФормы.Вставить("Режим", "");
	КонецЕсли;	
КонецПроцедуры

