
// Функция - Обёртка над СБИС.Аутенфтифицировать https://saby.ru/help/integration/api/all_methods/auth_one
//
// Параметры:
//  Кэш							 - ЛокальныйКэш	 - 
//  СтруктураПараметровЗапроса	 - Структура	 - С полями Логин/Пароль
//  ДопПараметрыВходящие		 - Структура	 - 
//  Отказ						 - Булево		 - 
// 
// Возвращаемое значение:
//  Строка/СбисИсключение - токен авторизации, либо описание ошибки.
//
&НаКлиенте
Функция СБИС_Аутентифицировать(Кэш, СтруктураПараметровЗапроса, ДопПараметрыВходящие, Отказ) Экспорт

	Если Не ЗначениеЗаполнено(СтруктураПараметровЗапроса.Логин) Тогда 
		
		ОшибкаАвторизации = МодульОбъектаКлиент().НовыйСбисИсключение(,
													МодульОбъектаКлиент().ПараметрSABY("ИнтеграцияИмя") + ".СБИС.Аутентифицировать",
													785,
													"Не указаны логин/пароль для авторизации");
		Отказ = Истина;
		Возврат ОшибкаАвторизации;
		
	КонецЕсли;
	
	ДопПараметры = Новый Структура("СообщатьПриОшибке, ВернутьОшибку, БезАвторизации", Ложь, Истина, Истина);
	ДопПараметры.Вставить("ОчиститьПараметры", Истина);
	
	ПараметрыЗапроса = Новый Структура("Login, Password", СтруктураПараметровЗапроса.Логин, СтруктураПараметровЗапроса.Пароль);
	Возврат СбисОтправитьИОбработатьКоманду(Кэш, "AuthByPassword", ПараметрыЗапроса, ДопПараметры, Отказ);

КонецФункции

&НаКлиенте
Функция СБИС_ВыполнитьДействие(Кэш, document_in, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "ExecuteAction", Новый Структура("Document, Action", document_in, Новый Структура), ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_ВыполнитьДействие");
	КонецЕсли;
	Возврат Результат
КонецФункции

&НаКлиенте
Функция СБИС_СписокСертификатов(Кэш, param, ДопПараметры, Отказ) Экспорт
	
	ДопПараметрыЗапроса	= Новый Структура("ВернутьОшибку, ЕстьРезультат, ВремяОжиданияОтвета, БезАвторизации", Истина, Истина, 120, Истина);
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "ReadCertListForAuth", Новый Структура("Filter", Новый Структура), ДопПараметрыЗапроса, Отказ);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СБИС_ПодготовитьДействие(Кэш, param, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "PrepareAction", Новый Структура("Document", param), ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_ПодготовитьДействие");
	КонецЕсли;
	Возврат Результат
КонецФункции	
	
&НаКлиенте
Функция СБИС_ПрочитатьДокумент(Кэш, param, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "ReadDocument", Новый Структура("Document", param), ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_ПрочитатьДокумент");
	КонецЕсли;
	Возврат Результат
КонецФункции	

&НаКлиенте
Функция СБИС_ПрочитатьДокументКакHTML(Кэш, param, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "ReadDocumentAsHTML", Новый Структура("Parameter", param), ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_ПрочитатьДокументКакHTML");
	КонецЕсли;
	Возврат Результат
КонецФункции

&НаКлиенте
Функция СБИС_СписокИзменений(Кэш, filter, ДопПараметры, Отказ) Экспорт
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);
	Результат = СбисОтправитьИОбработатьКомандуCallSabyApi(Кэш, "СБИС.СписокИзменений", filter, ДопПараметрыВызова, Отказ);
	Если Отказ Тогда
		Результат = Кэш.ОбщиеФункции.СбисИсключение(Результат, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_СписокИзменений");
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СБИС_ИнформацияОКонтрагенте(Кэш, СтруктураКонтрагента, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКомандуCallSabyApi(Кэш, "СБИС.ИнформацияОКонтрагенте", СтруктураКонтрагента, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_ИнформацияОКонтрагенте");
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СБИС_ПолучитьИнформациюОТекущемПользователе(Кэш, param, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "GetUserInfo", param, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_ПолучитьИнформациюОТекущемПользователе");
	КонецЕсли;
	Возврат Результат;
КонецФункции 

&НаКлиенте
Функция СБИС_ПолучитьСписокАккаунтов(Кэш, param, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "AccountList", param, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_ПолучитьСписокАккаунтов");
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СБИС_ПереключитьАккаунт(Кэш, param, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "SwitchAccount", Новый Структура("Param", param), ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_ПереключитьАккаунт");
	КонецЕсли;
	Возврат Результат;
КонецФункции

