
// Процедура - изменить параметр обработки в объектах: ЛокальныйКэш, ГлобальныйКэш, ТекущийСеанс, КэшСБИС. 
// 2 Аргумента для обработки через описание оповещения
//
// Параметры:
//  ОписаниеПараметра	 - Структура/ФиксированнаяСтруктура/КлючЗначение	 - поля: "Ключ", "Значение", "Тип"
//  ДопПараметры		 - Структура/Неопределено	 - Расширение
//
//DynamicDirective
Процедура ИзменитьПараметрSABY_Описание(ОписаниеПараметра, ДопПараметры = Неопределено) Экспорт
	Перем ЗначениеПараметраSABY, ТипПараметраSABY, ДопПараметрыПродолжить;
	
	Если ТипЗнч(ОписаниеПараметра) = Тип("КлючИЗначение") Тогда
		
		ЗначениеПараметраSABY	= ОписаниеПараметра.Значение;
		ДопПараметрыПродолжить	= ДопПараметры;
		
	Иначе
		
		ОписаниеПараметра.Свойство("Тип",			ТипПараметраSABY);
		ОписаниеПараметра.Свойство("Значение",		ЗначениеПараметраSABY);
		Если Не ОписаниеПараметра.Свойство("ДопПараметры",	ДопПараметрыПродолжить) Тогда
			
			ДопПараметрыПродолжить = ДопПараметры;
			
		КонецЕсли;
		
	КонецЕсли;

	ИзменитьПараметрSABY(ОписаниеПараметра.Ключ, ЗначениеПараметраSABY, ТипПараметраSABY, ДопПараметрыПродолжить);
	
КонецПроцедуры
	
// Процедура - изменить параметр обработки в объектах: ЛокальныйКэш, ГлобальныйКэш, ТекущийСеанс, КэшСБИС.
//
// Параметры:
//  ОписаниеПараметра	 - Структура/ФиксированнаяСтруктура	 - поля: "Ключ", "Значение", "Тип"
//  ДопПараметры		 - 	 - 
//
//DynamicDirective
Процедура ИзменитьПараметрSABY(КлючПараметра, ЗначениеПараметра, ТипПараметра = Неопределено, ДопПараметры = Неопределено) Экспорт
	Перем ЗначениеДляЛокальноПрописать, ЭтоГлобальныйПараметр, ДопПараметрыИзменения, СерверныйПараметр;
	
	Если Не ДопПараметры = Неопределено Тогда
		
		ДопПараметры.Свойство("Кэш",		ЗначениеДляЛокальноПрописать);
		ДопПараметры.Свойство("Глобально",	ЭтоГлобальныйПараметр);
		ДопПараметры.Свойство("Параметры",	ДопПараметрыИзменения);
		ДопПараметры.Свойство("Серверный",	СерверныйПараметр);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СерверныйПараметр) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеДляЛокальноПрописать = Неопределено Тогда
		
		ЗначениеДляЛокальноПрописать = ПолучитьТекущийЛокальныйКэш();
		
	КонецЕсли;
	
	Если ЭтоГлобальныйПараметр = Неопределено Тогда
		
		ЭтоГлобальныйПараметр = Истина;
		
	КонецЕсли;
	
	Если ТипПараметра = Неопределено Тогда
		
		// Если не указывать тип параметра для изменения, то правка проходит с применением дополнительных обработчиков
		ИзменитьПараметрSABY_Общее(КлючПараметра, ЗначениеПараметра, ЗначениеДляЛокальноПрописать, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);
		
	ИначеЕсли ТипПараметра = "Сеанс" Тогда 
		
		ИзменитьПараметрSABY_ТекущийСеанс(КлючПараметра, ЗначениеПараметра, ЗначениеДляЛокальноПрописать, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);
		
	ИначеЕсли ТипПараметра = "Сбис" Тогда 
		
		ИзменитьПараметрSABY_Сбис(КлючПараметра, ЗначениеПараметра, ДопПараметрыИзменения);
		
	ИначеЕсли ТипПараметра = "Технический" Тогда 
		
		ИзменитьПараметрSABY_Технический(КлючПараметра, ЗначениеПараметра, ЗначениеДляЛокальноПрописать, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);	
		
	ИначеЕсли ТипПараметра = "Настройки" Тогда 
		
		ИзменитьПараметрSABY_Настройки(КлючПараметра, ЗначениеПараметра, ЗначениеДляЛокальноПрописать, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);
		
	Иначе
		
		ОшибкаОбработкиПараметра = НовыйСбисИсключение("Неизвестный тип параметра!", МодульОбъектаКлиентСервер_Представление() + "ИзменитьПараметрSABY");
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаОбработкиПараметра);
		
	КонецЕсли;	
	
	// UAAРегла
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
		
		Если ЭтоГлобальныйПараметр Тогда
			
			ИзменитьПараметрСбис_ВызовСервера(КлючПараметра, ЗначениеПараметра, ДопПараметры);
			
		КонецЕсли;

	#КонецЕсли
	
КонецПроцедуры

// Процедура записывает значение параметра по имени в кэш ГО и Глобальный кэш
//
// Параметры:
//  ИмяПараметраСбис		 - Строка					 - Ключ параметра
//  ЗначениеПараметраСбис	 - Произвольное значение	 - Значение параметра установить
//  ДопПараметры			 - Структура				 - 
//		Кэш			- экземпляр ЛокальныйКэш, куда установить параметр
//		Глобально	- Булево (Истина), определяет необходимость обновить параметр глобально, или изменение касается только класса ЛокальныйКэш
//		Параметры	- Стуркутра, доп. параметры для изменения
//		Адрес		- Строка, путь в кэше для установки параметра
//
//DynamicDirective
Процедура ИзменитьПараметрСбис(ИмяПараметраСбис, ЗначениеПараметраСбис = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	ИзменитьПараметрSABY(ИмяПараметраСбис, ЗначениеПараметраСбис,, ДопПараметры);
	
КонецПроцедуры

//Процедура Получает значение параметра по имени в кэш ГО и Глобальный кэш
//DynamicDirective
Функция ПолучитьЗначениеПараметраСбис(ИмяПараметраСбис, ДопПараметры = Неопределено) Экспорт
	Перем ЗначениеПараметраСбис, ИсточникПроверкиПараметра;
	
	Если		ДопПараметры = Неопределено
		Или	Не	ДопПараметры.Свойство("ЛокальныйКэш", ИсточникПроверкиПараметра) Тогда
		
		ИсточникПроверкиПараметра = ГлобальныйКэш();
		
	КонецЕсли;
	
	Если ИсточникПроверкиПараметра = Неопределено Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Если		Не	ИсточникПроверкиПараметра.Парам.Свойство					(ИмяПараметраСбис, ЗначениеПараметраСбис)
			И	Не	ИсточникПроверкиПараметра.СБИС.Свойство						(ИмяПараметраСбис, ЗначениеПараметраСбис)
			И	Не	ИсточникПроверкиПараметра.СБИС.ПараметрыИнтеграции.Свойство	(ИмяПараметраСбис, ЗначениеПараметраСбис)
			И	Не	ИсточникПроверкиПараметра.ТекущийСеанс.Параметры.Свойство	(ИмяПараметраСбис, ЗначениеПараметраСбис)
			И	Не	ИсточникПроверкиПараметра.ТекущийСеанс.Модули.Свойство		(ИмяПараметраСбис, ЗначениеПараметраСбис) Тогда
			
		Возврат Неопределено;
		
	КонецЕсли;
		
	Возврат ЗначениеПараметраСбис;
	
КонецФункции

//Процедура Получает значение параметра по имени в кэш ГО и Глобальный кэш
//DynamicDirective
Функция ПолучитьЗначениеПараметраТекущегоСеанса(ИмяПараметраСеанса, ДопПараметры = Неопределено) Экспорт
	
	ИмяПараметраПоиск = ИмяПараметраСеанса;
	Если ИмяПараметраСеанса = "ОбщиеФункции" Тогда
		
		ИмяПараметраПоиск = "ФункцииДокументов";
		
	КонецЕсли;
	
	#Если Не ТолстыйКлиентОбычноеПриложение И НаСервере Тогда
		
		Если ИмяПараметраСеанса = "Интеграция" Тогда
			
			Возврат ТранспортИнтеграции;
			
		КонецЕсли;
		
	#КонецЕсли
	
	Возврат ПараметрSABY(ИмяПараметраПоиск, "Сеанс");
	
КонецФункции

//Процедура записывает значение параметра по имени в кэш ГО и Глобальный кэш
//DynamicDirective
Процедура ИзменитьПараметрСбис_ВКэш(КэшЗначение, АдресПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр = Истина)
	
	СтрАдрес			= СтрЗаменить(АдресПараметраСбис, ".", Символы.ПС);
	лАдресГлобальный	= ГлобальныйКэш();
	лАдресЛокальный		= КэшЗначение;
	Для СтрНомерСтрок = 1 По СтрЧислоСтрок(СтрАдрес) - 1 Цикл
		Если ЭтоГлобальныйПараметр Тогда
			лАдресГлобальный	= лАдресГлобальный[СтрПолучитьСтроку(СтрАдрес, СтрНомерСтрок)];
		КонецЕсли;
		лАдресЛокальный		= лАдресЛокальный[СтрПолучитьСтроку(СтрАдрес, СтрНомерСтрок)];
	КонецЦикла;
	лАдресЛокальный.Вставить(СтрПолучитьСтроку(СтрАдрес, СтрНомерСтрок), ЗначениеПараметраСбис);
	Если ЭтоГлобальныйПараметр Тогда
		лАдресГлобальный.Вставить(СтрПолучитьСтроку(СтрАдрес, СтрНомерСтрок),	ЗначениеПараметраСбис);
	КонецЕсли;
		
КонецПроцедуры

//DynamicDirective
Процедура ИзменитьПараметрСбис_УстановитьВКэш(ЗначениеКэшПрописать, ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр)
	
	Если		ЗначениеКэшПрописать.Парам.Свойство(ИмяПараметраСбис) Тогда
		
		//В Кэш.Парам
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "Парам." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

	ИначеЕсли   ЗначениеКэшПрописать.СБИС.Свойство(ИмяПараметраСбис) Тогда

		//В Кэш.СБИС
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли   ЗначениеКэшПрописать.СБИС.ПараметрыИнтеграции.Свойство(ИмяПараметраСбис) Тогда

		//В Кэш.СБИС.ПараметрыИнтеграции
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС.ПараметрыИнтеграции." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

	Иначе
		
		//В Кэш.ТекущийСеанс.Параметры
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Параметры." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	КонецЕсли;
	
КонецПроцедуры

