
//DynamicDirective

//Процедура Получает значение параметра по имени в кэш ГО и Глобальный кэш
Функция ПолучитьЗначениеПараметраСбис(ИмяПараметраСбис, ДопПараметры = Неопределено) Экспорт
	Перем ЗначениеПараметраСбис, ИсточникПроверкиПараметра;
	
	Если		ДопПараметры = Неопределено
		Или	Не	ДопПараметры.Свойство("ЛокальныйКэш", ИсточникПроверкиПараметра) Тогда
		
		ИсточникПроверкиПараметра = ГлобальныйКэш();
		
	КонецЕсли;
	
	Если ИсточникПроверкиПараметра = Неопределено Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Если		Не	ИсточникПроверкиПараметра.Парам.Свойство					(ИмяПараметраСбис, ЗначениеПараметраСбис)
			И	Не	ИсточникПроверкиПараметра.СБИС.Свойство						(ИмяПараметраСбис, ЗначениеПараметраСбис)
			И	Не	ИсточникПроверкиПараметра.СБИС.ПараметрыИнтеграции.Свойство	(ИмяПараметраСбис, ЗначениеПараметраСбис)
			И	Не	ИсточникПроверкиПараметра.ТекущийСеанс.Параметры.Свойство	(ИмяПараметраСбис, ЗначениеПараметраСбис)
			И	Не	ИсточникПроверкиПараметра.ТекущийСеанс.Модули.Свойство		(ИмяПараметраСбис, ЗначениеПараметраСбис) Тогда
			
		Возврат Неопределено;
		
	КонецЕсли;
		
	Возврат ЗначениеПараметраСбис;
	
КонецФункции

//DynamicDirective

//Процедура Получает значение параметра по имени в кэш ГО и Глобальный кэш
Функция ПолучитьЗначениеПараметраТекущегоСеанса(ИмяПараметраСеанса, ДопПараметры = Неопределено) Экспорт
	
	ИмяПараметраПоиск = ИмяПараметраСеанса;
	Если ИмяПараметраСеанса = "ОбщиеФункции" Тогда
		
		ИмяПараметраПоиск = "ФункцииДокументов";
		
	КонецЕсли;
	
	#Если Не ТолстыйКлиентОбычноеПриложение И НаСервере Тогда
		
		Если ИмяПараметраСеанса = "Интеграция" Тогда
			
			Возврат ТранспортИнтеграции;
			
		КонецЕсли;
		
	#КонецЕсли
	
	Возврат ПараметрSABY(ИмяПараметраПоиск, "Сеанс");
	
КонецФункции

//DynamicDirective

//Процедура записывает значение параметра по имени в кэш ГО и Глобальный кэш
Процедура ИзменитьПараметрСбис_ВКэш(КэшЗначение, АдресПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр = Истина)
	
	СтрАдрес			= СтрЗаменить(АдресПараметраСбис, ".", Символы.ПС);
	лАдресГлобальный	= ГлобальныйКэш();
	лАдресЛокальный		= КэшЗначение;
	Для СтрНомерСтрок = 1 По СтрЧислоСтрок(СтрАдрес) - 1 Цикл
		Если ЭтоГлобальныйПараметр Тогда
			лАдресГлобальный	= лАдресГлобальный[СтрПолучитьСтроку(СтрАдрес, СтрНомерСтрок)];
		КонецЕсли;
		лАдресЛокальный		= лАдресЛокальный[СтрПолучитьСтроку(СтрАдрес, СтрНомерСтрок)];
	КонецЦикла;
	лАдресЛокальный.Вставить(СтрПолучитьСтроку(СтрАдрес, СтрНомерСтрок), ЗначениеПараметраСбис);
	Если ЭтоГлобальныйПараметр Тогда
		лАдресГлобальный.Вставить(СтрПолучитьСтроку(СтрАдрес, СтрНомерСтрок),	ЗначениеПараметраСбис);
	КонецЕсли;
		
КонецПроцедуры

//DynamicDirective

Процедура ИзменитьПараметрСбис_УстановитьВКэш(ЗначениеКэшПрописать, ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр)
	
	Если		ЗначениеКэшПрописать.Парам.Свойство(ИмяПараметраСбис) Тогда
		
		//В Кэш.Парам
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "Парам." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

	ИначеЕсли   ЗначениеКэшПрописать.СБИС.Свойство(ИмяПараметраСбис) Тогда

		//В Кэш.СБИС
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли   ЗначениеКэшПрописать.СБИС.ПараметрыИнтеграции.Свойство(ИмяПараметраСбис) Тогда

		//В Кэш.СБИС.ПараметрыИнтеграции
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС.ПараметрыИнтеграции." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

	Иначе
		
		//В Кэш.ТекущийСеанс.Параметры
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Параметры." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	КонецЕсли;
	
КонецПроцедуры

