
//DynamicDirective

Функция СостояниеПрослеживаемостиПоКодуСтрокой(КодСостояния) Экспорт 
	
	Если КодСостояния = "10" Тогда
		Возврат "Проверка не проводилась"; 
	ИначеЕсли КодСостояния = "11" Тогда
		Возврат "Идёт процесс регистрации"; 
	ИначеЕсли КодСостояния = "12" Тогда
		Возврат "Успешно зарегистрированы";
	ИначеЕсли КодСостояния = "13" Тогда
		Возврат "Есть ошибки при регистрации";
	ИначеЕсли КодСостояния = "21" Тогда
		Возврат "Идёт процесс проверки кодов РНПТ в ФНС";
	ИначеЕсли КодСостояния = "22" Тогда
		Возврат "Проверка пройдена для всех кодов успешно";
	ИначеЕсли КодСостояния = "23" Тогда
		Возврат "Проверка пройдена с некоторыми ошибками"; 
	ИначеЕсли КодСостояния = "30" Тогда
		Возврат "Ошибка транспорта/API ФНС";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

