
//DynamicDirective

// Функция получает значение из объекта по указанному пути
//
// Параметры:
//  ДанныеКоллекции	 - Произвольный	 - объект, имеющий иерархию для измевлечения значения
//	ПутьКДанным		 - Строка, разделенный "." и "[" путь к данным, либо готовый массив пути
// 
// Возвращаемое значение:
//  Произвольный - найденное значение. Неопределено если найти не удалось
//
Функция ДанныеИзУниверсальнойКоллекцииПоПути(ДанныеКоллекции, ПутьКДанным) Экспорт
	
	Если ТипЗнч(ПутьКДанным) = Тип("Строка") Тогда
		
		ПутьКДаннымИзвлечь	= СтрРазделить82(СтрЗаменить(ПутьКДанным, "]", ""), ".[");
		
	Иначе
		
		ПутьКДаннымИзвлечь	= ПутьКДанным;
		
	КонецЕсли;
	
	ЗначениеРеквизита = ДанныеКоллекции;
	
	Для Каждого  Узел Из ПутьКДаннымИзвлечь Цикл
		
		Если		ТипЗнч(ЗначениеРеквизита) = Тип("Структура")
				Или	ТипЗнч(ЗначениеРеквизита) = Тип("ФиксированнаяСтруктура") Тогда
			
			ЗначениеРеквизита.Свойство(Узел, ЗначениеРеквизита);
			
		ИначеЕсли	ТипЗнч(ЗначениеРеквизита) = Тип("Соответствие") Тогда
			
			ЗначениеРеквизита = ЗначениеРеквизита.Получить(Узел);
			
		ИначеЕсли	ТипЗнч(ЗначениеРеквизита) = Тип("Массив")
				Или	ТипЗнч(ЗначениеРеквизита) = Тип("СписокЗначений") Тогда
			
			Попытка
				
				ЗначениеРеквизита = ЗначениеРеквизита.Получить(Число(Узел));  
				
			Исключение
				
				Возврат Неопределено;
				
			КонецПопытки;
			
			Если ТипЗнч(ЗначениеРеквизита) = Тип("ЭлементСпискаЗначений") Тогда
				
				ЗначениеРеквизита = ЗначениеРеквизита.Значение;
				
			КонецЕсли;

		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЗначениеРеквизита;
	
КонецФункции

