
//DynamicDirective

// Функция получает значение из объекта по указанному пути
//
// Параметры:
//  ДанныеКоллекции	 - Произвольный	 - объект, имеющий иерархию для измевлечения значения
//	ПутьКДанным		 - Строка, разделенный "." и "[" путь к данным, либо готовый массив пути
// 
// Возвращаемое значение:
//  Произвольный - найденное значение. Неопределено если найти не удалось
//
Функция ДанныеИзУниверсальнойКоллекцииПоПути(ДанныеКоллекции, ПутьКДанным) Экспорт
	
	Если ТипЗнч(ПутьКДанным) = Тип("Строка") Тогда
		
		ПутьКДаннымИзвлечь	= Saby_СтрРазделить82(СтрЗаменить(ПутьКДанным, "]", ""), ".[");
		
	Иначе
		
		ПутьКДаннымИзвлечь	= ПутьКДанным;
		
	КонецЕсли;
	
	ЗначениеРеквизита = ДанныеКоллекции;
	
	Для Каждого  Узел Из ПутьКДаннымИзвлечь Цикл
		
		Если		ТипЗнч(ЗначениеРеквизита) = Тип("Структура")
				Или	ТипЗнч(ЗначениеРеквизита) = Тип("ФиксированнаяСтруктура") Тогда
			
			ЗначениеРеквизита.Свойство(Узел, ЗначениеРеквизита);
			
		ИначеЕсли	ТипЗнч(ЗначениеРеквизита) = Тип("Соответствие") Тогда
			
			ЗначениеРеквизита = ЗначениеРеквизита.Получить(Узел);
			
		ИначеЕсли	ТипЗнч(ЗначениеРеквизита) = Тип("Массив")
				Или	ТипЗнч(ЗначениеРеквизита) = Тип("СписокЗначений") Тогда
			
			Попытка
				
				ЗначениеРеквизита = ЗначениеРеквизита.Получить(Число(Узел));  
				
			Исключение
				
				Возврат Неопределено;
				
			КонецПопытки;
			
			Если ТипЗнч(ЗначениеРеквизита) = Тип("ЭлементСпискаЗначений") Тогда
				
				ЗначениеРеквизита = ЗначениеРеквизита.Значение;
				
			КонецЕсли;

		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЗначениеРеквизита;
	
КонецФункции

// Функция возвращает результат поиска значения в массиве структур
//
// Параметры:
//  МассивДляПоиска		 - Массив - Массив для поиска
//  ЗначениеСтруктуры	 - Произвольный - Значение для поиска
//  КлючСтруктуры		 - Строка - Ключ структуры для поиска
// 
// Возвращаемое значение:
//  Структура - Найденное значение (ЭлементМассива) или Неопределено
//
//DynamicDirective
Функция НайтиВМассивеСтруктурПоКлючу(МассивДляПоиска, ЗначениеСтруктуры, КлючСтруктуры) Экспорт	
	Результат = Неопределено;	
	Для Каждого ЭлементМассива Из МассивДляПоиска Цикл
		Если ЗначениеЗаполнено(Результат) Тогда Прервать; КонецЕсли;
		Если ТипЗнч(ЭлементМассива) = Тип("Структура") Тогда
			Для Каждого ЭлементСтруктуры Из ЭлементМассива Цикл
				Если ЭлементСтруктуры.Ключ = КлючСтруктуры
					И ЭлементСтруктуры.Значение = ЗначениеСтруктуры Тогда
					Результат = ЭлементМассива;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;	
КонецФункции

// Специфическая Функция возвращает результат поиска значения в массиве структур со значениями с ключами "Имя" и "Значение"
//
// Параметры:
//  МассивДляПоиска		 - Массив - Массив для поиска
//  Имя	 				 - Строка - Значение в структуре с ключом Имя
//  ИмяСтруктуры		 - Строка - Значение в структуре с ключом Значение
// 
// Возвращаемое значение:
//  Структура - Найденное значение (ЭлементМассива) или Неопределено
//
//DynamicDirective
Функция НайтиВМассивеСтруктурПоИмениИЗначению(МассивДляПоиска, Имя, Значение) Экспорт	
	
	Результат = Неопределено;	
	
	Для Каждого ЭлементМассива Из МассивДляПоиска Цикл
		
		Если ЗначениеЗаполнено(Результат) Тогда
			Прервать;
		КонецЕсли;
		
		ВыполнятьПоиск =	ТипЗнч(ЭлементМассива) = Тип("Структура")
							И ЭлементМассива.Свойство("Имя")
							И ЭлементМассива.Свойство("Значение");
		
		Если ВыполнятьПоиск Тогда
			Если	ЭлементМассива.Имя = Имя
					И ЭлементМассива.Значение = Значение Тогда
				Результат = ЭлементМассива;
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Специфическая Функция возвращает ПЕРВЫЙ ПОПАВШИЙСЯ результат поиска значения в массиве структур со значениями с ключами "Имя" и "Значение"
//
// Параметры:
//  МассивДляПоиска		 - Массив - Массив для поиска
//  Имя	 				 - Строка - Значение в структуре с ключом Имя
// 
// Возвращаемое значение:
//  Найденное значение (элемент структуры "Значение") или Неопределено
//
//DynamicDirective
Функция НайтиВМассивеСтруктурЗначениеПоИмени(МассивДляПоиска, Имя) Экспорт	
	
	Результат = Неопределено;	
	
	Для Каждого ЭлементМассива Из МассивДляПоиска Цикл
		
		Если ЗначениеЗаполнено(Результат) Тогда
			Прервать;
		КонецЕсли;
		
		ВыполнятьПоиск =	ТипЗнч(ЭлементМассива) = Тип("Структура")
							И ЭлементМассива.Свойство("Имя")
							И ЭлементМассива.Свойство("Значение");
		
		Если ВыполнятьПоиск Тогда
			Если	ЭлементМассива.Имя = Имя Тогда
				Результат = ЭлементМассива.Значение;
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает массив уникальных значений по ключу структуры
//
// Параметры:
//  МассивИсточник	 - Массив - Массив для поиска 
//  КлючСтруктуры	 - Строка - Ключ структуры для поиска
// 
// Возвращаемое значение:
//  Массив - Найденное значение (ЭлементМассива) или пустой массив
//
//DynamicDirective
Функция СвернутьМассивСтруктурПоКлючу(МассивИсточник, КлючСтруктуры) Экспорт
			
	УникальныеЗначения = Новый Соответствие;  
	МассивПриемник = Новый Массив;
			
	Для Каждого Значение Из МассивИсточник Цикл
		Если УникальныеЗначения[Значение[КлючСтруктуры]] = Неопределено Тогда
			МассивПриемник.Добавить(Значение);
			УникальныеЗначения.Вставить(Значение[КлючСтруктуры], Истина);
		КонецЕсли;
	КонецЦикла; 
	
	Возврат МассивПриемник;		
	
КонецФункции

