
&НаКлиенте
Процедура ПередЗакрытиемОбработчик(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если	ПараметрыФормы.РежимЗакрытия = "ОК"
		И	ОписаниеОповещенияОЗакрытии = Неопределено Тогда
		
		// Для старой обработки, если форму настроек получали без указания что делать дальше
		ОбработкаЗавершения		= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("СбисПрименитьНастройки_Завершение", ЭтаФорма);
		ПараметрыЗавершить		= Новый Структура("ОписаниеОповещения, Аргумент", ОбработкаЗавершения, ПараметрыФормы.Результат.РезультатОбработки);
		ОтложенноеЗавершение	= МодульОбъектаКлиент().НовыйОтложенноеДействие(ПараметрыЗавершить);
		МодульОбъектаКлиент().ПодключитьОтложенноеДействие(ОтложенноеЗавершение);
		
	ИначеЕсли ПараметрыФормы.РежимЗакрытия = "Отмена" Тогда
		
		ФормаЗакрытьУстановитьСтатусЗавершить();
		
	ИначеЕсли ПараметрыФормы.РежимЗакрытия = "Завершить" Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПроверитьИПрименитьПараметрыПередЗакрытием(ПараметрыНовые, Отказ)
	
		Возврат 0;
	
КонецФункции

