
// пустая структура документа в формате 3.01
// 
// Возвращаемое значение:
//  Структура - пустая структура файла
//
&НаКлиенте
Функция НовыйСтруктураФайла(ПараметрыФайла) Экспорт
	
	СтруктураДокумента = Новый Структура("Дата, Номер, ТаблДок");
	СтруктураДокумента.Дата		= ПараметрыФайла.Дата;
	СтруктураДокумента.Номер	= ПараметрыФайла.Номер;
	СтруктураДокумента.ТаблДок	=  Новый Структура("СтрТабл", Новый  Массив);
	
	СтруктураФайлаКонтрагента = Новый Структура("_класс, Файл", "СтруктураФайла", Новый структура("ВерсияФормата", "3.01")); 
	СтруктураФайлаКонтрагента.Файл.Вставить("Документ", СтруктураДокумента);
	
	Возврат  СтруктураФайлаКонтрагента;
	
КонецФункции

