
// пустая структура документа в формате 3.01
// 
// Возвращаемое значение:
//  Структура - пустая структура файла
//
&НаКлиенте
Функция НовыйСтруктураФайла(ПараметрыФайла) Экспорт
	
	СтруктураДокумента = Новый Структура("Дата, Номер, ТаблДок");
	СтруктураДокумента.Дата		= ПараметрыФайла.Дата;
	СтруктураДокумента.Номер	= ПараметрыФайла.Номер;
	СтруктураДокумента.ТаблДок	=  Новый Структура("СтрТабл", Новый  Массив);
	
	СтруктураФайлаКонтрагента = Новый Структура("_класс, Файл", "СтруктураФайла", Новый структура("ВерсияФормата", "3.01")); 
	СтруктураФайлаКонтрагента.Файл.Вставить("Документ", СтруктураДокумента);
	
	Возврат  СтруктураФайлаКонтрагента;
	
КонецФункции

&НаКлиенте
Функция СтруктураФайла_Получить(СтруктураФайла, КлючПолучить, ДопПараметры = Неопределено) Экспорт
	Перем ЗначениеИтог;
	
	Если НЕ ЗначениеЗаполнено(СтруктураФайла) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	Если	КлючПолучить = "Сторона"
		И	ДопПараметры.Свойство("ИмяСтороны")
		И	ЗначениеЗаполнено(ДопПараметры.ИмяСтороны) Тогда
		
		СтруктураФайла.Файл.Документ.Свойство(ДопПараметры.ИмяСтороны, ЗначениеИтог);
		
	ИначеЕсли КлючПолучить = "ПутьКОсновнымДанным" Тогда
		
		Возврат "Файл.Документ.";
		
	ИначеЕсли КлючПолучить = "ПутьКТабличнойЧасти" Тогда
		
		Возврат "Файл.Документ.ТаблДок.СтрТабл";
		
	Иначе
		
		СтруктураФайла.Свойство(КлючПолучить, ЗначениеИтог);
		
	КонецЕсли;
	
	Возврат ЗначениеИтог;
	
КонецФункции

