
&НаКлиенте
Функция ПолучитьДанныеИзДокумента1С(Кэш, Контекст, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;

	// Функция формирует структуру выгружаемого файла и добавляет его в состав пакета
	Попытка	
		Контекст.Вставить("ТаблДок",Новый Структура());
		Контекст.ТаблДок.Вставить("ИтогТабл",Новый Массив);
		Контекст.ТаблДок.Вставить("СтрТабл",Новый Массив);
		Контекст.Вставить("ИтогСумма",0);
		Контекст.Вставить("ИтогСуммаБезНалога",0);
		Контекст.Вставить("ИтогСуммаНДС",0);
		Контекст.Вставить("ИтогКоличество",0);
		Контекст.Вставить("ИтогБрутто",0);
		Контекст.Вставить("ИтогНетто",0);
		Контекст.Вставить("ИтогКолМест",0);
		
		Контекст.Вставить("ПредИтогСумма",0);
		Контекст.Вставить("ПредИтогСуммаБезНалога",0);
		Контекст.Вставить("ПредИтогСуммаНДС",0);
		Контекст.Вставить("НДСИсчисляетсяАгентом", Кэш.ОбщиеФункции.РассчитатьЗначение("НДСИсчисляетсяАгентом", Контекст.ФайлДанные) = Истина);
		
		НоменклатураКодКонтрагента = Кэш.ОбщиеФункции.РассчитатьЗначение("НоменклатураКодКонтрагента", Контекст.ФайлДанные,Кэш);  // надо сопоставить номенклатуру перед отправкой
		Если ЗначениеЗаполнено(НоменклатураКодКонтрагента) Тогда
			Контекст.Вставить("НоменклатураКодКонтрагента",НоменклатураКодКонтрагента);	
		КонецЕсли;
		
		ИмяФормыПоФормату = "Файл_" + Контекст.ФайлДанные.Файл_Формат + "_" + СтрЗаменить(СтрЗаменить(Контекст.ФайлДанные.Файл_ВерсияФормата, ".", "_"), " ", "");
		
		МассивМодулей = Новый Массив;
		МассивМодулей.Добавить(ИмяФормыПоФормату);
		МассивМодулей.Добавить("Файл_Шаблон");

		МодульДанныхСтроки = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ПолучитьТабличнуюЧастьДокумента1С", МассивМодулей);
		
		МодульДанныхСтроки.ПолучитьТабличнуюЧастьДокумента1С(Кэш, Контекст);
	
		Если Контекст.ТаблДок.СтрТабл.Количество() = 0 //нет такого документа
			И НЕ (Контекст.Свойство("ПустаяТаблицаДоступна")
				И Контекст.ПустаяТаблицаДоступна) Тогда
			Возврат Истина;
		КонецЕсли;
		
		Если Контекст.ФайлДанные.Свойство("мТаблДетал") Тогда
			Контекст.Вставить("ТаблДетал",Новый Структура());                 
			Контекст.ТаблДетал.Вставить("СтрТабл",Новый Массив);	
			ПолучитьДетализациюТабЧастиДокумента1С(Кэш,Контекст);
		КонецЕсли;
		
		ИтогТабл=Новый Структура;
		ИтогТабл.Вставить("Кол_во", Формат(Контекст.ИтогКоличество, "ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.000"));
		ИтогТабл.Вставить("Сумма", Формат(Контекст.ИтогСумма, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));	
		ИтогТабл.Вставить("СуммаБезНал", Формат(Контекст.ИтогСуммаБезНалога, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));
		ИтогТабл.Вставить("НДС",Новый Структура);
		ИтогТабл.НДС.Вставить("Сумма",Формат(Контекст.ИтогСуммаНДС, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));	
		Если Контекст.ИтогКолМест>0 Тогда
			ИтогТабл.Вставить("Упаковка",Новый Структура);
			ИтогТабл.Упаковка.Вставить("КолМест",Формат(Контекст.ИтогКолМест, "ЧЦ=17; ЧДЦ=0; ЧРД=.; ЧГ=0; ЧН=0"));	
		КонецЕсли;
		
		Если Контекст.ФайлДанные.Свойство("ЕдиницаИзмеренияВеса") Тогда
			ЕдиницаИзмеренияВеса = Контекст.ФайлДанные.ЕдиницаИзмеренияВеса;
				ИтогТаблБрутто = Новый Структура;
			Если Контекст.ФайлДанные.Свойство("МассаБруттоИтогПрописью") Тогда
				ИтогТаблБрутто.Вставить("Прописью", Кэш.ОбщиеФункции.РассчитатьЗначение("МассаБруттоИтогПрописью", Контекст.ФайлДанные,Кэш));  
				ИтогТабл.Вставить("Брутто", ИтогТаблБрутто);
			ИначеЕсли Контекст.ИтогБрутто > 0 Тогда
				ИтогТаблБрутто.Вставить("Кол_во", Формат(Контекст.ИтогБрутто, "ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.00"));
				Если Контекст.ФайлДанные.Свойство("МассаИтогПрописью") Тогда
					Контекст.ФайлДанные.Вставить("МассаИтог", Контекст.ИтогБрутто);
					ИтогТаблБрутто.Вставить("Прописью", Кэш.ОбщиеФункции.РассчитатьЗначение("МассаИтогПрописью", Контекст.ФайлДанные,Кэш));
				Иначе	
					ИтогТаблБрутто.Вставить("Прописью", ЧислоПрописью(Контекст.ИтогБрутто, ,",,,,,,,,0")+ " " + СокрЛП(ЕдиницаИзмеренияВеса) + ".");
				КонецЕсли;	
				ИтогТабл.Вставить("Брутто", ИтогТаблБрутто);
			КонецЕсли;
			
			Если Контекст.ИтогНетто > 0 Тогда
				ИтогТаблНетто = Новый Структура;
				ИтогТаблНетто.Вставить("Кол_во", Формат(Контекст.ИтогНетто, "ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.00"));
				Если Контекст.ФайлДанные.Свойство("МассаИтогПрописью") Тогда
					Контекст.ФайлДанные.Вставить("МассаИтог", Контекст.ИтогНетто);
					ИтогТаблНетто.Вставить("Прописью", Кэш.ОбщиеФункции.РассчитатьЗначение("МассаИтогПрописью", Контекст.ФайлДанные,Кэш));
				Иначе	
					ИтогТаблНетто.Вставить("Прописью", ЧислоПрописью(Контекст.ИтогНетто, ,",,,,,,,,0")+ " " + СокрЛП(ЕдиницаИзмеренияВеса) + ".");
				КонецЕсли;	
				ИтогТабл.Вставить("Нетто", ИтогТаблНетто);
			КонецЕсли;
		КонецЕсли;
		
		Если Контекст.Свойство("ЕстьПредыдущиеДанные") Тогда
			ПредИтогТабл=Новый Структура;
			ПредИтогТабл.Вставить("Сумма", Формат(Контекст.ПредИтогСумма, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));	
			ПредИтогТабл.Вставить("СуммаБезНал", Формат(Контекст.ПредИтогСуммаБезНалога, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));
			ПредИтогТабл.Вставить("НДС",Новый Структура);
			ПредИтогТабл.НДС.Вставить("Сумма",Формат(Контекст.ПредИтогСуммаНДС, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));	
			ИтогТабл.Вставить("ПредИтогТабл",ПредИтогТабл);
		КонецЕсли;
		
		//Контекст.ТаблДок.Вставить("ИтогТабл",Новый Массив);
		Контекст.ТаблДок.ИтогТабл.Добавить(ИтогТабл);
		
		
		Док  = Новый Структура;
		Док.Вставить("Файл", Новый Структура);
		Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Файл",Контекст.ФайлДанные,Док.Файл);
		
		Док.Файл.Вставить("Документ",Новый Структура);
		Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Документ",Контекст.ФайлДанные,Док.Файл.Документ);
		
		Док.Файл.Документ.Вставить("Основание",Новый Массив);
		
		Валюта =  Кэш.ОбщиеФункции.РассчитатьЗначение("Валюта_КодОКВ", Контекст.ФайлДанные, Кэш);
		Если ЗначениеЗаполнено(Валюта) Тогда
			Док.Файл.Документ.Вставить("Валюта",Новый Структура);
			Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Валюта",Контекст.ФайлДанные,Док.Файл.Документ.Валюта);
		КонецЕсли;
		
		ПараметрыКонструктора = Новый Структура("ГрязныйИни, ДокументФайл, ДокументСсылка", Контекст.ФайлДанные, Док, Контекст.Документ);

		ПолучитьДанныеИзДокумента1С_мСторона(Кэш, ПараметрыКонструктора, Контекст);
		ПолучитьДанныеИзДокумента1С_мОснование(Кэш, ПараметрыКонструктора, Контекст);
		
		Если Контекст.ФайлДанные.Свойство("АдресДоставки") И Контекст.ФайлДанные.АдресДоставки <> Неопределено Тогда
			Док.Файл.Документ.Вставить("АдресДоставки", Кэш.ОбщиеФункции.РассчитатьЗначение("АдресДоставки", Контекст.ФайлДанные, Кэш));
		КонецЕсли;
		Если Контекст.ФайлДанные.Свойство("АдресПогрузки") И Контекст.ФайлДанные.АдресПогрузки <> Неопределено Тогда
			Док.Файл.Документ.Вставить("АдресПогрузки", Кэш.ОбщиеФункции.РассчитатьЗначение("АдресПогрузки", Контекст.ФайлДанные, Кэш));
		КонецЕсли;
		
		ДобавитьМПараметр(Кэш, Контекст.ФайлДанные, Док.Файл.Документ);
		
		КонтекстДляКонтура = МодульОбъектаКлиент().СоздатьКопиюОбъекта(Контекст);
		КонтекстДляКонтура.Вставить("Ини", Контекст.ФайлДанные);
		РезультатПоКонтуру = Кэш.ОбщиеФункции.РассчитатьЗначение("сбисПолучитьДанныеПоКонтуру", КонтекстДляКонтура, Кэш);
		Если Не РезультатПоКонтуру = Неопределено Тогда
			РазложитьДанныеПоКонтуру(РезультатПоКонтуру, Док.Файл.Документ, Контекст.ТаблДок.СтрТабл);
		КонецЕсли;
		
		Если Контекст.ФайлДанные.Свойство("мТранспортноеСредство") Тогда
			Док.Файл.Документ.Вставить("ТранспортноеСредство",Новый Массив);
			Для Каждого Элемент Из Контекст.ФайлДанные.мТранспортноеСредство Цикл
				Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Контекст.ФайлДанные,Элемент.Значение);
				ТранспортноеСредство = Новый Структура();
				Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"ТранспортноеСредство",Контекст.ФайлДанные,ТранспортноеСредство);
				Док.Файл.Документ.ТранспортноеСредство.Добавить(ТранспортноеСредство);
			КонецЦикла;
		КонецЕсли;

		ПолучитьДанныеИзДокумента1С_СуммаВложения(Кэш, ПараметрыКонструктора, Контекст);	
		
		Док.Файл.Документ.Вставить("ТаблДок", Контекст.ТаблДок);
		Если	Контекст.Свойство("ТаблДетал")
			И	Контекст.ТаблДетал.СтрТабл.Количество() Тогда
			Док.Файл.Документ.Вставить("ТаблДетал", Контекст.ТаблДетал);
		КонецЕсли;
		
		КонтекстДляСопоставления = Новый Структура("ИдОснования, НеИскатьПоДокументу");
		Если Контекст.Свойство("ИдОснования") Тогда
			КонтекстДляСопоставления.Вставить("ИдОснования", Контекст.ИдОснования);
		КонецЕсли;
		Если Контекст.Свойство("НеИскатьПоДокументу") Тогда
			КонтекстДляСопоставления.Вставить("НеИскатьПоДокументу", Контекст.НеИскатьПоДокументу);
		КонецЕсли;
		КонтекстДляСопоставления.Вставить("ПересчетПоДокументуОснованию", Истина);
		КонтекстДляСопоставления.Вставить("НаправлениеПересчета", "Выгрузка");
		
		ПараметрыКонструктора.Вставить("КонтекстДляСопоставления", КонтекстДляСопоставления);
		
		Вложение = МодульОбъектаКлиент().НовыйВложениеСБИС(ПараметрыКонструктора);
		
		ПолучитьДанныеИзДокумента1С_ПослеФормированияВложения(Кэш, Контекст, Вложение, ДопПараметры);
		Возврат Истина;
		
	Исключение
		
		ИсключениеФормирования = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "Файл_Шаблон.ПолучитьШапкуИзДокумента1С");
		Контекст.СоставПакета.Вставить("Ошибка", ИсключениеФормирования);
		Возврат Ложь;
		
	КонецПопытки;
КонецФункции

&НаКлиенте
Процедура ПолучитьДанныеИзДокумента1С_ПослеФормированияВложения(Кэш, Контекст, Вложение, ДопПараметры) Экспорт
	
	ПараметрыДобавить	= Новый Структура("Контекст, ДополнительныеПараметры", Контекст, ДопПараметры);
	Док					= МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "СтруктураДокумента");
	АргументыТочкиВхода = Новый Структура("Док, Кэш, Контекст", Док, Кэш, Контекст);
		
	// Пока временно тут, чтоб сработало объединение вложений
	// Перенести в функцию генерации вложений СгенерироватьВложенияВПакет.
	МодульОбъектаКлиент().СоставПакета_Вставить(Контекст.СоставПакета, , Вложение, ПараметрыДобавить);
	МодульОбъектаКлиент().ВложениеСБИС_ПослеФормированияДокумента(Вложение, АргументыТочкиВхода);
	
	// После вызова проверить косяки с передачей переменных на сервер.
	ВложениеДляОбновить = Вложение;
	Если Не Контекст = АргументыТочкиВхода.Контекст Тогда
		
		// Контекст передавали на сервер. Нужно найти вложение в измененном на сервере документе
		Контекст = АргументыТочкиВхода.Контекст;
		ВложениеДляОбновить = МодульОбъектаКлиент().СоставПакета_Получить(Контекст.СоставПакета, "Вложение", Вложение);
		
	КонецЕсли;
	
	Если Не АргументыТочкиВхода.Док = Док Тогда
		
		// Док передавался на сервер в функции сбисПослеФормированияДокумента.
		МодульОбъектаКлиент().ВложениеСбис_Обновить(ВложениеДляОбновить, АргументыТочкиВхода.Док, "СтруктураФайла");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеИзДокумента1С_мСторона(Кэш, ПараметрыКонструктора, Контекст) Экспорт
	
	ПолучитьДанныеИзДокумента1С_СформироватьДанныеСторон(Кэш, ПараметрыКонструктора, Контекст);
	ПолучитьДанныеИзДокумента1С_ЗаполнитьСтороны(Кэш, ПараметрыКонструктора, Контекст);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеИзДокумента1С_СформироватьДанныеСторон(Кэш, ПараметрыКонструктора, Контекст) Экспорт
	Перем СторонаДляПроверки;
	
	Док = ПараметрыКонструктора.ДокументФайл;

	ОтправительРоль = Кэш.ОбщиеФункции.РассчитатьЗначение("Отправитель_Роль", Контекст.ФайлДанные, Кэш);
	ПолучательРоль	= Кэш.ОбщиеФункции.РассчитатьЗначение("Получатель_Роль", Контекст.ФайлДанные, Кэш);
	
	Если Не ЗначениеЗаполнено(ОтправительРоль) Тогда
		
		ОтправительРоль = "Отправитель";
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПолучательРоль) Тогда
		
		ПолучательРоль = "Получатель";
		
	КонецЕсли;
	
	ПараметрыКонструктора.Вставить("ОтправительРоль",	ОтправительРоль);
	ПараметрыКонструктора.Вставить("ПолучательРоль",	ПолучательРоль);
	
	Стороны = Новый Структура;
 	ПараметрыКонструктора.Вставить("ДанныеСторон", Стороны); // Стороны пробросить в "полном виде"

	Если Не Контекст.ФайлДанные.Свойство("мСторона") Тогда
		
		Возврат;
		
	КонецЕсли;
		
	Для Каждого Параметр Из Контекст.ФайлДанные.мСторона Цикл
		
		Сторона = МодульОбъектаКлиент().НовыйСторонаSABY(Параметр.Значение);
		
		Если Не Сторона = Неопределено Тогда
			
			Стороны.Вставить(Сторона.Роль, Сторона);
			
		КонецЕсли;
		
	КонецЦикла;

	
	ПолучитьДанныеИзДокумента1С_ПроверитьСторону(ПараметрыКонструктора, Контекст, "Отправитель");
	ПолучитьДанныеИзДокумента1С_ПроверитьСторону(ПараметрыКонструктора, Контекст, "Получатель");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеИзДокумента1С_ПроверитьСторону(ПараметрыКонструктора, Контекст, ИмяРоли)
	Перем РольМожетОтсутствовать, СторонаДляПроверки, СторонаПеренести;
	
	Контекст.Свойство(ИмяРоли + "МожетОтсутствовать", РольМожетОтсутствовать);
	РольМожетОтсутствовать	= РольМожетОтсутствовать = Истина;
	ИмяРолиСклонение		= СтрЗаменить(ИмяРоли, "ь", "я");
	КлючРоли				= ПараметрыКонструктора[ИмяРоли + "Роль"];
	Стороны					= ПараметрыКонструктора.ДанныеСторон;
	
	Если НЕ Стороны.Свойство(КлючРоли, СторонаДляПроверки) Тогда
		
		Если РольМожетОтсутствовать Тогда
			
			Стороны.Вставить(ИмяРоли);
			
		КонецЕсли;
		
		ДетализацияОшибки = "Отсутствует " + НРег(ИмяРоли) + " документа";
		Если Не КлючРоли = ИмяРоли Тогда
			
			ДетализацияОшибки = ДетализацияОшибки + " (" + КлючРоли + ")";
			
		КонецЕсли;
		ОшибкаСтороны = МодульОбъектаКлиент().НовыйСбисИсключение(
			779201,
			"Файл_Шаблон.ПолучитьДанныеИзДокумента1С.мСторона",,,
			ДетализацияОшибки);
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(ОшибкаСтороны);
		
	Иначе 
		
		Если МодульОбъектаКлиент().ЭтоТипСБИС(СторонаДляПроверки, "ПрикладнойОбъектSaby") Тогда
			
			ИнОрг = МодульОбъектаКлиент().СторонаSaby_Получить(СторонаДляПроверки, "ИностраннаяОрганизация");
			ИдентификационныйНомер = МодульОбъектаКлиент().СторонаSaby_Получить(СторонаДляПроверки, "ИдентификационныйНомер"); 
			
			Если	Не ИнОрг 
				И	Не ЗначениеЗаполнено(ИдентификационныйНомер) 
				И	Не РольМожетОтсутствовать Тогда
				
				// Старая логика Отсутствие ИНН = Отсутствие стороны
				ОшибкаСтороны = МодульОбъектаКлиент().НовыйСбисИсключение(, "Файл_Шаблон.ПолучитьДанныеИзДокумента1С.мСторона",780301,,
				"Не удалось определить ИНН " + ИмяРолиСклонение + " документа " + Строка(Контекст.Документ));
				ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(ОшибкаСтороны);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	КлючРолиДоп				= "Грузо" + НРег(ИмяРоли);
	СкопироватьДопСторону	=	(	Не	Контекст.Свойство("ЗаполнятьГрузотпрГрузполуч")
							 	Или		Контекст.ЗаполнятьГрузотпрГрузполуч = Истина) // опция для отключения
							И	Контекст.ФайлДанные.мСторона.Свойство(КлючРолиДоп) // В данных ини сторона есть
							И	(	Не	Стороны.Свойство(КлючРолиДоп, СторонаДляПроверки) // но она пустая, либо не посчиталась
								Или		МодульОбъектаКлиент().СторонаSaby_Пустая(СторонаДляПроверки));
		
	Если Не СкопироватьДопСторону Тогда							

		Возврат;	
		
	КонецЕсли;	
		
	КлючКопироватьСторонуС	= "КопироватьГрузо" + ИмяРолиСклонение + "С";
	ИмяРолиДляСкопировать	= КлючРоли;
	Если Контекст.ФайлДанные.Свойство(КлючКопироватьСторонуС) Тогда
		
		МодульРасчета			= МодульОбъектаКлиент().ПараметрSaby("ФункцииДокументов", "Сеанс");
		ИмяРолиДляСкопировать	= МодульРасчета.РассчитатьЗначение(КлючКопироватьСторонуС, Контекст.ФайлДанные);
		
	КонецЕсли;
	
	Если Стороны.Свойство(ИмяРолиДляСкопировать, СторонаПеренести) Тогда
		
		Стороны.Вставить(КлючРолиДоп, МодульОбъектаКлиент().СторонаSABY_Скопировать(СторонаПеренести));
		
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПолучитьДанныеИзДокумента1С_СуммаВложения(Кэш, ПараметрыКонструктора, Контекст) Экспорт
	Перем СбисНДСИсчисляетсяАгентом;
	
	Если Не Контекст.Свойство("НДСИсчисляетсяАгентом", СбисНДСИсчисляетсяАгентом) Тогда
		
		СбисНДСИсчисляетсяАгентом = Кэш.ОбщиеФункции.РассчитатьЗначение("НДСИсчисляетсяАгентом", Контекст.ФайлДанные) = Истина;
			
	КонецЕсли;
	
	Если СбисНДСИсчисляетсяАгентом Тогда
		
		СуммаВложения = Формат(Контекст.ИтогСуммаБезНалога, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00");
		
	Иначе
		
		СуммаВложения = Формат(Контекст.ИтогСумма, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00");
		
	КонецЕсли;
	
	ПараметрыКонструктора.Вставить("СуммаВложения",		СуммаВложения);
		
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеИзДокумента1С_мОснование(Кэш, ПараметрыКонструктора, Контекст) Экспорт
    Перем УзлыМОснование;
	
	Если Не Контекст.ФайлДанные.Свойство("мОснование", УзлыМОснование) Тогда
		
		Возврат;
		
	КонецЕсли;

	Док = ПараметрыКонструктора.ДокументФайл;
	Ключ_мОснование = "Основание";
	
	Для Каждого Параметр Из Контекст.ФайлДанные.мОснование Цикл
		
		ВременныйКонтекстФайлДанные = Кэш.ОбщиеФункции.СкопироватьОбъектСПараметрамиКлиент(Контекст.ФайлДанные, , Ложь);
		Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(ВременныйКонтекстФайлДанные, Параметр.Значение);
			
		Если ТипЗнч(Параметр.Значение) = Тип("Массив") Тогда
			НаборОснований = Параметр.Значение;
		Иначе
			НаборОснований = Кэш.ОбщиеФункции.РассчитатьЗначение(Ключ_мОснование, ВременныйКонтекстФайлДанные);
		КонецЕсли;
		
		Если ТипЗнч(НаборОснований) = Тип("Массив") Тогда
			
			Для Каждого Элемент Из НаборОснований Цикл
				ВременныйКонтекстФайлДанные = Кэш.ОбщиеФункции.СкопироватьОбъектСПараметрамиКлиент(Контекст.ФайлДанные, , Ложь);
				Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(ВременныйКонтекстФайлДанные, Элемент);
				Основание = Новый Структура();
				Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш, "Основание", ВременныйКонтекстФайлДанные, Основание);
				Док.Файл.Документ.Основание.Добавить(Основание);	
			КонецЦикла;
			
		Иначе
			
			Основание = Новый Структура();
			Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш, "Основание", ВременныйКонтекстФайлДанные, Основание);
			Док.Файл.Документ.Основание.Добавить(Основание);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Получить данные из документа1 с м связанное вложение
//
// Параметры:
//  Кэш			 - Структура - Кэш обработки 
//  Контекст	 - Структура - контекст расчета
//  ДопПараметры - Структура - дополнительный параметры. ОБЯЗАТЕЛЬНЫЕ: ОсновныеФормыВФК 
//
&НаКлиенте
Процедура ПолучитьДанныеИзДокумента1С_мСвязанноеВложение(Кэш, Контекст, ДопПараметры) Экспорт
	
	ОсновныеФормыВФК		= ДопПараметры.ОсновныеФормыВФК;
	СписокСвязанныхВложений	= Новый СписокЗначений;
	ТипыСвязанныхВложений	= Новый Соответствие;
	ТипыСвязанногоВложения	= Новый Массив;
	Если Не Контекст.Свойство("СписокГотовыхСвязанныхВложений") Тогда
		СписокГотовыхСвязанныхВложений	= Новый СписокЗначений;
		Контекст.Вставить("СписокГотовыхСвязанныхВложений", СписокГотовыхСвязанныхВложений);
	КонецЕсли;
	
	Для Каждого СвязанноеВложение Из Контекст.ФайлДанные.мСвязанноеВложение Цикл
		
		СвязанноеВложениеКлюч	= СвязанноеВложение.Ключ;
		СвязанноеВложение		= СвязанноеВложение.Значение;
		
		СвязанноеВложение_ДокументСсылка	= СвязанноеВложение.СвязанноеВложение_Документ;
		Если Не ЗначениеЗаполнено(СвязанноеВложение_ДокументСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ТипыСвязанногоВложения = ТипыСвязанныхВложений.Получить(СвязанноеВложение_ДокументСсылка);
		Если ТипыСвязанногоВложения = Неопределено Тогда
			ТипыСвязанногоВложения = Новый Массив;
		КонецЕсли;
		СвязанноеВложение_ТипыВложения		= СвязанноеВложение.СвязанноеВложение_Тип;
		ТипыВложения = МодульОбъектаКлиент().СбисРазложитьСтрокуВМассивПодстрок(СвязанноеВложение_ТипыВложения, ",");
		Для Каждого ТипВложения Из ТипыВложения Цикл
			ТипыСвязанногоВложения.Добавить(ТипВложения);
		КонецЦикла;
		ТипыСвязанныхВложений.Вставить(СвязанноеВложение_ДокументСсылка, ТипыСвязанногоВложения);
		
		СвязанноеВложение_ИмяИни			= СвязанноеВложение.СвязанноеВложение_Ини;
		
		ГотовоеСвязанноеВложение = Контекст.СписокГотовыхСвязанныхВложений.НайтиПоЗначению(СвязанноеВложение_ДокументСсылка);
		Если ГотовоеСвязанноеВложение <> Неопределено И ГотовоеСвязанноеВложение.Представление = СвязанноеВложение_ИмяИни Тогда
			Продолжить;
		Иначе
			Контекст.СписокГотовыхСвязанныхВложений.Добавить(СвязанноеВложение_ДокументСсылка, СвязанноеВложение_ИмяИни);
		КонецЕсли;
		
		ВложениеИзСписка = СписокСвязанныхВложений.НайтиПоЗначению(СвязанноеВложение_ДокументСсылка);
		Если ВложениеИзСписка <> Неопределено Тогда
			ВложениеИзСписка.Представление = ВложениеИзСписка.Представление + "," + СвязанноеВложение_ИмяИни;
		Иначе
			СписокСвязанныхВложений.Добавить(СвязанноеВложение_ДокументСсылка, СвязанноеВложение_ИмяИни);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не СписокСвязанныхВложений.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	СвязанныеВложенияСформировать = Новый Структура("СоставПакета", СписокСвязанныхВложений);
	
	ДопПараметры.Вставить("ОбработкаСвязанногоВложения", Истина);
	
	ПакетыСвязанныхВложений = МодульОбъектаКлиент().ЗапуститьПодготовкуДокументаСбисПоДанным1С(СвязанныеВложенияСформировать, ДопПараметры);
	
	ДопПараметры.ОбработкаСвязанногоВложения = Ложь;
	
	ДопПараметрыОбработчикаВФК	= Новый Структура("Контекст, Кэш", Контекст, Кэш);
	ОбработчикВФК				= МодульОбъектаКлиент().ПользовательскаяТочкаВхода("ОбработчикСвязанныхВложений", ОсновныеФормыВФК, ДопПараметрыОбработчикаВФК);
	Аргумент					= Новый Структура("ПакетыСвязанныхВложений, ТипыСвязанныхВложений", ПакетыСвязанныхВложений, ТипыСвязанныхВложений);
	
	Если ОбработчикВФК = Неопределено Тогда
		
		ПолучитьДанныеИзДокумента1С_ОбработчикСвязанныхВложений(Аргумент, ДопПараметрыОбработчикаВФК);

	Иначе
		
		МодульОбъектаКлиент().ВызватьПользовательскуюТочкуВхода(ОбработчикВФК, Аргумент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеИзДокумента1С_ОбработчикСвязанныхВложений(ПараметрыВходящие, ДопПараметры)
	
	Контекст				= ДопПараметры.Контекст;
	ПакетыСвязанныхВложений	= ПараметрыВходящие.ПакетыСвязанныхВложений;
	ТипыСвязанныхВложений	= ПараметрыВходящие.ТипыСвязанныхВложений;

	Для Каждого ПакетСвязанныхВложений Из ПакетыСвязанныхВложений Цикл
		СвязанныеВложения = МодульОбъектаКлиент().СоставПакета_Получить(ПакетСвязанныхВложений, "Вложение");
		Если СвязанныеВложения = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого СвязанноеВложение Из СвязанныеВложения Цикл
			// TODO Закомментировано по ошибке 251088221036512894 для доработок по добавлению вложений через ВФК. 
			// Лишних вложений добавляться не должно. Спилить комменты в 26.2100, если не будет багов.
			//Для Каждого Документ1СВложения Из СвязанноеВложение.Документы1С Цикл
			//	ТипыСвязанногоВложения = ТипыСвязанныхВложений.Получить(Документ1СВложения.Значение);
			//	Если	ТипыСвязанногоВложения <> Неопределено
			//		И 	ТипыСвязанногоВложения.Найти(СвязанноеВложение.Тип) <> Неопределено Тогда
					Контекст.СоставПакета.Вложение.Добавить(СвязанноеВложение);
			//	КонецЕсли;
			//КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеИзДокумента1С_ЗаполнитьСтороны(Кэш, ПараметрыКонструктора, Контекст) Экспорт
	Перем ПриемникДляДанныхСторон;
	
	// Не задан приемник для данных сторон, выгрузить в сам Документ
	ДокументФайлЗначение	= ПараметрыКонструктора.ДокументФайл;
	ВерсияФорматаСтороны	= "3.01";
	
	Если ДокументФайлЗначение.Свойство("Файл") Тогда
		
		ДокументФайлЗначение = ДокументФайлЗначение.Файл;
		Если ДокументФайлЗначение.Свойство("ВерсияФормата") Тогда
			
			ВерсияФорматаСтороны = ДокументФайлЗначение.ВерсияФормата;
			
		КонецЕсли;
		
	КонецЕсли;	
		
	Если Не ПараметрыКонструктора.Свойство("ПриемникСторон", ПриемникДляДанныхСторон) Тогда
		
		ПриемникДляДанныхСторон = ДокументФайлЗначение;
		Если ПриемникДляДанныхСторон.Свойство("Документ") Тогда
			
			ПриемникДляДанныхСторон = ПриемникДляДанныхСторон.Документ;
			
		КонецЕсли;
	КонецЕсли;
		
	лДанныеСторон = ПараметрыКонструктора.ДанныеСторон;
	
	Для Каждого КлючИЗначениеСторона Из лДанныеСторон Цикл
		
		Если	МодульОбъектаКлиент().ЭтоТипСбис(КлючИЗначениеСторона.Значение, "СторонаSaby") 
			И	МодульОбъектаКлиент().СторонаSaby_Пустая(КлючИЗначениеСторона.Значение) Тогда
			
			// Для пустой стороны все равно формируется сторона, но тут отсекаем пустые стороны
			Продолжить;
			
		КонецЕсли;
		// Заполнить стороны на документ и в объект.
		ПриемникДляДанныхСторон.Вставить(КлючИЗначениеСторона.Ключ, МодульОбъектаКлиент().СторонаSABY_Выгрузить(КлючИЗначениеСторона.Значение, ВерсияФорматаСтороны));
		
	КонецЦикла;
	
КонецПроцедуры

