
&НаКлиенте
Функция яСторонаSABY_Пустой(ОснованиеДляОбъекта = "СторонаSABY")
	
	Результат = НовыйПрикладнойОбъектSABY(ОснованиеДляОбъекта);
	яСторонаSABY_ЗаполнитьПоУмолчанию(Результат);
	
	ПрикладнойОбъектSaby_Установить(Результат, "ИностраннаяОрганизация",	Ложь);
	ПрикладнойОбъектSaby_Установить(Результат, "ИдентификационныйНомер",	"");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура яСторонаSABY_ЗаполнитьПоУмолчанию(СторонаSABY)
	
	СторонаSABY.Вставить("Название");
	СторонаSABY.Вставить("GLN");
	СторонаSABY.Вставить("Адрес");
	СторонаSABY.Вставить("Параметр");
	СторонаSABY.Вставить("Роль");
	СторонаSABY.Вставить("Подразделение");
	СторонаSABY.Вставить("Контакт");
	СторонаSABY.Вставить("БанкРекв");
	
КонецПроцедуры

