
// Функция - создает копию объекта
//
// Параметры:
//  ДанныеСтороны	 - СторонаSaby/Структура	 - данные стороны для копии
// 
// Возвращаемое значение:
//  СторонаSaby - объект класса "Сторона"
//
&НаКлиенте
Функция СторонаSABY_Скопировать(ДанныеСтороны) Экспорт
	
	Если ОбъектSABY_ЭтоТип(ДанныеСтороны, "ПрикладнойОбъектSaby") Тогда
		
		Результат = НовыйПрикладнойОбъектSABY(ДанныеСтороны);
		яСторонаSABY_ЗаполнитьПоУмолчанию(Результат);
		
		ДанныеЗаполнить = ПрикладнойОбъектSABY_Выгрузить(ДанныеСтороны);
		
		Для Каждого КлючИЗначение Из ДанныеЗаполнить Цикл
			
			Результат.Вставить(КлючИЗначение.Ключ, СоздатьКопиюОбъекта(КлючИЗначение.Значение, Истина));
			
		КонецЦикла;
		
		Возврат Результат;
		
	Иначе
		
		Возврат НовыйСторонаSABY(ДанныеСтороны);
		
	КонецЕсли;
	
КонецФункции

