
&НаКлиенте
Процедура ОткрытьДокументОнлайн(Команда)
	
	ТипыОшибокЭлем = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма,"ТипыОшибок");
	ТекущаяСтрока = ТипыОшибокЭлем.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если МодульОбъектаКлиент().РезультатОтправки_Версия(МестныйКэш.РезультатОтправки) = 2 Тогда
		Документ1С = ТекущаяСтрока.Документы1С[0].Значение; 
	Иначе
		Документ1С = ТекущаяСтрока.Документ1С;
	КонецЕсли;
	
	фрм = МестныйКэш.ГлавноеОкно.СбисНайтиФормуФункции("СбисПрочитатьСведенияОПакете", МестныйКэш.ФормаРаботыСоСтатусами, "");
	ИдДокументаАккаунта	= фрм.СбисПрочитатьСведенияОПакете(Новый Структура("ДокументСсылка", Документ1С), МестныйКэш);
	
	Если ЗначениеЗаполнено(ИдДокументаАккаунта.ИдДокумента) Тогда
		
		СоставПакета = МестныйКэш.Интеграция.ПрочитатьДокумент(МестныйКэш, ИдДокументаАккаунта.ИдДокумента);
		
		Если СоставПакета<>Ложь Тогда
			Ссылка = СоставПакета.СсылкаДляНашаОрганизация;
		Иначе
			Возврат;
		КонецЕсли;
		
	Иначе
		
		Сообщить("Нет связанного документа СБИС");
		Возврат;
		
	КонецЕсли;
	
	ЗапуститьПриложение(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент1С(Команда)
	
	ТипыОшибокЭлем = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма,"ТипыОшибок");
	ТекущаяСтрока = ТипыОшибокЭлем.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Если МодульОбъектаКлиент().РезультатОтправки_Версия(МестныйКэш.РезультатОтправки) = 2 Тогда
		
		СписокСсылок = ТекущаяСтрока.Документы1С;
		
	Иначе
		
		СписокСсылок = Новый СписокЗначений;
		СписокСсылок.Добавить(ТекущаяСтрока.Документ1С);
		
	КонецЕсли;
	
	МодульОбъектаКлиент().СбисОткрытьДокументы(Новый Структура("СписокСсылок", СписокСсылок));
	
КонецПроцедуры

