
&НаКлиенте
Процедура ТипыОшибокПередРазворачиванием(Элемент, Строка, Отказ)
	
	Если НЕ МодульОбъектаКлиент().МассоваяОперация_Получить(РезультатОтправкиПолный, "Версия") = 2 Тогда
		Возврат;
	КонецЕсли;  
	
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
		ТипыОшибокПередРазворачиваниемУФПереопределение(Строка);
		Возврат;	
	#КонецЕсли
	
	//Слетела авторизация, к примеру
	Если Элемент.ТекущиеДанные = Неопределено Тогда  
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.КодОшибки = "729" 
		ИЛИ Элемент.ТекущиеДанные.КодОшибки = "340" Тогда
		
		ДокументСБИС = Элемент.ТекущиеДанные.ДокументСБИС;
		
		ПредставлениеОшибкиФЛК = Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "HTMLПредставлениеОшибкиФЛК");
			
		Попытка
			
			Если Элемент.ТекущиеДанные.ПротоколОшибки = "" Тогда
				
				HTMLПредставлениеОшибкиФЛКТекст = ПолучитьПредставлениеHTMLОшибкиФЛК(ДокументСБИС);
				
				//Для совместимости кода. "УстановитьТекст" не существует на УФ (с)Сычев
				#Если ТолстыйКлиентОбычноеПриложение Тогда
					ПредставлениеОшибкиФЛК.УстановитьТекст(HTMLПредставлениеОшибкиФЛКТекст);	
				#Иначе
					HTMLПредставлениеОшибкиФЛК = HTMLПредставлениеОшибкиФЛКТекст;	
				#КонецЕсли
				
				Элемент.ТекущиеДанные.ПротоколОшибки = HTMLПредставлениеОшибкиФЛКТекст;
				
			Иначе
				
				#Если ТолстыйКлиентОбычноеПриложение Тогда
					ПредставлениеОшибкиФЛК.УстановитьТекст(Элемент.ТекущиеДанные.ПротоколОшибки);	
				#Иначе
					HTMLПредставлениеОшибкиФЛК = Элемент.ТекущиеДанные.ПротоколОшибки;	
				#КонецЕсли
				
			КонецЕсли;
			
			ПредставлениеОшибкиФЛК.Видимость = Истина;
		Исключение
			
			ПредставлениеОшибкиФЛК.Видимость = Ложь;
			
		КонецПопытки;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыОшибокВыбор(Элемент, Строка, СтандартнаяОбработка)
	
	ИмяПоля = СтандартнаяОбработка.Имя;
	СтандартнаяОбработка = Ложь;
	
	Если Найти(ИмяПоля, "Документы1С") > 0 Тогда
		
		ПараметрыОткрыть = Новый ФиксированнаяСтруктура("СписокСсылок", Элемент.ТекущиеДанные.Документы1С);
		МодульОбъектаКлиент().СбисОткрытьДокументы(ПараметрыОткрыть);
		
	ИначеЕсли Найти(Элемент.ТекущиеДанные.ТекстОшибки, "Двойной клик покажет/скроет подробный отчёт") Тогда

		ПредставлениеОшибкиФЛК = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "HTMLПредставлениеОшибкиФЛК");

		Если ПредставлениеОшибкиФЛК.Видимость = Ложь ИЛИ ПараметрыФормы.ПредыдущийВыбранныйДокумент <> Элемент.ТекущиеДанные.ДокументСБИС Тогда
			ТипыОшибокПередРазворачиванием(Элемент, Строка, Ложь);	
		Иначе
			ТипыОшибокПередСворачиванием(Элемент, Строка, Ложь);
		КонецЕсли;
		
		ПараметрыФормы.ПредыдущийВыбранныйДокумент = Элемент.ТекущиеДанные.ДокументСБИС;
		
	ИначеЕсли Найти(ИмяПоля, "РешениеОшибки") Тогда
		
		СбисИсключение		= Элемент.ТекущиеДанные.СтруктураОшибки[0].Значение;
		КомандаДляРешения	= МодульОбъектаКлиент().СбисИсключение_Выгрузить(СбисИсключение, "КомандаДляРешенияПроблемы");
		МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(, КомандаДляРешения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыОшибокПередРазворачиваниемУФПереопределение(Строка)

	ТекущаяСтрока = ТипыОшибок.НайтиПоИдентификатору(Строка);
	
	Если ТекущаяСтрока = Неопределено Тогда  //Слетела авторизация, к примеру
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.КодОшибки = "729"
		ИЛИ ТекущаяСтрока.КодОшибки = "340"Тогда
		
		ДокументСБИС = ТекущаяСтрока.ДокументСБИС;
		
		ПредставлениеОшибкиФЛК = Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "HTMLПредставлениеОшибкиФЛК");
			
		Попытка
			
			Если ТекущаяСтрока.ПротоколОшибки = "" Тогда
				
				HTMLПредставлениеОшибкиФЛКТекст = ПолучитьПредставлениеHTMLОшибкиФЛК(ДокументСБИС);
				
				#Если ТолстыйКлиентОбычноеПриложение Тогда
					ПредставлениеОшибкиФЛК.УстановитьТекст(HTMLПредставлениеОшибкиФЛКТекст);	
				#Иначе
					HTMLПредставлениеОшибкиФЛК = HTMLПредставлениеОшибкиФЛКТекст;	
				#КонецЕсли
				
				ТекущаяСтрока.ПротоколОшибки = HTMLПредставлениеОшибкиФЛКТекст;
				
			Иначе
				
				#Если ТолстыйКлиентОбычноеПриложение Тогда
					ПредставлениеОшибкиФЛК.УстановитьТекст(ТекущаяСтрока.ПротоколОшибки);	
				#Иначе
					HTMLПредставлениеОшибкиФЛК = ТекущаяСтрока.ПротоколОшибки;	
				#КонецЕсли
				
			КонецЕсли;
			
			ПредставлениеОшибкиФЛК.Видимость = Истина;
		Исключение
			
			ПредставлениеОшибкиФЛК.Видимость = Ложь;	
			
		КонецПопытки;

	КонецЕсли;
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ТипыОшибокПередСворачиванием(Элемент, Строка, Отказ)
	
	Если НЕ МодульОбъектаКлиент().МассоваяОперация_Получить(РезультатОтправкиПолный, "Версия") = 2 Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеОшибкиФЛК = Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "HTMLПредставлениеОшибкиФЛК");
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ПредставлениеОшибкиФЛК.УстановитьТекст("");	
	#Иначе
		HTMLПредставлениеОшибкиФЛК = Неопределено;	
	#КонецЕсли	
	
	ПредставлениеОшибкиФЛК.Видимость = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемОбработчик(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если	ПараметрыФормы = Неопределено
		Или	ПараметрыФормы.РежимЗакрытия = "ЗавершениеРаботы"
		Или	ЗавершениеРаботы Тогда
		
		СтандартнаяОбработка = Ложь;
		Возврат;

	КонецЕсли;
	
	СбисРазблокироватьИнтерфейс(ПараметрыФормы);
	
	ЭлементыДляВыключенияВидимости = Новый Массив;
	ЭлементыДляВыключенияВидимости.Добавить("HTMLПредставлениеОшибкиФЛК");
	
	ВыключитьВидимость = Новый Структура("Видимость", Ложь);
	ОбновитьНастройкиЭлементовФормы(ЭлементыДляВыключенияВидимости, ВыключитьВидимость);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииОбработчик(ЗавершениеРаботы)

	Оповестить("SABY.ФормаГлавноеОкно.ОбновитьКонтент", , ЭтаФорма);

	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		ПриЗакрытииВыполнитьОповещениеОЗакрытии(ЗавершениеРаботы);
		
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура НадписьТиповыеОшибкиНажатие(Элемент)
	ЗапуститьПриложение("https://saby.ru/help/integration/1C_set/modul/typical_errors");
КонецПроцедуры

