
&НаКлиенте
Процедура ТипыОшибокПередРазворачиванием(Элемент, Строка, Отказ)
	
	Если НЕ МодульОбъектаКлиент().МассоваяОперация_Получить(РезультатОтправкиПолный, "Версия") = 2 Тогда
		
		Возврат;
		
	КонецЕсли;  
	
	ПараметрыФормы.Вставить("ПоследняяСтрока", Строка);
	ПредставлениеОшибкиФЛК = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "HTMLПредставлениеОшибкиФЛК");
		
	Попытка
		
		Если Строка.ПротоколОшибки = "" Тогда
			
			ПараметрыЗапроса = Новый Структура(
				"ИДПакета, ИдРодителя, ИмяРодителя",
				Элемент.ТекущиеДанные.ИДПакета, Элемент.ТекущиеДанные.ИДВложения, "Документ");
				
			Строка.ПротоколОшибки = МодульОбъектаКлиент().ПолучитьПротоколПроверкиВложения(ПараметрыЗапроса);
			
		КонецЕсли;
		
		ПараметрыИзменить = Новый Структура("Видимость, Форма, HTML", Истина, ЭтаФорма, Строка.ПротоколОшибки);
		
		МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ПредставлениеОшибкиФЛК, ПараметрыИзменить);
		
	Исключение
		
		ПредставлениеОшибкиФЛК.Видимость = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыОшибокПриАктивизацииСтроки(Элемент)
	Перем ПоследняяВыбраннаяСтрокаДерева;
	
	Если	ПараметрыФормы.Свойство("ПоследняяСтрока", ПоследняяВыбраннаяСтрокаДерева)
		И	Не ПоследняяВыбраннаяСтрокаДерева = Элемент.ТекущаяСтрока Тогда
		
		// При выьоре другой строки результата свернуть протокол, чтоб не мешал
		ТипыОшибокПередСворачиванием(Элемент, Элемент.ТекущаяСтрока, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыОшибокВыбор(Элемент, Строка, СтандартнаяОбработка)
	
	ИмяПоля = СтандартнаяОбработка.Имя;
	СтандартнаяОбработка = Ложь;
	
	Если Найти(ИмяПоля, "Документы1С") > 0 Тогда
		
		ПараметрыОткрыть = Новый ФиксированнаяСтруктура("СписокСсылок", Элемент.ТекущиеДанные.Документы1С);
		МодульОбъектаКлиент().СбисОткрытьДокументы(ПараметрыОткрыть);
		
	ИначеЕсли Найти(ИмяПоля, "РешениеОшибки") Тогда
		
		СбисИсключение = Элемент.ТекущиеДанные.СтруктураОшибки[0].Значение;
		Если МодульОбъектаКлиент().Saby_ОбъектSaby_ЭтоТип(СбисИсключение, "Ошибка ФЛК") Тогда
			
			ТипыОшибокПередРазворачиванием(Элемент, Строка, Ложь);	
			Возврат;
			
		КонецЕсли;
		КомандаДляРешения	= МодульОбъектаКлиент().СбисИсключение_Выгрузить(СбисИсключение, "КомандаДляРешенияПроблемы");
		МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(, КомандаДляРешения);
		
	ИначеЕсли Найти(Элемент.ТекущиеДанные.ТекстОшибки, "Двойной клик покажет/скроет подробный отчёт") Тогда

		ПредставлениеОшибкиФЛК = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "HTMLПредставлениеОшибкиФЛК");

		Если ПредставлениеОшибкиФЛК.Видимость = Ложь ИЛИ ПараметрыФормы.ПредыдущийВыбранныйДокумент <> Элемент.ТекущиеДанные.ДокументСБИС Тогда
			ТипыОшибокПередРазворачиванием(Элемент, Строка, Ложь);	
		Иначе
			ТипыОшибокПередСворачиванием(Элемент, Строка, Ложь);
		КонецЕсли;
		
		ПараметрыФормы.ПредыдущийВыбранныйДокумент = Элемент.ТекущиеДанные.ДокументСБИС;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыОшибокПередСворачиванием(Элемент, Строка, Отказ)
	
	Если НЕ МодульОбъектаКлиент().МассоваяОперация_Получить(РезультатОтправкиПолный, "Версия") = 2 Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеОшибкиФЛК = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "HTMLПредставлениеОшибкиФЛК");
	ПараметрыИзменить = Новый Структура("Видимость", Ложь);
	
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ПредставлениеОшибкиФЛК, ПараметрыИзменить);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемОбработчик(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если	ПараметрыФормы = Неопределено
		Или	ПараметрыФормы.РежимЗакрытия = "ЗавершениеРаботы"
		Или	ЗавершениеРаботы Тогда
		
		СтандартнаяОбработка = Ложь;
		Возврат;

	КонецЕсли;
	
	СбисРазблокироватьИнтерфейс(ПараметрыФормы);
	
	ЭлементыДляВыключенияВидимости = Новый Массив;
	ЭлементыДляВыключенияВидимости.Добавить("HTMLПредставлениеОшибкиФЛК");
	
	ВыключитьВидимость = Новый Структура("Видимость", Ложь);
	ОбновитьНастройкиЭлементовФормы(ЭлементыДляВыключенияВидимости, ВыключитьВидимость);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииОбработчик(ЗавершениеРаботы)

	Оповестить("SABY.ФормаГлавноеОкно.ОбновитьКонтент", , ЭтаФорма);

	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		ПриЗакрытииВыполнитьОповещениеОЗакрытии(ЗавершениеРаботы);
		
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура НадписьТиповыеОшибкиНажатие(Элемент)
	ЗапуститьПриложение("https://saby.ru/help/integration/1C_set/modul/typical_errors");
КонецПроцедуры

