
&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыОткрытия)

	Если МодульОбъектаКлиент().ЭтоТипСБИС(ПараметрыОткрытия, "МассоваяОперация") Тогда
		
		РезультатОтправкиПолный = ПараметрыОткрытия;
	
	ИначеЕсли Не ПараметрыОткрытия.Свойство("МассоваяОперация", РезультатОтправкиПолный) Тогда
		
		РезультатОтправкиПолный = Кэш.РезультатОтправки;
		
	КонецЕсли;
	
	Если МодульОбъектаКлиент().МассоваяОперация_Получить(РезультатОтправкиПолный, "Версия") = 2 Тогда
		
		РезультатОтправки = МодульОбъектаКлиент().МассоваяОперация_Выгрузить(РезультатОтправкиПолный);
		
	Иначе
		
		РезультатОтправки = РезультатОтправкиПолный;
		
	КонецЕсли;
	
	Отправлено = РезультатОтправки.Отправлено;
	НеОтправлено = РезультатОтправки.НеОтправлено;
	НеСформировано = РезультатОтправки.НеСформировано;
	
	ЭлементыДляВыключенияВидимости	= Новый Массив;
	ЭлементыДляВключенияВидимости	= Новый Массив;
	ПараметрыФормы.Вставить("ПредыдущийВыбранныйДокумент", "");
	
	Если НеОтправлено = 0 Тогда
		
		ЭлементыДляВыключенияВидимости.Добавить("Причины");
		
	Иначе
		
		ЭлементыДляВключенияВидимости.Добавить("Причины");
		
		Если МодульОбъектаКлиент().МассоваяОперация_Получить(РезультатОтправкиПолный, "Версия") = 2 Тогда
			
			ЭлементыДляВключенияВидимости.Добавить("ТипыОшибок.ДокументСБИС");
			ЭлементыДляВключенияВидимости.Добавить("ТипыОшибок.КодОшибки");
			ЭлементыДляВключенияВидимости.Добавить("ТипыОшибок.Документы1СНазвания");			 
			
			ЭлементыДляВыключенияВидимости.Добавить("ТипыОшибок.Документ1С");			
			
			ОбработатьСписокВложенийСОшибкамиФЛК();             
			ЗаполнитьДеревоОшибок(РезультатОтправки);
			
		Иначе
			
			ЭлементыДляВключенияВидимости.Добавить("ТипыОшибок.Документ1С");
			ЭлементыДляВыключенияВидимости.Добавить("ТипыОшибок.Документы1СНазвания");

			ЗаполнитьДеревоОшибокЛегаси(РезультатОтправки);		
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НеСформировано = 0 Тогда
		
		ЭлементыДляВыключенияВидимости.Добавить("НеСформировано");
		
	Иначе
		
		ЭлементыДляВключенияВидимости.Добавить("НеСформировано");
		
	КонецЕсли;
	
	Если Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		
		сбисЗаполнитьЗаголовкиФормы();
		
		Если РезультатОтправки.Свойство("ВремяФормирования") Тогда
			
			ЭлементыДляВключенияВидимости.Добавить("ВремяФормирования");
			ВремяФормирования = РезультатОтправки.ВремяФормирования;
			
		Иначе 
			
			ЭлементыДляВыключенияВидимости.Добавить("ВремяФормирования");
			
		КонецЕсли;
		
		Если РезультатОтправки.Свойство("ВремяОтправки") Тогда
			
			ЭлементыДляВключенияВидимости.Добавить("ВремяОтправки");
			ВремяОтправки = РезультатОтправки.ВремяОтправки;
			
		Иначе 
			
			ЭлементыДляВыключенияВидимости.Добавить("ВремяОтправки");
			
		КонецЕсли;
		
		Если РезультатОтправки.Свойство("ОбщееВремя", ОбщееВремя) Тогда
			
			ЭлементыДляВключенияВидимости.Добавить("ОбщееВремя");
			
		Иначе
			
			ЭлементыДляВыключенияВидимости.Добавить("ОбщееВремя");
			
		КонецЕсли;
		
		Если РезультатОтправки.Свойство("ВремяЗаписиСтатусов") Тогда
			
			ЭлементыДляВключенияВидимости.Добавить("ВремяЗаписиСтатусов");
			ВремяЗаписиСтатусов = РезультатОтправки.ВремяЗаписиСтатусов;
			
		Иначе
			
			ЭлементыДляВыключенияВидимости.Добавить("ВремяЗаписиСтатусов");
			
		КонецЕсли;
		
		Если РезультатОтправки.Свойство("ВремяПолученияДанных") Тогда
			
			ЭлементыДляВключенияВидимости.Добавить("ВремяПолученияДанных");
			ВремяПолученияДанных = РезультатОтправки.ВремяПолученияДанных;
			
		Иначе
			
			ЭлементыДляВыключенияВидимости.Добавить("ВремяПолученияДанных");
			
		КонецЕсли;
		
		Если РезультатОтправки.Свойство("ВремяОжиданияОтвета") Тогда
			
			ЭлементыДляВключенияВидимости.Добавить("ВремяОжиданияОтвета");
			ВремяОжиданияОтвета = РезультатОтправки.ВремяОжиданияОтвета;
			
		Иначе
			
			ЭлементыДляВыключенияВидимости.Добавить("ВремяОжиданияОтвета");
			
		КонецЕсли;
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			HTMLПредставлениеОшибкиФЛК.УстановитьТекст("");	
		#Иначе
			HTMLПредставлениеОшибкиФЛК = Неопределено;	
		#КонецЕсли
		
		ЭлементыДляВыключенияВидимости.Добавить("HTMLПредставлениеОшибкиФЛК");
		
	КонецЕсли;
	
	ВключитьВидимость = Новый Структура("Видимость", Истина);
    ВыключитьВидимость = Новый Структура("Видимость", Ложь);
	ОбновитьНастройкиЭлементовФормы(ЭлементыДляВключенияВидимости, ВключитьВидимость);
	ОбновитьНастройкиЭлементовФормы(ЭлементыДляВыключенияВидимости, ВыключитьВидимость);
	
КонецПроцедуры

