
&НаКлиенте
Функция сбисЗаполнитьЗаголовкиФормы()
	
	ЭлементыДляОбновления = Новый Массив;
	ПараметрыОбновления = Новый Структура;
	
	Если РезультатОтправки.Свойство("ЗаголовкиФормыРезультатов") Тогда
		ЭтаФорма.Заголовок = РезультатОтправки.ЗаголовкиФормыРезультатов.Форма;
		
		ЭлементыДляОбновления.Добавить("Отправлено");
		ПараметрыОбновления.Вставить("Заголовок", РезультатОтправки.ЗаголовкиФормыРезультатов.ПоложительныйРезультат);
		ОбновитьНастройкиЭлементовФормы(ЭлементыДляОбновления, ПараметрыОбновления);
		
		ЭлементыДляОбновления[0] = "Неотправлено";
		ПараметрыОбновления.Вставить("Заголовок", РезультатОтправки.ЗаголовкиФормыРезультатов.ОтрицательныйРезультат);
		ОбновитьНастройкиЭлементовФормы(ЭлементыДляОбновления, ПараметрыОбновления);
		
		ЭлементыДляОбновления[0] = "ТипыОшибокДокументы1С";
		ПараметрыОбновления.Вставить("Заголовок", РезультатОтправки.ЗаголовкиФормыРезультатов.Объект1С);
		ОбновитьНастройкиЭлементовФормы(ЭлементыДляОбновления, ПараметрыОбновления);
		
		ЭлементыДляОбновления[0] = "НадписьТиповыеОшибки";
		ПараметрыОбновления.Вставить("Заголовок", РезультатОтправки.ЗаголовкиФормыРезультатов.ТиповыеОшибки);
		ОбновитьНастройкиЭлементовФормы(ЭлементыДляОбновления, ПараметрыОбновления);
		
		ЭлементыДляОбновления[0] = "ТипыОшибокКонтекстноеОткрытьДокументОнлайн";
		ПараметрыОбновления.Очистить();
		ПараметрыОбновления.Вставить("Видимость", Ложь);
		ОбновитьНастройкиЭлементовФормы(ЭлементыДляОбновления, ПараметрыОбновления);
	Иначе
		ЭтаФорма.Заголовок = "Результат отправки документов";
		
		ЭлементыДляОбновления.Добавить("Отправлено");
		ПараметрыОбновления.Вставить("Заголовок", "Отправлено");
		ОбновитьНастройкиЭлементовФормы(ЭлементыДляОбновления, ПараметрыОбновления);
		
		ЭлементыДляОбновления[0] = "Неотправлено";
		ПараметрыОбновления.Вставить("Заголовок", "Не отправлено");
		ОбновитьНастройкиЭлементовФормы(ЭлементыДляОбновления, ПараметрыОбновления);
		
		ЭлементыДляОбновления[0] = "ТипыОшибокДокументы1С";
		ПараметрыОбновления.Вставить("Заголовок", "Документ 1С");
		ОбновитьНастройкиЭлементовФормы(ЭлементыДляОбновления, ПараметрыОбновления);
		
		ЭлементыДляОбновления[0] = "НадписьТиповыеОшибки";
		ПараметрыОбновления.Вставить("Заголовок", "Смотреть типовые ошибки отправки и их решение");
		ОбновитьНастройкиЭлементовФормы(ЭлементыДляОбновления, ПараметрыОбновления);
		
		ЭлементыДляОбновления[0] = "ТипыОшибокКонтекстноеОткрытьДокументОнлайн";
		ПараметрыОбновления.Очистить();
		ПараметрыОбновления.Вставить("Видимость", Ложь);
		ОбновитьНастройкиЭлементовФормы(ЭлементыДляОбновления, ПараметрыОбновления);
	КонецЕсли
КонецФункции

Процедура ЗаполнитьДеревоОшибокЛегаси(РезультатОтправки)
	
	#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
		ТипыОшибокПереопределяемый = РеквизитФормыВЗначение("ТипыОшибок");
		ТипыОшибокПереопределяемый.Строки.Очистить();
	#Иначе
		ТипыОшибокПереопределяемый = ТипыОшибок;
		ТипыОшибок.Строки.Очистить();	
	#КонецЕсли
	
	Для Каждого Элемент Из РезультатОтправки.ТипыОшибок Цикл
		
		НоваяСтрока = ТипыОшибокПереопределяемый.Строки.Добавить();            
		НоваяСтрока.ТекстОшибки = Элемент.Значение;            
		НоваяСтрока.Количество = Элемент.Представление;
		
		//AU изменена структура в детализации ошибок для возможности проброса дампа в сервис статистики
		ЭлементСоответствия = РезультатОтправки.ДетализацияОшибок.Получить(Элемент.Значение);
		
		Если ЭлементСоответствия <> Неопределено Тогда 
			
			Для Каждого Документ1С Из ЭлементСоответствия Цикл
				
				НоваяПодстрока = НоваяСтрока.Строки.Добавить();            
				НоваяПодстрока.Документ1С  = Документ1С.ОбработанДокумент1С; 
				НоваяПодстрока.ТекстОшибки = Документ1С.Сообщение;
				
			КонецЦикла;
			
		КонецЕсли
		
	КонецЦикла;	
	
	#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
		ЗначениеВРеквизитФормы(ТипыОшибокПереопределяемый, "ТипыОшибок");
	#КонецЕсли	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоОшибок(РезультатОтправки)
	Перем КлючДетализацииДерева;
	
	#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда	
		
		ТипыОшибокПереопределяемый = РеквизитФормыВЗначение("ТипыОшибок");
		
	#Иначе
		
		ТипыОшибокПереопределяемый = ТипыОшибок;
		
	#КонецЕсли

	ТипыОшибокПереопределяемый.Строки.Очистить();
	
	Для Каждого Элемент Из РезультатОтправки.ТипыОшибок Цикл
		
		НоваяСтрока = ТипыОшибокПереопределяемый.Строки.Добавить();
		НоваяСтрока.ТекстОшибки = Элемент.Значение;
		НоваяСтрока.Количество 	= Элемент.Представление;
		
		ЭлементСоответствия = РезультатОтправки.ДетализацияОшибок.Получить(Элемент.Значение);
		
		Если ЭлементСоответствия = Неопределено Тогда
			
			ДокументСБИСЭлемент = ТипыОшибокПереопределяемый.Строки.Добавить();
			ДокументСБИСЭлемент.ДокументСБИС = "Документ для ошибки не определён";
			//ДокументСБИСЭлемент.КодОшибки	  = 100;
			
			ОшибкаЭлемент = ДокументСБИСЭлемент.Строки.Добавить();            
			
			ОшибкаЭлемент.ТекстОшибки = Элемент.Значение;
			ОшибкаЭлемент.Количество  = Элемент.Представление;

		Иначе
			
			Для Каждого СтруктураДанныхОшибки Из ЭлементСоответствия Цикл
				
				Если СтруктураДанныхОшибки.Свойство("ДокументСБИС", КлючДетализацииДерева) Тогда
					
					СуществующаяСтрокаСДокументомСБИС = ТипыОшибокПереопределяемый.Строки.Найти(КлючДетализацииДерева, "ДокументСБИС", Истина);
					
					Если СуществующаяСтрокаСДокументомСБИС = Неопределено Тогда
					
						ЗаполнитьДеревоОшибок_ДокументСБИС(НоваяСтрока, СтруктураДанныхОшибки);
						
					Иначе
						
						ПодстрокаСДокументомСБИС = СуществующаяСтрокаСДокументомСБИС.Строки.Найти(КлючДетализацииДерева, "ДокументСБИС", Истина);
						
						Если Не ПодстрокаСДокументомСБИС = Неопределено
							И	СтруктураДанныхОшибки.Свойство("ОбработанДокумент1С")
							И	ЗначениеЗаполнено(СтруктураДанныхОшибки.ОбработанДокумент1С) Тогда
							
							ЗаполнитьДеревоОшибок_СуществующаяСтрока(ПодстрокаСДокументомСБИС, СтруктураДанныхОшибки.ОбработанДокумент1С);
							
						КонецЕсли;                                                                
						
					КонецЕсли;
					
				Иначе
					
					ЗаполнитьДеревоОшибок_Прочее(ТипыОшибокПереопределяемый, НоваяСтрока, СтруктураДанныхОшибки);
					
				КонецЕсли;
					
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
		
		ЗначениеВРеквизитФормы(ТипыОшибокПереопределяемый, "ТипыОшибок");
		
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоОшибок_ДокументСБИС(СтрокаДерева, СтруктураДанныхОшибки)
	Перем СтрокаДляЗаполнить;
	
	Если МодульОбъектаСервер().Saby_ОбъектSaby_ЭтоТип(СтруктураДанныхОшибки.СтруктураОшибки, "Ошибка ФЛК")  Тогда
		
		// Для ошибок ФЛК группируем строки по вложению.
		СтрокиИдПакета = СтрокаДерева.Строки.НайтиСтроки(Новый Структура("ИдПакета, ИдВложения", СтруктураДанныхОшибки.ИДПакета, СтруктураДанныхОшибки.ИдВложения));
		Если СтрокиИдПакета.Количество() Тогда
			
			СтрокаДляЗаполнить = СтрокиИдПакета[0];
			
		КонецЕсли;

	КонецЕсли;	
	
	ЗаполнитьДеревоОшибок_ЗаполнитьСтроку(СтрокаДерева, СтруктураДанныхОшибки, СтрокаДляЗаполнить);
	
КонецПроцедуры

Процедура ЗаполнитьДеревоОшибок_ЗаполнитьСтроку(ДеревоОшибок, СтруктураДанныхОшибки, СтрокаЗаполнить = Неопределено)
	
	Если СтрокаЗаполнить = Неопределено Тогда
		
		СтрокаЗаполнить = ЗаполнитьДеревоОшибок_ДобавитьСтроку(ДеревоОшибок, СтруктураДанныхОшибки);
		Возврат;
		
	КонецЕсли;
	
	Если СтруктураДанныхОшибки.Свойство("ОбработанДокумент1С") И ЗначениеЗаполнено(СтруктураДанныхОшибки.ОбработанДокумент1С) Тогда
		
		СтрокаЗаполнить.Документы1С.Добавить(СтруктураДанныхОшибки.ОбработанДокумент1С, СтруктураДанныхОшибки.ОбработанДокумент1С);
		Если Не ПустаяСтрока(СтрокаЗаполнить.Документы1СНазвания) Тогда
			
			СтрокаЗаполнить.Документы1СНазвания = СтрокаЗаполнить.Документы1СНазвания + Символы.ПС;
			
		КонецЕсли;
		СтрокаЗаполнить.Документы1СНазвания	= СтрокаЗаполнить.Документы1СНазвания + СтруктураДанныхОшибки.ОбработанДокумент1С; 

	КонецЕсли;	
	
КонецПроцедуры

Функция ЗаполнитьДеревоОшибок_ДобавитьСтроку(ДеревоОшибок, СтруктураДанныхОшибки)
	
	СтрокаЗаполнить = ДеревоОшибок.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаЗаполнить, СтруктураДанныхОшибки);
	
	СтрокаЗаполнить.СтруктураОшибки.Добавить(СтруктураДанныхОшибки.СтруктураОшибки);
	СтрокаЗаполнить.КодОшибки	= СтруктураДанныхОшибки.СтруктураОшибки.code;
	Если ТипЗнч(СтруктураДанныхОшибки.СтруктураОшибки.hint) = Тип("Структура") Тогда 
		
		СтрокаЗаполнить.РешениеОшибки = СтруктураДанныхОшибки.СтруктураОшибки.hint.text;
		
	Иначе
		
		СтрокаЗаполнить.РешениеОшибки = СтруктураДанныхОшибки.СтруктураОшибки.hint;
		
	КонецЕсли;
	
	Если МодульОбъектаСервер().Saby_ОбъектSaby_ЭтоТип(СтруктураДанныхОшибки.СтруктураОшибки, "Ошибка ФЛК")  Тогда
			
		СтрокаЗаполнить.ТекстОшибки		= "Двойной клик покажет/скроет подробный отчёт";
		СтрокаЗаполнить.ДокументСБИС	= СтруктураДанныхОшибки.НазваниеВложения; 
		
	Иначе
		
		СтрокаЗаполнить.ТекстОшибки		= СтруктураДанныхОшибки.Сообщение;
		СтрокаЗаполнить.ДокументСБИС	= СтруктураДанныхОшибки.ДокументСБИС;  
		
	КонецЕсли;
	
	Если СтруктураДанныхОшибки.Свойство("ОбработанДокумент1С") И ЗначениеЗаполнено(СтруктураДанныхОшибки.ОбработанДокумент1С) Тогда
		
		СтрокаЗаполнить.Документы1С.Добавить(СтруктураДанныхОшибки.ОбработанДокумент1С, СтруктураДанныхОшибки.ОбработанДокумент1С);
		СтрокаЗаполнить.Документы1СНазвания	= СтруктураДанныхОшибки.ОбработанДокумент1С; 
		СтрокаЗаполнить.Документ1С			= СтруктураДанныхОшибки.ОбработанДокумент1С;   
		
	КонецЕсли;		
	
	Возврат СтрокаЗаполнить;	
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоОшибок_СуществующаяСтрока(СтрокаДерева, ДополнитьСсылка)

	Если Не СтрокаДерева.Документы1С.НайтиПоЗначению(ДополнитьСсылка) = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтрокаДерева.Документы1С.Добавить(ДополнитьСсылка, ДополнитьСсылка);
	
	Если ПустаяСтрока(СтрокаДерева.Документы1СНазвания) Тогда
		
		СтрокаДерева.Документы1СНазвания = Строка(ДополнитьСсылка);
		
	Иначе
		
		СтрокаДерева.Документы1СНазвания = СтрокаДерева.Документы1СНазвания + ";
				|" + ДополнитьСсылка;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоОшибок_Прочее(ДеревоОшибок, СтрокаДерева, СтруктураДанныхОшибки)
	
	СуществующаяСтрокаСДетализациейОшибки = ДеревоОшибок.Строки.Найти(СтруктураДанныхОшибки.Сообщение, "ТекстОшибки", Истина);
	
	Если СуществующаяСтрокаСДетализациейОшибки = Неопределено Тогда

		СтрокаДереваЭлемент = СтрокаДерева.Строки.Добавить();            
		СтрокаДереваЭлемент.ТекстОшибки	= СтруктураДанныхОшибки.Сообщение;
		СтрокаДереваЭлемент.КодОшибки	= СтруктураДанныхОшибки.СтруктураОшибки.code;
		СтрокаДереваЭлемент.Количество	= 1;
		СтрокаДереваЭлемент.СтруктураОшибки.Добавить(СтруктураДанныхОшибки.СтруктураОшибки);
		Если ТипЗнч(СтруктураДанныхОшибки.СтруктураОшибки.hint) = Тип("Структура") Тогда 
			
			СтрокаДереваЭлемент.РешениеОшибки = СтруктураДанныхОшибки.СтруктураОшибки.hint.text;
			
		ИначеЕсли ЗначениеЗаполнено(СтруктураДанныхОшибки.СтруктураОшибки.hint) Тогда
			
			СтрокаДереваЭлемент.РешениеОшибки = "Решение ошибки";
			
		Иначе
			
			СтрокаДереваЭлемент.РешениеОшибки = "Сохранить данные об ошибке";
			
		КонецЕсли;
		
	Иначе
		
		СтрокаДереваЭлемент = СуществующаяСтрокаСДетализациейОшибки;
		
	КонецЕсли;
	
	ЗаполнитьДеревоОшибок_СуществующаяСтрока(СтрокаДереваЭлемент, СтруктураДанныхОшибки.Объект1С);
	
КонецПроцедуры

// Процедура - Обновить настройки элементов формы
//
// Параметры:
//  СписокЭлементов		 - Массив - Содержит строки с именами элементов формы, которые нужно настроить 
//  ПараметрыНастройки	 - Структура - Параметры, которые будут установлены элементу (доступность, видимость и т.п.)
//
//			Настройка 	 -	Строка	  	 - Имя настройки элемента 
//			Значение 	 -	Произвольный - Устанавливаемое значение. Проверок на установку недопустимого значения нет, остаётся на совести программиста
//
&НаКлиенте
Процедура ОбновитьНастройкиЭлементовФормы(СписокЭлементов, ПараметрыНастройки)
	
	ЭлементыДляИзменения = Новый Массив;
	
	Для Каждого ИмяЭлемента Из СписокЭлементов Цикл   
		
		ЭлементФормы = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, ИмяЭлемента);
		
		Если НЕ ЭлементФормы = Неопределено Тогда
			ЭлементыДляИзменения.Добавить(ЭлементФормы);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Элемент Из ЭлементыДляИзменения Цикл
		
		Для Каждого Параметр Из ПараметрыНастройки Цикл
			
			Элемент[Параметр.Ключ] = Параметр.Значение;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

