
&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыОткрытия)
	
	ПользовательСбис = ПараметрыОткрытия.Пользователь;
	
	Попытка
		
		ТекущийАккаунт = Кэш.СБИС.ПараметрыИнтеграции.ИдАккаунта;
		
	Исключение
		
		ТекущийАккаунт = "";
		
	КонецПопытки;
	
	Попытка
		
		// Заполняем список аккаунтов 	
		СписокОрганизаций.Очистить();
		
		ОшибкаЧтенияСписка	= Ложь;
        МассивАккаунтов = МодульОбъектаКлиент().СбисПолучитьСписокАккаунтов(Новый ФиксированнаяСтруктура);
		
		Для Каждого Аккаунт Из МассивАккаунтов Цикл
			
			НоваяСтрока						= СписокОрганизаций.Добавить();
			НоваяСтрока.НазваниеАккаунта	= Аккаунт.НазваниеАккаунта;
			НоваяСтрока.ИдАккаунта			= Аккаунт.НомерАккаунта;
			
		КонецЦикла;	
		
	Исключение
		
		МодульОбъектаКлиент().СбисСообщить(ИнформацияОбОшибке(), НазваниеКратко() + ".СбисУстановитьФорму");
		
	КонецПопытки;
	
КонецПроцедуры
                                                                      	
