
&НаКлиенте
Функция ПреобразоватьComВЗначение(сбисРезультат, Отказ, сбисТип=Неопределено)
	РезультатКовертации = Неопределено;
	//Первый заход, смотрим что в ответе.	
	Если сбисТип = Неопределено Тогда
		Если сбисРезультат = Неопределено Тогда
			РезультатКовертации = сбисРезультат;			
		ИначеЕсли ТипЗнч(сбисРезультат) = Тип("COMОбъект") Тогда
			ТипПреобразовать = "объект";
			Попытка
				РезультатПроверки = сбисРезультат.keys;
			Исключение
				ТипПреобразовать = "массив объектов";
			КонецПопытки;
			РезультатКовертации = ПреобразоватьComВЗначение(сбисРезультат, Отказ, ТипПреобразовать);
		ИначеЕсли ТипЗнч(сбисРезультат) = Тип("Строка") Тогда
			РезультатКовертации = ПреобразоватьComВЗначение(сбисРезультат, Отказ, "строка");
		Иначе
			РезультатКовертации = сбисРезультат;
		КонецЕсли;
	ИначеЕсли сбисТип = "строка" Тогда
		РезультатКовертации = сбисРезультат;
		Если	Сред(РезультатКовертации,3,1) = "."
			И	Сред(РезультатКовертации,6,1) = "." Тогда//Возможно, это дата
			//Переопределим значение как дату, если это действительно она
			Если		СтрДлина(РезультатКовертации) = 10 Тогда
				Попытка
					РезультатКовертации = Дата(Сред(РезультатКовертации,7,4), Сред(РезультатКовертации,4,2), Лев(РезультатКовертации, 2));
				Исключение
					//В случае исключения, ничего не делаем. Это не дата, значение не меняется
				КонецПопытки;
			ИначеЕсли	СтрДлина(РезультатКовертации) = 19 Тогда 
				Попытка
					РезультатКовертации = Дата(Сред(РезультатКовертации,7,4), Сред(РезультатКовертации,4,2), Лев(РезультатКовертации, 2), Сред(РезультатКовертации,12, 2), Сред(РезультатКовертации,15, 2), Сред(РезультатКовертации,18, 2))
				Исключение
					//В случае исключения, ничего не делаем. Это не дата, значение не меняется
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли сбисТип = "объект" Тогда
		Попытка
			ComКлючиОбъекта	= сбисРезультат.keys;
		Исключение
			ОписаниеОшибки = "У объекта отсутствует описание ключей.";
			ВызватьИсключение сбисТекстИсключенияПриКонвертации("Структура", ОписаниеОшибки, "");
		КонецПопытки;
		РезультатКовертации = Новый Структура();
		Для Каждого ИмяОбъекта Из ComКлючиОбъекта Цикл
			ТипПреобразовать = сбисРезультат.TypeOf(ИмяОбъекта);
			Если		ТипПреобразовать = "строка" Тогда
				ЗначениеПреобразовать = сбисРезультат.Read(ИмяОбъекта);
			ИначеЕсли	ТипПреобразовать = "объект" Тогда
				ЗначениеПреобразовать = сбисРезультат.ReadObject(ИмяОбъекта);
			ИначеЕсли	ТипПреобразовать = "массив объектов" Тогда
				ЗначениеПреобразовать = сбисРезультат.ReadObjectList(ИмяОбъекта);
			Иначе
				ВызватьИсключение сбисТекстИсключенияПриКонвертации("Структура", "Неизвестный тип ответа " + ТипПреобразовать + ". Обратитесь в техническую поддержку.", ИмяОбъекта);
			КонецЕсли;
			Попытка
				РезультатКовертации.Вставить(ИмяОбъекта, ПреобразоватьComВЗначение(ЗначениеПреобразовать, Отказ, ТипПреобразовать));
			Исключение
				ОписаниеОшибки = ИнформацияОбОшибке().Описание;
				ВызватьИсключение сбисТекстИсключенияПриКонвертации("Структура", ОписаниеОшибки, ИмяОбъекта);
			КонецПопытки;
		КонецЦикла;
	ИначеЕсли сбисТип = "массив объектов" Тогда
		РезультатКовертации = Новый Массив();
		Для сч = 0 По сбисРезультат.count - 1 Цикл
			Попытка
				РезультатКовертации.Добавить(ПреобразоватьComВЗначение(сбисРезультат.at(сч), Отказ, "объект"));
			Исключение
				ОписаниеОшибки = ИнформацияОбОшибке().Описание;
				ВызватьИсключение сбисТекстИсключенияПриКонвертации("Массив", ОписаниеОшибки, "[" + сч + "]");
			КонецПопытки;
		КонецЦикла;	
	КонецЕсли;		
	Возврат РезультатКовертации;
		
КонецФункции

//Cериализует произвольный объект 1С в аналогичную стркутуру SDK
//Поддерживаемые типы: массив, структура, дата. Все прочие приводятся к строке.
&НаКлиенте
Функция ПреобразоватьЗначениеВCOM(Кэш, ЗначениеПреобразовать, ВерхнийУровень=Истина)
	Результат = Новый Структура("Type, Object", "Строка");
	Если ТипЗнч(ЗначениеПреобразовать) = Тип("Массив") Тогда
		Результат.Object = Кэш.Docflow.CreateSimpleObjectList(); 
		Результат.Type = "Массив";
		Для сбисИндексМассива = 0 По ЗначениеПреобразовать.Количество() - 1 Цикл
			Попытка
				ЭлементДобавить = ПреобразоватьЗначениеВCOM(Кэш, ЗначениеПреобразовать[сбисИндексМассива], Ложь);
				Результат.Object.Add(ЭлементДобавить.Object);	
			Исключение
				ОписаниеОшибки = ИнформацияОбОшибке().Описание;
				ВызватьИсключение сбисТекстИсключенияПриКонвертации(Результат.Type, ОписаниеОшибки, "[" + сбисИндексМассива + "]", ВерхнийУровень);
			КонецПопытки;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ЗначениеПреобразовать) = Тип("Структура") Тогда
		Результат.Object = Кэш.Docflow.CreateSimpleObject(); 
		Результат.Type = "Структура";
		Для Каждого КлючИЗначение Из ЗначениеПреобразовать Цикл
			сбисЗначениеCOM = ПреобразоватьЗначениеВCOM(Кэш, КлючИЗначение.Значение, Ложь);
			Попытка
				Если сбисЗначениеCOM.Type = "Массив" Тогда
					Результат.Object.WriteObjectList(КлючИЗначение.Ключ, сбисЗначениеCOM.Object);		
				ИначеЕсли сбисЗначениеCOM.Type = "Структура" Тогда
					Результат.Object.WriteObject(КлючИЗначение.Ключ, сбисЗначениеCOM.Object);
				Иначе
					Результат.Object.Write(КлючИЗначение.Ключ, сбисЗначениеCOM.Object);
				КонецЕсли;
			Исключение
				ОписаниеОшибки = ИнформацияОбОшибке().Описание;
				ВызватьИсключение сбисТекстИсключенияПриКонвертации(Результат.Type, ОписаниеОшибки, КлючИЗначение.Ключ, ВерхнийУровень);
			КонецПопытки;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ЗначениеПреобразовать) = Тип("Дата") Тогда
		Результат.Object = Формат(ЗначениеПреобразовать, "ДФ='дд.ММ.гггг ЧЧ.мм.сс'");
	ИначеЕсли ТипЗнч(ЗначениеПреобразовать) = Тип("Число") Тогда
		Результат.Object = Формат(ЗначениеПреобразовать, "ЧГ=0");
	Иначе
		Результат.Object = Строка(ЗначениеПреобразовать);
	КонецЕсли;
	Возврат Результат;	
КонецФункции

