//Область размечается на ОФ в модуле И на главном окне на УФ

//Функция (ОФ!) для вызова отправки документов по кнопке "Печать"
&НаКлиенте
Функция Печать(Аргумент1=Неопределено, Аргумент2 = Неопределено) Экспорт

	МодульОбъектаЗапуск = МодульОбъектаКлиент();
	МодульОбъектаЗапуск.ПолучитьФормуОбработки("ФормаГлавноеОкно");//Форма ГО после получения пропишется в Глобальный кэш модуля для связи
	
	Если ТипЗнч(Аргумент1) = Тип("Строка") Тогда
		ИдентификаторКоманды	= Аргумент1;
		ОбъектыНазначения		= Аргумент2;
	#Если ТолстыйКлиентОбычноеПриложение Тогда	
	ИначеЕсли Не СсылкаНаОбъект = Неопределено Тогда
		ИдентификаторКоманды	= "ПечатнаяФорма";
		ОбъектыНазначения		= Новый Массив();
		ОбъектыНазначения.Добавить(СсылкаНаОбъект);
		СсылкаНаОбъект = Неопределено;
	#КонецЕсли
	Иначе
		ИдентификаторКоманды	= "ПечатнаяФорма";
		ОбъектыНазначения		= Новый Массив();
		ОбъектыНазначения.Добавить(Аргумент1);
	КонецЕсли;
	
	МодульОбъектаЗапуск.ПечатьЗапуск(ОбъектыНазначения, Новый Структура("ИдентификаторКоманды", ИдентификаторКоманды));

КонецФункции

