//Область размечается на ОФ в модуле И на главном окне на УФ

//Функция (ОФ!) для вызова отправки документов по кнопке "Печать"
&НаКлиенте
Функция Печать(Аргумент1 = Неопределено, Аргумент2 = Неопределено) Экспорт

	Попытка
		
		Попытка
			
			ТекущийМодульОбъекта = МодульОбъектаКлиент();
			
		Исключение
			
			ВызватьИсключение("Возникла неизвестная ошибка при запуске обработки. Модуль объекта не был получен: " + ОписаниеОшибки());
			
		КонецПопытки;
		
		Если ТекущийМодульОбъекта = Неопределено Тогда
			
			ВызватьИсключение("Возникла неизвестная ошибка при запуске обработки. Модуль неопределен.");
			
		КонецЕсли;
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			// Форма ГО после получения пропишется в Глобальный кэш модуля для связи
			МодульГО = ТекущийМодульОбъекта.ПолучитьФормуОбработки("ФормаГлавноеОкно");
			
		#Иначе
			
			МодульГО = ЭтаФорма;
			
		#КонецЕсли
		
		Если ТекущийМодульОбъекта.ГлобальныйКэш = Неопределено Тогда 
			
			ТекущийМодульОбъекта.НастроитьКэшОбработки(МодульГО);		
			
		КонецЕсли;
		
	Исключение
		
		МодульОбъектаКлиент().СбисСообщить(ИнформацияОбОшибке(), "ФормаГлавноеОкно.Печать");
		Возврат Неопределено;
		
	КонецПопытки;
	
	Если ТипЗнч(Аргумент1) = Тип("Строка") Тогда
		ИдентификаторКоманды	= Аргумент1;
		ОбъектыНазначения		= Аргумент2;
	#Если ТолстыйКлиентОбычноеПриложение Тогда	
	ИначеЕсли Не СсылкаНаОбъект = Неопределено Тогда
		ИдентификаторКоманды	= "ПечатнаяФорма";
		ОбъектыНазначения		= Новый Массив();
		ОбъектыНазначения.Добавить(СсылкаНаОбъект);
		СсылкаНаОбъект = Неопределено;
	#КонецЕсли
	Иначе
		ИдентификаторКоманды	= "ПечатнаяФорма";
		ОбъектыНазначения		= Новый Массив();
		ОбъектыНазначения.Добавить(Аргумент1);
	КонецЕсли;
	
	ТекущийМодульОбъекта.ПечатьЗапуск(ОбъектыНазначения, Новый Структура("ИдентификаторКоманды", ИдентификаторКоманды));

КонецФункции

