
&НаКлиенте
Функция Утвердить_УпдДоп_1115131_5_03(Кэш, СоставПакета, Вложение, Действие, ДопПараметры=Неопределено) Экспорт
	
	НовоеВложение = Новый Структура;
	НовоеВложение.Вставить("Тип",		"УпдДопПокуп");
	НовоеВложение.Вставить("Подтип",	"1115132");
	НовоеВложение.Вставить("Название",	"Универсальный передаточный документ (титул покупателя)");
	Если ЗначениеЗаполнено(ДопПараметры) И ДопПараметры.Свойство("Шифрование") И ДопПараметры.Шифрование Тогда
		НовоеВложение.Вставить("ТребуетШифрования", "Да");
	КонецЕсли;
	ИмяXSLT = "Утвердить_УпдДоп_1115131_5_03";
	ПрефиксФайла = "ON_NSCHFDOPPOK";
	
	СбисСформироватьТитулПолучателяАктаНакладной_5_03(Кэш, СоставПакета, Вложение, НовоеВложение, Действие, ИмяXSLT, ПрефиксФайла, ДопПараметры);
	
КонецФункции

&НаКлиенте
Функция Утвердить_УпдСчфДоп_1115131_5_03(Кэш, СоставПакета, Вложение, Действие, ДопПараметры=Неопределено) Экспорт
	
	НовоеВложение = Новый Структура;
	НовоеВложение.Вставить("Тип",		"УпдСчфДопПокуп");
	НовоеВложение.Вставить("Подтип",	"1115132");
	НовоеВложение.Вставить("Название",	"Универсальный передаточный документ (титул покупателя)");
	Если ЗначениеЗаполнено(ДопПараметры) И ДопПараметры.Свойство("Шифрование") И ДопПараметры.Шифрование Тогда
		НовоеВложение.Вставить("ТребуетШифрования", "Да");
	КонецЕсли;
	ИмяXSLT = "Утвердить_УпдДоп_1115131_5_03";
	ПрефиксФайла = "ON_NSCHFDOPPOK";
	
	СбисСформироватьТитулПолучателяАктаНакладной_5_03(Кэш, СоставПакета, Вложение, НовоеВложение, Действие, ИмяXSLT, ПрефиксФайла, ДопПараметры);
	
КонецФункции

&НаКлиенте
Функция СбисСформироватьТитулПолучателяАктаНакладной_5_03(Кэш, СоставПакета, Вложение, НовоеВложение, Действие, ИмяXSLT, ПрефиксФайла, ДопПараметры = Неопределено) Экспорт
	Перем СертификатПодписи, ИмяФайла;
	
	Отказ = Ложь;
	
	XMLФайла		= МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "ДанныеФайла");
	СтруктураФайла	= ЗаполнитьСтруктуруФайла(XMLФайла);
	
	ЭП = Новый Массив;
	Для Каждого Подпись Из Вложение.Подпись Цикл
		
		ФайлПодписи = Кэш.Интеграция.СБИС_СохранитьПоСсылкеВФайл(Кэш, Новый Структура("Ссылка, ИмяФайла", Подпись.Файл.Ссылка, СбисПолучитьИмяВременногоФайлаКлиент()), Новый Структура, Отказ);
		Если Отказ Тогда
			Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, ФайлПодписи);
			Возврат Неопределено;
		КонецЕсли;
		ДвоичныеДанныеПодписи = Новый ДвоичныеДанные(ФайлПодписи);
		ЭП.Добавить(Новый Структура("ЭП", СтрЗаменить(СтрЗаменить(Base64Строка(ДвоичныеДанныеПодписи),Символы.ПС,""),Символы.ВК,"")));
		
	КонецЦикла;
	
	ДатаДок		= ТекущаяДата();
	Если ДопПараметры.Свойство("РезультатПодготовки") Тогда
		
		ПараметрыПоискаВложения = Новый Структура("Служебный, Подтип, Тип", "Да");
		ЗаполнитьЗначенияСвойств(ПараметрыПоискаВложения, НовоеВложение);
		ТитулОнлайна = СбисНайтиВложениеВРезультатеПодготовки(Кэш, ПараметрыПоискаВложения, Действие, ДопПараметры.РезультатПодготовки, ДопПараметры);
		Если Не ТитулОнлайна = Неопределено Тогда
			
			ИмяФайла	= ТитулОнлайна.Файл.Имя;
			ИмяТитулаСтр= СтрЗаменить(ИмяФайла, ".", Символы.ПС);
			ИмяФайла	= СтрПолучитьСтроку(ИмяТитулаСтр, 1);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Нет готового титула для утверждения
	Если ИмяФайла = Неопределено Тогда
		
		// Имя файла формируем на основании титула отправителя УПД
		ИмяТитулаСтр	= СтрЗаменить(Вложение.Файл.Имя, ".", Символы.ПС);
		ИмяФайла		= СтрПолучитьСтроку(ИмяТитулаСтр, 1);
		ИмяФайлаМассив	= МодульОбъектаКлиент().СбисРазложитьСтрокуВМассивПодстрок(ИмяФайла, "_");
		
		// Взять Ид отправителя/получателя, поменяв местами.
		ПараметрыДляИмени			= Новый Структура("R_Т, A, O, GGGGMMDD, N1, N2, N3, N4, N5, N6, N7");
		ПараметрыДляИмени.R_Т		= ПрефиксФайла;
		ПараметрыДляИмени.A			= ИмяФайлаМассив[3];
		ПараметрыДляИмени.O			= ИмяФайлаМассив[2];
		ПараметрыДляИмени.GGGGMMDD	= формат(ДатаДок, "ДФ=yyyyMMdd");
		ПараметрыДляИмени.N1		= ВРег(Новый УникальныйИдентификатор());
		// N2-7 взять от основного титула
		ПараметрыДляИмени.N2		= ИмяФайлаМассив[6];
		ПараметрыДляИмени.N3		= ИмяФайлаМассив[7];
		ПараметрыДляИмени.N4		= ИмяФайлаМассив[8];
		ПараметрыДляИмени.N5		= ИмяФайлаМассив[9];
		ПараметрыДляИмени.N6		= ИмяФайлаМассив[10];
		ПараметрыДляИмени.N7		= ИмяФайлаМассив[11];
		
		ИмяФайлаШаблон	= "{R_Т}_{A}_{O}_{GGGGMMDD}_{N1}_{N2}_{N3}_{N4}_{N5}_{N6}_{N7}";
		ИмяФайла		= МодульОбъектаКлиент().ПрименитьФорматКСтроке(ИмяФайлаШаблон, ПараметрыДляИмени);
		
	КонецЕсли;

	ДанныеПолучателя = Новый Структура;
	ДанныеПолучателя.Вставить("ИдФайл",		ИмяФайла);
	ДанныеПолучателя.Вставить("ДатаДок",	формат(ДатаДок,"ДФ=dd.MM.yyyy"));
	ДанныеПолучателя.Вставить("ВремДок",	формат(ДатаДок,"ДФ=HH.mm.ss"));
	Если	ЗначениеЗаполнено(ДопПараметры)
		И	ДопПараметры.Свойство("ЕстьРасхождения")
		И	ДопПараметры.ЕстьРасхождения Тогда
		ДанныеПолучателя.Вставить("КодИтога", "2");
		ДанныеПолучателя.Вставить("СодОпер", "Товары(груз)/услуги(результаты работ, права) принял с расхождениями");
	КонецЕсли;
	
	//Попробуем сгенерировать подписанта
	Если	Действие.Свойство("Сертификат", СертификатПодписи)
		И	ЗначениеЗаполнено(СертификатПодписи) Тогда
		
		Если ТипЗнч(СертификатПодписи) = Тип("Массив") Тогда
			
			СертификатПодписи = СертификатПодписи[0];
			
		КонецЕсли;
		Подписант = СбисПолучитьФИО(СертификатПодписи.ФИО);
		Подписант.Вставить("ИНН",				СертификатПодписи.ИНН);
		Подписант.Вставить("Должность",			?(ЗначениеЗаполнено(СертификатПодписи.Должность), СертификатПодписи.Должность, "-"));
		ДанныеПолучателя.Вставить("Подписант",	Подписант);
		
	КонецЕсли;
	ДанныеПолучателя.Вставить("Подпись",		ЭП);
	ДанныеПолучателя.Вставить("НашаОрганизация",СоставПакета.НашаОрганизация);
	
	СтруктураФайла.Файл.Вставить("ДанныеПолучателя", ДанныеПолучателя);
	ОшибкаПреобразования = Ложь;
	РезультатПреобразования = СбисПолучитьXMLФайлаИзСтруктурыПоИмениXSLT_Клиент(Кэш, СтруктураФайла, ИмяXSLT, Новый Структура, ОшибкаПреобразования);
	Если ОшибкаПреобразования Тогда
		Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, Кэш.ОбщиеФункции.сбисИсключение(РезультатПреобразования,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".сбисСформироватьТитулПолучателяАктаНакладной_5_01"));
		XMLДокумента = Неопределено;
	Иначе
		XMLДокумента = РезультатПреобразования;
	КонецЕсли;
	
	НовоеВложение.Вставить("ИмяФайла", ИмяФайла+".xml");
	НовоеВложение.Вставить("XMLДокумента", XMLДокумента);
	
	Если ЗначениеЗаполнено(ДопПараметры) И ДопПараметры.Свойство("ВерсияФормата") Тогда
		НовоеВложение.Вставить("ВерсияФормата", ДопПараметры.ВерсияФормата);
	Иначе
		НовоеВложение.Вставить("ВерсияФормата", "5.03");
	КонецЕсли;
	НовоеВложение.Вставить("Служебный",	"Да");
	НовоеВложение.Вставить("Дата",		формат(ДатаДок,"ДФ=dd.MM.yyyy"));
	
	СоставПакета.Вложение.Добавить(НовоеВложение);
	
КонецФункции

