&НаКлиенте
Процедура МассоваяОперация_Асинх_ДополнитьДокументВложениями(РезультатОтправки, ПараметрыКоманды) Экспорт
	
	ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;
	ДанныеКоманды			= ПараметрыКоманды.ДанныеКоманды;
	ДокументСБИС			= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "ДокументСБИС");
	СформироватьДокумент	= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки,
																	"ДополнитьДокументВложениями_СформироватьДокумент");
	
	Если СформироватьДокумент Тогда
		
		ПараметрыУстановки = Новый Структура("ПорядокВызова", 0);
		ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки,
												"МассоваяОперация_Асинх_ДополнитьДокументВложениями_Сформировать",
												ДанныеКоманды,
												ПараметрыУстановки);
		Возврат;
	
	КонецЕсли;
	
	Ошибка = СоставПакета_Получить(ДанныеКоманды.СоставПакета, "Ошибка");
	
	Если ЭтоТипСбис(Ошибка, "СбисИсключение") Тогда
		
		ПараметрыОбработатьОшибку = Новый Структура("Исключение", Ошибка);
		РезультатОтправки.НеОтправлено = РезультатОтправки.НеОтправлено + 1;
		РезультатОтправки.НеСформировано = РезультатОтправки.НеСформировано + 1;
		ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Ошибка", ПараметрыОбработатьОшибку);
		Возврат;
		
	КонецЕсли;
	
	СформированныеВложения = СоставПакета_Получить(ДанныеКоманды.СоставПакета, "Вложение");
	
	Попытка
		
		Для Каждого Вложение Из СформированныеВложения Цикл
			
			ЗаписатьВложенияСБИС(ДокументСБИС, Вложение, Новый Структура, Новый Структура);
			ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");   
					
		КонецЦикла;  
		
		СписокВложений	= Новый Структура("Вложения", СформированныеВложения);
		ДопПараметры	= Новый Структура("ПерезаписатьВложения", Ложь);
		
		СоставПакета_Обновить(ДокументСБИС, СписокВложений, ДопПараметры);
		
		ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "СоставПакета", ДокументСБИС);
	
	Исключение
		
		ИмяМетода = "МодульОбъектаКлиент.МассоваяОперация_Асинх_ДополнитьДокументВложениями_Записать";
		ИсключениеСбис = НовыйСбисИсключение(ОписаниеОшибки(), ИмяМетода);
		ПараметрыОбработатьОшибку = Новый Структура("Исключение", ИсключениеСбис);
		РезультатОтправки.НеОтправлено = РезультатОтправки.НеОтправлено + 1;
		ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Ошибка", ПараметрыОбработатьОшибку);
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура МассоваяОперация_Асинх_ДополнитьДокументВложениями_Сформировать(РезультатОтправки, ПараметрыКоманды) Экспорт
	
	ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;
	ДанныеКоманды			= ПараметрыКоманды.ДанныеКоманды;
	
	ПараметрыОтправки	= ЦепочкаКомандОбработки_Получить(РезультатОтправки, "ПараметрыОтправки");
	МодульПодготовки	= ПараметрыОтправки.МодульПодготовки;
	Кэш					= ПолучитьТекущийЛокальныйКэш();
	
	МассивПакетов = МодульПодготовки.ПодготовитьСтруктуруДокумента(ДанныеКоманды, Кэш);
	
	ДанныеКоманды.СоставПакета = МассивПакетов[0];  
	
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "СоставПакета", ДанныеКоманды.СоставПакета);	
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки,
											"ДополнитьДокументВложениями_СформироватьДокумент",
											Ложь);
	ПараметрыУстановки = Новый Структура("ПорядокВызова", 0);
	ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки,
												"МассоваяОперация_Асинх_ДополнитьДокументВложениями",
												ДанныеКоманды,
												ПараметрыУстановки);
	
КонецПроцедуры

