
// Процедура - Результат отправки асинх подобрать серфтикат
//
// Параметры:
//  РезультатОтправки	 - РезультатОтправки - структура отправки
//  ПараметрыКоманды	 - ПараметрыКоманды	 - структура ЦепочкаКомандОбработки, ДанныеКоманды
//
&НаКлиенте
Процедура МассоваяОперация_Асинх_ПрочитатьДокумент(РезультатОтправки, ПараметрыКоманды) Экспорт
	
	ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;
	ПараметрыЧтения			= ПараметрыКоманды.ДанныеКоманды;
	
	// Подключить обработчик Интеграции для запуска
	ОбработчикПолучитьДокумент	= НовыйСбисОписаниеОповещения("Асинх_СБИС_ПрочитатьДокумент", ПараметрSABY("Интеграция", "Сеанс"));
	Сбис3Команда				= МассоваяОперация_НовыйАсинхроннаяСбисКоманда(РезультатОтправки, ПараметрыЧтения, ОбработчикПолучитьДокумент);
	
	АсинхроннаяСбисКоманда_Установить(Сбис3Команда, "События", МассоваяОперация_ПрочитатьДокумент_Подписки(РезультатОтправки));
	АсинхроннаяСбисКоманда_Установить(Сбис3Команда, "ЦепочкаКомандОбработки",	ЦепочкаКомандОбработки);

	Если ЭтоТипСбис(ПараметрыЧтения, "СоставПакета") Тогда
		
		// Документ уже прочитан, берем его как есть и вызываем событие ответа
		АсинхронноеСбисСобытие = НовыйАсинхронноеСбисСобытие(Сбис3Команда.Идентификатор, ПараметрыЧтения, "Message");
		АсинхроннаяСбисКоманда_ВызватьСобытие(Сбис3Команда, АсинхронноеСбисСобытие);
		Возврат;
		
	КонецЕсли;
		
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки,	"СтатусДокумента", "ЧтениеДокумента");
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ОжидаетОтвета");
    МассоваяОперация_УстановитьОбъект(РезультатОтправки, Сбис3Команда);
		
КонецПроцедуры

// Процедура - обработка ответа на ПрочитатьДокумент
//
// Параметры:
//  АсинхронноеСбисСобытие	 - АсинхронноеСбисСобытие - структура события ответа
//  ПараметрыКоманды		 - ПараметрыКоманды	 - структура ЦепочкаКомандОбработки, ДанныеКоманды
//
&НаКлиенте
Процедура МассоваяОперация_Асинх_ПрочитатьДокумент_Ответ(АсинхронноеСбисСобытие, ПараметрыВызова) Экспорт

	КомандаЗавершена		= ПараметрыВызова.Команда;
	ЦепочкаКомандОбработки	= ЦепочкаКомандОбработки_ПолучитьДанные(КомандаЗавершена,		"ЦепочкаКомандОбработки");
	РезультатОтправки		= ПараметрыВызова.РезультатОтправки;
	ДокументСБИС			= АсинхронноеСбисСобытие.Данные;
	
	ПараметрыДокумет = СоставПакета_Получить(ДокументСБИС, "Параметры");
	Если	Не ПараметрыДокумет.Свойство("Прочитан")
		Или	Не ПараметрыДокумет.Прочитан Тогда
		
		// Постобработка документа СБИС после чтения.
		ДополнительноПослеПрочитать	= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "ПрочитатьДокумент_Ответ_Дополнительно");
		СоставПакета_ПослеПрочитатьДокумент(ДокументСБИС, ДополнительноПослеПрочитать);
		
	КонецЕсли;
	
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "ДокументСБИС",		ДокументСБИС);
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки,	"СтатусДокумента",	"ДокументПрочитан");
	
	ПроверкаСертификатовПродолжить = Истина;
	
	ОперацияПродолжить = ЦепочкаКомандОбработки_УдалитьДанные(ЦепочкаКомандОбработки, "ПрочитатьДокумент_Операция");
	Если		ОперацияПродолжить = "Пересылка" Тогда
		
		// Это операция пересылки пакета, проверка сертификата не требуется
		ПроверкаСертификатовПродолжить = Ложь;
		
	ИначеЕсли	СоставПакета_Получить(ДокументСБИС, "ЭтоЧерновик") Тогда 
		
		// Если это черновик, то перегенерировть цепочку по прочитанному документу
		ЦепочкаКомандОбработки_УдалитьКоманду(ЦепочкаКомандОбработки,	"МассоваяОперация_Асинх_ПодготовитьСтруктуруДокумента");
		// Документ был разобран целиком, либо поиск проводился отдельно
		НужноИскатьДокументы1С	=	Не	(	ПараметрыДокумет.Свойство("Разобран")
										И	ПараметрыДокумет.Разобран)
								И	Не 	(	ПараметрыДокумет.Свойство("ПроведенПоискДокументов1С")
										И	Не ПараметрыДокумет.ПроведенПоискДокументов1С);
										
		Если НужноИскатьДокументы1С Тогда
			
			ПараметрыДокумет.Вставить("ПроведенПоискДокументов1С", Истина);
			МодульСтатусов = ПолучитьЗначениеПараметраТекущегоСеанса("МодульХраненияСтатусов");
			МодульСтатусов.НайтиДокументы1СПоПакетуСБИС(ДокументСБИС, ПолучитьТекущийЛокальныйКэш().Ини, ПолучитьЗначениеПараметраТекущегоСеанса("КаталогНастроек"));

		КонецЕсли;
		
		МассоваяОперация_ПроверитьИПодготовитьКоманду(РезультатОтправки, ЦепочкаКомандОбработки, ДокументСБИС);
		ПроверкаСертификатовПродолжить = Ложь;
		
	КонецЕсли;
	
	Если Не ПроверкаСертификатовПродолжить Тогда
		
		// Следующая команда будет подготовка структуры документов. Установить готовность, прочитанный документ больше не понадобится
		ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");
		Возврат;
		
	КонецЕсли; 
	
	ПараметрыЗапустить	= Новый ФиксированнаяСтруктура("ЦепочкаКомандОбработки", ЦепочкаКомандОбработки);	
	МассоваяОперация_Асинх_ПрочитатьДокумент_Продолжить(РезультатОтправки, ПараметрыЗапустить);
	
КонецПроцедуры

// Процедура - обработка ответа на ПрочитатьДокумент
//
// Параметры:
//  АсинхронноеСбисСобытие	 - АсинхронноеСбисСобытие - структура события ответа
//  ПараметрыКоманды		 - ПараметрыКоманды	 - структура ЦепочкаКомандОбработки, ДанныеКоманды
//
&НаКлиенте
Процедура МассоваяОперация_Асинх_ПрочитатьДокумент_Ошибка(АсинхронноеСбисСобытие, ПараметрыВызова) Экспорт
	Перем ОснованиеСоставПакета;
	
	КомандаЗавершена		= ПараметрыВызова.Команда;
	РезультатОтправки		= ПараметрыВызова.РезультатОтправки;
	
	// Прочитать исключение и перегенерировать его для уточнения сценария ошибки
	ИсключениеПрочитать		= НовыйСбисИсключение(АсинхронноеСбисСобытие.Данные, "МодульОбъектаКлиент.МассоваяОперация_Асинх_ПрочитатьДокумент_Ошибка");
	ЦепочкаКомандОбработки	= АсинхроннаяСбисКоманда_Получить(КомандаЗавершена, "ЦепочкаКомандОбработки");

	// Ошибка чтения документа. Установить сценарий отправки черновика для обработки детализации.
	СоставПакетаГенерируемый	= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "ОснованиеГенерацииСоставПакета");
	ПроверитьЧерновик			= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "ПрочитатьДокумент_Операция") = "Черновик";
	Если Не СоставПакетаГенерируемый = Неопределено Тогда
		
		ОснованиеСоставПакета	= СоставПакетаГенерируемый[0].Значение;
		
	КонецЕсли;
	ПараметрыИсключение		= Новый Структура("Основание, Черновик", ОснованиеСоставПакета, ПроверитьЧерновик);
	ИсключениеПрочитать		= ПерегенерироватьСбисИсключение_ПрочитатьДокумент(ИсключениеПрочитать, ПараметрыИсключение);
	
	МассоваяОперация_ОбработатьОшибку_ДокументСБИС(РезультатОтправки, ИсключениеПрочитать, ПараметрыВызова);
	МассоваяОперация_УдалитьПоток(РезультатОтправки, АсинхронноеСбисСобытие)
	
КонецПроцедуры

// Процедура - после ПрочитатьДокумент, проверить серфтикат и установовить проверку серта, если надо
//
// Параметры:
//  АсинхронноеСбисСобытие	 - АсинхронноеСбисСобытие - структура события ответа
//  ПараметрыКоманды		 - ПараметрыКоманды	 - структура ЦепочкаКомандОбработки, ДанныеКоманды
//
&НаКлиенте
Процедура МассоваяОперация_Асинх_ПрочитатьДокумент_Продолжить(РезультатОтправки, ПараметрыКоманды) Экспорт

	ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;

	Если Не МассоваяОперация_ПроверкаСертификатаПродолжитьОтправку(РезультатОтправки, ЦепочкаКомандОбработки) Тогда
		
		СтатусЦепочки = ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "Статус");
		Если Не СтатусЦепочки = "Ошибка" Тогда
			
			// Требуется проверка сертификата, установлена подписка на действие сертификатов
			ИмяКомандыПосле					= "МассоваяОперация_Асинх_ПрочитатьДокумент_Продолжить";
			ПараметрыУстановитьПродолжить	= Новый ФиксированнаяСтруктура("ПорядокВызова", 0);
			ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, ИмяКомандыПосле, РезультатОтправки, ПараметрыУстановитьПродолжить);
			
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
 	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");
		
КонецПроцедуры	

