
&НаКлиенте
Процедура МассоваяОперация_Асинх_РазобратьДляЗагрузки(РезультатОтправки, ПараметрыКоманды) Экспорт
	
	//МассоваяОперация_ПоказатьСтатус(РезультатОтправки, "Проверка сертификатов");
	
	ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;
	ДанныеКоманды			= ПараметрыКоманды.ДанныеКоманды;

	ДокументСБИС			= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки,	"ДокументСБИС");
	СоставПакета_РазобратьДляЗагрузки(ДокументСБИС, Новый Структура);
	
	МодульХраненияСтатусов	= ПолучитьЗначениеПараметраТекущегоСеанса("МодульХраненияСтатусов");
	Кэш						= ПолучитьТекущийЛокальныйКэш();
	
	МодульХраненияСтатусов.НайтиДокументы1СПоПакетуСБИС(ДокументСБИС, Кэш.Ини, ПолучитьЗначениеПараметраТекущегоСеанса("КаталогНастроек"));
	ДокументСБИС.Параметры.Вставить("ПроведенПоискДокументов1С", Истина);

	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");
	
КонецПроцедуры

