
&НаКлиенте
Процедура МассоваяОперация_Асинх_ПроверитьСертификаты(РезультатОтправки, ПараметрыКоманды) Экспорт
	
	//МассоваяОперация_ПоказатьСтатус(РезультатОтправки, "Проверка сертификатов");
	
	ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;
	ДанныеКоманды			= ПараметрыКоманды.ДанныеКоманды;
	СертификатыАктивировать = МассоваяОперация_Получить(РезультатОтправки, "КэшСертификатов");
	ИННФильтр				= СертификатыАктивировать.ИННАктивировать.ВыгрузитьЗначения();
	
	Если ИННФильтр.Количество() Тогда
		
		СертификатыАктивировать.ИННВОбработке.ЗагрузитьЗначения(ИННФильтр);
			
		// Подключить обработчик Интеграции для запуска
		ОбработчикПолучитьДокумент	= НовыйСбисОписаниеОповещения("Асинх_СБИС_СписокСертификатов", ПараметрSABY("Интеграция", "Сеанс"));
		Сбис3Команда				= МассоваяОперация_НовыйАсинхроннаяСбисКоманда(РезультатОтправки,, ОбработчикПолучитьДокумент);
		
		ИмяФункцииОшибки	= "МассоваяОперация_Асинх_ПроверитьСертификаты_Ошибка";
		Подписки_Прочитать	= Новый Структура;
		Подписки_Прочитать.Вставить("Error",	Новый Структура("Функция, Модуль",	ИмяФункцииОшибки,										МодульОбъектаКлиент()));
		Подписки_Прочитать.Вставить("Message",	Новый Структура("Функция, Модуль",	"МассоваяОперация_Асинх_ПроверитьСертификаты_Ответ",	МодульОбъектаКлиент()));
		Подписки_Прочитать.Message.Вставить("ФункцияОшибки", ИмяФункцииОшибки);
		
		АсинхроннаяСбисКоманда_Установить(Сбис3Команда, "ЦепочкаКомандОбработки",	ЦепочкаКомандОбработки);
		АсинхроннаяСбисКоманда_Установить(Сбис3Команда, "События",					Подписки_Прочитать);
		
		МассоваяОперация_УстановитьОбъект(РезультатОтправки, Сбис3Команда);
		
		ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ОжидаетОтвета");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МассоваяОперация_Асинх_ПроверитьСертификаты_Подготовить(РезультатОтправки, ЦепочкаКомандОбработки)
	Перем ДействиеАктивировать;
	
	// Подключить подписку на обработку проверки сертификатов.
	КомандаВыполнить		= "МассоваяОперация_Асинх_ПроверитьСертификаты";
	КомандаЗавершить		= "МассоваяОперация_Асинх_ПроверитьСертификаты_Завершить";

	ОчередьДействий			= МассоваяОперация_Получить(РезультатОтправки, "Очередь");
	ДействиеАктивировать	= ОчередьДействий.Получить(КомандаВыполнить);
		
	Если ДействиеАктивировать = Неопределено Тогда
		
		ДействиеАктивировать 	= НовыйЦепочкаКомандОбработки(КомандаВыполнить,,10);
		ЦепочкаКомандОбработки_УстановитьКоманду(ДействиеАктивировать, КомандаВыполнить, РезультатОтправки);
		ЦепочкаКомандОбработки_УстановитьКоманду(ДействиеАктивировать, КомандаЗавершить, РезультатОтправки);
		МассоваяОперация_УстановитьОбъект(РезультатОтправки, ДействиеАктивировать);
		
	КонецЕсли;

	ЦепочкаКомандОбработки_УстановитьПодпискуДействия(ДействиеАктивировать, ЦепочкаКомандОбработки, КомандаЗавершить);
	
КонецПроцедуры

&НаКлиенте
Процедура МассоваяОперация_Асинх_ПроверитьСертификаты_Ответ(АсинхронноеСбисСобытие, ПараметрыВызова) Экспорт

	КомандаЗавершена		= ПараметрыВызова.Команда;
	РезультатОтправки		= ПараметрыВызова.РезультатОтправки;
	
	ЦепочкаКомандОбработки	= АсинхроннаяСбисКоманда_Получить(КомандаЗавершена, "ЦепочкаКомандОбработки");
	СертификатыАктивировать = МассоваяОперация_Получить(РезультатОтправки, "КэшСертификатов");	
	
	СписокАктивации			= Новый СписокЗначений;
	Для Каждого СертификатПолучен Из АсинхронноеСбисСобытие.Данные.Сертификат Цикл 
		
		Если СертификатыАктивировать.ИННВОбработке.НайтиПоЗначению(СертификатПолучен.ИНН) = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
			
		Если	СертификатПолучен.Ключ.Тип = "Серверный"
			И	СертификатПолучен.Ключ.Активирован = "Нет" Тогда
			
			СписокАктивации.Добавить(СертификатПолучен);
			
		КонецЕсли;
		
	КонецЦикла; 

	ПараметрыАктивировать	= Новый Структура("ИННВОбработке, НомерСертификата, Список", Новый СписокЗначений, 0, СписокАктивации);
	ПараметрыАктивировать.ИННВОбработке.ЗагрузитьЗначения(СертификатыАктивировать.ИННВОбработке.ВыгрузитьЗначения());
	//// +UAAУдалить
	//СертификатыАктивировать.ИННВОбработке.Добавить("1234");
	//СертификатыАктивировать.ИННАктивировать.Добавить("1234");
	//ПараметрыАктивировать.ИННВОбработке.Добавить("1234");
	//СписокАктивации.Добавить(Новый Структура("ИНН, Отпечаток, Ключ, ФИО", "1234", "ква", Новый Структура("СпособАктивации", "СтатическийКод"), "автотест в."));
	//// -
	
	ПараметрыУстановить	= Новый ФиксированнаяСтруктура("ПорядокВызова", 0);
	КомандаПродолжить	= "МассоваяОперация_Асинх_ПроверитьСертификаты_Продолжить";
	
	Если СписокАктивации.Количество() Тогда
		
		КомандаПродолжить = "МассоваяОперация_Асинх_ВвестиПинКоды";
		
	КонецЕсли;
		
	ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, КомандаПродолжить, ПараметрыАктивировать, ПараметрыУстановить);

КонецПроцедуры

&НаКлиенте
Процедура МассоваяОперация_Асинх_ПроверитьСертификаты_Ошибка(АсинхронноеСбисСобытие, ПараметрыВызова) Экспорт
	
	КомандаЗавершена		= ПараметрыВызова.Команда;
	РезультатОтправки		= ПараметрыВызова.РезультатОтправки;
	
	ЦепочкаКомандОбработки	= АсинхроннаяСбисКоманда_Получить(КомандаЗавершена, "ЦепочкаКомандОбработки");
	
 	ЦепочкаКомандОбработки_УстановитьКоманду(	ЦепочкаКомандОбработки,
												"МассоваяОперация_Асинх_ПроверитьСертификаты_Продолжить",
												АсинхронноеСбисСобытие.Данные,
												Новый ФиксированнаяСтруктура("ПорядокВызова", 0));

КонецПроцедуры
	
&НаКлиенте
Процедура МассоваяОперация_Асинх_ПроверитьСертификаты_Продолжить(РезультатОтправки, ПараметрыКоманды) Экспорт
	
	ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;
	ДанныеКоманды			= ПараметрыКоманды.ДанныеКоманды;
	СертификатыАктивировать = МассоваяОперация_Получить(РезультатОтправки, "КэшСертификатов");

	ИнтеграцияМодуль		= ПараметрSABY("Интеграция", "Сеанс");
	Кэш						= ПолучитьТекущийЛокальныйКэш();
	АктивацияВыполнена		= Ложь;
	ОшибкиАктивации			= Новый Массив;
	
	Если ЭтоТипСбис(ДанныеКоманды, "СбисИсключение") Тогда
		
		// Упала ошибка при обработке текущих.
		Для Каждого ИННАктивировать Из СертификатыАктивировать.ИННВОбработке Цикл
			
			СертификатыАктивировать.ИННОшибки.Вставить(ИННАктивировать.Значение, ДанныеКоманды);
			ОшибкиАктивации.Добавить(ИННАктивировать.Значение);
			
		КонецЦикла;
		
	Иначе
		
		Если ДанныеКоманды.Список.Количество() Тогда
			
			СписокАктивировать = Новый СписокЗначений;
			Для ИндексСертификата = 0 По ДанныеКоманды.Список.Количество() - 1 Цикл
				
				Сертификат = ДанныеКоманды.Список[ИндексСертификата].Значение;
				Если Сертификат.Свойство("КодАктивации") Тогда
					
					СписокАктивировать.Добавить(Сертификат)
					
				КонецЕсли;
				
				Если Сертификат.Свойство("Ошибка") Тогда
					
					СертификатыАктивировать.ИННОшибки.Вставить(Сертификат.ИНН, Сертификат.Ошибка);
					ОшибкиАктивации.Добавить(Сертификат.ИНН);
					
				КонецЕсли;
				
			КонецЦикла;
			
			// Активировать часть сертификатов, по которым ввели пин-коды
			Если	СписокАктивировать.Количество()
				И	ИнтеграцияМодуль.АктивироватьСерверныеСертификаты(Кэш, СписокАктивировать) = Ложь Тогда
					
					ОшибкаАктивации = НовыйСбисИсключение(755, "МодульОбъектаКлиент.МассоваяОперация_МассоваяОтправка_АктивацияСертификатов_Продолжить",,"Ошибка активации сертификатов");
					Для Каждого СертификатУпал Из СписокАктивировать Цикл	
						
						СертификатыАктивировать.ИННОшибки.Вставить(СертификатУпал.Значение.ИНН, ОшибкаАктивации);
						ОшибкиАктивации.Добавить(СертификатУпал.Значение.ИНН);
						
					КонецЦикла;
					
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЕсли;
	
	// Очистить ИНН, по которым были ошибки
	Для Каждого ИННУпалСертификат Из ОшибкиАктивации Цикл
		
		ИННВОбработке = СертификатыАктивировать.ИННАктивировать.НайтиПоЗначению(ИННУпалСертификат);
		Если Не ИННВОбработке = Неопределено Тогда
			СертификатыАктивировать.ИННАктивировать.Удалить(ИННВОбработке);
		КонецЕсли;
		
		ИННВОбработке = СертификатыАктивировать.ИННВОбработке.НайтиПоЗначению(ИННУпалСертификат);
		Если Не ИННВОбработке = Неопределено Тогда
			СертификатыАктивировать.ИННВОбработке.Удалить(ИННВОбработке);
		КонецЕсли;
		
	КонецЦикла;
	
	// Успешно обработана часть сертификатов.
	Для Каждого ИННАктивирован Из СертификатыАктивировать.ИННВОбработке Цикл	
		
		СертификатыАктивировать.ИННАктивированы.Добавить(ИННАктивирован.Значение);
		ИННВОбработке = СертификатыАктивировать.ИННАктивировать.НайтиПоЗначению(ИННАктивирован.Значение);
		Если Не ИННВОбработке = Неопределено Тогда
			СертификатыАктивировать.ИННАктивировать.Удалить(ИННВОбработке);
		КонецЕсли;
		
	КонецЦикла;
	
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");
	
КонецПроцедуры
	
&НаКлиенте
Процедура МассоваяОперация_Асинх_ПроверитьСертификаты_Завершить(РезультатОтправки, ПараметрыКоманды) Экспорт
	
	// Удалить действие из очереди, не дожидаясь его завершения.
	ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;
	КомандаЗавершить		= ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "Идентификатор");
	ОчередьДействий			= МассоваяОперация_Получить(РезультатОтправки, "Очередь");
	ОчередьДействий.Удалить(КомандаЗавершить);
	
КонецПроцедуры

&НаКлиенте
Процедура МассоваяОперация_Асинх_ВвестиПинКоды(РезультатОтправки, ПараметрыКоманды) Экспорт
	
	ЦепочкаКомандОбработки	= ПараметрыКоманды.ЦепочкаКомандОбработки;
	ДанныеКоманды			= ПараметрыКоманды.ДанныеКоманды;

	СертификатыАктивировать = МассоваяОперация_Получить(РезультатОтправки, "КэшСертификатов");
	СертификатТекущий		= ДанныеКоманды.Список[ДанныеКоманды.НомерСертификата].Значение;
	ИнтеграцияМодуль		= ПараметрSABY("Интеграция", "Сеанс");
	ФункцииМодуль			= ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции");
	Кэш						= ПолучитьТекущийЛокальныйКэш();
	
	//ПрогрессБар = Окр(ДанныеКоманды.НомерСертификата * 100 / СертификатыАктивировать.Список.Количество());
	//МассоваяОперация_ПоказатьСтатус(РезультатОтправки, "Активация сертификатов", ПрогрессБар);
	
	Если СертификатТекущий.Ключ.СпособАктивации = "ВременныйКод" Тогда
		
		ИнтеграцияМодуль.ПолучитьКодАктивацииСертификата(Кэш, СертификатТекущий);
		
	КонецЕсли;
	
	Если	СертификатТекущий.Ключ.СпособАктивации = "СтатическийКод"
		Или	СертификатТекущий.Ключ.СпособАктивации = "ВременныйКод" Тогда
		
		ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ОжидаетОтвета");
		СертификатИмя			= "Введите код активации сертификата " 
			+ ФункцииМодуль.ПолучитьПредставлениеСертификата(СертификатТекущий, "[ФИО].([Должность])., [Название].(ИНН [ИНН])", Истина);
		
		ПараметрыПродолжить		= Новый ФиксированнаяСтруктура("РезультатОтправки, ЦепочкаКомандОбработки, ДанныеКоманды", 
																РезультатОтправки, ЦепочкаКомандОбработки, ДанныеКоманды);
																
		ОбработчикПродолжить	= НовыйСбисОписаниеОповещения(	"МассоваяОперация_Асинх_ВвестиПинКоды_РезультатВвода",
																МодульОбъектаКлиент(),
																ПараметрыПродолжить);
		ФормаВвода = ПолучитьФормуОбработки("ФормаВводаПинкода", Новый Структура("Владелец", РезультатОтправки.ПараметрыОтправки.Владелец));
		ФормаВвода.ОписаниеОповещенияОЗакрытии = ОбработчикПродолжить;
		ФормаВвода.Показать(Новый Структура("СертификатИмя", СертификатИмя));
		
	Иначе
		
		ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "МассоваяОперация_Асинх_ПроверитьСертификаты_Продолжить", РезультатОтправки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МассоваяОперация_Асинх_ВвестиПинКоды_РезультатВвода(РезультатВвода = Неопределено, ПараметрыИнтерфейсногоВызова) Экспорт
	
	ЦепочкаКомандОбработки	= ПараметрыИнтерфейсногоВызова.ЦепочкаКомандОбработки;
	ДанныеКоманды			= ПараметрыИнтерфейсногоВызова.ДанныеКоманды;
	РезультатОтправки		= ПараметрыИнтерфейсногоВызова.РезультатОтправки;

	СертификатыАктивировать = МассоваяОперация_Получить(РезультатОтправки, "КэшСертификатов");
	СертификатТекущий		= ДанныеКоманды.Список[ДанныеКоманды.НомерСертификата].Значение;
	
	// Считаем, что либо активировали все сертификаты, либо ничего. Пока так.
	Если РезультатВвода = Неопределено Тогда
		
		ФункцииМодуль		= ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции");
		СертификатИмя		= ФункцииМодуль.ПолучитьПредставлениеСертификата(СертификатТекущий, "[ФИО].([Должность])., [Название].(ИНН [ИНН])", Истина);
		ТекстОшибки			= "Активация сертификата " + СертификатИмя + " отменена";
		ИсключениеОтмена	= НовыйСбисИсключение(790, "МодульОбъектаКлиент.МассоваяОперация_Асинх_ПроверитьСертификаты_ПослеАктивации",,,ТекстОшибки);
		
		СертификатТекущий.Вставить("Ошибка",		ИсключениеОтмена);
		
	Иначе
		
		СертификатТекущий.Вставить("КодАктивации",	РезультатВвода.ПинКод);
		
	КонецЕсли;
	
	ДанныеКоманды.НомерСертификата = ДанныеКоманды.НомерСертификата + 1;
	
	Если ДанныеКоманды.Список.Количество() > ДанныеКоманды.НомерСертификата + 1 Тогда
		
		ИмяКомандыПродолжить = "МассоваяОперация_Асинх_ВвестиПинКоды";
		
	Иначе
		
		ИмяКомандыПродолжить = "МассоваяОперация_Асинх_ПроверитьСертификаты_Продолжить";
		
	КонецЕсли;
	
	ЦепочкаКомандОбработки_УстановитьКоманду(	ЦепочкаКомандОбработки,
												ИмяКомандыПродолжить,
												ДанныеКоманды,
												Новый ФиксированнаяСтруктура("ПорядокВызова", 0));		


КонецПроцедуры
	
