
&НаКлиенте
Процедура ПередАвторизациейПереопределяемый()
	ЗаполнитьКэшВО2ИзКонтекстаВО3();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКэшВО2ИзКонтекстаВО3() Экспорт
	МодульОбъектаКлиент = ВладелецФормы.МодульОбъектаКлиент();
	
	ApiUrl = get_prop(context_params, "ApiUrl");
	Если Лев(ApiUrl, 8) = "https://" Тогда
		ApiUrl = Сред(ApiUrl, 9);
	КонецЕсли;
	МодульОбъектаКлиент.ИзменитьПараметрСбис("АдресСервера", ApiUrl);
	
	ProxyType = get_prop(context_params, "ProxyType");
	Если ProxyType = "SystemSettings" Тогда
		МодульОбъектаКлиент.ИзменитьПараметрСбис("ТипПрокси", "Автоматически");
	ИначеЕсли ProxyType = "NotUse" Тогда
		МодульОбъектаКлиент.ИзменитьПараметрСбис("ТипПрокси", "НеИспользовать");
	Иначе 
		МодульОбъектаКлиент.ИзменитьПараметрСбис("ТипПрокси", "Вручную");
		Proxy = get_prop(context_params, "Proxy");
		Protocol = get_prop(Proxy, "Protocol");
		Server = get_prop(Proxy, "Server");
		Port = get_prop(Proxy, "Port");
		User = get_prop(Proxy, "User");
		Password = get_prop(Proxy, "Password");
		МодульОбъектаКлиент.ИзменитьПараметрСбис("ПроксиСервер", Server);
		МодульОбъектаКлиент.ИзменитьПараметрСбис("ПроксиПорт", Port);
		МодульОбъектаКлиент.ИзменитьПараметрСбис("ПроксиЛогин", User);
		МодульОбъектаКлиент.ИзменитьПараметрСбис("ПроксиПароль", Password);
	КонецЕсли;
	
	ИмяСвойстваТранспорта = ИмяСвойстваТранспорта();
	Транспорт = get_prop(context_params, ИмяСвойстваТранспорта);
	Если Транспорт = "ExtSdk" Тогда
		СпособОбмена = 6;
	ИначеЕсли Транспорт = "ExtSdkCrypto" Тогда
		СпособОбмена = 7;
	ИначеЕсли Транспорт = "API" Тогда
		СпособОбмена = 3;
		МодульОбъектаКлиент.ИзменитьПараметрСбис("ИнтеграцияAPIВызовыНаКлиенте", Ложь);
	ИначеЕсли Транспорт = "APIClient" Тогда
		СпособОбмена = 3;
		МодульОбъектаКлиент.ИзменитьПараметрСбис("ИнтеграцияAPIВызовыНаКлиенте", Истина);
	ИначеЕсли Транспорт = "SabyHttpsClient" Тогда
		СпособОбмена = 9;
	ИначеЕсли Транспорт = "SabyPluginConnector" Тогда
		СпособОбмена = 8;
	Иначе
		СпособОбмена = 1;
	КонецЕсли;
	СпособОбмена_До = МодульОбъектаКлиент.ПолучитьЗначениеПараметраСБИС("СпособОбмена");
	Если СпособОбмена_До <> СпособОбмена Тогда
		МодульОбъектаКлиент.ИзменитьПараметрСбис("СпособОбмена", СпособОбмена);
		ВладелецФормы.ОпределитьИнтеграциюРабочиеФормы(ВладелецФормы.Кэш, ВладелецФормы.Кэш.Парам);
	КонецЕсли;
	
    МодульОбъектаКлиент.ИзменитьПараметрСбис("ШифроватьВыборочно", get_prop(context_params, "EncryptSelectively"));
	МодульОбъектаКлиент.ИзменитьПараметрСбис("ВремяОжиданияОтвета", get_prop(context_params, "Timeout"));
	МодульОбъектаКлиент.ИзменитьПараметрСбис("КаталогОбмена", get_prop(context_params, "ExchangeCatalog"));
	МодульОбъектаКлиент.ИзменитьПараметрСбис("РежимОтладки", get_prop(context_params, "AdvancedLog"));
	МодульОбъектаКлиент.ИзменитьПараметрСбис("КаталогОтладки", get_prop(context_params, "LoggingCatalog"));
КонецПроцедуры
