
&НаКлиенте
Процедура ПослеАвторизацииПереопределяемый()
	ЗаполнитьКэшВО2ИзКонтекстаВО3ПослеАвторизации();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКэшВО2ИзКонтекстаВО3ПослеАвторизации() Экспорт
	МодульОбъектаКлиент = ВладелецФормы.МодульОбъектаКлиент();
	
	Session = ТранспортИнтеграции.УИДСессии(context_params);
	МодульОбъектаКлиент.ИзменитьПараметрСбис("ИдентификаторСессии", Session);
		
	AuthType = get_prop(context_params, "AuthType");
	AutoAuth = get_prop(context_params, "AutoAuth");
	Если AuthType = "Certificate" Тогда
		МодульОбъектаКлиент.ИзменитьПараметрСбис("ВходПоСертификату", Истина);		
		МодульОбъектаКлиент.ИзменитьПараметрСбис("ЗапомнитьСертификат", AutoAuth);
		Certificate = get_prop(context_params, "Certificate");
		МодульОбъектаКлиент.ИзменитьПараметрСбис("Сертификат", Certificate);
	Иначе
		МодульОбъектаКлиент.ИзменитьПараметрСбис("ВходПоСертификату", Ложь);
		МодульОбъектаКлиент.ИзменитьПараметрСбис("ЗапомнитьПароль", AutoAuth);
		Login = get_prop(context_params, "Login");
		МодульОбъектаКлиент.ИзменитьПараметрСбис("Логин", Login);
		Password = get_prop(context_params, "Password");
		МодульОбъектаКлиент.ИзменитьПараметрСбис("Пароль", Password);
	КонецЕсли;
КонецПроцедуры

