
&НаКлиенте
Процедура ПриОткрытииПереопределяемый()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	#Если ВебКлиент Тогда
		ExtSdkCrypto = ЭлементыФормочки.exchange_method.СписокВыбора.НайтиПоЗначению("ExtSdkCrypto");
		Если ExtSdkCrypto <> Неопределено Тогда
			ЭлементыФормочки.exchange_method.СписокВыбора.Удалить(ExtSdkCrypto);
		КонецЕсли;	
		SabyConnect = ЭлементыФормочки.exchange_method.СписокВыбора.НайтиПоЗначению("SabyConnect");
		Если SabyConnect <> Неопределено Тогда
			ЭлементыФормочки.exchange_method.СписокВыбора.Удалить(SabyConnect);
		КонецЕсли;	
	    ExtSdk = ЭлементыФормочки.exchange_method.СписокВыбора.НайтиПоЗначению("ExtSdk");
		Если ExtSdk <> Неопределено Тогда
			ЭлементыФормочки.exchange_method.СписокВыбора.Удалить(ExtSdk);
		КонецЕсли;
		SabyPluginConnector = ЭлементыФормочки.exchange_method.СписокВыбора.НайтиПоЗначению("SabyPluginConnector");
		Если SabyPluginConnector <> Неопределено Тогда
			ЭлементыФормочки.exchange_method.СписокВыбора.Удалить(SabyPluginConnector);
		КонецЕсли;
	#КонецЕсли
	ЭлементыФормочки.ВойтиЧерезБраузер.Видимость = Ложь;
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ЭлементыФормочки.ВойтиПользователем1С.Видимость = Ложь;	
	#КонецЕсли
	ЭлементыФормочки.РежимВходаПоСертификату.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Функция МодульОбъектаКлиент() Экспорт
	Возврат ВладелецФормы.Кэш.СБИС.МодульОбъектаКлиент;
КонецФункции

&НаКлиенте
Процедура НастройкаЭПНажатие(Элемент)
	
	ПараметрыЗапросаФормы = Новый Структура("Владелец, ПолучитьНовую, КэшироватьФорму", 
											 ЭтаФорма.ВладелецФормы, Истина,		  Ложь);
	ОбработкаВыбора = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("НастройкиПодписания_РезультатДиалога", ЭтаФорма);
	
	фрм = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаНастройкиПодписания", ПараметрыЗапросаФормы);
	фрм.ОписаниеОповещенияОЗакрытии = ОбработкаВыбора;
	фрм.ПоказатьПоверх();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПодписания_РезультатДиалога(РезультатВвода, ДопПараметры = Неопределено)  Экспорт
	
	Если РезультатВвода = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МодульОбъектаКлиент().ИзменитьПараметрСБИС("НастройкиКриптографии", РезультатВвода);

КонецПроцедуры
