
#Область include_core2_vo2_Формы_Вход_ПереопределениеСпособовОбмена
#КонецОбласти

&НаКлиенте
Процедура ПриОткрытииПереопределяемый()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ПереопределитьСпособыОбмена();
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ЭлементыФормочки.ВойтиПользователем1С.Видимость = Ложь;
	#КонецЕсли
	ЭлементыФормочки.РежимВходаПоСертификату.Видимость = Истина;
	ЭлементыФормочки.ПанельВебВерсия.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Функция МодульОбъектаКлиент() Экспорт
	Возврат ВладелецФормы.Кэш.СБИС.МодульОбъектаКлиент;
КонецФункции

&НаКлиенте
Процедура НастройкаЭПНажатие(Элемент)
	
	ПараметрыЗапросаФормы = Новый Структура("Владелец, ПолучитьНовую, КэшироватьФорму", 
											 ЭтаФорма.ВладелецФормы, Истина,		  Ложь);
	ОбработкаВыбора = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("НастройкиПодписания_РезультатДиалога", ЭтаФорма);
	
	фрм = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаНастройкиПодписания", ПараметрыЗапросаФормы);
	фрм.ОписаниеОповещенияОЗакрытии = ОбработкаВыбора;
	фрм.ПоказатьПоверх();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПодписания_РезультатДиалога(РезультатВвода, ДопПараметры = Неопределено)  Экспорт
	
	Если РезультатВвода = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МодульОбъектаКлиент().ИзменитьПараметрСБИС("НастройкиКриптографии", РезультатВвода);

КонецПроцедуры
