
&НаКлиенте
Функция ЗагрузкаВ1С_Диалоги_Подготовить(ПараметрыОбработки)

	МодульТекущий = МодульОбъектаКлиент();

	ОтветыНаДиалоги		= Новый Структура("Отмена, РежимДокументов, РежимНоменклатуры, ИзменениеВДокумент", Ложь, -1, -1);
	ДиалогиПроверить	= Новый Структура("Диалоги, Ответы, ПараметрыОбработки", Новый Структура, ОтветыНаДиалоги, ПараметрыОбработки);
	
	Для Каждого СтрокаТаблицыДокументов Из ПараметрыОбработки.Вложение Цикл
		
		ВложениеСБИС			= СтрокаТаблицыДокументов.Вложение[0].Значение;
		ПараметрыВложения		= МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "Параметры");
		ПараметрыНоменклатуры	= МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "ПараметрыНоменклатуры");
		Поля1С					= МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "Поля1С");
		ПодходящийДокумент		= Поля1С.Документ.Значение;
		
		ЗаписатьСопоставлениеНоменклатуры_Служебный(ВложениеСБИС, ПараметрыОбработки);
		
		Если		ПараметрыНоменклатуры.НадоСопоставлять
			И	Не	ПараметрыНоменклатуры.Сопоставлено Тогда
			
			// Если установлен режим создавать номенклатуру для массовой загрузки, то тут так же применяется
			Если МодульТекущий.ПолучитьЗначениеПараметраСбис("СпособЗагрузки") = 1 Тогда
				
				ДиалогиПроверить.Ответы.Вставить("РежимНоменклатуры", 1);
				
			Иначе
				
				ОбработчикВыбора	= МодульТекущий.НовыйСбисОписаниеОповещения("ЗагрузкаВ1С_Диалоги_Ответ",	ЭтаФорма, ДиалогиПроверить);
				ПараметрыДляСписка	= Новый Структура("Заголовок, Обработчик", 
					"Не вся номенклатура сопоставлена!", 
					ОбработчикВыбора);
				ДиалогиПроверить.Диалоги.Вставить("РежимНоменклатуры", Новый Структура("Вид, Список, Параметры", 
					"Список",
					МодульТекущий.СписокДоступныхСпособовОбработкиНоменклатуры("Диалог"),
					ПараметрыДляСписка));
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПодходящийДокумент) Тогда
			
			Если 	ПараметрыВложения.РедактироватьДокумент
				Или	ПараметрыВложения.РедактироватьТабЧасть Тогда
				
				ДокументыВложения = МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "Документы1С");
				Если ДокументыВложения.НайтиПоЗначению(ПодходящийДокумент) = Неопределено Тогда
					
					// Это НЕ сопоставленный документ, спросить о необходимости внести изменение
					ОбработчикВыбора	= МодульТекущий.НовыйСбисОписаниеОповещения("ЗагрузкаВ1С_Диалоги_Ответ",	ЭтаФорма, ДиалогиПроверить);
					ТекстВопроса		= "Внести изменения в исходный документ " + Строка(ПодходящийДокумент) + "?";
					КнопкиВопроса		= РежимДиалогаВопрос.ДаНетОтмена; 
					ДиалогиПроверить.Диалоги.Вставить("ИзменениеВДокумент", Новый Структура("Текст, Вид, Кнопки, Обработчик",
						ТекстВопроса,
						"Вопрос",
						КнопкиВопроса,
						ОбработчикВыбора));
								
				КонецЕсли;
				
			Иначе
				
				ОбработчикВыбора	= МодульТекущий.НовыйСбисОписаниеОповещения("ЗагрузкаВ1С_Диалоги_Ответ",	ЭтаФорма, ДиалогиПроверить);
				РежимыОбработкиДокументов = МодульОбъектаКлиент().СписокДоступныхСпособовОбработкиДокументов("Диалог");
				ДиалогиПроверить.Диалоги.Вставить("РежимДокументов", Новый Структура("Текст, Вид, Кнопки, Обработчик", 
					"Есть существующие документы. Выберите вариант загрузки.", 
					"Вопрос",
					РежимыОбработкиДокументов,
					ОбработчикВыбора));	
				
			КонецЕсли;
						
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДиалогиПроверить;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузкаВ1С_Диалоги_Следующий(АктивныеДиалоги)

	Если АктивныеДиалоги.Ответы.Отмена Тогда
		
		МодульОбъектаКлиент().СбисСообщить("Отменено");
		Возврат;
		
	ИначеЕсли Не АктивныеДиалоги.Диалоги.Количество() Тогда
		
		ЗагрузкаВ1С_Диалоги_Завершить(АктивныеДиалоги.Ответы, АктивныеДиалоги.ПараметрыОбработки);
		Возврат;
		
	КонецЕсли;
		
	Для Каждого КлючИЗначениеДиалог Из АктивныеДиалоги.Диалоги Цикл
		
		ОписаниеДиалога = КлючИЗначениеДиалог.Значение;
		АктивныеДиалоги.Вставить("ТекущийДиалог",	ОписаниеДиалога);
		АктивныеДиалоги.Вставить("КлючОтвета",		КлючИЗначениеДиалог.Ключ);
		Если ОписаниеДиалога.Вид = "Вопрос" Тогда
			
			МодульОбъектаКлиент().СбисПоказатьВопрос(ОписаниеДиалога.Обработчик, ОписаниеДиалога.Текст, ОписаниеДиалога.Кнопки);
			
		Иначе
			
			МодульОбъектаКлиент().СбисВыбратьИзСписка(ОписаниеДиалога.Список, ОписаниеДиалога.Параметры);
			
		КонецЕсли;
		Прервать;
		
	КонецЦикла;
	АктивныеДиалоги.Диалоги.Удалить(КлючИЗначениеДиалог.Ключ);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаВ1С_Диалоги_Завершить(ОтветыНаДиалоги, ДопПараметры)
	
	ПараметрыОбработки	= Новый Структура;
	ОбработчикРезультат = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ЗагрузкаВ1С_ОбработатьРезультат", ЭтаФорма, ПараметрыОбработки);
	
	ДопПараметрыСоздатьПерезаполнить = Новый Структура();
	ДопПараметрыСоздатьПерезаполнить.Вставить("ОбработчикРезультата",	ОбработчикРезультат);
	ДопПараметрыСоздатьПерезаполнить.Вставить("ВыполнитьОбработчик",	Истина);
	ДопПараметрыСоздатьПерезаполнить.Вставить("ИскатьДокумент1С",		Ложь);
	ДопПараметрыСоздатьПерезаполнить.Вставить("СохранитьСопоставление",	Ложь);

	ПараметрыРезультатаДействия = Новый Структура("ПредставлениеОперации, ФормаВызова, ПрикладнаяСтатистика",
		"ЗагрузкаДокумента",
		"ФормаПросмотрДокумента",
		МодульОбъектаКлиент().НовыйПрикладнаяСтатистика());
	РезультатДействия = МестныйКэш.ОбщиеФункции.РезультатДействия_Получить(МестныйКэш, ПараметрыРезультатаДействия, Истина);
	РезультатДействия.Параметры.Вставить("РежимДокументов", ОтветыНаДиалоги.РежимДокументов);
	МестныйКэш.ОбщиеФункции.СоздатьПерезаполнитьДокументы(МестныйКэш, СоставПакета, ДопПараметры.Вложение, ОтветыНаДиалоги, ДопПараметрыСоздатьПерезаполнить);

КонецПроцедуры

// Процедура - обработка ответа на диалог
//
// Параметры:
//  ВариантОтвета	 - КодВозвратаДиалога/ЭлементСпискаЗначений/Неопределено	 - что выбрали в диалоге
//  ДопПараметры	 - Структура												 - еще не обработанные диалоги
//
&НаКлиенте
Процедура ЗагрузкаВ1С_Диалоги_Ответ(ВариантОтвета, ДопПараметры) Экспорт

	Если	ВариантОтвета = Неопределено
		Или	ВариантОтвета = КодВозвратаДиалога.Отмена Тогда
		
		ДопПараметры.Ответы.Вставить("Отмена", Истина);
		
	ИначеЕсли ТипЗнч(ВариантОтвета) = Тип("ЭлементСпискаЗначений") Тогда
		
		ДопПараметры.Ответы.Вставить(ДопПараметры.КлючОтвета, ВариантОтвета.Значение);
		
	Иначе
		
		ДопПараметры.Ответы.Вставить(ДопПараметры.КлючОтвета, ВариантОтвета);
		
	КонецЕсли;
	
	ЗагрузкаВ1С_Диалоги_Следующий(ДопПараметры)
		
КонецПроцедуры
	
