
&НаКлиенте
Процедура СохранитьНажатие(Команда)

	ПрименитьИзменениеИЗакрыть();
	
КонецПроцедуры

//Процедура открывает карточку документа 1С из списка подходящих документов	
&НаКлиенте
Процедура КоманднаяПанельПодходящиеДокументыПросмотр(Команда)
	
	СбисЭлементДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПодходящиеДокументы");
	Если СбисЭлементДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Документ1С = СбисЭлементДанные.ТекущиеДанные.Документ1С;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Документ1С.ПолучитьФорму().ОткрытьМодально();
		
	#Иначе
		
		ПоказатьЗначение(Неопределено, сбисЭлементДанные.Документ1С);
		
	#КонецЕсли
	
КонецПроцедуры

//Процедура сопоставляет выбранный документ 1С документу сбис	
&НаКлиенте
Процедура КоманднаяПанельПодходящиеДокументыВыбрать(Команда)
	
	сбисЭлементДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПодходящиеДокументы").ТекущиеДанные;
	Если СбисЭлементДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Документ1С = СбисЭлементДанные.ТекущиеДанные.Документ1С;
	
КонецПроцедуры

