
&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыОткрытия)
	
	МестныйКэш	= МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	оДокумент	= ПараметрыОткрытия.Документ;
	
	ЭлементДокумент1С = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Документ1С");
	УстановитьОграничениеТипа(ЭлементДокумент1С, оДокумент.Типы1С);	
	
	Если Не оДокумент.Документ1С = Неопределено Тогда
		
		Документ1С = оДокумент.Документ1С;
		
	Иначе
		
		ИниДокумента = МодульОбъектаКлиент().ИниПоПараметрам(Новый Структура("ТипСБИС, ТипИни", оДокумент.ТипСБИС, "Выгрузка"));
		Для Каждого КлючИЗначениеИни Из ИниДокумента Цикл
			
			ДокументЗначение = КлючИЗначениеИни.Значение.Документ;
			Если ПустаяСтрока(ДокументЗначение) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Попытка
				
				ИмяДокумента1С	= МестныйКэш.ОбщиеФункции.сбисСообщитьИмяРеквизита(ДокументЗначение.Значение);
				Документ1С		= МестныйКэш.ОбщиеФункции.СформироватьПустуюСсылкуДокумента(ИмяДокумента1С);
				Прервать;

			Исключение;
				
				// Старый велосипед - делаем пока не получится, либо не кончатся ини
				
			КонецПопытки;

			
		КонецЦикла;
		
	КонецЕсли;

 	ДокументНазвание = оДокумент.ДокументСБИСНазвание;
	
	ПодходящиеДокументы.Очистить();
	Для Каждого Док Из оДокумент.СписокПодходящихДокументов Цикл
		
		НоваяСтрока = ПодходящиеДокументы.Добавить();
		НоваяСтрока.Документ1С = Док.Значение;
		
	КонецЦикла;	
	
	Если		оДокумент.СписокПодходящихДокументов.Количество() = 1
		И	Не	ЗначениеЗаполнено(Документ1С) Тогда
		
		Документ1С = оДокумент.СписокПодходящихДокументов[0].Значение;
		
	КонецЕсли;
	
КонецПроцедуры

