
&НаКлиенте
Процедура ДействиеНажатие(Элемент)
	
	ОткрытьСсылкуОплаты = МодульОбъектаКлиент().НайтиВМассивеСтруктурПоКлючу(ИнформацияОЗадолженности.ПользовательскиеДействия,
																			"ОткрытьСсылкуОплаты",
																			"Идентификатор");
	
	Отмена = МодульОбъектаКлиент().НайтиВМассивеСтруктурПоКлючу(ИнформацияОЗадолженности.ПользовательскиеДействия,
																			"Отмена",
																			"Идентификатор");
																	
	МодульОбъектаКлиент().ПользовательскиеДействия_Выполнить(ОткрытьСсылкуОплаты, ИнформацияОЗадолженности);
	
	ФормаЗакрытьУстановитьСтатусОк(Отмена, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидеозвонокНажатие(Элемент)
	
	Видеозвонок = МодульОбъектаКлиент().НайтиВМассивеСтруктурПоКлючу(ИнформацияОЗадолженности.ПользовательскиеДействия,
																	"Видеозвонок",
																	"Идентификатор");
																	
	МодульОбъектаКлиент().ПользовательскиеДействия_Выполнить(Видеозвонок, ИнформацияОЗадолженности);
	
КонецПроцедуры

&НаКлиенте
Процедура ФотоМенеджераНажатие(Элемент)
	
	КарточкаМенеджера = МодульОбъектаКлиент().НайтиВМассивеСтруктурПоКлючу(ИнформацияОЗадолженности.ПользовательскиеДействия,
																	"КарточкаМенеджера",
																	"Идентификатор");
																	
	МодульОбъектаКлиент().ПользовательскиеДействия_Выполнить(КарточкаМенеджера, ИнформацияОЗадолженности);
	
КонецПроцедуры

