
&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыОткрытия)
	
	ДеталиОграницения = МодульОбъектаКлиент().сбисПрочитатьJSON(ПараметрыОткрытия.ИсключениеСбис.details);
	
	ИнформацияОЗадолженности = МодульОбъектаКлиент().ИнформацияОЛицензиях(ДеталиОграницения);
	
	ЗаголовокСообщения	= ИнформацияОЗадолженности.Заголовок;
	Причина				= ИнформацияОЗадолженности.Причина;
	Сообщение			= ИнформацияОЗадолженности.Сообщение;
	ФИОМенеджера		= ИнформацияОЗадолженности.Контакт.ПолноеИмя;
	КонтактныйТелефон	= ИнформацияОЗадолженности.Контакт.Телефон;
	
	Кнопка = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ГруппаДействий.ГруппаКоманды.Действие");
	Кнопка.Заголовок = "Оплатить " + Формат(ИнформацияОЗадолженности.Сумма, "") + " ₽";
	
	ОписаниеИзмененияЛоготипа = Новый Структура("Форма, Реквизит", ЭтаФорма, "Логотип");
	ИзмененияЛоготипа = Новый Структура("Картинка", ИнформацияОЗадолженности.Логотип);
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеИзмененияЛоготипа, ИзмененияЛоготипа);
	
	ОписаниеИзмененияФото = Новый Структура("Форма, Реквизит", ЭтаФорма, "ФотоМенеджера");
	ИзмененияФото = Новый Структура("Картинка", ИнформацияОЗадолженности.Контакт.Фото);
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеИзмененияФото, ИзмененияФото);
	
	ИнформацияОЗадолженности.Вставить("ПользовательскиеДействия", ПараметрыОткрытия.ПользовательскиеДействия);
	
КонецПроцедуры

