
&НаКлиенте
Процедура WriteDocumentEx(АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт
	Перем ОшибкаРезультат, СертификатДляПодписания, Алгоритм;
	
    ОшибкаОтправки		= Ложь;
	Кэш					= ДопПараметры.Кэш;
	ПоддержкаОбменаЕИС	= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПоддержкаОбменаЕИС");
	DocumentOut			= АсинхроннаяСБИСКоманда.АргументВызова;
	НеЗапускатьВДО		= DocumentOut.Свойство("НеЗапускатьВДокументооборот")
		И	DocumentOut.НеЗапускатьВДокументооборот = "Да";
		
	ДопПоляЗаписатьДокумент		= Новый Массив;
	ДопПоляПодготовитьДействие	= Новый Массив;
	ДопПоляВыполнитьДействие	= Новый Массив;
	Если DocumentOut.Свойство("НаборДопПолей") Тогда
		Если DocumentOut.НаборДопПолей.Свойство("ЗаписатьДокумент") Тогда
			ДопПоляЗаписатьДокумент = DocumentOut.НаборДопПолей.ЗаписатьДокумент;
		КонецЕсли;
		Если DocumentOut.НаборДопПолей.Свойство("ПодготовитьДействие") Тогда
			ДопПоляПодготовитьДействие = DocumentOut.НаборДопПолей.ПодготовитьДействие;
		КонецЕсли;
		Если DocumentOut.НаборДопПолей.Свойство("ВыполнитьДействие") Тогда
			ДопПоляВыполнитьДействие = DocumentOut.НаборДопПолей.ВыполнитьДействие;
		КонецЕсли;
	КонецЕсли;
	
	ДопПоляЗаписатьДокумент.Добавить("ЭтапВернутьВсеСертификаты");
	Если НеЗапускатьВДО И ПоддержкаОбменаЕИС Тогда
		ДопПоляЗаписатьДокумент.Добавить("Расширение");
		ДопПоляЗаписатьДокумент.Добавить("ЕИС");
	КонецЕсли;
	ДопПоляЗаписатьДокумент = МодульОбъектаКлиент().СбисСтрСоединить(ДопПоляЗаписатьДокумент, ",");
	
	ДопПоляВыполнитьДействие = МодульОбъектаКлиент().СбисСтрСоединить(ДопПоляВыполнитьДействие, ",");
	
	ДопПоляПодготовитьДействие = МодульОбъектаКлиент().СбисСтрСоединить(ДопПоляПодготовитьДействие, ",");

	
	DocumentOut.Вставить("ДопПоля", ДопПоляЗаписатьДокумент);
	
	СтруктураРезультата = СБИС_ЗаписатьДокумент(Кэш, DocumentOut,,ОшибкаОтправки);
	АсинхроннаяСБИСКоманда.ВремяВызова = ТекущаяДата();
	
	Если ОшибкаОтправки Тогда
		
		//Ошибка отправки, роняем вызов
		МодульОбъектаКлиент().ВызватьСбисИсключение(СтруктураРезультата, "API.WriteDocumentEx");
		
	ИначеЕсли НеЗапускатьВДО Тогда
			
		//Это и есть ответ
		АсинхронноеСбисСобытие = МодульОбъектаКлиент().НовыйАсинхронноеСбисСобытие(АсинхроннаяСБИСКоманда, СтруктураРезультата, "Message");
		МодульОбъектаКлиент().АсинхроннаяСбисКоманда_ВызватьСобытие(АсинхроннаяСбисКоманда, АсинхронноеСбисСобытие);
		Возврат;
			
	КонецЕсли;
			
	// Назначение действия на этап
	action = Новый Структура("Название");
	Если		Не СтруктураРезультата.Свойство("Этап")
			Или	Не СтруктураРезультата.Этап.Количество() Тогда
		ОшибкаРезультат = МодульОбъектаКлиент().НовыйСбисИсключение(300, "API.WriteDocumentEx",,"Ошибка отправки документа: у документа отсутствуют активные этапы.");
	ИначеЕсли	Не СтруктураРезультата.Этап[0].Действие.Количество() Тогда
		ОшибкаРезультат = МодульОбъектаКлиент().НовыйСбисИсключение(300, "API.WriteDocumentEx",,"Ошибка отправки документа: у этапа документа отсутствуют активные действия.");
	ИначеЕсли	Не СтруктураРезультата.Этап[0].Действие[0].Свойство("Название", action.Название) Тогда
		ОшибкаРезультат = МодульОбъектаКлиент().НовыйСбисИсключение(300, "API.WriteDocumentEx",,"Ошибка отправки документа: у действия этапа отсутствует имя регламента.");
	КонецЕсли;
	
	Если Не ОшибкаРезультат = Неопределено Тогда
		
		МодульОбъектаКлиент().ВызватьСбисИсключение(ОшибкаРезультат, "API.WriteDocumentEx")
		
	КонецЕсли;
	
	Если	СтруктураРезультата.Этап[0].Действие[0].ТребуетПодписания = "Да" Тогда
		
		ПараметрыВыполнить = Новый Структура;
		ПараметрыВыполнить.Вставить("Этап",			СтруктураРезультата.Этап[0]);
		ПараметрыВыполнить.Вставить("Действие",		СтруктураРезультата.Этап[0].Действие[0]);
	 	ПараметрыВыполнить.Вставить("СоставПакета",	СтруктураРезультата);

		СведенияОСертификате = МодульОбъектаКлиент().СведенияСертификатаДляДействияСДокументомСБИС(ПараметрыВыполнить);
		СведенияОСертификате.Свойство("ДвоичныеДанные",	СертификатДляПодписания);
		СведенияОСертификате.Свойство("Алгоритм",		Алгоритм);

		Сертификат = СведенияОСертификате.Сертификат;
		action.Вставить("Сертификат", Сертификат);

	КонецЕсли;
		
	// Назначение этапа
	stage = Новый Структура;
	stage.Вставить("Название", СтруктураРезультата.Этап[0].Название);
	stage.Вставить("Действие", action);
	
	
	document_in = Новый Структура;
	document_in.Вставить("Идентификатор",	СтруктураРезультата.Идентификатор );	
	document_in.Вставить("Этап",			stage );
	document_in.Вставить("ДопПоля",			ДопПоляПодготовитьДействие);
	
	СтруктураРезультата = СБИС_ПодготовитьДействие(Кэш, document_in,, ОшибкаОтправки);

	Если ОшибкаОтправки Тогда
		
		МодульОбъектаКлиент().ВызватьСбисИсключение(СтруктураРезультата, "API.WriteDocumentEx")
		
	КонецЕсли;

	// выполняем действие
	
	prepared_document = СтруктураРезультата;
	
	// Назначение этапа
	stage = Новый Структура;
	stage.Вставить("Название", prepared_document.Этап[0].Название);
	
	// Назначение действия на этап
	action = Новый Структура;
	action.Вставить("Название", prepared_document.Этап[0].Действие[0].Название);
	Если СтруктураРезультата.Этап[0].Действие[0].свойство("Сертификат") Тогда 
		Если ЗначениеЗаполнено(СертификатДляПодписания) и СтруктураРезультата.Этап[0].Свойство("Вложение") Тогда
			stage.Вставить("Вложение", Новый Массив);
			ТекстОшибки = "";
			ПараметрыДействия = Новый Структура;
			ПараметрыДействия.Вставить("ПараметрыПодписанияВложения", Новый Структура("СертификатДляПодписания, Алгоритм, Сертификат", СертификатДляПодписания, Алгоритм));
			ПараметрыДействия.Вставить("Сертификат", Сертификат);   
			сбисПодписатьВложения(Кэш, prepared_document.Этап[0].Вложение,ПараметрыДействия);
			stage.Вложение = prepared_document.Этап[0].Вложение;
			Если ТекстОшибки<>"" Тогда
				
				МодульОбъектаКлиент().ВызватьСбисИсключение("Не удалось подписать вложение", "ФормаЭП.сбисВыбратьПодходящийСертификат",,,ТекстОшибки);
				
			КонецЕсли;
        КонецЕсли;
		action.Вставить("Сертификат", СтруктураРезультата.Этап[0].Действие[0].Сертификат[0]);
	КонецЕсли;
	
	stage.Вставить("Действие", action);
						
	document_in = Новый Структура;
	document_in.Вставить("Идентификатор",	prepared_document.Идентификатор);	
	document_in.Вставить("Этап",			stage);
	document_in.Вставить("ДопПоля",			ДопПоляВыполнитьДействие);

	СтруктураПараметровЗапроса = Новый Структура("Документ",document_in);
	
	// Выполнение этапа
	СтруктураРезультата = СБИС_ВыполнитьДействие(Кэш, document_in,,ОшибкаОтправки);

	Если ОшибкаОтправки Тогда
		
		МодульОбъектаКлиент().ВызватьСбисИсключение(СтруктураРезультата, "API.WriteDocumentEx")
		
	КонецЕсли;
	
	АсинхронноеСбисСобытие = МодульОбъектаКлиент().НовыйАсинхронноеСбисСобытие(АсинхроннаяСБИСКоманда, СтруктураРезультата, "Message");
	МодульОбъектаКлиент().АсинхроннаяСбисКоманда_ВызватьСобытие(АсинхроннаяСбисКоманда, АсинхронноеСбисСобытие);
	
КонецПроцедуры

&НаКлиенте
Процедура WriteDocumentEx_Message(АсинхронноеСбисСобытие, ПараметрыОбработки) Экспорт 
	
	МодульОбъектаКлиент().МассоваяОперация_Асинх_Ответ(АсинхронноеСбисСобытие, ПараметрыОбработки); 

КонецПроцедуры  

&НаКлиенте
Процедура WriteDocumentEx_Error(АсинхронноеСбисСобытие, ПараметрыОбработки) Экспорт
	Перем ТекстОшибки, УИДОшибки;

	Кэш				= ПараметрыОбработки.Кэш;
	РезультатВызова	= АсинхронноеСбисСобытие.Данные;
	
	Если Не РезультатВызова.Свойство("message", ТекстОшибки) Тогда
		РезультатВызова = МодульОбъектаКлиент().НовыйСбисИсключение(РезультатВызова, "API.WriteDocumentEx_Error",,"Не удалось отправить документ")
	КонецЕсли;
	
	Если		Лев(РезультатВызова.message, 14) = "Ошибка WinHTTP" Тогда
		
		ПараметрыОбработки.Вставить("Фатальная", Истина);
		
	ИначеЕсли	РезультатВызова.Свойство("data", УИДОшибки)
			И	ЗначениеЗаполнено(УИДОшибки)
			И	УИДОшибки.Свойство("classid", УИДОшибки)
			И	Лев(врег(УИДОшибки),28)="{00000000-0000-0000-0000-1AA" Тогда // нефатальная ошибка
		
		ПараметрыОбработки.Вставить("Фатальная", Ложь);	
	КонецЕсли;
	
	ПроверитьНаОшибкуФЛК(РезультатВызова);
	МодульОбъектаКлиент().МассоваяОперация_Асинх_Ошибка(АсинхронноеСбисСобытие, ПараметрыОбработки);
	
КонецПроцедуры 

&НаКлиенте
Процедура WriteDocumentEx_УстановитьПодпискиСобытий(АсинхроннаяСбис3Команда, ДопПараметры=Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("AfterCall",	Новый Структура("Функция",					"WriteDocumentEx_AfterCall"));
	Результат.Вставить("Error",		Новый Структура("Функция",					"WriteDocumentEx_Error"));
	Результат.Вставить("Message",	Новый Структура("Функция, ФункцияОшибки",	"WriteDocumentEx_Message", "WriteDocumentEx_Error"));
	
	МодульОбъектаКлиент().АсинхроннаяСбисКоманда_Установить(АсинхроннаяСбис3Команда, "События", Результат);
				
КонецПроцедуры

&НаКлиенте
Процедура WriteDocumentEx_AfterCall(АсинхронноеСбисСобытие, ПараметрыОбработки) Экспорт
	
	//Установим статус пакету, чтобы не занимался поток
	МодульОбъектаКлиент().ДействиеСДокументомСБИС_Установить(ПараметрыОбработки.Команда.АргументВызова, "СтатусПакета", "Обработан");
	МодульОбъектаКлиент().МассоваяОперация_Асинх_ПослеОтправки(АсинхронноеСбисСобытие, ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаОшибкуФЛК(РезультатВызова)
	
	Если НЕ РезультатВызова.Свойство("details") Тогда 
		Возврат;
	КонецЕсли;
	
	Если Найти(РезультатВызова.details, "В некоторых файлах обнаружены ошибки. Отправка с ошибками запрещена") 
		ИЛИ (Найти(РезультатВызова.details, "Документ") И Найти(РезультатВызова.details, "содержит ошибк")) Тогда
		РезультатВызова.code = 729;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - асинхронное Записать вложение
//
// Параметры:
//  АсинхроннаяСБИСКоманда	 - АсинхроннаяСбисКоманда	 - команда, которую надо выполнить
//  ДопПараметры			 - Структура				 - расширение
//
&НаКлиенте
Процедура WriteAttachment(АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт
	Перем ОшибкаРезультат;
	
    ОшибкаОтправки		= Ложь;
	Кэш					= ДопПараметры.Кэш;
	DocumentOut			= АсинхроннаяСБИСКоманда.АргументВызова.ДокументЗаписать;
	//Записать в СБИС
	
	СтруктураРезультата = СБИС_ЗаписатьВложение(Кэш, DocumentOut, Новый Структура, ОшибкаОтправки);
	АсинхроннаяСБИСКоманда.ВремяВызова = ТекущаяДата();
	
	Если ОшибкаОтправки Тогда
		
		//Ошибка отправки, роняем вызов
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(СтруктураРезультата);
			
	КонецЕсли;
	
	АсинхронноеСбисСобытие = МодульОбъектаКлиент().НовыйАсинхронноеСбисСобытие(АсинхроннаяСБИСКоманда, СтруктураРезультата, "Message");
	МодульОбъектаКлиент().АсинхроннаяСбисКоманда_ВызватьСобытие(АсинхроннаяСбисКоманда, АсинхронноеСбисСобытие);
	
КонецПроцедуры

// Процедура - асинхронный ответ на записать вложение
//
// Параметры:
//  РезультатВызова				 - АсинхронноеСбисСобытие	 - полученный ответ
//  ПараметрыОбработки			 - Структура				 - расширение
//
&НаКлиенте
Процедура WriteAttachment_Message(РезультатВызова, ПараметрыОбработки) Экспорт
	
	Если	МодульОбъектаКлиент().СоставПакета_Получить(ПараметрыОбработки.Команда.АргументВызова, "НеЗапускатьВДокументооборот") Тогда 
		
		МодульОбъектаКлиент().МассоваяОперация_Асинх_Ответ(РезультатВызова, ПараметрыОбработки);
		
	Иначе
		
		ПараметрыОтправки	= Новый Структура("Кэш, РезультатОтправки", ПараметрыОбработки.Кэш, ПараметрыОбработки.РезультатОтправки);
		ОбработчикОтправки	= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ExecuteActionEx", ПараметрыОбработки.Кэш.ТекущийСеанс.Модули.Интеграция, ПараметрыОтправки);
		Сбис3Команда		= МодульОбъектаКлиент().МассоваяОперация_НовыйАсинхроннаяСбисКоманда(ПараметрыОбработки.РезультатОтправки, ПараметрыОбработки.Команда.АргументВызова, ОбработчикОтправки);
	
		МодульОбъектаКлиент().АсинхроннаяСбисКоманда_Выполнить(Сбис3Команда);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - дефолтный асинхронный ответ об ошибке
//
// Параметры:
//  АсинхронноеСбисСобытие		 - АсинхронноеСбисСобытие	 - полученный ответ
//  ПараметрыОбработки			 - Структура				 - расширение
//
&НаКлиенте
Процедура AsyncCommand_Error(АсинхронноеСбисСобытие, ПараметрыОбработки) Экспорт
	Перем ТекстОшибки, УИДОшибки;

	Кэш				= ПараметрыОбработки.Кэш;
	РезультатВызова	= АсинхронноеСбисСобытие.Данные;
	
	Если Не РезультатВызова.Свойство("message", ТекстОшибки) Тогда
		РезультатВызова = МодульОбъектаКлиент().НовыйСбисИсключение(РезультатВызова, "SABYHttpClient.WriteDocumentEx_Error",,"Не удалось отправить документ")
	КонецЕсли;
	
	Если		Лев(РезультатВызова.message, 14) = "Ошибка WinHTTP" Тогда
		
		ПараметрыОбработки.Вставить("Фатальная", Истина);
		
	Иначе
		
		ЭтоНеФатальнаяОшибка	=	РезультатВызова.Свойство("data", УИДОшибки)
								И	ЗначениеЗаполнено(УИДОшибки)
								И	УИДОшибки.Свойство("classid", УИДОшибки)
								И	Лев(ВРег(УИДОшибки),28)="{00000000-0000-0000-0000-1AA";
								
		Если ЭтоНеФатальнаяОшибка Тогда // нефатальная ошибка
		
			ПараметрыОбработки.Вставить("Фатальная", Ложь);
			
		КонецЕсли;
		
	КонецЕсли;
	
	МодульОбъектаКлиент().МассоваяОперация_УдалитьПоток(ПараметрыОбработки.РезультатОтправки, АсинхронноеСбисСобытие);	
	МодульОбъектаКлиент().МассоваяОперация_Асинх_Ошибка(АсинхронноеСбисСобытие, ПараметрыОбработки);
	
КонецПроцедуры

// Процедура - дефолтный событие, вызываемое автоматически после запуска выполнения асинхронной команды
//
// Параметры:
//  АсинхронноеСбисСобытие		 - АсинхронноеСбисСобытие	 - Неопределено
//  ПараметрыОбработки			 - Структура				 - расширение
//
&НаКлиенте
Процедура AsyncCommand_AfterCall(АсинхронноеСбисСобытие, ПараметрыОбработки) Экспорт
	
	Если ПараметрыОбработки.Свойство("НеЗаниматьПоток") И ПараметрыОбработки.НеЗаниматьПоток Тогда
	Иначе
		МодульОбъектаКлиент().МассоваяОперация_ДобавитьПоток(ПараметрыОбработки.РезультатОтправки, ПараметрыОбработки.Команда);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - асинхронное ПодготовитьДействие
//
// Параметры:
//  АсинхроннаяСБИСКоманда	 - АсинхроннаяСбисКоманда	 - команда, которую надо выполнить
//  ДопПараметры			 - Структура				 - расширение
//
&НаКлиенте
Процедура PrepareAction(АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт
	
	АсинхроннаяСБИСКоманда.ВремяВызова	= ТекущаяДата();	
	СтруктураРезультата					= ДопПараметры.РезультатОтправки;
	document_in							= ДопПараметры.document_in;
	
	ОшибкаПодготовки = Ложь;
	СтруктураРезультата = СБИС_ПодготовитьДействие(ДопПараметры.Кэш, document_in,Новый Структура("Асинх, Идентификатор",Истина, АсинхроннаяСБИСКоманда.Идентификатор),ОшибкаПодготовки);
	
	Если ОшибкаПодготовки Тогда
		МодульОбъектаКлиент().ВызватьСбисИсключение(СтруктураРезультата, "SabyHttpClient.PrepareAction");	
	КонецЕсли;
	
КонецПроцедуры

// Процедура - асинхронный ответ на ПодготовитьДействие
//
// Параметры:
//  РезультатВызова				 - АсинхронноеСбисСобытие	 - полученный ответ
//  ПараметрыОбработки			 - Структура				 - расширение
//
&НаКлиенте
Процедура PrepareAction_Message(АсинхронноеСбисСобытие, ПараметрыОбработки) Экспорт
		
	СтруктураРезультата = АсинхронноеСбисСобытие.Данные;
	ПараметрыОтправки	= Новый Структура("Кэш, РезультатОтправки, Сертификат", ПараметрыОбработки.Кэш, СтруктураРезультата, ПараметрыОбработки.Сертификат);
	ОбработчикОтправки	= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ExecuteAction", ПараметрыОбработки.Кэш.ТекущийСеанс.Модули.Интеграция, ПараметрыОтправки);
	Сбис3Команда		= МодульОбъектаКлиент().МассоваяОперация_НовыйАсинхроннаяСбисКоманда(ПараметрыОбработки.РезультатОтправки,  ПараметрыОбработки.Команда.АргументВызова, ОбработчикОтправки);

	ПараметрыСобытий	= Новый Структура("Кэш, РезультатОтправки, Команда", ПараметрыОбработки.Кэш, ПараметрыОбработки.РезультатОтправки, Сбис3Команда);
	События				= ВыполнитьДействие_ПодпискиСобытия(ПараметрыСобытий);
	МодульОбъектаКлиент().АсинхроннаяСбисКоманда_Установить(Сбис3Команда, "События", События);
	МодульОбъектаКлиент().АсинхроннаяСбисКоманда_Установить(Сбис3Команда, "ПараметрыСобытий", ПараметрыСобытий);
    МодульОбъектаКлиент().МассоваяОперация_УдалитьПоток(ПараметрыОбработки.РезультатОтправки, АсинхронноеСбисСобытие);

	
	Попытка
		МодульОбъектаКлиент().АсинхроннаяСбисКоманда_Выполнить(Сбис3Команда);	
	Исключение
		
		//Упала отправка в поток, сами пропишем ошибку
		АсинхронноеСбисСобытие = МодульОбъектаКлиент().НовыйАсинхронноеСбисСобытие(Сбис3Команда.Идентификатор,
								МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.МассоваяОперация_Асинх_Отправка"), "Error");
		МодульОбъектаКлиент().АсинхроннаяСбисКоманда_ВызватьСобытие(Сбис3Команда, АсинхронноеСбисСобытие);
		
	КонецПопытки;

КонецПроцедуры

// Процедура - асинхронное ВыполнитьДействие
//
// Параметры:
//  АсинхроннаяСБИСКоманда	 - АсинхроннаяСбисКоманда	 - команда, которую надо выполнить
//  ДопПараметры			 - Структура				 - расширение
//
&НаКлиенте
Процедура ExecuteAction(АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт
 	//	 выполняем действие
	АсинхроннаяСБИСКоманда.ВремяВызова = ТекущаяДата();
	prepared_document	= ДопПараметры.РезультатОтправки;
	Сертификат			= ДопПараметры.Сертификат; 
	Кэш					= ДопПараметры.Кэш;
			
	// Назначение этапа
	stage = Новый Структура;
	stage.Вставить("Название", prepared_document.Этап[0].Название);
	
	// Назначение действия на этап
	action = Новый Структура;
	action.Вставить("Название", prepared_document.Этап[0].Действие[0].Название);
	
	Если		prepared_document.Этап[0].Действие[0].свойство("Сертификат")
		И НЕ	Сертификат = Ложь Тогда 
		
		Если	ЗначениеЗаполнено(Сертификат.СертификатДляПодписания)
			И	prepared_document.Этап[0].Свойство("Вложение") Тогда
			
			stage.Вставить("Вложение", Новый Массив);
			
			Для Каждого Вложение Из prepared_document.Этап[0].Вложение Цикл
				
				stage.Вложение.Добавить(ExecuteAction_ПодписатьВложение(Кэш, Вложение, Сертификат));
				
			КонецЦикла;
			
		КонецЕсли;
		
		action.Вставить("Сертификат", prepared_document.Этап[0].Действие[0].Сертификат[0]);
		
	КонецЕсли;
	
	stage.Вставить("Действие", action);
						
	document_in = Новый Структура;
	document_in.Вставить("Идентификатор",	prepared_document.Идентификатор );	
	document_in.Вставить("Этап",			stage );
	
	
	СтруктураПараметровЗапроса = Новый Структура("Документ",document_in);
	ОшибкаВыполнения = Ложь;	
	// Выполнение этапа
	СтруктураРезультата = СБИС_ВыполнитьДействие(Кэш, document_in,Новый Структура("Асинх, Идентификатор",Истина, АсинхроннаяСБИСКоманда.Идентификатор),ОшибкаВыполнения);
	
	Если ОшибкаВыполнения Тогда		
		МодульОбъектаКлиент().ВызватьСбисИсключение(СтруктураРезультата, "SABYHttpClient.ExecuteAction");		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ExecuteAction_ПодписатьВложение(Кэш, Вложение, Сертификат)
	
	ТекстОшибки = "";
	ВложениеВыполнить = Новый Структура("Идентификатор, Файл", Вложение.Идентификатор, Вложение.Файл);
	ПолноеИмяФайла = КаталогВременныхФайлов() + Вложение.Файл.Имя;   // файл с онлайна
	СохранитьВложениеПоСсылкеВФайл(Кэш,Вложение.Файл.Ссылка,ПолноеИмяФайла);
	Подпись = Кэш.ФормаЭП.сбисПодписатьФайл(Кэш, ПолноеИмяФайла, Сертификат.СертификатДляПодписания, Сертификат.Алгоритм, ТекстОшибки); 
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		МодульОбъектаКлиент().ВызватьСбисИсключение("Не удалось подписать вложение", "ФормаЭП.сбисВыбратьПодходящийСертификат",,,ТекстОшибки);
		
	КонецЕсли;
	ЭЦП			= Новый Массив;	
	ЗаписьЭЦП	= Новый Структура;
	ФайлЭЦП		= Новый Структура;
	ИмяФайлаПодписи = Лев(Вложение.Файл.Имя, Найти(Вложение.Файл.Имя,"."))+"sgn";
	ФайлЭЦП.Вставить( "Имя", ИмяФайлаПодписи ); 
	ФайлЭЦП.Вставить( "ДвоичныеДанные", Подпись); 
	ЗаписьЭЦП.Вставить("Файл",ФайлЭЦП);
	ЭЦП.Добавить(ЗаписьЭЦП);
	ВложениеВыполнить.Вставить( "Подпись", ЭЦП );

	Возврат ВложениеВыполнить;
			
КонецФункции

&НаКлиенте                                                                                        
Функция СБИС_ПрочитатьПулОтветов(КэшСБИС) Экспорт
	
	Попытка
		СтрокаXML	= КэшСБИС.ДанныеИнтеграции.Объекты.Компонента.ReadAllResponse();
		СбисСобытияСоответствие = DecodeXmlXdto(СтрокаXML);
		СбисСобытия = ПолучитьСтруктуруИзСоответствия(СбисСобытияСоответствие);
	Исключение
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнформацияОбОшибке(),
													МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".СБИС_ПрочитатьПулОтветов",
													773);
	КонецПопытки;
	
	Возврат СбисСобытия.Response;

КонецФункции

//Разбираем асинх ответы, возвращаем асинхсобытие
&НаКлиенте
Функция СБИС_ОбработатьОтвет(Сбис3СобытиеОтвет, ДопПараметры=Неопределено) Экспорт
		
	Если Сбис3СобытиеОтвет.Result.Data.Свойство("Error") Тогда 
		Возврат МодульОбъектаКлиент().НовыйАсинхронноеСбисСобытие(Сбис3СобытиеОтвет.queryID, Сбис3СобытиеОтвет.Result.Data.error, "Error");
	Иначе		
		Возврат МодульОбъектаКлиент().НовыйАсинхронноеСбисСобытие(Сбис3СобытиеОтвет.queryID, Сбис3СобытиеОтвет.Result.Data.result, "Message");
	КонецЕсли;
	
КонецФункции

//Обработка внешнего файла
&НаКлиенте
Процедура Отправка_ОбработатьВнешнийФайл(Кэш, ДанныеФайла, ПараметрыПодготовки) Экспорт
	ДанныеФайла.Файл.Вставить("ДвоичныеДанные",  МодульОбъектаКлиент().ПолучитьBASE64ПоИмениФайлаКлиент(ДанныеФайла.Вложение.ПолноеИмяФайла));
КонецПроцедуры

//Обработка XML файла при отправке. 
//ДанныеФайла - параметры обрабатываемого файла. Файл - структура в списке вложений. Вложение - обрабатываемое вложение состава пакета
//ПараметрыПодготовки - параметры обрабатываемого пакета документов.
&НаКлиенте
Процедура Отправка_ОбработатьXMLФайл(Кэш, ДанныеФайла, ПараметрыПодготовки) Экспорт

	ДвоичныеДанныеXML = СбисСтрокаВДвоичныеДанныеКлиент(Кэш, ДанныеФайла.Вложение.XMLДокумента, , Ложь);
	ДанныеФайла.Файл.Вставить("ДвоичныеДанные", СтрЗаменить(СтрЗаменить(Base64Строка(ДвоичныеДанныеXML),Символы.ПС,""),Символы.ВК,"") ); 
	
КонецПроцедуры

&НаКлиенте
Функция Отправка_ПодпискиСобытия(ПараметрыСобытий) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Error",			Новый Структура("Функция",					"AsyncCommand_Error"));
	Результат.Вставить("Message",		Новый Структура("Функция, ФункцияОшибки",	"WriteDocument_Message", "AsyncCommand_Error"));
	Результат.Вставить("AfterCall",		Новый Структура("Функция",					"AsyncCommand_AfterCall"));	
	Возврат Результат;
				
КонецФункции

&НаКлиенте
Функция ПодготовкаДействия_ПодпискиСобытия(ПараметрыСобытий) Экспорт	

	Результат = Новый Структура;
	Результат.Вставить("Error",			Новый Структура("Функция",	"AsyncCommand_Error"));
	Результат.Вставить("Message",		Новый Структура("Функция",	"PrepareAction_Message"));
	Результат.Вставить("AfterCall",		Новый Структура("Функция",	"AsyncCommand_AfterCall"));		
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВыполнитьДействие_ПодпискиСобытия(ПараметрыСобытий) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Error",			Новый Структура("Функция",	"AsyncCommand_Error"));
	Результат.Вставить("Message",		ПараметрыСобытий.РезультатОтправки.ПодпискиДляКоманд.Message);
	Результат.Вставить("AfterCall",		Новый Структура("Функция",	"AsyncCommand_AfterCall"));		
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СБИС_ИдЗапросаВызова(Кэш) Экспорт
	
	Возврат Строка(Новый УникальныйИдентификатор);
	
КонецФункции

//Разбор асинхронных сообщений
&НаКлиенте
Функция СБИС_РазобратьОтвет(ДанныеИзПулаОтвета) Экспорт
	
	Возврат Новый Структура;
	
КонецФункции
	
