
&НаКлиенте
Процедура Асинх_СБИС_СписокСертификатов(АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт
	
	Результат = Новый Структура("Сертификат", Новый СписокЗначений);
	АсинхронноеСбисСобытие = МодульОбъектаКлиент().НовыйАсинхронноеСбисСобытие(АсинхроннаяСБИСКоманда.Идентификатор, Результат, "Message");
	МодульОбъектаКлиент().АсинхроннаяСбисКоманда_ВызватьСобытие(АсинхроннаяСбисКоманда, АсинхронноеСбисСобытие);

КонецПроцедуры

&НаКлиенте
Процедура Асинх_СБИС_ПрочитатьДокумент(АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт

	Кэш				= МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш(); 
    ОшибкаОтправки	= Ложь;
	
	СтруктураРезультата = СБИС_ПрочитатьДокумент(Кэш, АсинхроннаяСБИСКоманда.АргументВызова, Новый Структура, ОшибкаОтправки);

	Если ОшибкаОтправки Тогда
		
		МодульОбъектаКлиент().ВызватьСбисИсключение(СтруктураРезультата, "API.СБИС_ПрочитатьДокумент")
		
	КонецЕсли;

	АсинхронноеСбисСобытие = МодульОбъектаКлиент().НовыйАсинхронноеСбисСобытие(АсинхроннаяСБИСКоманда.Идентификатор, СтруктураРезультата, "Message");
	МодульОбъектаКлиент().АсинхроннаяСбисКоманда_ВызватьСобытие(АсинхроннаяСбисКоманда, АсинхронноеСбисСобытие);
	
КонецПроцедуры

