
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОбработчикЗавершения = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПослеЗакрытия", ЭтаФорма);
	НовыйОтложенноеДействие = МодульОбъектаКлиент().НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения", ОбработчикЗавершения));
	МодульОбъектаКлиент().ПодключитьОтложенноеДействие(НовыйОтложенноеДействие);
	
КонецПроцедуры

// Процедура - после закрытия почистить форму
//
// Параметры:
//  Аргумент	 - 	 - 
//  ДопПараметры - 	 - 
//
&НаКлиенте
Процедура ПослеЗакрытия(Аргумент=Неопределено, ДопПараметры=Неопределено) Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		//Вызвать описание оповещения о закрытии вручную.
		Если Не ОписаниеОповещенияОЗакрытии = Неопределено Тогда
			МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(ПараметрыФормы.Результат, ОписаниеОповещенияОЗакрытии);
		КонецЕсли;
	#КонецЕсли
	
	ПараметрыФормы									= Неопределено;
	ОписаниеОповещенияОЗакрытии						= Неопределено;
	ДокументДанные									= Неопределено;
	Контрагент										= Неопределено;
	ОбогащенныеДанныеНоменклатурыДляСопоставления	= Неопределено;
	ХарактеристикиИспользуютсяВДокументе			= Ложь;
	КнопкаЗаписатьНажата							= Ложь;
	ИдентификаторДокумента							= Неопределено;
	ПараметрыРасхождения							= Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСопоставленияИПоложитьВДокументДанные() 
	
	ДанныеНоменклатурДляЗаписиСопоставлений = Новый Массив;
	
	ИндексСтроки = 0;
	
	Если Вложение.Свойство("СтруктураДокумента") 
		И Вложение.СтруктураДокумента.Файл.Документ.Свойство("СписокСтрТабл") Тогда
		ПутьТаблДок = "Файл.Документ.СписокСтрТабл.СтрТабл";
	ИначеЕсли Вложение.Свойство("СтруктураФайла") 
		И Вложение.СтруктураФайла.Файл.Документ.Свойство("СписокСтрТабл") Тогда
		ПутьТаблДок = "Файл.Документ.СписокСтрТабл.СтрТабл";
	Иначе
		ПутьТаблДок = "Файл.Документ.ТаблДок.СтрТабл";
	КонецЕсли;	
	
	СбисОбщиеФункции = МодульОбъектаКлиент().ПолучитьФормуОбработки("РаботаСДокументами1С");
	Если Вложение.Свойство("ТаблДок") Тогда
		ТабличнаяЧастьИзФайла = Вложение.ТаблДок; // Рассчитывался при подготовке к загрузке
	ИначеЕсли Вложение.Свойство("СтруктураФайла") Тогда
		ТабличнаяЧастьИзФайла = СбисОбщиеФункции.РассчитатьЗначениеИзСтруктуры(ПутьТаблДок, Вложение.СтруктураФайла);
	Иначе 
		ТабличнаяЧастьИзФайла = СбисОбщиеФункции.РассчитатьЗначениеИзСтруктуры(ПутьТаблДок, Вложение.СтруктураДокумента);
	КонецЕсли;
	
	Для Каждого СтрСопоставления Из ОбогащенныеДанныеНоменклатурыДляСопоставления Цикл
		
		СтрокаВТаблице = ТаблицаСопоставлений[ИндексСтроки];
		
		Если Не ЗначениеЗаполнено(СтрокаВТаблице.НоменклатураСБИС) Тогда
			// Если не заполнено основное поле - выгружаем, как есть
			Продолжить;
		КонецЕсли;
		
		Если СтрокаВТаблице.СтрокаИзменена Тогда
			// Если строка изменена, добавляем строку сопоставления для записи, дополняя ее измененными данными
			ОбновитьСтрокуСопоставленияПоСтрокеТаблицы(СтрСопоставления, СтрокаВТаблице);
			СтрСопоставления.Вставить("НеобходимоСопоставление", Истина);
			ДанныеНоменклатурДляЗаписиСопоставлений.Добавить(СтрСопоставления);
		КонецЕсли;
		
		// Обновим данные по строке в ДокументДанные
		СтрокаДокумента1С = ТабличнаяЧастьИзФайла[ИндексСтроки];
		
		СтрокаДокумента1С.Название	= СтрокаВТаблице.НоменклатураСБИС;
		СтрокаДокумента1С.Кол_во	= Формат(СтрокаВТаблице.КоличествоПересчитанное, "ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.000");
		СтрокаДокумента1С.Цена		= СтрокаВТаблице.ЦенаПересчитанная;
		
		Если СтрокаДокумента1С.Свойство("ТаблДок_GTIN")
				И ЗначениеЗаполнено(СтрокаВТаблице.GTIN_СБИС) Тогда
			СтрокаДокумента1С.GTIN = СтрокаВТаблице.GTIN_СБИС;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаВТаблице.НаименованиеЕдиницыСБИС) Тогда
			СтрокаДокумента1С.ЕдИзм		= СтрокаВТаблице.НаименованиеЕдиницыСБИС;
			Если ЗначениеЗаполнено(СтрокаВТаблице.ОКЕИ_ЕдиницыСБИС) Тогда
				СтрокаДокумента1С.ОКЕИ	= СтрокаВТаблице.ОКЕИ_ЕдиницыСБИС;
			Иначе
				// Неформализированная упаковка
				СтрокаДокумента1С. ОКЕИ	= "0000";
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаВТаблице.КодСБИС) Тогда
			СтрокаДокумента1С.Вставить(СтрокаВТаблице.ТипКодаСБИС, СтрокаВТаблице.КодСБИС);
			//Заполним Идентификатор, что бы потом не было расхождений с чем сравниваем                  
			СтрокаДокумента1С.Вставить("Идентификатор", СтрокаВТаблице.КодСБИС);
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаВТаблице.GTIN_СБИС) Тогда
			СтрокаДокумента1С.Вставить("GTIN", СтрокаВТаблице.GTIN_СБИС);
		КонецЕсли;
		
		Если СтрокаДокумента1С.Свойство(СтрокаВТаблице.ТипКодаСБИС) Тогда
			Если ЗначениеЗаполнено(СтрокаВТаблице.КодСБИС)
					И СтрокаДокумента1С.Свойство(СтрокаВТаблице.ТипКодаСБИС) Тогда
				СтрокаДокумента1С[СтрокаВТаблице.ТипКодаСБИС] = СтрокаВТаблице.КодСБИС;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаВТаблице.GTIN_СБИС)
					И СтрокаДокумента1С.Свойство("GTIN") Тогда
				СтрокаДокумента1С.GTIN = СтрокаВТаблице.GTIN_СБИС;
			КонецЕсли;
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	ТаблДокНаОсновеКлассов = МодульОбъектаКлиент().ВложениеСБИС_Выгрузить(Вложение); 
	
	Если Вложение.Свойство("СтруктураФайла") Тогда
		Вложение.СтруктураФайла.Файл.Документ.ТаблДок.Вставить("СтрТабл", ТаблДокНаОсновеКлассов);
	ИначеЕсли Вложение.СтруктураДокумента.Файл.Документ.Свойство("ТаблДок") Тогда
		Вложение.СтруктураДокумента.Файл.Документ.ТаблДок.Вставить("СтрТабл", ТаблДокНаОсновеКлассов);
	Иначе
		Вложение.СтруктураДокумента.Файл.Документ.СписокСтрТабл.Вставить("СтрТабл", ТаблДокНаОсновеКлассов);
	КонецЕсли;
	
	ФормыПоиска = Новый Массив;
	ФормыПоиска.Добавить("Файл_Шаблон");
	фрм = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("СформироватьНаборСопоставленийНоменклатурыПоТабличнойЧасти", ФормыПоиска);
	
	Если НЕ фрм = Ложь Тогда  
		НаборСопоставлений = фрм.СформироватьНаборСопоставленийНоменклатурыПоТабличнойЧасти(Вложение, Кэш);
	КонецЕсли;
	
	Вложение.Вставить("КлассыСопоставленияНоменклатур", НаборСопоставлений);
	Если ДанныеНоменклатурДляЗаписиСопоставлений.Количество() Тогда

		ФормаРаботыСНоменклатурой = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("МодульСопоставлениеНоменклатуры");
		
		ПараметрыДляЗаписиСопоставений = Новый Структура("Контрагент, Номенклатура", Контрагент, ДанныеНоменклатурДляЗаписиСопоставлений, Истина);
		ФормаРаботыСНоменклатурой.НоменклатураПоставщика_МассовоеОбновление(ПараметрыДляЗаписиСопоставений, Новый Структура("Кэш", Кэш));

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтрокуСопоставленияПоСтрокеТаблицы(СтрокаСопоставления, СтрокаВТаблице)
	
	НоменклатураСБИС = СтрокаСопоставления.НоменклатураСБИС;
	
	НоменклатураСБИС.Наименование	= СтрокаВТаблице.НоменклатураСБИС;
	НоменклатураСБИС.Код			= СтрокаВТаблице.КодСБИС;
	НоменклатураСБИС.ТипКода		= СтрокаВТаблице.ТипКодаСБИС;
	НоменклатураСБИС.GTIN			= СтрокаВТаблице.GTIN_СБИС;
	
	Если НоменклатураСБИС.Единицы.Количество() Тогда
		Для Каждого ЕдиницаСБИС Из НоменклатураСБИС.Единицы Цикл
			ЕдиницаСБИС = ЕдиницаСБИС.Значение;
			Прервать;
		КонецЦикла;
	Иначе
		ЕдиницаСБИС = МодульОбъектаКлиент().НовыйСопоставлениеДляЕдиницыКлиент();
	КонецЕсли;
	
	ЕдиницаСБИС.Название	= СтрокаВТаблице.НаименованиеЕдиницыСБИС;
	ЕдиницаСБИС.ОКЕИ		= СтрокаВТаблице.ОКЕИ_ЕдиницыСБИС;
	ЕдиницаСБИС.Коэффициент	= СтрокаВТаблице.КоэффициентСБИС;
	
	МодульОбъектаКлиент().СтрокаСопоставленияСБИСКлиент_Вставить(СтрокаСопоставления, "Единица", ЕдиницаСБИС);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаТЧПриИзменении(Элемент)
	
	ТекущиеДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставлений").ТекущиеДанные;
	ТекущиеДанные.СтрокаИзменена = Истина;
	
	Если Элемент.Имя = "ТаблицаСопоставленийКоличествоПересчитанное" Тогда
		ПересчитатьСтрокуПоКоличеству(ТекущиеДанные);
	ИначеЕсли Элемент.Имя = "ТаблицаСопоставленийКоэффициент1СкСБИС" Тогда
		ПересчитатьСтрокуПоКоэффициентуСБИСк1С(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСопоставленийТипКодаСБИСПриИзменении(Элемент)
	
	ТекущиеДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставлений").ТекущиеДанные;
	ТекущиеДанные.СтрокаИзменена = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСопоставленийКоэффициент1СкСБИСПриИзменении(Элемент)
	
	ТекущиеДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставлений").ТекущиеДанные;
	ТекущиеДанные.СтрокаИзменена = Истина;
	
	ПересчитатьСтрокуПоКоэффициентуСБИСк1С(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуПоКоличеству(ТекущиеДанные, ПересчетНеобходим = Истина)
	
	Если НЕ ПересчетНеобходим Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Коэффициент1СкСБИС	= ТекущиеДанные.КоличествоПересчитанное / ТекущиеДанные.КоличествоВДокументе1С;
	ТекущиеДанные.ЦенаПересчитанная 	= ТекущиеДанные.ЦенаВДокументе1С * ТекущиеДанные.Коэффициент1СкСБИС;
	ТекущиеДанные.Коэффициент1С			= ТекущиеДанные.Коэффициент1СкСБИС;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуПоКоэффициентуСБИСк1С(ТекущиеДанные, ПересчетНеобходим = Истина)
	
	Если НЕ ПересчетНеобходим Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.КоличествоПересчитанное	= ТекущиеДанные.КоличествоВДокументе1С / ТекущиеДанные.Коэффициент1СкСБИС;
	ТекущиеДанные.ЦенаПересчитанная 		= ТекущиеДанные.ЦенаВДокументе1С * ТекущиеДанные.Коэффициент1СкСБИС;
	ТекущиеДанные.Коэффициент1С				= ТекущиеДанные.Коэффициент1СкСБИС;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСопоставленийНоменклатураКонтрагентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставлений").ТекущиеДанные;
	ТекущиеДанные.НоменклатураСБИСЗначение = ВыбранноеЗначение; 
	ТекущиеДанные.НоменклатураСБИС = ВыбранноеЗначение.Название;
	ТекущиеДанные.НаименованиеЕдиницыСБИС = ВыбранноеЗначение.ЕдИзм;
	ТекущиеДанные.ОКЕИ_ЕдиницыСБИС = ВыбранноеЗначение.ОКЕИ;
	ТекущиеДанные.ТипКодаСБИС = "КодПокупателя";
	ТекущиеДанные.КодСБИС = ВыбранноеЗначение.КодПокупателя;   
	
	Если ВыбранноеЗначение.Свойство("GTIN") Тогда
		ТекущиеДанные.GTIN_СБИС = ВыбранноеЗначение.GTIN;    
	КонецЕсли;
	
	// 30.10.24 Не понятно, для чего эта строка. Удалить?
	//МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставлений").ТекущийЭлемент = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставленийТипКодаСБИС");
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСопоставленийТипКодаСБИСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекущиеДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставлений").ТекущиеДанные;
	Значение = ТекущиеДанные.НоменклатураСБИСЗначение;
	
	Если Значение.Свойство(ВыбранноеЗначение) Тогда
		Значение.Свойство(ВыбранноеЗначение, ТекущиеДанные.КодСБИС)
	Иначе
		ТекущиеДанные.КодСБИС = "";
	КонецЕсли;  
	
КонецПроцедуры


