
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОбработчикЗавершения = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПослеЗакрытия", ЭтаФорма);
	НовыйОтложенноеДействие = МодульОбъектаКлиент().НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения", ОбработчикЗавершения));
	МодульОбъектаКлиент().ПодключитьОтложенноеДействие(НовыйОтложенноеДействие);
	
КонецПроцедуры

// Процедура - после закрытия почистить форму
//
// Параметры:
//  Аргумент	 - 	 - 
//  ДопПараметры - 	 - 
//
&НаКлиенте
Процедура ПослеЗакрытия(Аргумент=Неопределено, ДопПараметры=Неопределено) Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		//Вызвать описание оповещения о закрытии вручную.
		Если Не ОписаниеОповещенияОЗакрытии = Неопределено Тогда
			МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(ПараметрыФормы.Результат, ОписаниеОповещенияОЗакрытии);
		КонецЕсли;
	#КонецЕсли
	
	ПараметрыФормы									= Неопределено;
	ОписаниеОповещенияОЗакрытии						= Неопределено;
	Контрагент										= Неопределено;
	ОбогащенныеДанныеНоменклатурыДляСопоставления	= Неопределено;
	ХарактеристикиИспользуютсяВДокументе			= Ложь;
	КнопкаЗаписатьНажата							= Ложь;
	ИдентификаторДокумента							= Неопределено;
	ПараметрыРасхождения							= Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

    // Закрытие формы при закрытии обработки    
    Если ИмяСобытия = "ЗакрытьСБИС" Тогда
        
        Если ЭтаФорма.Открыта() Тогда
            
            ЭтаФорма.Закрыть();
            
        КонецЕсли;
        
    КонецЕсли;
    
    
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСопоставленияИПоложитьВоВложение1С() 
	
	ДанныеНоменклатурДляЗаписиСопоставлений = Новый Массив;
	
	ИндексСтроки = 0;
	
	
	Для Каждого СтрСопоставления Из ОбогащенныеДанныеНоменклатурыДляСопоставления Цикл
		
		СтрокаВТаблице = ТаблицаСопоставлений[ИндексСтроки];
		
		Если Не ЗначениеЗаполнено(СтрокаВТаблице.НоменклатураСБИС) Тогда
			// Если не заполнено основное поле - выгружаем, как есть
			Продолжить;
		КонецЕсли;
		
		Если СтрокаВТаблице.СтрокаИзменена Тогда
			// Если строка изменена, добавляем строку сопоставления для записи, дополняя ее измененными данными
			ОбновитьСтрокуСопоставленияПоСтрокеТаблицы(СтрСопоставления, СтрокаВТаблице);
			СтрСопоставления.Вставить("НеобходимоСопоставление",	Истина);
			ДанныеНоменклатурДляЗаписиСопоставлений.Добавить(СтрСопоставления);
		КонецЕсли;
		
		// Обновим данные по строке в нашем вложении
		СтрокаДокумента1С = ТаблДок1С[ИндексСтроки];
		
		СтрокаДокумента1С.Название	= СтрокаВТаблице.НоменклатураСБИС;
		СтрокаДокумента1С.Кол_во	= Формат(СтрокаВТаблице.КоличествоПересчитанное, "ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.000");
		СтрокаДокумента1С.Цена		= Формат(СтрокаВТаблице.ЦенаПересчитанная, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00");
		
		Если СтрокаДокумента1С.Свойство("ТаблДок_GTIN")
				И ЗначениеЗаполнено(СтрокаВТаблице.GTIN_СБИС) Тогда
			СтрокаДокумента1С.ТаблДок_GTIN = СтрокаВТаблице.GTIN_СБИС;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаВТаблице.НаименованиеЕдиницыСБИС) Тогда
			СтрокаДокумента1С.ЕдИзм		= СтрокаВТаблице.НаименованиеЕдиницыСБИС;
			Если ЗначениеЗаполнено(СтрокаВТаблице.ОКЕИ_ЕдиницыСБИС) Тогда
				СтрокаДокумента1С.ОКЕИ	= СтрокаВТаблице.ОКЕИ_ЕдиницыСБИС;
			Иначе
				// Неформализированная упаковка
				СтрокаДокумента1С.ОКЕИ	= "0000";
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаВТаблице.КодСБИС) Тогда
			СтрокаДокумента1С.Вставить(СтрокаВТаблице.ТипКодаСБИС, СтрокаВТаблице.КодСБИС);
			// Заполним Идентификатор, что бы потом не было расхождений с чем сравниваем                  
			СтрокаДокумента1С.Вставить("Идентификатор", СтрокаВТаблице.КодСБИС);
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаВТаблице.GTIN_СБИС) Тогда
			СтрокаДокумента1С.Вставить("GTIN", СтрокаВТаблице.GTIN_СБИС);
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Если ДанныеНоменклатурДляЗаписиСопоставлений.Количество() Тогда

		ФормаРаботыСНоменклатурой = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ИмяМодуляСопоставленияНоменклатуры");
		
		ПараметрыДляЗаписиСопоставений = Новый Структура("Контрагент, Номенклатура", Контрагент, ДанныеНоменклатурДляЗаписиСопоставлений, Истина);
		ФормаРаботыСНоменклатурой.НоменклатураПоставщика_МассовоеОбновление(ПараметрыДляЗаписиСопоставений, Новый Структура("Кэш", Кэш));

	КонецЕсли;
	
	//TODO Не понятно, почему заменяем ТаблДок на основе классов, ведь только что вручную его правили, а не классы
	//+++ КУСОК КОДА, КОТОРЫЙ Я НЕ ПОНЯЛ, УЗНАТЬ У КОСТИ
	//ТаблДокНаОсновеКлассов = МодульОбъектаКлиент().ВложениеСБИС_Выгрузить(Вложение1С); 
	//
	//Если Вложение1С.Свойство("СтруктураФайла") Тогда
	//	Вложение1С.СтруктураФайла.Файл.Документ.ТаблДок.Вставить("СтрТабл", ТаблДокНаОсновеКлассов);
	//ИначеЕсли Вложение1С.СтруктураДокумента.Файл.Документ.Свойство("ТаблДок") Тогда
	//	Вложение1С.СтруктураДокумента.Файл.Документ.ТаблДок.Вставить("СтрТабл", ТаблДокНаОсновеКлассов);
	//Иначе
	//	Вложение1С.СтруктураДокумента.Файл.Документ.СписокСтрТабл.Вставить("СтрТабл", ТаблДокНаОсновеКлассов);
	//КонецЕсли;
	
	ФормыПоиска = Новый Массив;
	ФормыПоиска.Добавить("Файл_Шаблон");
	фрм = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("СформироватьНаборСопоставленийНоменклатурыПоТабличнойЧасти", ФормыПоиска);
	
	ДопПараметрыПоискаСопоставлений = Новый Структура;
	ДопПараметрыПоискаСопоставлений.Вставить("ИдОснования", ИдентификаторДокумента);
	ДопПараметрыПоискаСопоставлений.Вставить("НеИскатьПоДокументу", Ложь);
	Если НЕ фрм = Ложь Тогда  
		НаборСопоставлений = фрм.СформироватьНаборСопоставленийНоменклатурыПоТабличнойЧасти(Вложение1С, Кэш, ДопПараметрыПоискаСопоставлений);
	КонецЕсли;
	
	Вложение1С.Вставить("КлассыСопоставленияНоменклатур", НаборСопоставлений);
	//---
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтрокуСопоставленияПоСтрокеТаблицы(СтрокаСопоставления, СтрокаВТаблице)
	
	НоменклатураСБИС = СтрокаСопоставления.НоменклатураСБИС;
	
	СтрокаСопоставления.ИдентификаторДокумента = ИдентификаторДокумента;
	
	НоменклатураСБИС.Наименование	= СтрокаВТаблице.НоменклатураСБИС;
	НоменклатураСБИС.Код			= СтрокаВТаблице.КодСБИС;
	НоменклатураСБИС.ТипКода		= СтрокаВТаблице.ТипКодаСБИС;
	НоменклатураСБИС.GTIN			= СтрокаВТаблице.GTIN_СБИС;
	
	Если НоменклатураСБИС.Единицы.Количество() Тогда
		Для Каждого ЕдиницаСБИС Из НоменклатураСБИС.Единицы Цикл
			ЕдиницаСБИС = ЕдиницаСБИС.Значение;
			Прервать;
		КонецЦикла;
	Иначе
		ЕдиницаСБИС = МодульОбъектаКлиент().НовыйСопоставлениеДляЕдиницыКлиент();
	КонецЕсли;
	
	ЕдиницаСБИС.Название	= СтрокаВТаблице.НаименованиеЕдиницыСБИС;
	ЕдиницаСБИС.ОКЕИ		= СтрокаВТаблице.ОКЕИ_ЕдиницыСБИС;
	ЕдиницаСБИС.Коэффициент	= СтрокаВТаблице.КоэффициентСБИС;
	
	Номенклатура1ССтроки = СтрокаСопоставления.Номенклатура1С;
	Для каждого Номенклатура1С Из Номенклатура1ССтроки Цикл
		Для каждого Единица Из Номенклатура1С.Значение.Единицы Цикл
			Единица.Значение.Коэффициент = СтрокаВТаблице.Коэффициент1С;
		КонецЦикла;
		Номенклатура1С.Значение.Вставить("Основное", Истина);
		Прервать;
	КонецЦикла;
	
	МодульОбъектаКлиент().СтрокаСопоставленияСБИСКлиент_Вставить(СтрокаСопоставления, "Единица", ЕдиницаСБИС);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаТЧПриИзменении(Элемент)
	
	ТекущиеДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставлений").ТекущиеДанные;
	ТекущиеДанные.СтрокаИзменена = Истина;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ИмяЭлемента = ЭлементыФормы.ТаблицаСопоставлений.ТекущаяКолонка.Имя;
	#Иначе
		ИмяЭлемента = Элемент.Имя;
	#КонецЕсли
	
	Если ИмяЭлемента = "ТаблицаСопоставленийКоличествоПересчитанное" Тогда
		ПересчитатьСтрокуПоКоличеству(ТекущиеДанные);
	ИначеЕсли ИмяЭлемента = "ТаблицаСопоставленийКоэффициент1СкСБИС" Тогда
		ПересчитатьСтрокуПоКоэффициентуСБИСк1С(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСопоставленийТипКодаСБИСПриИзменении(Элемент)
	
	ТекущиеДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставлений").ТекущиеДанные;
	ТекущиеДанные.СтрокаИзменена = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСопоставленийКоэффициент1СкСБИСПриИзменении(Элемент)
	
	ТекущиеДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставлений").ТекущиеДанные;
	ТекущиеДанные.СтрокаИзменена = Истина;
	
	ПересчитатьСтрокуПоКоэффициентуСБИСк1С(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуПоКоличеству(ТекущиеДанные, ПересчетНеобходим = Истина)
	
	Если НЕ ПересчетНеобходим Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Коэффициент1СкСБИС	= ТекущиеДанные.КоличествоПересчитанное / ТекущиеДанные.КоличествоВДокументе1С;
	ТекущиеДанные.ЦенаПересчитанная 	= ТекущиеДанные.ЦенаВДокументе1С * ТекущиеДанные.Коэффициент1СкСБИС;
	ТекущиеДанные.Коэффициент1С			= ТекущиеДанные.Коэффициент1СкСБИС;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуПоКоэффициентуСБИСк1С(ТекущиеДанные, ПересчетНеобходим = Истина)
	
	Если НЕ ПересчетНеобходим Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.КоличествоПересчитанное	= ТекущиеДанные.КоличествоВДокументе1С / ТекущиеДанные.Коэффициент1СкСБИС;
	ТекущиеДанные.ЦенаПересчитанная 		= ТекущиеДанные.ЦенаВДокументе1С * ТекущиеДанные.Коэффициент1СкСБИС;
	ТекущиеДанные.Коэффициент1С				= ТекущиеДанные.Коэффициент1СкСБИС;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСопоставленийНоменклатураКонтрагентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставлений").ТекущиеДанные;
	ТекущиеДанные.НоменклатураСБИСЗначение	= ВыбранноеЗначение; 
	ТекущиеДанные.НоменклатураСБИС			= ВыбранноеЗначение.Название;
	ТекущиеДанные.НаименованиеЕдиницыСБИС	= ВыбранноеЗначение.ЕдИзм;
	ТекущиеДанные.ОКЕИ_ЕдиницыСБИС			= ВыбранноеЗначение.ОКЕИ;
	
	// Для УФ сначала получаем группу НоменклатураСБИС, а потом изменяем уже подчиненный элемент
	ЭлементНоменклатураСБИС = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставлений.ТаблицаСопоставленийНоменклатураСБИС");
	Если ЭлементНоменклатураСБИС = Неопределено Тогда
		ЭлементНоменклатураСБИС = ЭтаФорма;
		НазваниеТипКодаСБИС = "ТаблицаСопоставлений.ТипКодаСБИС";
	Иначе
		НазваниеТипКодаСБИС = "ТаблицаСопоставленийТипКодаСБИС";
	КонецЕсли;
	
	ЭлементТипКодаСБИС = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭлементНоменклатураСБИС, НазваниеТипКодаСБИС);
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ЭлементТипКодаСБИС = ЭлементТипКодаСБИС.ЭлементУправления;
	#КонецЕсли
	
	ПорядокСопоставления = ЭлементТипКодаСБИС.СписокВыбора;
	Для каждого ПолеСопоставления Из ПорядокСопоставления Цикл
		
		Если ВыбранноеЗначение.Свойство(ПолеСопоставления.Значение)
				И ЗначениеЗаполнено(ВыбранноеЗначение[ПолеСопоставления.Значение]) Тогда
		
			ТекущиеДанные.ТипКодаСБИС		= ПолеСопоставления.Значение;
			ТекущиеДанные.КодСБИС			= ВыбранноеЗначение[ПолеСопоставления.Значение];
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВыбранноеЗначение.Свойство("GTIN") Тогда
		ТекущиеДанные.GTIN_СБИС = ВыбранноеЗначение.GTIN;    
	КонецЕсли;
	
	СтрокаТЧПриИзменении(Элемент);
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставлений").ТекущаяКолонка = Неопределено;
	#Иначе
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставлений").ТекущийЭлемент = ЭлементТипКодаСБИС;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСопоставленийТипКодаСБИСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекущиеДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставлений").ТекущиеДанные;
	Значение = ТекущиеДанные.НоменклатураСБИСЗначение;
	
	Если Значение.Свойство(ВыбранноеЗначение) Тогда
		Значение.Свойство(ВыбранноеЗначение, ТекущиеДанные.КодСБИС)
	Иначе
		ТекущиеДанные.КодСБИС = "";
	КонецЕсли;  
	
КонецПроцедуры


