
&НаКлиенте
Функция КонвертСБИС_Получить(КонвертСБИС, КлючОбращение, ДопПараметры = Неопределено) Экспорт 
	Перем Результат;
	
	Если КонвертСБИС.Свойство(КлючОбращение, Результат) Тогда
		
		Возврат Результат;
		
	Иначе
		
		Возврат ВложениеСБИС_Получить(КонвертСБИС, КлючОбращение, ДопПараметры);
		
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура КонвертСБИС_Установить(КонвертСБИС, КлючОбращение, ЗначениеДобавить = Неопределено, ДопПараметры = Неопределено) Экспорт 
	
	Если	КлючОбращение = "Отправитель"
		Или	КлючОбращение = "НашаОрганизация" Тогда
		
		Если ОбъектSABY_ЭтоТип(ЗначениеДобавить, "СторонаSaby") Тогда
			
			КонвертСБИС.НашаОрганизация = ЗначениеДобавить;
			
		Иначе
			
			КонвертСБИС.НашаОрганизация = НовыйСторонаSABY(ЗначениеДобавить);
			
		КонецЕсли;
		
	ИначеЕсли	КлючОбращение = "Получатель"
			Или	КлючОбращение = "Контрагент" Тогда
		
		Если ОбъектSABY_ЭтоТип(ЗначениеДобавить, "СторонаSaby") Тогда
			
			КонвертСБИС.Вставить("Контрагент", ЗначениеДобавить);
			
		Иначе
			
			КонвертСБИС.Вставить("Контрагент", НовыйСторонаSABY(ЗначениеДобавить));
			
		КонецЕсли;
		
	ИначеЕсли КонвертСБИС.Свойство(КлючОбращение) Тогда
		
		КонвертСБИС[КлючОбращение] = ЗначениеДобавить;
		
	Иначе
		
		ПрикладнойОбъектSABY_Установить(КонвертСБИС,  КлючОбращение, ЗначениеДобавить);
		
	КонецЕсли;

КонецПроцедуры

// Функция - Вложение СБИС выгрузить
//
// Параметры:
//  КонвертСБИС	 - КонвертСБИС	 - структура конверта
//  КлючВыгрузки - Структура	 - 
//  ДопПараметры - Структура	 - 
// 
// Возвращаемое значение:
// Массив - Строки табличной части документа 1С на загрузку/выгрузку
//
&НаКлиенте
Функция КонвертСБИС_Выгрузить(КонвертСБИС, КлючВыгрузки = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Результат = ВложениеСБИС_Выгрузить(КонвертСБИС, КлючВыгрузки);
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура КонвертСБИС_Обновить(КонвертСБИС, Изменения, ДопПараметры = Неопределено) Экспорт
	
	ВложениеСБИС_Обновить(КонвертСБИС, Изменения, ДопПараметры);
	
КонецПроцедуры

