
&НаКлиенте
Функция яНовыйКонвертСБИС_ПоГрязнымДанным(Вложение, ВходящиеПараметры, ДопПараметры) 

	Кэш = ПолучитьТекущийЛокальныйКэш();
	
	ГрязныйИниДанные	= ВходящиеПараметры.ГрязныйИни;
	Документ1Ссылка		= ВходящиеПараметры.ДокументСсылка;

	ВходящиеПараметры.Вставить("Тип",		Кэш.ОбщиеФункции.РассчитатьЗначение("Тип",		ГрязныйИниДанные));
	ВходящиеПараметры.Вставить("ПодТип",	Кэш.ОбщиеФункции.РассчитатьЗначение("ПодТип",	ГрязныйИниДанные));
	
	Если ДопПараметры = Неопределено Тогда
		
		ДопПараметры = Новый Структура;
		
	КонецЕсли;
	ДопПараметры.Вставить("ЗаполнитьСопоставление", Ложь);
	ДопПараметры.Вставить("ТочкаВходаПослеФормирования", Ложь);
	
	НовыйВложениеСБИС_ЗаполнитьПоДокументФайл(Вложение, ВходящиеПараметры, ДопПараметры);
	
	ИмяДокумента				= Кэш.ОбщиеФункции.ПолучитьРеквизитМетаданныхОбъекта(Документ1Ссылка, "Имя");
	НеЗапускатьВДокументооборот	= Кэш.ОбщиеФункции.РассчитатьЗначение("НеЗапускатьВДокументооборот", ГрязныйИниДанные);
	
	// Получить пользовательский идентификатор
	МассивСтатусРегламент	= ПолучитьЗначениеПараметраСбис("МассивСтатусРегламент");
	РегламентСтруктура		= ВложениеСБИС_Получить(Вложение, "Регламент");
	
	//KES 050751151 Статусы в разрезе регламентов (ОТПРАВКА ПАКЕТА ДОКУМЕНТОВ) --> 40 +
	Если		ЗначениеЗаполнено(РегламентСтруктура) 
		И		РегламентСтруктура.Свойство("Название") 
		И НЕ	МассивСтатусРегламент.Найти(РегламентСтруктура.Название) = Неопределено Тогда
		
		// Хранение статуса идёт по регламенту - Пользовательский ИД генерируется
		фрм		= Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПрочитатьПараметрыДокументаСБИС", Кэш.ФормаРаботыСоСтатусами,"",Кэш);
		ИдДок	= фрм.ПрочитатьПараметрыДокументаСБИС(	Документ1Ссылка,
														Кэш.ГлавноеОкно.Кэш.Парам.КаталогНастроек,
														РегламентСтруктура.Название+"ДокументСБИС_Ид",Кэш.Ини);
		ПользовательскийИдентификатор = ИмяДокумента + ":" + ?( ЗначениеЗаполнено(ИдДок), ИдДок, Строка(Новый УникальныйИдентификатор));
		
	Иначе
		
		ПользовательскийИдентификатор = Кэш.ОбщиеФункции.РассчитатьЗначение("Документ_ПользовательскийИдентификатор", ГрязныйИниДанные, Кэш);
		
	КонецЕсли;
				
	Вложение.Вставить("НашаОрганизация", ВложениеСБИС_СторонаПоРоли(Вложение, "Отправитель"));
	
	ПолучательКонверт = ВложениеСБИС_СторонаПоРоли(Вложение, "Получатель");
	Если Не ПолучательКонверт = Неопределено Тогда
	 
		Вложение.Вставить("Контрагент", ПолучательКонверт);
		Вложение.СтруктураДокумента.Вставить("Получатель", СторонаSABY_Выгрузить(ПолучательКонверт, "3.01"));
		
	КонецЕсли;
	
	ОписаниеЧисло = Новый ОписаниеТипов("Число");
	СуммаЧисло = ОписаниеЧисло.ПривестиЗначение(Вложение.Сумма);
	
	Если НЕ СуммаЧисло > 0 Тогда
		Вложение.Удалить("Сумма")	
	КонецЕсли;
	
	КонвертСБИС_Установить(Вложение, "НеЗапускатьВДокументооборот",		НеЗапускатьВДокументооборот = Истина);
	КонвертСБИС_Установить(Вложение, "ПользовательскийИдентификатор",	ПользовательскийИдентификатор);
	
	ВложениеСБИС_ЗаполнитьПоДокументФайл_ТочкаВходаПослеФормирования(Вложение, ВходящиеПараметры);
	
	Возврат Вложение;

КонецФункции

