
&НаКлиенте
Процедура яВыгрузить_ОтладочнуюИнформацию(ПараметрыВыгрузки)
	
	ПутьККаталогу = ПараметрыВыгрузки.ПутьВыгрузки;
	
	Документы1С = Новый СписокЗначений;
	Для Каждого СтрДок Из ТаблицаДокументов	Цикл
		Для Каждого Док1С Из СтрДок.Документы1С Цикл  
			Документы1С.Добавить(Док1С.Значение); 
		КонецЦикла;
	КонецЦикла; 
	
	Если ЗначениеЗаполнено(Документы1С) Тогда
		МестныйКэш.ОбщиеФункции.СбисСформироватьИнформациюПоДокументам1С(МестныйКэш, ПутьККаталогу, Документы1С);
	КонецЕсли;
	
	КаталогЗаписи = МодульОбъектаКлиент().ПрименитьФорматКСтроке(ПутьККаталогу, "СоставПакета", "Каталог");
	СоздатьКаталог(КаталогЗаписи);

	МодульОбъектаКлиент().ТехИнформация_ВыгрузитьОбъект(СоставПакета, КаталогЗаписи)
		
КонецПроцедуры

