
//DynamicDirective

Функция NativeAPI_СведенияОбИнтеграции()

	ЛокальныйКэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	
	ПараметрыИнтеграции = Новый Структура;
	ПараметрыИнтеграции.Вставить("ГенераторФЭД",				Истина);
	ПараметрыИнтеграции.Вставить("Шифрование",					Ложь);
	ПараметрыИнтеграции.Вставить("МногопоточныйРежим",			Истина);
	ПараметрыИнтеграции.Вставить("ДоступныСерверныеНастройки",	Истина);
	ПараметрыИнтеграции.Вставить("ВремяОжиданияОтвета",			60);
	ПараметрыИнтеграции.Вставить("ИмяКоннкетора",				"1c-native-http");
	ПараметрыИнтеграции.Вставить("ВремяОжиданияОтвета_Отправка",120);
	ПараметрыИнтеграции.Вставить("КоличествоПотоков",			10);
	Если		ЛокальныйКэш.Свойство("ГлавноеОкно")
		И Не	ЛокальныйКэш.ГлавноеОкно.ПараметрыФормы = Неопределено Тогда
		
		ПараметрыИнтеграции.Вставить("ВключитьВО3",				ЛокальныйКэш.ГлавноеОкно.ПараметрыФормы.ДоступностьВО3);	

	Иначе     

		ПараметрыИнтеграции.Вставить("ВключитьВО3",				Ложь);
		
	КонецЕсли;	
	ПараметрыИнтеграции.Вставить("СтатусыВРазрезеРегламента",	Истина);
	ПараметрыИнтеграции.Вставить("ВстроеннаяКриптография",		Истина);// Используется криптография 1С
	ПараметрыИнтеграции.Вставить("ИмяВнутреннегоМодуля",		"SABYHttpClient");// Имя для поиска функций вызова
	
	СведенияОбИнтеграции = Новый Структура("Имя, Параметры, Версия", "SABYHttpClient", ПараметрыИнтеграции);
	СведенияОбИнтеграции.Версия = ЛокальныйКэш.ПараметрыСистемы.Обработка.Версия;
	СведенияОбИнтеграции.Вставить("Заголовок", "API(Компонента)");

	Возврат СведенияОбИнтеграции;
	
КонецФункции

//DynamicDirective

Функция NativeAPI_СБИС_Аутентифицировать(Кэш, СтруктураПараметровЗапроса, ДопПараметрыВходящие, Отказ)

	ДопПараметры	= Новый Структура("СообщатьПриОшибке, ЕстьРезультат, ИдСессии, АдресРесурса, ОчиститьПараметры", Ложь, Истина, "", "/auth/service/", Истина);
	ИмяМетода		= "СБИС.Аутентифицировать";
	
	Возврат NativeAPI_ОтправитьИОбработатьКоманду(ИмяМетода, СтруктураПараметровЗапроса, ДопПараметры, Отказ);

КонецФункции

//DynamicDirective

Функция NativeAPI_ОтправитьИОбработатьКоманду(ИмяМетода, ПараметрыМетода, ДопПараметрыВходящие, Отказ)

	#Если НаСервере Тогда

		МодульВызова = МодульОбъектаСервер();
		
		РезультатОтвет = СбисОтправитьИОбработатьКомандуНаСервере(МодульВызова.ПолучитьТекущийЛокальныйКэш(), ИмяМетода, ПараметрыМетода, ДопПараметрыВходящие, Отказ);
		Если Отказ Тогда
			РезультатОтвет = МодульВызова.НовыйСбисИсключение(РезультатОтвет, "API.ОтправитьИОбработатьКоманду");
		КонецЕсли;
		
		Возврат РезультатОтвет;
		
	#Иначе
		
		МодульВызова = МодульОбъектаКлиент();
		Возврат СбисОтправитьИОбработатьКоманду(МодульВызова.ПолучитьТекущийЛокальныйКэш(), ИмяМетода, ПараметрыМетода, ДопПараметрыВходящие, Отказ);
		
	#КонецЕсли

КонецФункции

