
// Функция - выгружает результат отправки для показа на форме просмотра результата
//
// Параметры:
//  МассоваяОперация		 - МассоваяОперация	 - Структура отправки
//  ВерсияФорматаОтвета		 - Число				 - версия 1/2
// 
// Возвращаемое значение:
//  МассоваяОперация - копия структуры отправки
//
&НаКлиенте
Функция МассоваяОперация_Выгрузить(МассоваяОперация, ВерсияФорматаОтвета = 1) Экспорт
	
	Если		ВерсияФорматаОтвета = 1
		И	Не	МассоваяОперация_Получить(МассоваяОперация, "Версия") = ВерсияФорматаОтвета Тогда
		РезультатНовый = МассоваяОперация_Пустой(ВерсияФорматаОтвета);
		РезультатНовый = ПрикладнойОбъектSABY_Выгрузить(РезультатНовый);
		
		ЗаполнитьЗначенияСвойств(РезультатНовый, МассоваяОперация);
		Если МассоваяОперация.Свойство("Счетчики") Тогда
			РезультатНовый.Вставить("Ошибок", МассоваяОперация.Счетчики.ОшибокПодготовки + МассоваяОперация.Счетчики.ОшибокОтправки - МассоваяОперация.Счетчики.ПовторныхОтправок);
			РезультатНовый.ОтправленоСообщений	= МассоваяОперация.Счетчики.ПервичныхОтправок + МассоваяОперация.Счетчики.ПовторныхОтправок;
			РезультатНовый.НеОтправлено			= МассоваяОперация.Ошибок;
			РезультатНовый.ОшибкиДоОтправки		= МассоваяОперация.Счетчики.ОшибокПодготовки;
			РезультатНовый.НеСформировано   	= МассоваяОперация.Счетчики.ОшибокПодготовки;
			РезультатНовый.ВсегоПакетов			= МассоваяОперация.Счетчики.СформированоПакетов;

			РезультатНовый.Удалить("ДанныеКОтправке");
			РезультатНовый.Удалить("ОбработчикРезультата");
			РезультатНовый.Удалить("ПараметрыОтправки");
			РезультатНовый.Удалить("ПодпискиДляКоманд");
			Если МассоваяОперация.Свойство("ПрерватьОтправку") Тогда
				РезультатНовый.Вставить("ПрерватьОтправку", МассоваяОперация.ПрерватьОтправку);
			КонецЕсли;
		КонецЕсли;
	Иначе
		
		РезультатНовый = МассоваяОперация;
		
	КонецЕсли;
	
	РезультатНовый.Вставить("ОбщееВремя", (ПолучитьДатуВМиллисекундах() - МассоваяОперация.ВремяНачала) / 1000);
	
	Возврат РезультатНовый;

КонецФункции

// Процедура - выводит пользователю массовую операцию
//
// Параметры:
//  МассоваяОперация - МассоваяОперация	 - Структура массовой операции
//  ДопПараметры	 - Структура		 - Расширение
//
&НаКлиенте
Процедура МассоваяОперация_Показать(МассоваяОперация, ДопПараметры) Экспорт 

	ПараметрыДляФормы = Новый Структура("КэшироватьФорму, ПолучитьНовую, Владелец", Ложь, Истина);
	
	ДопПараметры.Свойство("Владелец", ПараметрыДляФормы.Владелец);
	
	ФормаДляПоказа = ПолучитьФормуОбработки("ФормаРезультатОтправки", ПараметрыДляФормы);
	Если ДопПараметры.Свойство("ОписаниеОповещенияОЗакрытии") Тогда
		
		ФормаДляПоказа.ОписаниеОповещенияОЗакрытии = ДопПараметры.ОписаниеОповещенияОЗакрытии;
		
	КонецЕсли;
	
	ФормаДляПоказа.ПоказатьПоверх(МассоваяОперация);
		
КонецПроцедуры

// Функция - метод Get для экземпляра массовой операции
//
// Параметры:
//  МассоваяОперация - МассоваяОперация	 - Экземпляр класса
//  КлючПолучить	 - Строка			 - что требуется извлечь
// 
// Возвращаемое значение:
// Произвольный  - в зависимости от ключа
//
&НаКлиенте
Функция МассоваяОперация_Получить(МассоваяОперация, КлючПолучить) Экспорт
	Перем ЗначениеРезультат;
	
	Если КлючПолучить = "Версия" Тогда
		
		Если Не МассоваяОперация.Свойство("ВерсияЭкземпляра", ЗначениеРезультат) Тогда
			
			ЗначениеРезультат = 1;
			
		КонецЕсли;
		
		Возврат ЗначениеРезультат;
		
	КонецЕсли;
	
	Возврат ПрикладнойОбъектSABY_Получить(МассоваяОперация, КлючПолучить);
	
КонецФункции

