
// Процедура выполняет расширенное выполнение действия над документом. Вызываются методы ExtSdk2.PrepareAction и ExtSdk2.ExecuteAction
//
// Параметры:
//  АсинхроннаяСБИСКоманда	 - 	Структура - Данные отправки документа - СоставПакета, Документ, СтатусПакета 
//  ДопПараметры			 - 	Структура - Набор полей, работа с которыми может расширить результат работы процедуры
//
&НаКлиенте
Процедура ExecuteActionEx(АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт
	
	WriteDocumentEx(АсинхроннаяСБИСКоманда, ДопПараметры);
	
КонецПроцедуры

