
// Функция - получает данные XML вложения
//
// Параметры:
//  ФайлЗначение - Структура	 - с полем СсылкаНаФайл
// 
// Возвращаемое значение:
//  Строка - расшифрованные данные, если успешно
//
&НаКлиенте
функция ПрочитатьФайлВложения(ФайлВложения, ДопПараметры = Неопределено) Экспорт 
    Перем ДвоичныеДанныеBase64;
	
	Возврат ПолучитьДанныеФайла(МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш(), ФайлВложения);
	
КонецФункции

&НаКлиенте
Функция ПолучитьДанныеФайла_ОбработкаПослеЧтения(Файл, ДанныеФайла) Экспорт 
	
	РезультатТекст = ДанныеФайла;
	//Вырезаем из целого пакета нужное нам вложение
	Пока Истина Цикл
		НачалоВложения = Найти(РезультатТекст, "<Вложение");
		Если НачалоВложения = 0 Тогда
			Возврат "";
		КонецЕсли;
		КонецВложения = Найти(РезультатТекст, "</Вложение>");
		Если КонецВложения = 0 Тогда
			Возврат "";
		КонецЕсли;
		Если КонецВложения < НачалоВложения Тогда
			Возврат "";
		КонецЕсли;
		//Получаем текст вложения
		ВложениеТекст = Сред(РезультатТекст, НачалоВложения, КонецВложения);
		
		//Это именно то вложение, которое нам нужно
		Если Найти(ВложениеТекст, Файл.Имя) > 0 Тогда 
			//Ищем тег XMLДанные
			НачалоXML = Найти(ВложениеТекст, "<XMLДанные>");
			Если НачалоXML = 0 Тогда
				//Это не XML файл
				Возврат "";
			КонецЕсли;
			
			КонецXML = Найти(ВложениеТекст, "</XMLДанные>");
			Если НачалоXML = 0 Тогда
				//Не нашли закрывающий тег XML файла, видимо что-то пошло не так
				Возврат "";
			КонецЕсли;
			//Возвращаем текст XML файла
			ТекстXML = СокрЛП(Сред(ВложениеТекст,НачалоXML + СтрДлина("</XMLДанные>") - 1,КонецXML - НачалоXML - СтрДлина("</XMLДанные>") + 1));
			ЧтениеXML = Новый ЧтениеXML();
			ЧтениеXML.УстановитьСтроку(ТекстXML);
			КодировкаИсточника = "<?xml version=""1.0"" encoding=""" + ЧтениеXML.КодировкаИсточника + """?>";
			ТекстXML = КодировкаИсточника + Символы.ПС + ТекстXML;
			Файл.Вставить("ТекстXML", ТекстXML);
			Возврат ТекстXML;
		КонецЕсли;
		//Получаем текст без первого вложения
		РезультатТекст = Прав(РезультатТекст, СтрДлина(РезультатТекст) - КонецВложения - СтрДлина("Вложение"));
	КонецЦикла;
	
	Возврат РезультатТекст;
	
КонецФункции

