
&НаКлиенте
Функция СБИС_ВыполнитьДействие(Кэш, document_in, ДопПараметры, Отказ) Экспорт
	Возврат Ложь;
КонецФункции

&НаКлиенте
Функция СБИС_ПодготовитьДействие(Кэш, document_in, ДопПараметры, Отказ) Экспорт
	Возврат Ложь;
КонецФункции	

&НаКлиенте
Функция СБИС_ПрочитатьДокумент(Кэш, param, ДопПараметры, Отказ) Экспорт
    Перем СоставПакета;
	
	Если	Не	ДопПараметры = Неопределено
		И		ДопПараметры.Свойство("ДокументСБИС", СоставПакета) Тогда
		
		Возврат СоставПакета;
		
	КонецЕсли;
	
	Возврат param;
	
КонецФункции

&НаКлиенте
Функция СБИС_СериализоватьСтрокуВBase64(Кэш, ПараметрыСериализовать, ДопПараметры, Отказ) Экспорт
	Возврат Кэш.ГлавноеОкно.сбисПолучитьФорму("API").СБИС_СериализоватьСтрокуВBase64(Кэш, ПараметрыСериализовать, ДопПараметры, Отказ);
КонецФункции

&НаКлиенте
Функция СБИС_СписокИзменений(Кэш, filter, ДопПараметры, Отказ) Экспорт
	Перем ФайлПоследнегоСобытия;
	
	КаталогСостоянийИмя = Кэш.Парам.КаталогОбмена + "\Состояние\";
	КаталогСостояний = Новый Файл(КаталогСостоянийИмя);
	Если Не КаталогСостояний.Существует() Тогда
		КаталогСостоянийИмя = Кэш.Парам.КаталогОбмена+"\СостояниеОтправки\"
	КонецЕсли;
    ФайлыСтатусов = НайтиФайлы(КаталогСостоянийИмя, "*.native.xml", Истина);
	
	МассивОбработанныхФайлов	= Новый Массив;
	МассивПропущенныхФайлов		= Новый Массив;
	МассивДокументов			= Новый Массив;
	Результат = Новый Структура("Навигация, Документ", Новый Структура("ЕстьЕще", "Нет"), МассивДокументов);
	
	ТипЧисло	= Новый ОписаниеТипов("Число");
	ЧислоЗабрать= ТипЧисло.ПривестиЗначение(filter.Навигация.РазмерСтраницы);
	
	ДатаВремяПроверки		= '0001.01.01';
	ИдентификаторФильтра	= "";
	Если		filter.Свойство("ИдентификаторСобытия") Тогда
		ИдентификаторФильтра = filter.ИдентификаторСобытия;
	ИначеЕсли   filter.Свойство("ДатаВремяС") Тогда
		ДатаВремяПроверки = ДатаВремяИзСтроки(filter.ДатаВремяС);
	КонецЕсли;
	
	Для Каждого Файл Из ФайлыСтатусов Цикл
		Если МассивДокументов.Количество() = ЧислоЗабрать Тогда
			Результат.Навигация.ЕстьЕще = "Да";
			Прервать;
		КонецЕсли;
		
		СтруктураСобытия = СтруктураСобытияИзФайла(Файл, Кэш);
		оДокумент = СтруктураСобытия.Документ;
		
		// Проверяем, к этой ли базе 1С относится файл
		оОрганизация = Кэш.ОбщиеФункции.НайтиОрганизациюИзДокументаСБИС(Кэш.Ини.Конфигурация, оДокумент.НашаОрганизация);
		Если оОрганизация = Неопределено ИЛИ оОрганизация = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		МассивДокументов.Добавить(оДокумент);
		МассивОбработанныхФайлов.Добавить(Файл.ПолноеИмя);
		Продолжить;
		//Игнорируем фильтры пока что, т.к. статусы идут вразнобой в каталоге, надо читать всё и строить карту.
		//Оставляем пока старую логику. Доработать при наличии желающих.
		
		Для Каждого Событие Из оДокумент.Событие Цикл
			Если Не ПустаяСтрока(ИдентификаторФильтра) Тогда
				Если	Не (	Событие.Свойство("Идентификатор")
							И	Событие.Идентификатор = ИдентификаторФильтра) Тогда
					Продолжить;
				КонецЕсли;
				//Найдено событие фильтра.
				//Последнее событие должно быть обработано но в список итого его не передаём, отсчёт идёт ОТ него, добавим в список удалить.
				ФайлПоследнегоСобытия	= Файл;
				
				//Переключаем фильтр на дату/время
				ИдентификаторФильтра	= "";
				ДатаВремяПроверки		= ДатаВремяИзСтроки(Событие.ДатаВремя);
				Прервать;
			КонецЕсли;
			Если Событие.Свойство("ДатаВремя") Тогда
				СобытиеВремя = ДатаВремяИзСтроки(Событие.ДатаВремя);
				Если СобытиеВремя >= ДатаВремяПроверки Тогда
					МассивДокументов.Добавить(оДокумент);
					Если Не ФайлПоследнегоСобытия = Неопределено Тогда
						МассивОбработанныхФайлов.Добавить(ФайлПоследнегоСобытия.ПолноеИмя);
					КонецЕсли;
					ФайлПоследнегоСобытия = Файл;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если Не ФайлПоследнегоСобытия = Файл Тогда
			//Это файл статусов нашей базы, но он не обрабатывается
			МассивПропущенныхФайлов.Добавить(Файл.ПолноеИмя);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыЧтенияИзмененийЗавершить = Новый Структура("Кэш", Кэш);
	ПараметрыЧтенияИзмененийЗавершить.Вставить("МассивОбработанныхФайлов",	МассивОбработанныхФайлов);
	ПараметрыЧтенияИзмененийЗавершить.Вставить("МассивПропущенныхФайлов",	МассивПропущенныхФайлов);
	ОбработчикПослеИзменений = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("СБИС_СписокИзменений_Завершение", ЭтаФорма, ПараметрыЧтенияИзмененийЗавершить);
	Результат.Вставить("ОбработчикПослеИзменений", ОбработчикПослеИзменений);
	
	Возврат Результат;

КонецФункции

// Процедура - удаляет обработанные файлы
//
// Параметры:
//  РезультатДействияОбновленияСтатусов	 - РезультатДействия	 - результат обновления статусов
//  ДопПараметры						 - Структура	- Кэш, Массивы обработанных файлов
//
&НаКлиенте
Процедура СБИС_СписокИзменений_Завершение(РезультатДействияОбновленияСтатусов, ДопПараметры) Экспорт
	
	Для Каждого ОбработанныйФайл Из ДопПараметры.МассивОбработанныхФайлов Цикл
		Попытка
			УдалитьФайлы(ОбработанныйФайл);
		Исключение
		КонецПопытки;
	КонецЦикла;
	Для Каждого ОбработанныйФайл Из ДопПараметры.МассивПропущенныхФайлов Цикл
		Попытка
			УдалитьФайлы(ОбработанныйФайл);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Функция СБИС_ТекущаяДата(Кэш, Отказ=Ложь) Экспорт
	Возврат ТекущаяДата();
КонецФункции

&НаКлиенте
Функция СБИС_СохранитьПоСсылкеВФайл(Кэш, ПараметрыФайла, ДопПараметры, Отказ) Экспорт
	Возврат Кэш.ГлавноеОкно.сбисПолучитьФорму("API").СБИС_СохранитьПоСсылкеВФайл(Кэш, ПараметрыФайла, ДопПараметры, Отказ);
КонецФункции

&НаКлиенте
Функция СБИС_ИнформацияОКонтрагенте(Кэш, СтруктураКонтрагента, ДопПараметры, Отказ) Экспорт
	Отказ = Истина;
	Возврат Кэш.ОбщиеФункции.СбисИсключение(, "СБИС.ИнформацияОКонтрагенте", 601, "Система не поддерживается", "Установленный способ обмена не поддерживается");
КонецФункции

&НаКлиенте
Функция СБИС_ПолучитьИнформациюОТекущемПользователе(Кэш, param, ДопПараметры, Отказ) Экспорт
	Результат = Новый Структура();
	Результат.Вставить("Фамилия", "Интеграция");
	Результат.Вставить("Имя", "Каталог"); 	
	Результат.Вставить("ИдПерсоны", Кэш.ПараметрыСистемы.Клиент.ИдПользователяИБ);
	Результат.Вставить("НомерАккаунта", Кэш.ПараметрыСистемы.Конфигурация.УИДИнтеграции);
	Возврат Результат;
КонецФункции    

&НаКлиенте
Функция СБИС_ПолучитьСписокАккаунтов(Кэш, param, ДопПараметры, Отказ) Экспорт
	Список = Новый Массив;
	Список.Добавить(Новый Структура("НомерАккаунта, НазваниеАккаунта", "", Кэш.ГлавноеОкно.КаталогОбмена));
	Возврат Список;
КонецФункции

&НаКлиенте
Функция СБИС_ПереключитьАккаунт(Кэш, param, ДопПараметры, Отказ) Экспорт
	Возврат "Ok";
КонецФункции

&НаКлиенте
Функция СБИС_ПолучитьПараметрыПакетаДляОткрытияОнлайн(ОписаниеПакета, ДопПараметры) Экспорт

	Возврат Новый Структура("ИдДокумента, Тикет", ОписаниеПакета.ИдДокумента, "");
	
КонецФункции

&НаКлиенте
Функция СБИС_СписокДокументов(Кэш, filter, ДопПараметры, Отказ) Экспорт
	
	Сообщить("Для способа обмена Каталог не предусмотрена работа с данным разделом.");
	Возврат Новый Структура("Таблица_РеестрДокументов", Новый Массив);
	
КонецФункции

&НаКлиенте
Функция СБИС_СписокДокументовПоСобытиям(Кэш, filter, ДопПараметры, Отказ) Экспорт
	
	// Получает список документов по событиям с online.sbis.ru	

	ТипРеестра = "";
	Если ДопПараметры.Свойство("ТипРеестра") Тогда
		ТипРеестра = ДопПараметры.ТипРеестра;
	КонецЕсли;
	
	Если	Кэш.Текущий.ТипДок = "ДокОтгрИсх"
		ИЛИ	ТипРеестра = "Отправленные" Тогда
		
		МодульОбъектаКлиент().СбисСообщить("Для способа обмена Каталог не предусмотрена работа с данным разделом.");
		Возврат Новый Структура("Таблица_РеестрСобытий", Новый Массив);

	КонецЕсли;
	
	Результат = Новый Структура("Навигация, Реестр", Новый Структура("ЕстьЕще, РазмерСтраницы, Страница"), Новый Массив);
	Результат.Навигация.РазмерСтраницы = Число(filter.Навигация.РазмерСтраницы);
	Результат.Навигация.Страница = Число(filter.Навигация.Страница);
	
	// На каталоге отсчет страниц с "1", а не с "0"
	НавигацияСтраница = Результат.Навигация.Страница + 1;
	
	РазмерСтраницы = Результат.Навигация.РазмерСтраницы;
	
	ГлавноеОкно = Кэш.ГлавноеОкно;
	СтруктураДляОбновленияФормы = Новый Структура;
	
	СписокКонвертов = НайтиФайлы(Кэш.Парам.КаталогОбмена + "\Полученные", "KONVERT*.native.xml", Истина); 
	
	Если НЕ ЗначениеЗаполнено(СписокКонвертов) Тогда
		Возврат Результат;
	КонецЕсли;

	МассивДокументов = Новый Массив;	
	Размер = СписокКонвертов.Количество();
	МассивИдентификаторов = Новый Массив;
	КоличествоФайлов = СписокКонвертов.Количество();
	
	ВсегоСтраниц = ?(Цел(КоличествоФайлов / РазмерСтраницы) <> КоличествоФайлов / РазмерСтраницы,
		Цел(КоличествоФайлов / РазмерСтраницы) + 1, КоличествоФайлов / РазмерСтраницы);
		
	Результат.Навигация.ЕстьЕще = (ВсегоСтраниц > НавигацияСтраница);

	ПерваяЗапись = (НавигацияСтраница - 1) * РазмерСтраницы + 1;
	ПоследняяЗапись = НавигацияСтраница * РазмерСтраницы;
	Если ПоследняяЗапись > КоличествоФайлов Тогда
		ПоследняяЗапись = КоличествоФайлов;
	КонецЕсли;

	сч = 0;
	Для сч = ПерваяЗапись По ПоследняяЗапись Цикл
		
		Конверт = СписокКонвертов.Получить(сч - 1);
		
		сбисПоказатьСостояние("Получение данных из каталога", ГлавноеОкно, Мин(100,Окр((сч+1)*100/Размер)));
		
		ТекстДок = Новый ЧтениеТекста(Конверт.ПолноеИмя);
		XMLФайла = ТекстДок.Прочитать();
		Если Найти(XMLФайла, "encoding=""UTF-8""")>0 Тогда
			ТекстДок = Новый ЧтениеТекста(Конверт.ПолноеИмя, КодировкаТекста.UTF8);
			XMLФайла = ТекстДок.Прочитать();
		КонецЕсли;
		
		оДокумент = Кэш.ОбщиеФункции.ЗаполнитьСтруктуруФайла(XMLФайла);
		
		оДокумент = оДокумент.Документ;
		
		// Добавляем ссылку на файл
		оДокумент.Вставить("СсылкаНаФайл", Конверт.ПолноеИмя); 
		
		// Добавляем ссылки во вложениях
		Если оДокумент.Свойство("Вложение") И оДокумент.Вложение.Количество() > 0 Тогда
			Для Каждого стрВложение Из оДокумент.Вложение Цикл
				Если стрВложение.Свойство("Файл") Тогда 				
					стрВложение.Файл.Вставить("СсылкаНаФайл", Конверт.ПолноеИмя);
				КонецЕсли;
				//Добавляем пустой Тип и ВерсияФормата, если их нет
				Если Не стрВложение.Свойство("Тип") Тогда
					стрВложение.Вставить("Тип", "");
				КонецЕсли;
				Если Не стрВложение.Свойство("ВерсияФормата") Тогда
					стрВложение.Вставить("ВерсияФормата", "");
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// Делаем из строки дату для полей с датой
		Если оДокумент.Свойство("Дата") Тогда
			оДокумент.Дата = Кэш.ОбщиеФункции.сбисСтрокаВДату(оДокумент.Дата);
		КонецЕсли;
		Если оДокумент.Свойство("ДатаВремяСоздания") Тогда
			оДокумент.ДатаВремяСоздания = Кэш.ОбщиеФункции.сбисСтрокаВДату(оДокумент.ДатаВремяСоздания);
		КонецЕсли;
		Если оДокумент.Свойство("Вложение") и ТипЗнч(оДокумент.Вложение) = Тип("Массив") Тогда
			Для Каждого СтрокаВложения из оДокумент.Вложение Цикл
				Если СтрокаВложения.Свойство("Дата") Тогда
					СтрокаВложения.Дата = Кэш.ОбщиеФункции.сбисСтрокаВДату(СтрокаВложения.Дата);
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
		
		Если Не оДокумент.Свойство("Контрагент") Тогда
			оДокумент.Вставить("Контрагент", Новый Структура("Название", "Не определен"));
		КонецЕсли;
		Если Не оДокумент.Свойство("НашаОрганизация") Тогда
			оДокумент.Вставить("НашаОрганизация", Новый Структура("Название", "Не определен"));
		КонецЕсли;
		
		Если Не оДокумент.Свойство("Номер") Тогда
			// Документ может быть без номера
			оДокумент.Вставить("Номер", "");
		КонецЕсли;
		
		НоваяСтр = Новый Структура("Документ, ДатаВремя", оДокумент, оДокумент.Дата);
		Результат.Реестр.Добавить(НоваяСтр);
		
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает результат работы метода ZakupkiGovAPI.GetContractInfo
//
// Параметры:
//  Кэш  - Структура - Объект класса ЛокальныйКэш
//	ПараметрыМетода - Структура - Структура с ключем doc_uuid (ИД договора)
//  ДопПараметры  - Неопределено, Структура - Набор полей, работа с которыми может расширить результат работы функции.
//	Отказ - Булево - Аргумент, определяющий успешность выполнения метода
//
// Возвращаемое значение:
//   Структура   - Результат вызова. Код результата или ошибка
//
&НаКлиенте
Функция ZakupkiGovAPI_GetContractInfo(Кэш, ПараметрыМетода, ДопПараметры, Отказ = Ложь) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ExtSysAdditionalFields_GetList(Кэш, ПараметрыМетода, ДопПараметры, Отказ = Ложь) Экспорт
	
	Возврат Новый Структура;
	
КонецФункции

&НаКлиенте
Функция SearchNomenclatureCollation(Кэш, ПараметрыМетода, ДопПараметры, Отказ = Ложь) Экспорт 
	
	Возврат Неопределено; 

КонецФункции   

// Функция получает список идентификаторов документов, доступных к аннулированию
//
// Параметры:
//  params  - Структура - Параметры фильтрации метода
//  ДопПараметры  - Структура - Набор полей, работа с которыми может расширить результат работы функции.
//
// Возвращаемое значение:
//   Структура   - Результат вызова. Список объектов или ошибка
//
&НаКлиенте
Функция ExtSysAction_CheckAnnul(params, ДопПараметры, Отказ = Ложь) Экспорт   
	
	Возврат params.docflowIds; 
		
КонецФункции

Функция ExtSysMarking_SendStatisticData(Params, ДопПараметры, Отказ = Ложь) Экспорт
	Возврат Неопределено;
КонецФункции

#Область include_core2_vo2_СпособыОбмена_ИнтеграцияКаталог_ВнешниеОбертки_Маркировка 
#КонецОбласти

