
// Функция - расшифровывает указанный файл
//
// Параметры:
//  ФайлЗначение	- Структура	- с полем Ссылка, ДвоичныеДанные(Н)
//	ДопПараметры	- Структура	- (Н) расширение
// 
// Возвращаемое значение:
//  Строка - расшифрованные данные, если успешно
//
&НаКлиенте
функция РасшифроватьФайлВложения(ФайлВложения, ДопПараметры = Неопределено) экспорт
    Перем ДвоичныеДанныеBase64;
	
	Возврат "";
	
КонецФункции

// Функция - получает данные XML вложения
//
// Параметры:
//  ФайлЗначение - Структура	 - с полем СсылкаНаФайл
// 
// Возвращаемое значение:
//  Строка - расшифрованные данные, если успешно
//
&НаКлиенте
функция ПрочитатьФайлВложения(ФайлВложения, ДопПараметры = Неопределено) Экспорт 
    Перем ДвоичныеДанныеBase64;
	
	Возврат ПолучитьДанныеФайла(МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш(), ФайлВложения);
	
КонецФункции
