
&НаКлиенте
Функция СоставПакета_Модифицирован(СоставПакета)
	Перем Результат;
	ИмяУзла = "Модифицирован";

	Для каждого Вложение Из СоставПакета_Получить(СоставПакета, "Вложение") Цикл
		Если ВложениеСБИС_Получить(Вложение, ИмяУзла) Тогда
			
			Результат = Истина;
			Прервать;

		КонецЕсли;
	КонецЦикла;
			
	СоставПакета.Вставить(ИмяУзла, Результат = Истина);

	Возврат Результат = Истина;
	
КонецФункции

&НаКлиенте
Функция СоставПакета_НайтиВложение(СоставПакета, ДопПараметры)
	
	Если НЕ СоставПакета.Свойство("Вложение") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Нет доп. параметров, нечего и отбирать, потому возврат всех
	Если ДопПараметры = Неопределено Тогда
		Возврат СоставПакета.Вложение;
	КонецЕсли;

	Если ДопПараметры.Свойство("Идентификатор")
		И ЗначениеЗаполнено(ДопПараметры.Идентификатор) Тогда
		Возврат СоставПакета_НайтиВложениеПоИдентификатору(СоставПакета, ДопПараметры.Идентификатор);
	Иначе
		Возврат СоставПакета_НайтиВложениеПоПараметрам(СоставПакета, ДопПараметры);
	КонецЕсли;

КонецФункции

&НаКлиенте
Функция СоставПакета_НайтиВложениеПоИдентификатору(СоставПакета, ИдентификаторВложения)
		
	Для каждого Вложение Из СоставПакета.Вложение Цикл

		Если ВложениеСБИС_Получить(Вложение, "Идентификатор") <> ИдентификаторВложения Тогда
			Продолжить;
		КонецЕсли;

		Возврат Вложение;

	КонецЦикла;

	Возврат Неопределено;

КонецФункции

&НаКлиенте
Функция СоставПакета_НайтиВложениеПоПараметрам(СоставПакета, ПараметрыВложения)
		
	Для каждого Вложение Из СоставПакета.Вложение Цикл

		ЧислоСовпадений = 0;

		Для каждого Параметр Из ПараметрыВложения Цикл
			Если Параметр.Ключ = "Идентификатор"
				ИЛИ ВложениеСБИС_Получить(Вложение, Параметр.Ключ) = Параметр.Значение Тогда
				ЧислоСовпадений = ЧислоСовпадений + 1;
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ЧислоСовпадений = ПараметрыВложения.Количество() Тогда
			Возврат Вложение;
		КонецЕсли;

	КонецЦикла;

	Возврат Неопределено;

КонецФункции

&НаКлиенте
Процедура СоставПакета_ОбновитьНоменклатуру(СоставПакета, Изменения)

	Для Каждого ТекущееВложение Из СоставПакета.Вложение Цикл
		ВложениеСБИС_Обновить(ТекущееВложение, Изменения);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СоставПакета_ОбновитьПараметрыДокумента(СоставПакета, Изменения)

	Для Каждого ТекущееВложение Из СоставПакета.Вложение Цикл
		ВложениеСБИС_Обновить(ТекущееВложение, Изменения);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СоставПакета_ОбновитьВложения(СоставПакета, Изменения)
	Перем ВложенияПакета;

	Если НЕ СоставПакета.Свойство("Вложение", ВложенияПакета)
		ИЛИ НЕ ЗначениеЗаполнено(Изменения) Тогда
		Возврат;
	КонецЕсли;

	Для каждого ТекущееВложение Из Изменения Цикл

		ПараметрыВложения = Новый Структура;
		ПараметрыВложения.Вставить("Тип",				ВложениеСБИС_Получить(ТекущееВложение, "Тип"));
		ПараметрыВложения.Вставить("ПодТип",			ВложениеСБИС_Получить(ТекущееВложение, "ПодТип"));
		ПараметрыВложения.Вставить("ВерсияФормата",		ВложениеСБИС_Получить(ТекущееВложение, "ВерсияФормата"));
		ПараметрыВложения.Вставить("ПодверсияФормата",	ВложениеСБИС_Получить(ТекущееВложение, "ПодверсияФормата"));
		ПараметрыВложения.Вставить("Дата",				ВложениеСБИС_Получить(ТекущееВложение, "Дата"));
		ПараметрыВложения.Вставить("Номер",				ВложениеСБИС_Получить(ТекущееВложение, "Номер"));
		ПараметрыВложения.Вставить("Идентификатор",		ВложениеСБИС_Получить(ТекущееВложение, "Идентификатор"));
		
		ОбновляемоеВложение = СоставПакета_Получить(СоставПакета, "Вложение", ПараметрыВложения);

		Если ОбновляемоеВложение = Неопределено Тогда
			ОбновляемоеВложение = НовыйВложениеСБИС(ТекущееВложение);
			СоставПакета.Вложение.Добавить(ОбновляемоеВложение);
		Иначе
			ЗаполнитьЗначенияСвойств(ОбновляемоеВложение, ТекущееВложение);
			ОбновляемоеВложение.Вставить("Модифицирован", Истина);
		КонецЕсли;

	КонецЦикла;
	
	СоставПакета.Вставить("ПерегенерироватьВложения", Ложь);

КонецПроцедуры

&НаКлиенте
Процедура СоставПакета_ОбновитьСторону(СоставПакета, Изменения)

	Для Каждого ТекущееВложение Из СоставПакета.Вложение Цикл
		ВложениеСБИС_Обновить(ТекущееВложение, Изменения);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СоставПакета_ОбновитьДанныеДокумента(СоставПакета, Изменения)

	Для Каждого ТекущееВложение Из СоставПакета.Вложение Цикл
		ВложениеСБИС_Обновить(ТекущееВложение, Изменения);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция СоставПакета_ПолучитьДанныеСторонИзПакета(СоставПакета, ДопПараметры = Неопределено) Экспорт
	
	ДанныеСторон = СоставПакета_Получить(СоставПакета, "ДанныеСторон");
	
	Если НЕ ДанныеСторон = Неопределено Тогда
		
		Возврат ДанныеСторон;
		
	КонецЕсли;
		
	ОрганизациияДокумента		= СоставПакета_Получить(СоставПакета, "НашаОрганизация");
    КонтрагентДокумента 		= СоставПакета_Получить(СоставПакета, "Контрагент"); 
	ГрузополучательДокумента	= СоставПакета_Получить(СоставПакета, "Грузополучатель");
	
	ОбщиеФункции = ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	
	ДанныеКонтрагента		= Новый Структура("Сторона, Данные, Ссылка");
	ДанныеОрганизации		= Новый Структура("Сторона, Данные, Ссылка");
	ДанныеГрузополучателя	= Новый Структура("Сторона, Данные, Ссылка");
	
	Если ЗначениеЗаполнено(ОрганизациияДокумента) Тогда
		
		ДанныеОрганизации.Сторона	= ОбщиеФункции.СбисСкопироватьОбъектНаКлиенте(ОрганизациияДокумента);
		ДанныеОрганизации.Данные	= Сторона_Выгрузить(ОрганизациияДокумента);
		
	КонецЕсли;

	Если ЗначениеЗаполнено(КонтрагентДокумента) Тогда
		
		ДанныеКонтрагента.Сторона	= ОбщиеФункции.СбисСкопироватьОбъектНаКлиенте(КонтрагентДокумента);
		ДанныеКонтрагента.Данные	= Сторона_Выгрузить(КонтрагентДокумента);

	КонецЕсли;

	Если ЗначениеЗаполнено(ГрузополучательДокумента) Тогда
		
		ДанныеГрузополучателя.Сторона	= ОбщиеФункции.СбисСкопироватьОбъектНаКлиенте(ГрузополучательДокумента);
		ДанныеГрузополучателя.Данные	= Сторона_Выгрузить(ГрузополучательДокумента);
		
	КонецЕсли;

	ДанныеСторон = Новый Структура;
	ДанныеСторон.Вставить("ДанныеКонтрагента",		ДанныеКонтрагента);
	ДанныеСторон.Вставить("ДанныеОрганизации",		ДанныеОрганизации);
	ДанныеСторон.Вставить("ДанныеГрузополучателя",	ДанныеГрузополучателя);
	
	ОбогатитьСсылкиСторонПоКлючам(ДанныеСторон);

	СоставПакета.Вставить("ДанныеСторон", ДанныеСторон);
	
	Возврат ДанныеСторон;

КонецФункции

&НаКлиенте
Процедура СоставПакета_ДополнитьПолями(СоставПакета, ДопПоля)

	Для каждого Поле Из ДопПоля Цикл
		СоставПакета.Вставить(Поле.Ключ, Поле.Значение);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция СоставПакета_ДопПараметрыСБИС(СоставПакета)
	Перем ИД_Документа, DocumentUi;
	
	// Черновик не создан или не получен. Генерить новый не надо
	Если НЕ СоставПакета.Свойство("Идентификатор", ИД_Документа) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если СоставПакета.Свойство("ДопПараметрыСБИС") Тогда
		Возврат СоставПакета.ДопПараметрыСБИС;
	КонецЕсли;
	
	МодульИнтеграции = ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция");
	Кэш = ПолучитьТекущийЛокальныйКэш();
	Отказ = Ложь;
	
	// Можно еще добавить params.type = "<Тип>" для более детальной фильтрации
	ПараметрыПолучения = Новый Структура("docflow_id, params", ИД_Документа, Новый Структура);
	ОписаниеДопПараметровСБИС = МодульИнтеграции.ExtSysAdditionalFields_GetList(Кэш, ПараметрыПолучения, Неопределено, Отказ);
	
	// Если что-то не так, просто сворачиваемся и ничего не возвращаем
	Если Отказ
		ИЛИ НЕ ОписаниеДопПараметровСБИС.Свойство("DocumentUi", DocumentUi)
		ИЛИ ТипЗнч(DocumentUi) <> Тип("Массив") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДопПараметрыСБИС = Новый Массив;
	
	Для каждого ОписаниеПараметра Из DocumentUi Цикл
	
		ПараметрСБИС = Новый Структура;
		ПараметрСБИС.Вставить("Имя", ОписаниеПараметра.name);
		ПараметрСБИС.Вставить("Заголовок", ОписаниеПараметра.caption);
		
		ТипПараметра = ТипСбисВТип1С(ОписаниеПараметра.type);
		
		Если ТипЗнч(ОписаниеПараметра.value) = Тип("Массив") Тогда
			ПараметрСБИС.Вставить("Значение", ПреобразоватьЗначениеВJSON(ОписаниеПараметра.value));
			ПараметрСБИС.Вставить("Параметр", Новый СписокЗначений);
			ПараметрСБИС.Параметр.ЗагрузитьЗначения(ОписаниеПараметра.value);
		Иначе
			ПараметрСБИС.Вставить("Значение", ОписаниеПараметра.value);
			ПараметрСБИС.Вставить("Параметр", ТипПараметра.ПривестиЗначение(ОписаниеПараметра.value));
		КонецЕсли;
		
		ПараметрСБИС.Вставить("ИнформацияОТипе", Новый Структура);
		ПараметрСБИС.ИнформацияОТипе.Вставить("Тип", ТипПараметра);
		
		Если ЗначениеЗаполнено(ОписаниеПараметра.editorOptions)
			И ОписаниеПараметра.editorOptions.Свойство("items") Тогда
		
			ПараметрСБИС.ИнформацияОТипе.Вставить("МножественныйВыбор", ОписаниеПараметра.editorOptions.multiSelect);
			ПараметрСБИС.ИнформацияОТипе.Вставить("ЗначенияСписка", Новый СписокЗначений);
			
			Для каждого ОписаниеЗначенияСписка Из ОписаниеПараметра.editorOptions.items Цикл
			
				ПараметрСБИС.ИнформацияОТипе.ЗначенияСписка.Добавить(ОписаниеЗначенияСписка.id, ОписаниеЗначенияСписка.caption);
			
			КонецЦикла;
		
		КонецЕсли;
		
		ДопПараметрыСБИС.Добавить(ПараметрСБИС);
	
	КонецЦикла;
	
	СоставПакета.Вставить("ДопПараметрыСБИС", ДопПараметрыСБИС);
	
	Возврат ДопПараметрыСБИС;
	
КонецФункции

