
&НаКлиенте
Функция СоставПакета_Модифицирован(СоставПакета)
	
	Результат = Ложь;
	ИмяУзла = "Модифицирован";

	Вложения = СоставПакета_Получить(СоставПакета, "Вложение");
	
	Если НЕ ЗначениеЗаполнено(Вложения) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для каждого Вложение Из Вложения Цикл
		Если ВложениеСБИС_Получить(Вложение, ИмяУзла) Тогда
			
			Результат = Истина;
			Прервать;

		КонецЕсли;
	КонецЦикла;
			
	СоставПакета.Вставить(ИмяУзла, Результат);

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СоставПакета_НайтиВложение(СоставПакета, ДопПараметры)
	
	Если НЕ СоставПакета.Свойство("Вложение") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Нет доп. параметров, нечего и отбирать, потому возврат всех
	Если ДопПараметры = Неопределено Тогда
		Возврат СоставПакета.Вложение;
	КонецЕсли;

	Если	ДопПараметры.Свойство("Идентификатор")
		И	ЗначениеЗаполнено(ДопПараметры.Идентификатор) Тогда
		Возврат СоставПакета_НайтиВложениеПоИдентификатору(СоставПакета, ДопПараметры.Идентификатор);
	Иначе
		Возврат СоставПакета_НайтиВложениеПоПараметрам(СоставПакета, ДопПараметры);
	КонецЕсли;

КонецФункции

&НаКлиенте
Функция СоставПакета_НайтиВложениеПоИдентификатору(СоставПакета, ИдентификаторВложения)
		
	Для каждого Вложение Из СоставПакета.Вложение Цикл

		Если ВложениеСБИС_Получить(Вложение, "Идентификатор") <> ИдентификаторВложения Тогда
			Продолжить;
		КонецЕсли;

		Возврат Вложение;

	КонецЦикла;

	Возврат Неопределено;

КонецФункции
                                                                                                                                                                                                                                                                                                                                                                                                                  
&НаКлиенте
Функция СоставПакета_НайтиВложениеПоПараметрам(СоставПакета, ПараметрыВложения)
		
	Для каждого Вложение Из СоставПакета.Вложение Цикл

		ЧислоСовпадений = 0;

		Для каждого Параметр Из ПараметрыВложения Цикл
			Если Параметр.Ключ = "Идентификатор"
				ИЛИ ВложениеСБИС_Получить(Вложение, Параметр.Ключ) = Параметр.Значение Тогда
				ЧислоСовпадений = ЧислоСовпадений + 1;
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ЧислоСовпадений = ПараметрыВложения.Количество() Тогда
			Возврат Вложение;
		КонецЕсли;

	КонецЦикла;

	Возврат Неопределено;

КонецФункции

&НаКлиенте
Процедура СоставПакета_ОбновитьНоменклатуру(СоставПакета, Изменения)

	Для Каждого ТекущееВложение Из СоставПакета.Вложение Цикл
		ВложениеСБИС_Обновить(ТекущееВложение, Изменения);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СоставПакета_ОбновитьПараметрыДокумента(СоставПакета, Изменения)

	Для Каждого ТекущееВложение Из СоставПакета.Вложение Цикл
		ВложениеСБИС_Обновить(ТекущееВложение, Изменения);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СоставПакета_ОбновитьВложения(СоставПакета, Изменения, ДопПараметры)
	Перем ВложенияПакета;  
	
	СформированныеВложения = Изменения.Вложения; 
	
	ПерезаписатьВложения = НЕ ЗначениеЗаполнено(ДопПараметры)
								Или ДопПараметры.Свойство("ПерезаписатьВложения")
									И ДопПараметры.ПерезаписатьВложения;


	Если НЕ СоставПакета.Свойство("Вложение", ВложенияПакета)
		ИЛИ НЕ ЗначениеЗаполнено(СформированныеВложения) Тогда
		Возврат;
	КонецЕсли;

	Для каждого ТекущееВложение Из СформированныеВложения Цикл

		ПараметрыВложения = Новый Структура;
		ПараметрыВложения.Вставить("Тип",				ВложениеСБИС_Получить(ТекущееВложение, "Тип"));
		ПараметрыВложения.Вставить("ПодТип",			ВложениеСБИС_Получить(ТекущееВложение, "ПодТип"));
		ПараметрыВложения.Вставить("ВерсияФормата",		ВложениеСБИС_Получить(ТекущееВложение, "ВерсияФормата"));
		ПараметрыВложения.Вставить("ПодверсияФормата",	ВложениеСБИС_Получить(ТекущееВложение, "ПодверсияФормата"));
		ПараметрыВложения.Вставить("Дата",				ВложениеСБИС_Получить(ТекущееВложение, "Дата"));
		ПараметрыВложения.Вставить("Номер",				ВложениеСБИС_Получить(ТекущееВложение, "Номер"));
		ПараметрыВложения.Вставить("Идентификатор",		ВложениеСБИС_Получить(ТекущееВложение, "Идентификатор"));
		
		ОбновляемоеВложение = СоставПакета_Получить(СоставПакета, "Вложение", ПараметрыВложения);

		Если ОбновляемоеВложение = Неопределено Тогда
			ОбновляемоеВложение = НовыйВложениеСБИС(ТекущееВложение);
			СоставПакета.Вложение.Добавить(ОбновляемоеВложение);
		Иначе 
			ЗаполнитьЗначенияСвойств(ОбновляемоеВложение, ТекущееВложение);
			// Если на обновляемом вложении не прокинута визуализация ее надо перечитать
			Если Не ТекущееВложение.Свойство("ТекстHTML") Тогда
				ОбновляемоеВложение.Удалить("ТекстHTML");
			КонецЕсли; 
			
			Если НЕ ОбновляемоеВложение.Свойство("Документы1С")
				И ТекущееВложение.Свойство("Документы1С") Тогда
					ВложениеСБИС_Обновить(ОбновляемоеВложение, Новый ФиксированнаяСтруктура("Документы1С", ТекущееВложение.Документы1С));
			КонецЕсли;  
			
			Если ПерезаписатьВложения Тогда
				
				ОбновляемоеВложение.Вставить("Модифицирован", Истина);
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;
	
	СоставПакета.Вставить("ПерегенерироватьВложения", Ложь);

КонецПроцедуры

&НаКлиенте
Процедура СоставПакета_ОбновитьСторону(СоставПакета, Изменения)

	Для Каждого ТекущееВложение Из СоставПакета.Вложение Цикл
		ВложениеСБИС_Обновить(ТекущееВложение, Изменения);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СоставПакета_ОбновитьДанныеДокумента(СоставПакета, Изменения)

	Для Каждого ТекущееВложение Из СоставПакета.Вложение Цикл
		ВложениеСБИС_Обновить(ТекущееВложение, Изменения);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция СоставПакета_ПолучитьДанныеСторонИзПакета(СоставПакета, ДопПараметры = Неопределено)
	
	ДанныеСторон = СоставПакета_Получить(СоставПакета, "ДанныеСторон");
	
	Если НЕ ДанныеСторон = Неопределено Тогда
		
		Возврат ДанныеСторон;
		
	КонецЕсли;
		
	ОрганизациияДокумента		= СоставПакета_Получить(СоставПакета, "НашаОрганизация");
    КонтрагентДокумента 		= СоставПакета_Получить(СоставПакета, "Контрагент"); 
	ГрузополучательДокумента	= СоставПакета_Получить(СоставПакета, "Грузополучатель");
	
	ФункцииДокументов = ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	
	ДанныеКонтрагента		= Новый Структура("Сторона, Данные, Ссылка");
	ДанныеОрганизации		= Новый Структура("Сторона, Данные, Ссылка");
	ДанныеГрузополучателя	= Новый Структура("Сторона, Данные, Ссылка");
	
	Если ЗначениеЗаполнено(ОрганизациияДокумента) Тогда
		
		ДанныеОрганизации.Сторона	= ФункцииДокументов.СбисСкопироватьОбъектНаКлиенте(ОрганизациияДокумента);
		ДанныеОрганизации.Данные	= СторонаSABY_Выгрузить(ОрганизациияДокумента);
		
	КонецЕсли;

	Если ЗначениеЗаполнено(КонтрагентДокумента) Тогда
		
		ДанныеКонтрагента.Сторона	= ФункцииДокументов.СбисСкопироватьОбъектНаКлиенте(КонтрагентДокумента);
		ДанныеКонтрагента.Данные	= СторонаSABY_Выгрузить(КонтрагентДокумента);

	КонецЕсли;

	Если ЗначениеЗаполнено(ГрузополучательДокумента) Тогда
		
		ДанныеГрузополучателя.Сторона	= ФункцииДокументов.СбисСкопироватьОбъектНаКлиенте(ГрузополучательДокумента);
		ДанныеГрузополучателя.Данные	= СторонаSABY_Выгрузить(ГрузополучательДокумента);
		
	КонецЕсли;

	ДанныеСторон = Новый Структура;
	ДанныеСторон.Вставить("ДанныеКонтрагента",		ДанныеКонтрагента);
	ДанныеСторон.Вставить("ДанныеОрганизации",		ДанныеОрганизации);
	ДанныеСторон.Вставить("ДанныеГрузополучателя",	ДанныеГрузополучателя);
	
	ОбогатитьСсылкиСторонПоКлючам(ДанныеСторон);

	СоставПакета.Вставить("ДанныеСторон", ДанныеСторон);
	
	Возврат ДанныеСторон;

КонецФункции

// Процедура - постобрботка состав пакета после выполнения прочитать документ
//
// Параметры:
//  СоставПакета - СоставПакера	 - прочитанный со СБИС докумени
//  ДопПараметры - Структура	 - расширение
//
&НаКлиенте
Процедура СоставПакета_ПослеПрочитатьДокумент(СоставПакета, ДопПараметры)
    Перем НаборВложенийРазбор;
	
	НужныСлужебные =	ДопПараметры.Свойство("НужныСлужебные")
					И	ДопПараметры.НужныСлужебные;
							
	МассивВложений	= Новый Массив;
	МассивСлужебных	= Новый Массив;
	
	Если	СоставПакета.Свойство("Вложение", НаборВложенийРазбор)
		И	ЗначениеЗаполнено(НаборВложенийРазбор) Тогда
		
		Для Каждого ВложениеПроверить Из НаборВложенийРазбор Цикл
			
			Если	Не	ВложениеПроверить.Свойство("Служебный") 
				Или 	ВложениеПроверить.Служебный = "Нет" Тогда
				
				МассивВложений.Добавить(ВложениеПроверить);
				
			Иначе	
				
				МассивСлужебных.Добавить(ВложениеПроверить);
				
			КонецЕсли;
			
			Если ВложениеПроверить.Свойство("Модифицирован") Тогда
				
				ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
				
				ВложениеПроверить.Модифицирован = ОписаниеТиповБулево.ПривестиЗначение(ВложениеПроверить.Модифицирован);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СоставПакета.Вставить("Вложение", МассивВложений);
							
	Если НужныСлужебные Тогда
		
		СоставПакета.Вставить("ВложениеСлужебные", МассивСлужебных);
	
	КонецЕсли;
	
	ПараметрыДокумент = СоставПакета_Получить(СоставПакета, "Параметры");
	ПараметрыДокумент.Вставить("Прочитан", Истина);

КонецПроцедуры

&НаКлиенте
Процедура СоставПакета_ДополнитьПолями(СоставПакета, ДопПоля)

	Для Каждого Поле Из ДопПоля Цикл
		
		Если Поле.Значение = Неопределено Тогда
			
			// Непрогруженные поля не добавляем
			Продолжить;
			
		КонецЕсли;
		
		СоставПакета.Вставить(Поле.Ключ, Поле.Значение);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция СоставПакета_ДопПараметрыСБИС(СоставПакета)
	Перем ИД_Документа, DocumentUi;
	
	// Черновик не создан или не получен. Генерить новый не надо
	Если НЕ СоставПакета.Свойство("Идентификатор", ИД_Документа) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если СоставПакета.Свойство("ДопПараметрыСБИС") Тогда
		Возврат СоставПакета.ДопПараметрыСБИС;
	КонецЕсли;
	
	СбисМодульИнтеграции = ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция");
	Кэш = ПолучитьТекущийЛокальныйКэш();
	Отказ = Ложь;
	
	// Можно еще добавить params.type = "<Тип>" для более детальной фильтрации
	ПараметрыПолучения = Новый Структура("docflow_id, params", ИД_Документа, Новый Структура);
	ОписаниеДопПараметровСБИС = СбисМодульИнтеграции.ExtSysAdditionalFields_GetList(Кэш, ПараметрыПолучения, Неопределено, Отказ);
	
	// Если что-то не так, просто сворачиваемся и ничего не возвращаем
	Если Отказ
		ИЛИ НЕ ОписаниеДопПараметровСБИС.Свойство("DocumentUi", DocumentUi)
		ИЛИ ТипЗнч(DocumentUi) <> Тип("Массив") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДопПараметрыСБИС = Новый Массив;
	
	Для Каждого ОписаниеПараметра Из DocumentUi Цикл
		
		ЭтоГруппаПараметров = ОписаниеПараметра.isGroup = Истина;
		
		Если ЭтоГруппаПараметров Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрСБИС = Новый Структура;
		ПараметрСБИС.Вставить("Имя", ОписаниеПараметра.name);
		ПараметрСБИС.Вставить("Заголовок", ОписаниеПараметра.caption);
		
		ТипПараметра = ТипСбисВТип1С(ОписаниеПараметра.type);
		
		Если ТипЗнч(ОписаниеПараметра.value) = Тип("Массив") Тогда
			ПараметрСБИС.Вставить("Значение", ПреобразоватьЗначениеВJSON(ОписаниеПараметра.value));
			ПараметрСБИС.Вставить("Параметр", Новый СписокЗначений);
			ПараметрСБИС.Параметр.ЗагрузитьЗначения(ОписаниеПараметра.value);
		Иначе
			ПараметрСБИС.Вставить("Значение", ОписаниеПараметра.value);
			ПараметрСБИС.Вставить("Параметр", ТипПараметра.ПривестиЗначение(ОписаниеПараметра.value));
		КонецЕсли;
		
		ПараметрСБИС.Вставить("ИнформацияОТипе", Новый Структура);
		ПараметрСБИС.ИнформацияОТипе.Вставить("Тип", ТипПараметра);
		
		Если ЗначениеЗаполнено(ОписаниеПараметра.editorOptions)
			И ОписаниеПараметра.editorOptions.Свойство("items") Тогда
		
			МножественныйВыбор = ОписаниеПараметра.editorOptions.Свойство("multiSelect") И ОписаниеПараметра.editorOptions.multiSelect
								ИЛИ ОписаниеПараметра.type = "booleangroup";
			ПараметрСБИС.ИнформацияОТипе.Вставить("МножественныйВыбор", МножественныйВыбор);
			ПараметрСБИС.ИнформацияОТипе.Вставить("ЗначенияСписка", Новый СписокЗначений);
			
			Для каждого ОписаниеЗначенияСписка Из ОписаниеПараметра.editorOptions.items Цикл
			
				ПараметрСБИС.ИнформацияОТипе.ЗначенияСписка.Добавить(ОписаниеЗначенияСписка.caption, ОписаниеЗначенияСписка.caption);
			
			КонецЦикла;
		
		ИначеЕсли ЗначениеЗаполнено(ОписаниеПараметра.editorOptions)
			И ОписаниеПараметра.editorOptions.Свойство("mask") Тогда

			Маска = МскаСбисВФормат1С(ОписаниеПараметра.editorOptions.mask);
			ПараметрСБИС.ИнформацияОТипе.Вставить("Формат", "ДФ=""" + Маска + """");

		КонецЕсли;
		
		ДопПараметрыСБИС.Добавить(ПараметрСБИС);
	
	КонецЦикла;
	
	СоставПакета.Вставить("ДопПараметрыСБИС", ДопПараметрыСБИС);
	
	Возврат ДопПараметрыСБИС;
	
КонецФункции

&НаКлиенте
Функция СоставПакета_ТекущееДействие(СоставПакета)       
	
	ПараметрыПакета = СоставПакета_Получить(СоставПакета, "Параметры");
	Если ПараметрыПакета.Свойство("ТекущееДействие") Тогда
		ОписаниеДействий = ПараметрыПакета.ТекущееДействие;
	Иначе
		ОписаниеДействий = СоставПакета_Получить(СоставПакета, "ОписаниеДействий");
	КонецЕсли;
	
	СписокДействий = Новый Массив;
	
	Для каждого ОписаниеДействия Из ОписаниеДействий Цикл

		ДействиеЗагрузить = НовыйПользовательскоеДействие(СоставПакета);
		ДействиеЗагрузить.Идентификатор = ОписаниеДействия.Значение;
		ДействиеЗагрузить.Представление = ОписаниеДействия.Представление;
		СписокДействий.Добавить(ДействиеЗагрузить);

	КонецЦикла;
	
	Изменения = Новый Структура("Параметры", Новый Структура);
	Изменения.Параметры.Вставить("ТекущееДействие", ОписаниеДействий);
	СоставПакета_Обновить(СоставПакета, Изменения);
	
	Возврат СписокДействий;
	
КонецФункции

&НаКлиенте
Функция СоставПакета_ОписаниеДействий(СоставПакета)
	
	Перем ФазаДокумента, КлючИни; 
	
	МодульФункций = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
		
	ОписаниеДействий = Новый СписокЗначений;      
	
	ФазаДокумента = СоставПакета_Получить(СоставПакета, "ТекущаяФазаДокумента");
	
	Если ФазаДокумента = "Вработе" Тогда
		
		Если Не ЗначениеЗаполнено(СоставПакета.Документы1С) Тогда
			
			ОписаниеДействий.Добавить("ЗагрузитьВ1С",	"Загрузить в 1С");  
			
		КонецЕсли;   
		
	ИначеЕсли ФазаДокумента = "Утверждение" Тогда 
		
		Если Не ЗначениеЗаполнено(СоставПакета.Документы1С) Тогда
		
			ОписаниеДействий.Добавить("ЗагрузитьВ1С",	"Загрузить в 1С");   
			
		КонецЕсли;  
		
		ОписаниеДействий.Добавить("Утвердить",		"Утвердить");  
		
	ИначеЕсли ФазаДокумента = "Отгрузка" Тогда 
		
		КлючИни = "УведомлениеОбОтгрузке";
		
		Если Не ЗначениеЗаполнено(СоставПакета.Документы1С) Тогда  
			
			ОписаниеДействий.Добавить("ЗагрузитьВ1С",	"Загрузить в 1С"); 
			
			Возврат ОписаниеДействий;
			
		КонецЕсли;	
			
		ИмяДокумента = МодульФункций.ПолучитьРеквизитМетаданныхОбъекта(СоставПакета.Документы1С[0].Значение, "Имя");  
			
		НаборПодходящихИни = ИниПоПараметрам(Новый Структура("Тип1С, ТипИни", ИмяДокумента,"Выгрузка"));
					
		Если НаборПодходящихИни.Свойство(КлючИни) Тогда   
			
			ОписаниеДействий.Добавить("Отгрузить",	"Отгрузить"); 
			
			Возврат ОписаниеДействий; 
								
		Иначе  
			
			Для Каждого СвязанныйДокумент Из СоставПакета.СвязанныеДокументы Цикл
				
				ИмяДокумента = МодульФункций.ПолучитьРеквизитМетаданныхОбъекта(СвязанныйДокумент.Значение, "Имя"); 
				
				НаборПодходящихИни = ИниПоПараметрам(Новый Структура("Тип1С, ТипИни", ИмяДокумента,"Выгрузка"));   
				
                Если НаборПодходящихИни.Свойство(КлючИни) Тогда // Документ 1С подходит под текущее действие
					
					ОписаниеДействий.Добавить("Отгрузить",	"Отгрузить");	
					
					Возврат ОписаниеДействий; 
					
				КонецЕсли; 
	
			КонецЦикла; 
			
		КонецЕсли;
		
		ОписаниеДействий.Добавить("СвязатьСОтгрузкой",	"Связать с отгрузкой");
		
	ИначеЕсли ФазаДокумента = "ОтправитьДокументы" Тогда  
		
		Если СоставПакета_Получить(СоставПакета, "ЕстьРасхождения")
			И СоставПакета_Получить(СоставПакета, "Дельта") = 0 Тогда
				
			ОписаниеДействий.Добавить("ОбработатьРезультатыПриемки",	"Обработать результат приемки");   
			
		Иначе
			
			ОписаниеДействий.Добавить("ОтправитьЮЗДДляЗаказов",	"Отправить"); 
			
		КонецЕсли;
				
	КонецЕсли;  
	
	Возврат ОписаниеДействий;
	
КонецФункции   

&НаКлиенте
Функция СоставПакета_ТекущаяФазаДокумента(СоставПакета) 
	
	ИдентификаторФазы = Формат(СоставПакета.ИдФазы, "ЧН=0; ЧГ=");
	 
	Если ИдентификаторФазы = "-1570" Тогда
		
		ФазаДокумента = "ОжиданиеПодтвержденияОДоставке";
		
	ИначеЕсли ИдентификаторФазы = "-1571" Тогда
		
		ФазаДокумента = "ОшибкаПриОбработке";
		
	ИначеЕсли ИдентификаторФазы = "-1572" Тогда
		
		ФазаДокумента = "УспешноОбработано";   
		
	ИначеЕсли ИдентификаторФазы = "-1573" Тогда
		
		ФазаДокумента = "Отгрузка";        
		
	ИначеЕсли ИдентификаторФазы = "-1574" Тогда
		
		ФазаДокумента = "ОжиданиеПриемки"; 
		
	ИначеЕсли ИдентификаторФазы = "-1575" Тогда
		
		ФазаДокумента = "ОтправитьДокументы"; 
		
	ИначеЕсли ИдентификаторФазы = "-1576" Тогда
		
		ФазаДокумента = "Подписание";   
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ИдентификаторФазы)
				И НЕ ЗначениеЗаполнено(СоставПакета_Получить(СоставПакета, "АктивныйЭтап")) Тогда
		
		ФазаДокумента = "Завершенные";
		 
	Иначе  
		
		ФазаДокумента = "Утверждение";
		
	КонецЕсли;
	
	Возврат ФазаДокумента;
	
КонецФункции 

&НаКлиенте
Функция СоставПакета_АктивныйЭтап(СоставПакета, ДопПараметры = Неопределено) 
	
	Перем ЗначениеИтог;  
	
	Если СоставПакета.Свойство("Состояние", 			ЗначениеИтог)
			И	ЗначениеИтог.Свойство("Обработка", 		ЗначениеИтог)
			И	ЗначениеИтог.Свойство("АктивныйЭтап",	ЗначениеИтог) Тогда
			
		Возврат ЗначениеИтог;
		
	КонецЕсли;
					
	Возврат ЗначениеИтог;
				
КонецФункции

&НаКлиенте
Функция СоставПакета_ТипAPI3Объекта(СоставПакета)

	СоответствиеТипов = Новый Соответствие;
	СоответствиеТипов.Вставить("ЗаказВх", "ЗаказПокупателя");
	
	Возврат СоответствиеТипов.Получить(СоставПакета_Получить(СоставПакета, "Тип"));

КонецФункции

// Функция - проверяет возможность аннулирования для пакета документов 
//
// Параметры:
//  СоставПакета - Структура - документ СБИС, прочитанный от 1С
//  ДопПараметры - Структура - расширение
//                 
// Возвращаемое значение:
//   Булево - Истина - можно аннулировать, Ложь - нельзя аннулировать
//  
&НаКлиенте
Функция СоставПакета_МожноАннулировать(СоставПакета, ДопПараметры = Неопределено)

	Если ПолучитьЗначениеПараметраСбис("СпособОбмена") = 1 Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если		СоставПакета.Параметры.Свойство("ЕстьАннулирование")
		И	Не	СоставПакета.Параметры.ЕстьАннулирование = Неопределено Тогда
		
		Возврат СоставПакета.Параметры.ЕстьАннулирование;
		
	КонецЕсли;

	ЕстьАннулированиеДокумента = Ложь;
	МассивИд = Новый Массив();
	Если СоставПакета.Свойство("Идентификатор") Тогда
		
		МассивИД.Добавить(СоставПакета.Идентификатор); 
		
	КонецЕсли;
	
	МассивИД = ПроверитьВозможностьАннулирования(МассивИД);  
	
	Если	МассивИД.Количество() 
		И	МассивИД[0] = СоставПакета.Идентификатор  Тогда
		
		ЕстьАннулированиеДокумента = Истина;
		
	КонецЕсли;
	
	СоставПакета.Параметры.Вставить("ЕстьАннулирование", ЕстьАннулированиеДокумента);
	
	Возврат ЕстьАннулированиеДокумента;
	
КонецФункции

// Функция - Состав пакета состояние документа
//
// Параметры:
//  СоставПакета - Структура - Обрабатываемый пакет (Документ) 
// 
// Возвращаемое значение:
//  Число - Числовой индекс картинки для отображения статуса Saby
//
&НаКлиенте
Функция СоставПакета_СостояниеДокумента(СоставПакета)
	
	Перем СостояниеКраткое; 
	
	ФункцииДокументов	= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");   
	
	ЕстьСостояние 		= СоставПакета.Состояние.Свойство("Название", СостояниеКраткое)
							Или СоставПакета.Состояние.Свойство("Код", СостояниеКраткое);
											
	Возврат ФункцииДокументов.СбисИндексКартинкиПоСтатусуЭД(Строка(СостояниеКраткое));	  
		
КонецФункции 

// Функция - Состав пакета текущий этап
//
// Параметры:
//  СоставПакета - Структура - Обрабатываемый пакет (Документ) 
// 
// Возвращаемое значение:
//  Строка - Название текущего этапа 
//
&НаКлиенте
Функция СоставПакета_ТекущийЭтап(СоставПакета)
	
	Перем КодСостояния;
	
	Если	СоставПакета.Свойство("Этап")
		И	СоставПакета.Этап.Количество() Тогда
		
		ТекущийЭтап = СоставПакета.Этап[0].Название;  
		
	ИначеЕсли СоставПакета.Состояние.Свойство("Код", КодСостояния) Тогда

		ТекущийЭтап = СоставПакета_СостояниеПоКодуИзПакета(КодСостояния);
		
	Иначе 
		
		ТекущийЭтап = СоставПакета.Состояние.Название;
		
	КонецЕсли; 
	
	Возврат ТекущийЭтап;	
	
КонецФункции  

// Функция - Состав пакета состояние по коду из пакета
//
// Параметры:
//  КодСостояния - Число - числовой код состояния пакета
// 
// Возвращаемое значение:
//  Строка - расшифровка состояния пакета по его коду
//
&НаКлиенте
Функция СоставПакета_СостояниеПоКодуИзПакета(КодСостояния)  
	
	КодСостояния = Строка(КодСостояния);
	
	Если КодСостояния = "0" Тогда
		Возврат "Документ редактируется";
	ИначеЕсли КодСостояния = "1" Тогда
		Возврат "Есть документ";  
	ИначеЕсли КодСостояния = "2" Тогда
		Возврат "Отправлено приглашение";
	ИначеЕсли КодСостояния = "3" Тогда
		Возврат "Отправлен";
	ИначеЕсли КодСостояния = "4" Тогда
		Возврат "Доставлен";
	ИначеЕсли КодСостояния = "5" Тогда
		Возврат "Сохранен";
	ИначеЕсли КодСостояния = "6" Тогда
		Возврат "Проблемы при доставке";
	ИначеЕсли КодСостояния = "7" Тогда
		Возврат "Выполнение завершено успешно"; 
	ИначеЕсли КодСостояния = "8" Тогда
		Возврат "Нарушение сроков";
	ИначеЕсли КодСостояния = "9" Тогда
		Возврат "Выполнение завершено с проблемами";
	ИначеЕсли КодСостояния = "10" Тогда
		Возврат "В обработке";    
	ИначеЕсли КодСостояния = "11" Тогда
		Возврат "Сложное состояние";
	ИначеЕсли КодСостояния = "12" Тогда
		Возврат "ВИ.Ошибка отправки";  
	ИначеЕсли КодСостояния = "13" Тогда
		Возврат "ВИ.Загружен на сервер"; 
	ИначеЕсли КодСостояния = "14" Тогда
		Возврат "Отправлен на проверку";
	ИначеЕсли КодСостояния = "15" Тогда
		Возврат "Импортирован";
	ИначеЕсли КодСостояния = "16" Тогда
		Возврат "СБИС Коннект: отправлена команда утвердить";
	ИначеЕсли КодСостояния = "17" Тогда
		Возврат "СБИС Коннект: отправлена команда отклонить";
	ИначеЕсли КодСостояния = "18" Тогда
		Возврат "Требуется корректировка";
	ИначеЕсли КодСостояния = "19" Тогда
		Возврат "Отозван мной";
	ИначеЕсли КодСостояния = "20" Тогда
		Возврат "Удален контрагентом";
	ИначеЕсли КодСостояния = "21" Тогда
		Возврат "Удален";
	ИначеЕсли КодСостояния = "22" Тогда
		Возврат "Аннулирован по соглашению";
	ИначеЕсли КодСостояния = "23" Тогда
		Возврат "Ожидает подписания";
	ИначеЕсли КодСостояния = "24" Тогда
		Возврат "Резерв для интерфейса";
	ИначеЕсли КодСостояния = "25" Тогда
		Возврат "Подписание отклонено";
	ИначеЕсли КодСостояния = "27" Тогда
		Возврат "Ожидает аннулирования";
	ИначеЕсли КодСостояния = "28" Тогда
		Возврат "Отправлено УоО";
	ИначеЕсли КодСостояния = "29" Тогда
		Возврат "Принято УоО"; 
	ИначеЕсли КодСостояния = "30" Тогда
		Возврат "СБИС Коннект: отправлена команда удалить";
	ИначеЕсли КодСостояния = "31" Тогда
		Возврат "ВИ.Резерв1";
	ИначеЕсли КодСостояния = "32" Тогда
		Возврат "СБИС Коннект: простая отправка на стороне отправителя";
	ИначеЕсли КодСостояния = "33" Тогда
		Возврат "СБИС Коннект: простая отправка на стороне получателя";
	ИначеЕсли КодСостояния = "34" Тогда
		Возврат "Отложенное подписание завершено успешно";
	ИначеЕсли КодСостояния = "35" Тогда
		Возврат "Принято подтверждение";
	ИначеЕсли КодСостояния = "36" Тогда
		Возврат "Документы подписаны";
	ИначеЕсли КодСостояния = "37" Тогда
		Возврат "Ожидается подпись"; 
	ИначеЕсли КодСостояния = "38" Тогда
		Возврат "Отказано в подписании";
	ИначеЕсли КодСостояния = "39" Тогда
		Возврат "Не принято";
	ИначеЕсли КодСостояния = "40" Тогда
		Возврат "Отказано в аннулировании";
	ИначеЕсли КодСостояния = "41" Тогда
		Возврат "Отказано в ответ на квитанцию";
	ИначеЕсли КодСостояния = "42" Тогда
		Возврат "Не доставлен ответ";
	ИначеЕсли КодСостояния = "43" Тогда
		Возврат "С предупреждением";
	ИначеЕсли КодСостояния = "44" Тогда
		Возврат "Предупреждение на ответ";
	ИначеЕсли КодСостояния = "45" Тогда
		Возврат "Ожидает завершения отгрузки";  
	Иначе
		Возврат ""
	КонецЕсли;

КонецФункции

