
// Процедура проверяет параметры документа в СБИС, вызывает исключение, если документ не может быть обработан 
//
// Параметры:
//  СоставПакета - Структура - обрабатываемый пакет (документ) 
//  ДопПараметры - Структура - Набор полей, работа с которыми может расширить результат работы функции. 
//
&НаКлиенте
Процедура СоставПакета_ПроверитьБлокировкуДействияВСБИС(СоставПакета, ДопПараметры = Неопределено) Экспорт

	Идентификатор = СоставПакета_Получить(СоставПакета, "ИдентификаторСБИС"); 
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		
		Возврат;
		
	КонецЕсли;
		
	//Если Не СоставПакета.Свойство("Этап") Тогда
	//	
	//	ТекстОшибки = "Отсустствуют активные этапы";
	//	ПроверкаБлокировки.БлокироватьОтправку	= Истина;
	//	ПроверкаБлокировки.ПричинаБлокировки	= НовыйСбисИсключение(СоставПакета, "МодульОбъектаКлиент.СоставПакета_ПроверитьБлокировкуДействияВСБИС", 710,,ТекстОшибки);
	//  	Возврат ПроверкаБлокировки;

	//КонецЕсли;
	
	СкладскиеПараметры = ПолучитьСкладскиеПараметрыДокумента(СоставПакета, ДопПараметры);  
	
	УказанКонтракт = СкладскиеПараметры.ПоказатьГосконтракт;
	НомерКонтракта = СкладскиеПараметры.ИдентификаторГосконтракта;
	
	Если УказанКонтракт И СтрДлина(СокрЛП(НомерКонтракта)) < 20 Тогда
		
		ВызватьИсключение "Некорректно заполнены обязательные поля: № контракта должен содержать от 20 до 25 символов";

	КонецЕсли;    
	
КонецПроцедуры

// Процедура - Состав пакета добавить
//
// Параметры:
//  СоставПакета	 - СоставПакета	 - струкутра документа СБИС
//  ЗначениеДобавить - Произвольный	 - добавляемое значение
//  ДопПараметры	 - Струкутра	 - расширение
//
&НаКлиенте
Процедура СоставПакета_Добавить(СоставПакета, ЗначениеДобавить, ДопПараметры = Неопределено) Экспорт
	Перем Контекст, ДополнительныеАргументы;
	
	Если ЭтоТипСбис(ЗначениеДобавить, "ВложениеСБИС") Тогда
		
		СоставПакета.Вложение.Добавить(ЗначениеДобавить);
		
		Если Не ДопПараметры = Неопределено
			И	ДопПараметры.Свойство("Контекст", Контекст) Тогда
			
			// Указан контекст для дополнительного расчета при добавлении
			Кэш = ПолучитьТекущийЛокальныйКэш();
			Если Не ДопПараметры.Свойство("ДополнительныеПараметры", ДополнительныеАргументы) Тогда
				
				ДополнительныеАргументы = Новый Структура;
				
			КонецЕсли;
			ГрязныйИниДанные = Контекст.ФайлДанные;
			
			Если 		ГрязныйИниДанные.Свойство("мСвязанноеВложение")
				И		ЗначениеЗаполнено(ГрязныйИниДанные.мСвязанноеВложение)
				И Не	(	ДополнительныеАргументы.Свойство("ОбработкаСвязанногоВложения")
						И	ДополнительныеАргументы.ОбработкаСвязанногоВложения) Тогда
				
				ПараметрыВложения = ВложениеСБИС_Получить(ЗначениеДобавить, "Параметры");
				ДополнительныеАргументы.Вставить("ОсновныеФормыВФК", ПараметрыВложения.НаборМодулейДляФормата);
				
				Файл_ШаблонМодуль = ПолучитьФормуОбработки("Файл_Шаблон");
				Файл_ШаблонМодуль.ПолучитьДанныеИзДокумента1С_мСвязанноеВложение(Кэш, Контекст, ДополнительныеАргументы);
				
			КонецЕсли;
				
			ВложениеСБИС_ПослеФормированияДокумента(ЗначениеДобавить, Контекст);
			ДопПараметры.Контекст = Контекст;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

