
// Процедура проверяет параметры документа в СБИС, вызывает исключение, если документ не может быть обработан 
//
// Параметры:
//  СоставПакета - Структура - обрабатываемый пакет (документ) 
//  ДопПараметры - Структура - Набор полей, работа с которыми может расширить результат работы функции. 
//
&НаКлиенте
Процедура СоставПакета_ПроверитьБлокировкуДействияВСБИС(СоставПакета, ДопПараметры = Неопределено) Экспорт

	Идентификатор = СоставПакета_Получить(СоставПакета, "ИдентификаторСБИС"); 
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		
		Возврат;
		
	КонецЕсли;
		
	//Если Не СоставПакета.Свойство("Этап") Тогда
	//	
	//	ТекстОшибки = "Отсустствуют активные этапы";
	//	ПроверкаБлокировки.БлокироватьОтправку	= Истина;
	//	ПроверкаБлокировки.ПричинаБлокировки	= НовыйСбисИсключение(СоставПакета, "МодульОбъектаКлиент.СоставПакета_ПроверитьБлокировкуДействияВСБИС", 710,,ТекстОшибки);
	//  	Возврат ПроверкаБлокировки;

	//КонецЕсли;
	
	СкладскиеПараметры = ПолучитьСкладскиеПараметрыДокумента(СоставПакета, ДопПараметры);  
	
	УказанКонтракт = СкладскиеПараметры.ПоказатьГосконтракт;
	НомерКонтракта = СкладскиеПараметры.ИдентификаторГосконтракта;
	
	Если УказанКонтракт И СтрДлина(СокрЛП(НомерКонтракта)) < 20 Тогда
		
		ВызватьИсключение "Некорректно заполнены обязательные поля: № контракта должен содержать от 20 до 25 символов";

	КонецЕсли;    
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПакета_Очистить(СоставПакета, КлючУдалить, ДопПараметры = Неопределено) Экспорт
	
	Если КлючУдалить = "НеЗапускатьВДокументооборот" Тогда
		
		СоставПакета.Удалить(КлючУдалить);
		СоставПакета.Параметры.Удалить(КлючУдалить);
		
	КонецЕсли;

	ПрикладнойОбъектSABY_Очистить(СоставПакета, КлючУдалить, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПакета_Вставить(СоставПакета, КлючДобавить = Неопределено, ЗначениеДобавить = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если КлючДобавить = Неопределено Тогда
		
		Если ЭтоТипСбис(ЗначениеДобавить, "ПрикладнойОбъектSABY") Тогда
			
			КлючДобавить = ПрикладнойОбъектSABY_Получить(ЗначениеДобавить,,"Тип");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если	КлючДобавить = "НеЗапускатьВДокументооборот"
		Или	КлючДобавить = "Провести"
		Или	КлючДобавить = "ЭтоРедакция" Тогда
		
		СоставПакета.Параметры.Вставить(КлючДобавить, ЗначениеДобавить);
		ПрикладнойОбъектSABY_Установить(СоставПакета, КлючДобавить, ЗначениеДобавить);
		
	ИначеЕсли КлючДобавить = "ВложениеСБИС" Тогда
		
		СоставПакета_Вставить_Вложение(СоставПакета, ЗначениеДобавить, ДопПараметры);
		Возврат;
		
	Иначе
		
		ПрикладнойОбъектSABY_Установить(СоставПакета, КлючДобавить, ЗначениеДобавить, ДопПараметры);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПакета_Вставить_Вложение(СоставПакета, ЗначениеДобавить, ДопПараметры)
	Перем Контекст, ДополнительныеАргументы;
	
	ПараметрыПоиска = Новый Структура("Идентификатор, Дата, Тип, Номер");  
	ПараметрыПоиска.Идентификатор = ЗначениеДобавить.Идентификатор;
	ПараметрыПоиска.Дата 		  = ЗначениеДобавить.Дата;
	ПараметрыПоиска.Тип 		  = ЗначениеДобавить.Тип;
	ПараметрыПоиска.Номер 		  = ЗначениеДобавить.Номер;
	
	ВложениеДляОбъединения = СоставПакета_НайтиВложение(СоставПакета, ПараметрыПоиска); 
	
	ЭтоОдноВложение = ОбъектыСбисРавны(ВложениеДляОбъединения, ЗначениеДобавить);
	
	Если НЕ ВложениеДляОбъединения = Неопределено
		И НЕ ЭтоОдноВложение Тогда		
		ВложениеСБИС_Объединить(ВложениеДляОбъединения, ЗначениеДобавить, ДопПараметры);
		
		Если ДопПараметры.Свойство("Ошибка") Тогда
			СоставПакета.Вложение.Добавить(ЗначениеДобавить);
		КонецЕсли;
		
		Возврат;
	ИначеЕсли НЕ ЭтоОдноВложение Тогда
		СоставПакета.Вложение.Добавить(ЗначениеДобавить);
	Иначе
		// Ничего
	КонецЕсли;
		
	Если Не ДопПараметры = Неопределено
		И	ДопПараметры.Свойство("Контекст", Контекст) Тогда
		
		// Указан контекст для дополнительного расчета при добавлении
		Кэш = ПолучитьТекущийЛокальныйКэш();
		Если Не ДопПараметры.Свойство("ДополнительныеПараметры", ДополнительныеАргументы) Тогда
			
			ДополнительныеАргументы = Новый Структура;
			
		КонецЕсли;
		ГрязныйИниДанные = Контекст.ФайлДанные;
		
		Если 		ГрязныйИниДанные.Свойство("мСвязанноеВложение")
			И		ЗначениеЗаполнено(ГрязныйИниДанные.мСвязанноеВложение)
			И Не	(	ДополнительныеАргументы.Свойство("ОбработкаСвязанногоВложения")
					И	ДополнительныеАргументы.ОбработкаСвязанногоВложения) Тогда
			
			ДополнительныеАргументы.Вставить("ОсновныеФормыВФК", ПрикладнойОбъектSABY_Получить(ЗначениеДобавить, "НаборМодулейДляФормата"));
			
			Файл_ШаблонМодуль = ПолучитьФормуОбработки("Файл_Шаблон");
			Файл_ШаблонМодуль.ПолучитьДанныеИзДокумента1С_мСвязанноеВложение(Кэш, Контекст, ДополнительныеАргументы);
			
		КонецЕсли;
			
		ВложениеСБИС_ПослеФормированияДокумента(ЗначениеДобавить, Контекст);
		ДопПараметры.Контекст = Контекст;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Состав пакета добавить
//
// Параметры:
//  СоставПакета	 - СоставПакета	 - струкутра документа СБИС
//  ЗначениеДобавить - Произвольный	 - добавляемое значение
//  ДопПараметры	 - Струкутра	 - расширение
//
&НаКлиенте
Процедура СоставПакета_Добавить(СоставПакета, ЗначениеДобавить, ДопПараметры = Неопределено) Экспорт
	
	СоставПакета_Вставить(СоставПакета,, ЗначениеДобавить, ДопПараметры); 
	
КонецПроцедуры

