
// Процедура проверяет параметры документа в СБИС, вызывает исключение, если документ не может быть обработан 
//
// Параметры:
//  СоставПакета - Структура - обрабатываемый пакет (документ) 
//  ДопПараметры - Структура - Набор полей, работа с которыми может расширить результат работы функции. 
//
&НаКлиенте
Процедура СоставПакета_ПроверитьБлокировкуДействияВСБИС(СоставПакета, ДопПараметры = Неопределено) Экспорт

	Идентификатор = СоставПакета_Получить(СоставПакета, "ИдентификаторСБИС"); 
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		
		Возврат;
		
	КонецЕсли;
		
	//Если Не СоставПакета.Свойство("Этап") Тогда
	//	
	//	ТекстОшибки = "Отсустствуют активные этапы";
	//	ПроверкаБлокировки.БлокироватьОтправку	= Истина;
	//	ПроверкаБлокировки.ПричинаБлокировки	= НовыйСбисИсключение(СоставПакета, "МодульОбъектаКлиент.СоставПакета_ПроверитьБлокировкуДействияВСБИС", 710,,ТекстОшибки);
	//  	Возврат ПроверкаБлокировки;

	//КонецЕсли;
	
	СкладскиеПараметры = ПолучитьСкладскиеПараметрыДокумента(СоставПакета, ДопПараметры);  
	
	УказанКонтракт = СкладскиеПараметры.ПоказатьГосконтракт;
	НомерКонтракта = СкладскиеПараметры.ИдентификаторГосконтракта;
	
	Если УказанКонтракт И СтрДлина(СокрЛП(НомерКонтракта)) < 20 Тогда
		
		ВызватьИсключение "Некорректно заполнены обязательные поля: № контракта должен содержать от 20 до 25 символов";

	КонецЕсли;    
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПакета_Очистить(СоставПакета, КлючУдалить, ДопПараметры = Неопределено) Экспорт
	
	Если КлючУдалить = "НеЗапускатьВДокументооборот" Тогда
		
		СоставПакета.Удалить(КлючУдалить);
		СоставПакета.Параметры.Удалить(КлючУдалить);
		
	ИначеЕсли КлючУдалить = "Вложение" Тогда
		
		СоставПакета.Вложение = Новый Массив;
		
	КонецЕсли;

	ПрикладнойОбъектSABY_Очистить(СоставПакета, КлючУдалить, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПакета_Вставить(СоставПакета, КлючДобавить = Неопределено, ЗначениеДобавить = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	КлючТест = НРег(КлючДобавить);

	Если КлючДобавить = Неопределено Тогда
		
		Если ЭтоТипСбис(ЗначениеДобавить, "ПрикладнойОбъектSABY") Тогда
			
			КлючТест = ПрикладнойОбъектSABY_Получить(ЗначениеДобавить,,"Тип");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если	КлючТест = "незапускатьвдокументооборот"
		Или	КлючТест = "провести"
		Или	КлючТест = "эторедакция" Тогда
		
		СоставПакета.Параметры.Вставить(КлючДобавить, ЗначениеДобавить = Истина);
		ПрикладнойОбъектSABY_Установить(СоставПакета, КлючДобавить, ЗначениеДобавить = Истина);
		
	ИначеЕсли	КлючТест = "вложениесбис" Тогда
		
		СоставПакета_Вставить_Вложение(СоставПакета, ЗначениеДобавить, ДопПараметры);
		Возврат;
				
	ИначеЕсли	КлючТест = "параметры" Тогда
		
		Для Каждого КлючПараметр Из ЗначениеДобавить Цикл
			
			СоставПакета_Вставить(СоставПакета, КлючПараметр.Ключ, КлючПараметр.Значение);
			
		КонецЦикла;

	ИначеЕсли СоставПакета.Свойство(КлючДобавить) Тогда
		
		СоставПакета[КлючДобавить] = ЗначениеДобавить;

	Иначе
		
		ПрикладнойОбъектSABY_Установить(СоставПакета, КлючДобавить, ЗначениеДобавить, ДопПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

// Функция - формирует Отправку СБИС - готовый к отправке Документ на основании состава пакета, прочитанного из 1С
//
// Параметры:
//  СоставПакета - Экземпляр класса (Структура)	- документ СБИС, прочитанный от 1С
//  ДопПараметры - Структура	 				- возможность расширения
// 
// Возвращаемое значение:
//  Экземпляр класса ЦепочкаКомандОбработки (Струкутра) 
//
&НаКлиенте
Функция СоставПакета_Выгрузить(СоставПакета, ДопПараметры = Неопределено) Экспорт
	Перем ФорматВыгрузки;
	
	Если ТипЗнч(ДопПараметры) = Тип("Строка") Тогда
		
		ФорматВыгрузки = ДопПараметры;
		
	ИначеЕсли НЕ ДопПараметры = Неопределено Тогда
		
		ДопПараметры.Свойство("ФорматВыгрузки", ФорматВыгрузки);
		
	КонецЕсли;
	
	Если ФорматВыгрузки = Неопределено Тогда
		
		ФорматВыгрузки = "отправка";
		
	Иначе
		
		ФорматВыгрузки = НРег(ФорматВыгрузки);

	КонецЕсли;
	
	Если ФорматВыгрузки = "записатьдокумент" Тогда
		
		ДокументИтог	= яСоставПакета_ПодготовитьКОтправке(СоставПакета, ДопПараметры);
		НаборДопПолей	= яСоставПакета_Выгрузить_ДопПоля(СоставПакета);
		// Проброс доп. полей для ЗаписатьДокумент.
		ДокументИтог.Вставить("ДопПоля", НаборДопПолей.ЗаписатьДокумент);
		Возврат ДокументИтог;
		
	ИначеЕсли ФорматВыгрузки = "дополнительныеполя" Тогда
		
		Возврат яСоставПакета_Выгрузить_ДопПоля(СоставПакета);
		
	ИначеЕсли ФорматВыгрузки = "отправка" Тогда
		
		ДокументИтог = яСоставПакета_ПодготовитьКОтправке(СоставПакета, ДопПараметры);
		ДокументИтог.Вставить("НаборДопПолей",	яСоставПакета_Выгрузить_ДопПоля(СоставПакета));
		
		Возврат ДокументИтог;
		
	ИначеЕсли ОбъектSABY_ЭтоТип(СоставПакета, "ПрикладнойОбъектSaby") Тогда
		
		Возврат ПрикладнойОбъектSABY_Выгрузить(СоставПакета, ФорматВыгрузки);
		
	Иначе
		
		Возврат СоставПакета;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СоставПакета_Вставить_Вложение(СоставПакета, ЗначениеДобавить, ДопПараметры)
	Перем Контекст, ДополнительныеАргументы;
	
	Если ОбъектSABY_ЭтоТип(ЗначениеДобавить, "ВложениеСБИС") Тогда
		
		ВложениеДобавить = ЗначениеДобавить;
		
	Иначе
		
		ВложениеДобавить = НовыйВложениеСБИС(ЗначениеДобавить, ДопПараметры);
		
	КонецЕсли;
	
	ОбъединитьВложения = СоставПакета_Получить(СоставПакета, "ОбъединятьВложения");
	Если Не ОбъединитьВложения Тогда
		
		СоставПакета.Вложение.Добавить(ВложениеДобавить);
		Возврат;
		
	КонецЕсли;
		
	ПараметрыПоиска = Новый Структура("Идентификатор, Дата, Тип, Номер");  
	ПараметрыПоиска.Идентификатор = ВложениеДобавить.Идентификатор;
	ПараметрыПоиска.Дата 		  = ВложениеДобавить.Дата;
	ПараметрыПоиска.Тип 		  = ВложениеДобавить.Тип;
	ПараметрыПоиска.Номер 		  = ВложениеДобавить.Номер;
	
	ВложениеДляОбъединения = СоставПакета_НайтиВложение(СоставПакета, ПараметрыПоиска); 
	
	ЭтоОдноВложение = ОбъектыСбисРавны(ВложениеДляОбъединения, ВложениеДобавить);
	
	Если НЕ ВложениеДляОбъединения = Неопределено
		И НЕ ЭтоОдноВложение Тогда
		
		ВложениеСБИС_Объединить(ВложениеДляОбъединения, ВложениеДобавить, ДопПараметры);
		
		Если ДопПараметры.Свойство("Ошибка") Тогда
			СоставПакета.Вложение.Добавить(ВложениеДобавить);
		КонецЕсли;
		
		Возврат;
		
	ИначеЕсли ЭтоОдноВложение Тогда
		
		Возврат;
		
	Иначе
		
		СоставПакета.Вложение.Добавить(ВложениеДобавить);
		
	КонецЕсли;
				
КонецПроцедуры

// Процедура - Состав пакета добавить
//
// Параметры:
//  СоставПакета	 - СоставПакета	 - струкутра документа СБИС
//  ЗначениеДобавить - Произвольный	 - добавляемое значение
//  ДопПараметры	 - Струкутра	 - расширение
//
&НаКлиенте
Процедура СоставПакета_Добавить(СоставПакета, ЗначениеДобавить, ДопПараметры = Неопределено) Экспорт
	
	СоставПакета_Вставить(СоставПакета,, ЗначениеДобавить, ДопПараметры); 
	
КонецПроцедуры

