
// Процедура проверяет параметры документа в СБИС, вызывает исключение, если документ не может быть обработан 
//
// Параметры:
//  СоставПакета - Структура - обрабатываемый пакет (документ) 
//  ДопПараметры - Структура - Набор полей, работа с которыми может расширить результат работы функции. 
//
&НаКлиенте
Процедура СоставПакета_ПроверитьБлокировкуДействияВСБИС(СоставПакета, ДопПараметры = Неопределено) Экспорт

	Идентификатор = СоставПакета_Получить(СоставПакета, "ИдентификаторСБИС"); 
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		
		Возврат;
		
	КонецЕсли;
		
	//Если Не СоставПакета.Свойство("Этап") Тогда
	//	
	//	ТекстОшибки = "Отсустствуют активные этапы";
	//	ПроверкаБлокировки.БлокироватьОтправку	= Истина;
	//	ПроверкаБлокировки.ПричинаБлокировки	= НовыйСбисИсключение(СоставПакета, "МодульОбъектаКлиент.СоставПакета_ПроверитьБлокировкуДействияВСБИС", 710,,ТекстОшибки);
	//  	Возврат ПроверкаБлокировки;

	//КонецЕсли;
	
	СкладскиеПараметры = ПолучитьСкладскиеПараметрыДокумента(СоставПакета, ДопПараметры);  
	
	УказанКонтракт = СкладскиеПараметры.ПоказатьГосконтракт;
	НомерКонтракта = СкладскиеПараметры.ИдентификаторГосконтракта;
	
	Если УказанКонтракт И СтрДлина(СокрЛП(НомерКонтракта)) < 20 Тогда
		
		ВызватьИсключение "Некорректно заполнены обязательные поля: № контракта должен содержать от 20 до 25 символов";

	КонецЕсли;    
	
КонецПроцедуры

