
&НаКлиенте
Функция НовыйСоставПакета(ПараметрыКонструктора, ДопПараметры = Неопределено) Экспорт
	
	Если		ЭтоТипСбис(ПараметрыКонструктора, "КонвертСБИС") Тогда
		
		НовыйСоставПакета = НовыйСоставПакета_ПользовательскийКонверт(ПараметрыКонструктора, ДопПараметры);
		
	ИначеЕсли   ЭтоТипСбис(ПараметрыКонструктора, "ВложениеСБИС") Тогда
		
		НовыйСоставПакета = НовыйСоставПакета_Вложение(ПараметрыКонструктора, ДопПараметры);
		
	ИначеЕсли ПараметрыКонструктора.Свойство("Ошибка") Тогда
		
		НовыйСоставПакета = СоставПакета_Пустой();
		НовыйСоставПакета.Вставить("Ошибка", ПараметрыКонструктора.Ошибка);
		Возврат НовыйСоставПакета;
		
	Иначе	
		
		НовыйСоставПакета = НовыйСоставПакета_ПроизвольныеПараметры(ПараметрыКонструктора);
		
	КонецЕсли;
	
	ЗапретРедакцийКонтрагента = Ложь;
	Если ЗначениеЗаполнено(НовыйСоставПакета.Контрагент) Тогда
		
		ЗапретРедакцийКонтрагента = СторонаSABY_Получить(НовыйСоставПакета.Контрагент, "ЗапретРедакций");
		
	КонецЕсли;

	// это редакция, если нет запрета
	СоставПакета_Вставить(НовыйСоставПакета, "ЭтоРедакция", Не ЗапретРедакцийКонтрагента);

	Возврат НовыйСоставПакета;
	
КонецФункции

&НаКлиенте
Функция НовыйСоставПакета_ПользовательскийКонверт(ВходящийКонверт, ДопПараметры)
	
	НовыйСоставПакета = СоставПакета_Пустой(ВходящийКонверт);

	Для Каждого КлючИЗначение Из КонвертСБИС_Выгрузить(ВходящийКонверт, "Цикл") Цикл
		
		СоставПакета_Вставить(НовыйСоставПакета, КлючИЗначение.Ключ, КлючИЗначение.Значение);
		
	КонецЦикла;
	
	НеЗапускатьВДокументоОборот = КонвертСБИС_Получить(ВходящийКонверт, "НеЗапускатьВДокументооборот")
									Или (	ДопПараметры.Свойство("НеЗапускатьВДокументооборот")
										И	ДопПараметры.НеЗапускатьВДокументооборот);
	ПользовательскийИдентификатор = КонвертСБИС_Получить(ВходящийКонверт, "ПользовательскийИдентификатор");
	Если Не ЗначениеЗаполнено(ПользовательскийИдентификатор)
		И	ДопПараметры.Свойство("ПользовательскийИдентификатор") Тогда
		
		ПользовательскийИдентификатор = ДопПараметры.ПользовательскийИдентификатор;
		
	КонецЕсли;
	
		
	СоставПакета_Вставить(НовыйСоставПакета, "НеЗапускатьВДокументооборот", НеЗапускатьВДокументоОборот);
	Если ЗначениеЗаполнено(ПользовательскийИдентификатор) Тогда
		
		НовыйСоставПакета.Вставить("ПользовательскийИдентификатор", ПользовательскийИдентификатор);
		
	КонецЕсли;
	
	Если	НовыйСоставПакета.Свойство("Провести")
		И	НовыйСоставПакета.Провести = Истина Тогда
		
		СоставПакета_Вставить(НовыйСоставПакета, "Провести", Истина);
		
	КонецЕсли;
	
	НовыйСоставПакета.Удалить("Провести");			
	
	Возврат НовыйСоставПакета;
	
КонецФункции

&НаКлиенте
Функция НовыйСоставПакета_Вложение(ОснованиеДляПакета, ДопПараметры)
	Перем РегламентНазвание; 

	ОрганизацияСторона	= ВложениеСБИС_Получить(ОснованиеДляПакета, "СторонаПоРоли", "Отправитель");
	КонтрагентСторона	= ВложениеСБИС_Получить(ОснованиеДляПакета, "СторонаПоРоли", "Получатель");
	Если	ОрганизацияСторона = Неопределено Тогда
		
		ОшибкаГенерацияПакета = НовыйСбисИсключение(724, "МодульОбъектаКлиент.СгенерироватьИсходящийПакет");
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаГенерацияПакета);
			
	КонецЕсли;
	
	Если	КонтрагентСторона = Неопределено Тогда
		
		ОшибкаГенерацияПакета = НовыйСбисИсключение(725, "МодульОбъектаКлиент.СгенерироватьИсходящийПакет");
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаГенерацияПакета);
			
	КонецЕсли;
	
	НовыйСоставПакета		= СоставПакета_Пустой();
	НовыйСоставПакета.Тип	= ДопПараметры.Тип;
	ОснованиеПакета			= ДопПараметры.ОснованиеПакета;
	
	Если Не ДопПараметры.Свойство("Название", НовыйСоставПакета.Название) Тогда
		
		НовыйСоставПакета.Название	= Строка(ОснованиеПакета);
		Если	ОснованиеДляПакета.Свойство("Тип") Тогда
			
			НовыйСоставПакета.Название	= Строка(ОснованиеДляПакета.Тип) + " на основании " + НовыйСоставПакета.Название;
			
		КонецЕсли;
			
		Если ОснованиеДляПакета.Свойство("Направление") Тогда
		
			НовыйСоставПакета.Название	= Строка(ОснованиеДляПакета.Направление) + " " + НовыйСоставПакета.Название;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НовыйСоставПакета.Вставить("НашаОрганизация", 			ОрганизацияСторона);
	НовыйСоставПакета.Вставить("Контрагент", 				КонтрагентСторона);
	НовыйСоставПакета.Вставить("Ответственный", 			ОснованиеДляПакета.Ответственный);
	НовыйСоставПакета.Вставить("Подразделение", 			ОснованиеДляПакета.Подразделение);	
	НовыйСоставПакета.Вставить("Регламент", 				ОснованиеДляПакета.Регламент);
	НовыйСоставПакета.Вставить("ДокументОснование",			ОснованиеДляПакета.ДокументОснование);
	НовыйСоставПакета.Вставить("Примечание",				ОснованиеДляПакета.Примечание);
	НовыйСоставПакета.Вставить("Сертификат",				ОснованиеДляПакета.Сертификат);
	НовыйСоставПакета.Вставить("ДопПоля");
	
	Если Не ОснованиеДляПакета.Свойство("ДопПоля", НовыйСоставПакета.ДопПоля) Тогда
		
		НовыйСоставПакета.ДопПоля = Новый Массив;
		
	КонецЕсли;
	
	Если ОснованиеДляПакета.Свойство("Провести") Тогда
		
		НовыйСоставПакета.Вставить("Провести",	ОснованиеДляПакета.Провести);
		
	КонецЕсли;
	
	Если ДопПараметры.Свойство("Подтип") Тогда
		
		НовыйСоставПакета.Вставить("ПодТип", ДопПараметры.Подтип);	
		
	КонецЕсли; 
	
	Если ДопПараметры.Свойство("НеЗапускатьВДокументооборот") Тогда
		
		ТипПривести = Новый ОписаниеТипов("Булево");
		СоставПакета_Вставить(НовыйСоставПакета, "НеЗапускатьВДокументооборот", ТипПривести.ПривестиЗначение(ДопПараметры.НеЗапускатьВДокументооборот));
		
	КонецЕсли;
	
	ДанныеСтруктурыФайла = ВложениеСБИС_Получить(ОснованиеДляПакета, "ДанныеСтруктурыФайла");
	
	Если	ПолучитьЗначениеПараметраСбис("ПоддержкаОбменаЕИС") Тогда
		
		// Обмен с ЕИС. Включим расширение если есть ГК
		ИдентификаторГосконтракта	 = ДанныеСтруктурыФайла.Поля.Получить("Госконтракт");

		Если ЗначениеЗаполнено(ИдентификаторГосконтракта) Тогда
		
			НовыйСоставПакета.ДопПоля.Добавить("Расширение");
			НовыйСоставПакета.ДопПоля.Добавить("ЕИС");
			
		КонецЕсли;
		
	КонецЕсли;

	МодульФункций			 = ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	МассивСтатусРегламент	 = ПолучитьЗначениеПараметраТекущегоСеанса("МассивСтатусРегламент");
	ИмяДокумента			 = МодульФункций.ПолучитьРеквизитМетаданныхОбъекта(ОснованиеПакета, "Имя");

	Кэш	 = ПолучитьТекущийЛокальныйКэш();
	
	Если ДопПараметры.Свойство("ПользовательскийИдентификатор") Тогда
		
		НовыйСоставПакета.Вставить("ПользовательскийИдентификатор", ДопПараметры.ПользовательскийИдентификатор);
		
	ИначеЕсли		НовыйСоставПакета.Регламент.Свойство("Название", РегламентНазвание) 
			И НЕ	МассивСтатусРегламент.Найти(РегламентНазвание) = Неопределено Тогда
			
		// Если вручную не назначен идентификатор и регламент подразумевает отдельное хранение статусов - guid выдается новый и не будет совпадать с guid документа
		// Проверка, нет ли ранее сохраненного ид редакция
		фрм		= НайтиФункциюСеансаОбработки("ПрочитатьПараметрыДокументаСБИС", Кэш.ФормаРаботыСоСтатусами);
		ИдДок	= фрм.ПрочитатьПараметрыДокументаСБИС(ОснованиеПакета, ПолучитьЗначениеПараметраСбис("КаталогНастроек"), РегламентНазвание + "ДокументСБИС_Ид", Кэш.Ини);
		
		//если первая отправка - новый ид
		НовыйСоставПакета.Вставить("ПользовательскийИдентификатор", ИмяДокумента + ":"+?( ЗначениеЗаполнено(ИдДок), ИдДок, Строка(Новый УникальныйИдентификатор)));
		
	Иначе
		
		Если НЕ НовыйСоставПакета.Свойство("ПользовательскийИдентификатор") Тогда
			
			Если ТипЗнч(ОснованиеПакета) = Тип("Структура") Тогда
				
				ИдОснования = ?(ОснованиеПакета.Свойство("Идентификатор"), ОснованиеПакета.Идентификатор, Новый УникальныйИдентификатор);
				НовыйСоставПакета.Вставить("ПользовательскийИдентификатор", ИмяДокумента + ":" + Строка(ИдОснования));
				
			Иначе
				
				НовыйСоставПакета.Вставить("ИдентификаторРедакции", ИмяДокумента + ":" + Строка(ОснованиеПакета.УникальныйИдентификатор()));	
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 

	Возврат НовыйСоставПакета;
	
КонецФункции

&НаКлиенте
Функция НовыйСоставПакета_ПроизвольныеПараметры(ПараметрыКонструктора)
	
	НовыйСоставПакета = СоставПакета_Пустой();
	
	Если ПараметрыКонструктора.Свойство("НашаОрганизация") Тогда
		
		НовыйСоставПакета.НашаОрганизация = НовыйСторонаSABY(ПараметрыКонструктора.НашаОрганизация);
		
	КонецЕсли;

	Если ПараметрыКонструктора.Свойство("Контрагент") Тогда
		
		НовыйСоставПакета.Контрагент = НовыйСторонаSABY(ПараметрыКонструктора.Контрагент);
		
	КонецЕсли;

	Если ПараметрыКонструктора.Свойство("Дата") Тогда
		
		НовыйСоставПакета.Дата = Формат(ПараметрыКонструктора.Дата, "ДЛФ=Д");
		
	КонецЕсли;

	Если ПараметрыКонструктора.Свойство("Название") Тогда
		
		НовыйСоставПакета.Название = ПараметрыКонструктора.Название;
		
	КонецЕсли;

	Если ПараметрыКонструктора.Свойство("Тип") Тогда
		
		НовыйСоставПакета.Тип = ПараметрыКонструктора.Тип;
		
	КонецЕсли;

	Если ПараметрыКонструктора.Свойство("Вложение") Тогда
		
		НовыйСоставПакета.Вложение = ПараметрыКонструктора.Вложение;
		
	КонецЕсли;

	Если ПараметрыКонструктора.Свойство("Примечание") Тогда
		
		НовыйСоставПакета.Примечание = ПараметрыКонструктора.Примечание;
		
	КонецЕсли;

	Если ПараметрыКонструктора.Свойство("ОснованиеПакета") Тогда
		
		НовыйСоставПакета.Вложение.Добавить(НовыйВложениеСБИС(, ПараметрыКонструктора));
		
	КонецЕсли;
	
	Если ПараметрыКонструктора.Свойство("ДокументОснование") Тогда
		
		НовыйСоставПакета.ДокументОснование = ПараметрыКонструктора.ДокументОснование;

	КонецЕсли;
	
	Если ПараметрыКонструктора.Свойство("Регламент") Тогда
		
		НовыйСоставПакета.Регламент = ПараметрыКонструктора.Регламент;

	КонецЕсли;
	
	Если ПараметрыКонструктора.Свойство("НеЗапускатьВДокументооборот") Тогда
		
		СоставПакета_Вставить(НовыйСоставПакета, "НеЗапускатьВДокументооборот", ПараметрыКонструктора.НеЗапускатьВДокументооборот = Истина);

	КонецЕсли;

	Если ПараметрыКонструктора.Свойство("Провести") Тогда
		
		СоставПакета_Вставить(НовыйСоставПакета, "Провести", ПараметрыКонструктора.Провести = Истина);

	КонецЕсли;

	Если	ПараметрыКонструктора.Свойство("Ответственный")
		И	ЗначениеЗаполнено(ПараметрыКонструктора.Ответственный) Тогда
		
		НовыйСоставПакета.Ответственный = ПараметрыКонструктора.Ответственный;

	КонецЕсли;

	Если ПараметрыКонструктора.Свойство("ВложениеУчета") Тогда
		
		ПрикладнойОбъектSABY_Установить(НовыйСоставПакета, "ПереключитьВложения",	ПараметрыКонструктора.ВложениеУчета, "Данные");
		ПрикладнойОбъектSABY_Установить(НовыйСоставПакета, "ВложенияУчета",			Истина);
		
	КонецЕсли;

	Возврат НовыйСоставПакета;

КонецФункции

&НаКлиенте
Функция СоставПакета_Пустой(ОснованиеДляПакета = Неопределено)
	
	ПустойСоставПакета = НовыйПрикладнойОбъектSABY();
		
	// Прописать тип для родителя
	ПрикладнойОбъектSABY_Установить(ПустойСоставПакета,, ОснованиеДляПакета, "Тип");
	ПрикладнойОбъектSABY_Установить(ПустойСоставПакета,, "СоставПакета", "Тип");
	
	ПустойСоставПакета.Вставить("Тип");
	ПустойСоставПакета.Вставить("Название");
	ПустойСоставПакета.Вставить("Дата");
	ПустойСоставПакета.Вставить("Примечание");

	ПустойСоставПакета.Вставить("НашаОрганизация");
	ПустойСоставПакета.Вставить("Контрагент");
	ПустойСоставПакета.Вставить("Ответственный");
	ПустойСоставПакета.Вставить("Подразделение");
	ПустойСоставПакета.Вставить("Регламент");
	ПустойСоставПакета.Вставить("Сертификат");
	
	ПустойСоставПакета.Вставить("ДокументОснование",	Новый Массив);
	ПустойСоставПакета.Вставить("Вложение",				Новый Массив);
	ПустойСоставПакета.Вставить("Параметры",			Новый Структура);
   
	СоставПакета_Вставить(ПустойСоставПакета, "НеЗапускатьВДокументооборот",	Ложь,	"Параметр");
	СоставПакета_Вставить(ПустойСоставПакета, "Провести",						Ложь,	"Параметр");
	СоставПакета_Вставить(ПустойСоставПакета, "ЭтоРедакция",					Истина, "Параметр");
	
	Возврат ПустойСоставПакета;
	
КонецФункции

