
&НаКлиенте
Функция НовыйСоставПакета(ПараметрыКонструктора) Экспорт
	
	Если		ЭтоТипСбис(ПараметрыКонструктора, "Конверт") Тогда
		
		НовыйСоставПакета = НовыйСоставПакета_ПользовательскийКонверт(ПараметрыКонструктора);
		
	ИначеЕсли   ЭтоТипСбис(ПараметрыКонструктора, "ВложениеСБИС") Тогда
		
		НовыйСоставПакета = НовыйСоставПакета_Вложение(ПараметрыКонструктора);
		
	ИначеЕсли ПараметрыКонструктора.Свойство("Ошибка") Тогда
		
		НовыйСоставПакета = СоставПакета_Пустой();
		НовыйСоставПакета.Вставить("Ошибка", ПараметрыКонструктора.Ошибка);
		
	Иначе	
		
		НовыйСоставПакета = НовыйСоставПакета_ПроизвольныеПараметры(ПараметрыКонструктора);
		
	КонецЕсли;
	
	Если 	НовыйСоставПакета.Свойство("Контрагент")
			И ЗначениеЗаполнено(НовыйСоставПакета.Контрагент) Тогда
		
		НовыйСоставПакета.Параметры.ЭтоРедакция = Не Сторона_Получить(НовыйСоставПакета.Контрагент, "ЗапретРедакций");

	КонецЕсли;

	Возврат НовыйСоставПакета;
	
КонецФункции

&НаКлиенте
Функция НовыйСоставПакета_ПользовательскийКонверт(ВходящийКонверт)
	
	НовыйСоставПакета = СоставПакета_Пустой();
	Для Каждого КлючИЗначение Из ВходящийКонверт Цикл
		
		НовыйСоставПакета.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		
	КонецЦикла;
	
	Если		НовыйСоставПакета.Свойство("НеЗапускатьВДокументооборот")
			И	НовыйСоставПакета.НеЗапускатьВДокументооборот = Истина Тогда
			
		НовыйСоставПакета.Параметры.НеЗапускатьВДокументооборот = Истина;
		
	КонецЕсли;
	НовыйСоставПакета.Удалить("НеЗапускатьВДокументооборот");
	
	Возврат НовыйСоставПакета;
	
КонецФункции

&НаКлиенте
Функция НовыйСоставПакета_Вложение(ОснованиеДляПакета)
	
	НовыйСоставПакета	= СоставПакета_Пустой();

	ОрганизацияСторона	= ВложениеСБИС_Получить(ОснованиеДляПакета, "СторонаПоРоли", "Отправитель");
	КонтрагентСторона	= ВложениеСБИС_Получить(ОснованиеДляПакета, "СторонаПоРоли", "Получатель");
	Если	ОрганизацияСторона = Неопределено Тогда
		
		ОшибкаГенерацияПакета = НовыйСбисИсключение(724, "МодульОбъектаКлиент.СгенерироватьИсходящийПакет");
		ВызватьИсключение СбисИсключение_ВСтроку(СбисИсключение_Представление(ОшибкаГенерацияПакета));
			
	КонецЕсли;
	
	Если	КонтрагентСторона = Неопределено Тогда
		
		ОшибкаГенерацияПакета = НовыйСбисИсключение(725, "МодульОбъектаКлиент.СгенерироватьИсходящийПакет");
		ВызватьИсключение СбисИсключение_ВСтроку(СбисИсключение_Представление(ОшибкаГенерацияПакета));
			
	КонецЕсли;	

	НовыйСоставПакета.Вставить("НашаОрганизация", 			ОрганизацияСторона);
	НовыйСоставПакета.Вставить("Контрагент", 				КонтрагентСторона);
	НовыйСоставПакета.Вставить("Ответственный", 			ОснованиеДляПакета.Ответственный);
	НовыйСоставПакета.Вставить("Подразделение", 			ОснованиеДляПакета.Подразделение);	
	НовыйСоставПакета.Вставить("Регламент", 				ОснованиеДляПакета.Регламент);
	НовыйСоставПакета.Вставить("ДокументОснование",			ОснованиеДляПакета.ДокументОснование);
	НовыйСоставПакета.Вставить("Примечание",				ОснованиеДляПакета.Примечание);
	НовыйСоставПакета.Вставить("Сертификат",				ОснованиеДляПакета.Сертификат);
	НовыйСоставПакета.Вставить("ДопПоля");
	
	Если Не ОснованиеДляПакета.Свойство("ДопПоля", НовыйСоставПакета.ДопПоля) Тогда
		
		НовыйСоставПакета.ДопПоля = Новый Массив;
		
	КонецЕсли;
	
	Если ОснованиеДляПакета.Свойство("Провести") Тогда
		
		НовыйСоставПакета.Вставить("Провести",	ОснованиеДляПакета.Провести);
		
	КонецЕсли;
	
	Возврат НовыйСоставПакета;
	
КонецФункции

&НаКлиенте
Функция НовыйСоставПакета_ПроизвольныеПараметры(ПараметрыКонструктора)
	
	НовыйСоставПакета = СоставПакета_Пустой();
	
	Если ПараметрыКонструктора.Свойство("НашаОрганизация") Тогда
		
		НовыйСоставПакета.НашаОрганизация = ПараметрыКонструктора.НашаОрганизация;
		
	КонецЕсли;

	Если ПараметрыКонструктора.Свойство("Дата") Тогда
		
		НовыйСоставПакета.Дата = Формат(ПараметрыКонструктора.Дата, "ДЛФ=Д");
		
	КонецЕсли;

	Если ПараметрыКонструктора.Свойство("Название") Тогда
		
		НовыйСоставПакета.Название = ПараметрыКонструктора.Название;
		
	КонецЕсли;

	Если ПараметрыКонструктора.Свойство("Контрагент") Тогда
		
		НовыйСоставПакета.Контрагент = ПараметрыКонструктора.Контрагент;
		
	КонецЕсли;

	Если ПараметрыКонструктора.Свойство("Тип") Тогда
		
		НовыйСоставПакета.Тип = ПараметрыКонструктора.Тип;
		
	КонецЕсли;

	Если ПараметрыКонструктора.Свойство("Вложение") Тогда
		
		НовыйСоставПакета.Вложение = ПараметрыКонструктора.Вложение;
		
	КонецЕсли;

	Если ПараметрыКонструктора.Свойство("Примечание") Тогда
		
		НовыйСоставПакета.Примечание = ПараметрыКонструктора.Примечание;
		
	КонецЕсли;

	Если ПараметрыКонструктора.Свойство("ОснованиеПакета") Тогда
		
		НовыйСоставПакета.Вложение.Добавить(НовыйВложениеСБИС(, ПараметрыКонструктора));
		
	КонецЕсли;
	
	Если ПараметрыКонструктора.Свойство("ДокументОснование") Тогда
		
		НовыйСоставПакета.ДокументОснование = ПараметрыКонструктора.ДокументОснование;

	КонецЕсли;

	Возврат НовыйСоставПакета;

КонецФункции

&НаКлиенте
Функция СоставПакета_Пустой()
	
	ПараметрыПакета	= Новый Структура("НеЗапускатьВДокументооборот, ЭтоРедакция, Провести", Ложь, Истина, Ложь);

	ПустойСоставПакета = Новый Структура(
	"Вложение, Параметры, НашаОрганизация, Контрагент, Ответственный, Подразделение, Регламент,
	|Тип, Название, Дата, ДокументОснование, Примечание, Сертификат");
	ПустойСоставПакета.Вложение				= Новый Массив;
	ПустойСоставПакета.ДокументОснование	= Новый Массив;
	
    ПустойСоставПакета.Параметры = ПараметрыПакета;
	
	Возврат ПустойСоставПакета;
	
КонецФункции

