&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
		
	Если НЕ СохранениеПроведено 
		И НЕ ЗакрытьБезСохранения
		И НЕ ИмеютсяИзмененияСопоставленнойНоменклатуры Тогда
		Отказ = Истина; 
		Режим = РежимДиалогаВопрос.ДаНет;
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ЗакрытьБезСохранения", ЗакрытьБезСохранения); 
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Ответ = Вопрос("Выйти без сохранения?", Режим, 0);	
			ПослеВопросаОЗакрытии(Ответ, ЗакрытьБезСохранения);
		#Иначе   
			ОповещениеПослеВопроса = Новый ОписаниеОповещения("ПослеВопросаОЗакрытии",ЭтаФорма, ДопПараметры);
			ПоказатьВопрос(ОповещениеПослеВопроса,"Выйти без сохранения?", Режим, 0);
		#КонецЕсли

	ИначеЕсли ЗакрытьБезСохранения Тогда
		Закрыть(Неопределено);
	Иначе 
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОбработчикЗавершения = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПослеЗакрытия", ЭтаФорма);
	НовыйОтложенноеДействие = МодульОбъектаКлиент().НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения", ОбработчикЗавершения));
	МодульОбъектаКлиент().ПодключитьОтложенноеДействие(НовыйОтложенноеДействие);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытия(Аргумент = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	// Для толстого клиента оповещения вызываются вручную, так заведено
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если Не ОписаниеОповещенияОЗакрытии = Неопределено Тогда
			МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(ПараметрыФормы.Результат, ОписаниеОповещенияОЗакрытии);
		КонецЕсли;
	#КонецЕсли
	
	ПараметрыФормы.Очистить();
	ОписаниеОповещенияОЗакрытии	= Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СписокОшибок = ПроверитьЗаполнениеДанныхНоменклатур1С();
	
	ИмеютсяИзмененияСопоставленнойНоменклатуры = Номенклатуры1СИзменены();
	
	Если НЕ ИмеютсяИзмененияСопоставленнойНоменклатуры Тогда
		Закрыть(Неопределено);
	ИначеЕсли НЕ ДанныеРучногоСопоставления.Свойство("НеобходимоСопоставление") Тогда
		ДанныеРучногоСопоставления.Вставить("НеобходимоСопоставление", Истина);      
	Иначе
		ДанныеРучногоСопоставления.НеобходимоСопоставление = Истина;
	КонецЕсли;	
	
	Если НЕ СписокОшибок.Количество() Тогда 
		
		ЗаполнитьРезультатРучногоСопоставления(ДанныеРучногоСопоставления);
				
		ТабличнаяЧасть.Очистить();
		
		ДанныеПоСтрокеСопоставления = Новый Структура;
		НаименованиеБезопасное = ПолучитьБезопасноеНаименование(ДанныеРучногоСопоставления.НоменклатураСБИС.Наименование);
		ДанныеПоСтрокеСопоставления.Вставить(НаименованиеБезопасное, ДанныеРучногоСопоставления);
		
		СохранениеПроведено = Истина;
		ПараметрыФормы.Результат = ДанныеПоСтрокеСопоставления;
		Закрыть(ДанныеПоСтрокеСопоставления);
	
	Иначе
		
		Сообщить("Имеются ошибки, которые необходимо исправить перед сохранением результата:");
		Для Каждого Ошибка Из СписокОшибок Цикл
			Сообщить(Ошибка + Символы.ПС);
		КонецЦикла;	
		Возврат;
	   
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьКоличествоПриИзменении(Элемент)
	ТабЧастьТекДанные = МестныйКэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные;
	Если ЗначениеЗаполнено(ТабЧастьТекДанные.Цена) Тогда
		ТабЧастьТекДанные.Сумма = ТабЧастьТекДанные.Количество * ТабЧастьТекДанные.Цена;
	КонецЕсли;

	ПеречистатьСуммыПоСтрокам();	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьЦенаПриИзменении(Элемент)
	
	ТабЧастьТекДанные = МестныйКэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные;
	Если ЗначениеЗаполнено(ТабЧастьТекДанные.Количество) Тогда
		ТабЧастьТекДанные.Сумма = ТабЧастьТекДанные.Количество * ТабЧастьТекДанные.Цена;
	КонецЕсли;
	ПеречистатьСуммыПоСтрокам();
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьСуммаНДСПриИзменении(Элемент)
	ПеречистатьСуммыПоСтрокам();
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьСуммаПриИзменении(Элемент)
	
	ТабЧастьТекДанные = МестныйКэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные;
	Если ЗначениеЗаполнено(ТабЧастьТекДанные.Количество) И ЗначениеЗаполнено(ТабЧастьТекДанные.Количество) Тогда
		ТабЧастьТекДанные.Цена = ТабЧастьТекДанные.Сумма / ТабЧастьТекДанные.Количество;
	КонецЕсли;

	ПеречистатьСуммыПоСтрокам();
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПриАктивизацииЯчейки(Элемент)
	
	ИмяЯчейки = Элемент.ТекущийЭлемент.Имя;  
	Если ТабличнаяЧасть.Количество() И ИмяЯчейки = "ТабличнаяЧастьЕдиницыПредставление" Тогда
		СтандартнаяОбработка = Ложь;
		ПодборЕдиницИзмерения();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьКоэффициентПриИзменении(Элемент)  

	СтрокаДляПересчета = МестныйКэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные; 
	ПроизвестиПересчетПоКоэффициентуЕдиницИзмерения(СтрокаДляПересчета);

КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьНоменклатураПриИзменении(Элемент)
	
	ТабЧастьТекДанные = МестныйКэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные;
	ВыбраннаяНоменклатура = ТабЧастьТекДанные.Номенклатура;
	
	СопоставлениеДляЕдиницы = Новый Структура("Владелец, Единица", ВыбраннаяНоменклатура, Неопределено); 
	КлючПоиска = "Единица";
	НайденнаяЕдиницы = МодульОбъектаКлиент().СопоставлениеДляЕдиницыКлиент_Получить(СопоставлениеДляЕдиницы, КлючПоиска);
	ПослеВыбораЕдиницИзмерения(НайденнаяЕдиницы, Новый Структура("НайденоВНоменклатуре", Истина));

КонецПроцедуры
