&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ СохранениеПроведено
		И НЕ ИмеютсяИзмененияСопоставленнойНоменклатуры Тогда
		ЗакрытьБезСохранения = Истина;
		Закрыть(Неопределено);
	ИначеЕсли НЕ СохранениеПроведено 
		И НЕ ЗакрытьБезСохранения
		И ИмеютсяИзмененияСопоставленнойНоменклатуры Тогда
		Отказ = Истина; 
		Режим = РежимДиалогаВопрос.ДаНет;
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ЗакрытьБезСохранения", ЗакрытьБезСохранения); 
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Ответ = Вопрос("Выйти без сохранения?", Режим, 0);	
			ПослеВопросаОЗакрытии(Ответ, ДопПараметры);
		#Иначе   
			ОповещениеПослеВопроса = Новый ОписаниеОповещения("ПослеВопросаОЗакрытии",ЭтаФорма, ДопПараметры);
			ПоказатьВопрос(ОповещениеПослеВопроса,"Выйти без сохранения?", Режим, 0);
		#КонецЕсли

	ИначеЕсли ЗакрытьБезСохранения Тогда
		Закрыть(Неопределено);
	Иначе 
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОбработчикЗавершения = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПослеЗакрытия", ЭтаФорма);
	НовыйОтложенноеДействие = МодульОбъектаКлиент().НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения", ОбработчикЗавершения));
	МодульОбъектаКлиент().ПодключитьОтложенноеДействие(НовыйОтложенноеДействие);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытия(Аргумент = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	// Для толстого клиента оповещения вызываются вручную, так заведено
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если Не ОписаниеОповещенияОЗакрытии = Неопределено Тогда
			МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(ПараметрыФормы.Результат, ОписаниеОповещенияОЗакрытии);
		КонецЕсли;
	#КонецЕсли
	
	ПараметрыФормы.Очистить();
	ОписаниеОповещенияОЗакрытии	= Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СписокОшибок = ПроверитьЗаполнениеДанныхНоменклатур1С();
	
	ИмеютсяИзмененияСопоставленнойНоменклатуры = Номенклатуры1СИзменены();
	
	Если НЕ ИмеютсяИзмененияСопоставленнойНоменклатуры Тогда
		Закрыть(Неопределено);
		Возврат;
	ИначеЕсли НЕ ДанныеРучногоСопоставления.Свойство("НеобходимоСопоставление") Тогда
		ДанныеРучногоСопоставления.Вставить("НеобходимоСопоставление", Истина);      
	Иначе
		ДанныеРучногоСопоставления.НеобходимоСопоставление = Истина;
	КонецЕсли;	
	
	Если НЕ СписокОшибок.Количество() Тогда 
		
		ЗаполнитьРезультатРучногоСопоставления(ДанныеРучногоСопоставления);
				
		ТабличнаяЧасть.Очистить();
				
		СохранениеПроведено = Истина;
		ПараметрыФормы.Результат = ДанныеРучногоСопоставления;
		Закрыть(ДанныеРучногоСопоставления);
	    Возврат;
		
	Иначе
		
		Сообщить("Имеются ошибки, которые необходимо исправить перед сохранением результата:");
		Для Каждого Ошибка Из СписокОшибок Цикл
			Сообщить(Ошибка + Символы.ПС);
		КонецЦикла;	
		Возврат;
	   
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьКоличествоПриИзменении(Элемент)
	
	ТабЧастьТекДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные;
	КоэффициентПриведения = КоэффициентПриведенияПоСтрокеТабЧасти(ТабЧастьТекДанные);
	
	Если ЗначениеЗаполнено(ТабЧастьТекДанные.Цена) Тогда
		Если ЦенаВключаетНДС Тогда
			ТабЧастьТекДанные.Сумма			= ТабЧастьТекДанные.Кол_во * ТабЧастьТекДанные.Цена;
			ТабЧастьТекДанные.СуммаБезНал	= ТабЧастьТекДанные.Сумма / КоэффициентПриведения;
		Иначе
			ТабЧастьТекДанные.СуммаБезНал	= ТабЧастьТекДанные.Кол_во * ТабЧастьТекДанные.Цена;
			ТабЧастьТекДанные.Сумма			= ТабЧастьТекДанные.СуммаБезНал * КоэффициентПриведения;
		КонецЕсли;
	КонецЕсли;
	
	ПересчитатьИспользованноеИДоступноеКоличествоПоДокументу();
	ПересчитатьНДСПоТекущейСтроке();
	ПеречистатьСуммыПоСтрокам();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьЦенаПриИзменении(Элемент)
	
	ТабЧастьТекДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные;
	
	КоэффициентПриведения = КоэффициентПриведенияПоСтрокеТабЧасти(ТабЧастьТекДанные);
	
	Если Не ЗначениеЗаполнено(ТабЧастьТекДанные.Кол_во) Тогда
		ТабЧастьТекДанные.Сумма			= 0;
		ТабЧастьТекДанные.ЦенаБезНДС	= 0;
	КонецЕсли;
	
	Если ЦенаВключаетНДС Тогда
		ТабЧастьТекДанные.Сумма			= ТабЧастьТекДанные.Кол_во * ТабЧастьТекДанные.Цена;
		ТабЧастьТекДанные.ЦенаБезНДС	= ОКР(ТабЧастьТекДанные.Цена / КоэффициентПриведения, 2, 1);
	Иначе
		ТабЧастьТекДанные.Сумма			= ТабЧастьТекДанные.Кол_во * ТабЧастьТекДанные.Цена * КоэффициентПриведения;
		ТабЧастьТекДанные.ЦенаБезНДС	= ТабЧастьТекДанные.Цена;
	КонецЕсли;
	ТабЧастьТекДанные.СуммаБезНал	= ТабЧастьТекДанные.Кол_во * ТабЧастьТекДанные.ЦенаБезНДС;
	
	ПересчитатьНДСПоТекущейСтроке();
	ПеречистатьСуммыПоСтрокам();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьСуммаПриИзменении(Элемент)
	
	ТабЧастьТекДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТабЧастьТекДанные.Кол_во) Тогда
		Если ЦенаВключаетНДС Тогда
			ТабЧастьТекДанные.Цена			= ТабЧастьТекДанные.Сумма / ТабЧастьТекДанные.Кол_во;
		Иначе
			КоэффициентПриведения = КоэффициентПриведенияПоСтрокеТабЧасти(ТабЧастьТекДанные);
			ТабЧастьТекДанные.СуммаБезНал	= Окр(ТабЧастьТекДанные.Сумма / КоэффициентПриведения, 2, 1);
			ТабЧастьТекДанные.Цена			= ТабЧастьТекДанные.СуммаБезНал / ТабЧастьТекДанные.Кол_во;
		КонецЕсли;
	КонецЕсли;

	ПересчитатьНДСПоТекущейСтроке();
	ПеречистатьСуммыПоСтрокам();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьКоэффициентПриИзменении(Элемент)  
	
	ТабЧастьТекДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные;
	
	Если ТабЧастьТекДанные.Коэффициент = 0 Тогда
		Сообщить("Коэффициент не может быть равен нулю");
		ТабЧастьТекДанные.Коэффициент = 1;
	КонецЕсли;
	
	ПроизвестиПересчетПоКоэффициентуЕдиницИзмерения(ТабЧастьТекДанные);
    ПересчитатьИспользованноеИДоступноеКоличествоПоДокументу();
	ПересчитатьНДСПоТекущейСтроке();
	ПеречистатьСуммыПоСтрокам();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьНоменклатураПриИзменении(Элемент)
	
	ТабЧастьТекДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные;
	ТабЧастьТекДанные.Характеристика = Неопределено;
	
	ВыбраннаяНоменклатура = ТабЧастьТекДанные.Номенклатура;
	СопоставлениеДляЕдиницы = Новый Структура("Владелец, Ссылка", ВыбраннаяНоменклатура, Неопределено); 
	КлючПоиска = "Единица";
	НайденнаяЕдиницы = МодульОбъектаКлиент().СопоставлениеДляЕдиницыКлиент_Получить(СопоставлениеДляЕдиницы, КлючПоиска);
	ПослеВыбораЕдиницИзмерения(НайденнаяЕдиницы, Новый Структура("НайденоВНоменклатуре", Истина));

КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НЕ НоваяСтрока Тогда
		Возврат;
	ИначеЕсли Копирование Тогда
		ПеречистатьСуммыПоСтрокам();
		Возврат;
	Иначе
		ТабЧастьТекДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные;
		
		ТабЧастьТекДанные.Цена = Цена;
		ТабЧастьТекДанные.Коэффициент = 1;
		ТабЧастЬТекДанные.КоэффициентБыл = 1;
		ТабЧастьТекДанные.Кол_во = ОсталосьКоличествоВБазовыхЕдиницах;
		ТабЧастьТекДанные.Сумма = ТабЧастьТекДанные.Кол_во * ТабЧастьТекДанные.Цена;
		ТабЧастьТекДанные.СтавкаНДС = СтавкаНДС;
		
		ОсталосьКоличествоВБазовыхЕдиницах = 0;
		
		ПересчитатьИспользованноеИДоступноеКоличествоПоДокументу();
		
		ПересчитатьНДСПоТекущейСтроке();
		ПеречистатьСуммыПоСтрокам();  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПослеУдаления(Элемент)
	
	ПересчитатьИспользованноеИДоступноеКоличествоПоДокументу();
	ПеречистатьСуммыПоСтрокам();
		
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НачалоВыбораХарактеристики(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьХарактеристикаНачалоВыбора_ОФ(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	НачалоВыбораХарактеристики(Элемент);
	
КонецПроцедуры

// Общая процедура выбора характеристики для ОФ и УФ
//
// Параметры:
//  Элемент  - Поле ввода/колонка табл. части
//
&НаКлиенте
Процедура НачалоВыбораХарактеристики(Элемент)

	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();

	ДоступныеТипы1С = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолей1С");
	
	ТабЧастьТекДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТабЧастьТекДанные.Номенклатура) Тогда
		Сообщить("Заполните номенклатуру");
		Возврат;
	КонецЕсли;
	
	Если Кэш.Ини.Конфигурация.Свойство("ИмяОтбораХарактеристики") Тогда
		ИмяОтбораХарактеристики = Кэш.ОбщиеФункции.РассчитатьЗначение("ИмяОтбораХарактеристики", Кэш.Ини.Конфигурация);
	Иначе
		ИмяОтбораХарактеристики = "Номенклатура";
	КонецЕсли;
	
	Если ДоступныеТипы1С.Свойство("Характеристика") Тогда
		СправочникХарактеристики = ДоступныеТипы1С.Характеристика.ТипыМассивСтрок[0];
		ИмяСправочникаХарактеристикиНоменклатуры = СокрЛП(Сред(СправочникХарактеристики, Найти(СправочникХарактеристики, ".")+1));
	ИначеЕсли Кэш.Ини.Конфигурация.Свойство("ХарактеристикиНоменклатуры") Тогда
		// оставлено для совместимости
		СправочникХарактеристики = Кэш.ОбщиеФункции.РассчитатьЗначение("ХарактеристикиНоменклатуры", Кэш.Ини.Конфигурация);
		ИмяСправочникаХарактеристикиНоменклатуры = СокрЛП(Сред(СправочникХарактеристики, Найти(СправочникХарактеристики, ".")+1));
	Иначе
		ИмяСправочникаХарактеристикиНоменклатуры = "ХарактеристикиНоменклатуры";
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Форма = Справочники[ИмяСправочникаХарактеристикиНоменклатуры].ПолучитьФормуВыбора(,Элемент);
		Форма.ПараметрВыборПоВладельцу = ТабЧастьТекДанные.Номенклатура;
		
    #Иначе
		
		ДопПараметры = Новый Структура();
		Если Лев(ИмяОтбораХарактеристики,6) = "Отбор." Тогда
			ИмяОтбора = Сред(ИмяОтбораХарактеристики, 7);
			ДопПараметры.Вставить("Отбор", Новый Структура(ИмяОтбора, ТабЧастьТекДанные.Номенклатура));
		Иначе
			ДопПараметры.Вставить(ИмяОтбораХарактеристики, ТабЧастьТекДанные.Номенклатура);
		КонецЕсли;
		
		Форма = ПолучитьФорму("Справочник." + ИмяСправочникаХарактеристикиНоменклатуры + ".ФормаВыбора", ДопПараметры, Элемент);
		
	#КонецЕсли
	
	Форма.Открыть();

КонецПроцедуры


