&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ СохранениеПроведено
		И НЕ ИмеютсяИзмененияСопоставленнойНоменклатуры Тогда
		ЗакрытьБезСохранения = Истина;
		Закрыть(Неопределено);
	ИначеЕсли НЕ СохранениеПроведено 
		И НЕ ЗакрытьБезСохранения
		И ИмеютсяИзмененияСопоставленнойНоменклатуры Тогда
		Отказ = Истина; 
		Режим = РежимДиалогаВопрос.ДаНет;
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ЗакрытьБезСохранения", ЗакрытьБезСохранения); 
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Ответ = Вопрос("Выйти без сохранения?", Режим, 0);	
			ПослеВопросаОЗакрытии(Ответ, ДопПараметры);
		#Иначе   
			ОповещениеПослеВопроса = Новый ОписаниеОповещения("ПослеВопросаОЗакрытии",ЭтаФорма, ДопПараметры);
			ПоказатьВопрос(ОповещениеПослеВопроса,"Выйти без сохранения?", Режим, 0);
		#КонецЕсли

	ИначеЕсли ЗакрытьБезСохранения Тогда
		Закрыть(Неопределено);
	Иначе 
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОбработчикЗавершения = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПослеЗакрытия", ЭтаФорма);
	НовыйОтложенноеДействие = МодульОбъектаКлиент().НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения", ОбработчикЗавершения));
	МодульОбъектаКлиент().ПодключитьОтложенноеДействие(НовыйОтложенноеДействие);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытия(Аргумент = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	// Для толстого клиента оповещения вызываются вручную, так заведено
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если Не ОписаниеОповещенияОЗакрытии = Неопределено Тогда
			МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(ПараметрыФормы.Результат, ОписаниеОповещенияОЗакрытии);
		КонецЕсли;
	#КонецЕсли
	
	ПараметрыФормы.Очистить();
	ОписаниеОповещенияОЗакрытии	= Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СписокОшибок = ПроверитьЗаполнениеДанныхНоменклатур1С();
	
	ИмеютсяИзмененияСопоставленнойНоменклатуры = Номенклатуры1СИзменены();
	
	Если НЕ ИмеютсяИзмененияСопоставленнойНоменклатуры Тогда
		Закрыть(Неопределено);
		Возврат;
	ИначеЕсли НЕ ДанныеРучногоСопоставления.Свойство("НеобходимоСопоставление") Тогда
		ДанныеРучногоСопоставления.Вставить("НеобходимоСопоставление", Истина);      
	Иначе
		ДанныеРучногоСопоставления.НеобходимоСопоставление = Истина;
	КонецЕсли;	
	
	Если НЕ СписокОшибок.Количество() Тогда 
		
		ЗаполнитьРезультатРучногоСопоставления(ДанныеРучногоСопоставления);
				
		ТабличнаяЧасть.Очистить();
				
		СохранениеПроведено = Истина;
		ПараметрыФормы.Результат = ДанныеРучногоСопоставления;
		Закрыть(ДанныеРучногоСопоставления);
	    Возврат;
		
	Иначе
		
		Сообщить("Имеются ошибки, которые необходимо исправить перед сохранением результата:");
		Для Каждого Ошибка Из СписокОшибок Цикл
			Сообщить(Ошибка + Символы.ПС);
		КонецЦикла;	
		Возврат;
	   
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьКоличествоПриИзменении(Элемент)
	
	Если Не ОтключитьАвтоматическийПересчет Тогда
		
		ТабЧастьТекДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные;
		КоэффициентПриведения	= КоэффициентПриведенияНДС(ТабЧастьТекДанные.СтавкаНДС);
		
		Если ЗначениеЗаполнено(ТабЧастьТекДанные.Цена) Тогда
			Если ЦенаВключаетНДС Тогда
				ТабЧастьТекДанные.Сумма			= ТабЧастьТекДанные.Кол_во * ТабЧастьТекДанные.Цена;
			Иначе
				Если НДССверху Тогда
					ЦенаСНДС = ТабЧастьТекДанные.Цена * КоэффициентПриведения;
				Иначе
					ЦенаСНДС = Окр(ТабЧастьТекДанные.Цена * КоэффициентПриведения, 2, 1);
				КонецЕсли;
				ТабЧастьТекДанные.Сумма			= ТабЧастьТекДанные.Кол_во * ЦенаСНДС;
			КонецЕсли;
			ТабЧастьТекДанные.СуммаБезНал		= Окр(ТабЧастьТекДанные.Сумма / КоэффициентПриведения, 2, 1);
		КонецЕсли;
		
		ПересчитатьНДСПоТекущейСтроке();
		
	КонецЕсли;
	
	ПересчитатьИспользованноеИДоступноеКоличествоПоДокументу();
	ПеречистатьСуммыПоСтрокам();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьЦенаПриИзменении(Элемент)
	
	Если Не ОтключитьАвтоматическийПересчет Тогда
		
		ТабЧастьТекДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные;
		
		КоэффициентПриведения = КоэффициентПриведенияНДС(ТабЧастьТекДанные.СтавкаНДС);
		
		Если Не ЗначениеЗаполнено(ТабЧастьТекДанные.Кол_во) Тогда
			ТабЧастьТекДанные.Сумма			= 0;
		КонецЕсли;
		
		Если ЦенаВключаетНДС Тогда
			ТабЧастьТекДанные.Сумма			= ТабЧастьТекДанные.Кол_во * ТабЧастьТекДанные.Цена;
		Иначе
			Если НДССверху Тогда
				ЦенаСНДС = ТабЧастьТекДанные.Цена * КоэффициентПриведения;
			Иначе
				ЦенаСНДС = Окр(ТабЧастьТекДанные.Цена * КоэффициентПриведения, 2, 1);
			КонецЕсли;
			ТабЧастьТекДанные.Сумма			= ТабЧастьТекДанные.Кол_во * ЦенаСНДС;
		КонецЕсли;
		ТабЧастьТекДанные.СуммаБезНал	=	Окр(ТабЧастьТекДанные.Сумма / КоэффициентПриведения, 2, 1);
		
		ПересчитатьНДСПоТекущейСтроке();
		
	КонецЕсли;
	
	ПеречистатьСуммыПоСтрокам();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьСуммаПриИзменении(Элемент)
	
	Если Не ОтключитьАвтоматическийПересчет Тогда
		
		ТабЧастьТекДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные;
		
		Если ЗначениеЗаполнено(ТабЧастьТекДанные.Кол_во) Тогда
			Если ЦенаВключаетНДС Тогда
				ТабЧастьТекДанные.Цена			= ТабЧастьТекДанные.Сумма / ТабЧастьТекДанные.Кол_во;
			Иначе
				КоэффициентПриведения	= КоэффициентПриведенияНДС(ТабЧастьТекДанные.СтавкаНДС);
				СтавкаНДСЧислом			= СтавкаНДСЧислом(ТабЧастьТекДанные.СтавкаНДС);
				Если Не ЗначениеЗаполнено(СтавкаНДСЧислом) Тогда
					ЦенаСНДС			= ТабЧастьТекДанные.Сумма / ТабЧастьТекДанные.Кол_во;
				Иначе
					// Сделано для предпологаемой правильной последовательности расчета
					ЦенаСНДС			= ТабЧастьТекДанные.Сумма * СтавкаНДСЧислом / КоэффициентПриведения / ТабЧастьТекДанные.Кол_во;
				КонецЕсли;
				
				ТабЧастьТекДанные.СуммаБезНал	= Окр(ТабЧастьТекДанные.Сумма / КоэффициентПриведения, 2, 1);
				ТабЧастьТекДанные.Цена			= Окр(ЦенаСНДС / КоэффициентПриведения, 2, 1);
			КонецЕсли;
		КонецЕсли;

		ПересчитатьНДСПоТекущейСтроке();
		
	КонецЕсли;
	
	ПеречистатьСуммыПоСтрокам();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьКоэффициентПриИзменении(Элемент)  
	
	Если Не ОтключитьАвтоматическийПересчет Тогда
		
		ТабЧастьТекДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные;
		
		Если ТабЧастьТекДанные.Коэффициент = 0 Тогда
			Сообщить("Коэффициент не может быть равен нулю");
			ТабЧастьТекДанные.Коэффициент = 1;
		КонецЕсли;
		
		ПроизвестиПересчетПоКоэффициентуЕдиницИзмерения(ТабЧастьТекДанные);
		ПересчитатьИспользованноеИДоступноеКоличествоПоДокументу();
		ПересчитатьНДСПоТекущейСтроке();
		
	КонецЕсли;

	ПеречистатьСуммыПоСтрокам();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьСуммаНДСПриИзменении(Элемент)
	
	ПеречистатьСуммыПоСтрокам();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьНоменклатураПриИзменении(Элемент)
	
	ТабЧастьТекДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные;
	ТабЧастьТекДанные.Характеристика = Неопределено;
	
	НайденнаяЕдиница = МодульОбъектаКлиент().ПолучитьБазовуюЕдиницуДляНоменклатуры1СКлиент(ТабЧастьТекДанные.Номенклатура);

	ПослеВыбораЕдиницИзмерения(НайденнаяЕдиница);

КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НЕ НоваяСтрока Тогда
		Возврат;
	ИначеЕсли Копирование Тогда
		ПеречистатьСуммыПоСтрокам();
		Возврат;
	Иначе
		ТабЧастьТекДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные;
		
		ТабЧастьТекДанные.Цена				= Цена;
		ТабЧастьТекДанные.Коэффициент		= 1;
		ТабЧастЬТекДанные.КоэффициентБыл	= 1;
		ТабЧастьТекДанные.Кол_во			= ОсталосьКоличествоВБазовыхЕдиницах;
		ТабЧастьТекДанные.Сумма				= ТабЧастьТекДанные.Кол_во * ТабЧастьТекДанные.Цена;
		ТабЧастьТекДанные.СтавкаНДС			= СтавкаНДС;
		
		ОсталосьКоличествоВБазовыхЕдиницах = 0;
		
		ПересчитатьИспользованноеИДоступноеКоличествоПоДокументу();
		
		ПересчитатьНДСПоТекущейСтроке();
		ПеречистатьСуммыПоСтрокам();  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПослеУдаления(Элемент)
	
	ПересчитатьИспользованноеИДоступноеКоличествоПоДокументу();
	ПеречистатьСуммыПоСтрокам();
		
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НачалоВыбораХарактеристики(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьХарактеристикаНачалоВыбора_ОФ(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	НачалоВыбораХарактеристики(Элемент);
	
КонецПроцедуры

// Общая процедура выбора характеристики для ОФ и УФ
//
// Параметры:
//  Элемент  - Поле ввода/колонка табл. части
//
&НаКлиенте
Процедура НачалоВыбораХарактеристики(Элемент)

	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();

	ДоступныеТипы1С = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолей1С");
	
	ТабЧастьТекДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТабЧастьТекДанные.Номенклатура) Тогда
		Сообщить("Заполните номенклатуру");
		Возврат;
	КонецЕсли;
	
	Если Кэш.Ини.Конфигурация.Свойство("ИмяОтбораХарактеристики") Тогда
		ИмяОтбораХарактеристики = Кэш.ОбщиеФункции.РассчитатьЗначение("ИмяОтбораХарактеристики", Кэш.Ини.Конфигурация);
	Иначе
		ИмяОтбораХарактеристики = "Номенклатура";
	КонецЕсли;
	
	Если ДоступныеТипы1С.Свойство("Характеристика") Тогда
		СправочникХарактеристики = ДоступныеТипы1С.Характеристика.ТипыМассивСтрок[0];
		ИмяСправочникаХарактеристикиНоменклатуры = СокрЛП(Сред(СправочникХарактеристики, Найти(СправочникХарактеристики, ".")+1));
	ИначеЕсли Кэш.Ини.Конфигурация.Свойство("ХарактеристикиНоменклатуры") Тогда
		// оставлено для совместимости
		СправочникХарактеристики = Кэш.ОбщиеФункции.РассчитатьЗначение("ХарактеристикиНоменклатуры", Кэш.Ини.Конфигурация);
		ИмяСправочникаХарактеристикиНоменклатуры = СокрЛП(Сред(СправочникХарактеристики, Найти(СправочникХарактеристики, ".")+1));
	Иначе
		ИмяСправочникаХарактеристикиНоменклатуры = "ХарактеристикиНоменклатуры";
	КонецЕсли;
	
	Попытка
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			Форма = Справочники[ИмяСправочникаХарактеристикиНоменклатуры].ПолучитьФормуВыбора(,Элемент);
			Форма.ПараметрВыборПоВладельцу = ТабЧастьТекДанные.Номенклатура;
			Форма.ПараметрОтборПоВладельцу = ТабЧастьТекДанные.Номенклатура;
			
		#Иначе
			
			ДопПараметры = Новый Структура();
			Если Лев(ИмяОтбораХарактеристики,6) = "Отбор." Тогда
				ИмяОтбора = Сред(ИмяОтбораХарактеристики, 7);
				ДопПараметры.Вставить("Отбор", Новый Структура(ИмяОтбора, ТабЧастьТекДанные.Номенклатура));
			Иначе
				ДопПараметры.Вставить(ИмяОтбораХарактеристики, ТабЧастьТекДанные.Номенклатура);
			КонецЕсли;
			
			Форма = ПолучитьФорму("Справочник." + ИмяСправочникаХарактеристикиНоменклатуры + ".ФормаВыбора", ДопПараметры, Элемент);
			
		#КонецЕсли
		
		Форма.Открыть();		
		
	Исключение
		
		// Сообщаем о том, что для номенклатуры отключены характеристики. Другой ошибки быть не должно.
		ИнфоОбОшибке = ИнформацияОбОшибке();
		Сообщить(ИнфоОбОшибке.Описание, СтатусСообщения.Информация);
		
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ОтключитьАвтоматическийПересчетПриИзменении(Элемент)
	
	Если ОтключитьАвтоматическийПересчет Тогда
		ТолькоПросмотрДопПолейТЧ = Ложь;
	Иначе
		ТолькоПросмотрДопПолейТЧ = Истина;
	КонецЕсли;
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть.СуммаНДС").ТолькоПросмотр = ТолькоПросмотрДопПолейТЧ;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть.СуммаБезНал").ТолькоПросмотр = ТолькоПросмотрДопПолейТЧ;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

    // Закрытие формы при закрытии обработки    
    Если ИмяСобытия = "ЗакрытьСБИС" Тогда
        
        Если ЭтаФорма.Открыта() Тогда
            
            ЭтаФорма.Закрыть();
            
        КонецЕсли;
        
    КонецЕсли;
    
    
КонецПроцедуры

