
&НаКлиенте
Функция ПослеВопросаОЗакрытии(Результат, ДопПараметры) Экспорт
		
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗакрытьБезСохранения = Истина; 
		Закрыть(Неопределено);
	Иначе
		ЗакрытьБезСохранения = Ложь;
	КонецЕсли;	                      
	
	ДопПараметры.ЗакрытьБезСохранения = ЗакрытьБезСохранения;
	Возврат ДопПараметры.ЗакрытьБезСохранения;
	
КонецФункции

// Функция - Проверить наличие критических ошибок
// Проверяет наличие ошибок, при которых запрещено сохранять внесённые вручную изменения сопоставлений 
//
// Возвращаемое значение:
// Булево  - Наличие или отсутствие ошибок, при которых будем запрещать запись данных по сопоставлению
//
&НаКлиенте
Функция ПроверитьЗаполнениеДанныхНоменклатур1С()
	
	ОчиститьСообщения();
	СписокОшибок = Новый Массив; 
	СчетчикСтрок = 1;
	
	Для Каждого Строка Из ТабличнаяЧасть Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Номенклатура)
			И Не ЗначениеЗаполнено(Строка.Единицы) Тогда
			СписокОшибок.Добавить("Не заполнены Номенклатура и Единицы в строке №" + СчетчикСтрок);
		ИначеЕсли Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			СписокОшибок.Добавить("Не заполнена Номенклатура в строке №" + СчетчикСтрок);
		ИначеЕсли Не ЗначениеЗаполнено(Строка.Единицы) Тогда
			СписокОшибок.Добавить("Не заполнены Единицы в строке №" + СчетчикСтрок);
		КонецЕсли;                                                                 
		
		СчетчикСтрок = СчетчикСтрок + 1;
		
	КонецЦикла;
	
	Возврат СписокОшибок;
	
КонецФункции

&НаСервере
Функция ПустаяСсылкаИскомогоСправочника(ИмяСправочника)
	
	Возврат Справочники[ИмяСправочника].ПустаяСсылка();	
		
КонецФункции

&НаКлиенте
Процедура ПослеВыбораЕдиницИзмерения(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда 
		Возврат;
	КонецЕсли;
	
	ТабЧастьТекДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные; 
		
	ТабЧастьТекДанные.Единицы				= Результат;
	ТабЧастьТекДанные.БазоваяЕдиницаОКЕИ	= МодульОбъектаКлиент().ОКЕИБазовойЕдиницыНоменклатуры1С(Результат);
	
КонецПроцедуры

// Преобразует строку таблицы значений в структуру.
// Свойства структуры и их значения совпадают с колонками переданной строки.
//
// Параметры:
//  СтрокаТаблицыЗначений - СтрокаТаблицыЗначений
//
// Возвращаемое значение:
//  Структура - преобразованная строка таблицы значений.
//
&НаСервере
Функция СтрокаТаблицыЗначенийВСтруктуру_Вызов(СтрокаТаблицыЗначений)
	
	Возврат МодульОбъектаСервер().СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыЗначений);
	
КонецФункции

&НаКлиенте
Функция КоэффициентПриведенияНДС(СтавкаНДС)
	
	СтавкаНДСЧислом = СтавкаНДСЧислом(СтавкаНДС);
	
	Если ЗначениеЗаполнено(СтавкаНДСЧислом) Тогда
		КоэффициентПриведения = СтавкаНДСЧислом + 1;
	Иначе
		КоэффициентПриведения = 1;
	КонецЕсли;
	
	Возврат КоэффициентПриведения;
	
КонецФункции

&НаКлиенте
Функция СтавкаНДСЧислом(СтавкаНДС)

	Если ЗначениеЗаполнено(СтавкаНДС) И НЕ Найти(СтавкаНДС, "НДС") Тогда
		
		Если Найти(СтавкаНДС, "%") Тогда
			СтавкаНДСВПроцентах = Число(СокрЛП(СтрЗаменить(СтавкаНДС, "%", "")));
		ИначеЕсли Найти(СтавкаНДС, "/") Тогда    
			ДлинаСтроки = СтрДлина(СтавкаНДС);
			ПозицияРазделителя = Найти(СтавкаНДС, "/");
			Числитель = Число(Лев(СтавкаНДС, ПозицияРазделителя - 1)); 
			Знаменатель = Число(Сред(СтавкаНДС, ПозицияРазделителя + 1, ДлинаСтроки - ПозицияРазделителя));
			СтавкаНДСВПроцентах = (Числитель / Знаменатель) * 100; 
		Иначе
			СтавкаНДСВПроцентах = Число(СтавкаНДС);
		КонецЕсли;
		
		СтавкаНДСЧислом = СтавкаНДСВПроцентах / 100;
		
	Иначе
		
		СтавкаНДСЧислом = 0;
		
	КонецЕсли;
	
	
	Возврат СтавкаНДСЧислом;
	

КонецФункции

&НаКлиенте
Процедура ПеречистатьСуммыПоСтрокам()
	
	СуммаВсего 	  = 0;
	СуммаНДСВсего = 0;
	
	Для Каждого Строка Из ТабличнаяЧасть Цикл
		СуммаВсего = СуммаВсего + Строка.Сумма;
		СуммаНДСВсего = СуммаНДСВсего + Строка.СуммаНДС;
	КонецЦикла;
	
	ОписаниеСуммаВсегоИзменить = Новый ФиксированнаяСтруктура("Форма, Реквизит", ЭтаФорма, "СуммаВсего");
	ОписаниеСуммаНДСВсегоИзменить = Новый ФиксированнаяСтруктура("Форма, Реквизит", ЭтаФорма, "СуммаНДСВсего");
	ПараметрыИзменить = Новый Структура("ЦветФона, Подсказка");
	
	Если НЕ СуммаВсего = СуммаПоДокументу Тогда
		ПараметрыИзменить.ЦветФона  = WebЦвета.Коралловый;
		ПараметрыИзменить.Подсказка = "Не сходится сумма по документу(" + СуммаПоДокументу + ") и сумма по строкам сопоставления(" + СуммаВсего + ")";
	Иначе
		ПараметрыИзменить.ЦветФона  = WebЦвета.НейтральноВесеннеЗеленый;
		ПараметрыИзменить.Подсказка = "";
	КонецЕсли;
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеСуммаВсегоИзменить, ПараметрыИзменить);
	
	Если НЕ СуммаНДСВсего = СуммаНДСПоДокументу Тогда 
		ПараметрыИзменить.ЦветФона  = WebЦвета.Коралловый;
		ПараметрыИзменить.Подсказка = "Не сходится сумма НДС по документу(" + СуммаНДСПоДокументу + ") и сумма НДС по строкам сопоставления(" + СуммаНДСВсего + ")";
	Иначе
		ПараметрыИзменить.ЦветФона  = WebЦвета.НейтральноВесеннеЗеленый;
		ПараметрыИзменить.Подсказка = "";
	КонецЕсли;
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеСуммаНДСВсегоИзменить, ПараметрыИзменить);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьНДСПоТекущейСтроке()
	
	ТабЧастьТекДанные = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть").ТекущиеДанные;
	
	Если ТабЧастьТекДанные.Сумма = 0
			И НЕ ЗначениеЗаполнено(ТабЧастьТекДанные.СтавкаНДС) Тогда
		ТабЧастьТекДанные.СуммаНдс 	  = 0;
		ТабЧастьТекДанные.СуммаБезНал = 0;
		Возврат;
	КонецЕсли;
	
	КоэффициентПриведения = КоэффициентПриведенияНДС(ТабЧастьТекДанные.СтавкаНДС);
	
	ТабЧастьТекДанные.СуммаБезНал	= Окр(ТабЧастьТекДанные.Сумма / КоэффициентПриведения, 2, 1);
	ТабЧастьТекДанные.СуммаНДС		= Окр(ТабЧастьТекДанные.Сумма - ТабЧастьТекДанные.СуммаБезНал, 2, 1);
		
КонецПроцедуры  

// Процедура - Заполнить результат ручного сопоставления
// Внесение в класс сопоставления всех данных (изменённых и уже существовавших) номенклатур 1С из табличной части формы ручного сопоставления
//
// Параметры:
//  ДанныеРучногоСопоставления	 - Структура - Содержит массив данных класса сопоставления номенклатур по проекту расширенных проверок сопоставления номенклатур
//
&НаСервере
Процедура ЗаполнитьРезультатРучногоСопоставления(ДанныеРучногоСопоставления)
	
	МодульОбъектаСервер = МодульОбъектаСервер();
	
	Если ТипЗнч(ТабличнаяЧасть) = Тип("ТаблицаЗначений") Тогда
		ТаблицаНоменклатур1С = ТабличнаяЧасть;
	Иначе
		ТаблицаНоменклатур1С = ТабличнаяЧасть.Выгрузить();
	КонецЕсли;
	
	ДанныеНоменклатуры1С = Новый Структура; 
	
	ДанныеРучногоСопоставления.Номенклатура1С.Очистить();
	
	ОсновнаяЕдиницаСопоставления = Истина;
	ОсновноеСопоставлениеНайдено = Ложь;
	
	Для Каждого Номенклатура1С Из ТаблицаНоменклатур1С Цикл 	
		
		ДанныеНоменклатуры1С = СтрокаТаблицыЗначенийВСтруктуру_Вызов(Номенклатура1С);
		
		Если ОсновнаяЕдиницаСопоставления Тогда
			МодульОбъектаСервер.СтрокаСопоставленияСБИССервер_Вставить(ДанныеРучногоСопоставления, "БазоваяЕдиницаОКЕИ", ДанныеНоменклатуры1С.БазоваяЕдиницаОКЕИ);
			ОсновнаяЕдиницаСопоставления = Ложь;
		КонецЕсли;
		
		ВходящиеДанные = Новый Структура("Источник", Номенклатура1С.Единицы);      
		ДопПараметры = Новый Структура("ТипИсточника", "Ссылка");
		СтруктураЕдиницы = МодульОбъектаСервер.НовыйСопоставлениеДляЕдиницыСервер(ВходящиеДанные, ДопПараметры);
		МодульОбъектаСервер.СопоставлениеДляЕдиницыСервер_Вставить(СтруктураЕдиницы, "Владелец", Номенклатура1С.Номенклатура);
		
		
		Если ЗначениеЗаполнено(Номенклатура1С.Коэффициент) Тогда
			СтруктураЕдиницы.Коэффициент = Номенклатура1С.Коэффициент;
		КонецЕсли;
		
		ДанныеНоменклатуры1С.Удалить("Единицы");
		ДанныеНоменклатуры1С.Вставить("ЕдИзм1С", Новый Соответствие);
		ДанныеНоменклатуры1С.ЕдИзм1С.Вставить(Номенклатура1С.Единицы, СтруктураЕдиницы);                                                                                                                                       
		
		Если ЗначениеЗаполнено(ДанныеНоменклатуры1С.Кол_во) 
			И НЕ ОсновноеСопоставлениеНайдено Тогда
			ДанныеНоменклатуры1С.Вставить("Основное", Истина);
		    ОсновноеСопоставлениеНайдено = Истина;
		КонецЕсли;
		
		СтрНоменклатура1С = ДанныеРучногоСопоставления.Номенклатура1С.Получить(ДанныеНоменклатуры1С.Номенклатура);
		Если СтрНоменклатура1С = Неопределено Тогда
			СтрНоменклатура1С = МодульОбъектаСервер.НовыйОписаниеНоменклатуры1ССервер();
		КонецЕсли;
		
		МодульОбъектаСервер.ОписаниеНоменклатуры1ССервер_Заполнить(СтрНоменклатура1С, ДанныеНоменклатуры1С);
		МодульОбъектаСервер.СтрокаСопоставленияСБИССервер_Вставить(ДанныеРучногоСопоставления, СтрНоменклатура1С.Ссылка, СтрНоменклатура1С);	
	КонецЦикла;  
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДляЗагрузкиВДокумент1С(ДанныеРучногоСопоставления, ДанныеНоменклатуры1С)
	
	ТекущаяСтрокаНоменклатуры1С = Неопределено;                                                                                       
	
	НоменклатураСсылка = ДанныеНоменклатуры1С;  
	ТекущиеДанныеНоменклатуры = ДанныеРучногоСопоставления.Номенклатура1С.Получить(НоменклатураСсылка); 
	ПараметрыОтбора = Новый Структура("Номенклатура", ДанныеНоменклатуры1С); 
	ТекущаяСтрокаНоменклатуры1С = ТабличнаяЧасть.НайтиСтроки(ПараметрыОтбора)[0];
	ЗаполнитьЗначенияСвойств(ТекущаяСтрокаНоменклатуры1С, ТекущиеДанныеНоменклатуры); 
	
	ТекущаяСтрокаНоменклатуры1С.Кол_во		= ТекущиеДанныеНоменклатуры.Кол_во; 
	ТекущаяСтрокаНоменклатуры1С.СтавкаНДС	= СтавкаНДС; 
	ТекущаяСтрокаНоменклатуры1С.СуммаБезНал	= ТекущиеДанныеНоменклатуры.СуммаБезНал;
	
	Если ТекущиеДанныеНоменклатуры.Характеристики.Количество() Тогда
		ТекущаяСтрокаНоменклатуры1С.Характеристика = ТекущиеДанныеНоменклатуры.Характеристики[0];
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Произвести пересчет по коэффициенту единиц измерения
//
// Параметры:
//  СтрокаДляПересчета	 - Строка табличной части	 - Строка в которой будет вестить пересчет
//  КоэффициентПересчета - Число	 - На это число будет умножено количество 
//
&НаКлиенте
Процедура ПроизвестиПересчетПоКоэффициентуЕдиницИзмерения(СтрокаДляПересчета)
	
	СтрокаДляПересчета.Кол_во	= СтрокаДляПересчета.Кол_во * (СтрокаДляПересчета.Коэффициент / СтрокаДляПересчета.КоэффициентБыл);
	
	Если Не СтрокаДляПересчета.Кол_во = 0 Тогда
		Кол_воРасчетЦены = СтрокаДляПересчета.Кол_во;
	Иначе
		Кол_воРасчетЦены = 1;
	КонецЕсли;
	
	Если ЦенаВключаетНДС Тогда
		СтрокаДляПересчета.Цена	= Окр(СтрокаДляПересчета.Сумма / Кол_воРасчетЦены, 2, 1);
	Иначе
		СтрокаДляПересчета.Цена	= Окр(СтрокаДляПересчета.СуммаБезНал / Кол_воРасчетЦены, 2, 1);
	КонецЕсли;
	
	СтрокаДляПересчета.КоэффициентБыл = СтрокаДляПересчета.Коэффициент;
	ПеречистатьСуммыПоСтрокам();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИспользованноеИДоступноеКоличествоПоДокументу()
	
	ЗарезервированноеКоличествоВБазовыхЕдиницах = 0;
	ОсталосьКоличествоВБазовыхЕдиницах = 0;
	
	// Расчёт "Осталось" для определения доступного количества в базовых единицах
	Для Каждого Строка Из ТабличнаяЧасть Цикл
		
		Если Строка.Коэффициент = 0 Тогда
			Строка.Коэффициент 	  = 1;
			Строка.КоэффициентБыл = 1;
		КонецЕсли;
		
		ЗарезервированноеКоличествоВБазовыхЕдиницах = ЗарезервированноеКоличествоВБазовыхЕдиницах + Строка.Кол_во / Строка.Коэффициент; 		
		
	КонецЦикла;
	Если КоэффициентСБИС = 0 Тогда
		КоэффициентСБИС = 1;
	КонецЕсли;
	ОсталосьКоличествоВБазовыхЕдиницах = КоличествоСБИС / КоэффициентСБИС - ЗарезервированноеКоличествоВБазовыхЕдиницах;
		
	КоличествоПоДокументуСходитсяСТабличнойЧастью = ОсталосьКоличествоВБазовыхЕдиницах = 0 И ЗарезервированноеКоличествоВБазовыхЕдиницах = КоличествоСБИС / КоэффициентСБИС;

	ОписаниеРаспределеноИзменить = Новый ФиксированнаяСтруктура("Форма, Реквизит", ЭтаФорма, "ЗарезервированноеКоличествоВБазовыхЕдиницах");
	ПараметрыРаспределеноИзменить = Новый Структура("ЦветФона, Подсказка");
	ОписаниеОсталосьИзменить = Новый ФиксированнаяСтруктура("Форма, Реквизит", ЭтаФорма, "ОсталосьКоличествоВБазовыхЕдиницах");
	ПараметрыОсталосьИзменить = Новый Структура("ЦветФона, Подсказка");
	
	Если КоличествоПоДокументуСходитсяСТабличнойЧастью Тогда
		
		ПараметрыРаспределеноИзменить.ЦветФона	= WebЦвета.НейтральноВесеннеЗеленый;
		ПараметрыРаспределеноИзменить.Подсказка	= "";
		ПараметрыОсталосьИзменить.ЦветФона		= WebЦвета.НейтральноВесеннеЗеленый; 
		ПараметрыОсталосьИзменить.Подсказка		= "";
		
	Иначе
		
		ПараметрыРаспределеноИзменить.ЦветФона	= WebЦвета.Коралловый;
		ПараметрыРаспределеноИзменить.Подсказка	= "Разница количества в базовых единицах по документу и по строкам табличной части: " + (КоличествоСБИС / КоэффициентСБИС - ЗарезервированноеКоличествоВБазовыхЕдиницах);
		ПараметрыОсталосьИзменить.ЦветФона		= WebЦвета.Коралловый;
		ПараметрыОсталосьИзменить.Подсказка		= "Разница количества в базовых единицах по документу и по строкам табличной части: " + (КоличествоСБИС / КоэффициентСБИС - ЗарезервированноеКоличествоВБазовыхЕдиницах);
		
	КонецЕсли;
	
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеРаспределеноИзменить, ПараметрыРаспределеноИзменить);
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеОсталосьИзменить, ПараметрыОсталосьИзменить);
	
КонецПроцедуры

&НаСервере
Функция Номенклатуры1СИзменены()
	
	Если ТипЗнч(ТабличнаяЧасть) = Тип("ТаблицаЗначений") Тогда
		ТаблицаНоменклатур1С = ТабличнаяЧасть;
	Иначе
		ТаблицаНоменклатур1С = ТабличнаяЧасть.Выгрузить();
	КонецЕсли; 
	
	Если ТаблицаНоменклатур1С.Количество() <> ДанныеРучногоСопоставления.Номенклатура1С.Количество() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Каждого СопоставленнаяНоменклатура1С Из ДанныеРучногоСопоставления.Номенклатура1С Цикл
		
		СтрокаСНоменклатурой1С = ТаблицаНоменклатур1С.Найти(СопоставленнаяНоменклатура1С.Ключ, "Номенклатура");
		
		Если СтрокаСНоменклатурой1С = Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаСНоменклатурой1С.Единицы) 
			И НЕ СопоставленнаяНоменклатура1С.Значение.Единицы.Количество() Тогда
			Возврат Истина;
		КонецЕсли;
		
		Для Каждого Единицы Из СопоставленнаяНоменклатура1С.Значение.Единицы Цикл
			Если СтрокаСНоменклатурой1С.Единицы <> Единицы.Ключ
				ИЛИ СтрокаСНоменклатурой1С.Коэффициент <> Единицы.Значение.Коэффициент Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаСНоменклатурой1С.Цена <> СопоставленнаяНоменклатура1С.Значение.Цена 
			ИЛИ СтрокаСНоменклатурой1С.Кол_во <> СопоставленнаяНоменклатура1С.Значение.Кол_во Тогда
			Возврат Истина;  
		КонецЕсли;
		
		Если СопоставленнаяНоменклатура1С.Значение.Характеристики.Количество() Тогда
			ХарактеристикаСопоставления = СопоставленнаяНоменклатура1С.Значение.Характеристики[0];
			Если СтрокаСНоменклатурой1С.Характеристика <> ХарактеристикаСопоставления Тогда
				Возврат Истина;
			КонецЕсли;
		ИначеЕсли НЕ СопоставленнаяНоменклатура1С.Значение.Характеристики.Количество()
			И ЗначениеЗаполнено(СтрокаСНоменклатурой1С.Характеристика) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

