////////////////////////////////////////////////////

&НаКлиенте
Процедура	Диалог_ОтменаНажатие(Элемент)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура	Диалог_ВыбратьНажатиеКнопка(Элемент)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		КлючЭлементов = "ТекущаяСтрока";
	#Иначе
		КлючЭлементов = "ТекущиеДанные";
	#КонецЕсли
	НажатиеВыполнено = Истина;
	ТекущаяСтраница = ЛокальныйКэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "ПанельВыбора").ТекущаяСтраница.Имя;
	Если ТекущаяСтраница = "user" Тогда
		АктивнаяПанель = ЛокальныйКэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "ТаблицаПользовательскихНастроек");
	Иначе
		АктивнаяПанель = ЛокальныйКэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "ТаблицаШаблоновНастроек");
	КонецЕсли;
	ЭтаФорма.Закрыть(АктивнаяПанель.ТекущиеДанные.Коннекшен[0].Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура	Диалог_ВыбратьНажатиеПоСтроке(Элемент)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		КлючЭлементов = "ТекущаяСтрока";
	#Иначе
		КлючЭлементов = "ТекущиеДанные";
	#КонецЕсли
	НажатиеВыполнено = Истина;
	ЭтаФорма.Закрыть(Элемент[КлючЭлементов].Коннекшен[0].Значение);
	
КонецПроцедуры

