
Функция НовыйГлобальныйКэш(ПараметрыКонструктора = Неопределено) Экспорт
	
	НовыйГлобальныйКэш						= Новый Структура("_класс, КэшНастроек, СБИС, Парам, ТекущийСеанс, ПараметрыСистемы, СовместимостьМетодов", "ГлобальныйКэш");
	НовыйГлобальныйКэш.СБИС					= НовыйКэшСБИС();
	НовыйГлобальныйКэш.ТекущийСеанс			= НовыйТекущийСеанс();
	НовыйГлобальныйКэш.Парам				= Новый Структура;
	НовыйГлобальныйКэш.ПараметрыСистемы		= ПолучитьПараметрыСистемы();
	НовыйГлобальныйКэш.СовместимостьМетодов	= НовыйСовместимостьМетодов(НовыйГлобальныйКэш.ПараметрыСистемы.Клиент.ВерсияПриложения);
		
	Возврат НовыйГлобальныйКэш;
	
КонецФункции

