
Функция НовыйГлобальныйКэш(ПараметрыКонструктора = Неопределено) Экспорт
	
	НовыйГлобальныйКэш = НовыйПрикладнойОбъектSABY("ГлобальныйКэш");
	
	НовыйГлобальныйКэш.Вставить("СБИС",					НовыйКэшСБИС());
	НовыйГлобальныйКэш.Вставить("ПараметрыСистемы",		ПолучитьПараметрыСистемы());
	НовыйГлобальныйКэш.Вставить("ТекущийСеанс",			НовыйТекущийСеанс(НовыйГлобальныйКэш));
	НовыйГлобальныйКэш.Вставить("КэшНастроек",			НовыйКэшНастроек());
	НовыйГлобальныйКэш.Вставить("Парам",				Новый Структура);
	НовыйГлобальныйКэш.Вставить("СовместимостьМетодов",	НовыйСовместимостьМетодов(НовыйГлобальныйКэш.ПараметрыСистемы));
		
	Возврат НовыйГлобальныйКэш;
	
КонецФункции

