Процедура ОбновитьПараметрГлобальногоМодуля(ИмяПараметраМодуля, ЗначениеПараметраМодуля) Экспорт
	
	Если		ИмяПараметраМодуля = "ГлавноеОкно"		Тогда
		
		ГлавноеОкно = ЗначениеПараметраМодуля;
		Возврат;
		
	ИначеЕсли 	ИмяПараметраМодуля = "ГлобальныйКэш"	Тогда
		
		ОбновитьПараметрГлобальногоМодуляДляСервера(ИмяПараметраМодуля, ЗначениеПараметраМодуля);
		ГлобальныйКэш = ЗначениеПараметраМодуля;
		Возврат;
	
	КонецЕсли;
	
	ЛокальныйКэш = ПолучитьТекущийЛокальныйКэш();
	
	Если		ИмяПараметраМодуля = "КэшНастроек"		Тогда
		
		ЛокальныйКэш.Вставить("КэшНастроек", ЗначениеПараметраМодуля);
		ГлобальныйКэш.КэшНастроек = ЗначениеПараметраМодуля;
		
	ИначеЕсли	ИмяПараметраМодуля = "РаботаСJSON"		Тогда
		
		ЛокальныйКэш[ИмяПараметраМодуля]	= ЗначениеПараметраМодуля;
		СбисРаботаСJSON						= ЗначениеПараметраМодуля;
		
	ИначеЕсли	ИмяПараметраМодуля = "Парам" Тогда
		
		ОбновитьПараметрГлобальногоМодуляДляСервера("Парам", ЗначениеПараметраМодуля);
		
		ГлобальныйКэш[ИмяПараметраМодуля]	= ЗначениеПараметраМодуля;
		ЛокальныйКэш[ИмяПараметраМодуля]	= ЗначениеПараметраМодуля;
		
	ИначеЕсли	ИмяПараметраМодуля = "КэшНастроек"	Тогда
		
		ГлобальныйКэш[ИмяПараметраМодуля]	= ЗначениеПараметраМодуля;
		ЛокальныйКэш[ИмяПараметраМодуля]	= ЗначениеПараметраМодуля;
		
	ИначеЕсли	ИмяПараметраМодуля = "ФормаНастроек"	Тогда
		
		ГлобальныйКэш.ТекущийСеанс.Модули.Настройки	= ЗначениеПараметраМодуля;
		ЛокальныйКэш[ИмяПараметраМодуля]			= ЗначениеПараметраМодуля;
		
	ИначеЕсли	ИмяПараметраМодуля = "ФункцииДокументов"Тогда
		
		ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов	= ЗначениеПараметраМодуля;
		ЛокальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов	= ЗначениеПараметраМодуля;
		
	ИначеЕсли	ИмяПараметраМодуля = "ПараметрыСистемы"	Тогда
		
		ГлобальныйКэш.Вставить("ПараметрыСистемы", ЗначениеПараметраМодуля);
		ЛокальныйКэш.Вставить("ПараметрыСистемы", ЗначениеПараметраМодуля);
		
	ИначеЕсли	ИмяПараметраМодуля = "ДанныеИнтеграции"	Тогда
		
		ГлобальныйКэш.СБИС.ДанныеИнтеграции	= ЗначениеПараметраМодуля;	
		ЛокальныйКэш.СБИС.ДанныеИнтеграции	= ЗначениеПараметраМодуля;
		
	КонецЕсли;
	
КонецПроцедуры
