
// Процедура - изменить параметр обработки в объектах: ЛокальныйКэш, ГлобальныйКэш, ТекущийСеанс, КэшСБИС.
//
// Параметры:
//  ОписаниеПараметра	 - Структура/ФиксированнаяСтруктура/КлючЗначение	 - поля: "Ключ", "Значение", "Тип"
//  ДопПараметры		 - Структура/Неопределено	 - Расширение
//
&НаКлиенте
Процедура ИзменитьПараметрSABY_Описание(ОписаниеПараметра, ДопПараметры = Неопределено) Экспорт
	Перем ЗначениеПараметраSABY, ТипПараметраSABY, ДопПараметрыПродолжить;
	
	Если ТипЗнч(ОписаниеПараметра) = Тип("КлючИЗначение") Тогда
		
		ЗначениеПараметраSABY	= ОписаниеПараметра.Значение;
		ДопПараметрыПродолжить	= ДопПараметры;
		
	Иначе
		
		ОписаниеПараметра.Свойство("Тип",			ТипПараметраSABY);
		ОписаниеПараметра.Свойство("Значение",		ЗначениеПараметраSABY);
		Если Не ОписаниеПараметра.Свойство("ДопПараметры",	ДопПараметрыПродолжить) Тогда
			
			ДопПараметрыПродолжить = ДопПараметры;
			
		КонецЕсли;
		
	КонецЕсли;

	ИзменитьПараметрSABY(ОписаниеПараметра.Ключ, ЗначениеПараметраSABY, ТипПараметраSABY, ДопПараметрыПродолжить);
	
КонецПроцедуры
	
// Процедура - изменить параметр обработки в объектах: ЛокальныйКэш, ГлобальныйКэш, ТекущийСеанс, КэшСБИС.
//
// Параметры:
//  ОписаниеПараметра	 - Структура/ФиксированнаяСтруктура	 - поля: "Ключ", "Значение", "Тип"
//  ДопПараметры		 - 	 - 
//
&НаКлиенте
Процедура ИзменитьПараметрSABY(КлючПараметра, ЗначениеПараметра, ТипПараметра = Неопределено, ДопПараметры = Неопределено) Экспорт
	Перем ЗначениеДляЛокальноПрописать, ЭтоГлобальныйПараметр, ДопПараметрыИзменения, СерверныйПараметр;
	
	Если Не ДопПараметры = Неопределено Тогда
		
		ДопПараметры.Свойство("Кэш",		ЗначениеДляЛокальноПрописать);
		ДопПараметры.Свойство("Глобально",	ЭтоГлобальныйПараметр);
		ДопПараметры.Свойство("Параметры",	ДопПараметрыИзменения);
		ДопПараметры.Свойство("Серверный",	СерверныйПараметр);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СерверныйПараметр) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеДляЛокальноПрописать = Неопределено Тогда
		
		ЗначениеДляЛокальноПрописать = ПолучитьТекущийЛокальныйКэш();
		
	КонецЕсли;
	
	Если ЭтоГлобальныйПараметр = Неопределено Тогда
		
		ЭтоГлобальныйПараметр = Истина;
		
	КонецЕсли;
	
	Если ТипПараметра = Неопределено Тогда
		
		// Если не указывать тип параметра для изменения, то правка проходит с применением дополнительных обработчиков
		ИзменитьПараметрSABY_Общее(КлючПараметра, ЗначениеПараметра, ЗначениеДляЛокальноПрописать, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);
		
	ИначеЕсли ТипПараметра = "Сеанс" Тогда 
		
		ИзменитьПараметрSABY_ТекущийСеанс(КлючПараметра, ЗначениеПараметра, ЗначениеДляЛокальноПрописать, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);
		
	ИначеЕсли ТипПараметра = "Сбис" Тогда 
		
		ИзменитьПараметрSABY_Сбис(КлючПараметра, ЗначениеПараметра, ДопПараметрыИзменения);
		
	ИначеЕсли ТипПараметра = "Технический" Тогда 
		
		ИзменитьПараметрSABY_Технический(КлючПараметра, ЗначениеПараметра, ЗначениеДляЛокальноПрописать, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);	
		
	Иначе
		
		ОшибкаОбработкиПараметра = НовыйСбисИсключение("Неизвестный тип параметра!", МодульОбъектаКлиентСервер_Представление() + "ИзменитьПараметрSABY");
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаОбработкиПараметра);
		
	КонецЕсли;	
	
	// UAAРегла
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
		
		Если ЭтоГлобальныйПараметр Тогда
			
			ИзменитьПараметрСбис_ВызовСервера(КлючПараметра, ЗначениеПараметра, ДопПараметры);
			
		КонецЕсли;

	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПараметрSABY_Общее(ИмяПараметраСбис, ЗначениеПараметраСбис, ЗначениеКэшПрописать, ЭтоГлобальныйПараметр, ДопПараметрыИзменения)
	
	Если		ИмяПараметраСбис = "ТехническиеПараметры" Тогда 
		
		ОшибкаИзмененияПараметра = НовыйСбисИсключение(785, "ИзменитьПараметрSABY.Общее",,,"Запрещено изменение технического параметра.");
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаИзмененияПараметра);
		
	ИначеЕсли	ИмяПараметраСбис = "АдресСервера" Тогда 
		
		ИзменитьПараметрСбис_АдресСервера(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);

	ИначеЕсли	ИмяПараметраСбис = "ИспользоватьГенератор" Тогда
		
		ИзменитьПараметрСбис_ИспользоватьГенератор(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);
		
	ИначеЕсли	ИмяПараметраСбис = "СпособОбмена" Тогда
		
		ИзменитьПараметрСбис_СпособОбмена(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);

	ИначеЕсли	ИмяПараметраСбис = "СпособХраненияНастроек" Тогда
		
		ИзменитьПараметрСбис_СпособХраненияНастроек(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);

	ИначеЕсли	ИмяПараметраСбис = "СпособСопоставленияНоменклатуры" Тогда
		
		ИзменитьПараметрСбис_СпособСопоставленияНоменклатуры(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);	
		
	ИначеЕсли Не	ДопПараметрыИзменения = Неопределено
			И		ДопПараметрыИзменения.Свойство("Адрес") Тогда
		
		//В прописанное место
		АдресПараметра = ДопПараметрыИзменения.Адрес + "." + ИмяПараметраСбис;
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, АдресПараметра, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли	ИмяПараметраСбис = "Интеграция" Тогда
		
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, ИмяПараметраСбис,					ЗначениеПараметраСбис, Ложь);
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Модули.Интеграция",	ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		//Совместимость старой отправки.
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ФормаОтправки",					ЗначениеПараметраСбис, Ложь);
				
	ИначеЕсли	ИмяПараметраСбис = "ИнтеграцияИмя" Тогда
		
		ИзменитьПараметрСбис_ВКэш			(ЗначениеКэшПрописать, ИмяПараметраСбис,	ЗначениеПараметраСбис, Ложь);
		ИзменитьПараметрСбис_УстановитьВКэш	(ЗначениеКэшПрописать, ИмяПараметраСбис,	ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли	ИмяПараметраСбис = "КаталогНастроек" Тогда
		
		лПараметрыСистемы = ГлобальныйКэш_Получить("ПараметрыСистемы");
		Если лПараметрыСистемы.Конфигурация.Файловая Тогда
			
			КонтекстФормата = лПараметрыСистемы.Клиент;
			
		Иначе
			
			КонтекстФормата = лПараметрыСистемы.Сервер;
			
		КонецЕсли;
		
		ПараметрДляФормат	= Новый ФиксированнаяСтруктура("Контекст", КонтекстФормата);
		ФорматКаталог		= ПрименитьФорматКСтроке(ЗначениеПараметраСбис, ПараметрДляФормат, "Каталог");

        ИзменитьПараметрСбис("ИниВПорядке",	Ложь);
		
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать,	"Ини", Новый Структура);
		ИзменитьПараметрСбис_УстановитьВКэш(ЗначениеКэшПрописать, ИмяПараметраСбис,			ФорматКаталог, ЭтоГлобальныйПараметр);
		ИзменитьПараметрСбис_УстановитьВКэш(ЗначениеКэшПрописать, "ИдентификаторНастроек",	ФорматКаталог, ЭтоГлобальныйПараметр);
		
	ИначеЕсли	ИмяПараметраСбис = "ИниВПорядке" Тогда
		
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать,	"ИниВПорядке",				ЗначениеПараметраСбис,			Ложь);
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать,	"КэшНастроек.ИниВПорядке",	ЗначениеПараметраСбис);		

	ИначеЕсли	ИмяПараметраСбис = "ИмяМодуляРаботыСоСтатусами"
			Или	ИмяПараметраСбис = "ФормаРаботыСоСтатусами" Тогда
		
		ИзменитьПараметрСбис_ВКэш			(ЗначениеКэшПрописать, "ФормаРаботыСоСтатусами",		ЗначениеПараметраСбис, Ложь); // Костыль для старой совместимости
		ИзменитьПараметрСбис_УстановитьВКэш	(ЗначениеКэшПрописать, "ИмяМодуляРаботыСоСтатусами",	ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли	ИмяПараметраСбис = "ИмяМодуляРаботыСНоменклатурой"
			Или	ИмяПараметраСбис = "ФормаРаботыСНоменклатурой" Тогда
		
		ИзменитьПараметрСбис_ВКэш			(ЗначениеКэшПрописать, "ФормаРаботыСНоменклатурой",		ЗначениеПараметраСбис, Ложь); // Костыль для старой совместимости
		ИзменитьПараметрСбис_УстановитьВКэш	(ЗначениеКэшПрописать, "ИмяМодуляРаботыСНоменклатурой", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли ИмяПараметраСбис = "СостояниеЭД" Тогда
		
		ИзменитьПараметрСбис_СостояниеЭД(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);
		
	ИначеЕсли ИмяПараметраСбис = "НастройкиКриптографии" Тогда
		
		Если ЗначениеЗаполнено(ЗначениеПараметраСбис) Тогда
			
			ИмяМодуляКриптографии = "ЭлектроннаяПодписьНаКлиенте";
			Если ЗначениеПараметраСбис.ПодписьНаСервере Тогда
				
				ИмяМодуляКриптографии = "ЭлектроннаяПодписьНаСервере";
				
			КонецЕсли;
			
			МодульКриптографии = ПолучитьФормуОбработки(ИмяМодуляКриптографии);
			Кэш	= ПолучитьТекущийЛокальныйКэш();
			Кэш.Вставить("ФормаЭП", МодульКриптографии);
			ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Модули.Криптография1С", МодульКриптографии, Истина);
			ОписанияПрограммЭП = МодульКриптографии.сбисОписанияПрограмм(Кэш);
			
			ЗаписатьВХранилищеВызовСервера("Saby", "ОписанияПрограммЭП", ОписанияПрограммЭП);
		КонецЕсли;
	
		ИзменитьПараметрСбис_УстановитьВКэш(ЗначениеКэшПрописать, ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
				
	ИначеЕсли ИмяПараметраСбис = "Меркурий" Тогда
		
		ИзменитьПараметрСбис_Меркурий(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);
		
	ИначеЕсли ИмяПараметраСбис = "РежимОтладки" Тогда
		
		ФормаНастроекОбщая = ПараметрSABY("МодульУправленияНастройками", "Сеанс");
		ОбработчикЗаплаток = НовыйСбисОписаниеОповещения("ПереключитьЗаплаткиДляОтладки_Отложенно", ФормаНастроекОбщая);
		ПодключитьОтложенноеДействие(ОбработчикЗаплаток);
		
		ИнтеграцияМодуль	= ПараметрSABY("Интеграция", "Сеанс");
		Кэш					= ПолучитьТекущийЛокальныйКэш();
		
		Если Не ИнтеграцияМодуль = Неопределено Тогда 
			
			// Отладку переключаем модулю, либо модуль должен сам включить себе отладку, если параметр активен.
			Если ЗначениеПараметраСбис Тогда
				
				ИнтеграцияМодуль.ВключитьОтладку(Кэш, ПараметрSABY("КаталогОтладки"));
				
			Иначе
				
				ИнтеграцияМодуль.ОтключитьОтладку(Кэш);
				
			КонецЕсли;
			
		КонецЕсли;

		ИзменитьПараметрСбис_УстановитьВКэш(ЗначениеКэшПрописать, ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

	ИначеЕсли ИмяПараметраСбис  = "СопоставлениеПоОрганизации"
		Или		ИмяПараметраСбис  = "СопоставлениеПоКонтрагенту" Тогда

		
		ДопПараметрыИсходящие = Новый Структура("Ключ", ИмяПараметраСбис);
		ИзменитьПараметрСбис_СопоставлениеПо(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИсходящие);


	Иначе
		
		ИзменитьПараметрСбис_УстановитьВКэш(ЗначениеКэшПрописать, ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	КонецЕсли;
		
КонецПроцедуры

// Процедура - Изменить параметр, который касается взаимодействия со СБИС - объекты транспорта, обмен, авторизация и пр.
//
// Параметры:
//  ИмяПараметраСбис		 - 	 - 
//  ЗначениеПараметраСбис	 - 	 - 
//  ДопПараметрыИзменения	 - 	 - 
//
&НаКлиенте
Процедура ИзменитьПараметрSABY_Сбис(ИмяПараметраСбис, ЗначениеПараметраСбис, ДопПараметрыИзменения)
    Перем ЗначениеПараметраДляУстановить;
	
	// Всегда пишется ТОЛЬКО в глобальный Кэш
	ЗначениеКэшПрописать = ГлобальныйКэш().СБИС;
	Если 	ИмяПараметраСбис = "ПлагинКоннектор" Тогда
		
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ДанныеИнтеграции.Объекты." + ИмяПараметраСбис, ЗначениеПараметраСбис, Ложь);
		
	ИначеЕсли ИмяПараметраСбис = "ОбъектИнтеграции"  Тогда
		
		// Прописывается произвольный объект интеграции.
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ДанныеИнтеграции.Объекты." + ЗначениеПараметраСбис.Ключ, ЗначениеПараметраСбис.Значение, Ложь);

	ИначеЕсли ЗначениеКэшПрописать.Свойство(ИмяПараметраСбис) Тогда
		
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, ИмяПараметраСбис, ЗначениеПараметраСбис, Ложь);

	ИначеЕсли ЗначениеКэшПрописать.ДанныеИнтеграции.Свойство(ИмяПараметраСбис) Тогда
		
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ДанныеИнтеграции." + ИмяПараметраСбис, ЗначениеПараметраСбис, Ложь);
		
	ИначеЕсли	ЗначениеКэшПрописать.ДанныеИнтеграции.Объекты.Свойство(ИмяПараметраСбис) Тогда
			
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ДанныеИнтеграции.Объекты." + ИмяПараметраСбис, ЗначениеПараметраСбис, Ложь);

	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПараметрSABY_ТекущийСеанс(ИмяПараметраСбис, ЗначениеПараметраСбис, ЗначениеКэшПрописать, ЭтоГлобальныйПараметр, ДопПараметрыИзменения)
		
	Если		ИмяПараметраСбис = "ТипыПолейФильтра" Тогда
		
		ИзменитьПараметрТекущегоСеанса_УстановитьТипы(ЗначениеКэшПрописать,  ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);
		
	ИначеЕсли	ИмяПараметраСбис = "ПоискМетаданных" Тогда
		
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.ОписаниеКонфигурации.ПоискМетаданные",	ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли	ИмяПараметраСбис = "ТипыПолей1С" Тогда
		
		МодульНастроек = ПолучитьТекущийЛокальныйКэш().ФормаНастроек;
		Если    ЗначениеПараметраСбис.Свойство("Склады")
			И	ЗначениеПараметраСбис.Склады.ТипыМассивСтрок.Количество() Тогда
			
			МодульНастроек.ПараметрыРаботы.Вставить("СправочникСклады",		ЗначениеПараметраСбис.Склады.ТипыМассивСтрок[0]);
			
		КонецЕсли;
		Если	ЗначениеПараметраСбис.Свойство("РассчетныйСчет")
			И	ЗначениеПараметраСбис.РассчетныйСчет.ТипыМассивСтрок.Количество() Тогда
		
			МодульНастроек.ПараметрыРаботы.Вставить("СправочникРасСчет",	ЗначениеПараметраСбис.РассчетныйСчет.ТипыМассивСтрок[0]);
			
		КонецЕсли;
		ГлавноеОкно.ВладелецКаталога = ТипыСторонСопоставления().ДанныеОрганизации;

		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.ОписаниеКонфигурации.ТипыПолей1С", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли	ИмяПараметраСбис = "РеквизитыКодаНоменклатуры" Тогда
		
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать,
			"ТекущийСеанс.ОписаниеКонфигурации.РеквизитыКодаНоменклатуры",
			ЗначениеПараметраСбис,
			ЭтоГлобальныйПараметр);
	ИначеЕсли 	ИмяПараметраСбис = "ФормаРаботыСНоменклатуройOLD" Тогда
		
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Модули.МодульРаботыСНоменклатуройOLD", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр); 
	
	ИначеЕсли 	ИмяПараметраСбис = "СведенияОбИнтеграции" Тогда
		
		Если ЗначениеЗаполнено(ЗначениеПараметраСбис) Тогда
			
			ИзменитьПараметрСбис("ИнтеграцияИмя",	ЗначениеПараметраСбис.Имя);
			
		Иначе
			
			ИзменитьПараметрСбис("ИнтеграцияИмя",	"");
			
		КонецЕсли;
		
 		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

	ИначеЕсли 	ИмяПараметраСбис = "ВФК" Тогда
		
		ЗаписьВФК = Новый Структура("Заплатки, СведенияОЗапуске");
		ЗаполнитьЗначенияСвойств(ЗаписьВФК, ЗначениеПараметраСбис);
		Если ЗначениеПараметраСбис.Свойство("Отладка") Тогда
			
			ЗаписьВФК.Вставить("Отладка", ЗначениеПараметраСбис.Отладка);
			
		КонецЕсли;
		
		Если ЗначениеПараметраСбис.Свойство("СписокКлиентскихФорм") Тогда
			
			СписокФормВФК = ЗначениеПараметраСбис.СписокКлиентскихФорм;
			
		Иначе
			
			СписокФормВФК = Новый СписокЗначений;

		КонецЕсли;
		
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс." + ИмяПараметраСбис, ЗаписьВФК,			ЭтоГлобальныйПараметр);
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Формы.Клиентские",	СписокФормВФК,		ЭтоГлобальныйПараметр);
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Функции",				Новый Структура,	ЭтоГлобальныйПараметр);
		
		КэшЛокальный = ПолучитьТекущийЛокальныйКэш();
		Если КэшЛокальный.Свойство("Заплатки") Тогда
			
			КэшЛокальный.Заплатки = ЗаписьВФК.Заплатки;
			
		КонецЕсли;

	Иначе
		
		ТекущийСеансОбъект = ГлобальныйКэш.ТекущийСеанс;
		Если		ТекущийСеансОбъект.Свойство(ИмяПараметраСбис) Тогда
			
			ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
			
		ИначеЕсли	ТекущийСеансОбъект.Интерфейс.Свойство(ИмяПараметраСбис) Тогда
			
			ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Интерфейс." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

		ИначеЕсли	ТекущийСеансОбъект.ОписаниеКонфигурации.Свойство(ИмяПараметраСбис) Тогда

			ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.ОписаниеКонфигурации." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

		ИначеЕсли	ТекущийСеансОбъект.Модули.Свойство(ИмяПараметраСбис) Тогда
			
			ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Модули." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
			
		Иначе
			
			ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Параметры." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

// Процедура - изменить технический параметр SABY
//
// Параметры:
//  ОписаниеПараметра		 - Структура/ФиксированнаяСтруктура	 - 
//  ЗначениеКэшПрописать	 - 	 - 
//  ЭтоГлобальныйПараметр	 - 	 - 
//  ДопПараметрыИзменения	 - 	 - 
//
&НаКлиенте
Процедура ИзменитьПараметрSABY_Технический(ИмяПараметраСбис, ЗначениеПараметраСбис, ЗначениеКэшПрописать, ЭтоГлобальныйПараметр, ДопПараметрыИзменения)
	
	лАдресГлобальный = ГлобальныйКэш().Парам.ТехническиеПараметры;
	Если лАдресГлобальный = Неопределено Тогда
		
		лАдресГлобальный = Новый Структура;
		
	КонецЕсли;
	
	Если ЗначениеПараметраСбис = Неопределено Тогда
		
		лАдресГлобальный.Удалить(ИмяПараметраСбис);
		
	Иначе
	
		лАдресГлобальный.Вставить(ИмяПараметраСбис, ЗначениеПараметраСбис);
		
	КонецЕсли;
	ЭтоГлобальныйПараметр = Ложь;

КонецПроцедуры	
	
// Процедура записывает значение параметра по имени в кэш ГО и Глобальный кэш
//
// Параметры:
//  ИмяПараметраСбис		 - Строка					 - Ключ параметра
//  ЗначениеПараметраСбис	 - Произвольное значение	 - Значение параметра установить
//  ДопПараметры			 - Структура				 - 
//		Кэш			- экземпляр ЛокальныйКэш, куда установить параметр
//		Глобально	- Булево (Истина), определяет необходимость обновить параметр глобально, или изменение касается только класса ЛокальныйКэш
//		Параметры	- Стуркутра, доп. параметры для изменения
//		Адрес		- Строка, путь в кэше для установки параметра
//
&НаКлиенте
Процедура ИзменитьПараметрСбис(ИмяПараметраСбис, ЗначениеПараметраСбис = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	ИзменитьПараметрSABY(ИмяПараметраСбис, ЗначениеПараметраСбис,, ДопПараметры);
	
КонецПроцедуры

// UAAРегла
&НаКлиенте
Процедура ИзменитьПараметрСбис_ВызовСервера(ИмяПараметраСбис, ЗначениеПараметраСбис, ДопПараметры = Неопределено)
	
	ЗначениеПараметраПередать = ЗначениеПараметраСбис;
	Если	ИмяПараметраСбис = "Интеграция" Тогда 
		
		ИзменитьПараметрСбис_НаСервере(ИмяПараметраСбис, Неопределено)

	ИначеЕсли ИмяПараметраСбис = "СведенияОбИнтеграции" Тогда
		
		ИзменитьПараметрСбис_НаСервере(ИмяПараметраСбис, ЗначениеПараметраПередать);
		
	ИначеЕсли ИмяПараметраСбис = "ОбменВключен" Тогда

		ИзменитьПараметрСбис_НаСервере(ИмяПараметраСбис, ЗначениеПараметраПередать);

	ИначеЕсли ИмяПараметраСбис = "АдресСервера" Тогда

		ИзменитьПараметрСбис_НаСервере(ИмяПараметраСбис, ЗначениеПараметраПередать);

	ИначеЕсли ГлобальныйКэш.Парам.Свойство(ИмяПараметраСбис) Тогда
		
		ИзменитьПараметрСбис_НаСервере(ИмяПараметраСбис, ЗначениеПараметраПередать);
		
	КонецЕсли;
	
КонецПроцедуры

// UAAРегла
&НаСервере
Процедура ИзменитьПараметрСбис_НаСервере(Знач ИмяПараметраСбис, Знач ЗначениеПараметраСбис, Знач ДопПараметры = Неопределено)
	
	МодульОбъектаСервер().ИзменитьПараметрСбис(ИмяПараметраСбис, ЗначениеПараметраСбис);
	
КонецПроцедуры

Процедура ЗаписатьВХранилищеВызовСервера(КлючОбъекта, КлючНастройки = "", Настройки = Неопределено, ОписаниеНастройки = Неопределено,
 ПользовательНастройки = Неопределено)
	МодульОбъектаСервер().ЗаписатьВХранилище(КлючОбъекта, КлючНастройки, Настройки, ОписаниеНастройки, ПользовательНастройки);
КонецПроцедуры

// Процедура - Изменить параметр сбис СпособХраненияНастроек
//
// Параметры:
//  ЗначениеПараметраСбис	 - 	 - 
//  ДопПараметры			 - 	 - 
//
&НаКлиенте
Процедура ИзменитьПараметрСбис_СпособХраненияНастроек(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметры = Неопределено)

	Если ЗначениеПараметраСбис = 1 Тогда
		ИмяМодуляНастроек = "ФайлыНастроекСервер";
	Иначе
		ИмяМодуляНастроек = "ФайлыНастроекКаталог";
	КонецЕсли;
	
	ЗначениеКэшПрописать.ФормаНастроекОбщее.ОчиститьСобранныеНастройки(ЗначениеКэшПрописать);
	
	МодульНастроек = ПолучитьФормуОбработки(ИмяМодуляНастроек);

	ЗначениеКэшПрописать.Вставить("ФормаНастроек", МодульНастроек);

	МодульНастроек.ПараметрыРаботы = Новый Структура;
	МодульНастроек.ИнициализироватьКэшНастроек(ЗначениеКэшПрописать, ДопПараметры);
	
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "Парам.СпособХраненияНастроек", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
	Если ЭтоГлобальныйПараметр Тогда

		ГлобальныйКэш.ТекущийСеанс.Модули.Настройки = МодульНастроек;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Изменить параметр сбис СпособОбмена
//
// Параметры:
//  ЗначениеКэшПрописать	 - 	 - 
//  ЗначениеПараметраСбис	 - Число	 - код способа обмена
//  ЭтоГлобальныйПараметр	 - 	 - 
//  ДопПараметры			 - 	 - 
//
&НаКлиенте
Процедура ИзменитьПараметрСбис_СпособОбмена(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметры = Неопределено)
	
	// Принудительно переключить
	Если ЗначениеПараметраСбис = 4 Тогда
		
		ЗначениеПараметраУстановить = 6;
		
	ИначеЕсли ЗначениеПараметраСбис = 5 Тогда
		
 		ЗначениеПараметраУстановить = 7;
		
	Иначе
		
		 ЗначениеПараметраУстановить = ЗначениеПараметраСбис;
		 
	КонецЕсли;
 
	МодульИнтеграцииСБИС = МодульИнтеграцииСБИС(ЗначениеПараметраУстановить);
	Если МодульИнтеграцииСБИС = Неопределено Тогда
		
		ОшибкаПодбораИнтеграции = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ИзменитьПараметрСбис_СпособОбмена");
		ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаПодбораИнтеграции);
		
	КонецЕсли;

	ИзменитьПараметрСбис("Интеграция", 		МодульИнтеграцииСБИС);
	ИзменитьПараметрСбис("ОбменВключен",	Ложь); // Для переустановки подключения
	
	ИзменитьПараметрТекущегоСеанса("СведенияОбИнтеграции", МодульИнтеграцииСБИС.СведенияОбИнтеграции());// Для переустановки подключения, Сведения инитятся при включении обмена
	ИзменитьПараметрСбис_УстановитьВКэш(ЗначениеКэшПрописать, "СпособОбмена", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
	
КонецПроцедуры

// Процедура - Изменить параметр сбис ИспользоватьГенератор
//
// Параметры:
//  ЗначениеПараметраСбис	 - 	 - 
//  ДопПараметры			 - 	 - 
//
&НаКлиенте
Процедура ИзменитьПараметрСбис_ИспользоватьГенератор(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметры = Неопределено)

	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "Парам.ИспользоватьГенератор", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
	Если ЭтоГлобальныйПараметр Тогда
		ГлобальныйКэш.ТекущийСеанс.Модули.Настройки.ИспользоватьГенераторПриИзменении(ГлавноеОкно.Кэш, ЗначениеПараметраСбис);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Изменить параметр сбис Меркурий
//
// Параметры:
//  ЗначениеПараметраСбис	 - 	 - 
//  ДопПараметры			 - 	 - 
//
&НаКлиенте
Процедура ИзменитьПараметрСбис_Меркурий(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметры = Неопределено)
	
	Кэш = ПолучитьТекущийЛокальныйКэш();
	СписокДокументов = Новый СписокЗначений;
	МодульНастроек	= ПолучитьЗначениеПараметраТекущегоСеанса("Настройки");
	МодульНастроек.СбисЗаполнитьНеполученныеНастройки(Кэш, Ложь);
	
	Для Каждого Ини Из Кэш.Ини Цикл
		ЗначениеИни = ИниПоПараметрам(Ини.Ключ);
		Если	ЗначениеИни.Свойство("мФайл")
			И	ЗначениеИни.мФайл.Свойство("АктРасхождение") Тогда
			
			СписокДокументов.Добавить(Ини.Ключ);
			
		КонецЕсли;
		
	КонецЦикла;
	Если ЗначениеЗаполнено(СписокДокументов) Тогда
		
		ПараметрыФормированияНаСервере = Новый Структура("ПометкаУдаления, ПредставлениеПФ, ИдентификаторКоманды", 
			Не ЗначениеПараметраСбис, "Погасить ВСД", "sbis1cПогаситьВСД");
		ПараметрыФормированияКомандПечати = МодульОбъектаКлиент().ПараметрыДляРегистрацииПечатнойФормы(ПараметрыФормированияНаСервере);
		ПараметрыФормированияКомандПечати.Вставить("СписокДокументов", СписокДокументов);
		
		Попытка
			
			Кэш.ФормаНастроекОбщее.ДобавитьКомандыПечатиНаФормыНаСервере(ПараметрыФормированияКомандПечати);

		Исключение
			
			РезультатОбновления = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ИзменитьПараметр.Меркурий");
			СбисПараметрыСтатистики = Новый Структура("Действие, Ошибка", "Запись ошибки", РезультатОбновления);
			СбисСтатистика_СформироватьИЗаписать(СбисПараметрыСтатистики, Новый Структура);	
			
		КонецПопытки;
		
	КонецЕсли;
	
	ИзменитьПараметрСбис_УстановитьВКэш(ЗначениеКэшПрописать, "Меркурий", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
КонецПроцедуры

// Процедура - Изменить параметр сбис ИспользоватьГенератор
//
// Параметры:
//  ЗначениеКэшПрописать	 - Булево - Кэш, в который прописываем значение параметра 
//  ЗначениеПараметраСбис	 - Булево - Устанавливаемое значение. Здесь это: дублируем ли статусы сбис в регистры 1С
//  ЭтоГлобальныйПараметр	 - Булево - Пишем в глобальный кэш или нет
//  ДопПараметры			 - Структура - Закос под расширение функции 
//
&НаКлиенте
Процедура ИзменитьПараметрСбис_СостояниеЭД(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметры = Неопределено)

	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "Парам.СостояниеЭД", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
	Если ЭтоГлобальныйПараметр Тогда
		ГлобальныйКэш.ТекущийСеанс.Модули.Настройки.ДублироватьСобытияСБИСПриИзменении(ГлавноеОкно.Кэш, ЗначениеПараметраСбис);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Изменить параметр сбис СпособСопоставленияНоменклатуры
//
// Параметры:
//  ЗначениеПараметраСбис	 - 	 - 
//  ДопПараметры			 - 	 - 
//
&НаКлиенте
Процедура ИзменитьПараметрСбис_СпособСопоставленияНоменклатуры(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения = Неопределено)

	Попытка
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "Парам.СпособСопоставленияНоменклатуры", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

		СпособыСопоставления	= СписокДоступныхСпособовСопоставленияНоменклатуры("УстановкаПараметра");
		ЭлементВСопоставлении	= СпособыСопоставления.НайтиПоЗначению(ЗначениеПараметраСбис);
		
		Если ЭлементВСопоставлении = Неопределено Тогда
			
			ВызватьИсключение "Устанавливаемое значение ""СпособСопоставленияНоменклатуры"" отсутствует в списке доступных!";
			
		КонецЕсли;

		МодульОбработки 			= ЭлементВСопоставлении.Представление;
		ФормаРаботыСоНоменклатурой	= ПолучитьФормуОбработки(МодульОбработки);
		Попытка
			ФормаРаботыСоНоменклатурой.УстановитьПараметрыМодуля(ПолучитьТекущийЛокальныйКэш(), );
		Исключение
			// TODO 4100 Убрать перехват исключения.
			//Исключение не обрабатываем, отвалиться может только в случае, если форма вынесена в внешние функции
		КонецПопытки;
		
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ФормаРаботыСНоменклатурой", МодульОбработки, Ложь);
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Модули.МодульСопоставлениеНоменклатуры", ФормаРаботыСоНоменклатурой, ЭтоГлобальныйПараметр);
		
	Исключение
		
		ДопИнформация		= Новый Структура("Значение, Глобальный", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		ИсключениеИзменеиня = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ИзменитьПараметрСбис_СпособСопоставленияНоменклатуры", 765,,,ДопИнформация);
		ВызватьИсключение СбисИсключение_ВСтроку(ИсключениеИзменеиня);
		
	КонецПопытки;

КонецПроцедуры

// Процедура - Изменить параметр сбис СпособСопоставленияНоменклатуры
//
// Параметры:
//  ЗначениеПараметраСбис	 - 	 - 
//  ДопПараметры			 - 	 - 
//
&НаКлиенте
Процедура ИзменитьПараметрСбис_СопоставлениеПо(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения = Неопределено)
	
	ПараметрыСторон = ПолучитьЗначениеПараметраТекущегоСеанса("РеквизитыСторонДляПоиска");
	СторонаИзменить = ПараметрыСторон[ПараметрыСторон.Синонимы.Получить(ДопПараметрыИзменения.Ключ)];
	СторонаИзменить.ПоискТолькоПоИНН = ЗначениеПараметраСбис = "Только по ИНН";

	ИзменитьПараметрСбис_УстановитьВКэш(ЗначениеКэшПрописать, ДопПараметрыИзменения.Ключ, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

КонецПроцедуры

// Процедура - Изменить параметр сбис АдресСервера
//
// Параметры:
//  ЗначениеПараметраСбис	 - 	 - 
//  ДопПараметры			 - 	 - 
//
&НаКлиенте
Процедура ИзменитьПараметрСбис_АдресСервера(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметры = Неопределено)

	ИмяПараметраСбис = "АдресСервера";
	
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС."						+	ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "Парам."					+	ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС.ПараметрыИнтеграции."	+	ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

	ИмяМодуляРаботыСоСтатусами = ПолучитьЗначениеПараметраТекущегоСеанса("ИмяМодуляРаботыСоСтатусами");
	Если Не ИмяМодуляРаботыСоСтатусами = Неопределено Тогда
		
		МодульРаботыСоСтатусами = ПолучитьФормуОбработки(ИмяМодуляРаботыСоСтатусами);
		МодульРаботыСоСтатусами.УстановитьПараметрыМодуля();
		
	КонецЕсли;
	
	НовыеПараметрыСервиса = ПараметрыАдресаСервераСБИС(ЗначениеПараметраСбис);
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС.ПараметрыИнтеграции.КодСервиса",				НовыеПараметрыСервиса.КодСервиса);
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС.ПараметрыИнтеграции.ПредставлениеСервера",	НовыеПараметрыСервиса.ПредставлениеСервера);
	
КонецПроцедуры

// Процедура записывает значение параметра по имени в кэш ГО и Глобальный кэш
//
// Параметры:
//  ИмяПараметраСбис		 - Строка					 - Ключ параметра
//  ЗначениеПараметраСбис	 - Произвольное значение	 - Значение параметра установить
//  ДопПараметры			 - Структура				 - 
//		Кэш			- экземпляр ЛокальныйКэш, куда установить параметр
//		Глобально	- Булево (Истина), определяет необходимость обновить параметр глобально, или изменение касается только класса ЛокальныйКэш
//		Параметры	- Стуркутра, доп. параметры для изменения
//		Адрес		- Строка, путь в кэше для установки параметра
//
&НаКлиенте
Процедура ИзменитьПараметрТекущегоСеанса(ИмяПараметраСбис, ЗначениеПараметраСбис, ДопПараметры = Неопределено) Экспорт

	ИзменитьПараметрSABY(ИмяПараметраСбис, ЗначениеПараметраСбис, "Сеанс", ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПараметрТекущегоСеанса_УстановитьТипы(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения)
    Перем ЗначениеТипа;
	
	Если ЗначениеПараметраСбис.Свойство("ДоговорыКонтрагентов", ЗначениеТипа) Тогда
		ЗначениеПараметраСбис.Вставить("Тип_Договор", ЗначениеТипа);
	КонецЕсли;
	Если ЗначениеПараметраСбис.Свойство("ФильтрКонтрагент", ЗначениеТипа) Тогда
		ЗначениеПараметраСбис.Вставить("Тип_Контрагент", ЗначениеТипа);
	КонецЕсли;
	ЗначениеПараметраСбис.Вставить("Тип_Дата",	Новый ОписаниеТипов("Дата"));
	ЗначениеПараметраСбис.Вставить("Тип_Номер",	Новый ОписаниеТипов("Строка"));
		
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.ОписаниеКонфигурации.ТипыПолейФильтра", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
	
КонецПроцедуры

&НаКлиенте
Функция ТипСерверногоПараметра(ИмяПараметра)
	Если ИмяПараметра = "download_attachments_on_complete"
		Или ИмяПараметра = "download_attachments_on_update"
		Или ИмяПараметра = "exchange_method"
		Или ИмяПараметра = "run_docflow"
		Или ИмяПараметра = "send_invitations"
		Или ИмяПараметра = "send_type"
		Или ИмяПараметра = "web_interface" Тогда
		Возврат "ОбщаяНастройка";
	ИначеЕсли ИмяПараметра = "advanced_log"	Тогда
		Возврат "ПараметрПодключения";
	Иначе
		Возврат "";
	КонецЕсли;	
КонецФункции

// Процедура перебирает параметры и вызывает метод записи параметра
//
// Параметры:
//  ПараметрыСбис - Массив
//
&НаКлиенте
Процедура ИзменитьПараметрыСбисМассово(ПараметрыСбис) Экспорт
	
	ПараметрыНужноПоменятьПОПорядку = Новый Массив;
	ПараметрыНужноПоменятьНаСервере	= Новый Массив;
	Если ТипЗнч(ПараметрыСбис) = Тип("Структура") Тогда
		
		Для Каждого КлючИЗначениеПарам Из ПараметрыСбис Цикл
		
			Если КлючИЗначениеПарам.Ключ = "РежимОтладки" Тогда
				
				Продолжить;
				
			КонецЕсли;
		
			ПараметрыНужноПоменятьПОПорядку.Добавить(КлючИЗначениеПарам);
			
		КонецЦикла;
		
		// Применяем в конце
		Если ПараметрыСбис.Свойство("РежимОтладки") Тогда
			
			ПараметрыНужноПоменятьПОПорядку.Добавить(Новый ФиксированнаяСтруктура("Ключ, Значение", "РежимОтладки", ПараметрыСбис["РежимОтладки"]));
			
		КонецЕсли;
		
	Иначе
		
		МодификаторСледующейВставки = 0;
		Для Каждого Парам Из ПараметрыСбис Цикл
			
			ТипПараметра = ТипСерверногоПараметра(Парам.ИмяПараметра);
			
			Если ЗначениеЗаполнено(ТипПараметра) Тогда
				
				Если Парам.ДопПараметры = Неопределено Тогда
					
					Парам.ДопПараметры = Новый Структура;
					
				КонецЕсли;
				
				Парам.ДопПараметры.Вставить("Серверный", ТипПараметра);
				ПараметрыНужноПоменятьНаСервере.Добавить(Парам);
				
			Иначе
				
				ПараметрыНужноПоменятьПОПорядку.Вставить(
					ПараметрыНужноПоменятьПОПорядку.Количество() - МодификаторСледующейВставки,
					Новый ФиксированнаяСтруктура("Ключ, Значение, ДопПараметры", Парам.ИмяПараметра, Парам.ЗначениеПараметра, Парам.ДопПараметры));
				Если Парам.ИмяПараметра = "РежимОтладки" Тогда
				
					// Применяем в конце
					МодификаторСледующейВставки = МодификаторСледующейВставки + 1;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
				
	КонецЕсли;
	
	// Параметры переданы в виде Парам. Меняем по 1.
	Для Каждого ПараметрИзменить Из ПараметрыНужноПоменятьПОПорядку Цикл
		
		ЗначениеПараметраТекущее		= ПолучитьЗначениеПараметраСбис(ПараметрИзменить.Ключ);
		Если ЗначениеПараметраТекущее	= ПараметрИзменить.Значение Тогда
			
			// Уже установлен.
			Продолжить;
			
		КонецЕсли;
		
		ИзменитьПараметрSABY_Описание(ПараметрИзменить);
		
	КонецЦикла;

	ИзменитьПараметрыСбисНаСервере(ПараметрыНужноПоменятьНаСервере);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПараметрыСбисНаСервере(ПараметрыСбис)
	
	ПараметрыПодключения = Новый Структура;
	ОбщиеНастройки = Новый Структура;
	Для Каждого Парам Из ПараметрыСбис Цикл
		Если Парам.ДопПараметры <> Неопределено Тогда
			ТипПараметра = ?(Парам.ДопПараметры.Свойство("Серверный"), Парам.ДопПараметры.Серверный, "");
			Если ТипПараметра = "ПараметрПодключения" Тогда
				ПараметрыПодключения.Вставить(Парам.ИмяПараметра, Парам.ЗначениеПараметра);	
			ИначеЕсли ТипПараметра = "ОбщаяНастройка" Тогда
				ОбщиеНастройки.Вставить(Парам.ИмяПараметра, Парам.ЗначениеПараметра);
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ОбновитьОбщиеНастройки(ОбщиеНастройки);
	ОбновитьНастройкиПодключения(ПараметрыПодключения);
	
КонецПроцедуры

