
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

// функции для совместимости кода 
&НаКлиенте
Функция сбисЭлементФормы(Форма,ИмяЭлемента)
	
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Форма.Элементы.Найти(ИмяЭлемента);
	КонецЕсли;
	
	Возврат Форма.ЭлементыФормы.Найти(ИмяЭлемента);

КонецФункции 

&НаКлиенте
Функция сбисПолучитьСтраницу(Элемент, ИмяСтраницы)
	
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Элемент.ПодчиненныеЭлементы[ИмяСтраницы];
	КонецЕсли;
	
	Возврат Элемент.Страницы[ИмяСтраницы];

КонецФункции
//------------------------------------------------------
&НаКлиенте
Функция ОбновитьКонтент(Кэш, ДопПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Кэш) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Кэш.ГлавноеОкно.ПерейтиВРаздел("АккордеонПриходныйОрдер77");	

КонецФункции  

&НаКлиенте
Процедура НастроитьКолонки(Кэш) Экспорт
КонецПроцедуры

&НаКлиенте
Процедура НаСменуРаздела(Кэш) Экспорт
	// Процедура обновляет панель массовых операций, панель фильтра, контекстное меню при смене раздела
		
	МодульСпискаСостоянийДокумента = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("СписокСостоянийДокумента",
		Кэш.Текущий.ФормыРаздела);
	СписокСостояний = МодульСпискаСостоянийДокумента.СписокСостоянийДокумента();
		
	ГлавноеОкно = Кэш.ГлавноеОкно;
	ГлавноеОкно.СписокСостояний = СписокСостояний;
	
	ГлавноеОкно.сбисУстановитьКонтекстноеМеню("Таблица_РеестрДокументов", "КонтекстноеМенюПолученные");
	ГлавноеОкно.сбисУстановитьКонтекстноеМеню("Таблица_РеестрСобытий", "КонтекстноеМенюПолученныеРеестрСобытий");
	ПанельМассовыхОпераций = сбисЭлементФормы(ГлавноеОкно,"ПанельМассовыхОпераций");
	ПанельМассовыхОпераций.ТекущаяСтраница = сбисПолучитьСтраницу(ПанельМассовыхОпераций,"Учет"); 
	
КонецПроцедуры 

&НаКлиенте
Процедура НавигацияУстановитьПанель(Кэш) Экспорт
	
	// Процедура устанавливает панель навигации на 1ую страницу	
	ГлавноеОкно = Кэш.ГлавноеОкно;
	сбисЭлементФормы(ГлавноеОкно,"ПанельНавигации").Видимость=Истина;
	сбисЭлементФормы(ГлавноеОкно,"ЗаписейНаСтранице1С").Видимость=Ложь;
	сбисЭлементФормы(ГлавноеОкно,"ЗаписейНаСтранице").Видимость=Истина;
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьСтруктуруДокумента(СтрокаСпискаДокументов, Кэш) Экспорт
	// функция формирует структуру данных по пакету электронных документов, необходимую для его предварительного просмотра и загрузки в 1С	
	Возврат Кэш.ОбщиеФункции.ПодготовитьСтруктуруДокументаСбис(СтрокаСпискаДокументов, Кэш);
КонецФункции

