
// Функция готовит структуру пакета электронных документов по комплекту документов 1С для просмотра и отправки контрагентам.
// Т.к. по одной строке документов 1С может быть сформировано несколько комплектов (оказание услуги), то структуры пакетов добавляются в массив.
&НаКлиенте
Функция ПодготовитьСтруктуруДокумента1С(СтрокаСпискаДокументов, Кэш) Экспорт
	
	ДопПараметры = Новый Структура;
	
	Возврат МодульОбъектаКлиент().ЗапуститьПодготовкуДокументаСбисПоДанным1С(СтрокаСпискаДокументов, ДопПараметры);
	
КонецФункции	

// Формируем файлы по документам 1С
&НаКлиенте
Функция ОбработатьДанныеДокументов1С(Кэш, Контекст, СоставПакета, СоответствиеДокументДанные, ДопПараметры = Неопределено) Экспорт
	
	Для Каждого Элемент Из СоставПакета Цикл		
		
		Документ = Элемент.Значение;
		
		Если ЗначениеЗаполнено(Элемент.Представление) Тогда
			
			МассивИни = МодульОбъектаКлиент().СбисРазложитьСтрокуВМассивПодстрок(Элемент.Представление, ",");
			
		Иначе
			
			МассивИни = Новый Массив;
			МассивИни.Добавить("");
		
		КонецЕсли;
		
		Для Каждого ИниДокумента Из МассивИни Цикл
			ИдДокумента = МодульОбъектаКлиент().СбисИдентификаторДокумента1С(Документ, ИниДокумента);
			Если ТипЗнч(Документ) = Тип("Строка") Тогда
				Продолжить;
			КонецЕсли;
			ДанныеДокумента = СоответствиеДокументДанные.Получить(ИдДокумента);
			Если ДанныеДокумента = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			ИмяДокумента = ПолучитьРеквизитМетаданныхОбъекта(Документ, "Имя");
			Контекст.Вставить("Документ",		Документ);
			Контекст.Вставить("ДокументДанные",	ДанныеДокумента.ДокументДанные);
			фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПрочитатьДокумент", "Документ_" + ИмяДокумента, "Документ_Шаблон", Кэш);
			Если Не фрм.ПрочитатьДокумент(Кэш,Контекст) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Функция заполняет структуру файла настроек данными из документа
Функция ПолучитьДанныеДокумента1С(СтруктураИниФайла, Документ, КэшЗначенийИни, КэшПарам=Неопределено) Экспорт // alo Меркурий
	Контекст = Новый Структура("Документ, СтрТабл, Ини",,);
	Контекст.Ини = Новый Структура;
	сбисСкопироватьСтруктуру(Контекст.Ини, СтруктураИниФайла);
	// << alo Меркурий
	Контекст.Ини.Вставить("Парам",Новый Структура("Значение,РассчитанноеЗначение","",Новый Структура));
	// alo Меркурий >>
	Контекст.Документ = Документ;
	
	Если СписокДопустимыхТипов.Количество() = 0 Тогда
		СписокДопустимыхТипов = СписокДопустимыхТипов();
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	ГрязныйИни = ЗаполнимДаннымиДокументаСтруктуру(СтруктураИниФайла, Контекст, СписокДопустимыхТипов,КэшЗначенийИни,Новый Массив);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ГрязныйИни;
	
КонецФункции

// Функция заполняет структуру файла настроек данными из документа
&НаКлиенте
Функция ПолучитьДанныеДокументов1С(СоответствиеДокументДанные, КэшЗначенийИни, СоставПакета, КэшПарам = Неопределено, Кэш = Неопределено) Экспорт	// alo Меркурий
	
	Если Кэш = Неопределено Тогда
		Кэш = МестныйКэш;
	КонецЕсли;
	
	ДопПараметры = Новый Структура("КэшЗначенийИни, СоставПакета, КэшПарам", КэшЗначенийИни, СоставПакета, КэшПарам);
	
	НовоеСоответствие = ПолучитьДанныеДокументов1СНаСервере(СоответствиеДокументДанные, ДопПараметры);
	Для каждого КлючИЗначение Из СоответствиеДокументДанные Цикл
		ГряныйИни = НовоеСоответствие.Получить(КлючИЗначение.Ключ);
		
		Если ГряныйИни = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СоответствиеДокументДанные.Вставить(КлючИЗначение.Ключ, ГряныйИни);
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеДокументов1СНаСервере(Знач СоответствиеДокументДанные, ДопПараметры)
	Перем СтруктураОбработчиковДо, СтруктураОбработчиковПосле;
	
	Результат		= Новый Соответствие;
	НаборРассчета	= ПолучитьДанныеДокументов1СНаСервере_СформироватьНаборРасчтеа(ДопПараметры.СоставПакета, СоответствиеДокументДанные);
	
	Для Каждого ЭлементРассчитать Из НаборРассчета Цикл
		
		СтруктураИниФайла	= ЭлементРассчитать.СтруктураИни;
		ИмяИни				= ЭлементРассчитать.ИмяИни;
		СсылкаНаОбъект		= ЭлементРассчитать.Ссылка;
		
		Если СтруктураИниФайла.Свойство("мОбработчикДоРасчетаНаСервере", СтруктураОбработчиковДо) Тогда
			ДопПараметрыОбработчика = Новый Структура;
			ДопПараметрыОбработчика.Вставить("Документ", СсылкаНаОбъект);
			ДопПараметрыОбработчика.Вставить("ГрязныйИни", СтруктураИниФайла);
			
			МодульОбъектаСервер().ВыполнитьОбработчикиНаСервере(СтруктураОбработчиковДо, ДопПараметрыОбработчика);
			СтруктураИниФайла.Удалить("мОбработчикДоРасчетаНаСервере");		
		КонецЕсли;
		
		ГрязныйИни = ПолучитьДанныеДокумента1С(СтруктураИниФайла, СсылкаНаОбъект, ДопПараметры.КэшЗначенийИни, ДопПараметры.КэшПарам);  // alo Меркурий
		
		Если НЕ	ГрязныйИни = Неопределено
			И	ГрязныйИни.Свойство("ВходящийКонтекст") Тогда
			
			ДополнитьВходящийКонтекстГрязногоИни(СсылкаНаОбъект, ГрязныйИни.ВходящийКонтекст, ДопПараметры);
			
		КонецЕсли;
		
		Результат.Вставить(ЭлементРассчитать.Ключ,  Новый Структура("ИмяИни, ДокументДанные", ИмяИни, ГрязныйИни));	
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеДокументов1СНаСервере_СформироватьНаборРасчтеа(СписокСсылок, СоответствиеДокументДанные)
	
	НаборРассчета = Новый Массив;
	Для Каждого Элемент Из СписокСсылок Цикл
		Документ = Элемент.Значение;
		
		МассивИни			= МодульОбъектаСервер().СбисРазложитьСтрокуВМассивПодстрок(Элемент.Представление, ",", Ложь);
		ДобавленПоСсылке	= Ложь;
		Для Каждого ИниДокумента Из МассивИни Цикл
			
			ИдентификаторДокумента	= МодульОбъектаСервер().СбисИдентификаторДокумента1С(Документ, ИниДокумента);
			ЭлементСоответствия		= СоответствиеДокументДанные.Получить(ИдентификаторДокумента);
			
			Если ЭлементСоответствия = Неопределено Тогда
				
				// Если соответствие составлено в старом формате, где ключом выступает ссылка на объект и ини не указана, то получить напрямую
				ЭлементСоответствия = СоответствиеДокументДанные.Получить(Документ);
				
				Если	ЭлементСоответствия = Неопределено
					Или	ДобавленПоСсылке Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				// По ссылке объект в соответствие может быть указан 1 раз, но могут его вариации с указанием ини
				ДобавленПоСсылке		= Истина;
				ИдентификаторДокумента	= Документ;
			
			КонецЕсли;
			
			СтруктураИниФайла = ЭлементСоответствия.ДокументДанные;
			
			ЭлементВНабор = Новый Структура("Ссылка, СтруктураИни, ИмяИни, Ключ", Документ);
			ЭлементВНабор.СтруктураИни	= ЭлементСоответствия.ДокументДанные;
			ЭлементВНабор.ИмяИни		= ЭлементСоответствия.ИмяИни;
			ЭлементВНабор.Ключ			= ИдентификаторДокумента;
			НаборРассчета.Добавить(ЭлементВНабор);

		КонецЦикла;
		
	КонецЦикла;
	
	Возврат НаборРассчета;
	
КонецФункции

&НаСервере
Процедура ДополнитьВходящийКонтекстГрязногоИни(Документ, ВходящийКонтекст, ДопПараметры)
	ВходящийКонтекст.Вставить("МассивИсходныхНомеровСтрок", ПолучитьМассивИсходныеНомераСтрок(Документ));
КонецПроцедуры

&НаКлиенте
функция ДобавитьДокументыЮЗДО(МестныйКэш, ФормаПросмотра) экспорт
	ЕстьСвязанныйДокумент=Ложь;
	Если ФормаПросмотра.СоставПакета.Свойство("Вложение") Тогда
		ИниТекущегоРеестра = МестныйКэш.Текущий.ТипДок;	
		Документы1С=Новый СписокЗначений;
		Для Каждого Вложение Из ФормаПросмотра.СоставПакета.Вложение Цикл
			Для Каждого Документ Из Вложение.Документы1С Цикл
				Если Документы1С.НайтиПоЗначению(Документ.Значение) = Неопределено Тогда
					Документы1С.Добавить(Документ.Значение);
					ЕстьСвязанныйДокумент=Истина;
				конецесли;
			КонецЦикла;
		КонецЦикла;
		Для Каждого Документ Из Документы1С Цикл
			ИмяДокумента = МестныйКэш.ОбщиеФункции.ПолучитьРеквизитМетаданныхОбъекта(Документ.Значение, "Имя");
			Попытка
				НаборПодходящихИни = МодульОбъектаКлиент().ИниПоПараметрам(Новый Структура("Тип1С, ТипИни", ИмяДокумента,"Выгрузка"));
			Исключение
				МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.Найти_мФайлПоВложению");
			КонецПопытки;
			
			//Получим настройки документа
			СписокИни = Новый СписокЗначений;
			Для Каждого КлючИЗначениеИни Из НаборПодходящихИни Цикл
				ЗначениеИни = КлючИЗначениеИни.Значение;
				Если	ЗначениеИни.Свойство("ЗапросСпискаДокументов")
					Или	ЗначениеИни.Свойство("Реестр1С_Название") Тогда 
					Реестр1С_Название = МестныйКэш.ОбщиеФункции.РассчитатьЗначение("Реестр1С_Название", ЗначениеИни, МестныйКэш);
					СписокИни.Добавить(КлючИЗначениеИни.Ключ, ?(ЗначениеЗаполнено(Реестр1С_Название),Реестр1С_Название, ИмяДокумента));
				КонецЕсли;
			КонецЦикла;
			Если Не СписокИни.Количество() тогда
				МодульОбъектаКлиент().СбисСообщить("Отсутствуют файлы настроек для выгрузки " + ИмяДокумента + "!");
			КонецЕсли;
			Если СписокИни.Количество() = 1 Тогда
				ДозаписьПослеВыбораИни(СписокИни[0], Новый Структура("Документ,ФормаПросмотра",Документ.Значение,ФормаПросмотра));
			Иначе
				ОбработчикПослеСписка = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ДозаписьПослеВыбораИни", ЭтаФорма, Новый Структура("Документ,ФормаПросмотра",Документ.Значение,ФормаПросмотра));
				ПараметрыВыбораСписка = Новый Структура;
				ПараметрыВыбораСписка.Вставить("Заголовок", "Выберите настройку для " + Документ.Значение);
				ПараметрыВыбораСписка.Вставить("Обработчик", ОбработчикПослеСписка);
				
				МодульОбъектаКлиент().СбисВыбратьИзСписка(СписокИни, ПараметрыВыбораСписка);
			КонецЕсли;
			Возврат Неопределено;
		КонецЦикла;
		МестныйКэш.Текущий.ТипДок = ИниТекущегоРеестра;	
	КонецЕсли;
	Если Не ЕстьСвязанныйДокумент Тогда
		МодульОбъектаКлиент().СбисСообщить("Нет сопоставленного документа 1С!");
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПодготовитьДействие_Утвердить_ДокОтгрВх(ПараметрыДействия,Кэш = Неопределено) Экспорт
	
	Если  ПараметрыДействия.Действие.Свойство("СтруктураПодробнее") Тогда
		СтруктураТитулаПараметры = ПараметрыДействия.Действие.СтруктураПодробнее;
	
	
		СтруктураТитула = Новый Структура;
		
		ЕстьПодписантТитула = СтруктураТитулаПараметры.Свойство("Область")
								И СтруктураТитулаПараметры.Свойство("Статус")
								И СтруктураТитулаПараметры.Свойство("Основания");
		Если ЕстьПодписантТитула Тогда
			ДанныеРекордсет = Новый Структура;
			ДанныеРекордсет.Вставить("ОблПолн",Строка(СтруктураТитулаПараметры.Область));
			ДанныеРекордсет.Вставить("Статус",Строка(СтруктураТитулаПараметры.Статус));
			ДанныеРекордсет.Вставить("ОснПолн",СтруктураТитулаПараметры.Основания); 
			ПодписантТитула = Новый Структура("Рекордсет",ДанныеРекордсет);	
		КонецЕсли;
		
		Генератор = Новый Структура;
		
		Если СтруктураТитулаПараметры.Свойство("ДатаПринят") Тогда
			Генератор.Вставить("ДатаПринят",СтруктураТитулаПараметры.ДатаПринят);	
		КонецЕсли;
		
		ЕстьПолучатель = СтруктураТитулаПараметры.Свойство("ПолучательГруза");
		ПолучилГрузСтруктура = Новый Структура;
		СвЛицПолГруз = Новый Структура;                          
		Если ЕстьПолучатель И Строка(СтруктураТитулаПараметры.ПолучательГруза) = "2" Тогда
			
			РабОргПок = Новый Структура; 
			РабОргПок.Вставить("Должность",СтруктураТитулаПараметры.Должность);
			РабОргПок.Вставить("ОснПолн",СтруктураТитулаПараметры.ДолжностныеОбязанности);
			РабОргПок.Вставить("Фамилия",СтруктураТитулаПараметры.Фамилия);
			РабОргПок.Вставить("Имя",СтруктураТитулаПараметры.Имя);
			РабОргПок.Вставить("Отчество",СтруктураТитулаПараметры.Отчество);
			СвЛицПолГруз.Вставить("РабОргПок",РабОргПок);
			ПолучилГрузСтруктура.Вставить("СвЛицПолГруз",СвЛицПолГруз);
			Генератор.Вставить("ПолучилГруз",ПолучилГрузСтруктура);
			
		ИначеЕсли ЕстьПолучатель И Строка(СтруктураТитулаПараметры.ПолучательГруза) = "3" Тогда
			
			ИнЛицо = Новый Структура;
			ПредОргПол = Новый Структура;
			ПредОргПол.Вставить("Должность",СтруктураТитулаПараметры.Должность);
			ПредОргПол.Вставить("НаимОргПол",СтруктураТитулаПараметры.ОрганизацияСотрудника);
			ПредОргПол.Вставить("ОснДоверОргПол",СтруктураТитулаПараметры.ОснованиеПолномочийОрганизации1);
			ПредОргПол.Вставить("ОснПолнПредПол",СтруктураТитулаПараметры.ДолжностныеОбязанности);
			ПредОргПол.Вставить("Фамилия",СтруктураТитулаПараметры.Фамилия);
			ПредОргПол.Вставить("Имя",СтруктураТитулаПараметры.Имя);
			ПредОргПол.Вставить("Отчество",СтруктураТитулаПараметры.Отчество);
			ИнЛицо.Вставить("ПредОргПол",ПредОргПол);
			СвЛицПолГруз.Вставить("ИнЛицо",ИнЛицо);
			ПолучилГрузСтруктура.Вставить("СвЛицПолГруз",СвЛицПолГруз);
			Генератор.Вставить("ПолучилГруз",ПолучилГрузСтруктура);
			
		ИначеЕсли ЕстьПолучатель И Строка(СтруктураТитулаПараметры.ПолучательГруза) = "4" Тогда
			
			ИнЛицо = Новый Структура;
			ФЛ = Новый Структура;
			ФЛ.Вставить("ОснДоверФЛ",СтруктураТитулаПараметры.ДолжностныеОбязанности);
			ФЛ.Вставить("Фамилия",СтруктураТитулаПараметры.Фамилия);
			ФЛ.Вставить("Имя",СтруктураТитулаПараметры.Имя);
			ФЛ.Вставить("Отчество",СтруктураТитулаПараметры.Отчество);
			ИнЛицо.Вставить("ФЛ",ФЛ);
			
			СвЛицПолГруз.Вставить("ИнЛицо",ИнЛицо);
			ПолучилГрузСтруктура.Вставить("СвЛицПолГруз",СвЛицПолГруз);
			Генератор.Вставить("ПолучилГруз",ПолучилГрузСтруктура);
			
		КонецЕсли;
		

		Подстановка = Новый Структура;
		Если ЕстьПодписантТитула Тогда
			Подстановка.Вставить("ПодписантТитула", ПодписантТитула);
		КонецЕсли;
		Подстановка.Вставить("Генератор", Генератор);
		СтруктураТитула.Вставить("Подстановка",Подстановка); 
		ПараметрыДействия.ДокументПодготовлен.Этап.Вставить("Вложение",СтруктураТитула);
		
	КонецЕсли;
	
	
КонецПроцедуры

