
////////////////////////////////////////////////////
//////////////////Номер документов//////////////////

//+++ МАИ 14.09.2021 универсальная функция получения номера документа
&НаКлиенте
Функция сбисПолучитьНомерДокумента(Контекст) Экспорт
	ОсновнойНомерДокумента = Неопределено;
	Контекст.Свойство("НомДокОсновнойНомерДокумента", ОсновнойНомерДокумента);
	
	Если ПустаяСтрока(ОсновнойНомерДокумента) Тогда
		ПринадлежностьНомера="";	
		Если Контекст.Свойство("НомДокПринадлежностьНомера", ПринадлежностьНомера) 
			И НЕ ПустаяСтрока(ПринадлежностьНомера) Тогда
			Если ПринадлежностьНомера = "ИсхДокумент" ИЛИ ПринадлежностьНомера = "ИсходныйДокумент" Тогда
				сбисДокумент = Контекст.ИсходныйДокумент;
			ИначеЕсли ПринадлежностьНомера = "ОказаниеУслуг" ИЛИ ПринадлежностьНомера = "ТаблДок" Тогда
				сбисДокумент = Контекст.ТаблДок;	
			ИначеЕсли ПринадлежностьНомера = "Основание" ИЛИ ПринадлежностьНомера = "ДокумеентОснование" ИЛИ ПринадлежностьНомера = "ДокОснование" Тогда
				сбисДокумент = Контекст.ДокОснование;
			ИначеЕсли ПринадлежностьНомера = "ИсправляемыйСчетФактура" Тогда
				сбисДокумент = Контекст.ИсправляемыйСчетФактура;
			ИначеЕсли ПринадлежностьНомера = "ИсходныйСчетФактура" ИЛИ ПринадлежностьНомера = "ИсхСФ" Тогда
				сбисДокумент = ?(Контекст.Свойство("ИсходныйСчетФактура"), Контекст.ИсходныйСчетФактура, Контекст.ИсхСФ);
			Иначе
				сбисДокумент = Контекст.Документ;		
			КонецЕсли;	
		Иначе
			сбисДокумент = Контекст.Документ;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат сбисНомерДокументаНаПечатьСервер(сбисФункцияНомераНаПечать(МестныйКэш), сбисДокумент, ОсновнойНомерДокумента, сбисДобавитьЗначениеПослеНомера(Контекст)); 
КонецФункции
//--- МАИ 14.09.2021 универсальная функция получения номера документа

&НаКлиенте
Функция ПолучитьНомерДокумента(Контекст) Экспорт
	сбисНомерДокумента = Неопределено;
	Контекст.Свойство("НомерДокумента", сбисНомерДокумента);
	Возврат сбисНомерДокументаНаПечатьСервер(сбисФункцияНомераНаПечать(МестныйКэш), Контекст.Документ, сбисНомерДокумента, сбисДобавитьЗначениеПослеНомера(Контекст)); 
КонецФункции

&НаКлиенте
Функция ПолучитьНомерДокументаОказаниеУслуг(Контекст) Экспорт
	Возврат сбисНомерДокументаНаПечатьСервер(сбисФункцияНомераНаПечать(МестныйКэш), Контекст.ТаблДок, , сбисДобавитьЗначениеПослеНомера(Контекст)); 
КонецФункции

&НаКлиенте
Функция сбисНомерИсходногоДокументаНаПечать(Контекст) Экспорт 
	Возврат сбисНомерДокументаНаПечатьСервер(сбисФункцияНомераНаПечать(МестныйКэш), Контекст.ИсходныйДокумент); 
КонецФункции

&НаКлиенте
Функция сбисНомерОснованияНаПечать(Контекст) Экспорт
	Возврат сбисНомерДокументаНаПечатьСервер(сбисФункцияНомераНаПечать(МестныйКэш), Контекст.ДокОснование,,сбисДобавитьЗначениеПослеНомера(Контекст)); 
КонецФункции

&НаКлиенте
Функция сбисНомерИсходнойФактурыНаПечать(Контекст) Экспорт
	Возврат сбисНомерДокументаНаПечатьСервер(сбисФункцияНомераНаПечать(МестныйКэш), Контекст.ИсходнаяФактура); 
КонецФункции

//Функция возвращает строку, для добавления после номера документа.
&НаКлиенте
Функция сбисДобавитьЗначениеПослеНомера(Контекст)
	
	СтрокаВозврат = Неопределено;
	Если	Контекст.Свойство("ИндексОбособленногоПодразделения", СтрокаВозврат)
		И	ЗначениеЗаполнено(СтрокаВозврат) Тогда
		Если ТипЗнч(СтрокаВозврат) = Тип("Число") Тогда
			СтрокаВозврат = Формат(СтрокаВозврат, "ЧН=0; ЧГ=0");
		Иначе
			СтрокаВозврат = СокрЛП(Строка(СтрокаВозврат));
		КонецЕсли;
	Иначе
		СтрокаВозврат = "";
	КонецЕсли;
	
	//+++ МАИ 14.09.2021 поддержка дополнительного постфикса 
	Постфикс = "";
	Контекст.Свойство("НомДокПостфикс", Постфикс);
	Если ПустаяСтрока(СтрокаВозврат) И НЕ ПустаяСтрока(Постфикс) Тогда
		СтрокаВозврат = Постфикс;
	ИначеЕсли НЕ ПустаяСтрока(Постфикс) Тогда
			СтрокаВозврат = СтрокаВозврат + "/" + Постфикс;	
	КонецЕсли;
	//--- МАИ 14.09.2021 поддержка дополнительного постфикса
	
	Возврат	СтрокаВозврат;	
	
КонецФункции

//Возвращает строку функции, которая вызывается для получения номера
&НаКлиенте
Функция сбисФункцияНомераНаПечать(Кэш)
	сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "ПользовательскиеЗначения.Функции", "НомерДокумента");
	сбисРезультат = сбисПолучитьЗначениеРассчитанногоОбъекта(Кэш, сбисОписаниеОбъекта);
	Если Не сбисРезультат = Неопределено Тогда
		Возврат сбисРезультат;
	КонецЕсли;
	сбисСтрокаФункцииКонец	=	"," + Формат(Кэш.Парам.УдалятьПрефиксИнформационнойБазы,"БЛ=Ложь; БИ=Истина") +
	"," + Формат(Кэш.Парам.УдалятьПользовательскийПрефикс,	"БЛ=Ложь; БИ=Истина") + ")";
	сбисНомерДокумента		= "001";
	сбисДокумент			= Неопределено;
	сбисСписокФункций		= Новый Массив;
	Если Не Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		сбисСписокФункций.Добавить("ОбщегоНазначения.ПолучитьНомерНаПечать(сбисДокумент)");
	КонецЕсли;
	сбисСписокФункций.Добавить("ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(сбисНомерДокумента" + сбисСтрокаФункцииКонец);
	сбисСписокФункций.Добавить("ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(сбисНомерДокумента" + сбисСтрокаФункцииКонец);
	сбисСписокФункций.Добавить("СокрЛП(сбисНомерДокумента)");
	Для Каждого сбисСтрокаФункции Из сбисСписокФункций Цикл 
		Попытка
			ТестНомерДокумента = Вычислить(сбисСтрокаФункции);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			Продолжить;
		КонецПопытки;
		Прервать;
	КонецЦикла;
	сбисОписаниеОбъекта.Значение = сбисСтрокаФункции;
	сбисЗакэшироватьЗначениеРассчитанногоОбъекта(Кэш, сбисОписаниеОбъекта);
	Возврат сбисОписаниеОбъекта.Значение; 
КонецФункции

//Делает вызов стандартного механизма 1С для получения номера
&НаСервереБезКонтекста
Функция сбисНомерДокументаНаПечатьСервер(сбисСтрокаФункции, сбисДокумент, сбисОсновнойНомерДокумента=Неопределено, сбисПостфикс="")
	//Не указан номер, тогда берем его из документа руками.
	Если сбисОсновнойНомерДокумента = Неопределено Тогда
		сбисНомерДокумента = сбисДокумент.Номер;
	Иначе
		сбисНомерДокумента = сбисОсновнойНомерДокумента;
	КонецЕсли;
	Попытка 
		сбисРезультат = Вычислить(сбисСтрокаФункции); 
	Исключение
		сбисРезультат = Строка(сбисНомерДокумента);
	КонецПопытки;
	//1173125472 для добавления значения после номера документа.
	Если Не ПустаяСтрока(сбисПостфикс) Тогда
		сбисРезультат = Строка(сбисРезультат) + "/" + сбисПостфикс;
	КонецЕсли;
	
	Возврат сбисРезультат; 
КонецФункции

//TODO45 спилить. Старая функция получения номера. Пока оставлена для совместимости.
&НаСервере
Функция сбисНомерДокументаНаПечать(Документ,УдалятьПрефиксИнформационнойБазы=Ложь,УдалятьПользовательскийПрефикс=Ложь,Постфикс	= "",НомерДокументаИни="") Экспорт 
	
	Если НЕ НомерДокументаИни = "" Тогда
		Попытка 
			НомерДокумента = Вычислить("ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(НомерДокументаИни, УдалятьПрефиксИнформационнойБазы, УдалятьПользовательскийПрефикс)"); 
		Исключение 
			НомерДокумента = НомерДокументаИни; 
		КонецПопытки; 	
	Иначе	
		Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда 
			Попытка 
				НомерДокумента = Вычислить("ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Документ.Номер, УдалятьПрефиксИнформационнойБазы, УдалятьПользовательскийПрефикс)"); 
			Исключение 
				НомерДокумента = Документ.Номер; 
			КонецПопытки; 
		Иначе 
			Попытка 
				НомерДокумента = Вычислить("ОбщегоНазначения.ПолучитьНомерНаПечать(Документ)"); 
			Исключение 
				НомерДокумента = Документ.Номер;                                                               
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
	//1173125472 для добавления значения после номера документа.
	Если Не ПустаяСтрока(Постфикс) Тогда
		НомерДокумента = Строка(НомерДокумента) + "/" + Постфикс;
	КонецЕсли;
	
	Возврат НомерДокумента; 
КонецФункции

