
&НаСервере
Функция ЗаполнимДаннымиДокументаСтруктуру(Раздел, знач Контекст = "", СписокДопустимыхТипов,КэшЗначенийИни, Путь)
	Перем ЗначениеЭлемента;
	// Функция рекурсивно заполняет структуру файла настроек данными из документа
	Результат = Новый Структура;
	
	МодульРассчетаСервер = МодульОбъектаСервер();
	
	Контекст.Вставить("Путь", Путь);
	Если Не Контекст.Свойство("ТекущийРазделИни") Тогда
		Контекст.Вставить("ТекущийРазделИни", Контекст.Ини);
	КонецЕсли;
	
	Для Каждого Элемент из Раздел Цикл
		Если		Лев(Элемент.Ключ, 4) = "сбис"// служебные параметры не получаем
			Или	Не	ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда   
			Продолжить;
		КонецЕсли;
		
		Если Элемент.Значение.Свойство("Значение", ЗначениеЭлемента) Тогда
			Если Элемент.Значение.Свойство("Кэш") и ЗначениеЗаполнено(Элемент.Значение.Кэш) Тогда
				Если Элемент.Значение.Кэш = "Организация" Тогда
					ИНН = СокрЛП(МодульРассчетаСервер.РассчитатьЗначениеSABY("Сторона_ИНН", Контекст));
					КПП = СокрЛП(МодульРассчетаСервер.РассчитатьЗначениеSABY("Сторона_КПП", Контекст));
					Если КэшЗначенийИни.Организации.Свойство("к"+ИНН+КПП+"_"+Элемент.Ключ) Тогда
						ЗначениеПараметра = КэшЗначенийИни.Организации["к"+ИНН+КПП+"_"+Элемент.Ключ];	
					Иначе
						ЗначениеПараметра = МодульРассчетаСервер.РассчитатьЗначениеSABY(Элемент.Ключ, Контекст);
						Если Лев(ЗначениеПараметра,1)<>"!" Тогда
							КэшЗначенийИни.Организации.Вставить("к"+ИНН+КПП+"_"+Элемент.Ключ, ЗначениеПараметра);
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если КэшЗначенийИни.ТекущийПакет.Свойство(Элемент.Значение.Кэш+"_"+Элемент.Ключ) Тогда
						ЗначениеПараметра = КэшЗначенийИни.ТекущийПакет[Элемент.Значение.Кэш+"_"+Элемент.Ключ];	
					Иначе
						ЗначениеПараметра = МодульРассчетаСервер.РассчитатьЗначениеSABY(Элемент.Ключ, Контекст);
						Если Лев(ЗначениеПараметра,1)<>"!" Тогда
							КэшЗначенийИни.ТекущийПакет.Вставить(Элемент.Значение.Кэш+"_"+Элемент.Ключ, ЗначениеПараметра);
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли
			Иначе
				ЗначениеПараметра = МодульРассчетаСервер.РассчитатьЗначениеSABY(Элемент.Ключ, Контекст);	
			КонецЕсли;
			
			Если СписокДопустимыхТипов.НайтиПоЗначению(ТипЗнч(ЗначениеПараметра)) <> Неопределено Тогда
				
				Результат.Вставить(Элемент.Ключ, ЗначениеПараметра);
				
			КонецЕсли;
			
			// Если это табличная часть без отбора и в значениии получилось неопределено, то возвращаем пустой массив. 
			// Получается, если нет такой таб части в документе. Например для счета в УТ11, если основание счета Акт, то нет ТЧ Товары, а если Реализация, то нет ТЧ Услуги.
			Если Элемент.Значение.Свойство("Тип") и Элемент.Значение.Тип="ТабличнаяЧасть" и НЕ Элемент.Значение.Свойство("Отбор") и (ЗначениеПараметра=Неопределено или ЗначениеПараметра="") Тогда
				Возврат Новый Массив;	
			КонецЕсли;
			
			Если (Элемент.Значение.Свойство("Тип") и Элемент.Значение.Тип = "ТабличнаяЧасть" и (Найти(строка(ЗначениеПараметра),"ТабличнаяЧасть")>0 или Найти(строка(ЗначениеПараметра),"TabularSection")>0)) или ТипЗнч(ЗначениеПараметра)=Тип("Массив") Тогда
				Если Элемент.Значение.Свойство("КолонкиГруппировок") и Элемент.Значение.Свойство("КолонкиСуммирования")
					и (Элемент.Значение.КолонкиГруппировок<>"" или Элемент.Значение.КолонкиСуммирования<>"")
					и НЕ ТипЗнч(ЗначениеПараметра)=Тип("Массив") Тогда
					ТабЧасть = ЗначениеПараметра.Выгрузить();
					ТабЧасть.Свернуть(Элемент.Значение.КолонкиГруппировок, Элемент.Значение.КолонкиСуммирования);
					ЗначениеПараметра = ТабЧасть;
				КонецЕсли;
				
				Если Элемент.Значение.Свойство("Сортировать") Тогда
					если типЗнч(ЗначениеПараметра)=Тип("ТаблицаЗначений") тогда
						ЗначениеПараметра.Сортировать(Элемент.Значение.Сортировать);
					иначе
						ТабЧасть = ЗначениеПараметра.Выгрузить();
						ТабЧасть.Сортировать(Элемент.Значение.Сортировать);
						ЗначениеПараметра = ТабЧасть;
					конецесли
				конецесли;
				
				МассивСтрок = Новый Массив;				
				ТекущийРаздел = Новый Структура;
				ПараметрыКопированияСтрок = Новый Структура("КлючиНеКопировать", Новый Массив);
				ПараметрыКопированияСтрок.КлючиНеКопировать.Добавить("РассчитанноеЗначение");
				
				ЗначениеКопия = Элемент.Значение;
				Раздел[Элемент.Ключ] = Неопределено;
				
				// Подготовить контекст ини
				СбисСкопироватьСтруктуруСПараметрами(ТекущийРаздел, Контекст.ТекущийРазделИни, ПараметрыКопированияСтрок);
				Контекст.Переменные.Вставить(Элемент.Ключ);
				
				Для Каждого СтрокаТаблЧасти Из ЗначениеПараметра Цикл

					//Подготавливаем структуру для строки документа
					Контекст.Переменные[Элемент.Ключ] = СтрокаТаблЧасти;
					СтруктураСтроки = ЗаполнимДаннымиДокументаСтруктуру(Раздел, Контекст, СписокДопустимыхТипов, КэшЗначенийИни, Путь); 
					МассивСтрок.Добавить(СтруктураСтроки);
					
					Контекст.ТекущийРазделИни.Очистить();
					СбисСкопироватьСтруктуруСПараметрами(Контекст.ТекущийРазделИни, ТекущийРаздел, ПараметрыКопированияСтрок);

				КонецЦикла;
				
				Контекст.Переменные.Удалить(Элемент.Ключ);

				Раздел[Элемент.Ключ] = ЗначениеКопия;
				Возврат МассивСтрок;
				
			КонецЕсли;
		Иначе
			Путь.Добавить(Элемент.Ключ);
			Если Лев(Элемент.Ключ, 5) = "Выбор" Тогда
				
				//ТекущийРазделИни = Контекст.ТекущийРазделИни[Элемент.Ключ];
				ВременныйКонтекст = Новый Структура("Документ, Переменные, Ини, Путь, ТекущийРазделИни, ТекущийКлючРаздела, Параметры, ДанныеИсточник");
				ЗаполнитьЗначенияСвойств(ВременныйКонтекст, Контекст);
				ВременныйКонтекст.ТекущийКлючРаздела = Элемент.Ключ;
				
				РассчитатьЗначениеВыбора(ВременныйКонтекст, Элемент.Значение, Результат, СписокДопустимыхТипов, КэшЗначенийИни, Путь);
				
			Иначе
				
				Если НЕ (Результат.Свойство(Элемент.Ключ) и ТипЗнч(Результат[Элемент.Ключ]) = Тип("Структура")) Тогда
					
					Результат.Вставить(Элемент.Ключ, Новый Структура);
					
				КонецЕсли;
				
				Для Каждого ПодРаздел из Элемент.Значение Цикл //Выбираем подузлы
					
					Если Не ПодРаздел.Значение.Количество() Тогда
						
						Продолжить;
						
					КонецЕсли;
						
					ВременныйКонтекст = Новый Структура("Документ, Переменные, Ини, ТекущийРазделИни, Параметры, ДанныеИсточник");
					ЗаполнитьЗначенияСвойств(ВременныйКонтекст, Контекст);
					ВременныйКонтекст.ТекущийРазделИни = Контекст.ТекущийРазделИни[Элемент.Ключ];
					Если ПодРаздел.Значение.Свойство("Значение") Тогда  
						
						// Если структура содержит на верхнем уровне узлы, которые нужно рассчитать, то передаем всю эту структуру в функцию рекурсивно
						// и прерываем цикл по подразделам
						Результат[Элемент.Ключ] = ЗаполнимДаннымиДокументаСтруктуру(Элемент.Значение, ВременныйКонтекст, СписокДопустимыхТипов,КэшЗначенийИни, Путь);
						Прервать;
					
					КонецЕсли; 
						
					// Если есть подструктуры, то делаем расчет для каждого подраздела
					Путь.Добавить(ПодРаздел.Ключ);
					ВременныйКонтекст.ТекущийРазделИни = ВременныйКонтекст.ТекущийРазделИни[ПодРаздел.Ключ];
		
					ЗначениеПараметра = ЗаполнимДаннымиДокументаСтруктуру(ПодРаздел.Значение, ВременныйКонтекст, СписокДопустимыхТипов,КэшЗначенийИни, Путь);
					Результат[Элемент.Ключ].Вставить(ПодРаздел.Ключ, ЗначениеПараметра);
					Путь.Удалить(Путь.Количество()-1);
						
				КонецЦикла;
				
			КонецЕсли;
			Путь.Удалить(Путь.Количество()-1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции	

//Отдельная процедура для лучшей читабельности. Рассчет выбора при выгрузке
&НаСервере
Процедура РассчитатьЗначениеВыбора(Контекст, ЗначениеУзлаИни, Результат, СписокДопустимыхТипов, КэшЗначенийИни, Путь)
	Перем ВыбранныйУзел, ЛокальныйТекущийРазделИни, ТипПодраздела, ИндексПозицииПути;
	
	ГлобальныйРазделВыбора		= Контекст.ТекущийРазделИни;
	Контекст.ТекущийРазделИни	= Контекст.ТекущийРазделИни[Контекст.ТекущийКлючРаздела];
	Контекст.Удалить("ТекущийКлючРаздела");
	МодульОбъектаСервер = МодульОбъектаСервер();
	
	Для Каждого ПодРазделВыбор Из ЗначениеУзлаИни Цикл //Выбираем подузлы
		Путь.Добавить(ПодРазделВыбор.Ключ);
		Если ТипЗнч(ПодРазделВыбор.Значение) = Тип("Структура") и ПодРазделВыбор.Значение.Количество() <> 0 Тогда													
			Если ПодРазделВыбор.Значение.Свойство("Условие") = Истина Тогда															
				Путь.Добавить("Условие");
				РезультатУсловия = МодульОбъектаСервер.РассчитатьЗначениеSABY("Условие", Контекст);
				Путь.Удалить(Путь.Количество() - 1);
				Если РезультатУсловия = Истина Тогда									
					ВыбранныйУзел = ПодРазделВыбор;									
					Путь.Удалить(Путь.Количество() - 1);
					Прервать;
				КонецЕсли;								
			Иначе
				ВыбранныйУзел = ПодРазделВыбор;
			КонецЕсли;								
		КонецЕсли;
		Путь.Удалить(Путь.Количество()-1);
	КонецЦикла;	
	Если ВыбранныйУзел = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Выбираем подузлы
	ИндексВПутиИсходный = Путь.Количество() -1;
	Путь.Добавить(ПодРазделВыбор.Ключ);
	Для Каждого ПодЭлемент Из ВыбранныйУзел.Значение Цикл 							
		Путь.Добавить(ПодЭлемент.Ключ);
		Если (Нрег(ПодЭлемент.Ключ) = "условие") Тогда
			
			// Узел условие не обрабатывается
			
		ИначеЕсли Лев(ПодЭлемент.Ключ, 5) = "Выбор" Тогда
			
			ВременныйКонтекст = Новый Структура("Документ, Переменные, Ини, ТекущийРазделИни, ТекущийКлючРаздела, Путь, Параметры, ДанныеИсточник");
			ЗаполнитьЗначенияСвойств(ВременныйКонтекст, Контекст);
			ВременныйКонтекст.ТекущийРазделИни		= Контекст.ТекущийРазделИни[ПодРазделВыбор.Ключ];
			ВременныйКонтекст.ТекущийКлючРаздела	= ПодЭлемент.Ключ;
			ВременныйКонтекст.Путь					= Путь;
			
			РассчитатьЗначениеВыбора(ВременныйКонтекст, ПодЭлемент.Значение, Результат, СписокДопустимыхТипов, КэшЗначенийИни, Путь);
			
		ИначеЕсли		ТипЗнч(ПодЭлемент.Значение) = Тип("Структура")
				И Не	ПодЭлемент.Значение.Свойство("Значение") Тогда
			Если Не Результат.Свойство(ПодЭлемент.Ключ) Тогда//Проверим наличие узла. Если есть, не добавляем.
				Результат.Вставить(ПодЭлемент.Ключ, Новый Структура);
			КонецЕсли;
			ПервыйУзел = Истина;
			Для Каждого ПодРаздел Из ПодЭлемент.Значение Цикл //Выбираем подузлы
				Если Лев(ПодРаздел.Ключ, 4) = "сбис" Тогда
					Продолжить;
				ИначеЕсли	ПодРаздел.Значение.Количество() = 0
					Или	(	Контекст.ТекущийРазделИни.Свойство(ПодЭлемент.Ключ)
						И	Контекст.ТекущийРазделИни[ПодЭлемент.Ключ].Свойство(ПодРаздел.Ключ)) Тогда
					//Узел есть в текущем контексте(сохранение приоритета пользовательской ини)
				ИначеЕсли	ПервыйУзел//Убрать проверку на первый узел
						И	ПодРаздел.Значение.Свойство("Тип", ТипПодраздела)
						И	(	НРег(ТипПодраздела) = "запрос"
							Или	НРег(ТипПодраздела) = "табличнаячасть") Тогда
					ТекущийРазделИни = Контекст.ТекущийРазделИни;
					Для СбисИндексПути = Путь.Количество() - 2 По Путь.Количество() - 1 Цикл
						ТекущийРазделИни = ТекущийРазделИни[Путь[СбисИндексПути]];
					КонецЦикла;
					ВременныйКонтекст = Новый Структура("Документ, Переменные, Ини, ТекущийРазделИни, Параметры, ДанныеИсточник");
					ЗаполнитьЗначенияСвойств(ВременныйКонтекст, Контекст);
					ВременныйКонтекст.ТекущийРазделИни = ТекущийРазделИни;
					
					Результат[ПодЭлемент.Ключ] = ЗаполнимДаннымиДокументаСтруктуру(ПодЭлемент.Значение, ВременныйКонтекст, СписокДопустимыхТипов,КэшЗначенийИни, Путь);
					//Первый элемент это описание ТЧ
					Прервать;
				Иначе
					
					Путь.Добавить(ПодРаздел.Ключ);
					ТекущийРазделИни = Контекст.ТекущийРазделИни;
					Для СбисИндексПути = Путь.Количество() - 3 По Путь.Количество() - 1 Цикл
						ТекущийРазделИни = ТекущийРазделИни[Путь[СбисИндексПути]];
					КонецЦикла;
					ВременныйКонтекст = Новый Структура("Документ, Переменные, Ини, ТекущийРазделИни, Параметры, ДанныеИсточник");
					ЗаполнитьЗначенияСвойств(ВременныйКонтекст, Контекст);
					ВременныйКонтекст.ТекущийРазделИни = ТекущийРазделИни;
					ЗначениеПараметра = ЗаполнимДаннымиДокументаСтруктуру(ПодРаздел.Значение, ВременныйКонтекст, СписокДопустимыхТипов,КэшЗначенийИни, Путь);
					Результат[ПодЭлемент.Ключ].Вставить(ПодРаздел.Ключ, ЗначениеПараметра);
					Путь.Удалить(Путь.Количество()-1);
					
				КонецЕсли;
				
				ПервыйУзел = Ложь;
			КонецЦикла;
		Иначе
			//Если значение узла занулено, то выбор срабатывает с заменой зануленного значения.
			Если	Контекст.ТекущийРазделИни.Свойство(ПодЭлемент.Ключ, ЛокальныйТекущийРазделИни)
				И	ЛокальныйТекущийРазделИни.Свойство("Значение")	И	ЛокальныйТекущийРазделИни.Значение = "''" Тогда
				Контекст.ТекущийРазделИни.Удалить(ПодЭлемент.Ключ);
			КонецЕсли;
			Если Не ГлобальныйРазделВыбора.Свойство(ПодЭлемент.Ключ) Тогда 
				Результат.Вставить(ПодЭлемент.Ключ, МодульОбъектаСервер.РассчитатьЗначениеSABY(ПодЭлемент.Ключ, Контекст));
				//Найдем обсчитываем раздел в структуре. Заполним то, что посчитано и вынесем его на требуемые уровень выбора для обсчета связанных параметров в продолжении обсчёта.
				УзелИзПодразделаДляДобавления = Контекст.ТекущийРазделИни;
				Для ИндексПоискаУзлаИни = ИндексВПутиИсходный + 1 По Путь.Количество() - 1 Цикл
					Если УзелИзПодразделаДляДобавления.Свойство("Значение") Тогда
						Прервать;//Если есть Значение, то это обсчитываемый узел
					КонецЕсли;
					УзелИзПодразделаДляДобавления = УзелИзПодразделаДляДобавления[Путь[ИндексПоискаУзлаИни]];
				КонецЦикла;
				
				Если Не Результат[ПодЭлемент.Ключ] = УзелИзПодразделаДляДобавления Тогда
					
					// Добавим как расчитанный результат, но только если сам узел это не результат
					УзелИзПодразделаДляДобавления.Вставить("РассчитанноеЗначение", Результат[ПодЭлемент.Ключ]);
					
				КонецЕсли;
				ГлобальныйРазделВыбора.Вставить(ПодЭлемент.Ключ, УзелИзПодразделаДляДобавления);
			КонецЕсли;
		КонецЕсли;
		Путь.Удалить(Путь.Количество()-1);
	КонецЦикла;
	Путь.Удалить(Путь.Количество()-1);
	
КонецПроцедуры

// Функция рассчитывает значение параметра из файла настроек на сервере.	
// Используется при заполнении структуры файла настроек данными из документа.
&НаСервере
Функция РассчитатьЗначениеНаСервере(Параметр, Контекст) Экспорт
	
	// Отключить кэширование значений в ини, т.к. нет гарантии что точка вызова расчета написана верно	
	Контекст.Вставить("Кэшировать", Ложь); 
	Возврат МодульОбъектаСервер().РассчитатьЗначениеSABY(Параметр, Контекст);

КонецФункции

