
&НаКлиенте
Процедура РезультатОтправки_ДополнитьДокументВложениями_УстановитьСценарий(РезультатОтправки, ПараметрыДляШаблон) Экспорт
	
	ЦепочкаКомандОбработки	= ПараметрыДляШаблон.ЦепочкаКомандОбработки;
	ПараметрыВходящие		= ПараметрыДляШаблон.ПараметрыВходящие;
	ПараметрыСценария		= ПараметрыДляШаблон.ПараметрыСценария;
	
	СформироватьДокумент = НЕ ЭтоТипСбис(ПараметрыВходящие.СоставПакета, "СоставПакета");
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "ДополнитьДокументВложениями_СформироватьДокумент",	СформироватьДокумент);
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "ДополнитьДокументВложениями_ДопПараметры",			ПараметрыСценария);
	
	ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "РезультатОтправки_Асинх_ДополнитьДокументВложениями", ПараметрыВходящие);
	
КонецПроцедуры

