
&НаКлиенте
Процедура РезультатОтправки_ПодготовитьСтруктуруДокумента_УстановитьСценарий(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыВходящие)
	
	// Подготовим запуск команды на Подготовить структуру. В случае, если это черновик команда удалится
	ПараметрыПодготовить = РезультатОтправки_ПодготовитьСтруктуруДокумента_Параметры(РезультатОтправки, ПараметрыВходящие);
	
	// Установить основание генерации, может потребоваться при обработке ошибок и пр.
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "ОснованиеГенерацииСоставПакета", ПараметрыПодготовить.Аргумент.СоставПакета);
	ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "РезультатОтправки_Асинх_ПодготовитьСтруктуруДокумента", ПараметрыПодготовить);

КонецПроцедуры

&НаКлиенте
Функция РезультатОтправки_ПодготовитьСтруктуруДокумента_Параметры(РезультатОтправки, ПараметрыВходящие)
	Перем ПараметрыДополнительно;
	
	// Это не готовый документ, проверить запуск подготовки документа
	ПараметрыПодготовить	= Новый Структура("МодульПодготовки, ИмяПослеФормирования", 2);
	АргументДляПодготовить	= Новый Структура("ВерсияФормирования, СоставПакета, НеЗапускатьВДокументооборот", 2);
	ЗаполнитьЗначенияСвойств(ПараметрыПодготовить,		ПараметрыВходящие);
	ЗаполнитьЗначенияСвойств(АргументДляПодготовить,	ПараметрыВходящие);
	
	ПараметрыПодготовить.Вставить("Аргумент", АргументДляПодготовить);
	
	Если ПараметрыВходящие.МодульПодготовки = Неопределено Тогда
		
		ПараметрыПодготовить.МодульПодготовки = РезультатОтправки.ПараметрыОтправки.МодульПодготовки;
		
	КонецЕсли;
	
	Если ПараметрыПодготовить.ИмяПослеФормирования = Неопределено Тогда
	
		ПараметрыПодготовить.ИмяПослеФормирования = РезультатОтправки.ПараметрыОтправки.ИмяРазделаОтправки;
		
	КонецЕсли;
	
	Если АргументДляПодготовить.НеЗапускатьВДокументооборот = Неопределено Тогда
		
		АргументДляПодготовить.НеЗапускатьВДокументооборот = РезультатОтправки.ПараметрыОтправки.НеЗапускатьВДокументооборот;
		
	КонецЕсли;

	Если	Не	ПараметрыВходящие = Неопределено
		И		ПараметрыВходящие.Свойство("Дополнительно", ПараметрыДополнительно)
		И		ПараметрыДополнительно.Свойство("ПодготовитьСтруктуруДокумента", ПараметрыДополнительно) Тогда
		
		АргументДляПодготовить.Вставить("Дополнительно", ПараметрыДополнительно);
		
	КонецЕсли;
	

	Возврат ПараметрыПодготовить;
	
КонецФункции

