
// Область, которая описывает работу методов, одинаково работающих на клиенте и сервере
// Для ОФ и УФ Обращение пишется одинаково - МодульОбъектаКлиент()/МодульОбъектаСервер() в зависимости от контекста (для ОФ зареймленного)

#Область include_core2_vo2_МодульОбъекта_АПИ_КлиентСервер
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_КлиентСервер_РаботаСПараметрами_Получить
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_КлиентСервер_Авторизация
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_КлиентСервер_Классы
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_КлиентСервер_Списки
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_КлиентСервер_ОбщиеФункцииИПроцедуры
#КонецОбласти

#Область include_core_base_Helpers_JSON802
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_КлиентСервер_ОбщегоНазначения
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_КлиентСервер_Файлы
#КонецОбласти

