
// Функция - возвращает хеш сумму значения SABY
//
// Параметры:
//  ДанныеХешПолучить	 - Произвольный	 - объект, хэш которого надо получить
//  ДопПараметры		 - Структура/Неопределено	 - Расширение метода
// 
// Возвращаемое значение:
//  Строка - Хеш сумма объекта для сравнения
//
&НаКлиенте
Функция ХешСуммаЗначенияSABY(ДанныеХешПолучить, ДопПараметры = Неопределено) Экспорт
	
	Если		ТипЗнч(ДанныеХешПолучить) = Тип("Файл") Тогда
		
		Результат	= ДанныеХешПолучить.ПолноеИмя;
		Результат	= Результат + ДанныеХешПолучить.ПолучитьВремяИзменения();
		
	ИначеЕсли	ТипЗнч(ДанныеХешПолучить) = Тип("ДвоичныеДанные") Тогда

		Попытка
			
			ХешЗначенийПривести = Вычислить("Новый ХешированиеДанных(ХешФункция.MD5)");
			ХешЗначенийПривести.Добавить(ДанныеХешПолучить);
			Результат = Строка(ХешЗначенийПривести.ХешСумма);
			
		Исключение
			
			Результат = Строка(Новый УникальныйИдентификатор);
			
		КонецПопытки;
		
	Иначе
		
		Результат = Строка(ДанныеХешПолучить);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция - сериализует объект для возврата на клиент
//
// Параметры:
//  ОбъектСериализации	 - Произвольный	 - объект, который требуется получить на клиенте. 
// 
// Возвращаемое значение:
//  Произвольный - Приводит таблицы и запросы к массиву структур.
//
&НаКлиенте
Функция СериализоватьОбъектДляВозвратаНаКлиент(ОбъектСериализации) Экспорт 
	
	Возврат ОбъектСериализации;
	
КонецФункции
	
#Область include_core2_vo2_МодульОбъекта_ТонкийКлиент_ОберткиДляПереадресации
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_РаботаСоСтроками //&НаКлиенте
#КонецОбласти

