
// Функция проверяет параметры бокумента в СБИС и возвращает описание причины блокировки 
//
// Параметры:
//  СоставПакета - Структура - обрабатываемый пакет (документ) 
//  ДопПараметры - Структура - Набор полей, работа с которыми может расширить результат работы функции. 
// 
// Возвращаемое значение:
//   Структура   - Результат проверки. Флаг блокировки и описание причины блокировки
//
&НаКлиенте
Функция ПроверитьБлокировкуОтправкиПакетаВСБИС(СоставПакета, ДопПараметры = Неопределено) Экспорт
	
	ПроверкаБлокировки = Новый Структура("БлокироватьОтправку, ПричинаБлокировки", Ложь, ""); 
		
	//Если Не СоставПакета.Свойство("Этап") Тогда
	//	
	//	ТекстОшибки = "Отсустствуют активные этапы";
	//	ПроверкаБлокировки.БлокироватьОтправку	= Истина;
	//	ПроверкаБлокировки.ПричинаБлокировки	= НовыйСбисИсключение(СоставПакета, "МодульОбъектаКлиент.ПроверитьБлокировкуОтправкиПакетаВСБИС", 710,,ТекстОшибки);
	//  	Возврат ПроверкаБлокировки;

	//КонецЕсли;
	
	СкладскиеПараметры = ПолучитьСкладскиеПараметрыДокумента(СоставПакета, ДопПараметры);  
	
	УказанКонтракт = СкладскиеПараметры.ПоказатьГосконтракт;
	НомерКонтракта = СкладскиеПараметры.ИдентификаторГосконтракта;
	
	Если УказанКонтракт И СтрДлина(СокрЛП(НомерКонтракта)) < 20 Тогда
		ПроверкаБлокировки.БлокироватьОтправку = Истина;
		ПроверкаБлокировки.ПричинаБлокировки = "Некорректно заполнены обязательные поля: № контракта должен содержать от 20 до 25 символов";
	КонецЕсли;
	
	Возврат ПроверкаБлокировки;
	
КонецФункции

