
// Функция - Конструктор класса для асинхронной отправки
//
// Параметры:
//  ПараметрыКонструктора	- Структура	 - ПараметрыОтправки, ДанныеКОтправке, ОбработчикРезультата, ВерсияФормата
//		ДанныеКОтправке	- Струкутра
//			СписокПакетов		- массив	- из структур с полем "СоставПакета", где в качестве значения - список значений из элементов:
//							значение - ссылка на документ 1С, представление - имя настройки которой обрабатывается документ
//			МодульПодготовки	- форма		- которой осуществляется расчёт документа на выгрузку.
// 
//		ВерсияФормата		- Число 1/2 версия класса - старая/новая отправка
// Возвращаемое значение:
//  РезультатОтправки	 - РезультатОтправки (Структура)	 - класс для отправки
//
&НаКлиенте
Функция НовыйРезультатОтправки(ПараметрыКонструктора) Экспорт
	
	//Число потоков в отправке - сколько можно впихнуть в компонент, отвечающий за отправку за раз
	//Размер пачки - сколько пакетов пихаем за итерацию.
	ВерсияФорматаКласса = 2;
	Если ПараметрыКонструктора.Свойство("ВерсияОтправки") Тогда
		ВерсияФорматаКласса = ПараметрыКонструктора.ВерсияОтправки;
	КонецЕсли;
		
	РезультатОтправки = РезультатОтправки_Пустой(ВерсияФорматаКласса);
	Если ВерсияФорматаКласса = 1 Тогда
		ПараметрыКонструктора.Свойство("ОбработчикРезультата", РезультатОтправки.ОбработчикРезультата);

		Возврат РезультатОтправки;
	КонецЕсли;
	
	//Подключить обработку прерывания
	ОбработкаЗавершения		= НовыйСбисОписаниеОповещения("РезультатОтправки_МассоваяОтправка_Завершение", МодульОбъектаКлиент(), РезультатОтправки);
	ФормаИндикатор			= ПолучитьФормуОбработки("ФормаИндикатора", Новый Структура("ПолучитьНовую", Истина));
	ФормаИндикатор.ОписаниеОповещенияОЗакрытии = ОбработкаЗавершения;
	ПараметрыИндикатора		= Новый Структура("Прерывать, БлокироватьИнтерфейс", Истина, Истина);

	ПараметрыОтправки = Новый Структура("КоличествоПотоков, РазмерПачки, МодульПодготовки, Владелец, ИмяРазделаОтправки, ОжиданиеОтвета", 10, 1);
	ЗаполнитьЗначенияСвойств(ПараметрыОтправки, ПараметрыКонструктора);
    //Значения по-умолчанию
	Если Не ПараметрыКонструктора.Свойство("Владелец") Тогда
		ПараметрыОтправки.Владелец = ГлавноеОкно;
	КонецЕсли;
	Если 	Не	ПараметрыКонструктора.Свойство("МодульПодготовки")
		И		ГлавноеОкно.Кэш.Текущий.Свойство("Форма") Тогда
		ПараметрыОтправки.МодульПодготовки = ГлавноеОкно.Кэш.Текущий.Форма;
	КонецЕсли;
	Если Не ПараметрыКонструктора.Свойство("ИмяРазделаОтправки") Тогда
		ПараметрыОтправки.ИмяРазделаОтправки = ГлавноеОкно.Кэш.Текущий.ТипДок;
	КонецЕсли;
	Если Не ПараметрыКонструктора.Свойство("КоличествоПотоков") Тогда
		ПараметрыОтправки.КоличествоПотоков = ПолучитьЗначениеПараметраСбис("Потоки_МаксимальноеКоличество");
	КонецЕсли;
	Если Не ПараметрыКонструктора.Свойство("ОжиданиеОтвета") Тогда
		ПараметрыОтправки.ОжиданиеОтвета = ПолучитьЗначениеПараметраСбис("ВремяОжиданияОтвета_Отправка");
		Если ПараметрыОтправки.ОжиданиеОтвета = Неопределено Тогда
			ПараметрыОтправки.ОжиданиеОтвета = ПолучитьЗначениеПараметраСбис("ВремяОжиданияОтвета") * 2;
		КонецЕсли;
	КонецЕсли;
	Если Не ПараметрыКонструктора.Свойство("РазмерПачки") Тогда
		ПараметрыОтправки.РазмерПачки = ПолучитьЗначениеПараметраСбис("Отправка_РазмерПачки");
	КонецЕсли;	
	
	ПараметрыОтправки.Вставить("Потоки",				Новый Соответствие);
	ПараметрыОтправки.Вставить("СтатусПоПачкам",		ПараметрыОтправки.РазмерПачки > 3);
	ПараметрыОтправки.Вставить("Индикатор",				ФормаИндикатор);
	ПараметрыОтправки.Вставить("ПараметрыИндикатора",	ПараметрыИндикатора);
	ПараметрыОтправки.Вставить("ОбработчикЗавершить",	ОбработкаЗавершения);
	ПараметрыОтправки.Вставить("ЕстьДоступКБЛ",			ПолучитьЗначениеПараметраСбис("Авторизован"));
	
	СчётчикиОтправки = Новый Структура("ВсегоСтрок", ПараметрыКонструктора.ДанныеКОтправке.СписокПакетов.Количество());
	СчётчикиОтправки.Вставить("СформированоПакетов",	0);//От одного документа 1С может нагенерированно несколько пакетов.
	СчётчикиОтправки.Вставить("ОтправленоПачек",		0);//Сколько было обработано пачек
	СчётчикиОтправки.Вставить("ИндексТекущегоПакета",	0);//Индекс обсчитываемых пакетов из СписокПакетов.
	СчётчикиОтправки.Вставить("ОшибокПодготовки",		0);//Число ошибок на стадии до отправки
	СчётчикиОтправки.Вставить("ОшибокОтправки",			0);//Число ошибок в моменте завершения подготовки и попытки отправить
	СчётчикиОтправки.Вставить("ПовторныхОтправок",		0);//Если теряли авторизацию, то сколько пакетов повторно было отправлено после переавторизации
	СчётчикиОтправки.Вставить("ПервичныхОтправок",		0);//Отправляли в поток после подготовки.
	
	МодульПодписок		= МодульОбъектаКлиент();
	ИмяФункцииОшибки	= "РезультатОтправки_Асинх_Ошибка";
	
	ПодпискиПоУмолчанию = Новый Структура;
	ПодпискиПоУмолчанию.Вставить("BeforeCall",	Новый Структура("Функция, Модуль",	"РезультатОтправки_Асинх_ПередОтправкой",	МодульПодписок));
	ПодпискиПоУмолчанию.Вставить("AfterCall",	Новый Структура("Функция, Модуль",	"РезультатОтправки_Асинх_ПослеОтправки",	МодульПодписок));
	ПодпискиПоУмолчанию.Вставить("Error",		Новый Структура("Функция, Модуль",	ИмяФункцииОшибки,							МодульПодписок));
	ПодпискиПоУмолчанию.Вставить("Message",		Новый Структура("Функция, Модуль",	"РезультатОтправки_Асинх_Ответ",			МодульПодписок));
	ПодпискиПоУмолчанию.Message.Вставить("ФункцияОшибки", ИмяФункцииОшибки);
	
	Подписки_Прочитать = Новый Структура;
	Подписки_Прочитать.Вставить("Error",	Новый Структура("Функция, Модуль",	ИмяФункцииОшибки,									МодульПодписок));
	Подписки_Прочитать.Вставить("Message",	Новый Структура("Функция, Модуль",	"РезультатОтправки_Асинх_ПрочитатьДокумент_Ответ",	МодульПодписок));
	Подписки_Прочитать.Message.Вставить("ФункцияОшибки", ИмяФункцииОшибки);
	
	ПодпискиДляКоманд = Новый Соответствие;
	ПодпискиДляКоманд.Вставить("WriteDocumentEx",	ПодпискиПоУмолчанию);
	ПодпискиДляКоманд.Вставить("ExecuteActionEx",	ПодпискиПоУмолчанию);
	ПодпискиДляКоманд.Вставить("ReadDocumentEx",	Подписки_Прочитать);
	
	//
	//
	//
	//ОтложенноеЗавершение	= НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения, Аргумент", ОбработкаЗавершения, "Прервано"));
	ОчередьОтправки	= Новый Структура("Подготовлены, Сформированы, КомандыПодготовлены, ДействияОбрабатываются");
	ОчередьОтправки.Подготовлены			= Новый Соответствие;
	ОчередьОтправки.Сформированы			= Новый Соответствие;
	ОчередьОтправки.КомандыПодготовлены		= Новый Соответствие; // АсинхронныеСбис3Команды, готовые к запуску
	ОчередьОтправки.ДействияОбрабатываются	= Новый Соответствие; // ОтправкиДокумента, находящиеся в процессе
	
	РезультатОтправки.ВремяНачала			= ПолучитьДатуВМиллисекундах();
	РезультатОтправки.ОбработчикРезультата	= ПараметрыКонструктора.ОбработчикРезультата;
	РезультатОтправки.ДанныеКОтправке		= ПараметрыКонструктора.ДанныеКОтправке;//Структура - СписокПакетов, МодульПодготовки, СчетчикПакетов
	
	ДанныеСертификаты	= Новый Структура("ИННАктивированы, ИННАктивировать, ИННВОбработке, ИННОшибки, Список", 
		Новый СписокЗначений, 
		Новый СписокЗначений,
		Новый СписокЗначений,
		Новый Соответствие);
	ЦепочкаКомандОбработки_УстановитьДанные(РезультатОтправки, "КэшСертификатов",		ДанныеСертификаты);
	ЦепочкаКомандОбработки_УстановитьДанные(РезультатОтправки, "АсинхронныеКоманды",	Новый Соответствие);
	ЦепочкаКомандОбработки_УстановитьДанные(РезультатОтправки, "Очередь",				Новый Соответствие);
	ЦепочкаКомандОбработки_УстановитьДанные(РезультатОтправки, "ПачкаНаОтправку",		Новый Соответствие);
	ЦепочкаКомандОбработки_УстановитьДанные(РезультатОтправки, "Блокировка",			0);
	ЦепочкаКомандОбработки_УстановитьДанные(РезультатОтправки, "ПодпискиДляКоманд",	ПодпискиДляКоманд);
	
	РезультатОтправки.Вставить("Счетчики",				СчётчикиОтправки);
	РезультатОтправки.Вставить("ПараметрыОтправки",		ПараметрыОтправки);
	РезультатОтправки.Вставить("Очередь",				ОчередьОтправки);	
	
	Возврат РезультатОтправки;

КонецФункции

// Функция - Результат отправки версия
//
// Параметры:
//  РезультатОтправки	 - Структура - Результат отправки документа или пачки документов
// 
// Возвращаемое значение:
// ВерсияОтправки  - Решено было, что 1 - старая отправка, 2 - новая отправка
//
&НаКлиенте
Функция РезультатОтправки_Версия(РезультатОтправки) Экспорт

	Если РезультатОтправки.Свойство("ВерсияЭкземпляра") И РезультатОтправки.ВерсияЭкземпляра = 2 Тогда
		Возврат 2;
	Иначе
		Возврат 1;
	КонецЕсли;
	
КонецФункции

// Функция - Результат отправки пустой
//
// Параметры:
//  ВерсияЭкземпляра - Число	 - версия экземпляра
// 
// Возвращаемое значение:
//  РезультатОтправки - экземпляр класса
//
&НаКлиенте
Функция РезультатОтправки_Пустой(ВерсияЭкземпляра = 2) Экспорт
	
	//Тут нужен рефактор по структуре этой помойки
	РезультатОтправки		= НовыйЦепочкаКомандОбработки();
	РезультатОтправкиСтарый = Новый Структура(
	"_класс, ОбработчикРезультата, 
	|Отправлено, НеОтправлено, НеСформировано,Ошибок, КоличествоПереотправок, ВсегоПакетов, ОшибкиДоОтправки, ПорНомер, 
	|ОтправленоСообщений, ПолученоОтветов, ВремяНачала, ВремяФормирования, ВремяОтправки, ВремяЗаписиСтатусов, ВремяПолученияДанных, ВремяОжиданияОтвета", 
	"РезультатОтправки", ,
	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
	Для Каждого КлючИЗначение Из РезультатОтправкиСтарый Цикл
		РезультатОтправки.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатОтправки.Вставить("ТипыОшибок", 			Новый СписокЗначений);
	РезультатОтправки.Вставить("ДанныеПоСтатусам",		Новый Массив);
	РезультатОтправки.Вставить("ДетализацияОшибок",		Новый Соответствие);
	РезультатОтправки.Вставить("ДетализацияОтправки",	Новый Соответствие);
	РезультатОтправки.Вставить("НаЗаписьСтатусов",		Новый Структура("Ошибки, Ответы", Новый Соответствие, Новый Соответствие));
	РезультатОтправки.Вставить("ВерсияЭкземпляра",		ВерсияЭкземпляра);
	РезультатОтправки.Вставить("ПрикладнаяСтатистика",	НовыйПрикладнаяСтатистика()); // ВААл. Для накопления параметров прикладной статистистики
	Если ВерсияЭкземпляра = 2 Тогда
		РезультатОтправки.Вставить("ДанныеКОтправке",	Новый Соответствие);
	Иначе
		РезультатОтправки.Вставить("Новый",						Истина);//Если стоит признак, то считаем отправку пустой. Если признака нет, либо ложь, то требуется пересоздать
		РезультатОтправки.Вставить("ТипыОшибок",				Новый СписокЗначений);
		РезультатОтправки.Вставить("КоличествоСвободныхПотоков",ГлавноеОкно.Кэш.КоличествоПотоковОтправки);
		РезультатОтправки.Вставить("ВремяНачала",				ПолучитьДатуВМиллисекундах());
		РезультатОтправки.Вставить("СформированныеПакеты",		Новый Соответствие);
		РезультатОтправки.Удалить("ДанныеКоманд");
	КонецЕсли;
		
	Возврат РезультатОтправки;
	
	
КонецФункции

// Функция - Результат отправки скопировать
//
// Параметры:
//  РезультатОтправки	 - РезультатОтправки	 - Структура отправки
//  ДляСервера			 - Булево				 - Удалить ли не сериализуемые параметры
// 
// Возвращаемое значение:
//  РезультатОтправки - копия структуры отправки
//
&НаКлиенте
Функция РезультатОтправки_Скопировать(РезультатОтправки, ДляСервера=Ложь) Экспорт
	
	РезультатНовый = РезультатОтправки_Пустой();
	ЗаполнитьЗначенияСвойств(РезультатНовый, РезультатОтправки);

	Если ДляСервера Тогда
		РезультатНовый.Удалить("ДанныеКОтправке");
		РезультатНовый.Удалить("ОбработчикРезультата");
		РезультатНовый.Удалить("ПараметрыОтправки");
		РезультатНовый.Удалить("ОтложенноеЗавершение");
		РезультатНовый.Удалить("ПодпискиДляКоманд");
	КонецЕсли;
	Возврат РезультатНовый;

КонецФункции

// Функция - выгружает результат отправки для показа на форме просмотра результата
//
// Параметры:
//  РезультатОтправки		 - РезультатОтправки	 - Структура отправки
//  ВерсияФорматаОтвета		 - Число				 - версия 1/2
// 
// Возвращаемое значение:
//  РезультатОтправки - копия структуры отправки
//
&НаКлиенте
Функция РезультатОтправки_Выгрузить(РезультатОтправки, ВерсияФорматаОтвета=1) Экспорт
	
	Если ВерсияФорматаОтвета = 1 Тогда
		РезультатНовый = РезультатОтправки_Пустой(ВерсияФорматаОтвета);
		ЗаполнитьЗначенияСвойств(РезультатНовый, РезультатОтправки);
		РезультатНовый.Вставить("Ошибок", РезультатОтправки.Счетчики.ОшибокПодготовки + РезультатОтправки.Счетчики.ОшибокОтправки - РезультатОтправки.Счетчики.ПовторныхОтправок);
		РезультатНовый.ОтправленоСообщений	= РезультатОтправки.Счетчики.ПервичныхОтправок + РезультатОтправки.Счетчики.ПовторныхОтправок;
		РезультатНовый.НеОтправлено			= РезультатОтправки.Ошибок;
		РезультатНовый.ОшибкиДоОтправки		= РезультатОтправки.Счетчики.ОшибокПодготовки;
		РезультатНовый.НеСформировано   	= РезультатОтправки.Счетчики.ОшибокПодготовки;
		РезультатНовый.ВсегоПакетов			= РезультатОтправки.Счетчики.СформированоПакетов;

		РезультатНовый.Удалить("ДанныеКОтправке");
		РезультатНовый.Удалить("ОбработчикРезультата");
		РезультатНовый.Удалить("ПараметрыОтправки");
		РезультатНовый.Удалить("ПодпискиДляКоманд");
		Если РезультатОтправки.Свойство("ПрерватьОтправку") Тогда
			РезультатНовый.Вставить("ПрерватьОтправку", РезультатОтправки.ПрерватьОтправку);
		КонецЕсли;
	Иначе
		РезультатНовый = РезультатОтправки;
	КонецЕсли;
	Возврат РезультатНовый;

КонецФункции

// Процедура - процедура запускает массовую отправку документов
//
// Параметры:
//  РезультатОтправки	 - класс РезльтатОтправки(Структура)
//  ДопПараметры		 - Структура, Необязательный	 - для расширения
//
&НаКлиенте
Процедура РезультатОтправки_МассоваяОтправка(РезультатОтправки, ДопПараметры=Неопределено) Экспорт
	
	ДанныеКОтправке = РезультатОтправки.ДанныеКОтправке;

	Попытка
		РезультатОтправки_ОбработкаПрерывания(РезультатОтправки);
	Исключение
		ОшибкаЗавершения = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.РезультатОтправки_МассоваяОтправка_Завершение");
		Если ОшибкаЗавершения.code = 790 Тогда
			//Тут просто прервать отправку, форма индикатора должна вызвать завершение.
			Возврат;
		КонецЕсли;
	КонецПопытки;

	Если		Не	ОшибкаЗавершения = Неопределено Тогда
		ОтложенноВыполнить		= НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения, Аргумент", РезультатОтправки.ПараметрыОтправки.ОбработчикЗавершить, ОшибкаЗавершения));
	ИначеЕсли		РезультатОтправки.Счетчики.ИндексТекущегоПакета < ДанныеКОтправке.СписокПакетов.Количество() Тогда //Отправляемые пакеты
		//Делаем отложенно отправку пакета для пропуска и возможности нажать на прерывание
		ОбработкаОтправкиПакета	= НовыйСбисОписаниеОповещения("РезультатОтправки_ПодготовитьСледующееДействие", МодульОбъектаКлиент());
		ОтложенноВыполнить		= НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения, ИдентификаторДействия, Аргумент", ОбработкаОтправкиПакета, Новый УникальныйИдентификатор, РезультатОтправки));
	Иначе
		//Всё отправлено, перейти к получению ответов.
		ОтложенноВыполнить		= НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения, Аргумент", РезультатОтправки.ПараметрыОтправки.ОбработчикЗавершить, "ОжиданиеОтветов"));
	КонецЕсли;
	РезультатОтправки.Вставить("ПоследнееОтложенноеДействие", ОтложенноВыполнить);
	
	ПодключитьОтложенноеДействие(ОтложенноВыполнить);
	
КонецПроцедуры

// Процедура - процедура запускает следующее действие из пула отправки документов
//
// Параметры:
//  РезультатОтправки		 - РезультатОтправки	 - Структура отправки
//  ПараметрыПодготовкиВходящие	 - Структура, Необязательный	 - для расширения
//
&НаКлиенте
Процедура РезультатОтправки_ПодготовитьСледующееДействие(РезультатОтправки, ПараметрыПодготовкиВходящие = Неопределено) Экспорт
	Перем МассивПодготовленныхПакетов;
	
	ДанныеКОтправке		= РезультатОтправки.ДанныеКОтправке;
	ВсегоСтрок			= ДанныеКОтправке.СписокПакетов.Количество();
	ВыбранаСтрока		= ДанныеКОтправке.СписокПакетов[РезультатОтправки.Счетчики.ИндексТекущегоПакета];
	ОчередьДействий		= ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "Очередь");
	ПараметрыБлокировки	= ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "Блокировка");
	ЧислоПотоков		= РезультатОтправки.ПараметрыОтправки.КоличествоПотоков;
	
	// При слишком большой очереди, или блокировке на низкоуровненые действия не формируем новые команды
	Если		ОчередьДействий.Количество() < ЧислоПотоков * 2
		И	Не	ПараметрыБлокировки > 0 Тогда 
		Попытка
			ВыбранаСтрока = ДанныеКОтправке.СписокПакетов[РезультатОтправки.Счетчики.ИндексТекущегоПакета];
			Если ТипЗнч(ДанныеКОтправке.СписокПакетов) = Тип("СписокЗначений") Тогда
				
				ВыбранаСтрока = ВыбранаСтрока.Значение;
				
			КонецЕсли;
			РезультатОтправки.Счетчики.ИндексТекущегоПакета	= РезультатОтправки.Счетчики.ИндексТекущегоПакета + 1;
			
			СтатусИндекс = РезультатОтправки.Счетчики.ИндексТекущегоПакета * 100 / РезультатОтправки.Счетчики.ВсегоСтрок;
			РезультатОтправки_ПоказатьСтатус(РезультатОтправки, "Подготовка электронных документов", СтатусИндекс, "(прервать -  Ctrl+Break)");
		
		    //Если нет подготовленных к отправке пакетов, то необходимо их сделать на основании имеющихся документов 1С
			Если ВыбранаСтрока.Свойство("МассивПодготовленныхПакетов", МассивПодготовленныхПакетов) Тогда
				
				// Есть уже подготовленные пакеты, надо проверить их статус и сгенерировать действия
				Для Каждого ПодготовленныйПакет Из МассивПодготовленныхПакетов Цикл
					
					ЦепочкаКомандОбработки	= НовыйЦепочкаКомандОбработки(ПодготовленныйПакет);
					РезультатОтправки_СгенерироватьКомандыДляДействия(РезультатОтправки, ЦепочкаКомандОбработки, ПодготовленныйПакет);
					
				КонецЦикла;
				
			Иначе
				
				ЦепочкаКомандОбработки	= НовыйЦепочкаКомандОбработки();
				РезультатОтправки_СгенерироватьКомандыДляДействия(РезультатОтправки, ЦепочкаКомандОбработки, ВыбранаСтрока);
				
			КонецЕсли;
			
		Исключение
			
			//Если прервано с ошибкой, то завершаем отправку и переходим к обработке завершения
			РезультатОтправки.Вставить("ПрерватьОтправку", НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.РезультатОтправки_МассоваяОтправка_Завершение"));
			
		КонецПопытки;
		
	КонецЕсли;
	
	РезультатОтправки_ПроверитьНакопленныеДействия(РезультатОтправки);

	//Продолжить итерацию
	РезультатОтправки_МассоваяОтправка(РезультатОтправки);

КонецПроцедуры

// Процедура - проверить и запустить накопленные цепочки действия.
//
// Параметры:
//  РезультатОтправкиё			 - РезультатОтправки	 - структура отправки
//  СчетчикОбработанныхДействий	 - Число				 - сколько действие обработано
//
&НаКлиенте
Процедура РезультатОтправки_ПроверитьНакопленныеДействия(РезультатОтправки, СчетчикОбработанныхДействий = 0) Экспорт
	
	Попытка
		
		ПараметрыКОтправке			= РезультатОтправки.ПараметрыОтправки;
		ДанныеКОтправке				= РезультатОтправки.ДанныеКОтправке;
		ОчередьДействий				= ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "Очередь");
		ИдентификаторыОбработаны	= Новый Массив;
		
		Для Каждого КлючИЗначениеДействие Из ОчередьДействий Цикл
			
			ЦепочкаКомандОбработки	= КлючИЗначениеДействие.Значение;
			СтатусДействия			= ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "Статус");
			ТекущаяБлокировка		= ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "Блокировка");
			
			Если	СтатусДействия = "Завершено" Тогда
				
				ИдентификаторыОбработаны.Добавить(КлючИЗначениеДействие.Ключ);
				Продолжить;
				
			КонецЕсли;
			
			Если ЦепочкаКомандОбработки.УровеньДействия < ТекущаяБлокировка Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			//Если 		СтатусДействия = "Запущено" Тогда
			//	
			//	ОшибкаДействия	= "Действие было запущено, но не обработано.";
			//	СтатусДействия	= "Ошибка";
			//	ОшибкаОбработки = НовыйСбисИсключение(, "МодульОбъектаКлиент.РезультатОтправки_ПроверитьНакопленныеДействия",,,ОшибкаДействия);
			//	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, СтатусДействия, ОшибкаОбработки);
			//	
			//КонецЕсли;
			
			Если		СтатусДействия = "Ошибка" Тогда
				
				ВыполняемоеДействие	= ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "ТекущаяКоманда");
				ПараметрыОшибки		= ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "Ошибка");
				РезультатОтправки_ОбработатьОшибку(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыОшибки);
				
				ИдентификаторыОбработаны.Добавить(КлючИЗначениеДействие.Ключ);

			ИначеЕсли	СтатусДействия = "ГотовКЗапуску" Тогда
				
				ЦепочкаКомандОбработки_ЗапуститьКоманду(ЦепочкаКомандОбработки, РезультатОтправки);
				СчетчикОбработанныхДействий = СчетчикОбработанныхДействий + 1;
				Продолжить;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого ИдентификаторОтработан Из ИдентификаторыОбработаны Цикл
			
			ОчередьДействий.Удалить(ИдентификаторОтработан);
			
		КонецЦикла;

		РезультатОтправки_ЗапуститьПрочиеКоманды(РезультатОтправки);
		РезультатОтправки_ОбработатьОтветы_Асинхронно(РезультатОтправки);
		
	Исключение
		
		//Если прервано с ошибкой, то завершаем отправку и переходим к обработке завершения
		РезультатОтправки.Вставить("ПрерватьОтправку", НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.РезультатОтправки_МассоваяОтправка_Завершение"));
		
	КонецПопытки;
	
КонецПроцедуры
	
// Процедура - операции для завершения отправки, после выполнения всех требуемых действий
//
// Параметры:
//  АргументЗавершения	 - Строка/СбисИсключение - с чем завершается отправка. Если Исключение, то заканчивается вообще. Иначе, может ожидать получения всех ответов
//  РезультатОтправки	 - РезультатОтправки	 - структура отправки
//
&НаКлиенте
Процедура РезультатОтправки_МассоваяОтправка_Завершение(АргументЗавершения="Завершено", РезультатОтправки) Экспорт 
	
	Отказ = Ложь;
	Если		АргументЗавершения = Неопределено Тогда
		
		//Ложное срабатывание. Возможно, закрыли форму индикатора.
		Возврат;
		
	ИначеЕсли	АргументЗавершения = "Завершено" Тогда
		
		//Всё ок, дошли до конца
		
	ИначеЕсли	АргументЗавершения = "Прервать" Тогда
		
		//Поступила команда прервать. Надо чтобы все прошлые обработчики закончили работу и уже потом позвать завершение 
		ОтложенноВыполнить = НовыйОтложенноеДействие(
			Новый Структура("ОписаниеОповещения, Аргумент, ИдентификаторДействия", 
			РезультатОтправки.ПараметрыОтправки.ОбработчикЗавершить, "Прервано", Новый УникальныйИдентификатор));
		ПодключитьОтложенноеДействие(ОтложенноВыполнить);
		Возврат		
	
	ИначеЕсли	АргументЗавершения = "Прервано" Тогда
		
		//Обработка прервалась
		Если РезультатОтправки.Свойство("ПоследнееОтложенноеДействие") Тогда
			ОтключитьОтложенноеДействие(РезультатОтправки.ПоследнееОтложенноеДействие);
			РезультатОтправки.Удалить("ПоследнееОтложенноеДействие");
		КонецЕсли;
		АргументЗавершения = НовыйСбисИсключение(790, "МодульОбъектаКлиент.РезультатОтправки_МассоваяОтправка_Завершение");
		Отказ = Истина;
		
	ИначеЕсли	АргументЗавершения = "ОжиданиеОтветов" Тогда
		
		ДанныеКОтправке = РезультатОтправки.ДанныеКОтправке;
		РезультатОтправки_СпрятатьСтатус(РезультатОтправки);
		//
		//Если ДанныеКОтправке.Сертификаты.ИННАктивировать.Количество() Тогда
		//	
		//	//Всё ещё нужно активировать сертификаты (не набрали пачку), запускаем активацию сертификатов
		//	РезультатОтправки_МассоваяОтправка_АктивацияСертификатов(РезультатОтправки);
		//	Возврат;
		//	
		//КонецЕсли;
			
		РезультатОтправки_ПоказатьСтатус(РезультатОтправки, "Ожидание ответов", 0);
		ПараметрыЗавершить = Новый Структура("ОжидатьСвободныеПотоки, ЧислоПачекОтправить, ОтправлятьЦелуюПачку", Ложь, 1, Ложь);
		
		ОтложеннаяИтерацияответов = НовыйСбисОписаниеОповещения("РезультатОтправки_МассоваяОтправка_ЧтениеОтветов", МодульОбъектаКлиент(), РезультатОтправки);
		РезультатОтправки.ПараметрыОтправки.Вставить("ОбработчикОжиданияОтветов", ОтложеннаяИтерацияответов);
		
		ОтложенноВыполнить = НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения, Аргумент", ОтложеннаяИтерацияответов, ПараметрыЗавершить));
		ПодключитьОтложенноеДействие(ОтложенноВыполнить);
		Возврат;
		
	Иначе
		
		//Отправка прервана из-за ошибки
		СообщитьСбисИсключение(АргументЗавершения);
		Отказ = Истина;
		
	КонецЕсли;
	
	Если Отказ Тогда
		
		//Запишем что удалось получить.
		РезультатОтправки_СпрятатьСтатус(РезультатОтправки);
		РезультатОтправки_ПоказатьСтатус(РезультатОтправки, "Завершение отправки");
		АсинхронноеСбисСобытие = НовыйАсинхронноеСбисСобытие(, АргументЗавершения, "Error");
		
		Попытка

			ГлобальныйКэш_ЧтениеОтветовИВызовСобытий();
			РезультатОтправки_ОсвободитьПотоки(РезультатОтправки, АсинхронноеСбисСобытие);
			РезультатОтправки_ЗаписатьНакопленныеСтатусы(РезультатОтправки);
			
		Исключение
			
			СообщитьСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.РезультатОтправки_МассоваяОтправка_Завершение");
			
		КонецПопытки;
		
	КонецЕсли;
		
	РезультатОтправкиОтдать = РезультатОтправки_Выгрузить(РезультатОтправки);
	ГлавноеОкно.Кэш.Вставить("РезультатОтправки", РезультатОтправкиОтдать);
	
    РезультатОтправки_СпрятатьСтатус(РезультатОтправки, Истина);
	РезультатОтправки_ОтправитьЗаписиПрикладнойСтатистики(РезультатОтправки);
	
	МодульПользовательскойТочкиПослеОтправки = НайтиФункциюСеансаОбработки("сбисПослеОтправкиПакетов", "РаботаСДокументами1С");
	Если МодульПользовательскойТочкиПослеОтправки <> Ложь Тогда
		МодульПользовательскойТочкиПослеОтправки.сбисПослеОтправкиПакетов(ГлавноеОкно.Кэш);	
	КонецЕсли;

	ВыполнитьСбисОписаниеОповещения(РезультатОтправкиОтдать, РезультатОтправки.ОбработчикРезультата);
	
КонецПроцедуры

// Процедура - Результат отправки массовая отправка чтение ответов
//
// Параметры:
//  ПараметрыЗавершить	 - Струкутра			 - получение и обработка ответов на запущенные потоки
//  РезультатОтправки	 - РезультатОтправки	 - структура отправки
//
&НаКлиенте
Процедура РезультатОтправки_МассоваяОтправка_ЧтениеОтветов(ПараметрыЗавершить, РезультатОтправки) Экспорт
	
	Попытка
		
		СчетчикОбработанных = 0;
		
		РезультатОтправки_ОбработкаПрерывания(РезультатОтправки);
		//РезультатОтправки_ОбработатьОтветы_Асинхронно(РезультатОтправки);
		РезультатОтправки_ПроверитьНакопленныеДействия(РезультатОтправки, СчетчикОбработанных);
		//РезультатОтправки_ОтправитьНакопленные(РезультатОтправки, ПараметрыЗавершить);
		РезультатОтправки_ЗаписатьНакопленныеСтатусы(РезультатОтправки);

		ОбщееЧислоОжидания	= РезультатОтправки.Счетчики.СформированоПакетов + РезультатОтправки.Счетчики.ПовторныхОтправок;
		Если ОбщееЧислоОжидания = 0 Тогда
			ОбщееЧислоОжидания = 1;	
		КонецЕсли;
		РезультатОтправки_ПоказатьСтатус(РезультатОтправки, "Ожидание ответов", Окр(РезультатОтправки.ПолученоОтветов * 100 / ОбщееЧислоОжидания), "(прервать -  Ctrl+Break)");
		
		//Пока всё не прогрузилось, выполняем отправку остатков.
		
		ЕстьЕщеНеобработанныеДействия	=	РезультатОтправки.ДанныеКоманд.Получить("Очередь").Количество()
										Или	РезультатОтправки.ПараметрыОтправки.Потоки.Количество()
										Или	РезультатОтправки.НаЗаписьСтатусов.Ответы.Количество()
										Или	РезультатОтправки.НаЗаписьСтатусов.Ошибки.Количество();
										
		Если ЕстьЕщеНеобработанныеДействия Тогда
											
			ОтложенноВыполнить = НовыйОтложенноеДействие(
				Новый Структура("ОписаниеОповещения, ИдентификаторДействия, Аргумент, Периодичность", 
				РезультатОтправки.ПараметрыОтправки.ОбработчикОжиданияОтветов, Новый УникальныйИдентификатор, ПараметрыЗавершить, 3));
				
		Иначе
				
			ОтложенноВыполнить = НовыйОтложенноеДействие(
				Новый Структура("ОписаниеОповещения, ИдентификаторДействия, Аргумент", 
				РезультатОтправки.ПараметрыОтправки.ОбработчикЗавершить, Новый УникальныйИдентификатор, "Завершено"));
				
		КонецЕсли;
			
	Исключение
		//Упала неизвестная ошибка, завершить обработку.
		ОшибкаЗавершения	= НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.РезультатОтправки_МассоваяОтправка_Завершение");
		Если ОшибкаЗавершения.code = 790 Тогда
			//Тут просто прервать отправку, форма индикатора должна вызвать завершение.
			Возврат;
		КонецЕсли;
		ОтложенноВыполнить	= НовыйОтложенноеДействие(
							Новый Структура("ОписаниеОповещения, Аргумент, ИдентификаторДействия", 
							РезультатОтправки.ПараметрыОтправки.ОбработчикЗавершить, ОшибкаЗавершения, Новый УникальныйИдентификатор));
	КонецПопытки;
	
	ПодключитьОтложенноеДействие(ОтложенноВыполнить);
	
КонецПроцедуры

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Отправка_РезультатОтправки_private
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Отправка_Проверки 
#КонецОбласти

