
//DynamicDirective

// Функция - получить реестр документов SABY
//
// Параметры:
//  ПараметрыСписка	 - Структура - основные параметры списка:
//		Фильтр: Структура (не обязательный) фильтр событий - если нужно сформировать фильтр извне
//		ИсточникФильтра: Форма/Структура - источник полей для заполнения фильтра
//						
//  ДопПараметры	 - Структура - дополнительные параметры
// 
// Возвращаемое значение:
//   - Структура:	 - Таблица_РеестрДокументов - Массив - документы с онлайна
//
Функция СписокДокументовSABY(ПараметрыСписка, ДопПараметры = Неопределено) Экспорт
	Перем ФильтрРеестра;
	
	Отказ = Ложь;
	
	СписокДокументов		= Новый Структура("Таблица_РеестрДокументов", Новый Массив);
	лСведенияОбИнтеграции	= ПолучитьЗначениеПараметраТекущегоСеанса("СведенияОбИнтеграции").Параметры;
	
	Если		лСведенияОбИнтеграции.Свойство("РеестрыSABY")
		И	Не	лСведенияОбИнтеграции.РеестрыSABY Тогда
		
		Возврат СписокДокументов;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыСписка) Тогда
		ПараметрыСписка = Новый Структура();
	КонецЕсли;
	Если Не ПараметрыСписка.Свойство("Фильтр") Тогда
		
		ДопФильтры = Новый Структура("Тип", ДопПараметры.Текущий.ТипДок);
		ПараметрыСписка.Вставить("Фильтр", СформироватьФильтрДляРеестраОнлайна(ПараметрыСписка.ИсточникФильтра, Новый Структура("ДопФильтры", ДопФильтры)));
		
	КонецЕсли;
		
	СтраницаНаФорме	= ПараметрыСписка.Фильтр.Навигация.Страница;
	РазмерСтраницы	= Число(ПараметрыСписка.Фильтр.Навигация.РазмерСтраницы); 
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	ДопПараметры.Вставить("ЕстьРезультат", Истина); 
	ДопПараметры.Вставить("ЭтоПерваяИтерация", Истина);
    ДопПараметры.Вставить("РазмерСтраницы", РазмерСтраницы);
	
	МаксимумДокументовЗаРаз	= РазмерСтраницы;
	ЧислоИтераций		= 1;
	Если РазмерСтраницы > 50 Тогда
		МаксимумДокументовЗаРаз	= 50;
		// Предполагается, что размер страницы > 50 может быть только кратным 50, чтобы правильно указать номер страницы
		ЧислоИтераций		= РазмерСтраницы / МаксимумДокументовЗаРаз;
	КонецЕсли;

	МассивДокументов = Новый Массив;
	НомерСтраницы = Число(СтраницаНаФорме) * ЧислоИтераций;
	
	СтруктураСпискаДокументов	= Новый Структура;
	АрдресСервераУстановлен		= ПолучитьЗначениеПараметраСБИС("АдресСервера");
	
	Для i = 1 По ЧислоИтераций Цикл
		
		Если НЕ i = 1 Тогда 
			
			ДопПараметры.ЭтоПерваяИтерация = Ложь; 
			
		КонецЕсли;
			
		ПараметрыСписка.Фильтр.Навигация.Страница		= Строка(НомерСтраницы);
		ПараметрыСписка.Фильтр.Навигация.РазмерСтраницы	= Строка(МаксимумДокументовЗаРаз);
		
		ПоказатьСостояниеSABY("Получение данных с " + АрдресСервераУстановлен);
		
		РеестрДокументов = ВыполнитьСинхроннуюКомандуТранспорта(ПолучитьТекущийЛокальныйКэш(), "СБИС_СписокДокументов", ПараметрыСписка.Фильтр,,Отказ);
				
		Если НЕ РеестрДокументов.Навигация.Количество() Тогда
			
			Если СтруктураСпискаДокументов.Свойство("Навигация") Тогда
				
				СтруктураСпискаДокументов.Навигация.ЕстьЕще = Ложь; 
				
			КонецЕсли;
			
			Прервать;
			
		КонецЕсли;
		
		СтруктураСпискаДокументов = РеестрДокументов;
		
		Для Каждого ДокОнлайна Из СтруктураСпискаДокументов.Документ Цикл
			МассивДокументов.Добавить(ДокОнлайна);
		КонецЦикла;
		
		СтруктураСпискаДокументов.Навигация.Вставить("ЕстьЕще", СтруктураСпискаДокументов.Навигация.Свойство("ЕстьЕще") 
															И	ПривестиТипСбис(СтруктураСпискаДокументов.Навигация.ЕстьЕще, Тип("Булево")));
		
		Если Не СтруктураСпискаДокументов.Навигация.ЕстьЕще Тогда
					
			Прервать;
			
		КонецЕсли;  
				
		НомерСтраницы = НомерСтраницы + 1;
		
	КонецЦикла;

	СтруктураСпискаДокументов.Документ = МассивДокументов;
	СтруктураСпискаДокументов.Навигация.Вставить("Страница", СтраницаНаФорме);
	СтруктураСпискаДокументов.Навигация.РазмерСтраницы = РазмерСтраницы;
	
	ОбработатьСписокДокументовSABY(СтруктураСпискаДокументов);

	Возврат СписокДокументов;
	
КонецФункции

//DynamicDirective

//Обрабатывает список документов определенного типа с online.saby.ru для реестра Документы	
Процедура ОбработатьСписокДокументовSABY(СтруктураСпискаДокументов) Экспорт
	
	Навигация	= СтруктураСпискаДокументов.Навигация;
	Выборка		= СтруктураСпискаДокументов.Документ;
	Размер		= Выборка.Количество();
	
	МассивДокументов	= Новый Массив;
	ДопПараметры		= Новый Структура("ТипРеестра, КлючОрганизации", "Документы", "Организация");
	СтатусБар			= Новый Структура("Индикатор");
	Для сч = 0 По Размер - 1 Цикл
		
		СтатусБар.Индикатор = Мин(100,Окр((сч+1)*100/Размер));
		ПоказатьСостояниеSABY("Подготовка реестра...", СтатусБар);
		
		МассивДокументов.Добавить(ОбработатьДокументДляРеестраSABY(Выборка[сч], ДопПараметры));
		
	КонецЦикла;	
	
	Если Размер Тогда
		
		фрм = НайтиФункциюСеансаОбработки("ПолучитьТаблицуДокументов1СПоИдПакетаСБИС", ПолучитьЗначениеПараметраСбис("ФормаРаботыСоСтатусами"));
		Если Не фрм = Ложь Тогда
			
			фрм.ПолучитьТаблицуДокументов1СПоИдПакетаСБИС(	МассивДокументов,
															ИниПоПараметрам("Конфигурация"),
															ПолучитьЗначениеПараметраСбис("КаталогНастроек"));
			
		КонецЕсли;

	КонецЕсли;
	
	
	ПоказатьСостояниеSABY();
	
	ОбновлениеФормы = Новый Структура("ТабличнаяЧасть", Новый Структура("Таблица_РеестрДокументов", МассивДокументов));
	ОбновлениеФормы.Вставить("Фильтры", Новый Структура("ФильтрСтраница", ?(Навигация.Свойство("Страница"), Число(Навигация.Страница)+1, 1)));

	СтруктураСпискаДокументов.Вставить("ОбновлениеФормы", ОбновлениеФормы);
	
КонецПроцедуры

//DynamicDirective

//Обрабатывает полученное событие для реестра
//оДокумент - обрабатываемый документ СБИС
//ДопПараметры - структура, ключи:
//		1. МассивИдентификаторов - массив для поиска соответствующих документов 1С по завершении обработки всего реестра
//		2. ТипРеестра - "Документы/События"
//		3. КлючОрганизации - Организация/НашаОрганизация
Функция ОбработатьДокументДляРеестраSABY(оДокумент, ДопПараметры) Экспорт
	Перем СтатусГос, СбисРасширение, КодСостоянияОперации, СвязанныеДокументыSaby;

	НоваяСтр = Новый Структура("Проведен, Контрагент, Лицо2, Срок, " + ДопПараметры.КлючОрганизации, -1);
	
	МодульДляОбработки = МодульОбъектаКлиентСервер();

	Если оДокумент.Свойство("LinkedOutflows", СвязанныеДокументыSaby)
		И ЗначениеЗаполнено(СвязанныеДокументыSaby) Тогда
		
		НоваяСтр.Вставить("ИдСБИС",	СвязанныеДокументыSaby[0]); 
		
		ДопПоля = Новый Структура("ИдСвязанногоДокументаSaby", СвязанныеДокументыSaby[0]); 
		МодульОбъектаКлиентСервер().СоставПакета_Обновить(оДокумент, Новый Структура("ДопПоля", ДопПоля));  
		
	Иначе   
		
		НоваяСтр.Вставить("ИдСБИС",		оДокумент.Идентификатор); 
		
	КонецЕсли;  
	
	
	НоваяСтр.Вставить("Статус",		МодульДляОбработки.СоставПакета_Получить(оДокумент, "СтатусДокумента")); 
	НоваяСтр.Вставить("Дата",		МодульДляОбработки.СоставПакета_Получить(оДокумент, "Дата"));
	НоваяСтр.Вставить("Номер",		МодульДляОбработки.СоставПакета_Получить(оДокумент, "Номер"));
	НоваяСтр.Вставить("Сумма",		?(оДокумент.Свойство("Сумма"),оДокумент.Сумма,0)); 
	НоваяСтр.Вставить("Расхождение", Ложь);
	
	Если оДокумент.Свойство("Контрагент")
		И ЗначениеЗаполнено(оДокумент.Контрагент) Тогда
		НазваниеКонтрагента = МодульДляОбработки.Сторона_Получить(оДокумент.Контрагент, "Название");
		оДокумент.Контрагент.Вставить("Название", НазваниеКонтрагента);
		НоваяСтр.Контрагент = оДокумент.Контрагент.Название;
	Иначе
		оДокумент.Вставить("Контрагент", Новый Структура("Название", "Не определен"));
	КонецЕсли;
	
	Если оДокумент.Свойство("НашаОрганизация") Тогда
		
		НазваниеОрганизации = МодульДляОбработки.Сторона_Получить(оДокумент.НашаОрганизация, "Название");
		оДокумент.НашаОрганизация.Вставить("Название", НазваниеОрганизации);
		НоваяСтр[ДопПараметры.КлючОрганизации] = оДокумент.НашаОрганизация.Название;
		
	Иначе
		
		оДокумент.Вставить("НашаОрганизация", Новый Структура("Название", "Не определен"));
		
	КонецЕсли;
	
	Если	оДокумент.Свойство("Участники")
		И	оДокумент.Участники.Свойство("Лицо2") Тогда
		
		НоваяСтр.Лицо2 = МодульДляОбработки.Сторона_Получить(оДокумент.Участники.Лицо2, "Название");
		
	КонецЕсли;
	
	//СтатусВГосСистеме
	Если	оДокумент.Свойство("Расширение",	СбисРасширение) Тогда
		
		Если	СбисРасширение.Свойство("СостояниеМарк",СтатусГос)
			И	СтатусГос.Свойство("СостояниеОперации",			СтатусГос) Тогда //1189641556
			
			НоваяСтр.Вставить("СтатусВГосСистеме", СтатусГос); 
			
		//Прослеживаемой и маркируемой продукции, у одном документе, быть не может
		ИначеЕсли СбисРасширение.Свойство("СостояниеПросл",СтатусГос) 
			И СтатусГос.Свойство("КодСостоянияОперации", КодСостоянияОперации) Тогда 
			ПредставлениеСостояния = МодульДляОбработки.СостояниеПрослеживаемостиПоКодуСтрокой(КодСостоянияОперации);
			НоваяСтр.Вставить("СтатусВГосСистеме", ПредставлениеСостояния); 
		Иначе
			НоваяСтр.Вставить("СтатусВГосСистеме", "");	
		КонецЕсли;
		
		Если	СбисРасширение.Свойство("СрокПоставки") Тогда
			НоваяСтр.Срок = оДокумент.Расширение.СрокПоставки;
		КонецЕсли;
		
		Если	СбисРасширение.Свойство("ЕстьРасхождения") Тогда 
			ЕстьРасхождения = МодульОбъектаКлиентСервер().СоставПакета_Получить(оДокумент, "ЕстьРасхождения");
			НоваяСтр.Вставить("Расхождение", ЕстьРасхождения);
		КонецЕсли;
		
	КонецЕсли;
	
	Если оДокумент.Свойство("Ответственный") И оДокумент.Ответственный.Свойство("Фамилия") Тогда
		
		Отв = оДокумент.Ответственный.Фамилия;
		
		Если оДокумент.Ответственный.Свойство("Имя") И ЗначениеЗаполнено(оДокумент.Ответственный.Имя) Тогда
			
			Отв = Отв + " " + Лев(оДокумент.Ответственный.Имя, 1) + ".";
			
			Если оДокумент.Ответственный.Свойство("Отчество") И ЗначениеЗаполнено(оДокумент.Ответственный.Отчество) Тогда
				Отв = Отв + Лев(оДокумент.Ответственный.Отчество, 1)+".";
			КонецЕсли;	
			
		КонецЕсли;	
		
		НоваяСтр.Вставить("Ответственный", Отв);
		
	ИначеЕсли оДокумент.Свойство("Подразделение") Тогда 
		
		НоваяСтр.Вставить("Ответственный", оДокумент.Подразделение.Название);
		
	Иначе
		
		НоваяСтр.Вставить("Ответственный", "");
		
	КонецЕсли;	
	
	НоваяСтр.Вставить("Документы1С", Новый СписокЗначений);
	
	Если ДопПараметры.ТипРеестра = "События" Тогда
		
		Вложения = "";
		счВложений = 0;
		
		Если оДокумент.Свойство("Вложение") Тогда
			
			Для Каждого Элемент Из оДокумент.Вложение Цикл
				
				Если		Элемент.Свойство("Служебный") 
					И Не	Элемент.Служебный = "Нет" Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				счВложений = счВложений + 1;
				
				Если счВложений < 3 Тогда
					Вложения = Вложения + Элемент.Название+Символы.ПС;
				ИначеЕсли счВложений = 3 Тогда
					Вложения = Вложения + "..."+Символы.ПС;					
				КонецЕсли;
				
				ДопПараметры.МассивИдентификаторов.Добавить(Новый Структура("Ид, ИдВложения", оДокумент.Идентификатор, Элемент.Идентификатор));		
				
			КонецЦикла;
			
		КонецЕсли;
		//  << alo Меркурий
		
		Если Не	счВложений
			И	ПолучитьПараметрПользователя("Меркурий") тогда
			
			ДопПараметры.МассивИдентификаторов.Добавить(Новый Структура("Ид, ИдВложения",оДокумент.Идентификатор, ""));
			
		КонецЕсли;		//  alo Меркурий >>
		
		Вложения = Вложения + ?(оДокумент.Состояние.Свойство("Примечание"), "   " + оДокумент.Состояние.Примечание, "");
		НоваяСтр.Вставить("Вложения", Вложения);
		
		Если оДокумент.Свойство("Подразделение") Тогда
			ИдентификаторНазваниеПодразделения = ?(	оДокумент.Подразделение.Свойство("Идентификатор"), 
														оДокумент.Подразделение.Идентификатор,
															оДокумент.Подразделение.Название);
			НоваяСтр.Вставить("Склад", ИдентификаторНазваниеПодразделения);
		КонецЕсли;
		
	Иначе
		
		НоваяСтр.Вставить("Склад", ?(оДокумент.Свойство("Подразделение"),оДокумент.Подразделение.Название,""));
		
	КонецЕсли;
	
	СоставПакета = Новый СписокЗначений;
	СоставПакета.Добавить(оДокумент);
	НоваяСтр.Вставить("СоставПакета", СоставПакета); // нельзя положить сразу структуру, поэтому кладем ее в нулевой элемент списка
	
	НоваяСтр.Вставить("ТекущийЭтап", МодульОбъектаКлиентСервер().СоставПакета_Получить(оДокумент, "ТекущийЭтап"));
	
	НоваяСтр.Вставить("Комментарий", МодульОбъектаКлиентСервер().СоставПакета_Получить(оДокумент, "Комментарий"));  
	
	НоваяСтр.Вставить("СвязанныеДокументы", Новый СписокЗначений);
	
	НоваяСтр.Вставить("ТекущееДействие", "");
	
	Возврат НоваяСтр

КонецФункции

//DynamicDirective

// Функция - формирует фильтр для реестровых методов Онлайна.
//
// Параметры:
//  ПараметрыФильтраВходящие - Структура, Форма - объект, содержащий поля фильтров, одноименные главному окну
//  ДопПараметры			 - Структура	 - 
//		ДопПоля		- Строка - расширение метода.
//		ДопФильтры	- Структура - результат функции ПараметраФильтраДляСобытий от реестра.
// 
// Возвращаемое значение:
//  Структура - фильтр для реестров онлайна https://saby.ru/help/integration/api/all_methods/list_doc; https://saby.ru/help/integration/api/all_methods/events_doc
//
Функция	СформироватьФильтрДляРеестраОнлайна(ПараметрыФильтраВходящие, ДопПараметры) Экспорт
	
	Перем ДопФильтры;
	
	ЗначениеФильтраСобытий = Новый Структура; 
	ЗначениеФильтраСобытий.Вставить("ДопПоля", "Этап,Лицо2");
	//Этап			- получить этапы в реестре
	//Лицо2			- получить Грузополучатель
	//Расширение	- получить объект расширения документа, где можно взять статусы гос. систем.
	
	Если ПолучитьЗначениеПараметраСбис("СтатусыВГосСистеме") Тогда
		ЗначениеФильтраСобытий.ДопПоля = ЗначениеФильтраСобытий.ДопПоля + ",Расширение";
	КонецЕсли;
	
	Если ДопПараметры.Свойство("ДопПоля") Тогда
		ЗначениеФильтраСобытий.ДопПоля = ЗначениеФильтраСобытий.ДопПоля + ДопПараметры.ДопПоля;
	КонецЕсли;
	
	ДанныеПоФильтрам = Новый Структура(
	"ЗаписейНаСтранице, ФильтрСтраница
	|, ФильтрДатаНач, ФильтрДатаКнц, СписокСостояний, ФильтрСостояние, ФильтрТипыДокументов
	|, ФильтрОрганизация, ФильтрКонтрагент, ФильтрКонтрагентСФилиалами, ФильтрМаска, ФильтрПоРасхождениям, ФильтрТС",
	10, 1);
	ЗаполнитьЗначенияСвойств(ДанныеПоФильтрам, ПараметрыФильтраВходящие);
	
	//Дата с/по
	Если ЗначениеЗаполнено(ДанныеПоФильтрам.ФильтрДатаНач) Тогда
		ЗначениеФильтраСобытий.Вставить("ДатаС",	Формат(ДанныеПоФильтрам.ФильтрДатаНач, "ДФ=""дд.ММ.гггг""")); 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПоФильтрам.ФильтрДатаКнц) Тогда
		ЗначениеФильтраСобытий.Вставить("ДатаПо",	Формат(ДанныеПоФильтрам.ФильтрДатаКнц, "ДФ=""дд.ММ.гггг""")); 
	КонецЕсли;
	
	//Состояние
	Если		ЗначениеЗаполнено(ДанныеПоФильтрам.ФильтрСостояние)
		И	Не	ДанныеПоФильтрам.ФильтрСостояние = "Все документы" Тогда // Дефолтный фильтр
		ЗначениеФильтраСобытий.Вставить("Состояние", ДанныеПоФильтрам.ФильтрСостояние); 
	КонецЕсли;
	
	//ТипВложения
	Если ЗначениеЗаполнено(ДанныеПоФильтрам.ФильтрТипыДокументов) тогда
		
		СписокТипДок = "";//"ЭДОНакл,Договор,СчФктр"
		
		Для Каждого ТипДок Из ДанныеПоФильтрам.ФильтрТипыДокументов Цикл
			
			СписокТипДок = СписокТипДок + ТипДок.Значение + ",";
			
		КонецЦикла;
		
		ЗначениеФильтраСобытий.Вставить("ТипВложения", Лев(СписокТипДок, СтрДлина(СписокТипДок) - 1)); 
		
	КонецЕсли;
	
	//Организация
	Если ЗначениеЗаполнено(ДанныеПоФильтрам.ФильтрОрганизация) Тогда
		
		ПараметрыДляСтороны	= Новый Структура("Ключ", "НашаОрганизация");
		СторонаФильтра		= СформироватьФильтрДляРеестраОнлайна_Сторона(ДанныеПоФильтрам.ФильтрОрганизация, ПараметрыДляСтороны);
		Если Не СторонаФильтра = Неопределено Тогда
			
			ЗначениеФильтраСобытий.Вставить(ПараметрыДляСтороны.Ключ, СторонаФильтра);
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Контрагент
	Если ЗначениеЗаполнено(ДанныеПоФильтрам.ФильтрКонтрагент) Тогда
		
		ПараметрыДляСтороны = Новый Структура("Ключ, Фильтры", "Контрагент", ДанныеПоФильтрам);
		СторонаФильтра		= СформироватьФильтрДляРеестраОнлайна_Сторона(ДанныеПоФильтрам.ФильтрКонтрагент, ПараметрыДляСтороны);
		Если Не СторонаФильтра = Неопределено Тогда
			
			ЗначениеФильтраСобытий.Вставить(ПараметрыДляСтороны.Ключ, СторонаФильтра);
			
		КонецЕсли;
		
	КонецЕсли;
		
	//Маска
	Если ЗначениеЗаполнено(ДанныеПоФильтрам.ФильтрМаска) Тогда
		
		ЗначениеФильтраСобытий.Вставить("Маска", ДанныеПоФильтрам.ФильтрМаска);
		
	КонецЕсли;  
	
	// Фильтр документов с расхождениями
	Если ЗначениеЗаполнено(ДанныеПоФильтрам.ФильтрПоРасхождениям)
		И ДанныеПоФильтрам.ФильтрПоРасхождениям = Истина Тогда
		
		ЗначениеФильтраСобытий.Вставить("ФильтрПоРасхождениям", "Да");
		
	КонецЕсли;
	
	//ДопПараметры
	Если	ДопПараметры.Свойство("ДопФильтры", ДопФильтры) 
		И	ЗначениеЗаполнено(ДопФильтры) Тогда
		Для Каждого Элемент Из ДопФильтры Цикл
			ЗначениеФильтраСобытий.Вставить(Элемент.Ключ, Элемент.Значение);	
		КонецЦикла;
	КонецЕсли;

	// ФильтрТС
    Если	ТипЗнч(ДанныеПоФильтрам.ФильтрТС) = Тип("Структура")
        И	ДанныеПоФильтрам.ФильтрТС.Свойство("ИдСБИС") Тогда
    
        ЗначениеФильтраСобытий.Вставить("ФильтрТС", ДанныеПоФильтрам.ФильтрТС.ИдСБИС);
    
    КонецЕсли;
	
	ОбъектНавигации = Новый Структура; 
	ОбъектНавигации.Вставить("РазмерСтраницы",	Строка(ДанныеПоФильтрам.ЗаписейНаСтранице)); 
	ОбъектНавигации.Вставить("Страница",		Строка(ДанныеПоФильтрам.ФильтрСтраница - 1));
	
	Если ЗначениеЗаполнено(ДопФильтры)
		И ДопФильтры.Свойство("Навигация") Тогда
		
		ОбъектНавигации.Вставить("Направление", ДопФильтры.Навигация.Направление);
		ОбъектНавигации.Вставить("КоличествоДокументов", ДопФильтры.Навигация.КоличествоДокументов);  
		
		Если ЗначениеЗаполнено(ДопФильтры.Навигация.ПоследняяЗапись) Тогда
			ОбъектНавигации.Вставить("ПоследняяЗапись", ДопФильтры.Навигация.ПоследняяЗапись); 
		КонецЕсли;
		
	КонецЕсли;
		
	ЗначениеФильтраСобытий.Вставить("Навигация", ОбъектНавигации);
	
	Возврат ЗначениеФильтраСобытий;	
	
КонецФункции

