&НаКлиенте
Процедура	СбисСохранитьМеткиСтатусов(Кэш, МеткиСтатусов, ДопПараметры = Неопределено) Экспорт
	
	КлючМетокСатусов = "status_marks";

	Если Кэш.Парам.СпособХраненияМетокСтатусов = 2 Тогда
		МодульОбъектаКлиент().СохранитьОбщуюНастройку(КлючМетокСатусов, МеткиСтатусов);
		Возврат;
	КонецЕсли;
	
	СохраненныеМетки	= ПолучитьПараметрыСБИС(Кэш, Кэш.Парам.ИдентификаторНастроек);
	Если	Не СохраненныеМетки.Свойство(КлючМетокСатусов, СохраненныеМетки)
		Или	Не ЗначениеЗаполнено(СохраненныеМетки) Тогда
		СохраненныеМетки = Новый Структура;
	КонецЕсли;
	
	ДопПараметры		= Новый Структура("СпособХраненияМетокСтатусов", Кэш.Парам.СпособХраненияМетокСтатусов = 2);
	
	Если		Кэш.Парам.СпособХраненияМетокСтатусов = 0 Тогда
		КлючПользователя	= ПолучитьКлючПользователяСтенда(Кэш);
		КлючАккаунта		= ПолучитьКлючАккаунта(Кэш, ДопПараметры);
		Если	КлючПользователя	= Неопределено
			Или	КлючАккаунта		= Неопределено Тогда
			Возврат;
		КонецЕсли;
		Если Не СохраненныеМетки.Свойство(КлючПользователя) Тогда
			СохраненныеМетки.Вставить(КлючПользователя, Новый Структура);
		КонецЕсли;
		
		СохраненныеМетки[КлючПользователя].Вставить(КлючАккаунта, МеткиСтатусов);
		
		Результат = Новый Структура(КлючМетокСатусов, СохраненныеМетки);	
		СохранитьПараметрыСБИС(Кэш, Результат, Кэш.Парам.ИдентификаторНастроек);
	ИначеЕсли	Кэш.Парам.СпособХраненияМетокСтатусов = 1 Тогда
		КлючАккаунта = ПолучитьКлючАккаунта(Кэш, ДопПараметры);
		Если КлючАккаунта = Неопределено Тогда
			Возврат;
		КонецЕсли;
		СохраненныеМетки.Вставить(КлючАккаунта, МеткиСтатусов);
		
		Результат = Новый Структура(КлючМетокСатусов, СохраненныеМетки);	
		СохранитьПараметрыСБИС(Кэш, Результат, Кэш.Парам.ИдентификаторНастроек);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СбисПрочитатьМеткиСтатусов(Кэш, ДопПараметры = Неопределено, Отказ = Ложь) Экспорт
	
	СпособХраненияМетокСтатусов = Кэш.Парам.СпособХраненияМетокСтатусов;
	ДопПараметры				= Новый Структура("СпособХраненияМетокСтатусов", СпособХраненияМетокСтатусов);
	КлючМетокСатусов			= "status_marks";
	
	Если		Кэш.Парам.СпособХраненияМетокСтатусов = 2 Тогда	
		ЗначениеНастроекРезультат = МодульОбъектаКлиент().ПрочитатьОбщиеНастройки(КлючМетокСатусов);
	ИначеЕсли	Кэш.Парам.СпособХраненияМетокСтатусов = 0 Тогда
		КлючАккаунта				= ПолучитьКлючАккаунта(Кэш, ДопПараметры);
		КлючПользователя			= ПолучитьКлючПользователяСтенда(Кэш);
		Если	КлючПользователя	= Неопределено
			Или	КлючАккаунта		= Неопределено Тогда
			//Не удалось определить ключ пользователя стенда. Выставим метки по-дефолту.
			Возврат Кэш.ФормаНастроекОбщее.МеткиСтатусовПоУмолчанию();
		КонецЕсли;
		ЗначениеНастроекРезультат	= ПолучитьПараметрыСБИС(Кэш, Кэш.Парам.ИдентификаторНастроек); //по пользователю
		Если	ЗначениеНастроекРезультат.Свойство(КлючМетокСатусов,	ЗначениеНастроекРезультат)
			И	ЗначениеНастроекРезультат.Свойство(КлючПользователя,	ЗначениеНастроекРезультат)
			И	ЗначениеНастроекРезультат.Свойство(КлючАккаунта,		ЗначениеНастроекРезультат) Тогда
			Возврат ЗначениеНастроекРезультат;
		КонецЕсли;		
	ИначеЕсли	Кэш.Парам.СпособХраненияМетокСтатусов = 1 Тогда
		КлючАккаунта				= ПолучитьКлючАккаунта(Кэш, ДопПараметры);
		Если КлючАккаунта = Неопределено Тогда
			//Не удалось определить ключ пользователя стенда. Выставим метки по-дефолту.
			Возврат Кэш.ФормаНастроекОбщее.МеткиСтатусовПоУмолчанию();
		КонецЕсли;
		ЗначениеНастроекРезультат = ПолучитьПараметрыСБИС(Кэш, Кэш.Парам.ИдентификаторНастроек); //по пользователю
		Если	ЗначениеНастроекРезультат.Свойство(КлючМетокСатусов,	ЗначениеНастроекРезультат)
			И	ЗначениеНастроекРезультат.Свойство(КлючАккаунта,		ЗначениеНастроекРезультат) Тогда
			Возврат ЗначениеНастроекРезультат;
		КонецЕсли;	
	КонецЕсли;

	Если ЗначениеНастроекРезультат = Неопределено Тогда
		ЗначениеНастроекРезультат = Кэш.ФормаНастроекОбщее.МеткиСтатусовПоУмолчанию();
	КонецЕсли;

	Возврат ЗначениеНастроекРезультат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьКлючПользователяСтенда(Кэш, ДопПараметры = Неопределено)
	Если	Не Кэш.СБИС.ПараметрыИнтеграции.Свойство("КодСервиса")
		Или	Не Кэш.СБИС.ПараметрыИнтеграции.Свойство("ИдПользователя") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Кэш.ОбщиеФункции.СбисФорматСтроки(Кэш.СБИС.ПараметрыИнтеграции.КодСервиса + "_" + Кэш.СБИС.ПараметрыИнтеграции.ИдПользователя);
КонецФункции

&НаКлиенте
Функция ПолучитьКлючАккаунта(Кэш, ДопПараметры)                                                                                     
	Перем СбисКлючАккаунта;
	Если 		Кэш.Парам.СпособХраненияМетокСтатусов = 1 Тогда
		СбисКлючАккаунта = Кэш.СБИС.ПараметрыИнтеграции.КодСервиса + "_acc";
	ИначеЕсли Кэш.СБИС.ПараметрыИнтеграции.Свойство("ИдАккаунта") Тогда
		СбисКлючАккаунта = "_" + Кэш.СБИС.ПараметрыИнтеграции.ИдАккаунта;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	Возврат Кэш.ОбщиеФункции.СбисФорматСтроки(СбисКлючАккаунта);
КонецФункции

