
&НаКлиенте
Процедура СбисСохранитьМеткиСтатусов(Кэш, МеткиСтатусов, ДопПараметры = Неопределено, Отказ = Ложь) Экспорт

	Если ДопПараметры.СпособХраненияМетокСтатусов = 2 Тогда
		МодульОбъектаКлиент().СохранитьОбщуюНастройку("status_marks", МеткиСтатусов);
		Возврат;
	КонецЕсли;
	
	Отказ		= Ложь;
	Результат	= Новый Структура("status_marks", МеткиСтатусов);
	
	Если		ДопПараметры.СпособХраненияМетокСтатусов = 0 Тогда
		РезультатЗаписи = СохранитьПараметрыСБИС			(Кэш, Результат, Кэш.Парам.ИдентификаторНастроек, Отказ);
	ИначеЕсли	ДопПараметры.СпособХраненияМетокСтатусов = 1 Тогда
		РезультатЗаписи = ЗаписатьОбщиеНастройкиПодключения	(Кэш, Результат, Кэш.Парам.ИдентификаторНастроек, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		МодульОбъектаКлиент().ВызватьСбисИсключение(РезультатЗаписи, "ФайлыНастроекСервер.СбисСохранитьМеткиСтатусов");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СбисПрочитатьМеткиСтатусов(Кэш, ДопПараметры = Неопределено, Отказ = Ложь) Экспорт
	Перем ЗначениеМетокСтатусов;
	
	СпособХраненияМетокСтатусов	= Кэш.Парам.СпособХраненияМетокСтатусов;
	КлючМетокСатусов			= "status_marks";
	
	Если		СпособХраненияМетокСтатусов = 0 Тогда
		НастройкиПодключения = ПолучитьПараметрыСБИС(Кэш, Кэш.Парам.ИдентификаторНастроек);
		НастройкиПодключения.Свойство(КлючМетокСатусов, ЗначениеМетокСтатусов);
	ИначеЕсли	СпособХраненияМетокСтатусов = 1 Тогда
		ЗначениеМетокСтатусов	= ПрочитатьОбщуюНастройкуПодключения(Новый Структура("КлючНастройки", КлючМетокСатусов), Кэш);
	ИначеЕсли	СпособХраненияМетокСтатусов = 2 Тогда
		ЗначениеМетокСтатусов = МодульОбъектаКлиент().ПрочитатьОбщиеНастройки(КлючМетокСатусов);
	КонецЕсли; 
	
	Если ЗначениеМетокСтатусов = Неопределено Тогда
		ЗначениеМетокСтатусов = Кэш.ФормаНастроекОбщее.МеткиСтатусовПоУмолчанию();
	КонецЕсли;

	Возврат ЗначениеМетокСтатусов;
	
КонецФункции

