
// Процедура записывает значение параметра по имени в кэш ГО и Глобальный кэш
//
// Параметры:
//  ИмяПараметраСбис		 - Строка					 - Ключ параметра
//  ЗначениеПараметраСбис	 - Произвольное значение	 - Значение параметра установить
//  ДопПараметры			 - Структура				 - 
//		Кэш			- экземпляр ЛокальныйКэш, куда установить параметр
//		Глобально	- Булево (Истина), определяет необходимость обновить параметр глобально, или изменение касается только класса ЛокальныйКэш
//		Параметры	- Стуркутра, доп. параметры для изменения
//		Адрес		- Строка, путь в кэше для установки параметра
//
&НаКлиенте
Процедура ИзменитьПараметрСбис(ИмяПараметраСбис, ЗначениеПараметраСбис, ДопПараметры = Неопределено) Экспорт
    Перем ЗначениеКэшПрописать, ЭтоГлобальныйПараметр, ДопПараметрыИзменения, СерверныйПараметр;
	Если	Не	ДопПараметры = Неопределено Тогда
		ДопПараметры.Свойство("Кэш",		ЗначениеКэшПрописать);
		ДопПараметры.Свойство("Глобально",	ЭтоГлобальныйПараметр);
		ДопПараметры.Свойство("Параметры",	ДопПараметрыИзменения);
		ДопПараметры.Свойство("Серверный",	СерверныйПараметр);
	КонецЕсли;
	Если ЗначениеЗаполнено(СерверныйПараметр) Тогда
		Возврат;
	КонецЕсли;
	Если	ЗначениеКэшПрописать = Неопределено Тогда
		ЗначениеКэшПрописать = ГлавноеОкно.Кэш;
	КонецЕсли;
	Если	ЭтоГлобальныйПараметр = Неопределено Тогда
		ЭтоГлобальныйПараметр = Истина;
	КонецЕсли;
	
	Если		ИмяПараметраСбис = "АдресСервера" Тогда 
		
		ИзменитьПараметрСбис_АдресСервера(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);

	ИначеЕсли	ИмяПараметраСбис = "ИспользоватьГенератор" Тогда
		
		ИзменитьПараметрСбис_ИспользоватьГенератор(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);
		
	ИначеЕсли	ИмяПараметраСбис = "СпособОбмена" Тогда
		
		ИзменитьПараметрСбис_СпособОбмена(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);

	ИначеЕсли	ИмяПараметраСбис = "СпособХраненияНастроек" Тогда
		
		ИзменитьПараметрСбис_СпособХраненияНастроек(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);

	ИначеЕсли	ИмяПараметраСбис = "СпособСопоставленияНоменклатуры" Тогда
		
		ИзменитьПараметрСбис_СпособСопоставленияНоменклатуры(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);	
		
	ИначеЕсли Не	ДопПараметры = Неопределено
			И		ДопПараметры.Свойство("Адрес") Тогда
		
		//В прописанное место
		АдресПараметра = ДопПараметры.Адрес + "." + ИмяПараметраСбис;
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, АдресПараметра, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли	ИмяПараметраСбис = "Интеграция" Тогда
		
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, ИмяПараметраСбис,					ЗначениеПараметраСбис, Ложь);
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Модули.Интеграция",	ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		//Совместимость старой отправки.
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ФормаОтправки",					ЗначениеПараметраСбис, Ложь);
		
	ИначеЕсли	ИмяПараметраСбис = "ИнтеграцияИмя" Тогда
		
		ИзменитьПараметрСбис_ВКэш			(ЗначениеКэшПрописать, ИмяПараметраСбис,	ЗначениеПараметраСбис, Ложь);
		ИзменитьПараметрСбис_УстановитьВКэш	(ЗначениеКэшПрописать, ИмяПараметраСбис,	ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли	ИмяПараметраСбис = "КаталогНастроек" Тогда
		
        ИзменитьПараметрСбис("ИниВПорядке",	Ложь);
		
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать,	"Ини",						Новый Структура);
		ИзменитьПараметрСбис_УстановитьВКэш(ЗначениеКэшПрописать, ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли	ИмяПараметраСбис = "ИниВПорядке" Тогда
		
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать,	"ИниВПорядке",				Ложь,			Ложь);
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать,	"КэшНастроек.ИниВПорядке",	Ложь);		

	ИначеЕсли	ИмяПараметраСбис = "ИмяМодуляРаботыСоСтатусами"
			Или	ИмяПараметраСбис = "ФормаРаботыСоСтатусами" Тогда
		
		ИзменитьПараметрСбис_ВКэш			(ЗначениеКэшПрописать, "ФормаРаботыСоСтатусами",		ЗначениеПараметраСбис, Ложь); // Костыль для старой совместимости
		ИзменитьПараметрСбис_УстановитьВКэш	(ЗначениеКэшПрописать, "ИмяМодуляРаботыСоСтатусами",	ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли	ИмяПараметраСбис = "ИмяМодуляРаботыСНоменклатурой"
			Или	ИмяПараметраСбис = "ФормаРаботыСНоменклатурой" Тогда
		
		ИзменитьПараметрСбис_ВКэш			(ЗначениеКэшПрописать, "ФормаРаботыСНоменклатурой",		ЗначениеПараметраСбис, Ложь); // Костыль для старой совместимости
		ИзменитьПараметрСбис_УстановитьВКэш	(ЗначениеКэшПрописать, "ИмяМодуляРаботыСНоменклатурой", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли ИмяПараметраСбис = "СостояниеЭД" Тогда
		
		ИзменитьПараметрСбис_СостояниеЭД(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);
		
	ИначеЕсли ИмяПараметраСбис = "НастройкиКриптографии" Тогда
		
		Если ЗначениеЗаполнено(ЗначениеПараметраСбис) Тогда
			
			ИмяМодуляКриптографии = "ЭлектроннаяПодписьНаКлиенте";
			Если ЗначениеПараметраСбис.ПодписьНаСервере Тогда
				
				ИмяМодуляКриптографии = "ЭлектроннаяПодписьНаСервере";
				
			КонецЕсли;
			
			МодульКриптографии = ПолучитьФормуОбработки(ИмяМодуляКриптографии);
			ПолучитьТекущийЛокальныйКэш().Вставить("ФормаЭП", МодульКриптографии);
			ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Модули.Криптография1С", МодульКриптографии, Истина);
			
		КонецЕсли;
	
		ИзменитьПараметрСбис_УстановитьВКэш(ЗначениеКэшПрописать, ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли	ИмяПараметраСбис  = "СопоставлениеПоОрганизации"
		Или		ИмяПараметраСбис  = "СопоставлениеПоКонтрагенту" Тогда
		
		ДопПараметрыИсходящие = Новый Структура("Ключ", ИмяПараметраСбис);
		ИзменитьПараметрСбис_СопоставлениеПо(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИсходящие);

	Иначе
		
		ИзменитьПараметрСбис_УстановитьВКэш(ЗначениеКэшПрописать, ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПараметрСбис_УстановитьВКэш(ЗначениеКэшПрописать, ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр)
	
	Если		ЗначениеКэшПрописать.Парам.Свойство(ИмяПараметраСбис) Тогда
		
		//В Кэш.Парам
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "Парам." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

	ИначеЕсли   ЗначениеКэшПрописать.СБИС.Свойство(ИмяПараметраСбис) Тогда

		//В Кэш.СБИС
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли   ЗначениеКэшПрописать.СБИС.ПараметрыИнтеграции.Свойство(ИмяПараметраСбис) Тогда

		//В Кэш.СБИС.ПараметрыИнтеграции
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС.ПараметрыИнтеграции." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

	Иначе
		
		//В Кэш.ТекущийСеанс.Параметры
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Параметры." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Изменить параметр сбис СпособХраненияНастроек
//
// Параметры:
//  ЗначениеПараметраСбис	 - 	 - 
//  ДопПараметры			 - 	 - 
//
&НаКлиенте
Процедура ИзменитьПараметрСбис_СпособХраненияНастроек(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметры = Неопределено)

	Если ЗначениеПараметраСбис = 1 Тогда
		ИмяМодуляНастроек = "ФайлыНастроекСервер";
	Иначе
		ИмяМодуляНастроек = "ФайлыНастроекКаталог";
	КонецЕсли;
	
	ЗначениеКэшПрописать.ФормаНастроекОбщее.ОчиститьСобранныеНастройки(ЗначениеКэшПрописать);
	
	МодульНастроек = ПолучитьФормуОбработки(ИмяМодуляНастроек);

	ЗначениеКэшПрописать.Вставить("ФормаНастроек", МодульНастроек);

	МодульНастроек.ПараметрыРаботы = Новый Структура;
	МодульНастроек.ИнициализироватьКэшНастроек(ЗначениеКэшПрописать, ДопПараметры);
	
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "Парам.СпособХраненияНастроек", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
	Если ЭтоГлобальныйПараметр Тогда

		ГлобальныйКэш.ТекущийСеанс.Модули.Настройки = МодульНастроек;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Изменить параметр сбис СпособОбмена
//
// Параметры:
//  ЗначениеКэшПрописать	 - 	 - 
//  ЗначениеПараметраСбис	 - Число	 - код способа обмена
//  ЭтоГлобальныйПараметр	 - 	 - 
//  ДопПараметры			 - 	 - 
//
&НаКлиенте
Процедура ИзменитьПараметрСбис_СпособОбмена(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметры = Неопределено)
	
	// Принудительно переключить
	Если ЗначениеПараметраСбис = 4 Тогда
		
		ЗначениеПараметраУстановить = 6;
		
	ИначеЕсли ЗначениеПараметраСбис = 5 Тогда
		
 		ЗначениеПараметраУстановить = 7;
		
	Иначе
		
		 ЗначениеПараметраУстановить = ЗначениеПараметраСбис;
		 
	КонецЕсли;
 
	МодульИнтеграцииСБИС = МодульИнтеграцииСБИС(ЗначениеПараметраУстановить);
	Если МодульИнтеграцииСБИС = Неопределено Тогда
		
		ОшибкаПодбораИнтеграции = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ИзменитьПараметрСбис_СпособОбмена");
		ВызватьИсключение СбисИсключение_Представление(ОшибкаПодбораИнтеграции);
		
	КонецЕсли;

	ИзменитьПараметрСбис("Интеграция", 		МодульИнтеграцииСБИС);
	ИзменитьПараметрСбис("ИнтеграцияИмя",	МодульИнтеграцииСБИС.СведенияОбИнтеграции().Имя);
	ИзменитьПараметрСбис("ОбменВключен",	Ложь); // Для переустановки подключения
	
	ИзменитьПараметрТекущегоСеанса("СведенияОбИнтеграции", Неопределено);// Для переустановки подключения, Сведения инитятся при включении обмена
	
	ИзменитьПараметрСбис_УстановитьВКэш(ЗначениеКэшПрописать, "СпособОбмена", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
	
КонецПроцедуры

// Процедура - Изменить параметр сбис ИспользоватьГенератор
//
// Параметры:
//  ЗначениеПараметраСбис	 - 	 - 
//  ДопПараметры			 - 	 - 
//
&НаКлиенте
Процедура ИзменитьПараметрСбис_ИспользоватьГенератор(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметры = Неопределено)

	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "Парам.ИспользоватьГенератор", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
	Если ЭтоГлобальныйПараметр Тогда
		ГлобальныйКэш.ТекущийСеанс.Модули.Настройки.ИспользоватьГенераторПриИзменении(ГлавноеОкно.Кэш, ЗначениеПараметраСбис);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Изменить параметр сбис ИспользоватьГенератор
//
// Параметры:
//  ЗначениеКэшПрописать	 - Булево - Кэш, в который прописываем значение параметра 
//  ЗначениеПараметраСбис	 - Булево - Устанавливаемое значение. Здесь это: дублируем ли статусы сбис в регистры 1С
//  ЭтоГлобальныйПараметр	 - Булево - Пишем в глобальный кэш или нет
//  ДопПараметры			 - Структура - Закос под расширение функции 
//
&НаКлиенте
Процедура ИзменитьПараметрСбис_СостояниеЭД(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметры = Неопределено)

	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "Парам.СостояниеЭД", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
	Если ЭтоГлобальныйПараметр Тогда
		ГлобальныйКэш.ТекущийСеанс.Модули.Настройки.ДублироватьСобытияСБИСПриИзменении(ГлавноеОкно.Кэш, ЗначениеПараметраСбис);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Изменить параметр сбис СпособСопоставленияНоменклатуры
//
// Параметры:
//  ЗначениеПараметраСбис	 - 	 - 
//  ДопПараметры			 - 	 - 
//
&НаКлиенте
Процедура ИзменитьПараметрСбис_СпособСопоставленияНоменклатуры(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения = Неопределено)

	Попытка
		
		СпособСопоставленияБыло = ПолучитьПараметрПользователя("СпособСопоставленияНоменклатуры");
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "Парам.СпособСопоставленияНоменклатуры", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

		СпособыСопоставления	= СписокВсехСпособовСопоставленияНоменклатуры("УстановкаПараметра");
		ЭлементВСопоставлении	= СпособыСопоставления.НайтиПоЗначению(ЗначениеПараметраСбис);
		
		Если ЭлементВСопоставлении = Неопределено Тогда
			
			ВызватьИсключение "Устанавливаемое значение ""СпособСопоставленияНоменклатуры"" отсутствует в списке доступных!";
			
		КонецЕсли;

		ИзменитьПараметрСбис("ЕстьЕдиницыНаФормеПросмотра", Ложь);
		
		Если	ЗначениеПараметраСбис = 0
			Или	СпособСопоставленияБыло = 0 Тогда 
			
			Если ЗначениеПараметраСбис = 0 Тогда
				ДействиеДляСтатистики = "Функционал включен";
			Иначе
				ДействиеДляСтатистики = "Функционал выключен";
			КонецЕсли;
			
			ЗаписьПрикладнойСтатистики	= НовыйЗаписьПрикладнойСтатистики(ДействиеДляСтатистики, "Новое сопоставление номенклатуры");
			ПрикладнаяСтатистика		= НовыйПрикладнаяСтатистика(ЗаписьПрикладнойСтатистики);
			ПараметрыОтправкиСтатистики = Новый Структура("Контекст", "Новое сопоставление номенклатуры");
			ПрикладнаяСтатистика_Отправить(ПрикладнаяСтатистика, ПараметрыОтправкиСтатистики);
			
		КонецЕсли;
		
		ИзменитьПараметрСбис("ИспользоватьНовоеСопоставлениеНоменклатуры", ЗначениеПараметраСбис = 0);
		
		МодульОбработки 			= ЭлементВСопоставлении.Представление;
		ФормаРаботыСоНоменклатурой	= ПолучитьФормуОбработки(МодульОбработки);
		Попытка
			ФормаРаботыСоНоменклатурой.УстановитьПараметрыМодуля( ,ПолучитьТекущийЛокальныйКэш());
		Исключение
			//Исключение не обрабатываем, отвалиться может только в случае, если форма вынесена в внешние функции
		КонецПопытки;
		
		ИзменитьПараметрСбис("ФормаРаботыСНоменклатурой", ЭлементВСопоставлении.Представление); 
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Модули.МодульСопоставлениеНоменклатуры", ФормаРаботыСоНоменклатурой, ЭтоГлобальныйПараметр);
		
	Исключение
		
		ДопИнформация		= Новый Структура("Значение, Глобальный", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		ИсключениеИзменеиня = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ИзменитьПараметрСбис_СпособСопоставленияНоменклатуры", 765,,,ДопИнформация);
		ВызватьИсключение СбисИсключение_ВСтроку(ИсключениеИзменеиня);
		
	КонецПопытки;

КонецПроцедуры

// Процедура - Изменить параметр сбис СпособСопоставленияНоменклатуры
//
// Параметры:
//  ЗначениеПараметраСбис	 - 	 - 
//  ДопПараметры			 - 	 - 
//
&НаКлиенте
Процедура ИзменитьПараметрСбис_СопоставлениеПо(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения = Неопределено)
	
	ПараметрыСторон = ПолучитьЗначениеПараметраТекущегоСеанса("РеквизитыСторонДляПоиска");
	СторонаИзменить = ПараметрыСторон[ПараметрыСторон.Синонимы.Получить(ДопПараметрыИзменения.Ключ)];
	СторонаИзменить.ПоискТолькоПоИНН = ЗначениеПараметраСбис = "Только по ИНН";

	ИзменитьПараметрСбис_УстановитьВКэш(ЗначениеКэшПрописать, ДопПараметрыИзменения.Ключ, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

КонецПроцедуры

// Процедура - Изменить параметр сбис АдресСервера
//
// Параметры:
//  ЗначениеПараметраСбис	 - 	 - 
//  ДопПараметры			 - 	 - 
//
&НаКлиенте
Процедура ИзменитьПараметрСбис_АдресСервера(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметры = Неопределено)

	ИмяПараметраСбис = "АдресСервера";
	
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС."						+	ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "Парам."					+	ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС.ПараметрыИнтеграции."	+	ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

	ИмяМодуляРаботыСоСтатусами = ПолучитьЗначениеПараметраТекущегоСеанса("ИмяМодуляРаботыСоСтатусами");
	Если Не ИмяМодуляРаботыСоСтатусами = Неопределено Тогда
		
		МодульРаботыСоСтатусами = ПолучитьФормуОбработки(ИмяМодуляРаботыСоСтатусами);
		МодульРаботыСоСтатусами.УстановитьПараметрыМодуля();
		
	КонецЕсли;
	
	НовыеПараметрыСервиса = ПараметрыАдресаСервераСБИС(ЗначениеПараметраСбис);
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС.ПараметрыИнтеграции.КодСервиса",				НовыеПараметрыСервиса.КодСервиса);
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС.ПараметрыИнтеграции.ПредставлениеСервера",	НовыеПараметрыСервиса.ПредставлениеСервера);
	
КонецПроцедуры

//Процедура записывает значение параметра по имени в кэш ГО и Глобальный кэш
&НаКлиенте
Процедура ИзменитьПараметрСбис_ВКэш(КэшЗначение, АдресПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр = Истина)
	
	СтрАдрес			= СтрЗаменить(АдресПараметраСбис, ".", Символы.ПС);
	лАдресГлобальный	= ГлобальныйКэш;
	лАдресЛокальный		= КэшЗначение;
	Для СтрНомерСтрок = 1 По СтрЧислоСтрок(СтрАдрес) - 1 Цикл
		лАдресГлобальный	= лАдресГлобальный[СтрПолучитьСтроку(СтрАдрес, СтрНомерСтрок)];
		лАдресЛокальный		= лАдресЛокальный[СтрПолучитьСтроку(СтрАдрес, СтрНомерСтрок)];
	КонецЦикла;
	лАдресЛокальный.Вставить(СтрПолучитьСтроку(СтрАдрес, СтрНомерСтрок), ЗначениеПараметраСбис);
	Если ЭтоГлобальныйПараметр Тогда
		лАдресГлобальный.Вставить(СтрПолучитьСтроку(СтрАдрес, СтрНомерСтрок),	ЗначениеПараметраСбис);
	КонецЕсли;
	
КонецПроцедуры

