
// Процедура записывает значение параметра по имени в кэш ГО и Глобальный кэш
//
// Параметры:
//  ИмяПараметраСбис		 - Строка					 - Ключ параметра
//  ЗначениеПараметраСбис	 - Произвольное значение	 - Значение параметра установить
//  ДопПараметры			 - Структура				 - 
//		Кэш			- экземпляр ЛокальныйКэш, куда установить параметр
//		Глобально	- Булево (Истина), определяет необходимость обновить параметр глобально, или изменение касается только класса ЛокальныйКэш
//		Параметры	- Стуркутра, доп. параметры для изменения
//		Адрес		- Строка, путь в кэше для установки параметра
//
&НаКлиенте
Процедура ИзменитьПараметрСбис(ИмяПараметраСбис, ЗначениеПараметраСбис, ДопПараметры = Неопределено) Экспорт
    Перем ЗначениеКэшПрописать, ЭтоГлобальныйПараметр, ДопПараметрыИзменения, СерверныйПараметр;
	Если	Не	ДопПараметры = Неопределено Тогда
		ДопПараметры.Свойство("Кэш",		ЗначениеКэшПрописать);
		ДопПараметры.Свойство("Глобально",	ЭтоГлобальныйПараметр);
		ДопПараметры.Свойство("Параметры",	ДопПараметрыИзменения);
		ДопПараметры.Свойство("Серверный",	СерверныйПараметр);
	КонецЕсли;
	Если ЗначениеЗаполнено(СерверныйПараметр) Тогда
		Возврат;
	КонецЕсли;
	Если	ЗначениеКэшПрописать = Неопределено Тогда
		ЗначениеКэшПрописать = ГлавноеОкно.Кэш;
	КонецЕсли;
	Если	ЭтоГлобальныйПараметр = Неопределено Тогда
		ЭтоГлобальныйПараметр = Истина;
	КонецЕсли;
	
	Если		ИмяПараметраСбис = "АдресСервера" Тогда 
		
		ИзменитьПараметрСбис_АдресСервера(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);

	ИначеЕсли	ИмяПараметраСбис = "ИспользоватьГенератор" Тогда
		
		ИзменитьПараметрСбис_ИспользоватьГенератор(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);
		
	ИначеЕсли	ИмяПараметраСбис = "СпособХраненияНастроек" Тогда
		
		ИзменитьПараметрСбис_СпособХраненияНастроек(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);

	ИначеЕсли	ИмяПараметраСбис = "СпособСопоставленияНоменклатуры" Тогда
		
		ИзменитьПараметрСбис_СпособСопоставленияНоменклатуры(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);	
		
	ИначеЕсли Не	ДопПараметры = Неопределено
			И		ДопПараметры.Свойство("Адрес") Тогда
		
		//В прописанное место
		АдресПараметра = ДопПараметры.Адрес + "." + ИмяПараметраСбис;
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, АдресПараметра, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли	ИмяПараметраСбис = "Интеграция" Тогда
		
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, ИмяПараметраСбис,					ЗначениеПараметраСбис, Ложь);
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Модули.Интеграция",	ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		//Совместимость старой отправки.
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ФормаОтправки",					ЗначениеПараметраСбис, Ложь);
		
	ИначеЕсли	ИмяПараметраСбис = "ИнтеграцияИмя" Тогда
		
		ИзменитьПараметрСбис_ВКэш			(ЗначениеКэшПрописать, ИмяПараметраСбис,	ЗначениеПараметраСбис, Ложь);
		ИзменитьПараметрСбис_УстановитьВКэш	(ЗначениеКэшПрописать, ИмяПараметраСбис,	ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли	ИмяПараметраСбис = "ИмяМодуляРаботыСоСтатусами"
			Или	ИмяПараметраСбис = "ФормаРаботыСоСтатусами" Тогда
		
		ИзменитьПараметрСбис_ВКэш			(ЗначениеКэшПрописать, "ФормаРаботыСоСтатусами",		ЗначениеПараметраСбис, Ложь); // Костыль для старой совместимости
		ИзменитьПараметрСбис_УстановитьВКэш	(ЗначениеКэшПрописать, "ИмяМодуляРаботыСоСтатусами",	ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли	ИмяПараметраСбис = "ИмяМодуляРаботыСНоменклатурой"
			Или	ИмяПараметраСбис = "ФормаРаботыСНоменклатурой" Тогда
		
		ИзменитьПараметрСбис_ВКэш			(ЗначениеКэшПрописать, "ФормаРаботыСНоменклатурой",		ЗначениеПараметраСбис, Ложь); // Костыль для старой совместимости
		ИзменитьПараметрСбис_УстановитьВКэш	(ЗначениеКэшПрописать, "ИмяМодуляРаботыСНоменклатурой", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли ИмяПараметраСбис = "СостояниеЭД" Тогда
		
		ИзменитьПараметрСбис_СостояниеЭД(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения);
		
	Иначе
		
		ИзменитьПараметрСбис_УстановитьВКэш(ЗначениеКэшПрописать, ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПараметрСбис_УстановитьВКэш(ЗначениеКэшПрописать, ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр)
	
	Если		ЗначениеКэшПрописать.Парам.Свойство(ИмяПараметраСбис) Тогда
		
		//В Кэш.Парам
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "Парам." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

	ИначеЕсли   ЗначениеКэшПрописать.СБИС.Свойство(ИмяПараметраСбис) Тогда

		//В Кэш.СБИС
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	ИначеЕсли   ЗначениеКэшПрописать.СБИС.ПараметрыИнтеграции.Свойство(ИмяПараметраСбис) Тогда

		//В Кэш.СБИС.ПараметрыИнтеграции
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС.ПараметрыИнтеграции." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

	Иначе
		
		//В Кэш.ТекущийСеанс.Параметры
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Параметры." + ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Изменить параметр сбис СпособХраненияНастроек
//
// Параметры:
//  ЗначениеПараметраСбис	 - 	 - 
//  ДопПараметры			 - 	 - 
//
&НаКлиенте
Процедура ИзменитьПараметрСбис_СпособХраненияНастроек(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметры = Неопределено)

	Если ЗначениеПараметраСбис = 1 Тогда
		ИмяМодуляНастроек = "ФайлыНастроекСервер";
	Иначе
		ИмяМодуляНастроек = "ФайлыНастроекКаталог";
	КонецЕсли;
	
	ЗначениеКэшПрописать.ФормаНастроекОбщее.ОчиститьСобранныеНастройки(ЗначениеКэшПрописать);
	
	МодульНастроек = ПолучитьФормуОбработки(ИмяМодуляНастроек);

	ЗначениеКэшПрописать.Вставить("ФормаНастроек", МодульНастроек);

	МодульНастроек.ПараметрыРаботы = Новый Структура;
	МодульНастроек.ИнициализироватьКэшНастроек(ЗначениеКэшПрописать, ДопПараметры);
	
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "Парам.СпособХраненияНастроек", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
	Если ЭтоГлобальныйПараметр Тогда

		ГлобальныйКэш.ТекущийСеанс.Модули.Настройки = МодульНастроек;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Изменить параметр сбис ИспользоватьГенератор
//
// Параметры:
//  ЗначениеПараметраСбис	 - 	 - 
//  ДопПараметры			 - 	 - 
//
&НаКлиенте
Процедура ИзменитьПараметрСбис_ИспользоватьГенератор(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметры = Неопределено)

	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "Парам.ИспользоватьГенератор", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
	Если ЭтоГлобальныйПараметр Тогда
		ГлобальныйКэш.ТекущийСеанс.Модули.Настройки.ИспользоватьГенераторПриИзменении(ГлавноеОкно.Кэш, ЗначениеПараметраСбис);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Изменить параметр сбис ИспользоватьГенератор
//
// Параметры:
//  ЗначениеКэшПрописать	 - Булево - Кэш, в который прописываем значение параметра 
//  ЗначениеПараметраСбис	 - Булево - Устанавливаемое значение. Здесь это: дублируем ли статусы сбис в регистры 1С
//  ЭтоГлобальныйПараметр	 - Булево - Пишем в глобальный кэш или нет
//  ДопПараметры			 - Структура - Закос под расширение функции 
//
&НаКлиенте
Процедура ИзменитьПараметрСбис_СостояниеЭД(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметры = Неопределено)

	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "Парам.СостояниеЭД", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
	Если ЭтоГлобальныйПараметр Тогда
		ГлобальныйКэш.ТекущийСеанс.Модули.Настройки.ДублироватьСобытияСБИСПриИзменении(ГлавноеОкно.Кэш, ЗначениеПараметраСбис);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Изменить параметр сбис СпособСопоставленияНоменклатуры
//
// Параметры:
//  ЗначениеПараметраСбис	 - 	 - 
//  ДопПараметры			 - 	 - 
//
&НаКлиенте
Процедура ИзменитьПараметрСбис_СпособСопоставленияНоменклатуры(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметрыИзменения = Неопределено)

	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "Парам.СпособСопоставленияНоменклатуры", ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
	
	Если ЗначениеПараметраСбис = 0 Тогда
		ФормаРаботыСНоменклатурой = "СопоставлениеНоменклатуры_СБИС";
	Иначе
		ФормаРаботыСНоменклатурой = "СопоставлениеНоменклатуры_ДБФ";
	КонецЕсли;
	
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ФормаРаботыСНоменклатурой", ФормаРаботыСНоменклатурой, ЭтоГлобальныйПараметр);
	
	Отказ = Ложь;
	ФормаРаботыСоСопоставлением = ЗначениеКэшПрописать.ГлавноеОкно.СбисПолучитьФормуОбработки(ЗначениеКэшПрописать, ФормаРаботыСНоменклатурой, Новый Структура, Отказ);
	
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "ТекущийСеанс.Модули.МодульСопоставлениеНоменклатуры", ФормаРаботыСоСопоставлением, ЭтоГлобальныйПараметр);
	
	Попытка
		ФормаРаботыСоСопоставлением.УстановитьПараметрыМодуля(,ЗначениеКэшПрописать);
	Исключение
		//Исключение не обрабатываем, отвалиться может только в случае, если форма вынесена в внешние функции
	КонецПопытки;

КонецПроцедуры

// Процедура - Изменить параметр сбис АдресСервера
//
// Параметры:
//  ЗначениеПараметраСбис	 - 	 - 
//  ДопПараметры			 - 	 - 
//
&НаКлиенте
Процедура ИзменитьПараметрСбис_АдресСервера(ЗначениеКэшПрописать, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр, ДопПараметры = Неопределено)

	ИмяПараметраСбис = "АдресСервера";
	
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС."						+	ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "Парам."					+	ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС.ПараметрыИнтеграции."	+	ИмяПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр);

	//Ещё требуется установить параметры, зависящие от УРЛ сервиса
	МодульИнтеграция = ПолучитьЗначениеПараметраСбис("Интеграция");
	Если Не МодульИнтеграция = Неопределено Тогда
		
		ВключенРезервныйДомен = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.сбисВключенРезервныйДомен(ГлавноеОкно.Кэш, ЗначениеПараметраСбис);
		ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС.ПараметрыИнтеграции.РезервныйДомен", ВключенРезервныйДомен);
		
	КонецЕсли;
	
	НовыеПараметрыСервиса = ПараметрыАдресаСервераСБИС(ЗначениеПараметраСбис);
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС.ПараметрыИнтеграции.КодСервиса",				НовыеПараметрыСервиса.КодСервиса);
	ИзменитьПараметрСбис_ВКэш(ЗначениеКэшПрописать, "СБИС.ПараметрыИнтеграции.ПредставлениеСервера",	НовыеПараметрыСервиса.ПредставлениеСервера);
	
КонецПроцедуры

//Процедура записывает значение параметра по имени в кэш ГО и Глобальный кэш
&НаКлиенте
Процедура ИзменитьПараметрСбис_ВКэш(КэшЗначение, АдресПараметраСбис, ЗначениеПараметраСбис, ЭтоГлобальныйПараметр = Истина)
	
	СтрАдрес			= СтрЗаменить(АдресПараметраСбис, ".", Символы.ПС);
	лАдресГлобальный	= ГлобальныйКэш;
	лАдресЛокальный		= КэшЗначение;
	Для СтрНомерСтрок = 1 По СтрЧислоСтрок(СтрАдрес) - 1 Цикл
		лАдресГлобальный	= лАдресГлобальный[СтрПолучитьСтроку(СтрАдрес, СтрНомерСтрок)];
		лАдресЛокальный		= лАдресЛокальный[СтрПолучитьСтроку(СтрАдрес, СтрНомерСтрок)];
	КонецЦикла;
	лАдресЛокальный.Вставить(СтрПолучитьСтроку(СтрАдрес, СтрНомерСтрок), ЗначениеПараметраСбис);
	Если ЭтоГлобальныйПараметр Тогда
		лАдресГлобальный.Вставить(СтрПолучитьСтроку(СтрАдрес, СтрНомерСтрок),	ЗначениеПараметраСбис);
	КонецЕсли;
	
КонецПроцедуры

