
&НаКлиенте
Процедура ВызватьОбработчикКнопки(ПараметрыОбработчикаКнопки, ДопПараметры=Неопределено) Экспорт
	//Найдем действие, которое требуется выполнить при нажатии.
	Попытка
		РазделКнопки = ПолучитьМенюТекущегоРаздела(); 
	Исключение
		ВызватьСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектКлиент.ВызватьОбработчикКнопки");
	КонецПопытки;
	
	Для Каждого СбисКнопка Из РазделКнопки Цикл
		Если Не СбисКнопка.ИмяКнопки = ПараметрыОбработчикаКнопки.Имя Тогда 
			Продолжить;
		КонецЕсли;
		фрм = ГлавноеОкно.СбисНайтиФормуФункции(СбисКнопка.МетодАктивации, "РаботаСДокументами1С", "ФормаГлавноеОкно");
		Если фрм = Ложь Тогда
			ВызватьСбисИсключение(, "МодульОбъектКлиент.ВызватьОбработчикКнопки",,"Не удалось найти обработчик метода " + ПараметрыОбработчикаКнопки.Имя);
		Иначе
			ВыполнитьСбисОписаниеОповещения(ГлавноеОкно.Кэш, НовыйСбисОписаниеОповещения(сбисКнопка.МетодАктивации, фрм));
		КонецЕсли;
		Возврат;
	КонецЦикла;
	ВызватьСбисИсключение(, "МодульОбъектКлиент.ВызватьОбработчикКнопки",,"Не удалось найти обработчик метода " + ПараметрыОбработчикаКнопки.Имя);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьМенюТекущегоРаздела() Экспорт
	
    Перем ИмяТекущийРаздел, ЗначениеТекущийРаздел;
	
	Кэш = ГлавноеОкно.Кэш;
	Если		Не	Кэш.Свойство("Разделы") Тогда
		ВызватьСбисИсключение(,"МодульОбъектаКлиент.ПолучитьМенюТекущегоРаздела", 779, , "Не определена структура разделов.");
	ИначеЕсли	Кэш.Текущий = Неопределено Тогда
		ВызватьСбисИсключение(,"МодульОбъектаКлиент.ПолучитьМенюТекущегоРаздела", 779, , "Не определен текущий раздел.");
	ИначеЕсли	Не	Кэш.Разделы.Свойство("р" + Кэш.Текущий.Раздел, ИмяТекущийРаздел) Тогда
		ВызватьСбисИсключение(,"МодульОбъектаКлиент.ПолучитьМенюТекущегоРаздела", 779, , "Не удалось определить раздел.");
	ИначеЕсли	Не Кэш.МенюРазделов.Свойство(ИмяТекущийРаздел, ЗначениеТекущийРаздел) Тогда
		ВызватьСбисИсключение(,"МодульОбъектаКлиент.ПолучитьМенюТекущегоРаздела", 779, , "В меню разделов не найден основной раздел.");
	ИначеЕсли	Не ЗначениеТекущийРаздел.Свойство(Кэш.Текущий.Имя, ЗначениеТекущийРаздел) Тогда
		ВызватьСбисИсключение(,"МодульОбъектаКлиент.ПолучитьМенюТекущегоРаздела", 779, , "В меню разделов не найден текущий раздел.");
	КонецЕсли;
	Возврат ЗначениеТекущийРаздел;
	
КонецФункции

// Функция описывает структуру элементов формы настроек, видимость которых меняется в зависимости от СО и переопределяется на форме интеграции в функции ВидимостьНастроек()
// 
// Возвращаемое значение: Структура Ключ		- Имя элемента формы
//   -                              Значение	- Булево, значение видимости
//
&НаКлиенте
Функция ВидимостьНастроекПоУмолчанию() Экспорт
	
	ВидимостьНастроек = Новый Структура;
	ВидимостьНастроек.Вставить("ИспользоватьНовуюОтправку",		Истина);
	ВидимостьНастроек.Вставить("ИспользоватьГенератор",			Ложь);
	ВидимостьНастроек.Вставить("ВремяОжиданияОтвета",			Ложь);
	ВидимостьНастроек.Вставить("НастройкаЭП",					Ложь); 
	
	Возврат ВидимостьНастроек;
	
КонецФункции

&НаКлиенте
Функция	СформироватьФильтрДляРеестраОнлайна_Сторона(ФильтрСсылка, ДопПараметры)
	Перем ДанныеСторонаИни;
	
	СтруктураСтороныДляФильтра	= Новый Структура; 
	ИниКонфигурация				= ИниПоПараметрам("Конфигурация");
	МодульРаботыСДокументами	= ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов;
	
	Если	Не	ИниКонфигурация.Свойство("мСторона",			ДанныеСторонаИни)
		Или	Не	ДанныеСторонаИни.Свойство(ДопПараметры.Ключ, 	ДанныеСторонаИни) Тогда
		ДанныеСторонаИни = Новый Структура;
	КонецЕсли;
	
	ИННСтороны	= СокрЛП(МодульРаботыСДокументами.ПолучитьРеквизитОбъекта(ФильтрСсылка, "ИНН"));
	Если Не ЗначениеЗаполнено(ИННСтороны) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	СвФЛЮЛ		= Новый Структура("ИНН", ИННСтороны);
	
	Если СтрДлина(ИННСтороны) = 12 Тогда
		
		СтруктураСтороныДляФильтра.Вставить("СвФЛ", СвФЛЮЛ);	
		
	Иначе
		
		Попытка
			
			СвФЛЮЛ.Вставить( "КПП", МодульРаботыСДокументами.ПолучитьРеквизитОбъекта(ФильтрСсылка, "КПП"));
			
		Исключение
			
			// если КПП живет в другом реквизите или вообще не в реквизите, а в регистре сведений
			Если ЗначениеЗаполнено(ДанныеСторонаИни) Тогда 
				
				Контекст = Новый Структура("Документ, Ини, ТекущийРазделИни", ФильтрСсылка, ИниКонфигурация, ДанныеСторонаИни);
				СвФЛЮЛ.Вставить("КПП", СокрЛП(МодульРаботыСДокументами.РассчитатьЗначениеНаСервере("Сторона_КПП", Контекст))); 
				
			КонецЕсли;
		КонецПопытки;
		
		СтруктураСтороныДляФильтра.Вставить("СвЮЛ", СвФЛЮЛ);
		
	КонецЕсли;
	
	Если ДанныеСторонаИни.Свойство("Сторона_КодФилиала") Тогда
		
		Контекст = Новый Структура("Документ, Ини, ТекущийРазделИни", ФильтрСсылка, ИниКонфигурация, ДанныеСторонаИни);
		СвФЛЮЛ.Вставить("КодФилиала", СокрЛП(МодульРаботыСДокументами.РассчитатьЗначениеНаСервере("Сторона_КодФилиала", Контекст)));
		
	КонецЕсли;
	
	ЗначениеСФилиалами = Неопределено;
	Если	ДопПараметры.Свойство("Фильтры")
		И	ДопПараметры.Фильтры.Свойство("Фильтр" + ДопПараметры.Ключ + "СФилиалами", ЗначениеСФилиалами)
		И	ЗначениеЗаполнено(ЗначениеСФилиалами)
		И	ЗначениеСФилиалами Тогда
		СтруктураСтороныДляФильтра.Вставить("ДопПоля", "СФилиалами");
	КонецЕсли;
	
	Возврат СтруктураСтороныДляФильтра;
	
КонецФункции 

