
// Определяет, какую форму необходимо использовать при вызове определенной функции.
//  Возможные параметры:
//
// Параметры:
// 	СбисИмяФункции		- Строка		- Имя функции/порцедуры для поиска.
//	СбисОсновныеФормы	- Массив/Строка	- Набор имен вероятных модулей, где может быть функция
//  ДоПараметры			 - Структура	- 
// 		ВспомогательныеФормы	- массив строк с именами форм для поиска функции в порядке их приоритета.
//		КэшироватьФункцию		- определяет необходимость кэширования найденной формы за определяемой функцией. Если не указано, то включено.
//		ПроверятьВФК			- определяет необходимость проверки наличия функции в внешних функциях. Если не указано, то включено.
//		ПроверятьВО				- определяет необходимость проверки наличия функции в основной обработке. Если не указано, то включено.
// 
// Возвращаемое значение:
//  Форма - модуль, где может быть вызвана функция по имени
//
&НаКлиенте
Функция НайтиФункциюСеансаОбработки(СбисИмяФункции, СбисОсновныеФормы, ДопПараметры = Неопределено) Экспорт
	
	Результат = Ложь;
	
	Если ДопПараметры = Неопределено Тогда
		
		ДопПараметры = Новый Структура;
		
	КонецЕсли;

	// Вернуть в 25.6100 для завершения разделения пользовательских точек входа и функции поиска методов родителей/наследников модулей
	//ДопПараметры.Вставить("ПроверятьВФК", Ложь);
	
	Возврат НайтиФункциюСеансаОбработки_НаКлиенте(СбисИмяФункции, СбисОсновныеФормы, ДопПараметры);
	
КонецФункции

// Места вызова являются АПИ обработки для переопределения через доп. обработку ВнешниеФункции_Клиент
// Определяет, какую форму необходимо использовать при вызове определенной функции с использованием ВФК! 
//  Возможные параметры:
//
// Параметры:
// 	СбисИмяФункции		- Строка		- Имя функции/порцедуры для поиска.
//	СбисОсновныеФормы	- Массив/Строка	- Набор имен вероятных модулей, где может быть функция
//  ДоПараметры			 - Структура	- 
// 		ВспомогательныеФормы	- массив строк с именами форм для поиска функции в порядке их приоритета.
//		КэшироватьФункцию		- определяет необходимость кэширования найденной формы за определяемой функцией. Если не указано, то включено.
//		ПроверятьВФК			- определяет необходимость проверки наличия функции в внешних функциях. Если не указано, то включено.
//		ПроверятьВО				- определяет необходимость проверки наличия функции в основной обработке. Если не указано, то включено.
// 
// Возвращаемое значение:
//  Форма - модуль, где может быть вызвана функция по имени
//
&НаКлиенте
Процедура ПользовательскаяТочкаВходаДляВФК(СбисИмяФункции, СбисОсновныеФормы, ДопПараметры = Неопределено) Экспорт
	Перем АргументыВФК;
	
	Результат = Ложь;
	
	Если ДопПараметры = Неопределено Тогда
		
		ДопПараметры = Новый Структура;
		
	КонецЕсли;
	
	ДопПараметры.Вставить("ПроверятьВФК", Истина);
	
	фрм = НайтиФункциюСеансаОбработки_НаКлиенте(СбисИмяФункции, СбисОсновныеФормы, ДопПараметры);
	Если фрм = Ложь Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ДопПараметры.Свойство("Аргумент", АргументыВФК) Тогда
		
		СтрокаАргументы = "(АргументыВФК, Кэш)";
		
	ИначеЕсли ДопПараметры.Свойство("НаборАргументов", АргументыВФК) Тогда
		
		СтрокаАргументы = "(Кэш";
		Для СчётчикСТрок = 0 По АргументыВФК.Количество() Цикл 
			
			СтрокаАргументы = СтрокаАргументы + ", АргументыВФК[" + СчётчикСТрок + "]";			
			
		КонецЦикла;
		
		СтрокаАргументы = СтрокаАргументы + ")";
		
	Иначе
		
		СтрокаАргументы = "(Кэш)";
		
	КонецЕсли;	
	
	Выполнить("фрм." + СбисИмяФункции + СтрокаАргументы);

КонецПроцедуры

&НаКлиенте
Функция НайтиФункциюСеансаОбработки_НаКлиенте(СбисИмяФункции, СбисОсновныеФормы, ДопПараметры)
	
	Результат = Ложь;
	
	Попытка
		
		//Если тип массив, то ищем перебором в списке форм
		Если ТипЗнч(СбисОсновныеФормы) = Тип("Массив") Тогда
			
			Для Каждого СбисИмяФормы Из СбисОсновныеФормы Цикл
				
				Если Не ЗначениеЗаполнено(СбисИмяФормы) Тогда
					
					Продолжить;
					
				КонецЕсли;
					
				Результат = ПолучитьФормуДляФункцииОбработки(СбисИмяФункции, СбисИмяФормы, ДопПараметры);
				
				Если Не Результат = Ложь Тогда
					
					Возврат Результат;
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			//Передана одна форма для поиска или через разделитель "," строкой
			НаборПодходящихФорм = СтрЗаменить(СбисОсновныеФормы, ",", Символы.ПС);
			
			Для НомерСтрокиИмяФормы = 1 По СтрЧислоСтрок(НаборПодходящихФорм) Цикл 
				
				СбисИмяФормы = СокрЛП(СтрПолучитьСтроку(НаборПодходящихФорм, НомерСтрокиИмяФормы));
				Если ПустаяСтрока(СбисИмяФормы) Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				Результат = ПолучитьФормуДляФункцииОбработки(СбисИмяФункции, СбисОсновныеФормы, ДопПараметры);
				
				Если Не Результат = Ложь Тогда
					
					Возврат Результат;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Исключение
		
		ВызватьИсключение СбисИсключение_Представление(НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.НайтиФункциюСеансаОбработки"));
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

//Делает проверку функции на указанной форме с учетом заплаток и возможностью получения либо только в ВФК, или только на в основном коде.	
&НаКлиенте
Функция ПолучитьФормуДляФункцииОбработки(СбисИмяФункции, СбисИмяФормы, ДопПараметры)
	
	Результат = Ложь;
	Если	(	Не	ДопПараметры.Свойство("ПроверятьВФК")
			Или		ДопПараметры.ПроверятьВФК)
		И	Не ГлавноеОкно.Кэш.Заплатки = Ложь Тогда
		Попытка
			Результат = ПолучитьФормуИПроверитьВызов(СбисИмяФункции, СбисИмяФормы, Новый Структура("Объект1С, Ключ", ГлавноеОкно.Кэш.Заплатки, "ВФК"));
		Исключение
			ВызватьСбисИсключение(ИнформацияОбОшибке(), "СбисНайтиФормуФункцииОбработки");
		КонецПопытки;
	КонецЕсли;
	Если	(	Не	ДопПараметры.Свойство("ПроверятьВО")
			Или		ДопПараметры.ПроверятьВО)
		И	Результат = Ложь Тогда
		Попытка
			Результат = ПолучитьФормуИПроверитьВызов(СбисИмяФункции, СбисИмяФормы, Новый Структура("Ключ", "ВО"));
		Исключение
			ВызватьСбисИсключение(ИнформацияОбОшибке(), "СбисНайтиФормуФункцииОбработки");
		КонецПопытки;
	КонецЕсли;	
	Возврат Результат;
	
КонецФункции

//Проверка наличия функции на форме с пробросом ошибок 
&НаКлиенте
Функция ПолучитьФормуИПроверитьВызов(СбисИмяФункции, СбисИмяФормы, ДопПараметры)
	Перем Результат, ДопПараметрыПолученияФормы;
	
	СбисКлючФункции = ДопПараметры.Ключ + "_" + СбисИмяФункции + "_" + СбисИмяФормы; 
	СбисКлючФункции = СтрЗаменить(СбисКлючФункции," ", "_");
	Если ГлобальныйКэш.ТекущийСеанс.Функции.Свойство(СбисКлючФункции, Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Не ДопПараметры.Ключ = "ВО" Тогда
		ДопПараметрыПолученияФормы = Новый Структура("ОбработкаОбъект", ГлавноеОкно.Кэш.Заплатки);
	КонецЕсли;
	Результат			= Ложь;
	ФормаОбработкиТест	= ПолучитьФормуОбработки(СбисИмяФормы, ДопПараметрыПолученияФормы);
	
	Если ПроверитьВызовНаФорме(ФормаОбработкиТест, СбисИмяФункции) Тогда
		Результат = ФормаОбработкиТест;
	КонецЕсли;
	
	Если	Не	ДопПараметры.Свойство("КэшироватьФункцию")
			Или	ДопПараметры.КэшироватьФункцию Тогда
		ГлобальныйКэш.ТекущийСеанс.Функции.Вставить(СбисКлючФункции, Результат);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции
	
//Проверяет наличие функции в форме	
&НаКлиенте
Функция ПроверитьВызовНаФорме(СбисФормаОбработки, СбисИмяФункции)

	Если СбисФормаОбработки = Ложь Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СбисКодЯзыка = ГлобальныйКэш.ПараметрыСистемы.Конфигурация.ВстроенныйЯзык;
	Попытка
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Выполнить("СбисФормаОбработки." + СбисИмяФункции + "();");
		#Иначе
			сбисТест = Вычислить("СбисФормаОбработки." + СбисИмяФункции + "()");
		#КонецЕсли
	Исключение
		лОписаниеОшибки = ОписаниеОшибки();
		Если Найти(лОписаниеОшибки, НСтр("ru='Метод объекта не обнаружен'; en='Object method not found'", СбисКодЯзыка)+" ("+СбисИмяФункции+")") Тогда
			//функции нет, если ошибка об отсутствии метода
			Возврат Ложь;
		КонецЕсли;
	КонецПопытки;
	Возврат Истина;
	
КонецФункции

