
// Определяет, какую форму необходимо использовать при вызове определенной функции.
//  Возможные параметры:
//
// Параметры:
// 	СбисИмяФункции		- Строка							 - Имя функции/порцедуры для поиска.
//	СбисОсновныеФормы	- Массив/Строка/Форма(МодульОбъекта) - Набор имен вероятных модулей, где может быть функция
//  ДоПараметры												 - Структура	- 
// 		ВспомогательныеФормы	- массив строк с именами форм для поиска функции в порядке их приоритета.
//		КэшироватьФункцию		- определяет необходимость кэширования найденной формы за определяемой функцией. Если не указано, то включено.
//		ПроверятьВФК			- определяет необходимость проверки наличия функции в внешних функциях. Если не указано, то включено.
//		ПроверятьВО				- определяет необходимость проверки наличия функции в основной обработке. Если не указано, то включено.
// 
// Возвращаемое значение:
//  Форма - модуль, где может быть вызвана функция по имени
//
&НаКлиенте
Функция НайтиФункциюСеансаОбработки(СбисИмяФункции, СбисОсновныеФормы, ДопПараметры = Неопределено) Экспорт
	
	Результат = Ложь;
	
	Если ДопПараметры = Неопределено Тогда
		
		ДопПараметры = Новый Структура;
		
	КонецЕсли;

	// Вернуть в 25.6100 для завершения разделения пользовательских точек входа и функции поиска методов родителей/наследников модулей
	//ДопПараметры.Вставить("ПроверятьВФК", Ложь);
	
	Возврат НайтиФункциюСеансаОбработки_НаКлиенте(СбисИмяФункции, СбисОсновныеФормы, ДопПараметры).Значение;
	
КонецФункции

// Места вызова являются АПИ обработки для переопределения через доп. обработку ВнешниеФункции_Клиент
// Определяет, какую форму необходимо использовать при вызове определенной функции с использованием ВФК! 
//  Возможные параметры:
//
// Параметры:
// 	СбисИмяФункции		- Строка		- Имя функции/порцедуры для поиска.
//	СбисОсновныеФормы	- Массив/Строка	- Набор имен вероятных модулей, где может быть функция
//  ДоПараметры			 - Структура	- 
// 		ВспомогательныеФормы	- массив строк с именами форм для поиска функции в порядке их приоритета.
//		КэшироватьФункцию		- определяет необходимость кэширования найденной формы за определяемой функцией. Если не указано, то включено.
//		ПроверятьВФК			- определяет необходимость проверки наличия функции в внешних функциях. Если не указано, то включено.
//		ПроверятьВО				- определяет необходимость проверки наличия функции в основной обработке. Если не указано, то включено.
// 
// Возвращаемое значение:
//  Форма - модуль, где может быть вызвана функция по имени
//
&НаКлиенте
Функция ПользовательскаяТочкаВхода(СбисИмяФункции = Неопределено, СбисОсновныеФормы, ДопПараметрыТочкиВхода = Неопределено) Экспорт
	
	ПараметрыПроверки = Новый Структура("ПроверятьВФК, ПроверятьВО", Истина, Ложь);
	
	фрм = НайтиФункциюСеансаОбработки_НаКлиенте(СбисИмяФункции, СбисОсновныеФормы, ПараметрыПроверки); 
	
	Если фрм.Значение = Ложь Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		Возврат Новый ФиксированнаяСтруктура(
			"Модуль,		ИмяМодуля,		ИмяПроцедуры,	ДополнительныеПараметры",
			фрм.Значение,	фрм.ИмяФормы,	СбисИмяФункции, ДопПараметрыТочкиВхода); 
		
	КонецЕсли;

КонецФункции

&НаКлиенте
Функция ПользовательскаяТочкаВхода_ШаблонВызова(СбисИмяФункции, ДопПараметры = Неопределено)
	Перем Результат;
	
	ДоступныеШаблоны	= ПолучитьЗначениеПараметраТекущегоСеанса("ШаблоныВнешнихФункций");
	Если ДоступныеШаблоны = Неопределено Тогда 
		
		ДоступныеШаблоны = Новый Структура;
		ДоступныеШаблоны.Вставить("сбисПослеФормированияДокумента",			Новый ФиксированнаяСтруктура("Основной, ВызватьИсключение", """Док"", ""Кэш"", ""Контекст""", Ложь));
		ДоступныеШаблоны.Вставить("СбисПослеФормированияПакетаДокументов",	Новый ФиксированнаяСтруктура("ЕстьРезультат, ВызватьИсключение",	Истина, Ложь));
		ДоступныеШаблоны.Вставить("ЗаполнитьИзФайла",						Новый ФиксированнаяСтруктура("Основной", """СтрокаТаблДок"", ""СоставПакета"", ""Кэш"""));
		
		ИзменитьПараметрТекущегоСеанса("ШаблоныВнешнихФункций", ДоступныеШаблоны);
		
	КонецЕсли;
	
	Если Не ДоступныеШаблоны.Свойство(СбисИмяФункции, Результат) Тогда
	
		Результат = Новый ФиксированнаяСтруктура;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПользовательскаяТочкаВхода_ЗаписьВЛог(ОписаниеТочкиВходаВФК, АргументыТочкиВхода, СтрокаШаблон = Неопределено)

	// Собрать данные вызова и параметры для логирования
	СообщениеВЛог = Новый Структура;
	
	Если СтрокаШаблон = Неопределено Тогда 
		
		// Разложить аргументы для более понятного отображения
		Если ТипЗнч(АргументыТочкиВхода) = Тип("ФиксированныйМассив") Тогда
			
			Для Счетчик = 0 По АргументыТочкиВхода.Вграница() Цикл
				
				СообщениеВЛог.Вставить("Аргумент" + Счетчик + 1, АргументыТочкиВхода[Счетчик]);
				
			КонецЦикла;
			
		Иначе
			
			СообщениеВЛог = АргументыТочкиВхода;

		КонецЕсли;
		
	Иначе
		
		Для Счетчик = 1 По СтрЧислоСтрок(СтрокаШаблон) Цикл
			
			КлючОтАргумента	= СокрЛП(СтрПолучитьСтроку(СтрЗаменить(СтрокаШаблон, """", ""), Счетчик));
			ЗначениеАргументаТочки = АргументыТочкиВхода[КлючОтАргумента];
			СообщениеВЛог.Вставить(КлючОтАргумента, ЗначениеАргументаТочки);
			
		КонецЦикла;
		
	КонецЕсли;
	
	лОтладочныеДанные = НовыйЗаписьЛогаSABY(
							"CALL",
							ОписаниеТочкиВходаВФК.ИмяПроцедуры,
							,
							СообщениеВЛог,
							,
							"ВФК_" + ОписаниеТочкиВходаВФК.ИмяМодуля);
	
	Возврат лОтладочныеДанные;
		
КонецФункции

&НаКлиенте
Функция ВызватьПользовательскуюТочкуВхода(ОписаниеТочкиВходаВФК, АргументыТочкиВхода, ДопПараметры = Неопределено) Экспорт
	Перем ШаблонВызоваТочки, РезультатВызова, ДанныеВЛог, ШаблонДляВызова;
	
	Если ДопПараметры = Неопределено Тогда
		
		ДопПараметры = Новый Структура;
		
	КонецЕсли;

	// Установить предопределенные найденные модуль, имя функции и параметры для Выполнить
	ИмяФункцииВФК		= ОписаниеТочкиВходаВФК.ИмяПроцедуры;
	МодульТочкиВФК		= ОписаниеТочкиВходаВФК.Модуль;
	ДопПараметрыВФК		= ОписаниеТочкиВходаВФК.ДополнительныеПараметры;
	ИдентификаторВызова = Новый УникальныйИдентификатор;
	АктивнаОтладка		= ПолучитьЗначениеПараметраСбис("РежимОтладки");
	ОшибкаВызова		= Ложь;
	
	Если Не ЭтоТипСбис(МодульТочкиВФК, "МодульSABY") Тогда
		
		ОшибкаВызова = НовыйСбисИсключение("Вызываемый модуль не является модулем SABY!", МодульОбъектаКлиентСервер_Представление() + ".ВызватьПользовательскуюТочкуВхода");
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаВызова);
		
	КонецЕсли;

	ШаблоныТочкиВхода = ПользовательскаяТочкаВхода_ШаблонВызова(ИмяФункцииВФК);

	Попытка
		
		ТочкаВходаОтдаетРезультат =		ДопПараметры.Свойство("ЕстьРезультат")
									И	ДопПараметры.ЕстьРезультат
								Или		ШаблоныТочкиВхода.Свойство("ЕстьРезультат")
									И	ШаблоныТочкиВхода.ЕстьРезультат;
								
		ШаблоныТочкиВхода.Свойство("Основной", ШаблонВызоваТочки);
		// Для выполнить должен быть задан шаблон. Иначе - через ОписаниеОповещения.
		Если		ШаблонВызоваТочки = Неопределено Тогда
			
			СтрокаАргументы = "";
			Если ТипЗнч(АргументыТочкиВхода) = Тип("ФиксированнаяСтруктура") Тогда
				
				Для Каждого КлючИЗначение Из АргументыТочкиВхода Цикл
					
					СтрокаАргументы = СтрокаАргументы + ", АргументыТочкиВхода[""" + КлючИЗначение.Ключ + """]";
					
				КонецЦикла;
				СтрокаАргументы = Сред(СтрокаАргументы, 3);
				
			ИначеЕсли ТипЗнч(АргументыТочкиВхода) = Тип("ФиксированныйМассив") Тогда
				
				Для Счетчик = 0 По АргументыТочкиВхода.Вграница() Цикл

					СтрокаАргументы = СтрокаАргументы + ", АргументыТочкиВхода[" + Счетчик + "]";
					
				КонецЦикла;
				СтрокаАргументы = Сред(СтрокаАргументы, 3);
				
			Иначе
				
				СтрокаАргументы = "АргументыТочкиВхода, ДопПараметрыВФК";
				
			КонецЕсли;
			
			ШаблонДляВызова	= "." + ИмяФункцииВФК + "(" + СтрокаАргументы + ")";
			
		Иначе
			
			СтрокаШаблон	= СтрЗаменить(ШаблонВызоваТочки, ",", Символы.ПС);
			СтрокаАргументы = "";
			Для НомерСтроки = 1 По СтрЧислоСтрок(СтрокаШаблон) Цикл
				
				КлючОтАргумента	= СокрЛП(СтрПолучитьСтроку(СтрокаШаблон, НомерСтроки));
				СтрокаАргументы = СтрокаАргументы + ", АргументыТочкиВхода[" + КлючОтАргумента + "]";
				
			КонецЦикла;
			СтрокаАргументы = "(" + Сред(СтрокаАргументы, 3) + ")";
			ШаблонДляВызова	= "." + ИмяФункцииВФК + СтрокаАргументы;
			
		КонецЕсли;
			
		Если АктивнаОтладка Тогда
			
			ДанныеВЛог			= Новый Массив;
			лОтладочныеДанные	= ПользовательскаяТочкаВхода_ЗаписьВЛог(ОписаниеТочкиВходаВФК, АргументыТочкиВхода, СтрокаШаблон);
			лОтладочныеДанные.Идентификатор = ИдентификаторВызова;
			ДанныеВЛог.Добавить(лОтладочныеДанные);
 			СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ДанныеВЛог));	

		КонецЕсли;
		
		// Делаем вызов модуля
		
		Если ТочкаВходаОтдаетРезультат Тогда

			РезультатВызова = Вычислить("МодульТочкиВФК" + ШаблонДляВызова);
			
		Иначе
			
			Выполнить ("МодульТочкиВФК" + ШаблонДляВызова);
			
		КонецЕсли;
		
	Исключение
		
		ОшибкаВызова	= Истина;
		РезультатВызова	= НовыйСбисИсключение(ИнформацияОбОшибке(),
			"МодульОбъектаКлиент.ВызватьПользовательскуюТочкуВхода",
			678101,
			"Ошибка вызова дополнительной обработки ""Внешние функции клиент"".");
		
	КонецПопытки;
	
	Если АктивнаОтладка Тогда
		
		ДанныеВЛог			= Новый Массив;
		лОтладочныеДанные	= Новый Структура("Тип, Вызов, Время, Сообщение, Идентификатор, Модуль");
		лОтладочныеДанные.Тип			= ?(ОшибкаВызова, "ERROR", "RESULT");
		лОтладочныеДанные.Вызов			= ИмяФункцииВФК;
		лОтладочныеДанные.Время			= ТекущаяДата();
		лОтладочныеДанные.Сообщение		= РезультатВызова;
		лОтладочныеДанные.Модуль		= "ВФК_" + ОписаниеТочкиВходаВФК.ИмяМодуля;
		ДанныеВЛог.Добавить(лОтладочныеДанные);
		
		СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ДанныеВЛог));	
		
	КонецЕсли;
	
	Если	ОшибкаВызова
		И	(	Не	ШаблоныТочкиВхода.Свойство("ВызватьИсключение")
			Или		ШаблоныТочкиВхода.ВызватьИсключение) Тогда
		
		ВызватьИсключение СбисИсключение_ВСтроку(РезультатВызова);
		
	КонецЕсли;
	
	Возврат РезультатВызова;
	
КонецФункции

&НаКлиенте
Функция НайтиФункциюСеансаОбработки_НаКлиенте(СбисИмяФункции, СбисОсновныеФормы, ДопПараметры)
	
	Результат = Новый Структура("ИмяФормы, Значение");
	
	Попытка
		
		//Если тип массив, то ищем перебором в списке форм
		Если ТипЗнч(СбисОсновныеФормы) = Тип("Массив") Тогда
			
			Для Каждого СбисИмяФормы Из СбисОсновныеФормы Цикл
				
				Если Не ЗначениеЗаполнено(СбисИмяФормы) Тогда
					
					Продолжить;
					
				КонецЕсли;
					
				Результат.Значение = ПолучитьФормуДляФункцииОбработки(СбисИмяФункции, СбисИмяФормы, ДопПараметры);
				
				Если Не Результат.Значение = Ложь Тогда
					
					Результат.ИмяФормы = СбисИмяФормы;
					Возврат Результат;
					
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(СбисОсновныеФормы) = Тип("Строка") Тогда
			
			//Передана одна форма для поиска или через разделитель "," строкой
			НаборПодходящихФорм = СтрЗаменить(СбисОсновныеФормы, ",", Символы.ПС);
			
			Для НомерСтрокиИмяФормы = 1 По СтрЧислоСтрок(НаборПодходящихФорм) Цикл 
				
				СбисИмяФормы = СокрЛП(СтрПолучитьСтроку(НаборПодходящихФорм, НомерСтрокиИмяФормы));
				Если ПустаяСтрока(СбисИмяФормы) Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				Результат.Значение = ПолучитьФормуДляФункцииОбработки(СбисИмяФункции, СбисИмяФормы, ДопПараметры);
				
				Если Не Результат.Значение = Ложь Тогда
					
					Результат.ИмяФормы = СбисИмяФормы;
					Возврат Результат;
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			// Это модуль, на котором нужно проверить наличие вызова
			ФормаОбработкиТест		= СбисОсновныеФормы;
			ПараметрыДляКэширования	= Новый ФиксированнаяСтруктура("Ключ", "ВО");
			Результат.ИмяФормы		= ПолучитьПредставлениеОбъекта(ФормаОбработкиТест);
			Если ЕстьКэшированыйВызововМодуля(, СбисИмяФункции, Результат.ИмяФормы, ПараметрыДляКэширования) Тогда
				
				Возврат ФормаОбработкиТест;
				
			КонецЕсли;

			Если ПроверитьВызовНаФорме(ФормаОбработкиТест, СбисИмяФункции) Тогда
				
				Результат.Значение = ФормаОбработкиТест;
				
			Иначе
				
				Результат.Значение = Ложь;
	
			КонецЕсли;

			КэшироватьВызовМодуля(Результат.Значение, СбисИмяФункции, Результат.ИмяФормы, ПараметрыДляКэширования);
			
		КонецЕсли;
		
	Исключение
		
		ВызватьИсключение СбисИсключение_Выгрузить(НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.НайтиФункциюСеансаОбработки"));
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

//Делает проверку функции на указанной форме с учетом заплаток и возможностью получения либо только в ВФК, или только на в основном коде.	
&НаКлиенте
Функция ПолучитьФормуДляФункцииОбработки(СбисИмяФункции, СбисИмяФормы, ДопПараметры)
	
	Результат = Ложь;
	Если	(	Не	ДопПараметры.Свойство("ПроверятьВФК")
			Или		ДопПараметры.ПроверятьВФК)
		И	Не ГлавноеОкно.Кэш.Заплатки = Ложь Тогда
		Попытка
			Результат = ПолучитьФормуИПроверитьВызов(СбисИмяФункции, СбисИмяФормы, Новый Структура("Объект1С, Ключ", ГлавноеОкно.Кэш.Заплатки, "ВФК"));
		Исключение
			ВызватьСбисИсключение(ИнформацияОбОшибке(), "СбисНайтиФормуФункцииОбработки");
		КонецПопытки;
	КонецЕсли;
	Если	(	Не	ДопПараметры.Свойство("ПроверятьВО")
			Или		ДопПараметры.ПроверятьВО)
		И	Результат = Ложь Тогда
		Попытка
			Результат = ПолучитьФормуИПроверитьВызов(СбисИмяФункции, СбисИмяФормы, Новый Структура("Ключ", "ВО"));
		Исключение
			ВызватьСбисИсключение(ИнформацияОбОшибке(), "СбисНайтиФормуФункцииОбработки");
		КонецПопытки;
	КонецЕсли;	
	Возврат Результат;
	
КонецФункции

//Проверка наличия функции на форме с пробросом ошибок 
&НаКлиенте
Функция ПолучитьФормуИПроверитьВызов(СбисИмяФункции = Неопределено, СбисИмяФормы, ДопПараметры)
	Перем Результат, ДопПараметрыПолученияФормы;
	
	Если ЕстьКэшированыйВызововМодуля(Результат, СбисИмяФункции,СбисИмяФормы, ДопПараметры) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Если Не ДопПараметры.Ключ = "ВО" Тогда
		
		ДопПараметрыПолученияФормы = Новый Структура("ОбработкаОбъект", ГлавноеОкно.Кэш.Заплатки);
		
	КонецЕсли;
	
	Результат			= Ложь;
	ФормаОбработкиТест	= ПолучитьФормуОбработки(СбисИмяФормы, ДопПараметрыПолученияФормы);
	
	Если ПроверитьВызовНаФорме(ФормаОбработкиТест, СбисИмяФункции) Тогда
		
		Результат = ФормаОбработкиТест;
		
	КонецЕсли;
	
	КэшироватьВызовМодуля(Результат, СбисИмяФункции, СбисИмяФормы, ДопПараметры);	

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КлючМодуляДляКэшированияВызовов(ВызываемыйМетод, ИмяМодуляВызова, КлючРасширения = "")
	
	СбисКлючФункции = КлючРасширения + "_" + ВызываемыйМетод + "_" + ИмяМодуляВызова; 
	СбисКлючФункции = СтрЗаменить(СтрЗаменить(СбисКлючФункции," ", "_"), ".", "");
	
	Возврат СбисКлючФункции;
	
КонецФункции

&НаКлиенте
Функция ЕстьКэшированыйВызововМодуля(МодульВызова = Неопределено, ВызываемыйМетод, ИмяМодуляВызова = Неопределено, ДопПараметры = Неопределено)
	Перем Результат;
	
	Если ИмяМодуляВызова = Неопределено Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	СбисКлючФункции = КлючМодуляДляКэшированияВызовов(ВызываемыйМетод, ИмяМодуляВызова, ДопПараметры.Ключ);

	Если Не ГлобальныйКэш.ТекущийСеанс.Функции.Свойство(СбисКлючФункции, Результат) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;

	Если ТипЗнч(Результат) = Тип("ФиксированнаяСтруктура") Тогда
		
		МодульВызова = ПолучитьФормуОбработки(Результат.ИмяМодуля, Результат.ДопПараметрыМодуля);
		
	Иначе
		
		МодульВызова = Результат;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура КэшироватьВызовМодуля(МодульВызова, ВызываемыйМетод, ИмяМодуляВызова, ДопПараметры)
    Перем КлючРасширенияВызова, ДопПараметрыПолученияФормы;
	
	Если			ДопПараметры.Свойство("КэшироватьФункцию")
			И Не	ДопПараметры.КэшироватьФункцию Тогда
			
		Возврат;	
			
	КонецЕсли;
	
	Если Не ДопПараметры.Свойство("Ключ", КлючРасширенияВызова) Тогда
		
		КлючРасширенияВызова = "ВО";
		
	КонецЕсли;
	
	СбисКлючФункции = КлючМодуляДляКэшированияВызовов(ВызываемыйМетод, ИмяМодуляВызова, КлючРасширенияВызова);
		
	Если	Не	МодульВызова = Ложь	
		И	Не	ГлобальныйКэш.ТекущийСеанс.Формы.Интерфейсные.НайтиПоЗначению(ИмяМодуляВызова) = Неопределено
		И	Не	ПолучитьЗначениеПараметраТекущегоСеанса("КэшироватьИнтерфейсныеФормы") Тогда
		
		// Отключено кэширование интерфейсных модулей. Кэширование через описание модуля. Форму получаем каждый раз, но поиск не проводим
		Если КлючРасширенияВызова = "ВФК" Тогда
			
			ДопПараметрыПолученияФормы = Новый Структура("ОбработкаОбъект", ГлавноеОкно.Кэш.Заплатки);
			
		КонецЕсли;
		
		ОписаниеМодуляДляФункций = Новый ФиксированнаяСтруктура("ИмяМодуля, ДопПараметрыМодуля", ИмяМодуляВызова, ДопПараметрыПолученияФормы);
		ГлобальныйКэш.ТекущийСеанс.Функции.Вставить(СбисКлючФункции, ОписаниеМодуляДляФункций);
		
	Иначе
		
		// Кэшируем модуль в готовом виде
		ГлобальныйКэш.ТекущийСеанс.Функции.Вставить(СбисКлючФункции, МодульВызова);
		
	КонецЕсли;

КонецПроцедуры

//Проверяет наличие функции в форме	
&НаКлиенте
Функция ПроверитьВызовНаФорме(СбисФормаОбработки, СбисИмяФункции = Неопределено)

	Если СбисФормаОбработки = Ложь Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если СбисИмяФункции = Неопределено Тогда
		
		// Считаем, что если имя функции не указано, то вызов есть, если есть форма
		Возврат Истина;
		
	КонецЕсли; 
	
	СбисКодЯзыка = ГлобальныйКэш.ПараметрыСистемы.Конфигурация.ВстроенныйЯзык;
	Попытка
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Выполнить("СбисФормаОбработки." + СбисИмяФункции + "();");
		#Иначе
			сбисТест = Вычислить("СбисФормаОбработки." + СбисИмяФункции + "()");
		#КонецЕсли
	Исключение
		лОписаниеОшибки = ОписаниеОшибки();
		Если Найти(лОписаниеОшибки, НСтр("ru='Метод объекта не обнаружен'; en='Object method not found'", СбисКодЯзыка)+" ("+СбисИмяФункции+")") Тогда
			//функции нет, если ошибка об отсутствии метода
			Возврат Ложь;
		КонецЕсли;
	КонецПопытки;
	Возврат Истина;
	
КонецФункции

