
//Возвращает запрашиваемую форму при успехе, структуру ошибки при неудаче Ложь, если форма нет найдено.
&НаКлиенте
Функция ПолучитьФормуОбработки_ПолноеИмяФормы(ИмяФормы, СбисОбъект1С=Неопределено) Экспорт 

	ПолноеИмяФормы	= ИмяФормы;		
	Если СбисОбъект1С = Неопределено Тогда
		#Если Не ТолстыйКлиентОбычноеПриложение Тогда
			ПараметрыСистемы = ГлобальныйКэш_Получить("ПараметрыСистемы");
			ПолноеИмяФормы	= ПараметрыСистемы.Обработка.ПолноеИмя
							+ ПараметрыСистемы.Обработка.КлючФорм
							+ ПолноеИмяФормы;
		#КонецЕсли
	Иначе
		#Если Не ТолстыйКлиентОбычноеПриложение Тогда
			ПолноеИмяФормы	= СбисОбъект1С + ПолноеИмяФормы;
		#КонецЕсли
	КонецЕсли;
	Возврат ПолноеИмяФормы;
	
КонецФункции

//Возвращает запрашиваемую форму при успехе, структуру ошибки при неудаче Ложь, если форма нет найдено.
&НаКлиенте
Функция ПолучитьФормуОбработки_БезопасноеИмяФормы(ПолноеИмяФормы, СбисОбъект1С) Экспорт 

	Если СбисОбъект1С = Неопределено Тогда
		БезопасноеИмяФормы	= "ВО_"	+ СтрЗаменить(ПолноеИмяФормы, ".", "_");
	Иначе
		БезопасноеИмяФормы	= "ВФК_"+ СтрЗаменить(ПолноеИмяФормы, ".", "_");
	КонецЕсли;
	Возврат БезопасноеИмяФормы;
	
КонецФункции

//Возвращает запрашиваемую форму при успехе, структуру ошибки при неудаче Ложь, если форма нет найдено.
&НаКлиенте
Функция ПолучитьФормуОбработки_ЗакэшироватьФорму(ЗначениеФормы, КлючФормы) Экспорт

	ГлобальныйКэш.ТекущийСеанс.Формы.Получены.Вставить(КлючФормы, ЗначениеФормы);
	
КонецФункции

