
&НаКлиенте
Процедура ЗапуститьРешениеПроблемы(ПараметрыВходящие = Неопределено, СбисИсключение) Экспорт

	Если СбисИсключение.help.action = "СохранитьОшибку" Тогда
			
		ВыбраныйКаталог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		ВыбраныйКаталог.Заголовок = "Выберите каталог";
		Если ВыбраныйКаталог.Выбрать() Тогда
			КаталогВыгрузкиФайла = ВыбраныйКаталог.Каталог;//Исправлена ошибка при массовом сохранении документов. 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КаталогВыгрузкиФайла) Тогда
			JSONОшибки = СбисИсключение_ОшибкаВJSON(СбисИсключение);
			ФайлВыгрузки = Новый ТекстовыйДокумент;
			ФайлВыгрузки.ДобавитьСтроку(JSONОшибки);
			ФайлВыгрузки.Записать(КаталогВыгрузкиФайла + "/ДанныеОбОшибке.txt", КодировкаТекста.UTF8);
		КонецЕсли;
		
	Иначе
		
		ЗапуститьПриложение(СбисИсключение.help.action);
		
	КонецЕсли;	
	
КонецПроцедуры

