
// Проверить, подклюена ли фича
//
// Параметры:
//  ПараметрыФичи  - Структура - Обязательный ключ НазваниеФичи со строковым значением
//                 
//  ДопПараметры   - Структура, Неопределено - Доп параметры
//                 (Если вдруг однажды понадобятся)
//
// Возвращаемое значение:
//   Булево   - Истина - фича вклюена
//
&НаКлиенте
Функция ПолучитьЗначениеФичи(ПараметрыФичи, ДопПараметры = Неопределено) Экспорт 
    Перем КлючФичи;

	Если ТипЗнч(ПараметрыФичи) = Тип("Строка") Тогда
		КлючФичи = ПараметрыФичи;
	Иначе
		КлючФичи = ПараметрыФичи.НазваниеФичи;
	КонецЕсли;
	
	БезопасноеЗначениеКлюча	= ПрименитьФорматКСтроке(КлючФичи, , "КлючСтруктуры");
	
	ЗначениеФичи = ПолучитьЗначениеПараметраСбис(БезопасноеЗначениеКлюча);
	Если ЗначениеФичи = Неопределено Тогда
		
		СоответствиеФич	= ПолучитьСписокФичИПредставлений();
		ПараметрыВызова	= Новый Структура("НазваниеФичи");
		// В списке представлений фич нет, значит ключ это уже название фичи.
		Если Не СоответствиеФич.Свойство(БезопасноеЗначениеКлюча, ПараметрыВызова.НазваниеФичи) Тогда
			
			ПараметрыВызова.НазваниеФичи = КлючФичи;
			
		КонецЕсли;
			
		Попытка
			
			ЗначениеФичи = ГлобальныйКэш.ТекущийСеанс.Модули.Интеграция.ExtSys_FeatureIsOn(ПараметрыВызова, Новый Структура("Кэш", ГлавноеОкно.Кэш));
			
		Исключение
			
			ОшибкаЧтения = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ПолучитьЗначениеФичи");
			ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаЧтения);
			
		КонецПопытки;
		
		//фича не получина, не кэшировать значение, т.к. значит что пока не ходили за ней
		Если ЗначениеФичи = Неопределено Тогда
			
			ЗначениеФичи = Ложь;
			
		Иначе
			
			ИзменитьПараметрСбис(БезопасноеЗначениеКлюча, ЗначениеФичи, Новый Структура("Адрес", "СБИС.ПараметрыИнтеграции"));
			
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат ЗначениеФичи;
	
КонецФункции // ПолуитьЗначениеФии()

// Возвращаетсписок доступных фич с их представлением во
// внешней обработке
//
//
// Возвращаемое значение:
//  Структура    - Ключ		- предстваление в 1С
//                 Значение	- имя в СБИС 
//
&НаКлиенте
Функция ПолучитьСписокФичИПредставлений()

	СписокФич = Новый Структура;
	
	СписокФич.Вставить("ПоддержкаМаркировки",													"1c_marking");  
	СписокФич.Вставить("ПоддержкаПрослеживаемости",												"external_trcb_state");
	СписокФич.Вставить("РасширенныйФункционалСопоставленияНоменклатуры",						"1c_nom_extension_52");
	СписокФич.Вставить("РасширенныйФункционалСопоставленияНоменклатуры4100",					"1c_nom_extension_41");
	СписокФич.Вставить("РасширенныйФункционалСопоставленияНоменклатуры_ОбратноеСопоставление",	"1c_nom_extension_rev");
	СписокФич.Вставить("НовыеКонтрагенты",														"1c_new_contractors"); 
	СписокФич.Вставить("ПоддержкаНовойМаркировки", 												"1c_marking_new"); 
	СписокФич.Вставить("СогласованиеЦен", 														"1c_price_coordinat");  
	СписокФич.Вставить("РеестрЗаказов", 														"1c_order_registry"); 
	СписокФич.Вставить("ВыгрузкаНастроекНаШаблон", 												"1c_setting_on_parent");
	СписокФич.Вставить("РасширеннаяРаботаСМаркировкой", 										"1c_mark_extension");
	СписокФич.Вставить("ВыгрузкаНастроекНаШаблон", 												"1c_setting_on_parent");
	СписокФич.Вставить("АвтоматическоеПроведениеЗаказа",										"1c_auto_orders");
	СписокФич.Вставить("ПриличныйВидВО",														"1c_new_design");
	
	Возврат СписокФич;

КонецФункции // ПолучитьСписокФичИПредставлений()

// Сбрасывает значения фич
//
&НаКлиенте
Функция ОчиститьЗначенияФич() Экспорт 
	
	Кэш = ГлавноеОкно.Кэш;
	
	Для Каждого Фича Из ПолучитьСписокФичИПредставлений() Цикл
		
		Если Кэш.СБИС.ПараметрыИнтеграции.Свойство(Фича.Ключ) Тогда
			
			Кэш.СБИС.ПараметрыИнтеграции.Удалить(Фича.Ключ);
			
		КонецЕсли;
		
	КонецЦикла;

КонецФункции // ОчиститьЗначенияФич()

