
&НаКлиенте
Процедура ЗапуститьРешениеПроблемы(ПараметрыВходящие = Неопределено, СбисИсключение) Экспорт

	ОписаниеРешенияПроблемы = ExtException_Get(СбисИсключение, "hint");
	Если ОписаниеРешенияПроблемы.action = "СохранитьОшибку" Тогда
			
		ВыбраныйКаталог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		ВыбраныйКаталог.Заголовок = "Выберите каталог";
		Если ВыбраныйКаталог.Выбрать() Тогда
			
			// Исправлена ошибка при массовом сохранении документов. 
			КаталогВыгрузкиФайла = ВыбраныйКаталог.Каталог;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КаталогВыгрузкиФайла) Тогда
			
			JSONОшибки = ExtException_Dump(СбисИсключение, "json");
			ФайлВыгрузки = Новый ТекстовыйДокумент;
			ФайлВыгрузки.ДобавитьСтроку(JSONОшибки);
			ФайлВыгрузки.Записать(КаталогВыгрузкиФайла + "/ДанныеОбОшибке.txt", КодировкаТекста.UTF8);
			СтрокаЗапустить = КаталогВыгрузкиФайла;
			
		Иначе
			
			Возврат;
			
		КонецЕсли;
		
	ИначеЕсли ОписаниеРешенияПроблемы.action = "ОткрытьОтчетФЛК" Тогда
		
		ВременныйФайл		= НовыйВременныйФайлКлиент(, "txt");
		ТекстовыйДокумент	= Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(ExtException_Get(СбисИсключение, "Details"));
		ТекстовыйДокумент.Записать(ВременныйФайл);
		СтрокаЗапустить = ВременныйФайл;

	Иначе
		
		СтрокаЗапустить = ОписаниеРешенияПроблемы.action
		
	КонецЕсли;	
	
	ЗапуститьПриложение(СтрокаЗапустить);
	
КонецПроцедуры

