
// Функция - возвращает XSLT по параметрам и кладет в Кэш, если ее еще там нет
//
// Параметры:
//  ПараметрыИниВходящие - Параметры ини к чтению.
//		- Неопределено	- прочитать все XSLT	
//		- Строка		- получение XSLT напрямую по имени
//		- Структура		- может содержать ключи: 
//				Имя			- Строка, Массив	- для запроса нескольких XSLT. Если есть, то учитывается только ТипИни
//				Вложение	- ВложениеСБИС		- определение XSLT для вложения. Может быть вместе с Направление. Если Направление не указано, то ставится как Входящий
//  ДопПараметры		 - дополнительно, расширение 
//		- Неопределено	- не требуется
//
// Возвращаемое значение:
//  Струкутра 	- может быть несколько XSLT (поиск по типу 1С/СБИС)
//	Строка		- XSLT получаем по имени
//
&НаКлиенте
Функция XSLTПоПараметрам(ПараметрыВходящие = Неопределено, ДопПараметры = Неопределено) Экспорт 
	
	Перем РезультатЧтения;
	
	Кэш = ГлавноеОкно.Кэш;
	МодульНастройки = Кэш.ТекущийСеанс.Модули.Настройки;
	
	// Если пришли сюда впервые
	Если Не	Кэш.Свойство("xslt") Тогда
		Кэш.Вставить("xslt", Новый Структура);
	КонецЕсли;
	
	Если ПараметрыВходящие = Неопределено Тогда
		// Получить все (структура)
		
		Если	Не	Кэш.Свойство("xslt", РезультатЧтения)
			Или	Не ЗначениеЗаполнено(РезультатЧтения) Тогда
			
			ОшибкаЧтения = Ложь;
			ИдентификаторНастроек = ПолучитьЗначениеПараметраСбис("ИдентификаторНастроек");
			МодульНастройки.СбисСформироватьСтруктуруXSLT(Кэш, ИдентификаторНастроек,, ОшибкаЧтения);
			
			Если ОшибкаЧтения Тогда
				ВызватьСбисИсключение(, "МодульОбъектаКлиент.XSLTПоПараметрам", 770, "Ошибка чтения XSLT", "Ошибка чтения XSLT");
			КонецЕсли;
			
		КонецЕсли;
		
		РезультатЧтения = Кэш.xslt;
		
	ИначеЕсли ТипЗнч(ПараметрыВходящие) = Тип("Строка") Тогда
		// Получить 1 (строка)

		Если Не Кэш.Xslt.Свойство(ПараметрыВходящие, РезультатЧтения) Тогда
			
			ОшибкаЧтения = Ложь;
			ИдентификаторНастроек = ПолучитьЗначениеПараметраСбис("ИдентификаторНастроек");
			РезультатЧтения = МодульНастройки.СбисПолучитьXSLTПоНазванию(Кэш, ИдентификаторНастроек, ПараметрыВходящие, ОшибкаЧтения);
			
			Если ОшибкаЧтения Тогда
				Если ТипЗнч(РезультатЧтения) = Тип("Строка") Тогда
					РезультатЧтения = Кэш.РаботаСJSON.сбисПрочитатьJSON(РезультатЧтения).error;
				КонецЕсли;
				
				Если РезультатЧтения.code = 100 ИЛИ РезультатЧтения.code = 770 Тогда
					// xslt по имени не найдено / некорректное имя xslt
					РезультатЧтения = Неопределено;
				Иначе
					ВызватьСбисИсключение(РезультатЧтения, "МодульОбъектаКлиент.XSLTПоПараметрам", 770, "Ошибка чтения XSLT", "Ошибка чтения XSLT");
				КонецЕсли;
			Иначе
				// Кэшировать в т.ч. пустой результат
				Кэш.Xslt.Вставить(ПараметрыВходящие, РезультатЧтения);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ПараметрыВходящие) = Тип("Массив") Тогда
		// Получить список (структура)
		
		РезультатЧтения = Новый Структура;
		Для Каждого ИмяXSLT Из ПараметрыВходящие Цикл
			
			XSLTЗначение = XSLTПоПараметрам(ИмяXSLT);
			Если НЕ ЗначениеЗаполнено(XSLTЗначение) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			РезультатЧтения.Вставить(ИмяXSLT, XSLTЗначение);
			
		КонецЦикла;
		
	Иначе	
		
		РезультатЧтения = Новый Структура;
		
	КонецЕсли;
	
	Возврат РезультатЧтения;
	
КонецФункции
	
// Функция - возвращает настройки по параметрам
//
// Параметры:
//  ПараметрыИниВходящие - Параметры ини к чтению.
//		- Неопределено	- прочитать все настройки	
//		- Строка		- получение настройки напрямую по имени
//		- Структура		- может содержать ключи: 
//				Имя			- Строка, Массив	- для запроса нескольких настроек. Если есть, то учитывается только ТипИни
//				ТипИни		- Строка			- тип настройки для запроса из поддерживаемых обработкой (Выгрузка/Загрузка/ПроверкаРасхождения).
//				Тип1С		- Строка			- тип 1С для поиска подходящих настроек под объект 1С
//				ТипСБИС		- Строка			- тип формата документа для поиска подходящей настройки
//				Направление	- Строка			- Входящий/Исходящий - в какую сторону требуется настройка. Например, могут быть ини Загрузка_Исходящий 
//				Вложение	- ВложениеСБИС		- определение настройки для ТипИни "Загрузка" вложения. Может быть вместе с Направление. Если Направление не указано, то ставится как Входящий
//				ОбъектСсылка- Ссылка			- определение настройки для обработки конкретного объекта 1С (Документ)
//  ДопПараметры		 - дополнительно, расширение 
//		- Неопределено	- не требуется
//		- Структура		- ПринудительноеЧтение	- Булево признак для попытки чтения настройки, не смотря на отсутствие ее в меню разделов.
//
// Возвращаемое значение:
//  Струкутра 	- если запрашивается/может быть несколько ини (поиск по типу 1С/СБИС)
//	Ини 		- если запрашивается конкретная ини по имени
//
&НаКлиенте
Функция ИниПоПараметрам(ПараметрыИниВходящие=Неопределено, ДопПараметры=Неопределено) Экспорт 
	Перем ТипИниПрочитать, ИмяИниПрочитать, ЗначениеИниДокумента, РежимИниПрочитать, РежимИниАвто, ПринудительноеЧтение;
	
	ОшибкаЧтенияНастройки = Ложь;
	
	Если ТипЗнч(ДопПараметры) = Тип("Строка") Тогда
		
		РежимИниПрочитать = ДопПараметры;
		
	ИначеЕсли Не ДопПараметры = Неопределено Тогда
		
		ДопПараметры.Свойство("Режим",					РежимИниПрочитать);
		ДопПараметры.Свойство("ПринудительноеЧтение",	ПринудительноеЧтение);
		
	КонецЕсли;
	
	РежимИниАвто = "ПоИмени";
	Если ПараметрыИниВходящие = Неопределено Тогда
		
		РежимИниАвто = "Все";
		
	ИначеЕсли	ТипЗнч(ПараметрыИниВходящие) = Тип("Строка")
			Или	ТипЗнч(ПараметрыИниВходящие) = Тип("Массив") Тогда
		
		ИмяИниПрочитать = ПараметрыИниВходящие;  
		
	
	ИначеЕсли	ТипЗнч(ПараметрыИниВходящие) = Тип("Тип") Тогда
		
		ИмяИниПрочитать = СсылочныйТипСтрокой(ПараметрыИниВходящие, "Кратко");

	ИначеЕсли ПараметрыИниВходящие.Свойство("Имя") Тогда
	
		ИмяИниПрочитать = ПараметрыИниВходящие.Имя;
		ПараметрыИниВходящие.Свойство("ТипИни", ТипИниПрочитать);
		
	ИначеЕсли	ПараметрыИниВходящие.Свойство("Тип1С")
			Или	ПараметрыИниВходящие.Свойство("ТипСБИС") Тогда
		
		РежимИниАвто = "ПоФильтру";
		
	ИначеЕсли ПараметрыИниВходящие.Свойство("Вложение")	Тогда
		
		РежимИниАвто = "ПоВложению";
		
	ИначеЕсли ПараметрыИниВходящие.Свойство("ОбъектСсылка") Тогда
		
		РежимИниАвто = "ПоСсылке";
		
	КонецЕсли;
	
	Если ТипИниПрочитать = "ПроверкаРасхождения" Тогда
		
		ПринудительноеЧтение = Истина;
		
	КонецЕсли;
			
	ДопПараметрыЧтенияИни = Новый Структура;
	
	Если ЗначениеЗаполнено(ПринудительноеЧтение) Тогда
		
		ДопПараметрыЧтенияИни.Вставить("ПринудительноеЧтение", ПринудительноеЧтение);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипИниПрочитать) Тогда
		
		ДопПараметрыЧтенияИни.Вставить("Тип", ТипИниПрочитать);
		
	КонецЕсли;
	
	Если РежимИниПрочитать = Неопределено Тогда
		
		РежимИниПрочитать = РежимИниАвто;
				
	КонецЕсли;
	
	РежимИниПрочитать = НРег(РежимИниПрочитать);
	
	Если РежимИниПрочитать = "все" Тогда
		
		//Получить все
		РезультатЧтения = ГлобальныйКэш.ТекущийСеанс.Модули.Настройки.СбисЗаполнитьНеполученныеНастройки(ГлавноеОкно.Кэш, ОшибкаЧтенияНастройки);
		
	ИначеЕсли РежимИниПрочитать = "поимени" Тогда
		
		Если ТипЗнч(ИмяИниПрочитать) = Тип("Строка") Тогда
			
			// Читается 1 инишка напрямую по имени
			РезультатЧтения = ГлобальныйКэш.ТекущийСеанс.Модули.Настройки.Ини(ГлавноеОкно.Кэш, ИмяИниПрочитать, ДопПараметрыЧтенияИни, ОшибкаЧтенияНастройки);
			Если	ОшибкаЧтенияНастройки
				И	РезультатЧтения.code = 779 Тогда
				
				// Ини отсутствует в установленных
				РезультатЧтения			= Неопределено;
				ОшибкаЧтенияНастройки	= Ложь;
				
			КонецЕсли;
	
		Иначе
			
			// Указан массив имен к получению
			РезультатНабора = Новый Структура;
			Для Каждого ИмяИни Из ИмяИниПрочитать Цикл
				
				РезультатЧтения = ГлобальныйКэш.ТекущийСеанс.Модули.Настройки.Ини(ГлавноеОкно.Кэш, ИмяИни, ДопПараметрыЧтенияИни, ОшибкаЧтенияНастройки);
				Если ОшибкаЧтенияНастройки Тогда
					
					Если РезультатЧтения.code = 779 Тогда

						// Ини отсутствует в установленных
						// Продолжим набор ини по списку
						ОшибкаЧтенияНастройки = Ложь;
						Продолжить;
						
					Иначе
						
						// Иная ошибка, остановить набор.
						Прервать;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если РезультатЧтения = Неопределено Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				РезультатНабора.Вставить(ИмяИни, РезультатЧтения);
				
			КонецЦикла;
			
			Если Не ОшибкаЧтенияНастройки Тогда
				
				РезультатЧтения = РезультатНабора;
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли РежимИниПрочитать = "попараметрам" Тогда
		
		ИмяИни = ПараметрыИниВходящие.Имя + "_" + ПараметрыИниВходящие.Версия;
		ИмяИни = СтрЗаменить(ИмяИни, ".", "_");
		
		СкоращенноеИмя	= 	(	ПараметрыИниВходящие.Направление	= "Входящий"	// Загрузка_Входящий_УпдДоп_3_01 = УпдДоп_3_01
							И	ПараметрыИниВходящие.Тип			= "Загрузка")
						Или	(	ПараметрыИниВходящие.Направление	= "Исходящий"	// Выгрузка_Исходящий_УПД = УПД
							И	ПараметрыИниВходящие.Тип			= "Выгрузка");
							
		ПолноеИмя		= ПараметрыИниВходящие.Тип + "_" + ПараметрыИниВходящие.Направление + "_" + ИмяИни;
		РезультатЧтения = ИниПоПараметрам(ПолноеИмя);
		
		Если	РезультатЧтения = Неопределено
			И	СкоращенноеИмя Тогда
			
			РезультатЧтения = ИниПоПараметрам(ИмяИни);
			
		КонецЕсли;
		
	ИначеЕсли РежимИниПрочитать = "пофильтру" Тогда
		
		Возврат ИниПоПараметрам_ПоФильтру(ПараметрыИниВходящие, ДопПараметры);
		
	ИначеЕсли	 РежимИниПрочитать = "повложению" Тогда
		
		//Подбор настройки для вложения
		ПараметрыВложения		= ВложениеСБИС_Получить(ПараметрыИниВходящие.Вложение, "ПараметрыИни");
		ПараметрыДляЗапросаИни	= Новый Структура("Имя, Тип, Направление, Версия");
		
		ПараметрыДляЗапросаИни.Имя			= ПараметрыВложения.Тип;
		ПараметрыДляЗапросаИни.Тип			= "Загрузка";
		ПараметрыДляЗапросаИни.Направление	= ПараметрыВложения.Направление;
		ПараметрыДляЗапросаИни.Версия		= ПараметрыВложения.Версия;
		
		ДопПараметрыЗапросить = Новый Структура("Режим", "ПоПараметрам");
		Возврат ИниПоПараметрам(ПараметрыДляЗапросаИни, ДопПараметрыЗапросить);

	ИначеЕсли	РежимИниПрочитать = "поссылке" Тогда 
		//Подбор настройки под объект
		
		ИмяДок = ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.ПолучитьРеквизитМетаданныхОбъекта(ПараметрыИниВходящие.ОбъектСсылка, "Имя");
		ПараметрыИниВходящие.Вставить("Тип1С", ИмяДок);
		Возврат ИниПоПараметрам(ПараметрыИниВходящие, ДопПараметры);
		
	КонецЕсли;
	
	Если ОшибкаЧтенияНастройки Тогда
		
		ВызватьСбисИсключение(РезультатЧтения, "МодульОбъектаКлиент.ПолучитьИниПоПараметрам");
		
	КонецЕсли;
	
	Возврат РезультатЧтения;
	
КонецФункции

&НаКлиенте
Функция ИниПоПараметрам_ПоФильтру(ПараметрыИниВходящие, ДопПараметры)
	Перем ПараметрДляПроверок;
	
	РезультатЧтения			= Новый Структура;
	ОшибкаЧтенияНастройки	= Ложь;
	//Читаются настройки, которые подходят под типы 1С/SABY/Ини, возможно расширение
	СбисСтруктураРазделов	= ГлобальныйКэш.ТекущийСеанс.Модули.Настройки.ПолучитьСтруктуруРазделов(ГлавноеОкно.Кэш,,ОшибкаЧтенияНастройки);
	Если ОшибкаЧтенияНастройки Тогда
		
		ОшибкаЧтения = НовыйСбисИсключение(СбисСтруктураРазделов, "МодульОбъектаКлиент.ИниПоПараметрам.ПоФильтру",,,"Ошибка запроса ини с описанием разделов.");
		ВызватьИсключение СбисИсключение_ВСтроку(СбисСтруктураРазделов);
		
	КонецЕсли;
	
	СписокИниПолучить = Новый Массив;
	
	Для Каждого СбисРаздел Из сбисСтруктураРазделов Цикл
		
		Если ПараметрыИниВходящие.Свойство("ТипИни") Тогда
			
			Если			ПараметрыИниВходящие.ТипИни = "Загрузка"
			  		И		СбисРаздел.Ключ = "БезРаздела" Тогда
				 
				//Загрузочные ини все идут без раздела	 
					 
			ИначеЕсли		ПараметрыИниВходящие.ТипИни = "Выгрузка"
				    И	Не	СбисРаздел.Ключ = "БезРаздела" Тогда
					 
				//Ини на Выгрузку проверять везде
				
			Иначе
				
				Продолжить;
				
			КонецЕсли;
				
		КонецЕсли;
		
		// Поиск по типам
		Для Каждого СбисПодРаздел Из СбисРаздел.Значение.Список Цикл
			
			УсловиеТип1СВыполнено	= Не	ПараметрыИниВходящие.Свойство("Тип1С", ПараметрДляПроверок)
									Или		ИниПоПараметрам_УсловиеТип1С(ПараметрДляПроверок, СбисПодРаздел);
									
			УсловиеТипСБИСВыполнено = Не	ПараметрыИниВходящие.Свойство("ТипСБИС", ПараметрДляПроверок)
									Или		ИниПоПараметрам_УсловиеТипSABY(ПараметрДляПроверок, СбисПодРаздел);
									
			Если	Не	УсловиеТип1СВыполнено						
				Или	Не	УсловиеТипСБИСВыполнено Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			СписокИниПолучить.Добавить(сбисПодРаздел.Ключ);
			
		КонецЦикла;
		
	КонецЦикла; 
		
	Попытка
		
		РезультатЧтения = ИниПоПараметрам(Новый Структура("Имя", СписокИниПолучить));
		
	Исключение
		
		ОшибкаЧтения = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ИниПоПараметрам.ПоФильтру",,,,ПараметрыИниВходящие);
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаЧтения);
		
	КонецПопытки;
	
	Возврат РезультатЧтения
	
КонецФункции

&НаКлиенте
Функция ИниПоПараметрам_УсловиеТипSABY(ТипSABYСтрока, СбисПодРаздел)
	
	РеестрПодходит = Ложь;
	Если Не	ЗначениеЗаполнено(СбисПодРаздел.Значение.РеестрСБИС_ТипВложений) Тогда
		
		Возврат РеестрПодходит;
		
	КонецЕсли;

	РеестрСБИС_Тип	= СтрЗаменить(сбисПодРаздел.Значение.РеестрСБИС_ТипВложений, ",", Символы.ПС);
	Для НомерСтроки = 1 По СтрЧислоСтрок(РеестрСБИС_Тип) Цикл
		
		Если Не СтрПолучитьСтроку(РеестрСБИС_Тип, НомерСтроки) = ТипSABYСтрока Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		РеестрПодходит = Истина;
		Прервать;
		
	КонецЦикла;
	
	Возврат РеестрПодходит;
	
КонецФункции

&НаКлиенте
Функция ИниПоПараметрам_УсловиеТип1С(Тип1ССтрока, СбисПодРаздел)
	
	РеестрПодходит = Ложь;
	Если Не	ЗначениеЗаполнено(СбисПодРаздел.Значение.Реестр1С_Тип) Тогда
		
		Возврат РеестрПодходит;
		
	КонецЕсли;
	Реестр1С_Тип = СтрЗаменить(сбисПодРаздел.Значение.Реестр1С_Тип, ",", Символы.ПС);
	Для НомерСтроки = 1 По СтрЧислоСтрок(Реестр1С_Тип) Цикл
		
		Если Не СтрПолучитьСтроку(Реестр1С_Тип, НомерСтроки) = Тип1ССтрока Тогда
			
			Продолжить;
			
		КонецЕсли;
		РеестрПодходит = Истина;
		Прервать;
		
	КонецЦикла;

	Возврат РеестрПодходит;
	
КонецФункции

// Функция возвращает название реквизита для значений из файлов настроек.
//	Пример: <Документ_Номер Данные="Файл.Документ.Номер">[Документ].Номер</Документ_Номер> вернет [Документ].Номер, или Номер
//
// Параметры:
//  ЗначениеРеквизита	 - Структура	 - узел ини
//  ДопПараметры		 - Структура	 - расширение
//		ИмяРеквизита - Булево, если нужно только имя реквизита, без родителя
// 
// Возвращаемое значение:
//  Строка - значение узла ини
//
&НаКлиенте
Функция СтроковоеЗначениеУзлаИни(ЗначениеРеквизита, ДопПараметры = Неопределено) Экспорт
	Перем ЗначениеРеквизитаДляОпределния;

	Если		ТипЗнч(ЗначениеРеквизита) = Тип("Строка") Тогда
		ЗначениеРеквизитаДляОпределния = ЗначениеРеквизита;
	ИначеЕсли	Не ЗначениеРеквизита.Свойство("Значение", ЗначениеРеквизитаДляОпределния) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗначениеРеквизитаДляОпределния = СтрЗаменить(ЗначениеРеквизитаДляОпределния, "'", "");
	
	Если	Не	ДопПараметры = Неопределено
		И		ДопПараметры.Свойство("ИмяРеквизита")
		И		ДопПараметры.ИмяРеквизита Тогда
		ЗначениеРеквизитаДляОпределния = Сред(	ЗначениеРеквизитаДляОпределния,
												Найти(ЗначениеРеквизитаДляОпределния,".") + 1, 
												СтрДлина(ЗначениеРеквизитаДляОпределния) - Найти(ЗначениеРеквизитаДляОпределния,"."));
	КонецЕсли;
	
	Возврат ЗначениеРеквизитаДляОпределния;
	
КонецФункции

// Функция - возвращает значение от ини: 
//
// Параметры:
//  ЗначениеУзлаИни	 - Структура	 - Узел из ини
//  ПараметрПолучить - Строка		 - ключ получаемого параметра
//  ДопПараметры	 - Структура	 - расширение для расчета параметра
// 
// Возвращаемое значение:
//  Поризвольный - Результат расчета параметра
//
&НаКлиенте
Функция ЗначениеУзлаИни_Получить(ЗначениеУзлаИни, ПараметрПолучить, ДопПараметры)
	Перем РезультатПараметр, ДопПараметрРасчет, ЗначениеУзлаРасчета;
	
	Если ПараметрПолучить = "ТипОбъекта" Тогда
		
		Если Не ДопПараметры.Свойство("КлючОбъекта", ДопПараметрРасчет) Тогда
			
			ДопПараметрРасчет = "Документ";
			
		КонецЕсли;
		
		// Рассчитаем Документ и получим тип
		Документ_Модуль	= ПолучитьФормуОбработки("Документ_Шаблон");
		Кэш				= ПолучитьТекущийЛокальныйКэш();

		//Получить документ
		КонтекстДляРассчитать		= Новый Структура("Переменные, Документ, Ини, Вложение, СоставПакета", Новый Структура, Новый Структура);
		КонтекстДляРассчитать.Ини	= ЗначениеУзлаИни;
		ЗаполнитьЗначенияСвойств(КонтекстДляРассчитать, ДопПараметры);		
	
		ЗначениеДокумент = Документ_Модуль.РассчитатьПараметрИни(Кэш, ДопПараметрРасчет, ЗначениеУзлаРасчета, КонтекстДляРассчитать, Новый Структура("ВызовСервера", Истина));
		Если	ЗначениеДокумент = Неопределено
			И	ЗначениеУзлаИни.Свойство(ДопПараметрРасчет, ЗначениеУзлаРасчета) Тогда
			
			Если Не ЗначениеУзлаРасчета.Свойство("Тип", ЗначениеДокумент) Тогда
			
				ЗначениеДокумент = ПрименитьФорматКСтроке(ЗначениеУзлаРасчета.Значение, """'", "Убрать");
				
			КонецЕсли;
			
		КонецЕсли;
		
		РезультатПараметр = СсылочныйТипСтрокой(ЗначениеДокумент);
		
	КонецЕсли;
	
	Возврат РезультатПараметр;

КонецФункции

//Функция заполняет структуру для создания элемента справочника 
&НаКлиенте
Функция СтруктураИниОбъектаПоКлючу(СтруктураИни, КлючИни)  Экспорт
	
	ИниРезультат = Новый Структура;
	
	КлючПроверка	= НРег(СокрЛП(КлючИни)) + "_";
	ДлинаПроверка	= СтрДлина(КлючПроверка);
	//Собираем ини для расчета
	Для Каждого Элемент Из СтруктураИни Цикл
		КлючТест	= НРег(Элемент.Ключ);
		
		Если		Лев(КлючТест, ДлинаПроверка) = КлючПроверка Тогда
			
			ИниРезультат.Вставить(Элемент.Ключ, Элемент.Значение);
			
		ИначеЕсли	Лев(КлючТест, 5) = "выбор" Тогда
			
			// Если в Выбор есть хоть один подузел, который подходит по ключу, то весь выбор берется в расчет
			ДобавитьУзел = Ложь;
			Для Каждого ВеткаВыбора Из Элемент.Значение Цикл
												
				СтруктураВыбора = СтруктураИниОбъектаПоКлючу(ВеткаВыбора.Значение, КлючИни);
				Если СтруктураВыбора.Количество() Тогда
					ДобавитьУзел = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ДобавитьУзел Тогда
				
				ИниРезультат.Вставить(Элемент.Ключ, Элемент.Значение);
				
			КонецЕсли;
		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ИниРезультат;
	
КонецФункции

//Функция заполняет структуру для создания элемента справочника 
&НаКлиенте
Функция ЗаполнитьСтруктуруОбъектаПоИни(ОписаниеОбъектаВходящее, ДопПараметры)  Экспорт
	Перем СтрТабл,СтруктураФайла,СтруктураНоменклатура;
	
	ФункцииДокумента	= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	Кэш					= ПолучитьТекущийЛокальныйКэш();

	ИниЗаполнить		= ОписаниеОбъектаВходящее.Ини;
	КлючОбъекта			= ОписаниеОбъектаВходящее.Ключ;
	
	ОписаниеОбъектаВходящее.Ини = СтруктураИниОбъектаПоКлючу(ИниЗаполнить, КлючОбъекта);
	
	// Соответствие описывает, в какие поля в контексте должны заполняться данные от инишки, вида [Документ].Реквизит
	СоответствиеДанныеКлюч = Новый Соответствие;
	СоответствиеДанныеКлюч.Вставить(КлючОбъекта, "ДанныеРезультат");
		
	КонтекстЗаполнения					= Новый Структура("Ини, ДанныеИсточник"); 
	КонтекстЗаполнения.Ини				= ФункцииДокумента.СбисСкопироватьОбъектНаКлиенте(ИниЗаполнить);
	КонтекстЗаполнения.ДанныеИсточник	= ОписаниеОбъектаВходящее.Значение;
	Если ДопПараметры.Свойство("СтрТабл") Тогда
		
		КонтекстЗаполнения.Вставить("ДанныеИсточникЛокальные",	ДопПараметры.СтрТабл);
		
	КонецЕсли;
	
	Если ДопПараметры.Свойство("Вложение") Тогда
		
		КонтекстЗаполнения.Вставить("Вложение",					ДопПараметры.Вложение);
		
	КонецЕсли;
	
	Если ДопПараметры.Свойство("СоставПакета") Тогда
		
		КонтекстЗаполнения.Вставить("СоставПакета",				ДопПараметры.СоставПакета);
		
	КонецЕсли;
	
	Если ОписаниеОбъектаВходящее.Ключ = "Номенклатура" Тогда
		
		СоответствиеДанныеКлюч.Вставить("Номенклатура_РучныеПравки", "РучныеПравки.Номенклатура");
		РучныеПравки = Новый Структура("Номенклатура", ОписаниеОбъектаВходящее.Значение);   
		КонтекстЗаполнения.Вставить("РучныеПравки", РучныеПравки);
		
	КонецЕсли;
	
	КонтекстЗаполнения.Вставить("СопоставлениеДанныеКлючиИни",	СоответствиеДанныеКлюч);
	
	фрм						= ПолучитьФормуОбработки("Документ_Шаблон");
	ПараметрыЗаполнения		= Новый Структура("Кэш, Контекст, ДополнительныеПараметры", Кэш, КонтекстЗаполнения, Новый Структура("ДопАргументыДляФункции", Новый Структура("СтрТабл", СтрТабл)));
	РезультатЗаполнения		= фрм.СбисЗаполнитьСтруктуруОбъекта(ОписаниеОбъектаВходящее, ПараметрыЗаполнения);
	
	Возврат РезультатЗаполнения.Значение;
	
КонецФункции

// Процедура - Удалить из структуры ини по определенным узлам
//
// Параметры:
//  Ини		 - Структура - Структура ини
//  ДопОтбор - Структура - Ключ: имя узла, Значение: значение узла
//
&НаКлиенте
Процедура ДополнительноОтобратьИни(Ини, ДопОтбор) Экспорт
	
	Если ДопОтбор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МодульДокументов = ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	
	КлючиДляУдаления = Новый Массив;
	
	Для каждого ЭлементСтруктуры Из Ини Цикл
	
		Для каждого Отбор Из ДопОтбор Цикл
			
			ЗначениеПараметра = МодульДокументов.РассчитатьЗначение(Отбор.Ключ, ЭлементСтруктуры.Значение);
			
			Если НЕ Найти(ЗначениеПараметра, Отбор.Значение) Тогда
			
				КлючиДляУдаления.Добавить(ЭлементСтруктуры.Ключ);
				Прервать;
			
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЦикла;
	
	Для каждого ИмяИни Из КлючиДляУдаления Цикл
		Ини.Удалить(ИмяИни);
	КонецЦикла;
	
КонецПроцедуры

