
// Функция - возвращает пустую ссылку объекта подбором по конфигурации. НЕ ИСПОЛЬЗОВАТЬ! БРАТЬ ТИП ОТ ПАРАМЕТРА "Поля1С"!
&НаКлиенте
Функция ПолучитьТипМетаданных(ИниКонфигурации, ИмяУзла)
	
	Если ИниКонфигурации.Свойство(ИмяУзла) Тогда
		ЗначениеУзла = СтрЗаменить(ИниКонфигурации[ИмяУзла].Значение, """", "");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Если Лев(ЗначениеУзла, 1) = "[" Тогда
			Возврат ПолучитьТипМетаданных(ИниКонфигурации,	Сред(ЗначениеУзла, 2, Найти(ЗначениеУзла, "]") - 2));
				 
		ИначеЕсли	ТипЗнч(ЗначениеУзла) = Тип("Строка")
			И		Найти(ЗначениеУзла, ".") Тогда 
			      
			Если Найти(Лев(ЗначениеУзла, Найти(ЗначениеУзла, ".") - 1), "Справочник") Тогда
				Возврат ПредопределенноеЗначение("Справочник." + Сред(ЗначениеУзла, Найти(ЗначениеУзла, ".") + 1) + ".ПустаяСсылка");
			ИначеЕсли Найти(Лев(ЗначениеУзла, Найти(ЗначениеУзла, ".") - 1), "Документ") Тогда
				Возврат ПредопределенноеЗначение("Документ." + Сред(ЗначениеУзла, Найти(ЗначениеУзла, ".") + 1) + ".ПустаяСсылка");
			ИначеЕсли Найти(Лев(ЗначениеУзла, Найти(ЗначениеУзла, ".") - 1), "ПланыВидовХарактеристик") Тогда
				Возврат ПредопределенноеЗначение("ПланВидовХарактеристик." + Сред(ЗначениеУзла, Найти(ЗначениеУзла, ".") + 1) + ".ПустаяСсылка");
			КонецЕсли;
				 
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат Неопределено;        
	
КонецФункции

// Функция - Получить имя объекта подбором по метаданным (хардкод) НЕ ИСПОЛЬЗОВАТЬ! ТОЛЬКО ПРЕДУСТАНОВКА ТИПОВ!
//
// Параметры:
//  ОбъектПоиска	- 	Строка		- 	объект для поиска, который мы захардкодили
//  ДопПараметры	-	Структура	-	дополнительные параметры	
// 
// Возвращаемое значение:
//  Строка - Имя объекта строкой, например, "СправочникСсылка.Организации"
//
&НаКлиенте
Функция ПолучитьИмяОбъектаПоМетаданным(ОбъектПоиска, ДопПараметры = Неопределено) Экспорт
	
	ИмяОбъекта = "";
	
	ПараметрыПоискаПоСправочникам = Новый Структура("КлассМетаданных", "Справочники");
	
	ВозможныеСправочники = Новый Структура;
	
	ВозможныеСправочники.Вставить("Организации", Новый СписокЗначений);
	ВозможныеСправочники.Организации.Добавить("Организации");
	
	ВозможныеСправочники.Вставить("Контрагенты", Новый СписокЗначений);
	ВозможныеСправочники.Контрагенты.Добавить("Контрагенты");
	
	ВозможныеСправочники.Вставить("Ответственные", Новый СписокЗначений);
	ВозможныеСправочники.Ответственные.Добавить("Пользователи");
	
	ВозможныеСправочники.Вставить("КлассификаторЕдиницИзмерения", Новый СписокЗначений);
	ВозможныеСправочники.КлассификаторЕдиницИзмерения.Добавить("ЕдиницыИзмерения");
	ВозможныеСправочники.КлассификаторЕдиницИзмерения.Добавить("УпаковкиЕдиницыИзмерения");
	ВозможныеСправочники.КлассификаторЕдиницИзмерения.Добавить("КлассификаторЕдиницИзмерения");
	ВозможныеСправочники.КлассификаторЕдиницИзмерения.Добавить("БазовыеЕдиницыИзмерения");
	
	ВозможныеСправочники.Вставить("Номенклатура", Новый СписокЗначений);
	ВозможныеСправочники.Номенклатура.Добавить("Номенклатура");
	
	ВозможныеСправочники.Вставить("Характеристика", Новый СписокЗначений);
	ВозможныеСправочники.Характеристика.Добавить("ХарактеристикиНоменклатуры");
	
	ВозможныеСправочники.Вставить("Договор", Новый СписокЗначений);
	ВозможныеСправочники.Договор.Добавить("ДоговорыКонтрагентов");
	
	ВозможныеСправочники.Вставить("ФизическиеЛица", Новый СписокЗначений);
	ВозможныеСправочники.Договор.Добавить("ФизическиеЛица");

	Если НЕ ВозможныеСправочники.Свойство(ОбъектПоиска) Тогда
		Возврат ИмяОбъекта;
	КонецЕсли;
	
	Для каждого ИмяСправочника Из ВозможныеСправочники[ОбъектПоиска] Цикл
		
		СправочникСуществует = СбисСуществуетОбъектКонфигурацииКлиент(ИмяСправочника.Значение, ПараметрыПоискаПоСправочникам);
			
		Если СправочникСуществует Тогда
				
			ИмяОбъекта = "СправочникСсылка." + ИмяСправочника.Значение;
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИмяОбъекта;
	
КонецФункции

&НаКлиенте
Функция СсылочныйТипСтрокой(ЗначениеПредставления, ДопПараметры = Неопределено) Экспорт 
	
	Возврат ПолучитьПредставлениеТипа(ЗначениеПредставления, ДопПараметры); 
	
КонецФункции

