
//Подсчет времени на отправку.
&НаКлиенте
Процедура РезультатОтправки_ВремяОтправки(РезультатОтправки, ИдентификаторОтправки) Экспорт
	
	ДетализацияОтправки = РезультатОтправки.ДетализацияОтправки.Получить(ИдентификаторОтправки);
	Если ДетализацияОтправки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДатКнц = ПолучитьДатуВМиллисекундах();
	
	ДетализацияОтправки.ВремяВыполнения	= (ДатКнц - ДетализацияОтправки.ДатНач)/1000;
	РезультатОтправки.ВремяОтправки		= РезультатОтправки.ВремяОтправки + ДетализацияОтправки.ВремяВыполнения;
	
КонецПроцедуры

