
// Процедура - готовит структуру статусов на запись. Сама запись статусов проходит в промежутках ожидания ответов
//
// Параметры:
//  РезультатОтправки		 - Струкутра, РезультатОтправки	 - СоставПакета		 - Структура, СоставПакета	 -
//  	ДопПараметры		 - 	 -
//  ЦепочкаКомандОбработки	 - 								 - 
//
&НаКлиенте
Процедура РезультатОтправки_ПодготовитьСтатусыПоИтогуОтправки(РезультатОтправки, ЦепочкаКомандОбработки) Экспорт
	Перем СтатусРегламент, ОсновнойДокумент1С, ИдентификаторВызова, СтатусУстановить;
	
	МассивСтатусРегламент	= ПолучитьЗначениеПараметраСбис("МассивСтатусРегламент");
	ИдОтправки				= ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "Идентификатор");
	ДокументСБИС			= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "ДокументСБИС");
 	СоставПакета			= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "СоставПакета");

	Если	ДокументСБИС = Неопределено
		Или	СоставПакета = Неопределено Тогда
		//Отправки не было, статуса тоже нет.
		Возврат;
	КонецЕсли;

	//СоставПакета			= ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "СоставПакета");
	РегламентПакета			= СоставПакета_Получить(ДокументСБИС, "РегламентНазвание");
	
	Статусы			= Новый Массив;
	СтатусРегламент	= "";
	Если Не МассивСтатусРегламент = Неопределено Тогда
		Если Не МассивСтатусРегламент.Найти(РегламентПакета) = Неопределено Тогда
			СтатусРегламент = РегламентПакета; 
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Вложение Из СоставПакета.Вложение Цикл
		Если Не Вложение.Свойство("Документы1С") Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого Документ1С Из Вложение.Документы1С Цикл
			
			СтруктураСвойств = Новый Структура("ДокументСБИС_Ид, ДокументСБИС_ИдВложения, ДокументСБИС_Статус", ДокументСБИС.Идентификатор, Вложение.Идентификатор, СтатусУстановить);
			Статусы.Добавить(Новый Структура("СтруктураСвойств, Документ1С, Регламент", СтруктураСвойств, Документ1С.Значение, СтатусРегламент));
			
		КонецЦикла;
	КонецЦикла;
	
	Если	СоставПакета.Вложение.Количество()
		И	СоставПакета.Вложение[0].Свойство("Документы1С")
		И 	ЗначениеЗаполнено(СоставПакета.Вложение[0].Документы1С) Тогда
		ОсновнойДокумент1С = СоставПакета.Вложение[0].Документы1С[0].Значение;
	КонецЕсли;
	
	РезультатОтправки.ДанныеПоСтатусам.Добавить(Новый Структура("Идентификатор, ОсновнойДокумент1С, Статусы", ИдОтправки, ОсновнойДокумент1С, Статусы));
	
КонецПроцедуры

// Процедура - обработка ошибки по отправке
//
// Параметры:
//  РезультатОтправки		 - РезультатОтправки		 - структура отправки
//  ЦепочкаКомандОбработки	 - ЦепочкаКомандОбработки	 - по которой возникла ошибка
//  ПараметрыОшибки			 - Структура				 - описание возникшей ошибки - фатальная/поготовка/авторизация
//
&НаКлиенте
Процедура РезультатОтправки_ОбработатьОшибку(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыОшибки) Экспорт
	Перем лОшибкаФатальная;

	ИдОтправки		= ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "Идентификатор");
	СоставПакета	= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "СоставПакета");
	СбисИсключение	= ПараметрыОшибки.Исключение;
	Если СбисИсключение = Неопределено Тогда
		СбисИсключение	= НовыйСбисИсключение("Пустое сообщение об ошибке.", "МодульОбъектаКлиент.РезультатОтправки_ОбработатьОшибку");
	КонецЕсли;
	
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "Ошибка");
	РезультатОтправки.НаЗаписьСтатусов.Ошибки.Вставить(ИдОтправки, СбисИсключение);

	ТекстОшибки				= СбисИсключение.message;
	ОписаниеРасширенное		= СбисИсключение.details;	
	ЭлементСписка			= РезультатОтправки.ТипыОшибок.НайтиПоЗначению(ТекстОшибки);

	РезультатОтправки.Ошибок = РезультатОтправки.Ошибок + 1;
	
	Если ЭлементСписка = Неопределено Тогда
		РезультатОтправки.ТипыОшибок.Добавить(ТекстОшибки, 1);
	Иначе
		ЭлементСписка.Представление = Число(ЭлементСписка.Представление) + 1;
	КонецЕсли;
	
	Если	ПараметрыОшибки.Свойство("Подготовка")
		И	ПараметрыОшибки.Подготовка Тогда
		//Ошибка из пакета документов, до отправкиподготовки
		РезультатОтправки.Счетчики.ОшибокПодготовки	= РезультатОтправки.Счетчики.ОшибокПодготовки + 1;
	Иначе
		РезультатОтправки.Счетчики.ОшибокОтправки	= РезультатОтправки.Счетчики.ОшибокОтправки + 1;		
	КонецЕсли;
	
	ЭлементСоответствия = РезультатОтправки.ДетализацияОшибок.Получить(ТекстОшибки);
	Если ЭлементСоответствия = Неопределено Тогда
		ЭлементСоответствия = Новый Массив;
		РезультатОтправки.ДетализацияОшибок.Вставить(ТекстОшибки, ЭлементСоответствия);
	КонецЕсли;
	
	//Дополнить детализацию по документам 1С
	Если СоставПакета = Неопределено Тогда
		
		ДокументСбис = ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "ДокументСБИС");
		СтрокаВСоответствие = Новый Структура("Сообщение, СтруктураОшибки", ОписаниеРасширенное, СбисИсключение); 
		СтрокаВСоответствие.Вставить("ИдВложения",		ДокументСбис.Идентификатор); 
		СтрокаВСоответствие.Вставить("ДокументСБИС",	ДокументСбис.Название);

		СтрокаВСоответствие.Вставить("ИДПакета",		ДокументСбис.Идентификатор);
		СтрокаВСоответствие.Вставить("Регламент",		ДокументСбис.Регламент.Название);
		ЭлементСоответствия.Добавить(СтрокаВСоответствие);
		
	Иначе
		
		Для Каждого Вложение Из СоставПакета.Вложение Цикл
			Если Не Вложение.Свойство("Документы1С") Тогда
				Продолжить;
			КонецЕсли;
			Для Каждого Документ1С Из Вложение.Документы1С Цикл
				
				СтрокаВСоответствие = Новый Структура("ОбработанДокумент1С, Сообщение, СтруктураОшибки", Документ1С.Значение, ОписаниеРасширенное, СбисИсключение); 
				СтрокаВСоответствие.Вставить("ИдВложения",		ВложениеСБИС_Получить(Вложение, "Идентификатор")); 
				СтрокаВСоответствие.Вставить("ДокументСБИС",	ВложениеСБИС_Получить(Вложение, "Название"));

				СтрокаВСоответствие.Вставить("ИДПакета",		СоставПакета_Получить(СоставПакета, "Идентификатор"));
				СтрокаВСоответствие.Вставить("Регламент",		СоставПакета_Получить(СоставПакета, "РегламентНазвание"));
				ЭлементСоответствия.Добавить(СтрокаВСоответствие);
				
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Если	Не	ПараметрыОшибки.Свойство("Фатальная", лОшибкаФатальная)
		Или	Не	лОшибкаФатальная	Тогда
		//Считаем нефатальные ошибки по коду и детализации. Если накопится ряд однотипных, без ответов то прерываем отправку.
		СоответствиеНФО = Неопределено;
		Если Не РезультатОтправки.ПараметрыОтправки.Свойство("НефатальныеОшибки", СоответствиеНФО) Тогда
			СоответствиеНФО = Новый Соответствие;
			РезультатОтправки.ПараметрыОтправки.Вставить("НефатальныеОшибки", СоответствиеНФО);
		КонецЕсли;
		СоответствиеПоКоду			= СоответствиеНФО.Получить(СбисИсключение.code);
		СоответствиеПоДетализации	= СоответствиеНФО.Получить(СбисИсключение.details);
		Если СоответствиеПоКоду = Неопределено Тогда
			СоответствиеПоКоду = 0;
		КонецЕсли;
		Если СоответствиеПоДетализации = Неопределено Тогда
			СоответствиеПоДетализации = 0;
		КонецЕсли;
		СоответствиеПоКоду			= СоответствиеПоКоду + 1;
		СоответствиеПоДетализации	= СоответствиеПоДетализации + 1;
		ИсключениеПрерывания		= Неопределено;
		Если		СоответствиеПоКоду >= 10 Тогда
			
			ИсключениеПрерывания = НовыйСбисИсключение(,"МодульОбъектаКлиент.РезультатОтправки_ОбработатьОшибку",
														700, 
														"Повторите попытку позже.", 
														"Получен ряд однотипных ошибок: " + СбисИсключение.message, 
														Новый Структура("Ошибка", СбисИсключение));
		ИначеЕсли	СоответствиеПоДетализации >= 5 Тогда
			ИсключениеПрерывания = НовыйСбисИсключение(,"МодульОбъектаКлиент.РезультатОтправки_ОбработатьОшибку",
														700, 
														"Повторите попытку позже.", 
														"Получен ряд одинаковых ошибок: " + СбисИсключение.details, 
														Новый Структура("Ошибка", СбисИсключение));
		КонецЕсли;
		Если Не ИсключениеПрерывания = Неопределено Тогда
			//Если накоплено n нефатальных ошибок (не получиили ниодного успешного ответа, то прерываем отправку)
			РезультатОтправки.Вставить("ПрерватьОтправку", ИсключениеПрерывания);
		КонецЕсли;
		СоответствиеНФО.Вставить(СбисИсключение.code,		СоответствиеПоКоду);
		СоответствиеНФО.Вставить(СбисИсключение.details,	СоответствиеПоДетализации);
		
		
	ИначеЕсли лОшибкаФатальная Тогда
		Если Не РезультатОтправки.Свойство("ПрерватьОтправку") Тогда
			РезультатОтправки.Вставить("ПрерватьОтправку", НовыйСбисИсключение(СбисИсключение, "МодульОбъектаКлиент.РезультатОтправки_ОбработатьОшибку",,"Получена фатальная ошибка. Отправка прервана."));
		КонецЕсли;
	КонецЕсли;

	//Надо прописать на запись статусы по пакету. Сам статус появится в момент записи РезультатОтправки_ЗаписатьНакопленныеСтатусы
	РезультатОтправки_ПодготовитьСтатусыПоИтогуОтправки(РезультатОтправки, ЦепочкаКомандОбработки);
		
КонецПроцедуры

// Процедура - Результат отправки асинх перед отправкой
//
// Параметры:
//  АсинхронноеСбисСобытие	 - АсинхронноеСбисСобытие	 - событие перед отправкой
//  ПараметрыВызова			 - Структура	 - 
//
&НаКлиенте
Процедура РезультатОтправки_Асинх_ПередОтправкой(АсинхронноеСбисСобытие, ПараметрыВызова) Экспорт

	РезультатОтправки = ПараметрыВызова.РезультатОтправки;
    ПараметрыНачалаОтправки = Новый Структура("ДатНач, ВремяНачала, ВремяВыполнения", ПолучитьДатуВМиллисекундах(), АсинхронноеСбисСобытие.Получено);
	РезультатОтправки.ДетализацияОтправки.Вставить(ПараметрыВызова.Команда.Идентификатор, ПараметрыНачалаОтправки);
	
КонецПроцедуры

// Процедура - событие после отправки
//
// Параметры:
//  АсинхронноеСбисСобытие	 - АсинхронноеСбисСобытие	 - событие перед отправкой
//  ПараметрыВызова			 - Структура	 - 
//
&НаКлиенте
Процедура РезультатОтправки_Асинх_ПослеОтправки(АсинхронноеСбисСобытие, ПараметрыВызова) Экспорт

	РезультатОтправки			= ПараметрыВызова.РезультатОтправки;
	АсинхроннаяСБИСКоманда		= ПараметрыВызова.Команда;
	
	ЦепочкаКомандОбработки		= ЦепочкаКомандОбработки_ПолучитьДанные(АсинхроннаяСБИСКоманда, "ЦепочкаКомандОбработки");
	СтатусОтправленногоПакета	= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "СтатусДокумента");
	
	Если 	СтатусОтправленногоПакета = "ПервичнаяОтправка" Тогда
		
		РезультатОтправки.Счетчики.ПервичныхОтправок = РезультатОтправки.Счетчики.ПервичныхОтправок + 1; 
		
	ИначеЕсли		СтатусОтправленногоПакета = "Переотправка" Тогда
			
		РезультатОтправки.Счетчики.ПовторныхОтправок = РезультатОтправки.Счетчики.ПовторныхОтправок + 1;

	ИначеЕсли 	СтатусОтправленногоПакета = "Черновик" Тогда
		
		РезультатОтправки.Счетчики.ПервичныхОтправок = РезультатОтправки.Счетчики.ПервичныхОтправок + 1;
		
	Иначе
		
		//Вероятно, ошибка отправки или произошло что-то неожидаемое. Поток не занимать.
		Возврат;
		
	КонецЕсли;
	
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ОжидаетОтвета");
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "СтатусДокумента", "Отправлен");
		
	РезультатОтправки.ПараметрыОтправки.Потоки.Вставить(ПараметрыВызова.Команда.Идентификатор, ПараметрыВызова.Команда);
	
КонецПроцедуры

// Процедура - Обработка события успешной отправки пакета
//
// Параметры:
//  АсинхронноеСбисСобытие	 - 	 - 
//  ПараметрыВызова			 - 	 - 
//
&НаКлиенте
Процедура РезультатОтправки_Асинх_Ответ(АсинхронноеСбисСобытие, ПараметрыВызова) Экспорт
	
	Перем СостояниеДокументаОтправки;
	
	РезультатОтправки		= ПараметрыВызова.РезультатОтправки;
	АсинхроннаяСБИСКоманда	= ПараметрыВызова.Команда;
	
	Если РезультатОтправки.ПараметрыОтправки.Свойство("НефатальныеОшибки") Тогда
		//Получен ответ, все накопленные НФО удаляем
		РезультатОтправки.ПараметрыОтправки.Удалить("НефатальныеОшибки");
	КонецЕсли;
	
	ДанныеОтвета = АсинхронноеСбисСобытие.Данные;
	
	Если	Не	ДанныеОтвета.Свойство("Состояние", СостояниеДокументаОтправки)
		Или	Не	СостояниеДокументаОтправки.Свойство("Название", СостояниеДокументаОтправки)
		Или	Не	ЗначениеЗаполнено(СостояниеДокументаОтправки) Тогда
		
		ИсключениеОтвета = НовыйСбисИсключение(, "МодульОбъектаКлиент.РезультатОтправки_Асинх_Ответ", 700,, "В ответе отсутствует состояние документа.", Новый Структура("Ответ", ДанныеОтвета));
		НовоеАсинхронноеСбисСобытие = НовыйАсинхронноеСбисСобытие(АсинхронноеСбисСобытие.Идентификатор, ИсключениеОтвета, "Error");
		РезультатОтправки_Асинх_Ошибка(НовоеАсинхронноеСбисСобытие, ПараметрыВызова);
		
		//Отправка неуспешна, т.к. нет состояния документа
		Возврат;
		
	КонецЕсли;
		
	ИдентификаторОтправки		= ПараметрыВызова.Команда.Идентификатор;
	ЦепочкаКомандОбработки		= ЦепочкаКомандОбработки_ПолучитьДанные(АсинхроннаяСБИСКоманда, "ЦепочкаКомандОбработки");
	ИдентификаторДляОтвета		= ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "Идентификатор");
	СоставПакетаБыло			= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "СоставПакета");
	
	// Собрать прикладную статистику для ответа и вывода на итог отправки
	РезультатОтправки_ПодготовитьСтатусыПоИтогуОтправки(РезультатОтправки, ЦепочкаКомандОбработки);
	РезультатОтправки_ПодготовитьЗаписиПрикладнойСтатистики(РезультатОтправки, СоставПакетаБыло);
	РезультатОтправки_ВремяОтправки(РезультатОтправки, ИдентификаторОтправки);

	РезультатОтправки.Отправлено		= РезультатОтправки.Отправлено + 1;
	РезультатОтправки.ПолученоОтветов	= РезультатОтправки.ПолученоОтветов + 1;
	РезультатОтправки.НаЗаписьСтатусов.Ответы.Вставить(ИдентификаторДляОтвета, АсинхронноеСбисСобытие.Данные);
	
	//Очистить отслеживаемый поток.
	РезультатОтправки.ПараметрыОтправки.Потоки.Удалить(АсинхронноеСбисСобытие.Идентификатор);
	
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "Завершено");
	
КонецПроцедуры

// Процедура - Обработка события ошибки отправки пакета
//
// Параметры:
//  АсинхронноеСбисСобытие	 - 	 - 
//  ПараметрыВызова			 - 	 - 
//
&НаКлиенте
Процедура РезультатОтправки_Асинх_Ошибка(АсинхронноеСбисСобытие, ПараметрыВызова) Экспорт

	РезультатОтправки			= ПараметрыВызова.РезультатОтправки;
	АсинхроннаяСБИСКоманда		= ПараметрыВызова.Команда;
	
	ОтветИсключение				= НовыйСбисИсключение(	АсинхронноеСбисСобытие.Данные,
														ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".РезультатОтправки_Асинх_Ошибка",
														,
														АсинхронноеСбисСобытие.Данные.message);
	ЦепочкаКомандОбработки		= ЦепочкаКомандОбработки_ПолучитьДанные(АсинхроннаяСБИСКоманда, "ЦепочкаКомандОбработки");
	
	ПараметрыОбработатьОшибку	= Новый Структура("Исключение", ОтветИсключение);
	ВозможнаПереотправка		= Ложь;
	ЭтоФатальнаяОшибка			= Ложь;
	
	Если ПараметрыВызова.Свойство("Фатальная") Тогда
		
		ПараметрыОбработатьОшибку.Вставить("Фатальная", ПараметрыВызова.Фатальная);
		ЭтоФатальнаяОшибка = ПараметрыВызова.Фатальная;
		
	КонецЕсли;
	
	Если	Не	ЭтоФатальнаяОшибка
		И		ПараметрыВызова.Свойство("ПотеряАвторизации")
		И		ПараметрыВызова.ПотеряАвторизации Тогда
		АсинхроннаяСбисКоманда	= ПараметрыВызова.Команда;
		
		УспешнаяАвторизация		= Ложь;
		Если	РезультатОтправки.Свойство("ВремяПоследнейАвторизации")
			И	АсинхроннаяСбисКоманда.ВремяВызова <= РезультатОтправки.ВремяПоследнейАвторизации Тогда
			
			// если уже переавторизовались, но получаем более ранние ответы с ошибкой авторизации
			УспешнаяАвторизация = Истина;
			
		Иначе
			
			Если	(	ПолучитьЗначениеПараметраСбис("ВходПоСертификату")
					И	ПолучитьЗначениеПараметраСбис("ЗапомнитьСертификат"))
				Или (Не	ПолучитьЗначениеПараметраСбис("ВходПоСертификату")
					И	ПолучитьЗначениеПараметраСбис("ЗапомнитьПароль")) Тогда
					
				// переавторизуемся
				формаАвторизации	= ПолучитьФормуОбработки("ФормаАвторизация");
				УспешнаяАвторизация	= формаАвторизации.Авторизоваться(ГлавноеОкно.Кэш) = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если УспешнаяАвторизация Тогда
			
			РезультатОтправки.Вставить("ВремяПоследнейАвторизации", ТекущаяДата());
			ВозможнаПереотправка = Истина;
			
		Иначе
			
			// Фатальная ошибка авторизации, прерываем отправку, ибо без авторизации ничего и не уйдёт.
			ЭтоФатальнаяОшибка = Истина;
			ПараметрыОбработатьОшибку.Вставить("Фатальная", Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Ошибка блокировки данных
	Если ОтветИсключение.code = 710 Тогда
		
		ВозможнаПереотправка = Истина;
		
	КонецЕсли;
	
	РезультатОтправки.ПолученоОтветов = РезультатОтправки.ПолученоОтветов + 1;

	Если ВозможнаПереотправка Тогда
		
		ПараметрыОтправки = ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "Параметры");
		ЧислоПереотправок = Неопределено;
		Если Не ПараметрыОтправки.Свойство("ПовторныхОтправок", ЧислоПереотправок) Тогда
			
			ЧислоПереотправок = 0;
			
		КонецЕсли;
		
		Если ЧислоПереотправок > 3 Тогда
			
			ВозможнаПереотправка = Ложь;
			
		Иначе
			
			ПараметрыОтправки.Вставить("ПовторныхОтправок", ЧислоПереотправок + 1);
			
		КонецЕсли;
			
	КонецЕсли;
	
	Если ВозможнаПереотправка Тогда
		
		РезультатОтправки.Счетчики.ОшибокОтправки = РезультатОтправки.Счетчики.ОшибокОтправки + 1;		
		РезультатОтправки_УстановитьОбъект(РезультатОтправки, ЦепочкаКомандОбработки);
		
	Иначе
		
		РезультатОтправки.НеОтправлено = РезультатОтправки.НеОтправлено + 1;
		ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Ошибка", ПараметрыОбработатьОшибку);
		//РезультатОтправки_ОбработатьОшибку(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыОбработатьОшибку);
			
	КонецЕсли;

	РезультатОтправки_ВремяОтправки(РезультатОтправки, ПараметрыВызова.Команда.Идентификатор);
	
	//Очистить отслеживаемый поток.
	РезультатОтправки.ПараметрыОтправки.Потоки.Удалить(АсинхронноеСбисСобытие.Идентификатор);
	
КонецПроцедуры

//Проверяет наличие ответа от плагина и вызывает событие обработки полученного ответа.
//Имеет смысл сделать обработчиком ожидания, но тогда придётся кардинально переделывать отправку на других формах
&НаКлиенте
Процедура РезультатОтправки_ОбработатьОтветы_Асинхронно(РезультатОтправки)

	//Читаем все ответы, которые пришли
	ГлобальныйКэш_ЧтениеОтветовИВызовСобытий();
	ГлобальныйКэш_ОбработатьПросроченныеВызовы();
	
КонецПроцедуры

//Удаляет поток из отслеживаемых отправкой
&НаКлиенте
Процедура РезультатОтправки_УстановитьОбъект(РезультатОтправки, ОбъектУстановить)
	
	Если ЭтоТипСбис(ОбъектУстановить, "ЦепочкаКомандОбработки") Тогда
		
		СтатусДействия		= ЦепочкаКомандОбработки_Получить(ОбъектУстановить, "Статус");
		ОчередьДействий		= ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "Очередь");
		
		Если Не СтатусДействия = "Ошибка" Тогда
			
			Если Не ОбъектУстановить.Команды.Количество() Тогда
				
				ТекстОшибки		= "У действия отсутствует список активных команд";
				СтатусДействия	= "Ошибка";
				ОшибкаЗапускаДействия = НовыйСбисИсключение(776, "МодульОбъектаКлиент.РезультатОтправки_УстановитьОбъект",,,ТекстОшибки);
				ЦепочкаКомандОбработки_Установить(ОбъектУстановить, СтатусДействия, ОшибкаЗапускаДействия);
				
			КонецЕсли;
			
		КонецЕсли;
		
	 	КлючОтправки = ЦепочкаКомандОбработки_Получить(ОбъектУстановить, "Идентификатор");
		ОчередьДействий.Вставить(КлючОтправки, ОбъектУстановить);
		
	ИначеЕсли ЭтоТипСбис(ОбъектУстановить, "АсинхроннаяСбисКоманда") Тогда
		
		АсинхронныеКоманды = ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "АсинхронныеКоманды");
		АсинхронныеКоманды.Вставить(ОбъектУстановить.Идентификатор, ОбъектУстановить);
		
	Иначе
		
		ВызватьИсключение "Неизвестный тип объекта";
		
	КонецЕсли;
	
КонецПроцедуры

//Удаляет поток из отслеживаемых отправкой
&НаКлиенте
Процедура РезультатОтправки_УдалитьПоток(РезультатОтправки, АсинхронноеСбисСобытие) Экспорт
	
	РезультатОтправки.ПараметрыОтправки.Потоки.Удалить(АсинхронноеСбисСобытие.Идентификатор);
	
КонецПроцедуры

//Добавляет поток в отслеживаемые отправкой
&НаКлиенте
Процедура РезультатОтправки_ДобавитьПоток(РезультатОтправки, АсинхронноеСбисКоманда) Экспорт
	
	РезультатОтправки.ПараметрыОтправки.Потоки.Вставить(АсинхронноеСбисКоманда.Идентификатор, АсинхронноеСбисКоманда);
	
КонецПроцедуры

//Освобождает отслеживаемые отправкой потоки сгенерированным событием. Например, при получении критической ошибки
&НаКлиенте
Процедура РезультатОтправки_ОсвободитьПотоки(РезультатОтправки, АсинхронноеСбисСобытие) Экспорт
	
	Для Каждого КлючИЗначениеКомандаВыполнена Из РезультатОтправки.ПараметрыОтправки.Потоки Цикл
		АсинхронноеСбисСобытие_ОсвободитьПоток(АсинхронноеСбисСобытие, КлючИЗначениеКомандаВыполнена.Значение);
	КонецЦикла;
	РезультатОтправки.ПараметрыОтправки.Потоки.Очистить();
	
КонецПроцедуры

