
// Процедура - готовит структуру статусов на запись. Сама запись статусов проходит в промежутках ожидания ответов
//
// Параметры:
//  РезультатОтправки		 - Струкутра, РезультатОтправки	 - СоставПакета		 - Структура, СоставПакета	 -
//  	ДопПараметры		 - 	 -
//  ЦепочкаКомандОбработки	 - 								 - 
//
&НаКлиенте
Процедура РезультатОтправки_ПодготовитьСтатусыПоИтогуОтправки(РезультатОтправки, ЦепочкаКомандОбработки) Экспорт
	Перем СтатусРегламент, ОсновнойДокумент1С, ИдентификаторВызова, СтатусУстановить;
	
	МассивСтатусРегламент	= ПолучитьЗначениеПараметраСбис("МассивСтатусРегламент");
	ИдОтправки				= ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "Идентификатор");
	ДокументСБИС			= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "ДокументСБИС");
 	СоставПакета			= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "СоставПакета");

	Если	ДокументСБИС = Неопределено
		Или	СоставПакета = Неопределено Тогда
		//Отправки не было, статуса тоже нет.
		Возврат;
	КонецЕсли;

	//СоставПакета			= ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "СоставПакета");
	РегламентПакета			= СоставПакета_Получить(ДокументСБИС, "РегламентНазвание");
	
	Статусы			= Новый Массив;
	СтатусРегламент	= "";
	Если Не МассивСтатусРегламент = Неопределено Тогда
		Если Не МассивСтатусРегламент.Найти(РегламентПакета) = Неопределено Тогда
			СтатусРегламент = РегламентПакета; 
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Вложение Из СоставПакета.Вложение Цикл
		Если Не Вложение.Свойство("Документы1С") Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого Документ1С Из Вложение.Документы1С Цикл
			
			СтруктураСвойств = Новый Структура("ДокументСБИС_Ид, ДокументСБИС_ИдВложения, ДокументСБИС_Статус", ДокументСБИС.Идентификатор, Вложение.Идентификатор, СтатусУстановить);
			Статусы.Добавить(Новый Структура("СтруктураСвойств, Документ1С, Регламент", СтруктураСвойств, Документ1С.Значение, СтатусРегламент));
			
		КонецЦикла;
	КонецЦикла;
	
	Если	СоставПакета.Вложение.Количество()
		И	СоставПакета.Вложение[0].Свойство("Документы1С")
		И 	ЗначениеЗаполнено(СоставПакета.Вложение[0].Документы1С) Тогда
		ОсновнойДокумент1С = СоставПакета.Вложение[0].Документы1С[0].Значение;
	КонецЕсли;
	
	РезультатОтправки.ДанныеПоСтатусам.Добавить(Новый Структура("Идентификатор, ОсновнойДокумент1С, Статусы", ИдОтправки, ОсновнойДокумент1С, Статусы));
	
КонецПроцедуры

// Процедура - общий обработчик ошибки для действий, связанных с документов СБИС - прочитать документ, подготовить/выполнить действие
//
// Параметры:
//  РезультатОтправки	 - РезультатОтправки	 - текущая массовая операция
//  ОтветИсключение		 - СбисИсключение		 - готовое исключение для обработки
//  ПараметрыВызова		 - Структура			 - входящие параметры для обработчика асинхронных событий
//
&НаКлиенте
Процедура РезультатОтправки_ОбработатьОшибку_ДокументСБИС(РезультатОтправки, ОтветИсключение, ПараметрыВызова)

	РезультатОтправки			= ПараметрыВызова.РезультатОтправки;
	АсинхроннаяСБИСКоманда		= ПараметрыВызова.Команда;
	ЦепочкаКомандОбработки		= ЦепочкаКомандОбработки_ПолучитьДанные(АсинхроннаяСБИСКоманда, "ЦепочкаКомандОбработки");

	СоставПакета = ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "СоставПакета");
	
	ПараметрыОбработатьОшибку		= Новый Структура("Исключение", ОтветИсключение);
	ВозможнаПереотправка			= Ложь;
	ЭтоФатальнаяОшибка				= Ложь;
	НужноПользовательскоеДействие	= Ложь;
	
	Если ПараметрыВызова.Свойство("Фатальная") Тогда
		
		ПараметрыОбработатьОшибку.Вставить("Фатальная", ПараметрыВызова.Фатальная);
		ЭтоФатальнаяОшибка = ПараметрыВызова.Фатальная;
		
	КонецЕсли;
	
	Если	Не	ЭтоФатальнаяОшибка
		И		ПараметрыВызова.Свойство("ПотеряАвторизации")
		И		ПараметрыВызова.ПотеряАвторизации Тогда
		
		УспешнаяАвторизация		= Ложь;
		Если	РезультатОтправки.Свойство("ВремяПоследнейАвторизации")
			И	АсинхроннаяСбисКоманда.ВремяВызова <= РезультатОтправки.ВремяПоследнейАвторизации Тогда
			
			// если уже переавторизовались, но получаем более ранние ответы с ошибкой авторизации
			УспешнаяАвторизация = Истина;
			
		Иначе
			
			Если	(	ПолучитьЗначениеПараметраСбис("ВходПоСертификату")
					И	ПолучитьЗначениеПараметраСбис("ЗапомнитьСертификат"))
				Или (Не	ПолучитьЗначениеПараметраСбис("ВходПоСертификату")
					И	ПолучитьЗначениеПараметраСбис("ЗапомнитьПароль")) Тогда
					
				// переавторизуемся
				формаАвторизации	= ПолучитьФормуОбработки("ФормаАвторизация");
				УспешнаяАвторизация	= формаАвторизации.Авторизоваться(ГлавноеОкно.Кэш) = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если УспешнаяАвторизация Тогда
			
			РезультатОтправки.Вставить("ВремяПоследнейАвторизации", ТекущаяДата());
			ВозможнаПереотправка = Истина;
			
		Иначе
			
			// Фатальная ошибка авторизации, прерываем отправку, ибо без авторизации ничего и не уйдет.
			ЭтоФатальнаяОшибка = Истина;
			ПараметрыОбработатьОшибку.Вставить("Фатальная", Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Ошибка блокировки данных
	Если ОтветИсключение.code = 710 Тогда
		
		ВозможнаПереотправка = Истина;
		
	// Ошибка отправки первиного документа до УоО
	ИначеЕсли Найти(ОтветИсключение.message, "Нет уведомления об отгрузке необходимого для отправки") Тогда
		
		УпдДоп = НайтиВМассивеСтруктурПоКлючу(СоставПакета.Вложение, "УпдДоп", "Тип");
	
		Если УпдДоп <> Неопределено Тогда
		
			ОтветИсключение = НовыйСбисИсключение(ОтветИсключение,, 773001, ОтветИсключение.message, ОтветИсключение.details);
			НужноПользовательскоеДействие = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	РезультатОтправки.ПолученоОтветов = РезультатОтправки.ПолученоОтветов + 1;

	Если ВозможнаПереотправка Тогда
		
		ПараметрыПереотправки = ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "Переотправка");
		Если ПараметрыПереотправки = Неопределено Тогда
			
			ПараметрыПереотправки = Новый Структура("СчетчикПопыток", 0);
			ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "Переотправка", ПараметрыПереотправки);
			
		КонецЕсли;
		ПараметрыПереотправки.СчетчикПопыток = ПараметрыПереотправки.СчетчикПопыток + 1;
		
		Если ПараметрыПереотправки.СчетчикПопыток > 3 Тогда
			
			ВозможнаПереотправка = Ложь;
			
		КонецЕсли;
			
	КонецЕсли;
	
	Если ВозможнаПереотправка Тогда
		
		ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "РезультатОтправки_Асинх_Переотправка");
		РезультатОтправки_УстановитьОбъект(РезультатОтправки, ЦепочкаКомандОбработки);
		
	ИначеЕсли НужноПользовательскоеДействие Тогда
		
		РезультатОтправки_Асинх_УстановитьВыборПользовательскогоДействия(РезультатОтправки, АсинхроннаяСБИСКоманда, ОтветИсключение);
		
	Иначе
		
		РезультатОтправки.НеОтправлено = РезультатОтправки.НеОтправлено + 1;
		ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Ошибка", ПараметрыОбработатьОшибку);
			
	КонецЕсли;
	
	РезультатОтправки_ВремяОтправки(РезультатОтправки, АсинхроннаяСБИСКоманда.Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОтправки_ОбработатьФатальнуюОшибка(РезультатОтправки, СбисИсключение) Экспорт

	Если Не РезультатОтправки.Свойство("ПрерватьОтправку") Тогда
		РезультатОтправки.Вставить("ПрерватьОтправку", НовыйСбисИсключение(СбисИсключение, "МодульОбъектаКлиент.РезультатОтправки_ОбработатьФатальнуюОшибка",,"Получена фатальная ошибка. Отправка прервана."));
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Результат отправки асинх перед отправкой
//
// Параметры:
//  АсинхронноеСбисСобытие	 - АсинхронноеСбисСобытие	 - событие перед отправкой
//  ПараметрыВызова			 - Структура	 - 
//
&НаКлиенте
Процедура РезультатОтправки_Асинх_ПередОтправкой(АсинхронноеСбисСобытие, ПараметрыВызова) Экспорт

	РезультатОтправки = ПараметрыВызова.РезультатОтправки;
    ПараметрыНачалаОтправки = Новый Структура("ДатНач, ВремяНачала, ВремяВыполнения", ПолучитьДатуВМиллисекундах(), АсинхронноеСбисСобытие.Получено);
	РезультатОтправки.ДетализацияОтправки.Вставить(ПараметрыВызова.Команда.Идентификатор, ПараметрыНачалаОтправки);
	
КонецПроцедуры

// Процедура - событие после отправки
//
// Параметры:
//  АсинхронноеСбисСобытие	 - АсинхронноеСбисСобытие	 - событие перед отправкой
//  ПараметрыВызова			 - Структура	 - 
//
&НаКлиенте
Процедура РезультатОтправки_Асинх_ПослеОтправки(АсинхронноеСбисСобытие, ПараметрыВызова) Экспорт

	РезультатОтправки			= ПараметрыВызова.РезультатОтправки;
	АсинхроннаяСБИСКоманда		= ПараметрыВызова.Команда;
	
	ЦепочкаКомандОбработки		= ЦепочкаКомандОбработки_ПолучитьДанные(АсинхроннаяСБИСКоманда, "ЦепочкаКомандОбработки");
	СтатусОтправленногоПакета	= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "СтатусДокумента");
	
	Если 	СтатусОтправленногоПакета = "ПервичнаяОтправка" Тогда
		
		РезультатОтправки.Счетчики.ПервичныхОтправок = РезультатОтправки.Счетчики.ПервичныхОтправок + 1; 
		
	ИначеЕсли		СтатусОтправленногоПакета = "Переотправка" Тогда
			
		РезультатОтправки.Счетчики.ПовторныхОтправок = РезультатОтправки.Счетчики.ПовторныхОтправок + 1;

	ИначеЕсли 	СтатусОтправленногоПакета = "Черновик" Тогда
		
		РезультатОтправки.Счетчики.ПервичныхОтправок = РезультатОтправки.Счетчики.ПервичныхОтправок + 1;
		
	Иначе
		
		//Вероятно, ошибка отправки или произошло что-то неожидаемое. Поток не занимать.
		Возврат;
		
	КонецЕсли;
	
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ОжидаетОтвета");
	ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "СтатусДокумента", "Отправлен");
		
	РезультатОтправки.ПараметрыОтправки.Потоки.Вставить(ПараметрыВызова.Команда.Идентификатор, ПараметрыВызова.Команда);
	
КонецПроцедуры

// Процедура - Обработка события успешной отправки пакета
//
// Параметры:
//  АсинхронноеСбисСобытие	 - 	 - 
//  ПараметрыВызова			 - 	 - 
//
&НаКлиенте
Процедура РезультатОтправки_Асинх_Ответ(АсинхронноеСбисСобытие, ПараметрыВызова) Экспорт
	
	Перем СостояниеДокументаОтправки;
	
	РезультатОтправки		= ПараметрыВызова.РезультатОтправки;
	АсинхроннаяСБИСКоманда	= ПараметрыВызова.Команда;
	
	Если РезультатОтправки.ПараметрыОтправки.Свойство("НефатальныеОшибки") Тогда
		//Получен ответ, все накопленные НФО удаляем
		РезультатОтправки.ПараметрыОтправки.Удалить("НефатальныеОшибки");
	КонецЕсли;
	
	ДанныеОтвета = АсинхронноеСбисСобытие.Данные;
	
	Если	Не	ДанныеОтвета.Свойство("Состояние", СостояниеДокументаОтправки)
		Или	Не	СостояниеДокументаОтправки.Свойство("Название", СостояниеДокументаОтправки)
		Или	Не	ЗначениеЗаполнено(СостояниеДокументаОтправки) Тогда
		
		ИсключениеОтвета = НовыйСбисИсключение(, "МодульОбъектаКлиент.РезультатОтправки_Асинх_Ответ", 700,, "В ответе отсутствует состояние документа.", Новый Структура("Ответ", ДанныеОтвета));
		НовоеАсинхронноеСбисСобытие = НовыйАсинхронноеСбисСобытие(АсинхронноеСбисСобытие.Идентификатор, ИсключениеОтвета, "Error");
		РезультатОтправки_Асинх_Ошибка(НовоеАсинхронноеСбисСобытие, ПараметрыВызова);
		
		//Отправка неуспешна, т.к. нет состояния документа
		Возврат;
		
	КонецЕсли;
		
	ИдентификаторОтправки		= ПараметрыВызова.Команда.Идентификатор;
	ЦепочкаКомандОбработки		= ЦепочкаКомандОбработки_ПолучитьДанные(АсинхроннаяСБИСКоманда, "ЦепочкаКомандОбработки");
	ИдентификаторДляОтвета		= ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "Идентификатор");
	СоставПакетаБыло			= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "СоставПакета");
	
	// Собрать прикладную статистику для ответа и вывода на итог отправки
	РезультатОтправки_ПодготовитьСтатусыПоИтогуОтправки(РезультатОтправки, ЦепочкаКомандОбработки);
	РезультатОтправки_ПодготовитьЗаписиПрикладнойСтатистики(РезультатОтправки, СоставПакетаБыло);
	РезультатОтправки_ВремяОтправки(РезультатОтправки, ИдентификаторОтправки);

	РезультатОтправки.Отправлено		= РезультатОтправки.Отправлено + 1;
	РезультатОтправки.ПолученоОтветов	= РезультатОтправки.ПолученоОтветов + 1;
	РезультатОтправки.НаЗаписьСтатусов.Ответы.Вставить(ИдентификаторДляОтвета, АсинхронноеСбисСобытие.Данные);
	
	//Очистить отслеживаемый поток.
	РезультатОтправки.ПараметрыОтправки.Потоки.Удалить(АсинхронноеСбисСобытие.Идентификатор);
	
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "Завершено");
	
КонецПроцедуры

// Процедура - штатный обработчик событий ошибок. Формирует исключение для обработки.
//
// Параметры:
//  АсинхронноеСбисСобытие	 - АсинхронноеСбисСобытие	 - сформированное событие, с данными ошибки
//  ПараметрыВызова			 - Структура				 - расширение
//		Команда				 - АсинхроннаяСБИСКоманда	 - выполняемая команда, на которую была получена ошибка
//		РезультатОтправки	 - РезультатОтправки		 - текущее массовое дейтсвие
//		Фатальная			 - Булево (Ложь)			 - является ли полученная ошибка фатальной, или можно продолжить
//
&НаКлиенте
Процедура РезультатОтправки_Асинх_Ошибка(АсинхронноеСбисСобытие, ПараметрыВызова) Экспорт

    РезультатОтправки	= ПараметрыВызова.РезультатОтправки;
	ОтветИсключение		= НовыйСбисИсключение(	АсинхронноеСбисСобытие.Данные,
												ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".РезультатОтправки_Асинх_Ошибка",
												,
												АсинхронноеСбисСобытие.Данные.message);
														
	РезультатОтправки_ОбработатьОшибку_ДокументСБИС(РезультатОтправки, ОтветИсключение, ПараметрыВызова);
	
	РезультатОтправки_УдалитьПоток(РезультатОтправки, АсинхронноеСбисСобытие)

	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОтправки_Асинх_ФатальнаяОшибка(АсинхронноеСбисСобытие, ПараметрыВызова) Экспорт

	РезультатОтправки_ОбработатьФатальнуюОшибка(ПараметрыВызова.РезультатОтправки, АсинхронноеСбисСобытие.Данные);
	
КонецПроцедуры

//Проверяет наличие ответа от плагина и вызывает событие обработки полученного ответа.
//Имеет смысл сделать обработчиком ожидания, но тогда придется кардинально переделывать отправку на других формах
&НаКлиенте
Процедура РезультатОтправки_ОбработатьОтветы_Асинхронно(РезультатОтправки)

	//Читаем все ответы, которые пришли
	ГлобальныйКэш_ЧтениеОтветовИВызовСобытий();
	ГлобальныйКэш_ОбработатьПросроченныеВызовы();
	
КонецПроцедуры

//Удаляет поток из отслеживаемых отправкой
&НаКлиенте
Процедура РезультатОтправки_УстановитьОбъект(РезультатОтправки, ОбъектУстановить)
	
	Если ЭтоТипСбис(ОбъектУстановить, "ЦепочкаКомандОбработки") Тогда
		
		СтатусДействия		= ЦепочкаКомандОбработки_Получить(ОбъектУстановить, "Статус");
		ОчередьДействий		= ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "Очередь");
		
		Если Не СтатусДействия = "Ошибка" Тогда
			
			Если Не ОбъектУстановить.Команды.Количество() Тогда
				
				ТекстОшибки		= "У действия отсутствует список активных команд";
				СтатусДействия	= "Ошибка";
				ОшибкаЗапускаДействия = НовыйСбисИсключение(776, "МодульОбъектаКлиент.РезультатОтправки_УстановитьОбъект",,,ТекстОшибки);
				ЦепочкаКомандОбработки_Установить(ОбъектУстановить, СтатусДействия, ОшибкаЗапускаДействия);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Если цепочка была завершена, но устанавливается, тогда ее надо реанимировать
		Если СтатусДействия = "Завершено" Тогда
		
			ЦепочкаКомандОбработки_Установить(ОбъектУстановить, "Статус", "ГотовКЗапуску");
		
		КонецЕсли;
		
	 	КлючОтправки = ЦепочкаКомандОбработки_Получить(ОбъектУстановить, "Идентификатор");
		ОчередьДействий.Вставить(КлючОтправки, ОбъектУстановить);
		
	ИначеЕсли ЭтоТипСбис(ОбъектУстановить, "АсинхроннаяСбисКоманда") Тогда
		
		АсинхронныеКоманды = ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "АсинхронныеКоманды");
		АсинхронныеКоманды.Вставить(ОбъектУстановить.Идентификатор, ОбъектУстановить);
		
	Иначе
		
		ВызватьИсключение "Неизвестный тип объекта";
		
	КонецЕсли;
	
КонецПроцедуры

//Удаляет поток из отслеживаемых отправкой
&НаКлиенте
Процедура РезультатОтправки_УдалитьПоток(РезультатОтправки, АсинхронноеСбисСобытие) Экспорт
	
	РезультатОтправки.ПараметрыОтправки.Потоки.Удалить(АсинхронноеСбисСобытие.Идентификатор);
	
КонецПроцедуры

//Добавляет поток в отслеживаемые отправкой
&НаКлиенте
Процедура РезультатОтправки_ДобавитьПоток(РезультатОтправки, АсинхронноеСбисКоманда) Экспорт
	
	РезультатОтправки.ПараметрыОтправки.Потоки.Вставить(АсинхронноеСбисКоманда.Идентификатор, АсинхронноеСбисКоманда);
	
КонецПроцедуры

//Освобождает отслеживаемые отправкой потоки сгенерированным событием. Например, при получении критической ошибки
&НаКлиенте
Процедура РезультатОтправки_ОсвободитьПотоки(РезультатОтправки, АсинхронноеСбисСобытие) Экспорт
	
	Для Каждого КлючИЗначениеКомандаВыполнена Из РезультатОтправки.ПараметрыОтправки.Потоки Цикл
		АсинхронноеСбисСобытие_ОсвободитьПоток(АсинхронноеСбисСобытие, КлючИЗначениеКомандаВыполнена.Значение);
	КонецЦикла;
	РезультатОтправки.ПараметрыОтправки.Потоки.Очистить();
	
КонецПроцедуры

