
&НаКлиенте
Процедура РезультатОтправки_Асинх_УстановитьВыборПользовательскогоДействия(РезультатОтправки, АсинхроннаяСБИСКоманда, ПараметрыВыбора)
	
	ЦепочкаКомандОбработки		= ЦепочкаКомандОбработки_ПолучитьДанные(АсинхроннаяСБИСКоманда, "ЦепочкаКомандОбработки");
	СоставПакета				= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "СоставПакета");
	ДокументСБИС				= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "ДокументСБИС");

	КэшПользовательскихДействий = ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "КэшПользовательскихДействий");
	КэшПользовательскихДействий.ТекущийЗапрос = ПараметрыВыбора;
	
	КомандаВыполнить	= "РезультатОтправки_Асинх_ПользовательскиеДействия";
	КомандаЗавершить	= "РезультатОтправки_Асинх_ПользовательскиеДействияЗавершить";
	КомандаПродолжить	= "РезультатОтправки_Асинх_ОбработатьПользовательскоеДействие";
	
	ДействиеАктивировать = НовыйЦепочкаКомандОбработки(,,10);
	ЦепочкаКомандОбработки_УстановитьДанные(ДействиеАктивировать, "СоставПакета", СоставПакета);
	ЦепочкаКомандОбработки_УстановитьДанные(ДействиеАктивировать, "ДокументСБИС", ДокументСБИС);
	
	ЦепочкаКомандОбработки_УстановитьКоманду(ДействиеАктивировать, КомандаВыполнить, РезультатОтправки);
	ЦепочкаКомандОбработки_УстановитьКоманду(ДействиеАктивировать, КомандаЗавершить, РезультатОтправки);
	
	ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, КомандаПродолжить, РезультатОтправки);
	
	РезультатОтправки_УстановитьОбъект(РезультатОтправки, ДействиеАктивировать);

	ЦепочкаКомандОбработки_УстановитьПодпискуДействия(ДействиеАктивировать, ЦепочкаКомандОбработки, КомандаЗавершить);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОтправки_Асинх_ОбработатьПользовательскоеДействие(РезультатОтправки, ПараметрыВызова) Экспорт

	КэшПользовательскихДействий = ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "КэшПользовательскихДействий");
	ЦепочкаКомандОбработки = ПараметрыВызова.ЦепочкаКомандОбработки;
	СоставПакета = ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "СоставПакета");
	ДокументСБИС = ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "ДокументСБИС");
	ИдПакета = СоставПакета_Получить(?(ЗначениеЗаполнено(СоставПакета), СоставПакета, ДокументСБИС), "Идентификатор");
	
	Документ1С = СоставПакета_Получить(СоставПакета, "ОсновнойДокумент1С");
	
	СтрокаВыбора = НайтиВМассивеСтруктурПоКлючу(РезультатОтправки.ДанныеКОтправке.СписокПакетов, ИдПакета, "ИдПакета");
	
	Если СтрокаВыбора = Неопределено
		ИЛИ НЕ СтрокаВыбора.Свойство("СоставПакета") Тогда
		СписокПакетов = Новый СписокЗначений;
		СписокПакетов.Добавить(Документ1С);
		СтрокаВыбора = Новый Структура("СоставПакета, Статус, ИдПакета", СписокПакетов, -1);
	КонецЕсли;
	
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("РезультатОтправки",			РезультатОтправки);
	ПараметрыДействия.Вставить("СтрокаВыбора",				СтрокаВыбора);
	ПараметрыДействия.Вставить("ЦепочкаКомандОбработки",	ЦепочкаКомандОбработки);
	ПараметрыДействия.Вставить("СоставПакета",				СоставПакета);
	ПользовательскиеДействия_Выполнить(КэшПользовательскихДействий.РезультатЗапроса, ПараметрыДействия);

КонецПроцедуры

&НаКлиенте
Процедура РезультатОтправки_Асинх_ПользовательскиеДействия(РезультатОтправки, ПараметрыВызова) Экспорт
	
	ЦепочкаКомандОбработки		= ПараметрыВызова.ЦепочкаКомандОбработки;
	КэшПользовательскихДействий	= ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "КэшПользовательскихДействий");
	ОснованиеЗапроса			= КэшПользовательскихДействий.ТекущийЗапрос;
	ДействиеВыбрано				= КэшПользовательскихДействий.КэшЗапросов.Получить(ПользовательскоеДействие_КлючОснования(ОснованиеЗапроса));
	ФормаВыбораДействия			= "ФормаВыбораДействия";
		
	БлокировкаОбъектов = ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "БлокировкаОбъектов");
	КомандаФормыВбораДействия = БлокировкаОбъектов.Получить(ФормаВыбораДействия);
	
	Если ЭтоТипСбис(ДействиеВыбрано, "ПользовательскоеДействие") Тогда
		
		КэшПользовательскихДействий.РезультатЗапроса = ДействиеВыбрано;
		ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");
		Возврат;
		
	ИначеЕсли ЭтоТипСбис(КомандаФормыВбораДействия, "ЦепочкаКомандОбработки") Тогда
		
		КомандаВыполнить = "РезультатОтправки_Асинх_ПользовательскиеДействия";
		
		ПараметрыКоманды = Новый Структура("ПорядокВызова", 0);
		ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, КомандаВыполнить, РезультатОтправки, ПараметрыКоманды);
		
		Возврат;
		
	КонецЕсли;
	
	БлокировкаОбъектов.Вставить("ФормаВыбораДействия", ЦепочкаКомандОбработки);
	
	Пакет = ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "СоставПакета");
	НесколькоПакетов = РезультатОтправки.ДанныеКОтправке.СписокПакетов.Количество() > 1;
	Заголовок = СоставПакета_Получить(Пакет, "Название");
	
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ОжидаетПользовательскогоДействия");

	ПараметрыПослеВызова = Новый Структура("РезультатОтправки, ЦепочкаКомандОбработки, ОснованиеЗапроса",
										РезультатОтправки,
										ЦепочкаКомандОбработки,
										ОснованиеЗапроса);
	ОбработчикПродолжить	= НовыйСбисОписаниеОповещения(	"РезультатОтправки_Асинх_ПользовательскиеДействияВыбрано",
															МодульОбъектаКлиент(),
															ПараметрыПослеВызова);

	ПараметрыДействия = Новый Структура();														
	ПользовательскиеДействия = СбисИсключение_ПользовательскиеДействия(ОснованиеЗапроса, ПараметрыДействия);
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ОснованиеЗапроса", ОснованиеЗапроса);
	ПараметрыОткрытияФормы.Вставить("Действия", ПользовательскиеДействия);
	ПараметрыОткрытияФормы.Вставить("ТипДействия", "ДействиеИсключения");
	ПараметрыОткрытияФормы.Вставить("Заголовок", Заголовок);
	ПараметрыОткрытияФормы.Вставить("НесколькоПакетов", НесколькоПакетов);
	
	ФормаДействия = ПолучитьФормуОбработки(ФормаВыбораДействия, Новый Структура("Владелец", РезультатОтправки.ПараметрыОтправки.Владелец));
	ФормаДействия.ОписаниеОповещенияОЗакрытии = ОбработчикПродолжить;
	ФормаДействия.ПоказатьПоверх(ПараметрыОткрытияФормы);

КонецПроцедуры

&НаКлиенте
Процедура РезультатОтправки_Асинх_ПользовательскиеДействияВыбрано(ПользовательскоеДействие, ПараметрыВызова) Экспорт

	РезультатОтправки			= ПараметрыВызова.РезультатОтправки;
	ПользовательскиеДействия	= ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "КэшПользовательскихДействий");
	ПользовательскиеДействия.РезультатЗапроса = ПользовательскоеДействие;
	
	БлокировкаОбъектов = ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "БлокировкаОбъектов");
	БлокировкаОбъектов.Удалить("ФормаВыбораДействия");
	
	ЦепочкаКомандОбработки = ПараметрыВызова.ЦепочкаКомандОбработки;
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");

КонецПроцедуры

&НаКлиенте
Процедура РезультатОтправки_Асинх_ПользовательскиеДействияЗавершить(РезультатОтправки, ПараметрыВызова) Экспорт
	
	ЦепочкаКомандОбработки		= ПараметрыВызова.ЦепочкаКомандОбработки;
	ПользовательскиеДействия	= ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "КэшПользовательскихДействий");
	ОснованиеЗапроса			= ПользовательскиеДействия.ТекущийЗапрос;
	ДействиеВыбрано				= ПользовательскиеДействия.РезультатЗапроса;
	
	ПрименитьДляВсехДокументов = ПользовательскиеДействия_ПолучитьПараметр(ДействиеВыбрано, "ПрименитьДляВсехДокументов");
	
	Если ПрименитьДляВсехДокументов = Истина Тогда
		ПользовательскиеДействия.КэшЗапросов.Вставить(ПользовательскоеДействие_КлючОснования(ОснованиеЗапроса), ДействиеВыбрано);
	КонецЕсли;
	
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "Завершено");

КонецПроцедуры

