
&НаКлиенте
Перем НажатиеВыполнено Экспорт;//На случай множественного нажатия для прерывания

&НаКлиенте
Перем ОбработкаПрерывания Экспорт;

#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

&НаКлиенте
Процедура ПрерватьОбработку(Команда)

	Если НажатиеВыполнено Тогда
		
		Возврат;
		
	КонецЕсли;
	НажатиеВыполнено = Истина;

	ПараметрыФормы.Вставить("СкрытьФормуБезЗавершения", Ложь);
	ПараметрыФормы.Результат = МодульОбъектаКлиент().НовыйСбисИсключение(790, "ФормаИндикатор.ПрерватьОбработку");
	
	ВыполнитьПрерываниеОперации(ПараметрыФормы.Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСостояниеДлительнойОперации(ТекстСостояния, СбисИндикатор = Неопределено, СбисПояснение = "", ДопПараметры = Неопределено) Экспорт
	
	СбисПрерывать			= Ложь;
	БлокироватьИнтерфейс	= Ложь;
	ПоказатьИндикатор		= Не НажатиеВыполнено;
	
	Заголовок = ТекстСостояния;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Пояснение").Заголовок = СбисПояснение;
	Если Не ДопПараметры = Неопределено Тогда
		
		Если ДопПараметры.Свойство("Прерывать") Тогда
			
			СбисПрерывать = ДопПараметры.Прерывать;
			
		КонецЕсли;
		
		Если ДопПараметры.Свойство("БлокироватьИнтерфейс") Тогда
			
			БлокироватьИнтерфейс = ДопПараметры.БлокироватьИнтерфейс;
			
		КонецЕсли;
		
		Если ДопПараметры.Свойство("ПоказатьПринудительно") Тогда
			
			ПоказатьИндикатор = ПоказатьИндикатор Или ДопПараметры.ПоказатьПринудительно;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ПоказатьИндикатор Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если СбисИндикатор = Неопределено Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Индикатор").Видимость = Ложь;
	Иначе
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Индикатор").Видимость = Истина;
		ИндикаторМакс	= Макс(СбисИндикатор, 0);
		Индикатор		= Мин(Окр(ИндикаторМакс), 100);
	КонецЕсли;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПрерватьОбработку").Видимость	= СбисПрерывать;
	МодульОбъектаКлиент().СбисУстановитьБлокировкуФормы(ВладелецФормы, Новый Структура("Блокировка", БлокироватьИнтерфейс));
	
	Если Открыта() Тогда
		#Если Не ТолстыйКлиентОбычноеПриложение Тогда
			ОбновитьОтображениеДанных();
		#КонецЕсли
	Иначе
		Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпрятатьСтатусДлительнойОперации(СбисЗавершить = Ложь) Экспорт
    Перем ОписаниеОповещенияПереложить;
	
	Если Не Открыта() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОповещенияПереложить = ОписаниеОповещенияОЗакрытии;
	
	Если Не СбисЗавершить Тогда
		
		ОписаниеОповещенияОЗакрытии = Неопределено;
		
	КонецЕсли;	

	ПараметрыФормы.СкрытьФормуБезЗавершения = СбисЗавершить;
	Закрыть();
	
	// Восстановить описание оповещения
	ОписаниеОповещенияОЗакрытии = ОписаниеОповещенияПереложить;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы=Ложь)
	
	Если ПараметрыФормы.СкрытьФормуБезЗавершения Тогда
		
		Возврат;
		
	КонецЕсли;
	ОбработчикЗавершения	= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПослеЗакрытия", ЭтаФорма);
	НовыйОтложенноеДействие	= МодульОбъектаКлиент().НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения", ОбработчикЗавершения));
	Попытка
		МодульОбъектаКлиент().ПодключитьОтложенноеДействие(НовыйОтложенноеДействие);
	Исключение
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), Новый Структура("СтатусСообщения, ИмяКоманды", "warning", "ФормаИндикатора.ПриЗакрытии"));
	КонецПопытки;
	
КонецПроцедуры

// Процедура - после закрытия почистить форму
//
// Параметры:
//  Аргумент	 - 	 - 
//  ДопПараметры - 	 - 
//
&НаКлиенте
Процедура ПослеЗакрытия(Аргумент=Неопределено, ДопПараметры=Неопределено) Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		//Вызвать описание оповещения о закрытии вручную.
		Если Не ОписаниеОповещенияОЗакрытии = Неопределено Тогда
			МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(ПараметрыФормы.Результат, ОписаниеОповещенияОЗакрытии);
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПрерываниеОперации(РезультатПрерывания) Экспорт
	
	ОписаниеОповещенияОЗакрытии = ОбработкаПрерывания;
	Закрыть(РезультатПрерывания);
		
КонецПроцедуры

НажатиеВыполнено	= Ложь;
ПараметрыФормы		= Новый Структура("СкрытьФормуБезЗавершения, РежимЗапуска, Результат", Ложь);
