
//получаем массив файлов из каталога
&НаКлиенте
Функция		ОписаниеИниФайлов(КоннекшенSABY, ДопПараметры = Неопределено) Экспорт
	Перем ПрефиксНастроек;
	
	МассивУстановленныхИниФайлов = Новый Массив;
	
	АктивныеИни				= МодульОбъектаКлиент().КоннекшенSABY_Получить(КоннекшенSaby, "Ини");
	ПрефиксИни				= МодульОбъектаКлиент().КоннекшенSABY_Получить(КоннекшенSABY, "ПрефиксНастроек");
	ПараметрыДляОписания	= МодульОбъектаКлиент().КоннекшенSABY_Выгрузить(КоннекшенSaby, "ПараметрыДляЧтенияИни");
	
	ОписаниеИниФайлов = Новый Структура("Установлены, ПолноеОписание");
	ОписаниеИниФайлов.Вставить("Кастомные",		Новый Массив);
	ОписаниеИниФайлов.Вставить("Типовые",		Новый Массив);
	МассивУстановленныхИниФайлов	= Новый Массив();

	КлючиСтрок	= "Имяфайла,ИмяфайлаБезРасширения,ПутьДоИниФайла,ЕстьИзменения,Автообновление,Стандартная,Пользовательская,ДатаФайла,ДатаФайлаКлиент,Ини_ИмяИни,Ини_ИмяБезРасширения";
	СписокСтрок	= Новый	СписокЗначений();
	
	Для Каждого КлючИЗначениеИни Из АктивныеИни	Цикл
		ИмяИни		= КлючИЗначениеИни.Ключ;
		ЗначениеИни	= КлючИЗначениеИни.Значение;
		Если		ИмяИни	= "Конфигурация"	Тогда
			
			// Конфигурация вверху.
			ПолеСортировки = "а";
			
		ИначеЕсли Лев(ИмяИни, 8) = "Загрузка" Тогда
			
			// Загрузка внизу
			ПолеСортировки = "я";
			
		Иначе
			
			ПолеСортировки = "б";
			
		КонецЕсли;
		СбисЕстьТиповая		= Ложь;
		СбисЕстьИзменения	= Ложь;
		СбисАвтообновление	= ПараметрыДляОписания.Автообновление;
		Если ЗначениеЗаполнено(ЗначениеИни) Тогда				
			ЗначениеИни.Вставить("СбисОшибки",			Новый Массив());
			ЗначениеИни.Вставить("СбисПолноеИмяФайла",	СтрЗаменить(ИмяИни,"""",""));
			ЗначениеИни.Вставить("СбисИмяФайла",		СтрЗаменить(ИмяИни,"""",""));
			
			Если ЗначениеИни.Свойство("СбисЕстьТиповая")	Тогда
				СбисЕстьТиповая = ЗначениеИни.СбисЕстьТиповая;
			КонецЕсли;
			Если ЗначениеИни.Свойство("СбисЕстьИзменения")	Тогда
				СбисЕстьИзменения = ЗначениеИни.СбисЕстьИзменения;
			КонецЕсли;
			Если ЗначениеИни.Свойство("СбисАвтообновление")	Тогда
				СбисАвтообновление = ЗначениеИни.СбисАвтообновление; 
			КонецЕсли;
		КонецЕсли;
		НоваяСтрока = Новый	Структура(КлючиСтрок);
		НоваяСтрока.ПутьДоИниФайла			= "";
		НоваяСтрока.ЕстьИзменения			= СбисЕстьИзменения;
		НоваяСтрока.Автообновление			= СбисАвтообновление;
		НоваяСтрока.Стандартная				= СбисЕстьТиповая;
		НоваяСтрока.Имяфайла				= СтрЗаменить(ИмяИни + ?(СбисЕстьТиповая, ".sbis3", ""),"""","");
		НоваяСтрока.ИмяфайлаБезРасширения	= СтрЗаменить(ИмяИни, """", "");
		НоваяСтрока.ДатаФайла				= ?(СбисЕстьТиповая,	ПараметрыДляОписания.ДатаИзмененияНастроек, Неопределено);
		НоваяСтрока.ДатаФайлаКлиент			= ?(СбисЕстьИзменения,	ПараметрыДляОписания.ДатаИзмененияНастроек, Неопределено);
		НоваяСтрока.Ини_ИмяИни				= СтрЗаменить(ИмяИни,"""","");
		НоваяСтрока.Ини_ИмяБезРасширения	= Сред(НоваяСтрока.ИмяФайла,1,Найти(НоваяСтрока.ИмяФайла,".")-1);
		
		Если НЕ СбисЕстьТиповая ИЛИ СбисЕстьИзменения Тогда
			
			НоваяСтрока.Пользовательская = 1 + (Не ПараметрыДляОписания.ВключеныДоработки);
			
		Иначе
			
			НоваяСтрока.Пользовательская = 0;
			
		КонецЕсли;
		
		СписокСтрок.Добавить(НоваяСтрока,  ПолеСортировки + НоваяСтрока.ИмяФайла);
	КонецЦикла;
	
	СписокСтрок.СортироватьПоПредставлению();
	
	СписокИниФайлов = СписокСтрок.ВыгрузитьЗначения();

	Результат = Новый Структура("МассивУстановленныхИниФайлов, ПрефиксНастроек", СписокИниФайлов, ПрефиксИни);
	
	Возврат Результат;
	
КонецФункции

//DynamicDirective

Функция ПроверитьИдентификаторНастроек(ИдНастроекПроверить) Экспорт 
	
	Если МодульОбъектаКлиентСервер().SabyЭтоУникальныйИдентификатор(ИдНастроекПроверить) Тогда
		
		Возврат Строка(ИдНастроекПроверить);
		
	Иначе 
		
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

