
&НаКлиенте
Функция СБИС_Аутентифицировать(Кэш, СтруктураПараметровЗапроса, ДопПараметрыВходящие, Отказ) Экспорт
	 
	 Если Не ЗначениеЗаполнено(СтруктураПараметровЗапроса.Логин) Тогда 
		
		ОшибкаАвторизации = МодульОбъектаКлиент().НовыйСбисИсключение(,
													МодульОбъектаКлиент().ПараметрSABY("ИнтеграцияИмя") + ".СБИС.Аутентифицировать",
													785,
													"Не указаны логин/пароль для авторизации");
		Отказ = Истина;
		Возврат ОшибкаАвторизации;
		
	КонецЕсли;
	
	ДопПараметры = Новый Структура("СообщатьПриОшибке, ВернутьОшибку, БезАвторизации", Ложь, Истина, Истина);
	ДопПараметры.Вставить("ОчиститьПараметры", Истина);
	
	ПараметрыЗапроса = Новый Структура("Login, Password", СтруктураПараметровЗапроса.Логин, СтруктураПараметровЗапроса.Пароль);
	Возврат СбисОтправитьИОбработатьКоманду(Кэш, "AuthByPassword", ПараметрыЗапроса, ДопПараметры, Отказ);

КонецФункции

