
&НаКлиенте
Процедура НовыйMappingObject_ПоДаннымОбъекта(MappingObject, ДопПараметры)
	Перем Назначение;
	
	Если НЕ ДопПараметры.Свойство("Назначение", Назначение) Тогда
		ВызватьСбисИсключение(,
							"МодульОбъектаКлиент.НовыйMappingObject_ПоДаннымОбъекта",
							,
							"Не передан обязательный параметр в ДопПараметры Назначение");
	КонецЕсли;
	
	Если Назначение = "Контрагенты" Тогда
		ПоляМаппинга = _MappingObject_ПоляМаппингаКонтрагент();
	ИначеЕсли Назначение = "Документы" Тогда
		ПоляМаппинга = _MappingObject_ПоляМаппингаДокумент();
	Иначе
		ВызватьСбисИсключение(,
							"МодульОбъектаКлиент.MappingObject_Структура",
							,
							"Неизвестное Назначение маппинга");
	КонецЕсли;
	
	ДанныеОбъекта = ДопПараметры.ДанныеОбъекта;

	Для Каждого НаборПолей Из ПоляМаппинга Цикл

		Если Не ДанныеОбъекта.Свойство(НаборПолей.Ключ) Тогда
			Продолжить;
		КонецЕсли;

		Для каждого Сопоставление Из НаборПолей.Значение Цикл
			КлючСоставной		= СтрЗаменить(Сопоставление.Ключ, ".", Символы.ПС);
			ЗначениеВставить	= ДанныеОбъекта[НаборПолей.Ключ];
			ДобавитьПараметр	= Истина;
			Для СтрНомерСТроки = 1 По СтрЧислоСтрок(КлючСоставной) Цикл
				
				Если Не ЗначениеВставить.Свойство(СтрПолучитьСтроку(КлючСоставной, СтрНомерСТроки), ЗначениеВставить) Тогда
					
					ДобавитьПараметр = Ложь;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			Если ДобавитьПараметр Тогда
				MappingObject[Сопоставление.Значение] = ЗначениеВставить;
            КонецЕсли;

		КонецЦикла;

	КонецЦикла;
	
	Если ДанныеОбъекта.Свойство("Статус") Тогда
		
		MappingObject["Status"] = ДанныеОбъекта.Статус.Ид;
		MappingObject["StatusMsg"] = ДанныеОбъекта.Статус.Сообщение;
		
	Иначе
		
		MappingObject["Status"] = 1;
		MappingObject["StatusMsg"] = "Сопоставлено";

	КонецЕсли;
	
	MappingObject["Default"] = Истина;
	
КонецПроцедуры

&НаКлиенте
Функция _MappingObject_Структура(ДопПараметры)
	Перем MappingObject, Назначение;
	
	ДопПараметры.Свойство("MappingObject", MappingObject);
	
	Если НЕ ДопПараметры.Свойство("Назначение", Назначение) Тогда
		ВызватьСбисИсключение(,
							"МодульОбъектаКлиент.MappingObject_Структура",
							,
							"Не передан обязательный параметр в ДопПараметры Назначение");
	КонецЕсли;

	ПоляОбъекта = "Integration,
		        |ClientType,
		        |ClientId,
		        |ClientTitle,
		        |SbisType,
		        |SbisTitle,
		        |Status,
		        |StatusMsg,
		        |Default,
		        |ClientKey1_1,
		        |ClientKey1_2,
		        |ClientKey1_3";
	
	Если Назначение = "Документы" Тогда
	
		ПоляОбъекта = ПоляОбъекта + ",
		        					|ClientKey1_4,
							        |SbisKey1_1,
							        |SbisKey1_2,
									|Документ,
									|Контрагент,
									|Организация";								
									
	ИначеЕсли Назначение = "Контрагенты" Тогда
	
		ПоляОбъекта = ПоляОбъекта + ",
							        |SbisKey1_1,
							        |SbisKey1_2,
							        |SbisKey1_3,
									|Контрагент";

	Иначе
		ВызватьСбисИсключение(,
							"МодульОбъектаКлиент.MappingObject_Структура",
							,
							"Неизвестное Назначение маппинга");
	КонецЕсли;
				
	Результат = Новый Структура(ПоляОбъекта);
	
	Если НЕ MappingObject = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Результат, MappingObject);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция _MappingObject_ПоляМаппингаКонтрагент()
	
	ПоляИС = Новый Соответствие;
	ПоляИС.Вставить("ИдИС",			"ClientId");
	ПоляИС.Вставить("ИмяИС",		"ClientType");
	ПоляИС.Вставить("Название",		"ClientTitle");
	ПоляИС.Вставить("ИНН",			"ClientKey1_1");
	ПоляИС.Вставить("КПП",			"ClientKey1_2");
	ПоляИС.Вставить("КодФилиала",	"ClientKey1_3");
		
	ПоляСБИС = Новый Соответствие;
	ПоляСБИС.Вставить("ИдСБИС",		"SbisId");
	ПоляСБИС.Вставить("Название",	"SbisTitle");
	ПоляСБИС.Вставить("Данные",		"Контрагент");
	
	ПоляМаппинга = Новый Соответствие;
	ПоляМаппинга.Вставить("ИС",		ПоляИС);
	ПоляМаппинга.Вставить("СБИС",	ПоляСБИС);
	
	Возврат ПоляМаппинга;
	
КонецФункции

&НаКлиенте
Функция _MappingObject_ПоляМаппингаДокумент()
	
	ПоляИС = Новый Соответствие;
	ПоляИС.Вставить("ИдИС",			"ClientId");
	ПоляИС.Вставить("ИмяИС",		"ClientType");
	ПоляИС.Вставить("Название",		"ClientTitle");
	ПоляИС.Вставить("Номер",		"ClientKey1_1");
	ПоляИС.Вставить("Дата",			"ClientKey1_2");
	ПоляИС.Вставить("Организация",	"ClientKey1_3");
	ПоляИС.Вставить("Контрагент",	"ClientKey1_4");
		
	ПоляСБИС = Новый Соответствие;
	ПоляСБИС.Вставить("ИмяСБИС",			"SbisType");
	ПоляСБИС.Вставить("Название",			"SbisTitle");
	ПоляСБИС.Вставить("Номер",				"SbisKey1_1");
	ПоляСБИС.Вставить("Дата",				"SbisKey1_2");
	ПоляСБИС.Вставить("Контрагент",			"Контрагент");
	ПоляСБИС.Вставить("НашаОрганизация",	"Организация");
	ПоляСБИС.Вставить("Идентификатор",		"Документ");
	
	ПоляМаппинга = Новый Соответствие;
	ПоляМаппинга.Вставить("ИС",		ПоляИС);
	ПоляМаппинга.Вставить("СБИС",	ПоляСБИС);
	
	Возврат ПоляМаппинга;
	
КонецФункции

