
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

// Заполняет реестр раздела Контрагенты
//
// Параметры:
//  ЛокальныйКэш	- Структура - Кэш обработки
//
// Возвращаемое значение:
//   Проихвольное   - Результат заполнения
//
&НаКлиенте
Функция ОбновитьКонтент(ЛокальныйКэш) Экспорт

	Перем ОткрытыеКаталоги;

	ГлавноеОкно = ЛокальныйКэш.ГлавноеОкно;
	МодульОбъектаКлиент = МодульОбъектаКлиент();
	
	filter = Новый Структура("ФильтрРодитель, ЗаписейНаСтранице");
	ЗаполнитьЗначенияСвойств(filter, ГлавноеОкно);
	filter.Вставить("ФильтрСтраница", ГлавноеОкно.ФильтрСтраница - 1);
	ПараметрыРеестра = Новый Структура("Тип, ФильтрГлавноеОкно", "Контрагент", filter);
	
	ДанныеЗаполнения = МодульОбъектаКлиент.ПолучитьСписокМаппинга(ПараметрыРеестра);
	
	ГлавноеОкно.Таблица_РеестрМаппинга.Очистить();
	
	ЛокальныйКэш.Текущий.ПараметрыРаздела.Свойство("ОткрытыеКаталоги", ОткрытыеКаталоги);
	Если	Не ОткрытыеКаталоги = Неопределено
		И	Не МодульОбъектаКлиент.СбисСтек_Пустой(ОткрытыеКаталоги) Тогда
		
		ПредыдущийКаталог = МодульОбъектаКлиент.СбисСтек_ВзятьБезУдаления(ОткрытыеКаталоги);
		НовЗапись = ГлавноеОкно.Таблица_РеестрМаппинга.Добавить();
		НовЗапись.ClientName = "<назад>";
		НовЗапись.ClientParentUid_ = Истина;
		НовЗапись.ClientParentUid = ПредыдущийКаталог;

	КонецЕсли;
	
	Для Каждого ЗаписьСписка Из ДанныеЗаполнения.Данные Цикл
		
		НовЗапись = ГлавноеОкно.Таблица_РеестрМаппинга.Добавить();
		ЗаполнитьЗначенияСвойств(НовЗапись, ЗаписьСписка);
		НовЗапись.Маппинг = Новый СписокЗначений;
		НовЗапись.Маппинг.Добавить(ЗаписьСписка);
		
	КонецЦикла;         
	
	ГлавноеОкно.ФильтрЕстьЕще = ДанныеЗаполнения.Навигация.ЕстьЕще;
	ЛокальныйКэш.ОбщиеФункции.ОбновитьПанельНавигации(ЛокальныйКэш);
	
	НаСменуРаздела(ЛокальныйКэш); 
	ЛокальныйКэш.ТаблДок = МодульОбъектаКлиент.ПолучитьЭлементФормыОбработки(ГлавноеОкно, "Таблица_РеестрМаппинга");
	
	Возврат Истина;
КонецФункции // ОбновитьКонтекст()

// Функция делает подготовку к переходу
//
// Параметры:
//  СтруктураРаздела  - Структура - Структура раздела
//  Кэш  - Структура - Объект класса Кэш
//
// Возвращаемое значение:
//  Неопределено - Заглушка	
&НаКлиенте
Функция ОбновитьКонтент_ПередВызовом(СтруктураРаздела, Кэш) Экспорт
	Возврат Неопределено;
КонецФункции

// <Описание процедуры>
//
// Параметры:
//  ЛокальныйКэш	 - Структура - Кэш обработки
//
&НаКлиенте
Процедура НаСменуРаздела(ЛокальныйКэш) Экспорт
	
	ГлавноеОкно = ЛокальныйКэш.ГлавноеОкно;
	ПанельМассовыхОпераций = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "ПанельМассовыхОпераций");
	ПанельМассовыхОпераций.ТекущаяСтраница = ГлавноеОкно.сбисПолучитьСтраницу(ПанельМассовыхОпераций,"Справочники_Контрагенты");
	Контент = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "Контент");
	Контент.ТекущаяСтраница = ГлавноеОкно.сбисПолучитьСтраницу(Контент,"РеестрМаппинга");
	
	Если Не ЛокальныйКэш.Текущий.ПараметрыРаздела.Свойство("ОткрытыеКаталоги") Тогда
		ЛокальныйКэш.Текущий.ПараметрыРаздела.Вставить("ОткрытыеКаталоги", МодульОбъектаКлиент().СбисСтек_Новый());
	КонецЕсли;
	
	// Глушим кнопки, которым нет обработчика
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "Выгрузить").Видимость = Ложь;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "Сопоставить").Видимость = Ложь;	 
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "УбратьСопоставление").Видимость = Ложь;   
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "Отключить").Видимость = Ложь;

	НавигацияУстановитьПанель(ЛокальныйКэш);
КонецПроцедуры // НаСменуРаздела()

&НаКлиенте
Процедура НавигацияУстановитьПанель(Кэш) Экспорт
	ГлавноеОкно = Кэш.ГлавноеОкно;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно,"ПанельНавигации").Видимость=Истина;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно,"ЗаписейНаСтранице1С").Видимость=Ложь;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно,"ЗаписейНаСтранице").Видимость=Истина;
КонецПроцедуры	

&НаКлиенте
Функция ОбновитьКонтентПодговитьРаздел(ПараметрыОбновления, ДопПараметры) Экспорт
	
	Кэш = ДопПараметры.Кэш;

	НаСменуРаздела(Кэш);
	НавигацияУстановитьПанель(Кэш);
	Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно,"ПанельФильтра").Видимость = Ложь;
	Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно,"ПоказатьПанельФильтра").Видимость = Ложь;

	Возврат Истина;

КонецФункции
