&НаКлиенте
Перем Кэш;

#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

//функция обновляет контент для подразделов раздела Продажа	
&НаКлиенте
Функция ОбновитьКонтент(ЛокальныйКэш, ДопПараметры = Неопределено) Экспорт
	Кэш = ЛокальныйКэш;
	ИмяРеестра = "";
	ИмяРаздела = "Справочники";	
	Ини = "";
	Если	Не Кэш.Разделы[ИмяРаздела].Свойство(Кэш.Текущий.Имя, ИмяРеестра)
		Или	Не Кэш.Ини.Свойство(ИмяРеестра, Ини) Тогда
		Возврат Ложь;
	ИначеЕсли Ини = Неопределено Тогда
		Ини = Кэш.ФормаНастроек.Ини(Кэш, ИмяРеестра);
	КонецЕсли;
	Кэш.Текущий.ТипДок = ИмяРеестра;
	ГлавноеОкно				= Кэш.ГлавноеОкно;
	Контент					= ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "Контент");
	Кэш.ТаблДок				= ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "Таблица_РеестрСправочников");
	Контент.ТекущаяСтраница	= ГлавноеОкно.сбисПолучитьСтраницу(Контент, "РеестрСправочников");	
	фрмРаздел_Справочники_Шаблон = МодульОбъектаКлиент().ПолучитьФормуОбработки("Раздел_Справочники_Шаблон");	

	СтраницыПанели = Кэш.ОбщиеФункции.СбисПолучитьЭлементФормы(Кэш,, ИмяРаздела + "_Подразделы");
	СтраницаОперацийРеестра = Кэш.ОбщиеФункции.СбисПолучитьЭлементФормы(Кэш, СтраницыПанели, ИмяРеестра);
	
	РеестрСправочниковСтраницы = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "РеестрСправочниковСтраницы");
	СтраницаПрайсЛист = ГлавноеОкно.сбисПолучитьСтраницу(РеестрСправочниковСтраницы, "СтраницаПрайсЛист");
	Если Не РеестрСправочниковСтраницы.ТекущаяСтраница = СтраницаПрайсЛист Тогда
		РеестрСправочниковСтраницы.ТекущаяСтраница = СтраницаПрайсЛист;
	КонецЕсли;
	
	Если МодульОбъектаКлиент().ИспользоватьНовоеСопоставлениеНоменклатуры() Тогда
		фрмРаздел_Справочники_Шаблон.УстановитьОтображениеСтраниц(РеестрСправочниковСтраницы, Истина);
	Иначе
		фрмРаздел_Справочники_Шаблон.УстановитьОтображениеСтраниц(РеестрСправочниковСтраницы, Ложь);
	КонецЕсли;
	
	Если Не СтраницаОперацийРеестра = Неопределено Тогда
		
		СтраницыПанели.ТекущаяСтраница = СтраницаОперацийРеестра;
		
	Иначе
		
		// Страница панели по умолчанию
		СтраницыПанели.ТекущаяСтраница = Кэш.ОбщиеФункции.СбисПолучитьЭлементФормы(Кэш, СтраницыПанели, "Неопределено");
		
	КонецЕсли;
	
	НаСменуРаздела(Кэш); //Вызываем руками, чтобы изменилась панель операций.

	Ини = Кэш.ФормаНастроек.Ини(Кэш, ИмяРеестра);
	ТекстЗапроса = Кэш.ОбщиеФункции.РассчитатьЗначение("ЗапросСпискаЭлементов", Ини);
	ПараметрыФильтра = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПараметрыФильтра");
	Результат = Новый Структура;
	Результат.Вставить("Таблица_РеестрСправочников", Кэш.ОбщиеФункции.ЗаполнитьМассивЭлементовСправочника(ТекстЗапроса, ПараметрыФильтра));
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НастроитьКолонки(Кэш) Экспорт  
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("ЕдиницаИзмерения");
	МассивРеквизитов.Добавить("Характеристика");
	ПараметрыСтруктурыПолей = Новый Структура("КолонкиУдалить", МассивРеквизитов);
	ПараметрыГлавногоОкна = Новый Структура("ИмяТаблицы, СтруктураПолей", "Таблица_РеестрСправочников", ПараметрыСтруктурыПолей);
	Кэш.ГлавноеОкно.НастроитьКолонкиФормы(ПараметрыГлавногоОкна);

КонецПроцедуры
                                   
// Процедура устанавливает панель навигации на 1ую страницу и скрывает панель	
&НаКлиенте
Процедура НавигацияУстановитьПанель(ЛокальныйКэш = Неопределено) Экспорт
	
	ГлавноеОкно = ЛокальныйКэш.ГлавноеОкно;
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "ПанельНавигации").Видимость			= Ложь;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "ЗаписейНаСтранице1С").Видимость		= Ложь;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "ЗаписейНаСтранице").Видимость			= Ложь;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "КоманднаяПанельНавигация").Видимость	= Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НаСменуРаздела(ЛокальныйКэш) Экспорт
	Кэш = ЛокальныйКэш;
	ГлавноеОкно = Кэш.ГлавноеОкно;
	ПанельМассовыхОпераций = Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно, "ПанельМассовыхОпераций");
	Попытка
		ПанельМассовыхОпераций.ТекущаяСтраница = Кэш.ГлавноеОкно.сбисПолучитьСтраницу(ПанельМассовыхОпераций, "Справочники" + Кэш.Текущий.ТипДок);
		Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно, "ПанельТулбар").Видимость = Истина;
	Исключение
		ПанельМассовыхОпераций.ТекущаяСтраница = Кэш.ГлавноеОкно.сбисПолучитьСтраницу(ПанельМассовыхОпераций, "Справочники");
		Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно, "ПанельТулбар").Видимость = Истина;
	КонецПопытки;	
	 
	Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно,"ОтметитьВсе7").Видимость = Истина;
	// +++ 1187075631 TODO После завершения проекта по сопоставлению номенклатуры раскомментить 
	// Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно,"ОтметитьВсе13").Видимость = Истина; 	
	
	ТекущийИмя	= Кэш.Текущий.Имя;
	РодительИмя	= "Справочники";
	КнопкиПрайс = Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно, "СправочникиОтправить"); 
	Если Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		КнопкиПрайс = КнопкиПрайс.ПодчиненныеЭлементы;
	Иначе
		КнопкиПрайс = КнопкиПрайс.Кнопки;
	КонецЕсли;
	ИспользоватьСогласованиеЦен = ЗначениеЗаполнено(МодульОбъектаКлиент().ИниПоПараметрам("СогласованиеЦен"));
	СоздаватьЧерновик = МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "СоздаватьЧерновик"));
	ИспользоватьГенератор = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИспользоватьГенератор");
	ПараметрыОчисткиКнопок = Новый Структура("Имя, УправляемоеПриложение", "СправочникиОтправить", Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение);
	Кэш.ГлавноеОкно.сбисОчиститьПанельКнопок(ПараметрыОчисткиКнопок, Ложь);
	
	сбисРазделМеню = Кэш.МенюРазделов;
	// Заполним команды из инишек и стандартные
	Если	сбисРазделМеню.Свойство(РодительИмя,	сбисРазделМеню)
		И	сбисРазделМеню.Свойство(ТекущийИмя,		сбисРазделМеню) Тогда

		КлючиПараметров = "ИмяИни, ИмяКнопки, МетодАктивации, ЗаголовокКнопки";
		ДобавитьКнопки = Новый Массив;

		ОтправитьПрайс = Новый Структура(КлючиПараметров);
		ОтправитьПрайс.ИмяИни			= "Номенклатура";
		ОтправитьПрайс.ИмяКнопки		= "ОтправитьПрайс";
		ОтправитьПрайс.МетодАктивации	= "ОтправитьПрайс";
		ОтправитьПрайс.ЗаголовокКнопки	= "Отправить прайс";
		ДобавитьКнопки.Добавить(ОтправитьПрайс);

		Если ИспользоватьСогласованиеЦен
			И ИспользоватьГенератор
			И СоздаватьЧерновик Тогда
			ПоказатьСогласованиеЦен = Новый Структура(КлючиПараметров);
			ПоказатьСогласованиеЦен.ИмяИни			= "СогласованиеЦен";
			ПоказатьСогласованиеЦен.ИмяКнопки		= "ПоказатьСогласованиеЦен";
			ПоказатьСогласованиеЦен.МетодАктивации	= "ПоказатьСогласованиеЦен";
			ПоказатьСогласованиеЦен.ЗаголовокКнопки	= "Открыть Согласование цен";
			ДобавитьКнопки.Добавить(ПоказатьСогласованиеЦен);
		КонецЕсли;

		ОтправитьКаталог = Новый Структура(КлючиПараметров);
		ОтправитьКаталог.ИмяИни				= "Номенклатура";
		ОтправитьКаталог.ИмяКнопки			= "ОтправитьКаталог";
		ОтправитьКаталог.МетодАктивации		= "ОтправитьКаталог";
		ОтправитьКаталог.ЗаголовокКнопки	= "Загрузить каталог на saby.ru";
		ДобавитьКнопки.Добавить(ОтправитьКаталог);
		
		// Проверим, не переназначены ли стандартные команды через ини
		Для Каждого Пункт Из сбисРазделМеню Цикл
			Для сч = 0 По ДобавитьКнопки.Количество() - 1 Цикл
				Если ДобавитьКнопки[сч]["ИмяКнопки"] = Пункт["ИмяКнопки"] Тогда
					ДобавитьКнопки.Удалить(сч);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;

		Для Каждого КнопкаДобавить Из ДобавитьКнопки Цикл
			сбисРазделМеню.Добавить(КнопкаДобавить);
		КонецЦикла;

	Иначе
		Возврат;
	КонецЕсли;
	
	// Добавим кнопки в Отправить
	Для Каждого Пункт Из сбисРазделМеню Цикл
		
		Если Не ЗначениеЗаполнено(Пункт.МетодАктивации) Тогда
			Продолжить;
		КонецЕсли;
		
		Отказ			= Ложь;
		
		ПараметрыКнопки = Новый Структура;
		ПараметрыКнопки.Вставить("Имя",						Пункт.ИмяКнопки);
		ПараметрыКнопки.Вставить("Заголовок",				?(Пункт.Свойство("ЗаголовокКнопки"), Пункт.ЗаголовокКнопки, Пункт.ИмяКнопки));
		ПараметрыКнопки.Вставить("УправляемоеПриложение",	Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение);
		ПараметрыКнопки.Вставить("Панель",					"СправочникиОтправить");
		
		РезультатФормированияКнопки = Кэш.ГлавноеОкно.сбисДобавитьКнопку(ПараметрыКнопки, Отказ);
		
		Если Отказ Тогда
			Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, РезультатФормированияКнопки);
		КонецЕсли;
		
	КонецЦикла;		
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "ПанельФильтра").Видимость = ИспользоватьСогласованиеЦен;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "ПоказатьПанельФильтра").Видимость = ИспользоватьСогласованиеЦен;
	
КонецПроцедуры

// Функция - значения для фильтра раздела Номенклатура по-умолчанию
//
// Параметры:
//  РазделГО	 - РазделГО	 - экземпляр класса раздел
// 
// Возвращаемое значение:
//  Структура - Параметры фильтра для раздела
//
&НаКлиенте
Функция  ЗначенияДляФильтрПоУмолчанию(РазделГО, ДопПараметры = Неопределено) Экспорт
	
	Кэш			= МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	ГлавноеОкно	= Кэш.ГлавноеОкно;
		
	ТипыПолейФильтра		= МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолейФильтра");
	МодульСпискаСостояний	= МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("СписокСостоянийДокумента", РазделГО.ОписаниеРаздела.ФормыРаздела);
	СписокСостояний			= ?(МодульСпискаСостояний = Ложь, Новый СписокЗначений, МодульСпискаСостояний.СписокСостоянийДокумента());
	
	ПараметрыФильтра = Новый Структура;
		
	ПараметрыФильтра.Вставить("ФильтрМаска",			"");
	ПараметрыФильтра.Вставить("ФильтрНоменклатура",		ТипыПолейФильтра.ФильтрНоменклатура.ПривестиЗначение());
	ПараметрыФильтра.Вставить("ФильтрТипНоменклатуры",	ТипыПолейФильтра.ФильтрТипНоменклатуры.ПривестиЗначение());
	ПараметрыФильтра.Вставить("ФильтрСтраница",			1);
	ПараметрыФильтра.Вставить("ФильтрРазмерСтраницы",	50);
	
	Возврат ПараметрыФильтра;
	
КонецФункции

&НаКлиенте
Процедура ФильтрУстановитьВидимость(ФормаФильтра) Экспорт
	ГлавноеОкно = Кэш.ГлавноеОкно;
	
	ИменаЭлементовСкрыть = Новый Массив;
	ИменаЭлементовСкрыть.Добавить("ФильтрНоменклатураКонтрагента");
	ИменаЭлементовСкрыть.Добавить("ФильтрКонтрагентПодключен");
	ИменаЭлементовСкрыть.Добавить("ФильтрКонтрагентСФилиалами");
	ИменаЭлементовСкрыть.Добавить("ФильтрОтветственный");
	ИменаЭлементовСкрыть.Добавить("ФильтрТипыДокументов"); 
	ИменаЭлементовСкрыть.Добавить("ФильтрМаска");   
	ИменаЭлементовСкрыть.Добавить("ФильтрПоРасхождениям");
	
	ИменаЭлементовПоказать = Новый Массив;
	ИменаЭлементовПоказать.Добавить("НадписьНоменклатураКонтрагента");  
	ИменаЭлементовПоказать.Добавить("НадписьНоменклатура1С");   
	ИменаЭлементовПоказать.Добавить("НадписьКодКонтрагента");   
	ИменаЭлементовПоказать.Добавить("НадписьGTIN");   
	ИменаЭлементовПоказать.Добавить("ФильтрНоменклатура1С");   
	ИменаЭлементовПоказать.Добавить("ФильтрКодКонтрагента");    
	ИменаЭлементовПоказать.Добавить("ФильтрGTIN");
	
	Для каждого ИмяЭлемента Из ИменаЭлементовСкрыть Цикл
	
		ВыбранныйЭлемент = ГлавноеОкно.сбисЭлементФормы(ФормаФильтра, ИмяЭлемента);
		
		Если Не ВыбранныйЭлемент = Неопределено Тогда
			ВыбранныйЭлемент.Видимость = Ложь;
		КонецЕсли;
	
	КонецЦикла;
	
	Для каждого ИмяЭлемента Из ИменаЭлементовПоказать Цикл
	
		ВыбранныйЭлемент = ГлавноеОкно.сбисЭлементФормы(ФормаФильтра, ИмяЭлемента);
		
		Если Не ВыбранныйЭлемент = Неопределено Тогда
			ВыбранныйЭлемент.Видимость = Истина;
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДокумент(Кэш, ТекущаяСтрока) Экспорт
	Перем Вложения, МассивПакетов;
	
	ГлавноеОкно = Кэш.ГлавноеОкно;
	Если НЕ ТекущаяСтрока.Свойство("МассивПакетов", МассивПакетов) Тогда
		МассивПакетов = Кэш.ОбщиеФункции.ПодготовитьСтруктуруДокумента1С(ТекущаяСтрока, Кэш);
	КонецЕсли;
	Если МассивПакетов.Количество() = 1 Тогда
		ПолныйСоставПакета = МассивПакетов[0];
		Если ПолныйСоставПакета.Свойство("Ошибка") Тогда
			МодульОбъектаКлиент().СообщитьСбисИсключение(ПолныйСоставПакета.Ошибка);
			Возврат;
		ИначеЕсли Не ПолныйСоставПакета.Свойство("Вложение", Вложения) Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Вложения) Тогда
			Возврат;
		КонецЕсли;
		
		МодульОбъектаКлиент().СоставПакета_Очистить(ПолныйСоставПакета, "НеЗапускатьВДокументооборот");
		
		ТекущийРаздел = Кэш.Разделы["р" + Кэш.Текущий.Раздел];   
		
		ДопПараметры = Новый Структура;  
		ДопПараметры.Вставить("ТекущийРаздел", ТекущийРаздел); 
		ДопПараметры.Вставить("Вложения", Вложения); 
		
		//Попытка
		//	МодульОбъектаКлиент().ПодготовитьДокументСбисКПросмотру(ПолныйСоставПакета, ДопПараметры);
		//Исключение
		//	МодульОбъектаКлиент().ВызватьСбисИсключение(ИнформацияОбОшибке(), "Раздел_Справочники_Номенклатура.ПоказатьДокумент");
		//КонецПопытки;
		
		ФормыПросмотра = Новый Массив;
		ФормыПросмотра.Добавить("ФормаПросмотрДокумента");
		ФормаПросмотрДокумента = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ПоказатьДокумент", ФормыПросмотра);
		ФормаПросмотрДокумента.ПоказатьДокумент(Кэш, ПолныйСоставПакета);
		
	ИначеЕсли МассивПакетов.Количество() > 1 Тогда

		ФормаПросмотрДокументов = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ПоказатьДокументы", "ФормаПросмотрДокументов");
		ФормаПросмотрДокументов.ПоказатьДокументы(Кэш, МассивПакетов);

	КонецЕсли;

КонецПроцедуры

// Функция готовит структуру пакета электронных документов по комплекту документов 1С для просмотра и отправки контрагентам.
&НаКлиенте
Функция ПодготовитьСтруктуруДокумента(СтрокаСпискаДокументов, Кэш) Экспорт
	// Т.к. по одной строке документов 1С может быть сформировано несколько комплектов (оказание услуги), то структуры пакетов добавляются в массив.	
	Возврат Кэш.ОбщиеФункции.ПодготовитьСтруктуруДокумента1С(СтрокаСпискаДокументов, Кэш);	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементовВформеПросмотра(ФормаПросмотра, СоставПакета, КэшПарам) Экспорт
	
	ФормаПросмотра.ДокументРазобран = Истина;
	
	ПараметрыПакетаОбновить = Новый Структура;
	ПараметрыПакетаОбновить.Вставить("ЗагрузкаПоддерживается",	Ложь);
	ПараметрыПакетаОбновить.Вставить("ВыборочноеШифрование",	Истина);
	ПараметрыПакетаОбновить.Вставить("Разобран",				Истина);
	ПараметрыПакетаОбновить.Вставить("УдалятьВложения",			Истина);
	ПараметрыПакетаОбновить.Вставить("АбонентскийЯщик",			Истина);
	ПараметрыПакетаОбновить.Вставить("УказыватьКомментарий",	Истина);
	ПараметрыПакетаОбновить.Вставить("ОтмечатьВложения",		Истина);
	МодульОбъектаКлиент().СоставПакета_Обновить(СоставПакета, Новый ФиксированнаяСтруктура("Параметры", ПараметрыПакетаОбновить));
	
	ПанельТулБара = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ФормаПросмотра, "ТулБар");
	ПанельТулБара.ТекущаяСтраница = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ПанельТулБара, "Продажа"); 
	
КонецПроцедуры

&НаКлиенте
Функция СбисСписокДополнительныхОпераций(Кэш, ФормаПросмотра) Экспорт

	СписокДопОпераций = Новый СписокЗначений;
	СписокДопОпераций.Добавить("СохранитьНаДиск", "Сохранить на диск");
	СписокДопОпераций.Добавить("ОткрытьКонтрагентаОнлайнПоПакету", "Открыть контрагента на saby.ru");
	СписокДопОпераций.Добавить("ИзменитьНомерДокумента", "Изменить номер документа");
	ФормаПросмотра.СервисДопОперацияПросмотра(СписокДопОпераций);	// alo доп операции из инишки Сервис

	Ини = Кэш.ФормаНастроек.Ини(Кэш, Кэш.Текущий.ТипДок);

	Если Ини.Свойство("ДопОперацияПросмотра")  Тогда
		Для Каждого ДопОперация Из Ини.ДопОперацияПросмотра Цикл
			СписокДопОпераций.Добавить(ДопОперация.Значение.Операция.Функция1С, Кэш.ОбщиеФункции.РассчитатьЗначение("Операция", ДопОперация.Значение, Кэш));
		КонецЦикла;
	КонецЕсли;

	Возврат СписокДопОпераций;
	
КонецФункции

&НаКлиенте
Функция СохранитьНаДиск(Кэш, ФормаПросмотра) Экспорт
	ФормаПросмотра.СохранитьНаДискНажатие("");
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Функция ИзменитьНомерДокумента(Кэш, ФормаПросмотра) Экспорт
	
	ТекущийНомер = МодульОбъектаКлиент().СоставПакета_Получить(ФормаПросмотра.СоставПакета, "Номер");
	ДопПараметрыВвода = Новый Структура("СоставПакета, ФормаПросмотра", ФормаПросмотра.СоставПакета, ФормаПросмотра);
	ОписаниеОкончанияВвода = МодульОбъектаКлиент().НовыйСБИСОписаниеОповещения("ИзменитьНомерДокумента_Завернить", ЭтаФорма, ДопПараметрыВвода);
	МодульОбъектаКлиент().СБИСПоказатьВводСтроки(ОписаниеОкончанияВвода, ТекущийНомер, "Номер документа", 50, Ложь);
	
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ИзменитьНомерДокумента_Завернить(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры.СоставПакета.Вставить("ПерегенерироватьВложения", Истина);
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ДопПараметры.ФормаПросмотра, "Записать").Видимость = Истина;
	
	ИзмененияНомера = Новый Структура("Номер", Результат);
	МодульОбъектаКлиент().СоставПакета_Обновить(ДопПараметры.СоставПакета, ИзмененияНомера);
	
КонецПроцедуры
