&НаКлиенте
Перем Кэш;

#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

//функция обновляет контент для подразделов раздела Продажа	
&НаКлиенте
Функция ОбновитьКонтент(ЛокальныйКэш) Экспорт
	Кэш = ЛокальныйКэш;
	ИмяРеестра = "";
	ИмяРаздела = "Справочники";	
	Ини = "";
	Если	Не Кэш.Разделы[ИмяРаздела].Свойство(Кэш.Текущий.Имя, ИмяРеестра)
		Или	Не Кэш.Ини.Свойство(ИмяРеестра, Ини) Тогда
		Возврат Ложь;
	ИначеЕсли Ини = Неопределено Тогда
		Ини = Кэш.ФормаНастроек.Ини(Кэш, ИмяРеестра);
	КонецЕсли;
	Кэш.Текущий.ТипДок = ИмяРеестра;
	ГлавноеОкно				= Кэш.ГлавноеОкно;
	Контент					= ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "Контент");
	Кэш.ТаблДок				= ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "Таблица_РеестрСправочников");
	Контент.ТекущаяСтраница	= ГлавноеОкно.сбисПолучитьСтраницу(Контент, "РеестрСправочников");	
	
	СтраницыПанели = Кэш.ОбщиеФункции.СбисПолучитьЭлементФормы(Кэш,, ИмяРаздела + "_Подразделы");
	СтраницаОперацийРеестра = Кэш.ОбщиеФункции.СбисПолучитьЭлементФормы(Кэш, СтраницыПанели, ИмяРеестра);
	
	Если Не СтраницаОперацийРеестра = Неопределено Тогда
		СтраницыПанели.ТекущаяСтраница = СтраницаОперацийРеестра;
	КонецЕсли;
	
	НаСменуРаздела(Кэш); //Вызываем руками, чтобы изменилась панель операций.
	
	Если Не ЗначениеЗаполнено(ГлавноеОкно.ТипЦен) Тогда
		мНоменклатура = Кэш.ФормаНастроек.Ини(Кэш, ИмяРеестра);
		Если	мНоменклатура.Свойство("мФайл",			мНоменклатура) 
			И	мНоменклатура.Свойство("Номенклатура",	мНоменклатура) Тогда
			Если мНоменклатура.Свойство("ТипЦенНоменклатуры") Тогда
				ИмяСправочника = СокрЛП(Сред(мНоменклатура.ТипЦенНоменклатуры.Значение, Найти(мНоменклатура.ТипЦенНоменклатуры.Значение, ".") + 1));
				ТипСправочника = "СправочникСсылка." + ИмяСправочника;
			Иначе
				ТипСправочника = "СправочникСсылка.ТипыЦенНоменклатуры";
			КонецЕсли;
			ОписаниеТипа = Новый ОписаниеТипов(ТипСправочника);
			ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "ТипЦен").ОграничениеТипа = ОписаниеТипа;
			ГлавноеОкно.ТипЦен = ОписаниеТипа.ПривестиЗначение();
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ГлавноеОкно.ДатаЦен) Тогда
		ГлавноеОкно.ДатаЦен = ТекущаяДата();	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ГлавноеОкно.ВладелецКаталога) Тогда
		Если Кэш.Ини.Конфигурация.Свойство("Организации") Тогда
			ИмяСправочника = СокрЛП(Сред(Кэш.Ини.Конфигурация.Организации.Значение, Найти(Кэш.Ини.Конфигурация.Организации.Значение, ".") + 1));
			ТипСправочника = "СправочникСсылка." + ИмяСправочника;
		Иначе
			ТипСправочника = "СправочникСсылка.Организации";
		КонецЕсли;
		ОписаниеТипа = Новый ОписаниеТипов(ТипСправочника);
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "ВладелецКаталога").ОграничениеТипа = ОписаниеТипа;
		ГлавноеОкно.ВладелецКаталога = ОписаниеТипа.ПривестиЗначение();
	КонецЕсли;

	Ини = Кэш.ФормаНастроек.Ини(Кэш, ИмяРеестра);
	ТекстЗапроса = Кэш.ОбщиеФункции.РассчитатьЗначение("ЗапросСпискаЭлементов", Ини);
	ПараметрыФильтра = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПараметрыТекущегоФильтра");
	Результат = Новый Структура;
	Результат.Вставить("Таблица_РеестрСправочников", Кэш.ОбщиеФункции.ЗаполнитьМассивЭлементовСправочника(ТекстЗапроса, ПараметрыФильтра));
	
	Возврат Результат;
КонецФункции

// Функция делает подготовку к переходу	
&НаКлиенте
Функция ОбновитьКонтент_ПередВызовом(СтруктураРаздела, Кэш) Экспорт
	
	Если ЗначениеЗаполнено(Кэш.Парам.ФильтрыПоРазделам["Справочники"]) Тогда
		Кэш.ГлавноеОкно.сбисВосстановитьФильтр(Кэш, Кэш.Парам.ФильтрыПоРазделам["Справочники"]);
	Иначе
		ФильтрОчистить(Кэш);
	КонецЕсли;
    
КонецФункции

&НаКлиенте
Процедура НастроитьКолонки(Кэш) Экспорт  
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("ЕдиницаИзмерения");
	МассивРеквизитов.Добавить("Характеристика");
	ПараметрыСтруктурыПолей = Новый Структура("КолонкиУдалить", МассивРеквизитов);
	ПараметрыГлавногоОкна = Новый Структура("ИмяТаблицы, СтруктураПолей", "Таблица_РеестрСправочников", ПараметрыСтруктурыПолей);
	Кэш.ГлавноеОкно.НастроитьКолонкиФормы(ПараметрыГлавногоОкна);

КонецПроцедуры
                                   
//Процедура устанавливает панель навигации на 1ую страницу и скрывает панель	
&НаКлиенте
Процедура НавигацияУстановитьПанель(ЛокальныйКэш=Неопределено) Экспорт
	ГлавноеОкно = ЛокальныйКэш.ГлавноеОкно;
	ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "ПанельНавигации").Видимость		= Ложь;
	ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "ЗаписейНаСтранице1С").Видимость	= Ложь;
	ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "ЗаписейНаСтранице").Видимость	= Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НаСменуРаздела(ЛокальныйКэш) Экспорт
	Кэш = ЛокальныйКэш;
	ГлавноеОкно = Кэш.ГлавноеОкно;
	ПанельМассовыхОпераций = Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно, "ПанельМассовыхОпераций");
	Попытка
		ПанельМассовыхОпераций.ТекущаяСтраница = Кэш.ГлавноеОкно.сбисПолучитьСтраницу(ПанельМассовыхОпераций, "Справочники" + Кэш.Текущий.ТипДок);
		Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно, "ПанельТулбар").Видимость = Истина;
	Исключение
		ПанельМассовыхОпераций.ТекущаяСтраница = Кэш.ГлавноеОкно.сбисПолучитьСтраницу(ПанельМассовыхОпераций, "Справочники");
		Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно, "ПанельТулбар").Видимость = Истина;
	КонецПопытки;	
	 
	Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно,"ОтметитьВсе7").Видимость = Истина;
	// +++ 1187075631 TODO После завершения проекта по сопоставлению номенклатуры раскомментить 
	// Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно,"ОтметитьВсе13").Видимость = Истина; 	
	
	ТекущийИмя	= Кэш.Текущий.Имя;
	РодительИмя	= "Справочники";
	КнопкиПрайс = Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно, "СправочникиОтправить"); 
	Если Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		КнопкиПрайс = КнопкиПрайс.ПодчиненныеЭлементы;
	Иначе
		КнопкиПрайс = КнопкиПрайс.Кнопки;
	КонецЕсли;
	ИспользоватьСогласованиеЦен = МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "СогласованиеЦен"));
	ПараметрыОчисткиКнопок = Новый Структура("Имя, УправляемоеПриложение", "СправочникиОтправить", Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение);
	Кэш.ГлавноеОкно.сбисОчиститьПанельКнопок(ПараметрыОчисткиКнопок, Ложь);
	
	сбисРазделМеню = Кэш.МенюРазделов;
	// Заполним команды из инишек и стандартные
	Если	сбисРазделМеню.Свойство(РодительИмя,	сбисРазделМеню)
		И	сбисРазделМеню.Свойство(ТекущийИмя,		сбисРазделМеню) Тогда

		КлючиПараметров = "ИмяИни, ИмяКнопки, МетодАктивации, ЗаголовокКнопки";
		ДобавитьКнопки = Новый Массив;

		ОтправитьПрайс = Новый Структура(КлючиПараметров);
		ОтправитьПрайс.ИмяИни			= "Номенклатура";
		ОтправитьПрайс.ИмяКнопки		= "ОтправитьПрайс";
		ОтправитьПрайс.МетодАктивации	= "ОтправитьПрайс";
		ОтправитьПрайс.ЗаголовокКнопки	= "Отправить прайс";
		ДобавитьКнопки.Добавить(ОтправитьПрайс);

		Если ИспользоватьСогласованиеЦен Тогда
			ПоказатьСогласованиеЦен = Новый Структура(КлючиПараметров);
			ПоказатьСогласованиеЦен.ИмяИни			= "Номенклатура";
			ПоказатьСогласованиеЦен.ИмяКнопки		= "ПоказатьСогласованиеЦен";
			ПоказатьСогласованиеЦен.МетодАктивации	= "ПоказатьСогласованиеЦен";
			ПоказатьСогласованиеЦен.ЗаголовокКнопки	= "Открыть документ";
			ДобавитьКнопки.Добавить(ПоказатьСогласованиеЦен);
		КонецЕсли;

		ОтправитьКаталог = Новый Структура(КлючиПараметров);
		ОтправитьКаталог.ИмяИни				= "Номенклатура";
		ОтправитьКаталог.ИмяКнопки			= "ОтправитьКаталог";
		ОтправитьКаталог.МетодАктивации		= "ОтправитьКаталог";
		ОтправитьКаталог.ЗаголовокКнопки	= "Загрузить каталог на sbis.ru";
		ДобавитьКнопки.Добавить(ОтправитьКаталог);

		Если Кэш.Парам.ИспользоватьГенератор Тогда
			ОтправитьСогласованиеЦен = Новый Структура(КлючиПараметров);
			ОтправитьСогласованиеЦен.ИмяИни				= "Номенклатура";
			ОтправитьСогласованиеЦен.ИмяКнопки			= "ОтправитьСогласованиеЦен";
			ОтправитьСогласованиеЦен.МетодАктивации		= "ОтправитьСогласованиеЦен";
			ОтправитьСогласованиеЦен.ЗаголовокКнопки	= "Отправить согласование цен";
			ДобавитьКнопки.Вставить(1, ОтправитьСогласованиеЦен);
		КонецЕсли;
		
		// Проверим, не переназначены ли стандартные команды через ини
		Для Каждого Пункт Из сбисРазделМеню Цикл
			Для сч = 0 По ДобавитьКнопки.Количество() - 1 Цикл
				Если ДобавитьКнопки[сч]["ИмяКнопки"] = Пункт["ИмяКнопки"] Тогда
					ДобавитьКнопки.Удалить(сч);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;

		Для Каждого КнопкаДобавить Из ДобавитьКнопки Цикл
			сбисРазделМеню.Добавить(КнопкаДобавить);
		КонецЦикла;

	Иначе
		Возврат;
	КонецЕсли;
	
	// Добавим кнопки в Отправить
	Для Каждого Пункт Из сбисРазделМеню Цикл
		
		Если Не ЗначениеЗаполнено(Пункт.МетодАктивации) Тогда
			Продолжить;
		КонецЕсли;
		
		Отказ			= Ложь;
		
		ПараметрыКнопки = Новый Структура;
		ПараметрыКнопки.Вставить("Имя",						Пункт.ИмяКнопки);
		ПараметрыКнопки.Вставить("Заголовок",				?(Пункт.Свойство("ЗаголовокКнопки"), Пункт.ЗаголовокКнопки, Пункт.ИмяКнопки));
		ПараметрыКнопки.Вставить("УправляемоеПриложение",	Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение);
		ПараметрыКнопки.Вставить("Панель",					"СправочникиОтправить");
		
		РезультатФормированияКнопки = Кэш.ГлавноеОкно.сбисДобавитьКнопку(ПараметрыКнопки, Отказ);
		
		Если Отказ Тогда
			Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, РезультатФормированияКнопки);
		КонецЕсли;
		
	КонецЦикла;		
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "ПанельФильтра").Видимость = ИспользоватьСогласованиеЦен;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "ПоказатьПанельФильтра").Видимость = ИспользоватьСогласованиеЦен;
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОчистить(Кэш) Экспорт
// Процедура устанавливает значения фильтра по-умолчанию для текущего раздела	
	ГлавноеОкно = Кэш.ГлавноеОкно;
	
	ОписаниеТиповФильтра = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолейФильтра");
	Если Не ТипЗнч(ОписаниеТиповФильтра) = Тип("Структура") Тогда
		ОписаниеТиповФильтра = Новый Структура;
	КонецЕсли;
	
	ГлавноеОкно.ФильтрПериод = "За весь период";
	
	Если ОписаниеТиповФильтра.Свойство("ФильтрОрганизация") Тогда
		ГлавноеОкно.ФильтрОрганизация = ОписаниеТиповФильтра.ФильтрОрганизация.ПривестиЗначение();
	Иначе	
		ГлавноеОкно.ФильтрОрганизация = "";
	КонецЕсли;
	Если ОписаниеТиповФильтра.Свойство("ФильтрКонтрагент") Тогда
		ГлавноеОкно.ФильтрКонтрагент = ОписаниеТиповФильтра.ФильтрКонтрагент.ПривестиЗначение();
	Иначе	
		ГлавноеОкно.ФильтрКонтрагент = "";
	КонецЕсли;
	Если ОписаниеТиповФильтра.Свойство("ФильтрОтветственный") Тогда
		ГлавноеОкно.ФильтрОтветственный = ОписаниеТиповФильтра.ФильтрОтветственный.ПривестиЗначение();
	Иначе	
		ГлавноеОкно.ФильтрОтветственный = "";
	КонецЕсли;
	ГлавноеОкно.ФильтрДатаНач = '00010101';
	ГлавноеОкно.ФильтрДатаКнц = '00010101';
	ГлавноеОкно.ФильтрСостояние = ГлавноеОкно.СписокСостояний.НайтиПоИдентификатору(0).Значение;
	ГлавноеОкно.ФильтрКонтрагентПодключен = "";
	ГлавноеОкно.ФильтрКонтрагентСФилиалами = Ложь;
	ГлавноеОкно.ФильтрСтраница = 1;
	ГлавноеОкно.ФильтрМаска = "";
	// Очистим дополнительные параметры фильтра
	НазваниеРаздела = Кэш.Разделы["р" + Кэш.Текущий.Раздел];

	ИменаФормДопФильтров = Новый Массив;
	ИменаФормДопФильтров.Добавить("Фильтр_Раздел_" + НазваниеРаздела + "_" + Кэш.Текущий.ТипДок);
	ИменаФормДопФильтров.Добавить("Фильтр_Раздел_" + НазваниеРаздела + "_Шаблон");
	ФормаДопФильтра = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("сбисСписокДопПараметровФильтра", ИменаФормДопФильтров);
	Если ФормаДопФильтра <> Ложь Тогда
		ГлавноеОкно.ОчиститьДополнительныеПараметрыФильтра(ФормаДопФильтра);	
	КонецЕсли;
	// ++ Бухов А. Фильтр по умолчанию 	
	Если Кэш.Ини.Конфигурация.Свойство("ФильтрПоУмолчанию") И  Кэш.Ини.Конфигурация.ФильтрПоУмолчанию.Свойство(Кэш.Текущий.ТипДок) Тогда 
		Попытка
			ФильтрПоУмолчанию = Кэш.Ини.Конфигурация.ФильтрПоУмолчанию[Кэш.Текущий.ТипДок];
			Ини = Кэш.ОбщиеФункции.ПолучитьДанныеДокумента1С(ФильтрПоУмолчанию, Неопределено, Кэш.КэшЗначенийИни, Кэш.Парам);  // alo Меркурий
			Для Каждого Элем Из Ини Цикл 
				Если нрег(Лев(Элем.Ключ, 6)) = "фильтр" Тогда
					ГлавноеОкно[Элем.Ключ] = Элем.Значение;
				КонецЕсли;
			КонецЦикла;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ПараметрыФильтра = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПараметрыТекущегоФильтра");
	ЗаполнитьЗначенияСвойств(ПараметрыФильтра, ГлавноеОкно);
	МодульФормированияФильтра = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("СформироватьСтруктуруФильтра", Кэш.Текущий.ОписаниеРаздела.ФормыРаздела);
	Если МодульФормированияФильтра <> Ложь Тогда
		МодульФормированияФильтра.СформироватьСтруктуруФильтра(Кэш, ПараметрыФильтра);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСтруктуруФильтра(Кэш, ПараметрыФормирования) Экспорт
	
	// Значения по умолнанию
	ТипыПолейФильтра = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолейФильтра");
	МодульСпискаСостояний = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("СписокСостоянийДокумента", Кэш.Текущий.ОписаниеРаздела.ФормыРаздела);
	СписокСостояний = ?(МодульСпискаСостояний = Ложь, Новый СписокЗначений, МодульСпискаСостояний.СписокСостоянийДокумента());
	
	ПараметрыФильтра = Новый Структура;
		
	ПараметрыФильтра.Вставить("ФильтрМаска",			"");
	ПараметрыФильтра.Вставить("ФильтрНоменклатура",		ТипыПолейФильтра.ФильтрНоменклатура.ПривестиЗначение());
	ПараметрыФильтра.Вставить("ФильтрТипНоменклатуры",	ТипыПолейФильтра.ФильтрТипНоменклатуры.ПривестиЗначение());
	ПараметрыФильтра.Вставить("ФильтрGTIN",				""); 
	ПараметрыФильтра.Вставить("ФильтрКодКонтрагента",	"");
	
	// Значения из сохранений
	ТекущийФильтр = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПараметрыТекущегоФильтра");
	
	ЗаполнитьЗначенияСвойств(ПараметрыФильтра, ТекущийФильтр);
	
	// Переданные значения
	ЗаполнитьЗначенияСвойств(ПараметрыФильтра, ПараметрыФормирования);
	
	// Записываем в параметры текущего сеанса
	МодульОбъектаКлиент().ИзменитьПараметрСбис("ПараметрыТекущегоФильтра", ПараметрыФильтра);
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрУстановитьВидимость(ФормаФильтра) Экспорт
	ГлавноеОкно = Кэш.ГлавноеОкно;
	
	ИменаЭлементовСкрыть = Новый Массив;
	ИменаЭлементовСкрыть.Добавить("ФильтрКонтрагентПодключен");
	ИменаЭлементовСкрыть.Добавить("ФильтрКонтрагентСФилиалами");
	ИменаЭлементовСкрыть.Добавить("ФильтрОтветственный");
	ИменаЭлементовСкрыть.Добавить("ФильтрТипыДокументов"); 
	ИменаЭлементовСкрыть.Добавить("ФильтрМаска");
	
	ИменаЭлементовПоказать = Новый Массив;
	ИменаЭлементовПоказать.Добавить("НадписьНоменклатураКонтрагента");  
	ИменаЭлементовПоказать.Добавить("НадписьНоменклатура1С");   
	ИменаЭлементовПоказать.Добавить("НадписьКодКонтрагента");   
	ИменаЭлементовПоказать.Добавить("НадписьGTIN");   
	ИменаЭлементовПоказать.Добавить("ФильтрНоменклатура1С");   
	ИменаЭлементовПоказать.Добавить("ФильтрКодКонтрагента");    
	ИменаЭлементовПоказать.Добавить("ФильтрGTIN");
	
	Для каждого ИмяЭлемента Из ИменаЭлементовСкрыть Цикл
	
		ВыбранныйЭлемент = ГлавноеОкно.сбисЭлементФормы(ФормаФильтра, ИмяЭлемента);
		
		Если Не ВыбранныйЭлемент = Неопределено Тогда
			ВыбранныйЭлемент.Видимость = Ложь;
		КонецЕсли;
	
	КонецЦикла;
	
	Для каждого ИмяЭлемента Из ИменаЭлементовПоказать Цикл
	
		ВыбранныйЭлемент = ГлавноеОкно.сбисЭлементФормы(ФормаФильтра, ИмяЭлемента);
		
		Если Не ВыбранныйЭлемент = Неопределено Тогда
			ВыбранныйЭлемент.Видимость = Истина;
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДокумент(Кэш, ТекущаяСтрока) Экспорт
	Перем Вложения;
	
	ГлавноеОкно = Кэш.ГлавноеОкно;
	// Кэш.СписокНоменклатуры.Очистить();
	МассивПакетов = Кэш.ОбщиеФункции.ПодготовитьСтруктуруДокумента1С(ТекущаяСтрока, Кэш);
	Если МассивПакетов.Количество() = 1 Тогда
		ПолныйСоставПакета = МассивПакетов[0];
		Если ПолныйСоставПакета.Свойство("Ошибка") Тогда
			МодульОбъектаКлиент().СообщитьСбисИсключение(ПолныйСоставПакета.Ошибка);
			Возврат;
		ИначеЕсли Не ПолныйСоставПакета.Свойство("Вложение", Вложения) Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Вложения) Тогда
			Возврат;
		КонецЕсли;
		
		ТекущийРаздел = Кэш.Разделы["р" + Кэш.Текущий.Раздел];   
		
		ДопПараметры = Новый Структура;  
		ДопПараметры.Вставить("ТекущийРаздел", ТекущийРаздел); 
		ДопПараметры.Вставить("Вложения", Вложения); 
		
		Попытка
			МодульОбъектаКлиент().ПодготовитьДокументСбисКПросмотру(ПолныйСоставПакета,ДопПараметры);
		Исключение
			МодульОбъектаКлиент().ВызватьСбисИсключение(ИнформацияОбОшибке(), "Раздел_Продажа_Шаблон.ПоказатьДокумент");
		КонецПопытки;
		
		ФормыПросмотра = Новый Массив;
		ФормыПросмотра.Добавить("ФормаПросмотрДокумента");
		Если МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РасширенныйФункционалСопоставленияНоменклатуры")) Тогда
			ФормыПросмотра.Вставить(0, "ФормаПросмотрДокументаРасширенноеСопоставление");
		КонецЕсли;
		ФормаПросмотрДокумента = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ПоказатьДокумент", ФормыПросмотра);
		ФормаПросмотрДокумента.ПоказатьДокумент(Кэш, ПолныйСоставПакета);
		
	ИначеЕсли МассивПакетов.Количество() > 1 Тогда

		ФормаПросмотрДокументов = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ПоказатьДокументы", "ФормаПросмотрДокументов");
		ФормаПросмотрДокументов.ПоказатьДокументы(Кэш, МассивПакетов);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементовВформеПросмотра(ФормаПросмотра, СоставПакета, КэшПарам) Экспорт
	
	ФормаПросмотра.ДокументРазобран = Истина;
	
	ПараметрыПакетаОбновить = Новый Структура;
	ПараметрыПакетаОбновить.Вставить("ЗагрузкаПоддерживается",	Ложь);
	ПараметрыПакетаОбновить.Вставить("ВыборочноеШифрование",	Истина);
	ПараметрыПакетаОбновить.Вставить("Разобран",				Истина);
	ПараметрыПакетаОбновить.Вставить("УдалятьВложения",			Истина);
	ПараметрыПакетаОбновить.Вставить("АбонентскийЯщик",			Истина);
	ПараметрыПакетаОбновить.Вставить("УказыватьКомментарий",	Истина);
	ПараметрыПакетаОбновить.Вставить("ОтмечатьВложения",		Истина);
	МодульОбъектаКлиент().СоставПакета_Обновить(СоставПакета, Новый ФиксированнаяСтруктура("Параметры", ПараметрыПакетаОбновить));
	
	ПанельТулБара = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ФормаПросмотра, "ТулБар");
	ПанельТулБара.ТекущаяСтраница = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ПанельТулБара, "Продажа"); 
	
КонецПроцедуры

&НаКлиенте
Функция СбисСписокДополнительныхОпераций(Кэш, ФормаПросмотра) Экспорт

	СписокДопОпераций = Новый СписокЗначений;
	СписокДопОпераций.Добавить("СохранитьНаДиск", "Сохранить на диск");
	СписокДопОпераций.Добавить("ОткрытьКонтрагентаОнлайнПоПакету", "Открыть контрагента на sbis.ru");
	ФормаПросмотра.СервисДопОперацияПросмотра(СписокДопОпераций);	// alo доп операции из инишки Сервис

	Ини = Кэш.ФормаНастроек.Ини(Кэш, Кэш.Текущий.ТипДок);

	Если Ини.Свойство("ДопОперацияПросмотра")  Тогда
		Для Каждого ДопОперация Из Ини.ДопОперацияПросмотра Цикл
			СписокДопОпераций.Добавить(ДопОперация.Значение.Операция.Функция1С, Кэш.ОбщиеФункции.РассчитатьЗначение("Операция", ДопОперация.Значение, Кэш));
		КонецЦикла;
	КонецЕсли;

	Возврат СписокДопОпераций;
	
КонецФункции
