
&НаКлиенте
Процедура ТСНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыДиалога = Новый Структура;
	ПараметрыДиалога.Вставить("FILTER_NAME", "ТорговаяСеть");
	ПараметрыДиалога.Вставить("INI", "ТорговаяСеть_list");
	ПараметрыДиалога.Вставить("MULTI", Ложь);
	
	ПараметрыОткрытия = Новый Структура("КэшироватьФорму, ПолучитьНовую, Владелец, Параметры", Ложь, Истина, ЭтаФорма, ПараметрыДиалога);
	Форма = МодульОбъектаКлиент().ПолучитьФормуОбработки("ДиалогВыбораИзСписка", ПараметрыОткрытия);
	
	Если Форма <> Ложь Тогда
		Форма.Открыть();
	КонецЕсли;

КонецПроцедуры


