
&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыВходящие) Экспорт
	
	ИдДокументаСБИС		= ПараметрыВходящие.ИдДокументаСБИС;

	ИнициализироватьСозданиеУпаковки();
	
	УстановитьЗначенияПоУмолчаниюДляНезаполненных();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначенияПоУмолчаниюДляНезаполненных()
	
	Если Не ЗначениеЗаполнено(ШаблонКода) Тогда
		ШаблонКода = "Короб SSCC";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КоличествоУпаковок) Тогда
		КоличествоУпаковок = 1;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Вместимость) Тогда
		Вместимость = 1;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ЕдиницаОбъема) Тогда
		ЕдиницаОбъема = "{""base"": {""abbr"": ""см"", ""name"": ""Сантиметр"", ""code"": ""004"", ""qty"": 1.0}}";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЕдиницаВеса) Тогда
		ЕдиницаВеса = "{""base"": {""abbr"": ""кг"", ""name"": ""Килограмм"", ""code"": ""166"", ""qty"": 1.0}}";
	КонецЕсли;
	
КонецПроцедуры

