
&НаКлиенте
Процедура ПолучитьНовыйКод(Команда)
	
	Если ЗначениеЗаполнено(Код) Тогда
		ТекстВопроса = "Заменить код упаковки?"; 
		ПолучитьНовыйКод_Завершение = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПолучитьНовыйКод_Завершение", ЭтаФорма);
		МодульОбъектаКлиент().СбисПоказатьВопрос(ПолучитьНовыйКод_Завершение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ДопПараметры = Новый Структура;
		ПолучитьНовыйКод_Завершение(КодВозвратаДиалога.Да, ДопПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметровСбис = ПреобразоватьСтруктуруПараметровОбработкиДляСбис();
	
	СписокПараметровВызова = Новый Структура();
	СписокПараметровВызова.Вставить("ИдДокументаСБИС",			ИдДокументаСБИС);
	СписокПараметровВызова.Вставить("СтруктураПараметровСбис",	СтруктураПараметровСбис);
	
	Попытка
		МодульОбъектаКлиент().СгенерироватьТранспортнуюУпаковку(СписокПараметровВызова);
		Закрыть(Истина);
	Исключение
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ТаблицаУпаковкиКоличествоПриИзменении");
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	ФормаЗакрытьУстановитьСтатусЗавершить();
	
КонецПроцедуры

