
&НаКлиенте
Процедура КоличествоУпаковокПриИзменении(Элемент)
	
	ЭлементКод				= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Код");
	ЭлементПолучитьНовыйКод	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПолучитьНовыйКод");
	
	Если КоличествоУпаковок > 1 Тогда
		ЭлементКод.Доступность				= Ложь;
		ЭлементПолучитьНовыйКод.Доступность	= Ложь;
	Иначе
		ЭлементКод.Доступность				= Истина;
		ЭлементПолучитьНовыйКод.Доступность	= Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если КоличествоУпаковок > 1 Тогда
	
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Код"));
	
	КонецЕсли;
	
КонецПроцедуры

