
&НаКлиенте
Процедура ПолучитьНовыйКод_Завершение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СписокПараметровВызова = Новый Структура();
	СписокПараметровВызова.Вставить("ИдДокументаСБИС",	ИдДокументаСБИС);
	СписокПараметровВызова.Вставить("ШаблонКода",		ШаблонКода);
	СписокПараметровВызова.Вставить("GLN",				GLN);
		
	Попытка
		Результат = МодульОбъектаКлиент().СгенерироватьКодТранспортнойУпаковки(СписокПараметровВызова);
	Исключение
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "СгенерироватьКодТранспортнойУпаковки");
	КонецПопытки;
	
	Код = Результат;
	
КонецПроцедуры

