
&НаКлиенте
Процедура ИнициализироватьСозданиеУпаковки()
	Перем Результат;
	
	СписокПараметровВызова = Новый Структура;
	СписокПараметровВызова.Вставить("ИдДокументаСБИС",						ИдДокументаСБИС);
	СписокПараметровВызова.Вставить("ПрочитатьСПредыдущейЗаписиУпаковки",	Истина);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПрочитатьСПредыдущейЗаписиУпаковки", Истина);
	
	Попытка
		Результат = МодульОбъектаКлиент().ИнициализироватьСозданиеТранспортнойУпаковки(СписокПараметровВызова, ДопПараметры);
	Исключение
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ИнициализироватьСозданиеУпаковки");
		Если ЭтаФорма.Открыта() Тогда
			Закрыть();
		КонецЕсли;
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		МодульОбъектаКлиент().СбисСообщить("Произошла неизвестная ошибка. Создание упаковки прервано.");
		Закрыть();
	КонецЕсли;
	
	СтруктураПараметровОбработки = ПреобразоватьСтруктуруПараметровСбисДляОбработки(Результат);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураПараметровОбработки);
	
	Попытка
		Результат = МодульОбъектаКлиент().ПолучитьGLNДляГенерацииКодаТранспортнойУпаковки(СписокПараметровВызова, ДопПараметры);
		Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("Gln") Тогда
			GLN = Результат.Gln;
		КонецЕсли;
	Исключение
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ИнициализироватьСозданиеУпаковки");
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Функция ПреобразоватьСтруктуруПараметровСбисДляОбработки(СтруктураПараметровСБИС)
	
	СтруктураПараметровОбработки = Новый Структура("Брутто, Вместимость, ВысотаУпаковки, ДлинаУпаковки, ЕдиницаВеса, ЕдиницаОбъема,
										|	Код, Название, Нетто, ШаблонКода, ШиринаУпаковки");
	
	СтруктураПараметровСБИС.Свойство("gross",			СтруктураПараметровОбработки.Брутто);
	СтруктураПараметровСБИС.Свойство("Count",			СтруктураПараметровОбработки.Вместимость);
	СтруктураПараметровСБИС.Свойство("height",			СтруктураПараметровОбработки.ВысотаУпаковки);
	СтруктураПараметровСБИС.Свойство("length",			СтруктураПараметровОбработки.ДлинаУпаковки);
	СтруктураПараметровСБИС.Свойство("Number",			СтруктураПараметровОбработки.Код);
	СтруктураПараметровСБИС.Свойство("Package",			СтруктураПараметровОбработки.Название);
	СтруктураПараметровСБИС.Свойство("net",				СтруктураПараметровОбработки.Нетто);
	СтруктураПараметровСБИС.Свойство("templateName",	СтруктураПараметровОбработки.ШаблонКода);
	СтруктураПараметровСБИС.Свойство("width",			СтруктураПараметровОбработки.ШиринаУпаковки);
	СтруктураПараметровСБИС.Свойство("weightEIU",		СтруктураПараметровОбработки.ЕдиницаВеса); // weightEIU: "{"base": {"code": "206", "qty": 1.0, "abbr": "ц", "name": "Центнер"}}",
	СтруктураПараметровСБИС.Свойство("dimEIU",			СтруктураПараметровОбработки.ЕдиницаОбъема); // dimEIU: "{"base": {"abbr": "см", "name": "Сантиметр", "code": "004", "qty": 1.0}}",
	
	Возврат СтруктураПараметровОбработки;
	
КонецФункции

&НаКлиенте
Функция ПреобразоватьСтруктуруПараметровОбработкиДляСбис()

	СтруктураПараметровСБИС = Новый Структура("Gross, Height, Length, Net, PackQTY, PackSize, PackageName, Root, InMark, Width,
										| Number, TemplateName, dimEIU, weightEIU"); // Порядок как на онлайне
	
	СтруктураПараметровСБИС.Gross        = ?(ЗначениеЗаполнено(Брутто),             Брутто,             Null);
	СтруктураПараметровСБИС.Height       = ?(ЗначениеЗаполнено(ВысотаУпаковки),     ВысотаУпаковки,     Null);
	СтруктураПараметровСБИС.Length       = ?(ЗначениеЗаполнено(ДлинаУпаковки),      ДлинаУпаковки,      Null);
	СтруктураПараметровСБИС.Net          = ?(ЗначениеЗаполнено(Нетто),              Нетто,              Null);
	СтруктураПараметровСБИС.PackQTY      = ?(ЗначениеЗаполнено(КоличествоУпаковок), КоличествоУпаковок, Null);
	СтруктураПараметровСБИС.PackSize     = ?(ЗначениеЗаполнено(Вместимость),        Вместимость,        Null);
	СтруктураПараметровСБИС.PackageName  = ?(ЗначениеЗаполнено(Название),           Название,           Null);
	СтруктураПараметровСБИС.Root         = Null;
	СтруктураПараметровСБИС.InMark       = Null;
	СтруктураПараметровСБИС.Width        = ?(ЗначениеЗаполнено(ШиринаУпаковки),     ШиринаУпаковки,     Null);
	СтруктураПараметровСБИС.Number       = ?(КоличествоУпаковок = 1,                Код,                Null);
	СтруктураПараметровСБИС.TemplateName = ?(ЗначениеЗаполнено(ШаблонКода),         ШаблонКода,         Null);
	СтруктураПараметровСБИС.dimEIU       = ?(ЗначениеЗаполнено(ЕдиницаОбъема),      ЕдиницаОбъема,      Null);
	СтруктураПараметровСБИС.weightEIU    = ?(ЗначениеЗаполнено(ЕдиницаВеса),        ЕдиницаВеса,        Null);
	
	Возврат СтруктураПараметровСБИС;	

КонецФункции

