/////////////////////////////////////////

//НЕ ИСПОЛЬЗОВАТЬ. Замена - МодульОбъектаКлиент.СформироватьИПрименитьПодстановкуПоВложению
&НаКлиенте
Функция ПрименитьПодстановку(Кэш, Вложение, ДопПараметры, Отказ) Экспорт
	
	Перем СбисФормыПоиска;

	ПараметрыПримененияПОдстановки = Новый Структура;
	ВерсияФорматаПодстановки = Неопределено;
	Если Не Вложение.СтруктураДокумента.Файл.Свойство("ВерсияФормата", ВерсияФорматаПодстановки) Тогда
		ВерсияФорматаПодстановки = Вложение.ВерсияФормата;
	КонецЕсли;
	СбисФормыПоиска = Новый Массив;
	СбисФормыПоиска.Добавить("Файл_" + Вложение.Тип + "_" + СтрЗаменить(ВерсияФорматаПодстановки, ".", "_"));
	Если Не ВерсияФорматаПодстановки = "3.01" Тогда
		СбисФормыПоиска.Добавить("Файл_Шаблон_" + СтрЗаменить(ВерсияФорматаПодстановки, ".", "_"));
	КонецЕсли;
	СбисФормыПоиска.Добавить("Файл_Шаблон");
	
	ПараметрыПримененияПОдстановки.Вставить("ФормыПоиска", СбисФормыПоиска);
	Возврат МодульОбъектаКлиент().СформироватьИПрименитьПодстановкуПоВложению(Вложение, ПараметрыПримененияПОдстановки);
	
КонецФункции

//ДопПараметры - Структура: 
&НаКлиенте
Функция СформироватьНаборПодстановок(Вложение=Неопределено, ДопПараметры=Неопределено) Экспорт
	
	Если Вложение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		НаборПодстановок	= Новый Соответствие;
		НаборПодстановок.Вставить("Генератор",				НовыйПодстановкаГенератор			(Вложение, ДопПараметры));
		
		//1189911425 Адрес доставки заменяет собой адрес ГП при подготовке документа.
		//ПодстановкаДопАдрес = НовыйПодстановкаДопПолучательАдрес(Вложение, ДопПараметры);
		//Если Не ПодстановкаДопАдрес = Неопределено Тогда
		//	НаборПодстановок.Вставить("ДопПолучатель.Адрес",	ПодстановкаДопАдрес);
		//КонецЕсли;
	Исключение
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнформацияОбОшибке(), "Файл_Шаблон.СформироватьНаборПодстановок");
	КонецПопытки;
		
	Возврат НаборПодстановок;
	
КонецФункции

// Функция - конструктор подстановки "Генератор"
//
// Параметры:
//  Вложение	 - 	 - 
//  ДопПараметры - Структура:
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Функция НовыйПодстановкаГенератор(Вложение, ДопПараметры)
	Перем Кэш;
	
	Если Не ДопПараметры.Свойство("Кэш", Кэш) Тогда
		Кэш = ВладелецФормы.Кэш;
	КонецЕсли;

	Генератор = Новый Соответствие;
	Попытка
		ЗаполнитьГенераторДаннымиВложения(Кэш, Генератор, Вложение, ДопПараметры);
	Исключение
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнформацияОбОшибке(), "Файл_Шаблон.СформироватьПодстановкуГенератор");
	КонецПопытки;
		
	Возврат Генератор;
	
КонецФункции

// Функция - конструктор подстановки "ДопПолучатель.Адрес"
//
// Параметры:
//  Вложение	 - 	 - 
//  ДопПараметры - Структура:
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Функция НовыйПодстановкаДопПолучательАдрес(Вложение, ДопПараметры)
    Перем Кэш, ИсточникАдрес;
	
	Если Не ДопПараметры.Свойство("Кэш", Кэш) Тогда
		Кэш = ВладелецФормы.Кэш;
	КонецЕсли;

	ТекФайл		= Вложение.СтруктураДокумента.Файл;
	ТекДокумент	= ТекФайл.Документ;
	
	Если	Не ТекДокумент.Свойство("АдресДоставки", ИсточникАдрес)
		Или	Не ЗначениеЗаполнено(ИсточникАдрес) Тогда
		Возврат Неопределено;
	КонецЕсли;
	ОбъектПодстановка	= Новый Соответствие; 
	ПараметрыФормат		= Новый Структура("ПрефиксСторона, ПрефиксПолей, КодСтраны, АдрИноТекст", "Адрес", "", "КодСтраны", "Адрес");

	ЗаполнитьПоАдреснымДанным(Кэш, ОбъектПодстановка, ИсточникАдрес, ПараметрыФормат);
	Возврат ОбъектПодстановка;
	
КонецФункции

