
&НаКлиенте
Процедура АккордеонДополнительныйHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		
		ЭлементСобытия = ДанныеСобытия.Element;
		
	Иначе
		
		ЭлементСобытия = ДанныеСобытия.srcElement;
		
	КонецЕсли;
	
	Если ЭлементСобытия["id"] = "toExtSys" Тогда   
		
		Попытка 
			
			ИмяДействия	= ЭлементСобытия.getAttribute("action");
			Параметр	= ЭлементСобытия.textContext; // Иногда можно брать из ЭлементСобытия.innerHTML;
			МодульОбъектаКлиент().ОбработатьДействиеДополнительногоАккордеона(ИмяДействия, Параметр);  
			
		Исключение  
			
			МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ФормаГлавноеОкно.АккордеонДополнительныйHTMLПриНажатии");
		
		КонецПопытки; 
		
	КонецЕсли;	
	
КонецПроцедуры 

