
&НаКлиенте
Процедура УстановитьПодпискиТранспорта()
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	ПараметрыПодписчиков = Новый Структура("Кэш", Кэш);
	Кэш.СБИС.ДанныеИнтеграции.Подписки.Вставить("UnAuthorized", Новый Структура("Функция, Параметры, Модуль", "UnAuthorized", ПараметрыПодписчиков, ЭтаФорма));
	
КонецПроцедуры

// Обработка события разрыва соединения с плагином
&НаКлиенте
Процедура UnAuthorized(РезультатВызова, ПараметрыОбработки) Экспорт 
	
	МодульОбъектаКлиент = МодульОбъектаКлиент();
	Кэш = МодульОбъектаКлиент.ПолучитьТекущийЛокальныйКэш();
	Если МодульОбъектаКлиент.ПолучитьЗначениеПараметраСБИС("Авторизован") Тогда
		
		МодульОбъектаКлиент.ИзменитьПараметрСБИС("Авторизован", Ложь);
		ОбработчикПродолжить = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("сбисПослеАвторизации", Кэш.ГлавноеОкно, Новый Структура);
		
		ДопПараметрыАвторизовать = Новый ФиксированнаяСтруктура("ПоказатьИнтерфейс, ОбработчикПродолжить", Истина, ОбработчикПродолжить);
		МодульОбъектаКлиент().АвторизоватьсяВSABY(, ДопПараметрыАвторизовать);

	КонецЕсли;
	
КонецПроцедуры    


