
//DynamicDirective

Функция Сторона_Получить(ДанныеСтороны, КлючПолучить, ДопПараметры = Неопределено) Экспорт 

	Возврат СторонаSABY_Получить(ДанныеСтороны, КлючПолучить, ДопПараметры);

КонецФункции 

//DynamicDirective

Функция Сторона_КлючИдентификатора(ДанныеСтороны)  
	
	ДанныеСтороныПлоские = СторонаSABY_Выгрузить(ДанныеСтороны);
	
	Если ЗначениеЗаполнено(ДанныеСтороныПлоские.ИИН) Тогда
		
		Возврат "ИИН";
		
	ИначеЕсли ЗначениеЗаполнено(ДанныеСтороныПлоские.БИН) Тогда
		
		Возврат "БИН";
		
	Иначе  
		
		Возврат "ИНН";
		
	КонецЕсли;
	
КонецФункции

//DynamicDirective

Функция Сторона_НазваниеСтороны(ДанныеСтороны)
	
	Перем НазваниеСтороны;
	
	Если ДанныеСтороны.Свойство("СвЮЛ", НазваниеСтороны) Тогда
		
		НазваниеСтороны = НазваниеСтороны.Название;
		
	ИначеЕсли ДанныеСтороны.Свойство("СвФЛ") Тогда
		ДанныеФЛСтороны = ДанныеСтороны.СвФЛ;
		Если ДанныеФЛСтороны.Свойство("НазваниеПолное") Тогда 
			НазваниеСтороны = ДанныеФЛСтороны.НазваниеПолное;	
		ИначеЕсли ДанныеФЛСтороны.Свойство("Название") Тогда
			НазваниеСтороны = ДанныеФЛСтороны.Название;
		Иначе	
			НазваниеСтороны = ДанныеФЛСтороны.Фамилия;
			НазваниеСтороны = НазваниеСтороны + ?(ЗначениеЗаполнено(НазваниеСтороны), " ", "") + ДанныеФЛСтороны.Имя;
			НазваниеСтороны = НазваниеСтороны + ?(ЗначениеЗаполнено(НазваниеСтороны), " ", "") + ДанныеФЛСтороны.Отчество;
		КонецЕсли; 
		
	ИначеЕсли ДанныеСтороны.Свойство("Название") Тогда
		
		НазваниеСтороны = ДанныеСтороны.Название; 
		
	Иначе
		
		НазваниеСтороны = "";	
	
	КонецЕсли;

	Возврат НазваниеСтороны;	
	
КонецФункции

