
//DynamicDirective

// Функция получаяет значение по ключу от данных стороны
//
// Параметры:
//  ДанныеСтороны	- Структура	 - Экземпляр, от которого надо получить значение
//  КлючПолучить	- Строка	 - Что хотим получить из стороны
//  ДопПараметры	- Структура	 - Расширение
// 
// Возвращаемое значение:
//  Произвольный - Найденное значение или Неопределено
//
Функция СторонаSABY_Получить(СторонаSABY, КлючПолучить, ДопПараметры = Неопределено) Экспорт
	Перем Результат; 
	
	Если КлючПолучить = "ИдентификаторЛица" Тогда 
	
		ПлоскиеДанныеСтороны = СторонаSABY_Выгрузить(СторонаSABY);
		Возврат ПлоскиеДанныеСтороны.ИдентификаторЛица;
		
	ИначеЕсли КлючПолучить = "КлючИдентификатора" Тогда 
		
		Результат = Сторона_КлючИдентификатора(СторонаSABY);  
		
	ИначеЕсли КлючПолучить = "Название" Тогда
		
		Результат = Сторона_НазваниеСтороны(СторонаSABY);
		
	ИначеЕсли КлючПолучить = "КлючСертификата" Тогда
		
		КлючИдентификатора	= Сторона_КлючИдентификатора(СторонаSABY);
		ПлоскиеДанные		= СторонаSABY_Выгрузить(СторонаSABY);
		Возврат ПлоскиеДанные[КлючИдентификатора];
		
	ИначеЕсли КлючПолучить = "ЗапретРедакций" Тогда
		
		Если ОбъектSABY_ЭтоТип(СторонаSABY, "ПрикладнойОбъектSaby") Тогда
			
			Результат = ПрикладнойОбъектSABY_Получить(СторонаSABY, "ЗапретРедакций") = Истина;
			
		Иначе
			
			СторонаSABY.Свойство("ЗапретРедакций", Результат);
			Результат = Результат = Истина;
			
		КонецЕсли;
				
	ИначеЕсли КлючПолучить = "ДополнительныеДанные" Тогда
		
		Если Не СторонаSABY.Свойство("ДополнительныеДанные", Результат) Тогда
			
			Результат = Новый Соответствие;
			СторонаSABY.Вставить("ДополнительныеДанные", Результат);
			
		КонецЕсли;
				
	ИначеЕсли ОбъектSABY_ЭтоТип(СторонаSABY, "ПрикладнойОбъектSABY") Тогда
		
		Результат = ПрикладнойОбъектSABY_Получить(СторонаSABY, КлючПолучить); 
	
	ИначеЕсли КлючПолучить = "Вид" Тогда 
					
		//Проверка СвФЛ(с инн, и без Инн) СфЮЛ СвИн
		Если СторонаSABY.Свойство("СвФЛ")
			И СторонаSABY.Свойство("ИНН") Тогда
			
			Возврат "Ип";
			
		ИначеЕсли СторонаSABY.Свойство("СвФЛ") Тогда
				 
			Возврат "Фл";
			
		ИначеЕсли СторонаSABY.Свойство("СвЮЛ") Тогда
			
			Возврат "Юл";
			
		ИначеЕсли СторонаSABY.Свойство("СвИН") Тогда
			
			Возврат "Ин";
				
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

//DynamicDirective

// Функция - выгружает данные стороны в определенном формате 
//
// Параметры:
//  ДанныеСтороны	 - экземпляр класса сторона	 - Структура СфЮл/СвФЛ
// 
// Возвращаемое значение:
//  Структура - формат с полями "ИНН, КПП, КодФилиала". Если чего-то не хватает, то ""
//
Функция СторонаSABY_Выгрузить(ДанныеСтороны, КлючВыгрузки = "") Экспорт
	Перем СвЮлФлСтороны;
	
	Если ДанныеСтороны = Неопределено Тогда
		
		Возврат Новый Структура;
	
	ИначеЕсли КлючВыгрузки = "3.01" Тогда
		
		// Режим выгрузки стороны для добавления в структуру данных
		ДанныеСтороныВыгружены = СоздатьКопиюОбъекта(ДанныеСтороны);
		ДанныеСтороныВыгружены.Удалить("_тип");
		ДанныеСтороныВыгружены.Удалить("_ид");
		ДанныеСтороныВыгружены.Удалить("_параметры");
		ДанныеСтороныВыгружены.Удалить("_данные");
		ДанныеСтороныВыгружены.Удалить("ДополнительныеДанные");
		ДанныеСтороныВыгружены.Удалить("Роль");
		
	ИначеЕсли КлючВыгрузки = "3.03" Тогда
		
		ДанныеСтороныВыгружены = СторонаSABY_Выгрузить(ДанныеСтороны, КлючВыгрузки = "3.01");
		Если ДанныеСтороныВыгружены.Свойство("Адрес") Тогда
			КопияСторонаАдрес = СоздатьКопиюОбъекта(ДанныеСтороныВыгружены.Адрес, Новый ФиксированнаяСтруктура("ГлубокаяКопия", Истина)); 
			Для Каждого адресТип из КопияСторонаАдрес Цикл 
				Если	адресТип.свойство("Тип")
					И	ЗначениеЗаполнено(адресТип.Тип) Тогда
					тип = адресТип.Тип;
					адресТип.Удалить("Тип");
				Иначе
					тип = "Юридический";
				КонецЕсли;
				Если Не адресТип.свойство(тип) Тогда
					адресТип.Вставить(тип, Новый структура());
					Если адресТип.свойство("АдрТекст") Тогда
						Если Не адресТип.свойство("АдрИно") И Не адресТип.свойство("АдрРФ") Тогда
							адресТип[тип].вставить("АдрТекст",адресТип.АдрТекст);
						КонецЕсли;
						адресТип.Удалить("АдрТекст");
					КонецЕсли;
					Если адресТип.свойство("АдрИно") Тогда
						адресТип[тип].вставить("АдрИно",адресТип.АдрИно);
						адресТип.Удалить("АдрИно");
					КонецЕсли;
					Если адресТип.свойство("АдрРФ") Тогда
						адресТип[тип].вставить("АдрРФ",адресТип.АдрРФ);
						адресТип.Удалить("АдрРФ");
					КонецЕсли;
				КонецЕсли;
			Конеццикла;
			ДанныеСтороныВыгружены.Вставить("Адрес", КопияСторонаАдрес);
		КонецЕсли;
		
		ДанныеСтороныВыгружены.Удалить("Представители");

	ИначеЕсли КлючВыгрузки = "объект" Тогда
		
		ДанныеСтороныВыгружены = ПрикладнойОбъектSABY_Выгрузить(ДанныеСтороны, КлючВыгрузки);
		
	Иначе
		
		ДанныеСтороныВыгружены = Новый Структура("ИНН, КПП, КодФилиала, БИН, ИИН, ИдентификаторЛица, ИностраннаяОрганизация, Наименование", 
												"", "", "", "", "", "", Ложь);
		Если		ДанныеСтороны = Неопределено Тогда
			
			Возврат ДанныеСтороныВыгружены;
			
		ИначеЕсли	ДанныеСтороны.Свойство("СвЮЛ", СвЮлФлСтороны) Тогда
						
			Если СвЮлФлСтороны.Свойство("КПП") Тогда
				
				ДанныеСтороныВыгружены.КПП = СвЮлФлСтороны.КПП;
				
			КонецЕсли;
					
		ИначеЕсли 	ДанныеСтороны.Свойство("СвИн", СвЮлФлСтороны) Тогда
			
			ДанныеСтороныВыгружены.ИностраннаяОрганизация = Истина;
			
			Если СвЮлФлСтороны.Свойство("КПП") Тогда
				
				ДанныеСтороныВыгружены.КПП = СвЮлФлСтороны.КПП;
				
			КонецЕсли;   
			
		ИначеЕсли	ДанныеСтороны.Свойство("СвФЛ", СвЮлФлСтороны) Тогда 
			
			//Есть СвФЛ 
			
		ИначеЕсли	ДанныеСтороны.Свойство("СвИП", СвЮлФлСтороны) Тогда 
			
			//Есть СвИП
			
		Иначе
			
			//Нет данных стороны
			ОшибкаНетДанных = НовыйСбисИсключение(, "РаботаСДокументами1С.СгенерироватьПакет", 724, "Сторона не определена", "Отсутствует ИНН/КПП");
			ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаНетДанных);
			
		КонецЕсли;
		
		Если		СвЮлФлСтороны.Свойство("ИНН") Тогда 
			
			ДанныеСтороныВыгружены.ИНН				= СвЮлФлСтороны.ИНН;
			ДанныеСтороныВыгружены.ИдентификаторЛица	= СвЮлФлСтороны.ИНН;
			
		ИначеЕсли	СвЮлФлСтороны.Свойство("БИН") Тогда 
			
			ДанныеСтороныВыгружены.БИН				= СвЮлФлСтороны.БИН;
			ДанныеСтороныВыгружены.ИдентификаторЛица	= СвЮлФлСтороны.БИН;
			
		ИначеЕсли	СвЮлФлСтороны.Свойство("ИИН") Тогда 
			
			ДанныеСтороныВыгружены.ИИН				= СвЮлФлСтороны.ИИН;
			ДанныеСтороныВыгружены.ИдентификаторЛица	= СвЮлФлСтороны.ИИН;
			
		ИначеЕсли	СвЮлФлСтороны.Свойство("ИдентификационныйНомер") Тогда
			
			// СвИн
			ДанныеСтороныВыгружены.ИдентификаторЛица	= СвЮлФлСтороны.ИдентификационныйНомер;
			
		Иначе
			
			//Нет данных стороны
			ДанныеСтороныВыгружены.ИдентификаторЛица	= Неопределено
			//ВызватьСбисИсключение(724, "РаботаСДокументами1С.СгенерироватьПакет",, "Сторона не определена", "Отсутствует идентификатор лица");  
			
		КонецЕсли;
		
		Если Не СвЮлФлСтороны.Свойство("Название", ДанныеСтороныВыгружены.Наименование) Тогда
			
			НаименованиеСформировать = "";
			Если СвЮлФлСтороны.Свойство("Фамилия") Тогда
				
				НаименованиеСформировать = НаименованиеСформировать + СвЮлФлСтороны.Фамилия		+ " ";
				
			КонецЕсли;
				
			Если СвЮлФлСтороны.Свойство("Имя") Тогда
				
				НаименованиеСформировать = НаименованиеСформировать + СвЮлФлСтороны.Имя			+ " ";
				
			КонецЕсли;

			Если СвЮлФлСтороны.Свойство("Отчество") Тогда
				
				НаименованиеСформировать = НаименованиеСформировать + СвЮлФлСтороны.Отчество	+ " ";
				
			КонецЕсли;
			
			ДанныеСтороныВыгружены.Наименование = СокрЛП(НаименованиеСформировать);
			
		КонецЕсли;

		Если	СвЮлФлСтороны.Свойство("КодФилиала")
			И	ЗначениеЗаполнено(СвЮлФлСтороны.КодФилиала) Тогда
			
			ДанныеСтороныВыгружены.КодФилиала = СвЮлФлСтороны.КодФилиала;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеСтороныВыгружены;
	
КонецФункции

//DynamicDirective

Процедура СторонаSABY_Установить(СторонаSABY, КлючВставки, ЗначениеВставки, ДопПараметры = Неопределено) Экспорт
	
	Если КлючВставки = "ДополнительныеДанные" Тогда
		
		ДопДанные = СторонаSABY_Получить(СторонаSABY, "ДополнительныеДанные");
		// TODO 3100 - удалить ДополнительныеДанные. Хранить свойства как параметры класса.
		Для Каждого КлючИЗначение Из ЗначениеВставки Цикл 
			
			ДопДанные.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			ПрикладнойОбъектSABY_Установить(СторонаSABY, КлючИЗначение.Ключ, КлючИЗначение.Значение, ДопПараметры);
			
		КонецЦикла;
		Возврат;

	ИначеЕсли КлючВставки = "ЗапретРедакций" Тогда
		
		ДопДанные = СторонаSABY_Получить(СторонаSABY, "ДополнительныеДанные");
		ДопДанные.Вставить(КлючВставки, ЗначениеВставки);
		
	КонецЕсли;
		
	ПрикладнойОбъектSABY_Установить(СторонаSABY, КлючВставки, ЗначениеВставки, ДопПараметры);
	
КонецПроцедуры

//DynamicDirective

Функция СторонаSABY_Пустая(СторонаSABY, ДопПараметры = Неопределено) Экспорт
	
	Если СторонаSABY = Неопределено Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
 	ИдентификационныйНомер = СторонаSABY_Получить(СторонаSABY, "ИдентификационныйНомер");
	ЭтоИностраннаяОрганизация = СторонаSABY_Получить(СторонаSABY, "ЭтоИностраннаяОрганизация");
	ВидСтороны = СторонаSABY_Получить(СторонаSABY, "Вид");
	
	Если Не ЗначениеЗаполнено(ИдентификационныйНомер) 
		И НЕ ВидСтороны = "Фл"
		И Не ВидСтороны = "Ин" Тогда
	
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
	
КонецФункции


