&НаКлиенте
Перем МестныйКэш Экспорт;
&НаКлиенте
Перем ЗакрыватьФорму;
&НаКлиенте
Перем МодульОбъектаКлиентМоя;
&НаКлиенте
Перем Кэш Экспорт;


#Область include_core2_vo2_ФормаПереходыПодробнее_ДокОтгрВх_ПолучитьМодульОбъекта
#КонецОбласти  

&НаКлиенте 
Процедура Показать(ПараметрыОткрытия = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура("Результат");
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ОткрытьМодально();
		Возврат;
	#КонецЕсли
	Открыть();

КонецПроцедуры


&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	МодульОбъектаКлиентМоя = МодульОбъектаКлиент();
	
	Если Статус = 3 Тогда
		МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"ОснованиеПолномочийОрганизации").Доступность = Истина;
	Иначе
		МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"ОснованиеПолномочийОрганизации").Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры  


&НаКлиенте
Процедура ПолучательГрузаПриИзменении(Элемент)
	
	МодульОбъектаКлиентМоя = МодульОбъектаКлиент();
	
	Если Строка(ПолучательГруза) = "1" Тогда
		МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"Фамилия").Доступность = Ложь;
		МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"Имя").Доступность = Ложь;
		МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"Отчество").Доступность = Ложь;
		МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"Должность").Доступность = Ложь;
		МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"ДолжностныеОбязанности").Доступность = Ложь;
		МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"ОрганизацияСотрудника").Доступность = Ложь;
		МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"ОснованиеПолномочийОрганизации1").Доступность = Ложь;
	Иначе 
		МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"Фамилия").Доступность = Истина;
		МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"Имя").Доступность = Истина;
		МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"Отчество").Доступность = Истина;
	    Если Строка(ПолучательГруза) = "2" Тогда
			МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"Должность").Доступность = Истина;
			МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"ДолжностныеОбязанности").Доступность = Истина;
			МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"ОрганизацияСотрудника").Доступность = Ложь;
			МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"ОснованиеПолномочийОрганизации1").Доступность = Ложь;
		ИначеЕсли Строка(ПолучательГруза) = "3" Тогда
			МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"Должность").Доступность = Истина;
			МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"ДолжностныеОбязанности").Доступность = Истина;
			МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"ОрганизацияСотрудника").Доступность = Истина;
			МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"ОснованиеПолномочийОрганизации1").Доступность = Истина;
		ИначеЕсли Строка(ПолучательГруза) = "4" Тогда
			МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"Должность").Доступность = Ложь;
			МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"ДолжностныеОбязанности").Доступность = Истина;	
			МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"ОрганизацияСотрудника").Доступность = Ложь;
			МодульОбъектаКлиентМоя.ПолучитьЭлементФормыОбработки(ЭтаФорма,"ОснованиеПолномочийОрганизации1").Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	//Сделать закрытие как на форме настроек посмотреть 8.2, 8.3
	ЗаполнитьСтруктуруПоДаннымФормы(); 
	Закрыть(ПараметрыФормы.Результат);
			
КонецПроцедуры    

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОбработчикЗавершения = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПослеЗакрытия", ЭтаФорма);
	НовыйОтложенноеДействие = МодульОбъектаКлиент().НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения", ОбработчикЗавершения));
	МодульОбъектаКлиент().ПодключитьОтложенноеДействие(НовыйОтложенноеДействие);
	
КонецПроцедуры

// Процедура - после закрытия почистить форму
//
// Параметры:
//  Аргумент	 - 	 - 
//  ДопПараметры - 	 - 
//
&НаКлиенте
Процедура ПослеЗакрытия(Аргумент=Неопределено, ДопПараметры=Неопределено) Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		//Вызвать описание оповещения о закрытии вручную.
		Если Не ОписаниеОповещенияОЗакрытии = Неопределено Тогда
			МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(ПараметрыФормы.Результат, ОписаниеОповещенияОЗакрытии);
		КонецЕсли;
	#КонецЕсли
	
	ПараметрыФормы				= Неопределено;
	ОписаниеОповещенияОЗакрытии	= Неопределено;
	ИзмененСпособИнтеграции 	= Ложь; 
	
КонецПроцедуры


&НаКлиенте
Функция ЗаполнитьСтруктуруПоДаннымФормы()
	
	СтруктураДляЗаполненияТитула = Новый Структура;
	СтруктураДляЗаполненияТитула.Вставить("Область",Область);
	СтруктураДляЗаполненияТитула.Вставить("Статус",Статус);
	СтруктураДляЗаполненияТитула.Вставить("Основания",Основания);
	СтруктураДляЗаполненияТитула.Вставить("Должность",Должность);
	СтруктураДляЗаполненияТитула.Вставить("ДолжностныеОбязанности",ДолжностныеОбязанности);
	СтруктураДляЗаполненияТитула.Вставить("Фамилия",Фамилия);
	СтруктураДляЗаполненияТитула.Вставить("Имя",Имя);
	СтруктураДляЗаполненияТитула.Вставить("Отчество",Отчество);
	СтруктураДляЗаполненияТитула.Вставить("ОснованиеПолномочийОрганизации",ОснованиеПолномочийОрганизации);
	СтруктураДляЗаполненияТитула.Вставить("ОрганизацияСотрудника",ОрганизацияСотрудника);
	СтруктураДляЗаполненияТитула.Вставить("ОснованиеПолномочийОрганизации1",ОснованиеПолномочийОрганизации1);
	СтруктураДляЗаполненияТитула.Вставить("ПолучательГруза",ПолучательГруза);
	
	ПараметрыФормы.Результат = СтруктураДляЗаполненияТитула;
		
КонецФункции
