
// Запускает подготовленные команды (не отправки), пока есть свободные потоки
&НаКлиенте
Процедура РезультатОтправки_ЗапуститьПрочиеКоманды(РезультатОтправки, ДопПараметры = Неопределено)
	
	КомандыПодготовлены	= ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "АсинхронныеКоманды");
	КомандыЗапущены		= Новый Массив;
	Для Каждого КлючИЗначениеКоманда Из КомандыПодготовлены Цикл
		
		Если РезультатОтправки.ПараметрыОтправки.КоличествоПотоков - РезультатОтправки.ПараметрыОтправки.Потоки.Количество() < 1 Тогда
			
			Прервать;
			
		КонецЕсли;
		
		Сбис3Команда = КлючИЗначениеКоманда.Значение;
		
		Попытка
			
			АсинхроннаяСбисКоманда_Выполнить(Сбис3Команда);
			КомандыЗапущены.Добавить(КлючИЗначениеКоманда.Ключ);
			
		Исключение
			
			//Упала отправка в поток, сами пропишем ошибку
			ОшибкаЗапускаКоманды	= НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.РезультатОтправки_ЗапуститьПрочиеКоманды");
			АсинхронноеСбисСобытие	= НовыйАсинхронноеСбисСобытие(Сбис3Команда.Идентификатор, ОшибкаЗапускаКоманды, "Error");
			АсинхроннаяСбисКоманда_ВызватьСобытие(Сбис3Команда, АсинхронноеСбисСобытие);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Для Каждого КомандаЗапущена Из КомандыЗапущены Цикл
		
		КомандыПодготовлены.Удалить(КомандаЗапущена);
		
	КонецЦикла;
	
КонецПроцедуры

#Область include_core2_vo2_Модуль_МодульОбъектаКлиент_Отправка_РезультатОтправки_private_Команды_УстановкаСценариев
#КонецОбласти

