
// Запускает подготовленные команды (не отправки), пока есть свободные потоки
&НаКлиенте
Процедура РезультатОтправки_ЗапуститьПрочиеКоманды(РезультатОтправки, ДопПараметры = Неопределено)
	
	КомандыПодготовлены	= ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "АсинхронныеКоманды");
	КомандыЗапущены		= Новый Массив;
	Для Каждого КлючИЗначениеКоманда Из КомандыПодготовлены Цикл
		
		Если РезультатОтправки.ПараметрыОтправки.КоличествоПотоков - РезультатОтправки.ПараметрыОтправки.Потоки.Количество() < 1 Тогда
			
			Прервать;
			
		КонецЕсли;
		
		Сбис3Команда = КлючИЗначениеКоманда.Значение;
		
		Попытка
			
			АсинхроннаяСбисКоманда_Выполнить(Сбис3Команда);
			КомандыЗапущены.Добавить(КлючИЗначениеКоманда.Ключ);
			
		Исключение
			
			//Упала отправка в поток, сами пропишем ошибку
			ОшибкаЗапускаКоманды	= НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.РезультатОтправки_ЗапуститьПрочиеКоманды");
			АсинхронноеСбисСобытие	= НовыйАсинхронноеСбисСобытие(Сбис3Команда.Идентификатор, ОшибкаЗапускаКоманды, "Error");
			АсинхроннаяСбисКоманда_ВызватьСобытие(Сбис3Команда, АсинхронноеСбисСобытие);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Для Каждого КомандаЗапущена Из КомандыЗапущены Цикл
		
		КомандыПодготовлены.Удалить(КомандаЗапущена);
		
	КонецЦикла;
	
КонецПроцедуры
	
&НаКлиенте
Процедура РезультатОтправки_СгенерироватьКомандыДляДействия(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыВходящие = Неопределено)
	
	Если ПараметрыВходящие = Неопределено Тогда
		
		СоставПакета = ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "СоставПакета");
		РезультатОтправки_ПроверитьИПодготовитьКоманду_СоставПакета(РезультатОтправки, ЦепочкаКомандОбработки, СоставПакета);
		
	ИначеЕсли	ЭтоТипСбис(ПараметрыВходящие, "СоставПакета") Тогда
		
		РезультатОтправки_ПроверитьИПодготовитьКоманду_СоставПакета(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыВходящие);
		
	ИначеЕсли	ТипЗнч(ПараметрыВходящие) = Тип("Структура") Тогда  

		РезультатОтправки_ПроверитьИПодготовитьКоманду_Прочее(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыВходящие);
		
	Иначе
		
		ТекстОшибки			= "Заданы неверные параметры для выполнения массовой операции.";
		ОшибкаПодготовки	= НовыйСбисИсключение(776, "МодульОбъектаКлиент.РезультатОтправки_СгенерироватьКомандыДляДействия",,,ТекстОшибки, ПараметрыВходящие);
		ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Ошибка", ОшибкаПодготовки);
		
	КонецЕсли;

	Если ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "Статус") = "Ошибка" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	РезультатОтправки_УстановитьОбъект(РезультатОтправки, ЦепочкаКомандОбработки)
			
КонецПроцедуры

// Процедура - подготовить команды, если есть готовый состав пакета
//
// Параметры:
//  РезультатОтправки		 - РезультатОтправки		 - текущая массовая операция
//  ЦепочкаКомандОбработки	 - ЦепочкаКомандОбработки	 - цепочка, для которой генерируются действия
//  СоставПакета			 - СоставПакета				 - сформированный, либо прочитанный ДокументСБИС
//  ДопПараметры			 - Структура/Неопределено	 - параметры - расширение
//		ИмяКоманды(Необязательный) - Строка - имя действия, которое надо выполнить с документом
//
&НаКлиенте
Процедура РезультатОтправки_ПроверитьИПодготовитьКоманду_СоставПакета(РезультатОтправки, ЦепочкаКомандОбработки, СоставПакета, ДопПараметры = Неопределено)
	
	Если			СоставПакета.Свойство("Ошибка") Тогда
	
		ПараметрыОшибки = Новый Структура("Подготовка, Исключение", Истина, СоставПакета.Ошибка);
		РезультатОтправки_ЦепочкаКомандОбработки_Ошибка(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыОшибки);
		
	ИначеЕсли Не	СоставПакета.Свойство("Вложение") Тогда
		
		ОшибкаПодготовки = НовыйСбисИсключение(726, "МодульОбъектаКлиент.РезультатОтправки_Асинх_ПодготовитьСтруктуруДокумента");
		ПараметрыОшибки = Новый Структура("Подготовка, Исключение", Истина, ОшибкаПодготовки);
		РезультатОтправки_ЦепочкаКомандОбработки_Ошибка(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыОшибки);
		
	ИначеЕсли СоставПакета.Свойство("Этап") Тогда
		
		// На документе есть этап. Это документ СБИС, у которого есть возможность выполнить действие
		ПараметрыПрочитать = РезультатОтправки_ПараметрыДля_ПрочитатьДокумент(РезультатОтправки, СоставПакета);
		ПараметрыВыполнить = РезультатОтправки_ПараметрыДля_ВыполнитьДействие(РезультатОтправки, СоставПакета, ДопПараметры);
		
		ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "РезультатОтправки_Асинх_ПрочитатьДокумент",	ПараметрыПрочитать);
		ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "РезультатОтправки_Асинх_ВыполнитьДействие",	ПараметрыВыполнить);
		
	Иначе
		
		// Установить отправку
		ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "СоставПакета", СоставПакета);
		ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "РезультатОтправки_Асинх_ПодготовитьОтправку", СоставПакета);

	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РезультатОтправки_ПроверитьИПодготовитьКоманду_Прочее(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыВходящие)
	
	Если	ПараметрыВходящие.Свойство("СоставПакета") Тогда
											
		// Есть состав пакета, значит это отправка, либо выполнение действия с документом СБИС
		Если		ЭтоТипСбис(ПараметрыВходящие.СоставПакета, "СоставПакета") Тогда
		
			РезультатОтправки_ПроверитьИПодготовитьКоманду_СоставПакета(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыВходящие.СоставПакета, ПараметрыВходящие);
			Возврат;
			
		ИначеЕсли	ПараметрыВходящие.Свойство("ИдентификаторСБИС") Тогда
			
			// Надо прочитать состав пакета и проверить, не является ли он черновиком
			ПараметрыПрочитать	= РезультатОтправки_ПараметрыДля_ПрочитатьДокумент(РезультатОтправки, ПараметрыВходящие.ИдентификаторСБИС);
			ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "ПроверитьЧерновик", Истина);
			ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "РезультатОтправки_Асинх_ПрочитатьДокумент",	ПараметрыПрочитать);
				
		КонецЕсли;
		
		// Подготовим запуск команды на Подготовить структуру. В случае, если это черновик команда удалится
		ПараметрыПодготовить = РезультатОтправки_ПараметрыДля_ПодготовитьСтруктуруДокумента(РезультатОтправки, ПараметрыВходящие);
		// Установить основание генерации, может потребоваться при обработке ошибок и пр.
		ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "ОснованиеГенерацииСоставПакета", ПараметрыПодготовить.СоставПакета);
		ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "РезультатОтправки_Асинх_ПодготовитьСтруктуруДокумента", ПараметрыПодготовить);
 			
	Иначе
		
		Возврат;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция РезультатОтправки_ПараметрыДля_ВыполнитьДействие(РезультатОтправки, СоставПакета, ПараметрыВходящие = Неопределено)
	
	ИдентификаторПакета = СоставПакета_Идентификатор(СоставПакета, "СБИС");
	
	Если   Не	ПараметрыВходящие = Неопределено
		И		ПараметрыВходящие.Свойство("ИмяКоманды") Тогда
		
		// Задана команда для ВыполнитьДействие
		ПараметрыВыполнить	= Новый Структура("ИмяКоманды", ПараметрыВходящие.ИмяКоманды);
		
	ИначеЕсли СоставПакета_Получить(СоставПакета, "ЭтоЧерновик") Тогда			
		
		// Черновик запускаем по регламенту запуска в ДО
		ПараметрыВыполнить	= Новый Структура("ИмяКоманды", "Отправить");
			
	Иначе
		
		// Запустить первое (основное) действие
		ПараметрыВыполнить	= Новый Структура;
		
	КонецЕсли;
				
	Возврат ПараметрыВыполнить;
	
КонецФункции
	
&НаКлиенте
Функция РезультатОтправки_ПараметрыДля_ПрочитатьДокумент(РезультатОтправки, СоставПакета)
	
	Если ТипЗнч(СоставПакета) = Тип("Строка") Тогда
		
		// Это ИД СБИС документа
		ПараметрыПрочитать	=  ПрочитатьДокументСБИС_Параметры(СоставПакета);
	
	Иначе
		
		ПараметрыПакета = СоставПакета_Получить(СоставПакета, "Параметры");
		ЭтоПолныйПакет	=	Не	ПараметрыПакета = Неопределено
							И	(	ПараметрыПакета.Свойство("Разобран")
								И	ПараметрыПакета.Разобран
							Или (	ПараметрыПакета.Свойство("Прочитан")
								И	ПараметрыПакета.Прочитан));
								
		Если ЭтоПолныйПакет Тогда
			
			// Состав пакета - прочитанный документ
			ПараметрыПрочитать	= СоставПакета;
			
		Иначе
			
			// Надо прочитать состав пакета
			ИдентификаторПакета = СоставПакета_Идентификатор(СоставПакета, "СБИС");
			ПараметрыПрочитать	=  ПрочитатьДокументСБИС_Параметры(ИдентификаторПакета);
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат ПараметрыПрочитать;
	
КонецФункции

&НаКлиенте
Функция РезультатОтправки_ПараметрыДля_ПодготовитьСтруктуруДокумента(РезультатОтправки, ПараметрыВходящие)
	
	// Это не готовый документ, проверить запуск подготовки документа
	ПараметрыПодготовить = Новый Структура("СоставПакета, МодульПодготовки, ИмяПослеФормирования", ПараметрыВходящие.СоставПакета);
	Если Не ПараметрыВходящие.Свойство("МодульПодготовки", ПараметрыПодготовить.МодульПодготовки) Тогда
		ПараметрыПодготовить.МодульПодготовки = РезультатОтправки.ПараметрыОтправки.МодульПодготовки;
	КонецЕсли;
	
	ПараметрыПодготовить.ИмяПослеФормирования = РезультатОтправки.ПараметрыОтправки.ИмяРазделаОтправки;
	
	Возврат ПараметрыПодготовить;
	
КонецФункции

