
// Запускает подготовленные команды (не отправки), пока есть свободные потоки
&НаКлиенте
Процедура РезультатОтправки_ЗапуститьПрочиеКоманды(РезультатОтправки, ДопПараметры = Неопределено)
	
	КомандыПодготовлены	= ЦепочкаКомандОбработки_ПолучитьДанные(РезультатОтправки, "АсинхронныеКоманды");
	КомандыЗапущены		= Новый Массив;
	Для Каждого КлючИЗначениеКоманда Из КомандыПодготовлены Цикл
		
		Если РезультатОтправки.ПараметрыОтправки.КоличествоПотоков - РезультатОтправки.ПараметрыОтправки.Потоки.Количество() < 1 Тогда
			
			Прервать;
			
		КонецЕсли;
		
		Сбис3Команда = КлючИЗначениеКоманда.Значение;
		
		Попытка
			
			АсинхроннаяСбисКоманда_Выполнить(КлючИЗначениеКоманда.Значение);
			КомандыЗапущены.Добавить(КлючИЗначениеКоманда.Ключ);
			
		Исключение
			
			//Упала отправка в поток, сами пропишем ошибку
			ОшибкаЗапускаКоманды	= НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.РезультатОтправки_ЗапуститьПрочиеКоманды");
			АсинхронноеСбисСобытие	= НовыйАсинхронноеСбисСобытие(Сбис3Команда.Идентификатор, ОшибкаЗапускаКоманды, "Error");
			АсинхроннаяСбисКоманда_ВызватьСобытие(Сбис3Команда, АсинхронноеСбисСобытие);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Для Каждого КомандаЗапущена Из КомандыЗапущены Цикл
		
		КомандыПодготовлены.Удалить(КомандаЗапущена);
		
	КонецЦикла;
	
КонецПроцедуры
	
&НаКлиенте
Процедура РезультатОтправки_СгенерироватьКомандыДляДействия(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыВходящие = Неопределено)
	
	Если ПараметрыВходящие = Неопределено Тогда
		
		СоставПакета = ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "СоставПакета");
		РезультатОтправки_ПроверитьИПодготовитьКомандуДляСоставаПакета(РезультатОтправки, ЦепочкаКомандОбработки, СоставПакета);
		
	ИначеЕсли ЭтоТипСбис(ПараметрыВходящие, "СоставПакета") Тогда
		
		РезультатОтправки_ПроверитьИПодготовитьКомандуДляСоставаПакета(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыВходящие);
		
	ИначеЕсли	ТипЗнч(ПараметрыВходящие) = Тип("Структура") Тогда
		
		Если	ПараметрыВходящие.Свойство("СоставПакета") Тогда
			
			// Есть состав пакета, значит это отправка, либо выполнение действия с документом СБИС
			Если ЭтоТипСбис(ПараметрыВходящие.СоставПакета, "СоставПакета") Тогда
			
				РезультатОтправки_ПроверитьИПодготовитьКомандуДляСоставаПакета(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыВходящие);
				
			Иначе
				
				// Если стоит опция создания черновиков при открытии документов, то запускаем их в ДО. Иначе это обычная отправка.
				ЭтоЧерновик =	ПолучитьЗначениеПараметраСбис("СоздаватьЧерновик")
							И	ПараметрыВходящие.Свойство("Статус")
							И	ПараметрыВходящие.Свойство("ИдПакета")
							И	ПараметрыВходящие.Статус = 0
							И	ЗначениеЗаполнено(ПараметрыВходящие.ИдПакета);
				
				Если ЭтоЧерновик Тогда			
					
					// Это черновик, надо прочитать документ и работать от черновика
					ПараметрыПрочитать	= ПрочитатьДокументСБИС_Параметры(ПараметрыВходящие.ИдПакета);
					ПараметрыВыполнить	= Новый Структура("ИмяКоманды", "Отправить");
					ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "РезультатОтправки_Асинх_ПрочитатьДокумент",	ПараметрыПрочитать);
					ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "РезультатОтправки_Асинх_ВыполнитьДействие",	ПараметрыВыполнить);
					
				Иначе
					
					// Это подготовка документа, запустить его формирование
					ПараметрыПодготовить = Новый Структура("СоставПакета, МодульПодготовки, ИмяПослеФормирования", ПараметрыВходящие.СоставПакета);
					Если Не ПараметрыВходящие.Свойство("МодульПодготовки", ПараметрыПодготовить.МодульПодготовки) Тогда
						ПараметрыПодготовить.МодульПодготовки = РезультатОтправки.ПараметрыОтправки.МодульПодготовки;
					КонецЕсли;
					
					ПараметрыПодготовить.ИмяПослеФормирования = РезультатОтправки.ПараметрыОтправки.ИмяРазделаОтправки;
					
					ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "РезультатОтправки_Асинх_ПодготовитьСтруктуруДокумента", ПараметрыПодготовить);
					
				КонецЕсли;			
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПараметрыВходящие.Свойство("ИмяКоманды") Тогда
			
			КомандаБЛВыбрана	= Истина;
			СоставПакета		= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "СоставПакета");
			
			Если СоставПакета = Неопределено Тогда
				
				// Документ не определен. Надо прочитать.
				ПараметрыПрочитать = ПрочитатьДокументСБИС_Параметры(ПараметрыВходящие.ИдПакета, ПараметрыВходящие);
				ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "РезультатОтправки_Асинх_ПрочитатьДокумент", ПараметрыПрочитать);
				
			КонецЕсли;
			
			ПараметрыВыполнитьДействие = Новый Структура("ИмяКоманды", ПараметрыВходящие.ИмяКоманды);
			ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "РезультатОтправки_Асинх_ВыполнитьДействие", ПараметрыВыполнитьДействие);

		КонецЕсли;
		
	Иначе
		
		// Неопределено
		Возврат;
		
	КонецЕсли;
	
	РезультатОтправки_УстановитьОбъект(РезультатОтправки, ЦепочкаКомандОбработки)
			
КонецПроцедуры

&НаКлиенте
Процедура РезультатОтправки_ПроверитьИПодготовитьКомандуДляСоставаПакета(РезультатОтправки, ЦепочкаКомандОбработки, СоставПакета)
	
	Если СоставПакета.Свойство("Ошибка") Тогда
	
		ПараметрыОшибки = Новый Структура("Подготовка, Исключение", Истина, СоставПакета.Ошибка);
		РезультатОтправки_ОбработатьОшибку(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыОшибки);
		
	ИначеЕсли Не СоставПакета.Свойство("Вложение") Тогда
		
		ОшибкаПодготовки = НовыйСбисИсключение(726, "МодульОбъектаКлиент.РезультатОтправки_Асинх_ПодготовитьСтруктуруДокумента");
		ПараметрыОшибки = Новый Структура("Подготовка, Исключение", Истина, ОшибкаПодготовки);
		РезультатОтправки_ОбработатьОшибку(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыОшибки);
		
	Иначе
		
		ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "РезультатОтправки_Асинх_ПодготовитьОтправку", СоставПакета);
				
	КонецЕсли;
		
КонецПроцедуры

