
// Подготавливаем параметры для прикладной статистики
// по отправке документов для каждого вложения пакета
//
// Параметры:
//  РезультатОтправки	 - Структура	 - Объект класса РезультатОтправки
//  СоставПакета		 - Структура	 - Объект класса СоставПакета
//
&НаКлиенте
Процедура РезультатОтправки_ПодготовитьЗаписиПрикладнойСтатистики(РезультатОтправки, СоставПакета)
	
	// На случай, если состав пакета не соответствует требованиям, чтоб не падала ошибка
	Если Не (ТипЗнч(СоставПакета) = Тип("Структура")
		И СоставПакета.Свойство("Вложение")) Тогда
		Возврат;
	КонецЕсли;
	
	// Добавление для записи в прикладную статистику отправленных вложений
	Для Каждого Вложение Из СоставПакета.Вложение Цикл
		
		// Если вложение доблавлено вручную без привязки к документу 1С
		Если Не (Вложение.Свойство("Документы1С")
			И ТипЗнч(Вложение.Документы1С) = Тип("СписокЗначений")) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Документ1С Из Вложение.Документы1С Цикл
			
			// Формирование записи в стату
			ТипДокумента	= СсылочныйТипСтрокой(Документ1С.Значение);
			ТипВложения		= ВложениеСБИС_Получить(Вложение, "ТипВложения");
			Если ТипВложения = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Действие = ТипВложения + " - " + Сред(ТипДокумента, Найти(ТипДокумента, ".") + 1);

			ПараметрыЗаписи = Новый Структура("Действие, Контекст", Действие, "Отправка документов");
			ЗаписьПрикладнойСтатистики = НовыйЗаписьПрикладнойСтатистики(Действие, "Отправка документов");
			ПрикладнаяСтатистика_Добавить(РезультатОтправки.ПрикладнаяСтатистика, ЗаписьПрикладнойСтатистики);
			
		КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОтправки_ОтправитьЗаписиПрикладнойСтатистики(РезультатОтправки)
	
	// Нет узла с прикладной статистикой, почему-то
	ДоступныСерверныеНастройки = ПолучитьЗначениеПараметраСБИС("ДоступныСерверныеНастройки");
	Если Не РезультатОтправки.Свойство("ПрикладнаяСтатистика")
		ИЛИ НЕ ДоступныСерверныеНастройки Тогда
		Возврат;
	КонецЕсли;  
	    //определить дейтсвие 
	//Сформировать ПараметрыСтатистики для метода          
	ПараметрыСтатистики = Новый Структура;
	ПараметрыСтатистики.Вставить("РезультатОтправки",РезультатОтправки);
	ПараметрыСтатистики.Вставить("Действие","Отправка");

	ДопПараметры = Новый Структура("Контекст", "Отправка документов");	
	СбисСтатистика_СформироватьИЗаписать(ПараметрыСтатистики, ДопПараметры = Неопределено);
	
	
КонецПроцедуры

