
// Процедура - обработка ошибки, установленной на цепочке
//
// Параметры:
//  РезультатОтправки		 - РезультатОтправки		 - структура отправки
//  ЦепочкаКомандОбработки	 - ЦепочкаКомандОбработки	 - по которой возникла ошибка
//  ПараметрыОшибки			 - Структура				 - описание возникшей ошибки - фатальная/поготовка/авторизация
//
&НаКлиенте
Процедура РезультатОтправки_ЦепочкаКомандОбработки_Ошибка(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыОшибки) Экспорт
	Перем лОшибкаФатальная;

	ИдОтправки		= ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "Идентификатор");
	СоставПакета	= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "СоставПакета");
	ДокументСбис	= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "ДокументСБИС");
	СбисИсключение	= ПараметрыОшибки.Исключение;
	
	Если СбисИсключение = Неопределено Тогда
		
		СбисИсключение	= НовыйСбисИсключение("Неизвестная ошибка при обработке ответов.", "МодульОбъектаКлиент.РезультатОтправки_ОбработатьОшибку");
		
	КонецЕсли;
	
	ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Ошибка", СбисИсключение);
	РезультатОтправки.НаЗаписьСтатусов.Ошибки.Вставить(ИдОтправки, СбисИсключение);

	ТекстОшибки				= СбисИсключение.message;
	ОписаниеРасширенное		= СбисИсключение.details;	
	ЭлементСписка			= РезультатОтправки.ТипыОшибок.НайтиПоЗначению(ТекстОшибки);

	РезультатОтправки.Ошибок = РезультатОтправки.Ошибок + 1;
	
	Если ЭлементСписка = Неопределено Тогда
		РезультатОтправки.ТипыОшибок.Добавить(ТекстОшибки, 1);
	Иначе
		ЭлементСписка.Представление = Число(ЭлементСписка.Представление) + 1;
	КонецЕсли;
	
	Если	ПараметрыОшибки.Свойство("Подготовка")
		И	ПараметрыОшибки.Подготовка Тогда
		//Ошибка из пакета документов, до отправкиподготовки
		РезультатОтправки.Счетчики.ОшибокПодготовки	= РезультатОтправки.Счетчики.ОшибокПодготовки + 1;
	Иначе
		РезультатОтправки.Счетчики.ОшибокОтправки	= РезультатОтправки.Счетчики.ОшибокОтправки + 1;		
	КонецЕсли;
	
	ЭлементСоответствия = РезультатОтправки.ДетализацияОшибок.Получить(ТекстОшибки);
	Если ЭлементСоответствия = Неопределено Тогда
		ЭлементСоответствия = Новый Массив;
		РезультатОтправки.ДетализацияОшибок.Вставить(ТекстОшибки, ЭлементСоответствия);
	КонецЕсли;
	
	//Дополнить детализацию по документам 1С
	Если Не СоставПакета = Неопределено Тогда
		
		Для Каждого Вложение Из СоставПакета.Вложение Цикл
			Если Не Вложение.Свойство("Документы1С") Тогда
				Продолжить;
			КонецЕсли;
			Для Каждого Документ1С Из Вложение.Документы1С Цикл
				
				СтрокаВСоответствие = Новый Структура("ОбработанДокумент1С, Сообщение, СтруктураОшибки", Документ1С.Значение, ОписаниеРасширенное, СбисИсключение); 
				СтрокаВСоответствие.Вставить("ИдВложения",		ВложениеСБИС_Получить(Вложение, "Идентификатор")); 
				СтрокаВСоответствие.Вставить("ДокументСБИС",	ВложениеСБИС_Получить(Вложение, "Название"));

				СтрокаВСоответствие.Вставить("ИДПакета",		СоставПакета_Получить(СоставПакета, "ИдентификаторСБИС"));
				СтрокаВСоответствие.Вставить("Регламент",		СоставПакета_Получить(СоставПакета, "РегламентНазвание"));
				ЭлементСоответствия.Добавить(СтрокаВСоответствие);
				
			КонецЦикла;
		КонецЦикла;
		
	ИначеЕсли Не ДокументСбис = Неопределено Тогда
			
		СтрокаВСоответствие = Новый Структура("Сообщение, СтруктураОшибки", ОписаниеРасширенное, СбисИсключение); 
		СтрокаВСоответствие.Вставить("ИдВложения",		ДокументСбис.Идентификатор); 
		СтрокаВСоответствие.Вставить("ДокументСБИС",	ДокументСбис.Название);

		СтрокаВСоответствие.Вставить("ИДПакета",		ДокументСбис.Идентификатор);
		СтрокаВСоответствие.Вставить("Регламент",		ДокументСбис.Регламент.Название);
		ЭлементСоответствия.Добавить(СтрокаВСоответствие);
		
	ИначеЕсли	СбисИсключение.ext_code = "002" 
			Или	СбисИсключение.ext_code = "001" Тогда
		
		// Отправка черновика, но не удалось прочитать документ.
		СоставПакетаГенерируемый	= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "ОснованиеГенерацииСоставПакета");
		ОснованиеДляДетализации		= СоставПакетаГенерируемый[0].Значение;
		СтрокаВСоответствие			= Новый Структура("ОбработанДокумент1С, Сообщение, СтруктураОшибки", ОснованиеДляДетализации, ОписаниеРасширенное, СбисИсключение); 
		СтрокаВСоответствие.Вставить("ИдВложения",		""); 
		СтрокаВСоответствие.Вставить("ДокументСБИС",	"");
		ЭлементСоответствия.Добавить(СтрокаВСоответствие);

	КонецЕсли;
	
	Если	Не	ПараметрыОшибки.Свойство("Фатальная", лОшибкаФатальная)
		Или	Не	лОшибкаФатальная	Тогда
		
		//Считаем нефатальные ошибки по коду и детализации. Если накопится ряд однотипных, без ответов то прерываем отправку.
		СоответствиеНФО = Неопределено;
		Если Не РезультатОтправки.ПараметрыОтправки.Свойство("НефатальныеОшибки", СоответствиеНФО) Тогда
			СоответствиеНФО = Новый Соответствие;
			РезультатОтправки.ПараметрыОтправки.Вставить("НефатальныеОшибки", СоответствиеНФО);
		КонецЕсли;
		СоответствиеПоКоду			= СоответствиеНФО.Получить(СбисИсключение.code);
		СоответствиеПоДетализации	= СоответствиеНФО.Получить(СбисИсключение.details);
		Если СоответствиеПоКоду = Неопределено Тогда
			СоответствиеПоКоду = 0;
		КонецЕсли;
		Если СоответствиеПоДетализации = Неопределено Тогда
			СоответствиеПоДетализации = 0;
		КонецЕсли;
		СоответствиеПоКоду			= СоответствиеПоКоду + 1;
		СоответствиеПоДетализации	= СоответствиеПоДетализации + 1;
		ИсключениеПрерывания		= Неопределено;
		Если		СоответствиеПоКоду >= 10 Тогда
			
			ИсключениеПрерывания = НовыйСбисИсключение(,"МодульОбъектаКлиент.РезультатОтправки_ОбработатьОшибку",
														700, 
														"Повторите попытку позже.", 
														"Получен ряд однотипных ошибок: " + СбисИсключение.message, 
														Новый Структура("Ошибка", СбисИсключение));
		ИначеЕсли	СоответствиеПоДетализации >= 5 Тогда
			ИсключениеПрерывания = НовыйСбисИсключение(,"МодульОбъектаКлиент.РезультатОтправки_ОбработатьОшибку",
														700, 
														"Повторите попытку позже.", 
														"Получен ряд одинаковых ошибок: " + СбисИсключение.details, 
														Новый Структура("Ошибка", СбисИсключение));
		КонецЕсли;
		Если Не ИсключениеПрерывания = Неопределено Тогда
			
			//Если накоплено n нефатальных ошибок (не получиили ниодного успешного ответа, то прерываем отправку)
			РезультатОтправки_ОбработатьФатальнуюОшибка(РезультатОтправки, ИсключениеПрерывания);
			
		КонецЕсли;
		
		СоответствиеНФО.Вставить(СбисИсключение.code,		СоответствиеПоКоду);
		СоответствиеНФО.Вставить(СбисИсключение.details,	СоответствиеПоДетализации);
		
	ИначеЕсли лОшибкаФатальная Тогда
		
		РезультатОтправки_ОбработатьФатальнуюОшибка(РезультатОтправки, СбисИсключение);
		
	КонецЕсли;

	//Надо прописать на запись статусы по пакету. Сам статус появится в момент записи РезультатОтправки_ЗаписатьНакопленныеСтатусы
	РезультатОтправки_ПодготовитьСтатусыПоИтогуОтправки(РезультатОтправки, ЦепочкаКомандОбработки);
		
КонецПроцедуры

