
//DynamicDirective

// Функция - Get метод для исключений
//
// Параметры:
//  СбисИсключение	 - СбисИсключение	 - текущая ошибка
//  КлючПолучить	 - Строка			 - ключ, значение которого надо извлечь из класса
// 
// Возвращаемое значение:
//  Произвольный - значение по ключу
//
Функция СбисИсключение_Получить(СбисИсключение, КлючПолучить) Экспорт 
	
	Если		КлючПолучить = "Данные" Тогда
		
		Возврат СбисИсключение.data;
		
	ИначеЕсли	КлючПолучить = "Код" Тогда
		
		Возврат СбисИсключение.code;
		
	ИначеЕсли	КлючПолучить = "ДополнительныйКод" Тогда
		
		Возврат СбисИсключение.extCode;

	ИначеЕсли	КлючПолучить = "ПолныйКод" Тогда
		
		Возврат Число(Строка(СбисИсключение.code) + Строка(СбисИсключение.extCode));
		
	КонецЕсли;
	
КонецФункции

//DynamicDirective

// Функция - Dump метод для исключений
//
// Параметры:
//  СбисИсключение	 - СбисИсключение	 - текущая ошибка
//  ВариантВыгрузки	 - Строка			 - ключ, как надо выгрузить нашу ошибку
// 
// Возвращаемое значение:
//  Произвольный - значение по ключу
//
Функция СбисИсключение_Выгрузить(СбисИсключение, ВариантВыгрузки = "Исключение", ДопПараметры = Неопределено) Экспорт 
	
	КлючПроверить = НРег(ВариантВыгрузки);
	Если ТипЗнч(СбисИсключение) = Тип("ИнформацияОбОшибке") Тогда
		
		// Информация об ошибке, собрать экземпляр для выгрузки
		СбисИсключениеВходящее = НовыйСбисИсключение(СбисИсключение, "МодульОбъектаКлиент.СбисИсключение_Выгрузить");
		
	ИначеЕсли ОбъектSABY_ЭтоТип(СбисИсключение, "СбисИсключение") Тогда
		
		СбисИсключениеВходящее	= СбисИсключение;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;	
		
	Если КлючПроверить = "исключение" Тогда
		
		Результат = СбисИсключение_ВСтрокуСервер(СбисИсключениеВходящее);
		
	ИначеЕсли КлючПроверить = "сообщение" Тогда
		
		Результат = СбисИсключениеВходящее.message;
		
		Если Результат = Неопределено Тогда
			
			Результат = "";
			
		КонецЕсли;
		
		Если	СбисИсключениеВходящее.Свойство("details")
			И	СбисИсключениеВходящее.message <> СбисИсключениеВходящее.details Тогда 
			Результат = Результат + " (" + СбисИсключениеВходящее.details + ")";
		КонецЕсли;
		
	ИначеЕсли КлючПроверить = "полныйтекст" Тогда
		
		Возврат яСбисИсключение_Выгрузить_ПолныйТекст(СбисИсключениеВходящее);
		
	ИначеЕсли КлючПроверить = "html" Тогда
		
		Возврат "<HTML><BODY scroll=no>" + СбисИсключениеВходящее.message + "</br>" + СбисИсключениеВходящее.details + "</BODY></HTML>";

	ИначеЕсли КлючПроверить = "extexception" Тогда
		
		Возврат яСбисИсключение_Выгрузить_ExtException(СбисИсключение, ДопПараметры);

	Иначе
		
		Возврат Неопределено;
	
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//DynamicDirective

// Метод устарел и будет удален в 26.3100!
Функция СбисИсключение_Представление(СбисИсключениеВходящее, КлючПредставления = "Исключение") Экспорт
	
	Возврат СбисИсключение_Выгрузить(СбисИсключениеВходящее, КлючПредставления);
	
КонецФункции
	
//DynamicDirective

// Метод устарел и будет удален в 26.3100!
Функция СбисИсключение_ВСтроку(СбисИсключение, ДопПарамеры = Неопределено) Экспорт 

	Если	Не ТипЗнч(СбисИсключение) = Тип("Структура")
		Или Не СбисИсключение.Свойство("code") 
		Или Не СбисИсключение.Свойство("details") Тогда
		
		ИсключениеВСтроку = НовыйСбисИсключение(СбисИсключение, ДопПарамеры);
		
	Иначе
		
		ИсключениеВСтроку = СбисИсключение;
		
	КонецЕсли;
	
	Возврат СбисИсключение_ВСтрокуСервер(ИсключениеВСтроку, ДопПарамеры);

КонецФункции

