
//DynamicDirective

// Функция - конструктор исключения
//
// Параметры:
//  ВозникшаяОшибка		 - СбисИсключение/ExtSysException/ИнформацияОбОшибке/Структура/Строка/Число	 - описание возникшей проблемы
//  ОснованиеДляОшибки	 - СбисИсключение/Строка	 - что именно пошло не так. 
//		Это может быть готовое исключение, которое надо добавить в текущую проблему
//		Это может быть строка с именем метода где возникла проблема. 
//			Тогда основная ошибка формируется по прочим полям, 
//			а возникшая ошибка добавляется к новой в виде записи в стек 
//			с возможным переопределеним свойств кода, текста, детализации
//  СбисКод				 - Число/Неопределено		 - устанавливаемый код ошибки.
//		Не используется, если ОснованиеДляОшибки готовое исключение
//  СбисСообщение		 - Строка/Неопределено		 - устанавливаемое сообщение для ошибки. Если не задано явно, то определяется по коду и расширенному коду.
//		Не используется, если ОснованиеДляОшибки готовое исключение
//  СбисДетализация		 - Строка/Неопределено		 - устанавливаемое расширенное сообщение для ошибки. Если не задано явно, то берется сообщение. 
//		Не используется, если ОснованиеДляОшибки готовое исключение
//  СбисДанные			 - Структура/Неопределено	 - устанавливаемые данные ошибки. Если не задано явно, то берется от возникшей ошибки.
//		Не используется, если ОснованиеДляОшибки готовое исключение
//  СбисХелп			 - Строка/Неопределено		 - ссылка на Help.
//		Не используется, если ОснованиеДляОшибки готовое исключение
// 
// Возвращаемое значение:
//  СбисИсключение - экземпляр класса ошибки.
//
Функция НовыйСбисИсключение(ВозникшаяОшибка	= Неопределено,	ОснованиеДляОшибки	= Неопределено,
							СбисКод			= Неопределено,	СбисСообщение		= Неопределено, СбисДетализация = Неопределено, СбисДанные = Неопределено, СбисХелп = Неопределено) Экспорт
							
	ОсновнаяОшибка = NewExtException(ВозникшаяОшибка, ОснованиеДляОшибки, СбисКод, СбисСообщение, СбисДетализация, СбисДанные);
	ОбъектSABY_Установить(ОсновнаяОшибка, "Тип", "СбисИсключение");
	
	// Пока в формате дублирования. По-идее, надо перевести все на "detail". Но надо смотреть доработки
	ОсновнаяОшибка.Вставить("details",	ОсновнаяОшибка.detail); 
	Возврат ОсновнаяОшибка;
	
КонецФункции

//DynamicDirective

// Функция - Get метод для исключений
//
// Параметры:
//  СбисИсключение	 - СбисИсключение	 - текущая ошибка
//  КлючПолучить	 - Строка			 - ключ, значение которого надо извлечь из класса
// 
// Возвращаемое значение:
//  Произвольный - значение по ключу
//
Функция СбисИсключение_Получить(СбисИсключение, КлючПолучить) Экспорт
	
	Если		КлючПолучить = "Данные" Тогда
		
		Возврат СбисИсключение.data;
		
	ИначеЕсли	КлючПолучить = "Код" Тогда
		
		Возврат ExtException_Get(СбисИсключение, "OldCodes").code;
		
	ИначеЕсли	КлючПолучить = "ДополнительныйКод" Тогда
		
		Возврат ExtException_Get(СбисИсключение, "OldCodes").extCode;

	ИначеЕсли	КлючПолучить = "ПолныйКод" Тогда
		
		Возврат СбисИсключение.code;
		
	КонецЕсли;
	
КонецФункции

//DynamicDirective

// Функция - Dump метод для исключений
//
// Параметры:
//  СбисИсключение	 - СбисИсключение	 - текущая ошибка
//  ВариантВыгрузки	 - Строка			 - ключ, как надо выгрузить нашу ошибку. Исключение, Сообщение, ПолныйТекст, html, extexception
// 
// Возвращаемое значение:
//  Произвольный - значение по ключу
//
Функция СбисИсключение_Выгрузить(СбисИсключение, ВариантВыгрузки = "Исключение", ДопПараметры = Неопределено) Экспорт
	
	СценарийВыгрузки = ВариантВыгрузки;
	Если ВариантВыгрузки = "КомандаДляРешенияПроблемы" Тогда
		
		ПараметрыСценарийВыгрузки = ExtException_Dump(СбисИсключение, "hint", ДопПараметры);
		Возврат НовыйСбисОписаниеОповещения(
			ПараметрыСценарийВыгрузки.ИмяПроцедуры,
			МодульОбъектаКлиентСервер(),
			ПараметрыСценарийВыгрузки.ДополнительныеПараметры);
		
	КонецЕсли;
		
	Возврат ExtException_Dump(СбисИсключение, СценарийВыгрузки, ДопПараметры);
	
КонецФункции

//DynamicDirective

// Метод устарел и будет удален в 26.3100!
Функция СбисИсключение_Представление(СбисИсключениеВходящее, КлючПредставления = "Исключение") Экспорт
	
	Возврат СбисИсключение_Выгрузить(СбисИсключениеВходящее, КлючПредставления);
	
КонецФункции
	
//DynamicDirective

// Метод устарел и будет удален в 26.3100!
Функция СбисИсключение_ВСтроку(СбисИсключение, ДопПарамеры = Неопределено) Экспорт

	Если	Не ТипЗнч(СбисИсключение) = Тип("Структура")
		Или Не СбисИсключение.Свойство("code") 
		Или Не СбисИсключение.Свойство("details") Тогда
		
		ИсключениеВСтроку = НовыйСбисИсключение(СбисИсключение, ДопПарамеры);
		
	Иначе
		
		ИсключениеВСтроку = СбисИсключение;
		
	КонецЕсли;
	
	Возврат СбисИсключение_ВСтрокуСервер(ИсключениеВСтроку, ДопПарамеры);

КонецФункции

//DynamicDirective

//Процедура генерирует и вызывает ExtSysException(СбисИсключение)
Процедура ВызватьСбисИсключение(БазоваяОшибка=Неопределено, СбисИмяКоманды,
								СбисКод=Неопределено, СбисСообщение=Неопределено, СбисДетализация=Неопределено, СбисДамп=Неопределено, СбисХелп=Неопределено) Экспорт
								
	ИсключениеВызов = НовыйСбисИсключение(БазоваяОшибка, СбисИмяКоманды, СбисКод, СбисСообщение, СбисДетализация, СбисДамп, СбисХелп);
	ВызватьИсключение(ExtException_Dump(ИсключениеВызов));
	
КонецПроцедуры

