
//DynamicDirective

// Функция - Dump метод для исключений как полный текст
//
// Параметры:
//  СбисИсключение	 - СбисИсключение	 - текущая ошибка
// 
// Возвращаемое значение:
//  Строка - значение по ключу
//
Функция яСбисИсключение_Выгрузить_ПолныйТекст(СбисИсключение) 
	
	Результат = СбисИсключение.message;
	
	Если Результат = Неопределено Тогда
		
		Результат = "";
		
	КонецЕсли;
	
	Если	Не СбисИсключение.message = СбисИсключение.details Тогда 
		Результат = Результат + Символы.ПС + "Детально: " + СбисИсключение.details;
	КонецЕсли;

	Если	ЗначениеЗаполнено(СбисИсключение.dump)
		И	СбисИсключение.dump.Свойство("ДетализацияОшибки")
		И	СбисИсключение.dump.Свойство("ИсходнаяСтрока")
		И	СбисИсключение.dump.Свойство("НомерСтроки") Тогда
		
		СтрокаДетально = "В модуле {ИмяМодуля}, в строке ""{ИсходнаяСтрока}"" ({НомерСтроки}) произошла ошибка ""{ДетализацияОшибки}""!";
		СтрокаДетально = ПрименитьФорматКСтроке(СтрокаДетально, СбисИсключение.dump);
		Результат = Результат + Символы.ПС + "Подбробная информация: " + СтрокаДетально;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//DynamicDirective

// Функция - Dump метод для исключений
//
// Параметры:
//  СбисИсключение	 - СбисИсключение	 - текущая ошибка
//  ВариантВыгрузки	 - Строка			 - ключ, как надо выгрузить нашу ошибку
// 
// Возвращаемое значение:
//  Произвольный - значение по ключу
//
Функция яСбисИсключение_Выгрузить_ExtException(СбисИсключение, ДопПараметры = Неопределено) 
	
	// Пока только для vo3
	ФорматИсключения = "3";
		
	ExtException = Новый Структура("type, message, detail, action, dump, stack");

	ExtException.type		= яСбисИсключение_СтатичныйМетод_ExtExceptionType(СбисИсключение.code, СбисИсключение.extCode);
	ExtException.message	= СбисИсключение.message;
	ExtException.detail		= СбисИсключение.details;
	ExtException.action		= СбисИсключение.methodName;
	ExtException.dump		= СбисИсключение.data;
	ExtException.stack		= Новый Массив;
	
	СбисЗаписьВСтек = Новый Структура("methodName, code, extCode, message, dump, data");
	Для Каждого ЗаписьСтека Из СбисИсключение.stack Цикл
	
		НовыйЗаписьДляСтека = Новый Структура("type, message, detail, action, dump, traceback");
		
		НовыйЗаписьДляСтека.type		= яСбисИсключение_СтатичныйМетод_ExtExceptionType(ЗаписьСтека.code, ЗаписьСтека.extCode);
		НовыйЗаписьДляСтека.message		= ЗаписьСтека.message;
		НовыйЗаписьДляСтека.action		= ЗаписьСтека.methodName;
		НовыйЗаписьДляСтека.traceback	= ЗаписьСтека.dump;
		НовыйЗаписьДляСтека.dump		= ЗаписьСтека.data;
		
		ExtException.stack.Добавить(НовыйЗаписьДляСтека);
	
	КонецЦикла;
	
	Возврат ExtException;
	
КонецФункции

