
//DynamicDirective

Функция яСбисИсключение_СтатичныйМетод_ИзвлечьКодИзСтекаExtException(ExtSysException)
	Перем СтекОшибки, ЗаписьОшибкиВСтеке;
	
	Если	Не	ExtSysException.Свойство("stack", СтекОшибки)
		Или Не 	ЗначениеЗаполнено(СтекОшибки) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
		
	ОшибкаИзStack = СтекОшибки[0];
	Если ОшибкаИзStack.Свойство("error", ЗаписьОшибкиВСтеке) 
		И Не ЗаписьОшибкиВСтеке = Неопределено
		И Найти(ЗаписьОшибкиВСтеке, " : error ") Тогда
		
		КодОшибки = Лев(СтрЗаменить(ЗаписьОшибкиВСтеке," : error ", ""),3);
		ОписаниеЧисла = Новый ОписаниеТипов("Число");
		КодОшибки = ОписаниеЧисла.ПривестиЗначение(КодОшибки);
		Если Булево(КодОшибки) Тогда
			
			Возврат КодОшибки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//DynamicDirective

Функция яСбисИсключение_СтатичныйМетод_ОпределитьСценарий(ПредполагаемыйКод, СообщениеОшибки, ДетализацияОшибки)
КонецФункции

