
//DynamicDirective

// Функция - Я сбис исключение ext exception type
//
// Параметры:
//  КодОшибки			 - Число - СбисИсключение.code
//  РасширениеОшибки	 - Число - СбисИсключение.extCode
// 
// Возвращаемое значение:
//  Строка - ExtException.type
//
Функция яСбисИсключение_СтатичныйМетод_ExtExceptionType(КодОшибки, РасширениеОшибки = Неопределено) 

	Если	КодОшибки = 304 Тогда
		
		Если РасширениеОшибки = 102 Тогда
		
			Возврат "WaitingUserAction";
			
		ИначеЕсли РасширениеОшибки = 103 Тогда
			
			Возврат "Unauthorized";
			
		КонецЕсли;
		
	ИначеЕсли КодОшибки = 779 Тогда
		
		Возврат "HandlerNotFoundError";
		
	ИначеЕсли КодОшибки = 790 Тогда
		
		Возврат "CancelOperation";
		
	КонецЕсли;
	
	Возврат "ExtException";

КонецФункции

//DynamicDirective

Функция яСбисИсключение_СтатичныйМетод_ЗаписьВСтек(ЗаписьДобавить)
	
	СбисЗаписьВСтек = Новый Структура("methodName, code, extCode, message, dump, data");

	Если ТипЗнч(ЗаписьДобавить) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(СбисЗаписьВСтек, ЗаписьДобавить);
		Если		ЗаписьДобавить.Свойство("method_Name") Тогда
			
			СбисЗаписьВСтек.methodName = ЗаписьДобавить.method_Name;
			
		ИначеЕсли	ЗаписьДобавить.Свойство("Action") Тогда
			
			СбисЗаписьВСтек.methodName = ЗаписьДобавить.Action;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ЗаписьДобавить) = Тип("Соответствие") Тогда
		
		Для Каждого КлючИЗначениеСтек Из СбисЗаписьВСтек Цикл
			
			СбисЗаписьВСтек[КлючИЗначениеСтек.Ключ] = ЗаписьДобавить[КлючИЗначениеСтек.Ключ];
			
		КонецЦикла;
		
		ИмяМетодаСтека = ЗаписьДобавить.Получить("action");
		Если Не ИмяМетодаСтека = Неопределено Тогда
			
			СбисЗаписьВСтек.methodName = ЗаписьДобавить.ИмяМетодаСтека;
			
		КонецЕсли;
		
		ИмяМетодаСтека = ЗаписьДобавить.Получить("method_Name");
		Если Не ИмяМетодаСтека = Неопределено Тогда
			
			СбисЗаписьВСтек.methodName = ЗаписьДобавить.ИмяМетодаСтека;
			
		КонецЕсли;

	Иначе
		
		// Что-то неизвестное
		СбисЗаписьВСтек.data = ЗаписьДобавить;
		
	КонецЕсли;
	
	Возврат СбисЗаписьВСтек;
	
КонецФункции

//DynamicDirective

Функция яСбисИсключение_СтатичныйМетод_ИзвлечьКодИзСтекаExtException(ExtSysException)
	Перем СтекОшибки, ЗаписьОшибкиВСтеке;
	
	Если	Не	ExtSysException.Свойство("stack", СтекОшибки)
		Или Не 	ЗначениеЗаполнено(СтекОшибки) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
		
	ОшибкаИзStack = СтекОшибки[0];
	Если ОшибкаИзStack.Свойство("error", ЗаписьОшибкиВСтеке) 
		И Не ЗаписьОшибкиВСтеке = Неопределено
		И Найти(ЗаписьОшибкиВСтеке, " : error ") Тогда
		
		КодОшибки = Лев(СтрЗаменить(ЗаписьОшибкиВСтеке," : error ", ""),3);
		ОписаниеЧисла = Новый ОписаниеТипов("Число");
		КодОшибки = ОписаниеЧисла.ПривестиЗначение(КодОшибки);
		Если Булево(КодОшибки) Тогда
			
			Возврат КодОшибки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//DynamicDirective

Функция яСбисИсключение_СтатичныйМетод_ОпределитьСценарий(ПредполагаемыйКод, СообщениеОшибки, ДетализацияОшибки)
КонецФункции

