
//DynamicDirective
Функция яExtException_Static_NewStackLine(ЗаписьДобавить = Неопределено)
	
	СбисЗаписьВСтек = Новый Структура("type, message, dump, data, action");

	Если ТипЗнч(ЗаписьДобавить) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(СбисЗаписьВСтек, ЗаписьДобавить);
		Если ЗаписьДобавить.Свойство("method_name") Тогда
			
			СбисЗаписьВСтек.action = ЗаписьДобавить.method_name;
			
		КонецЕсли;
		
		Если	СбисЗаписьВСтек.type = Неопределено
			И	ОбъектSABY_ЭтоТип(ЗаписьДобавить, "ОбъектSABY") Тогда
			
			СбисЗаписьВСтек.type = ОбъектSABY_Получить(ЗаписьДобавить, "Тип");
			
		КонецЕсли;
		
		Если СбисЗаписьВСтек.message = Неопределено Тогда

			ЗаписьДобавить.Свойство("error", СбисЗаписьВСтек.message);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ЗаписьДобавить) = Тип("Соответствие") Тогда
		
		Для Каждого КлючИЗначениеСтек Из СбисЗаписьВСтек Цикл
			
			СбисЗаписьВСтек[КлючИЗначениеСтек.Ключ] = ЗаписьДобавить.Получить(КлючИЗначениеСтек.Ключ);
			
		КонецЦикла;
		
		ИмяМетодаСтека = ЗаписьДобавить.Получить("method_name");
		Если Не ИмяМетодаСтека = Неопределено Тогда
			
			СбисЗаписьВСтек.action = ИмяМетодаСтека;
			
		КонецЕсли;
		
		Если СбисЗаписьВСтек.message = Неопределено Тогда

			СбисЗаписьВСтек.message = ЗаписьДобавить.Получить("error");
			
		КонецЕсли;

	ИначеЕсли ТипЗнч(ЗаписьДобавить) = Тип("Строка") Тогда
		
		СбисЗаписьВСтек.action = ЗаписьДобавить;
		
	Иначе
		
		// Что-то неизвестное
		СбисЗаписьВСтек.data = ЗаписьДобавить;
		
	КонецЕсли;
	
	Возврат СбисЗаписьВСтек;
	
КонецФункции

//DynamicDirective
Функция яExtException_Static_NewDump(	ОснованиеДампа = Неопределено,
										ДетализацияОшибки = Неопределено, ИсходнаяСтрока= Неопределено, НомерСтроки = Неопределено, ИмяМодуля = Неопределено)
							
	СбисОснованиеОшибки = Новый Структура(
	"ДетализацияОшибки, ИсходнаяСтрока, НомерСтроки, ИмяМодуля, Описание",
	ДетализацияОшибки, ИсходнаяСтрока, НомерСтроки, ИмяМодуля);
							
	Если ОснованиеДампа = Неопределено Тогда
		
		Возврат СбисОснованиеОшибки;
		
	ИначеЕсли ТипЗнч(ОснованиеДампа) = Тип("ИнформацияОбОшибке") Тогда						

		ЗаполнитьЗначенияСвойств(СбисОснованиеОшибки, ОснованиеДампа);
		СбисОснованиеОшибки.ИсходнаяСтрока	= СокрЛП(СбисОснованиеОшибки.ИсходнаяСтрока);
		
	ИначеЕсли ОбъектSABY_ЭтоТип(ОснованиеДампа, "ExtException") Тогда
		
		СбисОснованиеОшибки.Описание	= "ExtException";
		СбисОснованиеОшибки.ИмяМодуля	= ОснованиеДампа.Action;
		Если ДетализацияОшибки = Неопределено Тогда
			
			СбисОснованиеОшибки.ДетализацияОшибки = ОснованиеДампа.detail;
			
		КонецЕсли;
		
	Иначе
		
		// Не знаем, что за основание, добавить в дамп
		СбисОснованиеОшибки.Описание = ОснованиеДампа;
		Если СбисОснованиеОшибки.ИмяМодуля = Неопределено Тогда
			
			СбисОснованиеОшибки.ИмяМодуля = "ExtException.Static.NewDump";
			
		КонецЕсли;

	КонецЕсли;
	
	Возврат СбисОснованиеОшибки;
		
КонецФункции

//DynamicDirective
Функция яExtException_Static_CodeFormat(CodeValue = 100000)

	Если ТипЗнч(CodeValue) = Тип("Число") Тогда
		
		ExtCode = CodeValue;
		
	ИначеЕсли ТипЗнч(CodeValue) = Тип("ФиксированнаяСтруктура") Тогда
		
		ExtCode = CodeValue.code * 1000;
		Если ЗначениеЗаполнено(CodeValue.extCode) Тогда
			
			ExtCode = ExtCode + CodeValue.extCode;
			
		КонецЕсли;
		
	Иначе
		
		ТипЧисло = Новый ОписаниеТипов("Число");
		ExtCode = ТипЧисло.ПривестиЗначение(CodeValue);
		
	КонецЕсли;
	
	Если ExtCode < 1000 Тогда
		
		Если		ExtCode <= 0 Тогда
			
			ExtCode = 100
			
		ИначеЕсли	ExtCode < 10 Тогда 
			
			// 1-9
			ExtCode = ExtCode * 100
			
		ИначеЕсли	ExtCode < 100 Тогда 
			
			// 10-99
			ExtCode = ExtCode * 10
			
		КонецЕсли;
		
		// code должен быть 6-значным, где первые 3 символа - код ошибки, а последующие - уточняющий сценарий
		ExtCode = ExtCode * 1000;
		
	КонецЕсли;	
		
	Возврат ExtCode;

КонецФункции

//DynamicDirective

// Функция - получает сообщение по коду и коду сценария.
//
// Параметры:
//  ОсновнойКодОшибки		 - Число				 - первые 3 символа code в формате числа
//  ДополнительныйКодОшибки	 - Число, Неопределено	 - 3 code с конца, в формате числа
// 
// Возвращаемое значение:
//  Строка - сообщение по ошибке, с учетом кода сценария. 
// Если подходящего сообщения с учетом ОсновнойКодОшибки и ДополнительныйКодОшибки не будет подобрано, то сообщение возьмется по ОсновнойКодОшибки
// Если не удастся подобрать по ОсновнойКодОшибки, то "Неизвестная ошибка системы"
//
Функция яExtException_Static_MessageByCodes(ОсновнойКодОшибки, ДополнительныйКодОшибки)
	
	// Много если, ИначеЕсли, т.к. негде хранить соответствие
	Если ОсновнойКодОшибки = 301 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Ошибка работы с защищенным соединением.";
		
		КонецЕсли;

	ИначеЕсли ОсновнойКодОшибки = 304 Тогда
		
		Если ДополнительныйКодОшибки = 103 Тогда
			
			Возврат "Пользователь не авторизован";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 306 Тогда
		
		Если ДополнительныйКодОшибки = 103 Тогда
			
			Возврат "У вас нет прав на создание документов требуемого типа. Настройте их в личном кабинете Saby по инструкции";
			
		ИначеЕсли ДополнительныйКодОшибки = 302 Тогда
			
			Возврат "Недостаточно прав для работы с документами";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 325 Тогда
        
		Если ДополнительныйКодОшибки = 401 Тогда
            
			Возврат "В документе есть маркированные товары без кодов.";
			
		ИначеЕсли ДополнительныйКодОшибки = 201 Тогда
            
			Возврат "Указанный идентификатор абонентского ящика не соответствует ИНН.";
			
		ИначеЕсли ДополнительныйКодОшибки = 150 Тогда
            
			Возврат "Ошибка создания редакции документа.";
        
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 401 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
            
			Возврат "Отсутствует подключение к сети";
			
		КонецЕсли;
		          
	ИначеЕсли ОсновнойКодОшибки = 400 Тогда
        
		Если ДополнительныйКодОшибки = 402 Тогда
            
			Возврат "Отсутствует соединение";
			
		ИначеЕсли ДополнительныйКодОшибки = 403 Тогда
            
			Возврат "Истекло время ожидания запроса";
        
		КонецЕсли;
	
	ИначеЕсли ОсновнойКодОшибки = 412 Тогда
		
		Если ДополнительныйКодОшибки = 100 Тогда
			
			Возврат "Не удалось запустить приложение Saby";
			
		ИначеЕсли ДополнительныйКодОшибки = 101 Тогда	
			
			Возврат "Работа приложения Saby была остановлена";
			
		КонецЕсли;
	
	ИначеЕсли ОсновнойКодОшибки = 502 Тогда
		
		Если ДополнительныйКодОшибки = 100 Тогда
			
			Возврат "Недостаточно прав для записи данных";
			
		ИначеЕсли ДополнительныйКодОшибки = 300 Тогда	
			
			Возврат "Ошибка проверки заполнения объекта";
			
		ИначеЕсли ДополнительныйКодОшибки = 301 Тогда	
			
			Возврат "Запись с ключевыми полями уже существует";
			
		КонецЕсли;

	ИначеЕсли ОсновнойКодОшибки = 510 Тогда
		
		Если ДополнительныйКодОшибки = 100 Тогда
			
			Возврат "Операционная система не поддерживается";
			
		ИначеЕсли ДополнительныйКодОшибки = 701 Тогда	
			
			Возврат "Отсутствуют ИД интеграции и ИД подключения";
			
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 608 Тогда
		
		Если ДополнительныйКодОшибки = 100 Тогда
			
			Возврат "Недостаточно параметров для вызова запроса 1С";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 615 Тогда
		
		Если ДополнительныйКодОшибки = 200 Тогда
			
			Возврат "Вложение SABY не сформировано";
			
		ИначеЕсли ДополнительныйКодОшибки = 201 Тогда
			
			Возврат "Конверт не сформирован";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 616 Тогда
		
		Если ДополнительныйКодОшибки = 301 Тогда
			
			Возврат "Ошибка записи параметров SABY";
			
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 678 Тогда

		Если ДополнительныйКодОшибки = 10 Тогда
		
			Возврат "Ошибка запуска стороннего приложения";
		
		ИначеЕсли ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Ошибка вызова пользовательской обработки";
		
		КонецЕсли;

	ИначеЕсли ОсновнойКодОшибки = 703 Тогда
		
		Если ДополнительныйКодОшибки = 102 Тогда
			
			Возврат "Возникла проблема при работе с COM-объектом «ADODB.Connection";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 709 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Недостаточно прав для записи объекта";
		
		КонецЕсли;
			
	
	ИначеЕсли ОсновнойКодОшибки = 710 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Отсустствуют активные этапы для запуска в документооборот";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 711 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Версия SABY Plugin не поддерживается";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 715 Тогда
		
		Если ДополнительныйКодОшибки = 103 Тогда
			
			Возврат "Вложение неопределено";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 717 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Ошибка подключения файла статусов DBF.";
		
		КонецЕсли;

	ИначеЕсли ОсновнойКодОшибки = 718 Тогда
		
		Если ДополнительныйКодОшибки = 103 Тогда
			
			Возврат "Не удалось найти регламент документа";
		
		КонецЕсли;

	ИначеЕсли ОсновнойКодОшибки = 719 Тогда
		
		Если ДополнительныйКодОшибки = 104 Тогда
			
			Возврат "Действие отменено";
			
		ИначеЕсли ДополнительныйКодОшибки = 103 Тогда
			
			Возврат "Действие не требуется";
			
		ИначеЕсли ДополнительныйКодОшибки = 102 Тогда
			
			Возврат "Действие заблокировано";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 723 Тогда
		
		Если ДополнительныйКодОшибки = 300 Тогда
			
			Возврат "В файле настроек некорректно указан путь к табличной части документа";
			
		ИначеЕсли ДополнительныйКодОшибки = 301 Тогда
			
			Возврат "Отсутствует документ основание";
			
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 731 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Не найден подходящий сертификат ЭП";
			
		ИначеЕсли ДополнительныйКодОшибки = 102 Тогда
			
			Возврат "Ошибка в настройках локального подписания";
			
		ИначеЕсли ДополнительныйКодОшибки = 110 Тогда
			
			Возврат "Не удалось загрузить сертификат из контейнера";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 735 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Работа с зашифрованными файлами не поддерживается на текущем способе обмена.";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 746 Тогда
		
		Если ДополнительныйКодОшибки = 002 Тогда
			
			Возврат "Наш сервис обновляется. Попробуйте повторить позже.";
			
		ИначеЕсли ДополнительныйКодОшибки = 404 Тогда
			
			Возврат "Запрашиваемый ресурс не найден";
			
		ИначеЕсли ДополнительныйКодОшибки = 503
			Или ДополнительныйКодОшибки = 502 Тогда
			
			Возврат "Сервис не доступен";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 747 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Для документа отсутствует настройка";
			
		ИначеЕсли ДополнительныйКодОшибки = 200 Тогда
			
			Возврат "Отсутствует ини файл";
		
		КонецЕсли;

	ИначеЕсли ОсновнойКодОшибки = 753 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Недостаточно прав для выполнения запроса.";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 760 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Список сертификатов пуст";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 767 Тогда
		
		Если ДополнительныйКодОшибки = 301 Тогда
			
			Возврат "Ошибка создания дополнительных свойств";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 770 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Не удалось загрузить описание преобразования XSL из строки.";
			
		ИначеЕсли ДополнительныйКодОшибки = 103 Тогда
			
			Возврат "Не удалось выполнить преобразования XSL";
			
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 772 Тогда
		
		Если ДополнительныйКодОшибки = 102 Тогда
			
			Возврат "Ошибка работы с файловой системой";
			
		ИначеЕсли ДополнительныйКодОшибки = 104 Тогда
			
			Возврат "Недостаточно прав для доступа к каталогу или файлу";
		
		КонецЕсли;

	ИначеЕсли ОсновнойКодОшибки = 775 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Не получен ответ от плагина";
		
		ИначеЕсли ДополнительныйКодОшибки = 102 Тогда
			
			Возврат "Не включен обмен с SABY.";
		
		КонецЕсли;

	ИначеЕсли ОсновнойКодОшибки = 765 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Ошибка установки пользовательского параметра.";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 776 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Возникла проблема при работе с COM-объектом «ADODB.Connection";

		КонецЕсли;		

	ИначеЕсли ОсновнойКодОшибки = 779 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Не удалось прочитать документ. Возможно, что он недоступен для Вашего пользователя, или был удален.";
			
		ИначеЕсли ДополнительныйКодОшибки = 102 Тогда
			
			Возврат "Ошибка отправки черновика. Возможно, документ был сопоставлен некорректно, или был удален.";
			
		ИначеЕсли ДополнительныйКодОшибки = 108 Тогда
			
			Возврат "Архив настроек не найден, не хватает настроек в каталоге или они не обновлены, необходимо скачать файлы xslt";
			
		ИначеЕсли ДополнительныйКодОшибки = 103 Тогда
			
			Возврат "Каталог не найден";
			
		ИначеЕсли ДополнительныйКодОшибки = 201 Тогда
			
			Возврат "Неправильно указана сторона фильтрации";
		
		ИначеЕсли ДополнительныйКодОшибки = 202 Тогда
			
			Возврат "Не найден сотрудник в SABY";	
			
		ИначеЕсли ДополнительныйКодОшибки = 203 Тогда
			
			Возврат "Не найден документ в SABY";
			
		ИначеЕсли ДополнительныйКодОшибки = 204 Тогда
			
			Возврат "Не найдена организация в SABY";
			
		КонецЕсли;
				
	КонецЕсли;
	
	Возврат яExtException_Static_MessageByMainCode(ОсновнойКодОшибки);
	
КонецФункции

//DynamicDirective

// Функция - возвращает текст сообщения по основному коду https://link.saby.ru/shared/disk/b7298c4d-0331-48f5-ab39-0b5643687c25 
//
// Параметры:
//  СбисКодОшибки	 - Число	 - основной код ошибки код ошибки
// 
// Возвращаемое значение:
//  Строка - текст ошибки по коду
//
Функция яExtException_Static_MessageByMainCode(СбисКодОшибки)
	
	// Тут куча ИначеЕсли, т.к. хранить соответствие негде.
	Если		СбисКодОшибки = 100 Тогда
		Возврат "Неизвестная ошибка системы";
	ИначеЕсли	СбисКодОшибки = 300 Тогда
		Возврат "Неизвестная ошибка БЛ";
	ИначеЕсли	СбисКодОшибки = 301 Тогда
		Возврат "Сервис Saby.Диск временно недоступен"; 
	ИначеЕсли	СбисКодОшибки = 302 Тогда
		Возврат "Сайт на техническом обслуживании. Повторите попытку позднее";  
	ИначеЕсли	СбисКодОшибки = 303 Тогда	
		Возврат "Аутентификация не выполнена. Требуется подтверждение действия";
	ИначеЕсли	СбисКодОшибки = 304 Тогда
		Возврат "Фатальная ошибка при аутентификации";
	ИначеЕсли	СбисКодОшибки = 305 Тогда
		Возврат "Аутентификация не выполнена. Неправильные логин/пароль.";
	ИначеЕсли   СбисКодОшибки = 306 Тогда
		Возврат "Ошибка прав доступа БЛ";
	ИначеЕсли	СбисКодОшибки = 310 Тогда
		Возврат "Фатальная ошибка входных параметров";
	ИначеЕсли	СбисКодОшибки = 315 Тогда
		Возврат "Фатальная ошибка криптографии";
	ИначеЕсли	СбисКодОшибки = 320 Тогда
		Возврат "Фатальная ошибка модуля работы с формализованными документами";
	ИначеЕсли 	СбисКодОшибки = 325 Тогда
		Возврат "Фатальная ошибка запуска в документооборот"; 
	ИначеЕсли 	СбисКодОшибки = 330 Тогда
		Возврат "Фатальная ошибка поиска абонентского ящика";
	ИначеЕсли 	СбисКодОшибки = 335 Тогда
		Возврат "Фатальная ошибка лицензирования";
	ИначеЕсли 	СбисКодОшибки = 340 Тогда
		Возврат "Фатальная ошибка ФЛК.";
	ИначеЕсли 	СбисКодОшибки = 346 Тогда
		Возврат "Невозможно выполнить преобразование."; 
	ИначеЕсли 	СбисКодОшибки = 350 Тогда
		Возврат "Неизвестная нефатальная ошибка БЛ";
	ИначеЕсли 	СбисКодОшибки = 355 Тогда
		Возврат "Неизвестная ошибка внутреннего сервиса";	
	ИначеЕсли 	СбисКодОшибки = 356 Тогда
		Возврат "Запрос обрабатывается. Повторите позже";
	ИначеЕсли 	СбисКодОшибки = 357 Тогда
		Возврат "Нефатальная ошибка аутентификации.";
	ИначеЕсли	СбисКодОшибки = 400 Тогда
		Возврат "Неизвестная ошибка транспорта";
    ИначеЕсли	СбисКодОшибки = 401 Тогда
        Возврат "Отсутствует подключение к сети";
	ИначеЕсли	СбисКодОшибки = 412 Тогда
		Возврат	"Не включен обмен с SABY";
	ИначеЕсли	СбисКодОшибки = 409 Тогда
		Возврат "Сеанс с учетной системой завершен";
	ИначеЕсли	СбисКодОшибки = 500 Тогда
		Возврат "Неизвестная ошибка окружения";
	ИначеЕсли	СбисКодОшибки = 502 Тогда
		Возврат "Ошибка записи информационной системы";
	ИначеЕсли	СбисКодОшибки = 510 Тогда
		Возврат "Неподдерживаемое окружение";
	ИначеЕсли	СбисКодОшибки = 600 Тогда
		Возврат "Неизвестная ошибка приложения";
	ИначеЕсли	СбисКодОшибки = 604 Тогда
		Возврат "Ошибка получения данных из ИС";
	ИначеЕсли	СбисКодОшибки = 608 Тогда
		Возврат "Некорректное описание параметра в файле настроек";
	ИначеЕсли	СбисКодОшибки = 610 Тогда
		Возврат "Отсутствует файл настроек для данного типа данных";		
	ИначеЕсли	СбисКодОшибки = 612 Тогда
		Возврат "Не удалось определить тип ИС";		
	ИначеЕсли	СбисКодОшибки = 615 Тогда
		Возврат "Ошибка создания объекта";		
	ИначеЕсли	СбисКодОшибки = 616 Тогда
		Возврат "Ошибка записи";		
	ИначеЕсли	СбисКодОшибки = 623 Тогда
		Возврат "Ошибка обработки объекта";		
	ИначеЕсли	СбисКодОшибки = 678 Тогда
		Возврат "Ошибка подключаемого модуля";
	ИначеЕсли	СбисКодОшибки = 679 Тогда
		Возврат "Объект не найден";
	ИначеЕсли	СбисКодОшибки = 700 Тогда
		Возврат "Неизвестная ошибка подключения";
	ИначеЕсли 	СбисКодОшибки = 702 Тогда
		Возврат "Неверно указано имя пользователя или пароль";
	ИначеЕсли	СбисКодОшибки = 703 Тогда
		Возврат "Ошибка создания подключения к ИС";
	ИначеЕсли	СбисКодОшибки = 709 Тогда
		Возврат "Ошибка в ограничении доступа к данным";
	ИначеЕсли	СбисКодОшибки = 710 Тогда
		Возврат "Ошибка блокировки данных";
	ИначеЕсли	СбисКодОшибки = 717 Тогда
		Возврат "Несовместимая версия файла базы данных";
	ИначеЕсли	СбисКодОшибки = 718 Тогда
		Возврат "Ошибка выполнения действия с документом";
	ИначеЕсли	СбисКодОшибки = 719 Тогда
		Возврат "Ошибка интерфейса";
	ИначеЕсли	СбисКодОшибки = 721 Тогда
		Возврат "Неверно указан ИНН";
	ИначеЕсли	СбисКодОшибки = 723 Тогда
		Возврат "Ошибка обработки объекта";
	ИначеЕсли	СбисКодОшибки = 724 Тогда
		Возврат "Организация неопределена";
	ИначеЕсли	СбисКодОшибки = 726 Тогда
		Возврат "Вложения неопределены";
	ИначеЕсли	СбисКодОшибки = 729 Тогда
		Возврат "Ошибка ФЛК";
	ИначеЕсли	СбисКодОшибки = 735 Тогда
		Возврат "Данная операция недоступна";
	ИначеЕсли	СбисКодОшибки = 744 Тогда
		Возврат "Ошибка записи или чтения 1С";
	ИначеЕсли	СбисКодОшибки = 746 Тогда
		Возврат "Ошибка HTTP соединения";
	ИначеЕсли	СбисКодОшибки = 747 Тогда
		Возврат "Ошибка файлов настроек";
	ИначеЕсли	СбисКодОшибки = 755 Тогда
		Возврат "Не найден сертификат ЭП";
	ИначеЕсли	СбисКодОшибки = 756 Тогда
		Возврат "Подключение недоступно";
	ИначеЕсли	СбисКодОшибки = 759 Тогда
		Возврат "Невозможно соединиться с удаленным сервером";
	ИначеЕсли	СбисКодОшибки = 760 Тогда
		Возврат "Неверные параметры фильтра";
	ИначеЕсли	СбисКодОшибки = 762 Тогда
		Возврат "Версия системы не поддерживается";
	ИначеЕсли	СбисКодОшибки = 765 Тогда
		Возврат "Значение не найдено в таблице настроек";
	ИначеЕсли	СбисКодОшибки = 767 Тогда
		Возврат "Ошибка при создании объекта";
	ИначеЕсли	СбисКодОшибки = 770 Тогда
		Возврат "Ошибка XSLT";
	ИначеЕсли	СбисКодОшибки = 772 Тогда
		Возврат "Ошибка работы с файловой системой";
	ИначеЕсли	СбисКодОшибки = 773 Тогда
		Возврат "Неизвестная ошибка при выполнении метода";	
	ИначеЕсли	СбисКодОшибки = 775 Тогда
		Возврат "Ошибка транспорта";	
	ИначеЕсли	СбисКодОшибки = 776 Тогда
		Возврат "Запуск программы/функции/метода не удался";	
	ИначеЕсли	СбисКодОшибки = 779 Тогда
		Возврат "Не найден объект";	
	ИначеЕсли	СбисКодОшибки = 780 Тогда
		Возврат "Не заполнено обязательное поле";
	ИначеЕсли 	СбисКодОшибки = 784 Тогда
		Возврат "Ошибка в настройках соединения";
	ИначеЕсли 	СбисКодОшибки = 785 Тогда
		Возврат "Ошибка во входящих данных";
	ИначеЕсли	СбисКодОшибки = 790 Тогда
		Возврат "Обработка прервана пользователем"
	КонецЕсли;
	Возврат "Неизвестная ошибка системы";
КонецФункции

//DynamicDirective

// Функция - возвращает код ошибки https://link.saby.ru/shared/disk/b7298c4d-0331-48f5-ab39-0b5643687c25 по https://saby.ru/help/integration/api/error_code
//
// Параметры:
//  КодApiSBIS	 - Строка	 - код ошибки Warning в формате {clsId ошибки}
// 
// Возвращаемое значение:
//  Число - коду ошибки
//
Функция яExtException_Static_OurCodeByAPICode(КодApiSBIS)
    Перем КодОшибки;
	
	КодApiSBIS_Полный	= ВРег(КодApiSBIS);
	КодApiSBIS_33		= Лев(КодApiSBIS_Полный, 33);
	КодApiSBIS_28		= Лев(КодApiSBIS_Полный, 28);
	
	
	Если КодApiSBIS_Полный = "{В-0000-1AA0000F1002}" Тогда
		КодОшибки = 710;   
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000001002}" Тогда
		КодОшибки = 303; 
	ИначеЕсли	КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000001000}" Тогда
		КодОшибки = 304;
	ИначеЕсли	КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000001001}" Тогда
		КодОшибки = 305;
    ИначеЕсли	КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000120001}" Тогда
        КодОшибки = 325401;
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA0000A0001}" Тогда
		КодОшибки = 346; 
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1AA0000F1002}" Тогда
		КодОшибки = 356; 
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1AA000001000}" Тогда
		КодОшибки = 357;
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1AA000010000}" Тогда
		КодОшибки = 746002;
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA0000E0003}" Тогда
		КодОшибки = 306103;
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000010007}" Тогда
		КодОшибки = 779203;
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA0000E0000}" Тогда
		КодОшибки = 306302;
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000010000}" Тогда
		КодОшибки = 779;
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000070000}" Тогда
		КодОшибки = 779201;
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000060000}" Тогда
		КодОшибки = 325150;
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000080000}" Тогда
		КодОшибки = 325201;
		

	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA00001" Тогда
		КодОшибки = 310;
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA00002" Тогда
		КодОшибки = 315;
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA00003" Тогда
		КодОшибки = 320;
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA00004" Тогда
		КодОшибки = 325; 
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA00008" Тогда
		КодОшибки = 330;
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA0000D" Тогда
		КодОшибки = 335;
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA0000F" Тогда
		КодОшибки = 340;
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1AA00001" Тогда
		КодОшибки = 355;	
	ИначеЕсли   КодApiSBIS_28 = "{00000000-0000-0000-0000-1AA" Тогда
		КодОшибки = 350; 		
	Иначе
		КодОшибки = 100; 		
	КонецЕсли;
	
	Возврат яExtException_Static_CodeFormat(КодОшибки);
	
КонецФункции

//DynamicDirective

Функция яExtException_Static_OurCodeByHTTPCode(КодОшибкиHTTP)
	Перем  ДополнительныйКодОшибки;

	ОписаниеЧисло	= Новый ОписаниеТипов("Число");
	КодОшибки		= ОписаниеЧисло.ПривестиЗначение(КодОшибкиHTTP);
	
	Если КодОшибки = 401 Тогда
		
		КодРезультат = 304103
		
	Иначе
		
		КодРезультат = яExtException_Static_CodeFormat(746) + КодОшибки;
		
	КонецЕсли;                     
	
	Возврат КодРезультат;
	
КонецФункции

//DynamicDirective
Функция яExtException_Static_CodeByType(ExceptionType)
	
	ТипНстр = НРег(ExceptionType);
	Если ТипНстр = "unauthorizederror" Тогда
		
		// пользователь не авторизован
		Возврат 304103;
		
	ИначеЕсли ТипНстр = "autherror" Тогда	
		
		// Общая ошибка авторизации
		Возврат 304000;
		
	ИначеЕсли ТипНстр = "confirmautherror" Тогда	
		
		// требуется подтверждение действия
		Возврат 303000;	
		
	КонецЕсли;
	
	Возврат 100000;
	
КонецФункции

#Область include_core2_base_Helpers_ExtException_private_Static_Handlers
#КонецОбласти

