
// Функция - возвращает исключение в виде строки
// 
// Возвращаемое значение:
//  Строка - 
//
Функция СбисИсключение_ВСтрокуСервер(СбисИсключение, ДопПарамеры = Неопределено) Экспорт 

	Возврат ЗначениеВСтрокуВнутр(СбисИсключение);

КонецФункции

// Функция - возвращает исключение в виде строки
// 
// Возвращаемое значение:
//  Строка - 
//
Функция СбисИсключение_ИзСтрокиСервер(СбисИсключение, ДопПарамеры = Неопределено) Экспорт 

	Возврат ЗначениеИзСтрокиВнутр(СбисИсключение);

КонецФункции

