////////////////////////////////////////////////////

//Проверяет переданный идентификатор и возвращает готовый для работы со структурой настроек в кэше
&НаКлиенте
Функция		Кэширование_Идентификатор(Кэш, ПараметрыКонфигурации, Идентификатор = "", Отказ=Ложь)

	ID = Идентификатор;
	Если ПустаяСтрока(ID) Тогда
		ID	= СтрЗаменить(Кэш.ФормаНастроекОбщее.СформироватьПрефиксСистемыКлиент(ПараметрыКонфигурации), "-", "");
	КонецЕсли;
	ID = Кэш.ОбщиеФункции.СбисФорматСтроки(ID, "КлючСтруктуры");
	Если ID = "_" Тогда
		Отказ = Истина;
		Возврат Кэш.ОбщиеФункции.СбисИсключение(,"ФайлыНастроекСервер.Кэширование_Идентификатор", 600,,"Невозможно определить идентификтор настроек для хранения!", Новый Структура("config, id", ПараметрыКонфигурации, Идентификатор));
	КонецЕсли;
	Возврат	ID;

КонецФункции

