
Функция ПодтипыДокумента() Экспорт

	СписокДоступныхЗначений = Новый СписокЗначений;
	
	// "Согласование цен"
	ОписаниеФормата = Новый Структура;
	ОписаниеФормата.Вставить("Тип",				"СогласованиеЦен");
	ОписаниеФормата.Вставить("ВерсияТипа",		"3.01");
	ОписаниеФормата.Вставить("ПодТип",			"СогласованиеЦен");
	ОписаниеФормата.Вставить("ВерсияПодтипа",	"");
	ОписаниеФормата.Вставить("Регламент",		"Согласование цен");
	ОписаниеФормата.Вставить("ИмяСети",			"");
	СписокДоступныхЗначений.Добавить(ОписаниеФормата, "Согласование цен");
	
	Возврат СписокДоступныхЗначений;

КонецФункции

