
Функция ПодтипыДокумента() Экспорт

	СписокДоступныхЗначений = Новый СписокЗначений;
	
	// "Согласование цен"
	ОписаниеФормата = Новый Структура;
	ОписаниеФормата.Вставить("Тип",				"СогласованиеЦен");
	ОписаниеФормата.Вставить("ВерсияТипа",		"3.01");
	ОписаниеФормата.Вставить("ПодТип",			"СогласованиеЦен");
	ОписаниеФормата.Вставить("ВерсияПодтипа",	"");
	ОписаниеФормата.Вставить("Регламент",		"Согласование цен");
	СписокДоступныхЗначений.Добавить(ОписаниеФормата, "Согласование цен");
	
	// "Согласование цен Тандер"
	ОписаниеФормата = Новый Структура;
	ОписаниеФормата.Вставить("Тип",				"СогласованиеЦен");
	ОписаниеФормата.Вставить("ВерсияТипа",		"3.01.1");
	ОписаниеФормата.Вставить("ПодТип",			"СогласованиеЦен");
	ОписаниеФормата.Вставить("ВерсияПодтипа",	"");
	ОписаниеФормата.Вставить("Регламент",		"Согласование цен Тандер");
	СписокДоступныхЗначений.Добавить(ОписаниеФормата, "Согласование цен Тандер");
	
	// "Согласование цен Виктория Балтия"
	ОписаниеФормата = Новый Структура;
	ОписаниеФормата.Вставить("Тип",				"СогласованиеЦен");
	ОписаниеФормата.Вставить("ВерсияТипа",		"3.01.5");
	ОписаниеФормата.Вставить("ПодТип",			"СогласованиеЦен");
	ОписаниеФормата.Вставить("ВерсияПодтипа",	"");
	ОписаниеФормата.Вставить("Регламент",		"Согласование цен Виктория Балтия");
	СписокДоступныхЗначений.Добавить(ОписаниеФормата, "Согласование цен Виктория Балтия");
	
	// "Согласование цен от сети МОЛЛ"
	ОписаниеФормата = Новый Структура;
	ОписаниеФормата.Вставить("Тип",				"СогласованиеЦен");
	ОписаниеФормата.Вставить("ВерсияТипа",		"3.01");
	ОписаниеФормата.Вставить("ПодТип",			"СогласованиеЦен");
	ОписаниеФормата.Вставить("ВерсияПодтипа",	"");
	ОписаниеФормата.Вставить("Регламент",		"Согласование цен Молния-SPAR");
	СписокДоступныхЗначений.Добавить(ОписаниеФормата, "Согласование цен Молния-SPAR");
	
	// "Согласование цен ВсеИнструменты"
	ОписаниеФормата = Новый Структура;
	ОписаниеФормата.Вставить("Тип",				"СогласованиеЦен");
	ОписаниеФормата.Вставить("ВерсияТипа",		"3.01");
	ОписаниеФормата.Вставить("ПодТип",			"СогласованиеЦен");
	ОписаниеФормата.Вставить("ВерсияПодтипа",	"");
	ОписаниеФормата.Вставить("Регламент",		"Согласование цен ВсеИнструменты");
	СписокДоступныхЗначений.Добавить(ОписаниеФормата, "Согласование цен ВсеИнструменты"); 
	
	// "Согласование цен X5"
	ОписаниеФормата = Новый Структура;
	ОписаниеФормата.Вставить("Тип",				"СогласованиеЦен");
	ОписаниеФормата.Вставить("ВерсияТипа",		"3.01.7");
	ОписаниеФормата.Вставить("ПодТип",			"СогласованиеЦен");
	ОписаниеФормата.Вставить("ВерсияПодтипа",	"");
	ОписаниеФормата.Вставить("Регламент",		"Согласование цен X5");
	СписокДоступныхЗначений.Добавить(ОписаниеФормата, "Согласование цен X5");
	
	// "Согласование цен Дикси"
	ОписаниеФормата = Новый Структура;
	ОписаниеФормата.Вставить("Тип",				"СогласованиеЦен");
	ОписаниеФормата.Вставить("ВерсияТипа",		"3.01.2");
	ОписаниеФормата.Вставить("ПодТип",			"СогласованиеЦен");
	ОписаниеФормата.Вставить("ВерсияПодтипа",	"");
	ОписаниеФормата.Вставить("Регламент",		"Согласование цен Дикси");
	СписокДоступныхЗначений.Добавить(ОписаниеФормата, "Согласование цен Дикси");
	
	// "Импорт остатков ""Русский свет"""
	ОписаниеФормата = Новый Структура;
	ОписаниеФормата.Вставить("Тип",				"СогласованиеЦен");
	ОписаниеФормата.Вставить("ВерсияТипа",		"3.01");
	ОписаниеФормата.Вставить("ПодТип",			"СогласованиеЦен");
	ОписаниеФормата.Вставить("ВерсияПодтипа",	"");
	ОписаниеФормата.Вставить("Регламент",		"Импорт остатков ""Русский свет""");
	СписокДоступныхЗначений.Добавить(ОписаниеФормата, "Импорт остатков ""Русский свет""");
	
	Возврат СписокДоступныхЗначений;

КонецФункции

