
// Функция формирует структуру выгружаемого файла и добавляет его в состав пакета
&НаКлиенте
Функция ПолучитьДанныеИзДокумента1С(Кэш, Контекст) Экспорт
	Перем Файл_Формат, Файл_ВерсияФормата;
		
	Попытка	
		Контекст.Вставить("ТаблДок", Новый Структура());
		Контекст.ТаблДок.Вставить("СтрТабл", Новый Массив);
		
		НоменклатураКодКонтрагента = Кэш.ОбщиеФункции.РассчитатьЗначение("НоменклатураКодКонтрагента", Контекст.ФайлДанные, Кэш);
		Если ЗначениеЗаполнено(НоменклатураКодКонтрагента) Тогда
			Контекст.Вставить("НоменклатураКодКонтрагента",НоменклатураКодКонтрагента);	
		КонецЕсли;
		
		ПолучитьТабличнуюЧастьДокумента1С(Кэш, Контекст);
		Если Контекст.ТаблДок.СтрТабл.Количество() = 0 Тогда // нет такого документа
			
			Возврат Истина;
			
		КонецЕсли;
		
		ПараметрыКонструктораВложения = Новый Структура("ГрязныйИни", Контекст.ФайлДанные);
		ЗаполнитьШапкуДокумента(Кэш, Контекст, ПараметрыКонструктораВложения);

		Вложение	= МодульОбъектаКлиент().НовыйВложениеСБИС(ПараметрыКонструктораВложения);
		ПараметрыВложения	= МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "Параметры");
		Док			= Вложение.СтруктураДокумента;
				
		Контекст.СоставПакета.Вложение.Добавить(Вложение);
		
		Если 	Не	ЗначениеЗаполнено(ПараметрыВложения)
			Или Не	ПараметрыВложения.Свойство("Вызов_сбисПослеФормированияДокумента")
			Или		ПараметрыВложения.Вызов_сбисПослеФормированияДокумента Тогда	
			ОбработчикВФК		= МодульОбъектаКлиент().ПользовательскаяТочкаВхода("сбисПослеФормированияДокумента", ПараметрыВложения.НаборМодулейДляФормата);
			Если ОбработчикВФК <> Неопределено Тогда
				
				Аргумент			= Новый Структура("Док, Кэш, Контекст", Док, Кэш, Контекст);
				ДопПараметрыВызова	= Новый Структура("СообщатьПриОшибке", Истина);
				
				МодульОбъектаКлиент().ВызватьПользовательскуюТочкуВхода(ОбработчикВФК, Аргумент, ДопПараметрыВызова);
				
				Вложение.СтруктураДокумента = Аргумент.Док;			// на случай, если Док поменялся в функции сбисПослеФормированияДокумента
				
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат Истина;
		
	Исключение
		ИсключениеФормирования = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "Файл_Шаблон.ПолучитьШапкуИзДокумента1С");
		Контекст.СоставПакета.Вставить("Ошибка", ИсключениеФормирования);
		Возврат Ложь;
	КонецПопытки;

КонецФункции

&НаКлиенте
Процедура ЗаполнитьШапкуДокумента(Кэш, Контекст, ПараметрыДляЗаполненияВложения)
	
	Файл_Шаблон = МодульОбъектаКлиент().ПолучитьФормуОбработки("Файл_Шаблон");
	
	Док  = Новый Структура;
	Док.Вставить("Файл", Новый Структура);
	Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш, "Файл", Контекст.ФайлДанные, Док.Файл);
	Док.Файл.Вставить("Документ", Новый Структура);
	Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Документ", Контекст.ФайлДанные, Док.Файл.Документ);
	Док.Файл.Документ.Вставить("Основание", Новый Структура);
	
	Валюта = Кэш.ОбщиеФункции.РассчитатьЗначение("Валюта_КодОКВ", Контекст.ФайлДанные, Кэш);
	Если ЗначениеЗаполнено(Валюта) Тогда
		Док.Файл.Документ.Вставить("Валюта", Новый Структура);
		Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш, "Валюта", Контекст.ФайлДанные, Док.Файл.Документ.Валюта);
	КонецЕсли;
	
	Период = Кэш.ОбщиеФункции.РассчитатьЗначение("Период_ДатаНач",	Контекст.ФайлДанные, Кэш);
	Если ЗначениеЗаполнено(Период) Тогда
		Док.Файл.Документ.Вставить("Период", Новый Структура);
		Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш, "Период", Контекст.ФайлДанные, Док.Файл.Документ.Период);
	КонецЕсли;
	
	Если Контекст.ФайлДанные.Свойство("мОснование") Тогда
		ПолучитьДанныеИзДокумента1С_мОснование(Кэш, Док, Контекст);
	КонецЕсли;
	
	Файл_Шаблон.ДобавитьМПараметр(Кэш, Контекст.ФайлДанные, Док.Файл.Документ);
	
	ОтправительРоль	= Кэш.ОбщиеФункции.РассчитатьЗначение("Отправитель_Роль",	Контекст.ФайлДанные, Кэш);
	ПолучательРоль	= Кэш.ОбщиеФункции.РассчитатьЗначение("Получатель_Роль",	Контекст.ФайлДанные, Кэш);
	
	Если Не ЗначениеЗаполнено(ОтправительРоль) Тогда
		ОтправительРоль = "Отправитель";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПолучательРоль) Тогда
		ПолучательРоль = "Получатель";
	КонецЕсли;
	
	Если НЕ Контекст.ФайлДанные.Свойство("мСторона") Тогда
		МодульОбъектаКлиент().ВызватьСбисИсключение(721, "Файл_Шаблон.ПолучитьШапкуИзДокумента1С",,,
			"Не удалось определить ИНН отправителя и получателя документа " + Строка(Контекст.Документ));
		Возврат;
	КонецЕсли;
		
	Для Каждого Параметр Из Контекст.ФайлДанные.мСторона Цикл
		
		Если Параметр.Значение.Свойство("Роль") Тогда
			Роль = Кэш.ОбщиеФункции.РассчитатьЗначение("Роль", Параметр.Значение, Кэш);
		Иначе
			Роль = Кэш.ОбщиеФункции.РассчитатьЗначение("Сторона_Роль", Параметр.Значение, Кэш);
		КонецЕсли;
		
		Сторона = Кэш.ОбщиеФункции.ПолучитьСторону(Кэш, Параметр.Значение);
		
		Если Сторона <> Неопределено Тогда
			
			Док.Файл.Документ.Вставить(Роль, Сторона);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не Док.Файл.Документ.Свойство(ПолучательРоль) Тогда
		МодульОбъектаКлиент().ВызватьСбисИсключение(721, "Файл_Шаблон.ПолучитьШапкуИзДокумента1С",,,
			"Не удалось определить ИНН получателя документа " + Строка(Контекст.Документ));
	КонецЕсли;
	
	Если Не Док.Файл.Документ.Свойство(ОтправительРоль) Тогда
		МодульОбъектаКлиент().ВызватьСбисИсключение(721, "Файл_Шаблон.ПолучитьШапкуИзДокумента1С",,,
			"Не удалось определить ИНН отправителя документа " + Строка(Контекст.Документ));
	КонецЕсли;
	
	Док.Файл.Документ.Вставить("ТаблДок", Контекст.ТаблДок);
		
	ПараметрыДляЗаполненияВложения.Вставить("ОтправительРоль",	ОтправительРоль); 
	ПараметрыДляЗаполненияВложения.Вставить("ПолучательРоль",	ПолучательРоль); 
	ПараметрыДляЗаполненияВложения.Вставить("ДокументФайл",		Док);
		
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТабличнуюЧастьДокумента1С(Кэш, Контекст) Экспорт
	
	Файл_Формат = Кэш.ОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(Файл_Формат);
	Файл_ВерсияФормата = Кэш.ОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(Файл_ВерсияФормата);
	
	МассивВозможныхФорм = Новый Массив;
	Если Контекст.ФайлДанные.Свойство("ФормаФормирования") Тогда
		МассивВозможныхФорм.Добавить(Контекст.ФайлДанные.ФормаФормирования);
	КонецЕсли;
	
	МассивВозможныхФорм.Добавить("Файл_" + Файл_Формат + "_" + Файл_ВерсияФормата);
	МассивВозможныхФорм.Добавить("Файл_Шаблон" + ?(Файл_ВерсияФормата = "3_01", "", "_" + Файл_ВерсияФормата));
	
	ПорядковыйНомер = 1;
	
	Для Каждого Параметр Из Контекст.ФайлДанные.мТаблДок Цикл
		
		// Чтобы одна и та же табличная часть не попадала 2 раза в документ (в СФ, если по документу-основанию формируются дополнительные файлы)
		Если Контекст.Свойство("СписокТЧ") Тогда  
			Если Контекст.СписокТЧ.НайтиПоЗначению(Параметр.Ключ) = Неопределено Тогда
				Контекст.СписокТЧ.Добавить(Параметр.Ключ);
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;		
		
		Если ТипЗнч(Параметр.Значение) = Тип("Массив") Тогда    // стандартная табличная часть
			ТабЧастьДокумента = Параметр.Значение;
		ИначеЕсли ТипЗнч(Параметр.Значение) = Тип("Структура")
			И Лев(Параметр.Значение.ТаблДок, 1) <> "{" Тогда  // табличная часть из одной строки, которая заполняется прямо из реквизитов документа
			ТабЧастьДокумента = Новый Массив;
			ТабЧастьДокумента.Добавить(Параметр.Значение);
		Иначе   // табличная часть вычисляется с помощью функции
			Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Контекст.ФайлДанные, Параметр.Значение);
			ТабЧастьДокумента = Кэш.ОбщиеФункции.РассчитатьЗначение("ТаблДок", Контекст.ФайлДанные, Кэш);
		КонецЕсли;
		
		Если ТипЗнч(ТабЧастьДокумента) <> Тип("Массив") Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыЗаполненияТЧ = Новый Структура;
		ПараметрыЗаполненияТЧ.Вставить("Кэш", Кэш);
		ПараметрыЗаполненияТЧ.Вставить("ТабЧастьДокумента", ТабЧастьДокумента);
		ПараметрыЗаполненияТЧ.Вставить("ПорядковыйНомер", ПорядковыйНомер); 
		ПараметрыЗаполненияТЧ.Вставить("МассивВозможныхФорм", МассивВозможныхФорм);
		ЗаполнитьТабличнуюЧастьДокумента(Контекст, ПараметрыЗаполненияТЧ);
		ПорядковыйНомер = ПараметрыЗаполненияТЧ.ПорядковыйНомер;
		
	КонецЦикла;
	
	Возврат Истина;

КонецФункции	

&НаКлиенте
Процедура ЗаполнитьТабличнуюЧастьДокумента(Контекст, ДопПараметры)
	
	Кэш = ДопПараметры.Кэш;
	ТабЧастьДокумента = ДопПараметры.ТабЧастьДокумента;
	МассивВозможныхФорм = ДопПараметры.МассивВозможныхФорм;
	
	Для Каждого Стр Из ТабЧастьДокумента Цикл
		
		ДобавлятьСтроку = ?(Стр.Свойство("ДобавлятьСтроку"), Стр.ДобавлятьСтроку, Истина);
		НоваяСтрока = Новый Структура;
		Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш, "ТаблДок", Стр, НоваяСтрока);
		НоваяСтрока.Вставить("ПорНомер", Формат(ДопПараметры.ПорядковыйНомер, "ЧГ=0"));
		
		Если Стр.Свойство("мПараметр") Тогда
			
			НоваяСтрока.Вставить("Параметр", Новый Массив);
			
			Для Каждого Элемент Из Стр.мПараметр Цикл
				Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Стр, Элемент.Значение);
				Параметр = Новый Структура();
				Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш, "Параметр", Стр, Параметр);
				НоваяСтрока.Параметр.Добавить(Параметр);
			КонецЦикла;
			
		КонецЕсли;
			
		СуммаНДС = Кэш.ОбщиеФункции.РассчитатьЗначение("СуммаНДС", Стр, Кэш);
		
		Если Стр.Свойство("СуммаНДС") Тогда
			НоваяСтрока.Вставить("НДС",Новый Структура);
			НоваяСтрока.НДС.Вставить("Сумма", СуммаНДС);	
			НоваяСтрока.НДС.Вставить("Ставка", Кэш.ОбщиеФункции.РассчитатьЗначение("СтавкаНДС", Стр, Кэш));	
			НоваяСтрока.НДС.Вставить("ТипСтавки", Кэш.ОбщиеФункции.РассчитатьЗначение("ТипСтавкиНДС", Стр, Кэш));	
		КонецЕсли;
		
		МодульПослеФормированияСтроки = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("сбисПослеФормированияСтроки", МассивВозможныхФорм);
		
		Если МодульПослеФормированияСтроки <> Ложь Тогда
			ДобавлятьСтроку = МодульПослеФормированияСтроки.сбисПослеФормированияСтроки(НоваяСтрока, Кэш, Контекст, Стр);	
		КонецЕсли;
		
		Если ДобавлятьСтроку <> Ложь Тогда
			
			Контекст.ТаблДок.СтрТабл.Добавить(НоваяСтрока);
			ДопПараметры.ПорядковыйНомер = ДопПараметры.ПорядковыйНомер + 1;
			
		КонецЕсли;
		
		// При необходимости проверяем, вся ли номенклатура сопоставлена
		Если Контекст.Свойство("НоменклатураКодКонтрагента")
			И (Не НоваяСтрока.Свойство(Контекст.НоменклатураКодКонтрагента)
				ИЛИ НЕ ЗначениеЗаполнено(НоваяСтрока[Контекст.НоменклатураКодКонтрагента]))  Тогда
			Контекст.СоставПакета.Вставить("Ошибка", "Не вся номенклатура сопоставлена");	
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеИзДокумента1С_мОснование(Кэш, Док, Контекст) Экспорт
	
	// В СогласованиеЦен 3.01 узел Основание - немножественный
	Для Каждого Параметр Из Контекст.ФайлДанные.мОснование Цикл
		
		ВременныйКонтекстФайлДанные = Кэш.ОбщиеФункции.СкопироватьОбъектСПараметрамиКлиент(Контекст.ФайлДанные,,Ложь);
		Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(ВременныйКонтекстФайлДанные,Параметр.Значение);
		Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш, "Основание", ВременныйКонтекстФайлДанные, Док.Файл.Документ.Основание);
		Прервать;
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ЗаполнитьПоДокументОснование(Док, Кэш) Экспорт
     //Заглушка
	
КонецПроцедуры

Процедура СформироватьОснование(Док, Кэш) Экспорт

     //Заглушка
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеВложения(Кэш, Контекст) Экспорт
	
	Файл = Контекст.ФайлДанные.Файл;
	Изменения = Контекст.Изменения;

	Если Изменения.Свойство("Номер") Тогда
		Файл.Документ.Вставить("Номер", Изменения.Номер);
	КонецЕсли;

КонецПроцедуры

