
// Процедура - API для подготовки модуля
//
// Параметры:
//  ПараметрыВходящие	 - Неопределено, Структура			 - основные параметры для подготовки
//  ДопПараметры		 - Неопределено, Строка, Структура	 - расширение
//		Если Неопределено: полная подготовка модуля к работе
//		Если Строка: указан режим
//|			"Полный": аналогично Неопределено
//|			"Реквизиты": подготовка первоначальных реквизитов
//|			"Кэш": подготовить переменную Кэш с установкой привязок
//		Если Структура:
//|			"Режим": аналогично задано строка
//
&НаКлиенте
Процедура ПодготовитьМодуль(ПараметрыВходящие = Неопределено, ДопПараметры = Неопределено) Экспорт
	Перем РежимПодготовки;
	
	Если ТипЗнч(ДопПараметры) = Тип("Строка") Тогда
		
		РежимПодготовки = ДопПараметры;
		
	ИначеЕсли	ДопПараметры = Неопределено
		Или	Не	ДопПараметры.Свойство("Режим", РежимПодготовки) Тогда
		
		РежимПодготовки = "Полный";
		
	КонецЕсли;
	
	РежимПодготовки = НРег(РежимПодготовки);
	
	Если 	РежимПодготовки = "полный"
		Или	РежимПодготовки = "реквизиты" Тогда
		
		Если ПараметрыФормы = Неопределено Тогда
			
			ПриСозданииНаСервере();
			
		КонецЕсли;
		
		УстановитьОсновныеМодули(ПараметрыВходящие);
		
	КонецЕсли;
	
	Если 	РежимПодготовки = "полный"
		Или	РежимПодготовки = "параметрыпользователя" Тогда
	
		МодульОбъектаКлиент().ПоказатьСостояниеSABY("Установка параметров",
			Новый ФиксированнаяСтруктура("Интерфейс", ЭтаФорма));
			
		УстановитьСтартовыеПараметрыПользователя(ПараметрыВходящие);
		
	КонецЕсли;
	
КонецПроцедуры

