
&НаКлиенте
Процедура яВыгрузить_ОтладочнуюИнформацию(ПараметрыВыгрузки)
	
	ПутьККаталогу = ПараметрыВыгрузки.ПутьВыгрузки;
	СписокОтмеченныхДокументов = ТаблДокПолучитьВыбранныеСтроки();
	Если Не СписокОтмеченныхДокументов.Количество() = 1 Тогда
		
		Возврат;
		
	КонецЕсли;

	Если Кэш.Текущий.Раздел = "1" или Кэш.Текущий.Раздел = "2" Тогда
		
		СоставПакета = СписокОтмеченныхДокументов[0].Значение.СоставПакета[0].Значение;
		КаталогЗаписи = МодульОбъектаКлиент().ПрименитьФорматКСтроке(ПутьККаталогу, "СоставПакета", "Каталог");

		ЗначениеФайла	= МодульОбъектаКлиент().ПреобразоватьЗначениеВJSON(СоставПакета);
		ИмяФайла		= Кэш.ОбщиеФункции.СбисЗаменитьНедопустимыеСимволыДляИмениФайла(МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "Название"));
		
		ПараметрыФайла = Новый Структура("Имя, Расширение, Каталог", ИмяФайла, "json", КаталогЗаписи);
		МодульОбъектаКлиент().SabyСохранить(ЗначениеФайла, ПараметрыФайла);
				
	ИначеЕсли Кэш.Текущий.Раздел = "3" или Кэш.Текущий.Раздел = "4" Тогда
		
		Кэш.ОбщиеФункции.СбисСформироватьИнформациюПоДокументам1С(Кэш, ПутьККаталогу, СписокОтмеченныхДокументов[0].Значение.СоставПакета);
		
	КонецЕсли;
	
КонецПроцедуры

