
&НаКлиенте
Процедура ОткрытьФормуСопоставления(Элемент) Экспорт    
	
	ДанныеНоменклатурыЗаполнены = Ложь;
	ТабЧасть = сбисЭлементФормы(ЭтаФорма,"ТабличнаяЧасть");
	
	Для Каждого ПозицияНоменклатурыКонтрагента Из ДанныеНоменклатурДляРасширенногоСопоставления.ПодготовленныеДанныеНоменклатур Цикл
		Если ПозицияНоменклатурыКонтрагента.НоменклатураСБИС.Наименование = ТабЧасть.ТекущиеДанные.Название Тогда
			ДанныеНоменклатурыЗаполнены = Истина;
			ИскомаяНоменклатура = ПозицияНоменклатурыКонтрагента; 
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ДанныеНоменклатурыЗаполнены Тогда
		// TO DO Ду-ду обработать ошибку для пользователя
		Возврат;
	КонецЕсли;
	
	ИскомаяНоменклатура.НоменклатураСБИС.Вставить("Количество", ТабЧасть.ТекущиеДанные.Количество);
	ИскомаяНоменклатура.НоменклатураСБИС.Вставить("Цена", ТабЧасть.ТекущиеДанные.Цена);  
	ИскомаяНоменклатура.НоменклатураСБИС.Вставить("СтавкаНДС", ТабЧасть.ТекущиеДанные.СтавкаНДС);
	ИскомаяНоменклатура.НоменклатураСБИС.Вставить("СуммаНДС", ТабЧасть.ТекущиеДанные.СуммаНДС);
	ИскомаяНоменклатура.НоменклатураСБИС.Вставить("СуммаБезНДС", ТабЧасть.ТекущиеДанные.СуммаБезНал);
	ИскомаяНоменклатура.НоменклатураСБИС.Вставить("Сумма", ТабЧасть.ТекущиеДанные.Сумма);
	
	фрм = МестныйКэш.ГлавноеОкно.сбисПолучитьФорму("ФормаРучногоСопоставленияКонтрагентов");   
	ЗаголовокФормыРучногоСопоставления = "Сопоставления по номенклатуре " +"'" + Табчасть.ТекущиеДанные.Название + "'";

	ДопПараметры = Новый Структура;
	
    фрм.ОписаниеОповещенияОЗакрытии = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПослеРучнойОбработкиСопоставления", ЭтаФорма, ДопПараметры);
	фрм.Показать(Новый Структура("ОсновныеДанные, Кэш, Заголовок", ИскомаяНоменклатура, МестныйКэш, ЗаголовокФормыРучногоСопоставления));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуруВ1С(Команда)
    МестныйКэш.Вставить("РезультатДействия", МестныйКэш.ОбщиеФункции.РезультатДействия_Получить(МестныйКэш,Новый Структура("ПредставлениеОперации", "СозданиеНоменклатуры1С"),Истина));
	ЗагрузитьВложения(1);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСопоставлениеНоменклатуры(Команда)
	
	НеВсяНоменклатураСопоставлена = Ложь;
	Для Каждого НоменклатураСБИС Из ТабличнаяЧасть Цикл
		Если НоменклатураСбис.Статус = 1 Тогда
			НеВсяНоменклатураСопоставлена = Истина;
			Сообщить("Перед сохранением требуется сопоставить всю номенклатуру");
			Возврат;	
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыДляОбновления = Новый Структура("Контрагент, Номенклатура");
	
	ПараметрыДляОбновления.Вставить("Контрагент", СоставПакета.Контрагент);  
	ПараметрыДляОбновления.Вставить("Номенклатура", ДанныеНоменклатурДляРасширенногоСопоставления.ПодготовленныеДанныеНоменклатур);
	
	фрм = МестныйКэш.ГлавноеОкно.сбисНайтиФормуФункции("НоменклатураПоставщика_МассовоеОбновление",МестныйКэш.ФормаРаботыСНоменклатурой,"", МестныйКэш);
	фрм.НоменклатураПоставщика_МассовоеОбновление(ПараметрыДляОбновления, МестныйКэш);
	
	Для Каждого НоменклатураДокумента Из ТабличнаяЧасть Цикл
		НоменклатураДокумента.Статус = 0;
	КонецЦикла;
	ОбновитьСтатусыСопоставления();
		
	Сообщить("Номенклатура успешно сопоставлена"); 
	
КонецПроцедуры

