
&НаКлиенте
Процедура ОткрытьФормуСопоставления(Элемент) Экспорт    
	
	ДанныеНоменклатурыЗаполнены = Ложь;
	ТабЧасть = сбисЭлементФормы(ЭтаФорма,"ТабличнаяЧастьСопоставлениеНоменклатуры");
	
	ТекущиеДанные = ТабЧасть.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные = СопоставлениеНоменклатуры[0];	
	КонецЕсли; 

	ДанныеНоменклатурыЗаполнены = Истина;
	ИскомаяНоменклатура = Вложение.КлассыСопоставленияНоменклатур[ТекущиеДанные.НомерПП - 1]; 
	
	Если НЕ ДанныеНоменклатурыЗаполнены Тогда
		// TO DO Ду-ду обработать ошибку для пользователя
		Возврат;
	КонецЕсли;
	
	ИскомаяНоменклатура.НоменклатураСБИС.Вставить("Количество", ТекущиеДанные.Количество);
	ИскомаяНоменклатура.НоменклатураСБИС.Вставить("Цена", ТекущиеДанные.Цена);  
	ИскомаяНоменклатура.НоменклатураСБИС.Вставить("СтавкаНДС", ТекущиеДанные.СтавкаНДС);
	ИскомаяНоменклатура.НоменклатураСБИС.Вставить("СуммаНДС", ТекущиеДанные.СуммаНДС);
	ИскомаяНоменклатура.НоменклатураСБИС.Вставить("СуммаБезНал", ТекущиеДанные.СуммаБезНал);
	ИскомаяНоменклатура.НоменклатураСБИС.Вставить("Сумма", ТекущиеДанные.Сумма);
	
	фрм = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаРучногоСопоставленияКонтрагентов", Новый Структура("Владелец", ЭтаФорма));   
	ЗаголовокФормыРучногоСопоставления = "Сопоставления по номенклатуре " +"'" + ТекущиеДанные.Название + "'";

	ДопПараметры = Новый Структура;
	
    фрм.ОписаниеОповещенияОЗакрытии = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПослеРучнойОбработкиСопоставления", ЭтаФорма, ДопПараметры);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ОсновныеДанные",				ИскомаяНоменклатура);
	ПараметрыОткрытия.Вставить("Заголовок",						ЗаголовокФормыРучногоСопоставления);
	ПараметрыОткрытия.Вставить("ВложениеСБИС",					Вложение);
	фрм.Показать(ПараметрыОткрытия);	    
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуруВ1С(Команда)
	
	ТекущаяСтрокаНоменклатуры = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма,"ТабличнаяЧастьСопоставлениеНоменклатуры").ТекущиеДанные;
	
	Если ТекущаяСтрокаНоменклатуры = Неопределено Тогда
		Сообщить("Выберите строку для поиска/создания номенклатуры 1С");
		Возврат;
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("ВложениеСБИС", Вложение);
	ПараметрыМетода.Вставить("СоставПакета", СоставПакета);
	ПараметрыМетода.Вставить("НоменклатураСБИС", ТекущаяСтрокаНоменклатуры.Название);
	ПараметрыМетода.Вставить("МассоваяЗагрузка", Ложь);
	
	Результат = МодульОбъектаКлиент().НайтиСоздатьНоменклатуру1СПоНаборуКлассовСопоставления(ПараметрыМетода);	
	
	ОбновитьСтатусыСопоставления(Вложение); 
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма,"ТабличнаяЧастьЗаписатьСопоставлениеНоменклатуры").Доступность = Истина;
	Сообщить(Результат.Сообщение);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСопоставлениеНоменклатуры(Команда)
	
	ПараметрыДляОбновления = Новый Структура("Контрагент, Номенклатура");
	
	ПараметрыДляОбновления.Вставить("Контрагент", СоставПакета.Контрагент);  
	ПараметрыДляОбновления.Вставить("Номенклатура", Вложение.КлассыСопоставленияНоменклатур);
	
	фрм	= МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("МодульСопоставлениеНоменклатуры");
	ДопПараметры = Новый Структура("Кэш, Идентификатор", МестныйКэш, СоставПакета.Идентификатор);
	фрм.НоменклатураПоставщика_МассовоеОбновление(ПараметрыДляОбновления, ДопПараметры);
	
	Для Каждого НоменклатураДокумента Из СопоставлениеНоменклатуры Цикл
		Если НоменклатураДокумента.Статус = 2 Тогда	
			НоменклатураДокумента.Статус = 0;
		КонецЕсли;
	КонецЦикла;
	ОбновитьСтатусыСопоставления(Вложение); 
	
КонецПроцедуры

&НаКлиенте
Процедура сбисТабличнаяЧастьПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если МодульОбъектаКлиент().ИспользоватьНовоеСопоставлениеНоменклатуры() Тогда
		ОформлениеСтроки.Ячейки.Статус.Видимость = Истина;
		ОформлениеСтроки.Ячейки.Статус.ОтображатьТекст = Ложь;
		ОформлениеСтроки.Ячейки.Статус.ОтображатьКартинку = Истина;
		ОформлениеСтроки.Ячейки.Статус.ИндексКартинки = ДанныеСтроки.Статус;	
	Иначе 
		ОформлениеСтроки.Ячейки.Статус.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

