
&НаКлиенте
Процедура ОперацииПодготовкиКЗагрузкеРасширенноеСопоставление(ВложениеСБИС)
	
	ЭлементФормыХарактеристика = сбисЭлементФормы(ЭтаФорма,"ТабличнаяЧастьХарактеристика");
	Если Не МестныйКэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		ЭлементФормыХарактеристика = ЭтаФорма.ЭлементыФормы.ТабличнаяЧасть.Колонки.Характеристика;
	КонецЕсли; 

	ЭлементФормыХарактеристикаПоставщика = сбисЭлементФормы(ЭтаФорма,"ТабличнаяЧастьХарактеристика");
	Если Не МестныйКэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		ЭлементФормыХарактеристикаПоставщика = ЭтаФорма.ЭлементыФормы.ТабличнаяЧасть.Колонки.Характеристика;
	КонецЕсли;
	
	ЭлементФормыХарактеристика.Видимость = Ложь;
	ЭлементФормыХарактеристикаПоставщика.Видимость = Ложь;
	
	ОбновитьСтатусыСопоставления(ВложениеСБИС);

	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧастьОткрытьФормуСопоставления").Доступность = Истина;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧастьСоздатьСопоставитьНоменклатуруВ1С").Доступность = Истина;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ОтметитьВсе").Доступность = Истина;
	
	ЗаполнитьТаблицуДокументов(СоставПакета);
КонецПроцедуры

&НаКлиенте
Процедура ПослеРучнойОбработкиСопоставления(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПоСтрокеСопоставления = Результат;
	
	ОбогащаемаяНоменклатура = Неопределено;
	
	Для Каждого СтрокаСопоставления Из Вложение.КлассыСопоставленияНоменклатур Цикл
		
		Если НЕ СтрокаСопоставления.УИДСтрокиСопоставления = ДанныеПоСтрокеСопоставления.УИДСтрокиСопоставления Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаСопоставления.Номенклатура1С = ДанныеПоСтрокеСопоставления.Номенклатура1С; 
		МодульОбъектаКлиент().СтрокаСопоставленияСБИСКлиент_Вставить(СтрокаСопоставления, "НеобходимоСопоставление", ДанныеПоСтрокеСопоставления.НеобходимоСопоставление);
		ОбогащаемаяНоменклатура = СтрокаСопоставления;
		
		Прервать;	

	КонецЦикла;
	
	ОтборНоменклатуры = Новый Структура();
	ОтборНоменклатуры.Вставить("Название", ОбогащаемаяНоменклатура.НоменклатураСБИС.Наименование); 
	ИскомыеСтрокиНоменклатуры = ТабличнаяЧасть.НайтиСтроки(ОтборНоменклатуры);
	
	Если ИскомыеСтрокиНоменклатуры.Количество() Тогда  
		Для Каждого Номенклатура Из ИскомыеСтрокиНоменклатуры Цикл
			Номенклатура.Статус = 2;
		КонецЦикла;
	Иначе
		Сообщить("Запись ручного сопоставления прошла с ошибкой. Номенклатура 1С не записалась");
	КонецЕсли;
	
	ИмеютсяИзмененияСопоставленнойНоменклатуры = Ложь;
	Для Каждого КлассСопоставления Из Вложение.КлассыСопоставленияНоменклатур Цикл
		Если КлассСопоставления.НеобходимоСопоставление Тогда
			ИмеютсяИзмененияСопоставленнойНоменклатуры = Истина;
			МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма,"ТабличнаяЧастьЗаписатьСопоставлениеНоменклатуры").Доступность = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ИмеютсяИзмененияСопоставленнойНоменклатуры Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма,"ТабличнаяЧастьЗаписатьСопоставлениеНоменклатуры").Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуДокументов(СоставПакета);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыСопоставления(ВложениеСБИС)
	
	Если НЕ ВложениеСБИС.Свойство("КлассыСопоставленияНоменклатур") Тогда
		Возврат;
	КонецЕсли;
	ОтборНоменклатуры = Новый Структура();
	
	ЕстьНесопоставленнаяНоменклатура = Ложь;
	
	Для Каждого ПозицияНоменклатурыСБИС Из ВложениеСБИС.КлассыСопоставленияНоменклатур Цикл
		
		ОтборНоменклатуры.Вставить("Название", ПозицияНоменклатурыСБИС.НоменклатураСБИС.Наименование); 
		НоменклатураВТабличнойЧасти = ТабличнаяЧасть.НайтиСтроки(ОтборНоменклатуры);
		Если НоменклатураВТабличнойЧасти.Количество() Тогда               
			Для Каждого СтрокаНоменклатуры Из НоменклатураВТабличнойЧасти Цикл  
				Если СтрокаНоменклатуры.Статус = 2 Тогда
					Продолжить;
				КонецЕсли; 
				
				Если НЕ ПозицияНоменклатурыСбис.Номенклатура1С.Количество() Тогда
					СтрокаНоменклатуры.Статус = 1;
					ЕстьНесопоставленнаяНоменклатура = Истина;
					Продолжить;
				КонецЕсли;
				
				Для Каждого Номенклатура1С ИЗ ПозицияНоменклатурыСбис.Номенклатура1С Цикл
					Если ЗначениеЗаполнено(Номенклатура1С.Ключ) 
						И ПозицияНоменклатурыСбис.НоменклатураСБИС.Свойство("СопоставленоАвтоматически")
						И ПозицияНоменклатурыСбис.НоменклатураСБИС.СопоставленоАвтоматически
						И ПозицияНоменклатурыСбис.НоменклатураСБИС.НеобходимоСопоставление Тогда 
						СтрокаНоменклатуры.Статус = 2;
					ИначеЕсли ЗначениеЗаполнено(Номенклатура1С.Ключ) Тогда
						СтрокаНоменклатуры.Статус = 0;
					Иначе
						СтрокаНоменклатуры.Статус = 1; 
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ТекущийДокумент = сбисЭлементФормы(ЭтаФорма,"ТаблицаДокументов").ТекущиеДанные;
	Если ЕстьНесопоставленнаяНоменклатура И НЕ ТекущийДокумент = Неопределено Тогда
		ТекущийДокумент.Статус = "Не вся номенклатура сопоставлена.";
		ТекущийДокумент.СтатусКартинка = 1;
	КонецЕсли;
	
КонецПроцедуры	
	
Функция ПолучитьБезопасноеНаименование(ИсходнаяСтрока) Экспорт
	
	Результат = "";
	
	Латиница = "QWERTYUIOPASDFGHJKLZXCVBNMqwertyuiopasdfghjklzxcvbnm";
	Кириллица = "абвгдеёзжийклмнопрстуфхцчшщъыьэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ";
	Цифры = "0123456789";                                                            
	ДопустимыеСимволы = Латиница + Кириллица + Цифры;
	
	Для ПозицияСимвола = 1 по СтрДлина(ИсходнаяСтрока) Цикл
		ТекСимв = Сред(ИсходнаяСтрока, ПозицияСимвола, 1);
		Если Найти(ДопустимыеСимволы, ТекСимв) > 0 Тогда
			Результат = Результат + ТекСимв;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВРЕГ(Результат);
	
КонецФункции

&НаСервере
Функция ПолучитьПустуюСсылкуСправочника(ИмяСправочника)
	
	ИмяПредопределенногоЭлемента = "Справочник." + ИмяСправочника + ".ПустаяСсылка";
	Возврат ПредопределенноеЗначение(ИмяПредопределенногоЭлемента);	
	
КонецФункции

&НаКлиенте
Функция СопоставленияСохраненыПередВыходом() 
	
	Для Каждого СтрокаНоменклатуры Из ТабличнаяЧасть Цикл
		Если СтрокаНоменклатуры.Статус = 2 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьСопоставлениеНоменклатуры_Служебный(ВложениеСБИС)
	
	ПараметрыДляОбновления = Новый Структура("Контрагент, Номенклатура");
	
	ПараметрыДляОбновления.Вставить("Контрагент", СоставПакета.Контрагент);  
	ПараметрыДляОбновления.Вставить("Номенклатура", Вложение.КлассыСопоставленияНоменклатур);
	
	фрм = МестныйКэш.ГлавноеОкно.сбисНайтиФормуФункции("НоменклатураПоставщика_МассовоеОбновление",МестныйКэш.ФормаРаботыСНоменклатурой,"", МестныйКэш);
	ДопПараметры = Новый Структура("Кэш, Идентификатор", МестныйКэш, СоставПакета.Идентификатор);
	фрм.НоменклатураПоставщика_МассовоеОбновление(ПараметрыДляОбновления, ДопПараметры);
	
	Для Каждого НоменклатураДокумента Из ТабличнаяЧасть Цикл
		Если НоменклатураДокумента.Статус = 2 Тогда	
			НоменклатураДокумента.Статус = 0;
		КонецЕсли;
	КонецЦикла;
	ОбновитьСтатусыСопоставления(ВложениеСБИС);
		                                                                     
	Сообщить("Сопоставление номенклатуры успешно записано"); 
	
КонецПроцедуры
