
// Функция - возвращает массив ини с измененным именем под формат Сбис  
//
// Параметры:
//	ДоступныеИниФайлы - Массив - список ини  
//  ИниИзКэш - список ини из Кэш.Ини   
//
// Возвращаемое значение:
// 	Массив - список ини с измененным "ИмяФайлаБезРасширения"  
&НаКлиенте
Функция яДобавитьИмяИниДляОтображения(ДоступныеИниФайлы, ИниИзКэш)
	Перем ЗначениеИни;        
	
	СписокСтрок	= Новый	СписокЗначений();
	Для	Каждого ДоступнаяИни Из ДоступныеИниФайлы Цикл   
		Попытка
			
			Если ДоступнаяИни.Свойство("ИмяФайла") Тогда
				ИмяФайлаБезРасширения = Лев(ДоступнаяИни.ИмяФайла, Найти(ДоступнаяИни.ИмяФайла, ".") - 1);
				ИмяФайлаБезРасширенияБезПрефикса = Сред(ИмяФайлаБезРасширения, Найти(ИмяФайлаБезРасширения, "_") + 1);
			ИначеЕсли Не ДоступнаяИни.Свойство("ИмяФайлаБезРасширения") Тогда
				ИмяФайлаБезРасширения = Лев(ДоступнаяИни.Имя, Найти(ДоступнаяИни.Имя, ".") - 1);
				ИмяФайлаБезРасширенияБезПрефикса = Сред(ИмяФайлаБезРасширения, Найти(ИмяФайлаБезРасширения, "_") + 1); 
			Иначе
				ИмяФайлаБезРасширенияБезПрефикса = ДоступнаяИни.ИмяФайлаБезРасширения; 
			КонецЕсли;
				
			Если Не (ИмяФайлаБезРасширенияБезПрефикса = "Конфигурация" Или Лев(ИмяФайлаБезРасширенияБезПрефикса, 8) = "Загрузка") Тогда
				Если	ИниИзКэш <> Неопределено 
					И	ИниИзКэш.Свойство(ИмяФайлаБезРасширенияБезПрефикса, ЗначениеИни)
					И	ЗначениеЗаполнено(ЗначениеИни) Тогда
					
					Если ЗначениеИни.Свойство("мДокумент") Тогда
						
						ИмяФайлаБезРасширенияБезПрефикса = "Загрузка_Входящий_" + ИмяФайлаБезРасширенияБезПрефикса;   
						
					КонецЕсли; 
					
				ИначеЕсли Прав(ИмяФайлаБезРасширенияБезПрефикса, 5) = "_3_01" 
					Или Прав(ИмяФайлаБезРасширенияБезПрефикса, 5) = "_3_03" Тогда
					ИмяФайлаБезРасширенияБезПрефикса = "Загрузка_Входящий_" + ИмяФайлаБезРасширенияБезПрефикса;
				КонецЕсли; 
			КонецЕсли; 
			Если		ИмяФайлаБезРасширенияБезПрефикса = "Конфигурация"	Тогда
				ПолеСортировки = "а";
			ИначеЕсли Лев(ИмяФайлаБезРасширенияБезПрефикса, 8) = "Загрузка" Тогда
				ПолеСортировки = "я";
			Иначе
				ПолеСортировки = "б";
			КонецЕсли;  
			ДоступнаяИни.Вставить("ИмяФайлаБезРасширения", ИмяФайлаБезРасширенияБезПрефикса);
			
			СписокСтрок.Добавить(ДоступнаяИни,  ПолеСортировки + ДоступнаяИни.ИмяФайлаБезРасширения);  
			
		Исключение
			
			ИнфоОбОшибке = ИнформацияОбОшибке(); 
			СбисИсключение = МодульОбъектаКлиент().НовыйСбисИсключение(ИнфоОбОшибке,
							"ФайлыНастроекКаталог.СбисОпределитьНеобходимостьПроверки", 747201,,
							"В каталоге настроек задано неправильное имя файла: """	+ ДоступнаяИни.Имяфайла + """.
							|Возможные причины: лишние пробелы, недопустимые символы или некорректный формат." +
							"Исправьте имя файла и повторите попытку.");
							
			ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_ВСтроку(СбисИсключение);	

		КонецПопытки;	
	КонецЦикла;
	
	СписокСтрок.СортироватьПоПредставлению();
	Возврат СписокСтрок.ВыгрузитьЗначения(); 
	
КонецФункции // ()

