
&НаКлиенте
Процедура Таблица_Реестр_ПриАктивизацииЯчейки(Элемент)
	Перем ВыделяемыеФлажком;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТабличнаяЧастьОбработка = ЭтаФорма[Элемент.Имя];
	ТекущаяСтрокаЗначение	= Элемент.ТекущиеДанные;
	
	// Строки, отмеченные флажком, не зависимо от способа выделения
	ВсеОтмеченныеСтроки		= ПолучитьСтроки(ТабличнаяЧастьОбработка, Новый Структура("Отмечен", Истина));
	
	// Строки, отмечаемые выделением сейчас
	ТекущиеВыделенныеСтроки		= ПолучитьСтроки(ТабличнаяЧастьОбработка, Элемент.ВыделенныеСтроки);
	ПредыдущиеВыделенныеСтроки	= РаботаВыделенияСтрок.ПредыдущиеВыделенныеСтроки;
	
	Если НЕ ФлагПереходПоРазделуОбновлениеРаздела = Неопределено И ФлагПереходПоРазделуОбновлениеРаздела Тогда
		ИнициализацияРаботыВыделенияСтрок();
		Возврат;
	КонецЕсли;

	
	Если ПредыдущиеВыделенныеСтроки.Количество() = 0 Тогда
		
		РаботаВыделенияСтрок.ПредыдущиеВыделенныеСтроки = ТекущиеВыделенныеСтроки;
		Возврат;
		
	КонецЕсли;
	
	РаботаВыделенияСтрок.ПредыдущиеВыделенныеСтроки = ТекущиеВыделенныеСтроки;

	
	ЗначениеКолонки =  МодульОбъектаКлиент().ПолучитьЗначениеЭлементаФормыОбработки(Элемент, "Заголовок");
		
	Если	ЗначениеКолонки.Заголовок = "Отмечен"
		И	ТекущиеВыделенныеСтроки.Количество() = 1 Тогда
		
		ИзменитьСтроки(ТекущаяСтрокаЗначение, Не ТекущаяСтрокаЗначение.Отмечен);
		ИзменитьОтмеченФлажком(ТекущаяСтрокаЗначение);
		// Запомнить все, что было выделено как отмеченное флажком
		ИзменитьОтмеченФлажком(ПредыдущиеВыделенныеСтроки);
		Возврат;
		
	КонецЕсли;
	
	// Дельта было/стало после выполнения выделения
	ДельтаВыделенныхСтрок	= ДельтаВыделенныхСтрок(ТекущиеВыделенныеСтроки, ПредыдущиеВыделенныеСтроки);
	
	// Строки, отмечаемые флажком
	ВыделяемыеФлажком = РаботаВыделенияСтрок.ОтмеченныеФлажком;
	
	Если ТекущиеВыделенныеСтроки.Количество() = 1 Тогда
		
		Если	Не 	(		ДельтаВыделенныхСтрок.Количество() = 1
					И	Не	ВыделяемыеФлажком.Найти(ДельтаВыделенныхСтрок[0]) = Неопределено) Тогда
			
	 		// Скинуть все выделение, что было, только если была не отметка флажком
	       	ИзменитьСтроки(ДельтаВыделенныхСтрок,	Ложь);
			
		КонецЕсли;
		
		Если ВыделяемыеФлажком.Количество() < 2 Тогда
			
			// Отмеченных флажком нет, или один.
			ИзменитьСтроки(ВыделяемыеФлажком,		Ложь);
			ИзменитьСтроки(ТекущиеВыделенныеСтроки,	Истина);
			
		КонецЕсли;
		
	Иначе
		
		ПолнаяДельта = ДельтаВыделенныхСтрок(ТекущиеВыделенныеСтроки, ПредыдущиеВыделенныеСтроки, ",1левсоед2,2левсоед1,");
		Если ПолнаяДельта.Количество() Тогда
			
			ИзменитьСтроки(ДельтаВыделенныхСтрок,	Ложь);
			ИзменитьСтроки(ТекущиеВыделенныеСтроки,	Истина);
			
		Иначе
			
			// Это клик через Ctrl на уже выделенную строку
			ИзменитьСтроки(ТекущаяСтрокаЗначение,	Ложь);
			ИндексВТекущихВыделенных = ТекущиеВыделенныеСтроки.Найти(ТекущаяСтрокаЗначение);
			Если Не ИндексВТекущихВыделенных = Неопределено Тогда
				
				ТекущиеВыделенныеСтроки.Удалить(ИндексВТекущихВыделенных);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура Таблица_Реестр_ОтмеченПриИзменении(Элемент)
	
	ИзменитьОтмеченФлажком(Элемент.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура Таблица_Реестр_Выбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	ЗначениеКолонки =  МодульОбъектаКлиент().ПолучитьЗначениеЭлементаФормыОбработки(Элемент, "Заголовок");
	Если ЗначениеКолонки.Заголовок = "Отмечен" Тогда
		
		Таблица_Реестр_ПриАктивизацииЯчейки(Элемент);
		Возврат;
		
	КонецЕсли;
	
	ОткрытьДокумент(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка);
	
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Таблица_Реестр_ПриАктивизацииСтроки(Элемент)

	Если Элемент.ТекущиеДанные = Неопределено Тогда
		
		Возврат;      
		
	ИначеЕсли Элемент.ТекущиеДанные.Контрагент = "Загрузить еще" Тогда	
		
		ЗагрузитьЕще(Элемент);  
		Возврат;
		
	КонецЕсли;

КонецПроцедуры 

