
// Функция - создаёт строку сопоставления номенклатуры
//
// Параметры:
//  ИдСБИС	 - 	 - 
//  ИмяСБИС	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Функция НовыйОписаниеНоменклатуры1СКлиент() Экспорт
	
	Возврат Новый Структура("_класс, Характеристики, Идентификатор, GTIN, Единицы, Основное", "ОписаниеНоменклатуры1С", Новый Массив, "", "", Новый Соответствие, Ложь);

КонецФункции

&НаКлиенте
Процедура ОписаниеНоменклатуры1СКлиент_Заполнить(СтрокаСопоставленияСБИС, СопоставлениеЗаполнить) Экспорт
	
	Перем СЛокальнаяПеременная;
	
	НоменклатураСсылка	= СопоставлениеЗаполнить.Номенклатура;
	
	СтрНоменклатура = СтрокаСопоставленияСБИС.Номенклатура1С.Получить(НоменклатураСсылка);
	Если СтрНоменклатура = Неопределено Тогда
		СтрНоменклатура = НовыйОписаниеНоменклатуры1СКлиент();
	КонецЕсли;
	
	
	// Признак основной номенклатуры для сопоставления
	Если НЕ СтрНоменклатура.Основное Тогда
		Если Не СопоставлениеЗаполнить.Свойство("Основное", СЛокальнаяПеременная) Тогда
			СЛокальнаяПеременная = Ложь;
		КонецЕсли;
		СтрНоменклатура.Основное = СЛокальнаяПеременная;
	КонецЕсли;
	
	
	// GTIN
	Если НЕ ЗначениеЗаполнено(СтрНоменклатура.GTIN) Тогда
		Если Не СопоставлениеЗаполнить.Свойство("GTIN_1С", СЛокальнаяПеременная) Тогда
			СЛокальнаяПеременная = "";
		КонецЕсли;
		СтрНоменклатура.GTIN = СокрЛП(СЛокальнаяПеременная);
	КонецЕсли;
	
	
	// Идентификатор номенклатуры 1С
	Если НЕ ЗначениеЗаполнено(СтрНоменклатура.Идентификатор) Тогда
		Если Не СопоставлениеЗаполнить.Свойство("Идентификатор1С", СЛокальнаяПеременная) Тогда
			СЛокальнаяПеременная = Строка(НоменклатураСсылка.УникальныйИдентификатор());
		КонецЕсли;
		СтрНоменклатура.Идентификатор = СокрЛП(СЛокальнаяПеременная);
	КонецЕсли;
	
	
	// Характеристика
	Если		СопоставлениеЗаполнить.Свойство("Характеристика", СЛокальнаяПеременная) Тогда
		// При записи в старых методах приходит Ссылка на характеристику, а при групповом чтении ссылка на характеристику СБИС.
	ИначеЕсли	СопоставлениеЗаполнить.Свойство("Характеристика1С", СЛокальнаяПеременная) Тогда
		// Характеристика 1С по-новому (ссылка)
	КонецЕсли;
	Если 		ЗначениеЗаполнено(СЛокальнаяПеременная)
		И	Не	ТипЗнч(СЛокальнаяПеременная) = Тип("Структура")
		И	Не	ТипЗнч(СЛокальнаяПеременная) = Тип("Строка")
		И	СтрНоменклатура.Характеристики.Найти(СЛокальнаяПеременная) = Неопределено Тогда
		СтрНоменклатура.Характеристики.Добавить(СЛокальнаяПеременная);
	КонецЕсли;
	
	СтрокаСопоставленияСБИС.Номенклатура1С.Вставить(НоменклатураСсылка, СтрНоменклатура);
	
	Если	СопоставлениеЗаполнить.Свойство("ЕдИзм1С", СЛокальнаяПеременная)
		И	ТипЗнч(СЛокальнаяПеременная) = Тип("Массив")
		И	ЗначениеЗаполнено(СЛокальнаяПеременная) Тогда
		
		Для каждого СтрЕдиница Из СЛокальнаяПеременная Цикл
			СопоставлениеДляЕдиницыКлиент_Заполнить1С(СтрокаСопоставленияСБИС, СтрЕдиница);	
		КонецЦикла;	
	Иначе
		СопоставлениеДляЕдиницыКлиент_Заполнить1С(СтрокаСопоставленияСБИС, СопоставлениеЗаполнить);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеНоменклатуры1СКлиент_Получить(ОписаниеНоменклатуры1С, КлючПоиска) Экспорт
	
	Перем Значение, КлючДобавления;
	
	Если		КлючПоиска = "Характеристика" Тогда
		Возврат ОписаниеНоменклатуры1С.Характеристика;
	ИначеЕсли	КлючПоиска = "GTIN" Тогда 
		Возврат ОписаниеНоменклатуры1С.GTIN;
	ИначеЕсли	КлючПоиска = "Единицы" Тогда
		Возврат ОписаниеНоменклатуры1С.Единицы;
	Иначе
		Возврат ОписаниеНоменклатуры1С.Единицы.Получить(КлючПоиска);
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ОписаниеНоменклатуры1СКлиент_Вставить(ОписаниеНоменклатуры1С, КлючВставить, ЗначениеВставить) Экспорт
	
	Перем Значение, КлючДобавления;
	
	Если		КлючВставить = "Характеристика" Тогда
		//ОписаниеНоменклатуры1С.Характеристики.Добавить(ЗначениеВставить);
		ОписаниеНоменклатуры1С.Характеристика = ЗначениеВставить;
	ИначеЕсли	КлючВставить = "GTIN" Тогда 
		ОписаниеНоменклатуры1С.GTIN = ЗначениеВставить;
	ИначеЕсли	КлючВставить = "Единица" Тогда
		ИдЗаписиСбис = СопоставлениеДляЕдиницыКлиент_Ключ(ЗначениеВставить);
		ОписаниеНоменклатуры1С.Единицы.Вставить(ИдЗаписиСбис, ЗначениеВставить);
	КонецЕсли;

КонецПроцедуры

