
// Функция - создает строку сопоставления единицы
//
// Параметры:
//  ИдСБИС	 - 	 - 
//  ИмяСБИС	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Функция НовыйСопоставлениеДляЕдиницыКлиент(ВходящиеДанные = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	ГолыйКласс = Новый Структура("_тип, Коэффициент, ОКЕИ, Название, Ссылка, Владелец", "СопоставлениеДляЕдиницы", "1", "", "", "", "", "");
	
	Если ВходящиеДанные = Неопределено Тогда
		Возврат ГолыйКласс;
	КонецЕсли;
	
	СопоставлениеДляЕдиницыКлиент_ЗаполнитьНаОснованииИсточника(ГолыйКласс, ВходящиеДанные.Источник, ДопПараметры);
	
	Возврат ГолыйКласс;
КонецФункции 

&НаКлиенте
Процедура СопоставлениеДляЕдиницыКлиент_ЗаполнитьНаОснованииИсточника(СопоставлениеДляЕдиницы, Источник, ДопПараметры) Экспорт
	
	Перем ТипИсточника, Владелец;
	
	Если Не ДопПараметры = Неопределено Тогда
		Если Не ДопПараметры.Свойство("ТипИсточника", ТипИсточника) Тогда
			ТипИсточника = Новый Структура;
		КонецЕсли;
		ДопПараметры.Свойство("Владелец", Владелец);
	КонецЕсли;
	
	Если ТипИсточника = "Ссылка" Тогда
		
		
		СопоставлениеДляЕдиницы.Вставить("ОКЕИ", СопоставлениеДляЕдиницыКлиент_ПолучитьПараметрНаСервере(Источник, "Код"));
		СопоставлениеДляЕдиницы.Вставить("Название", СопоставлениеДляЕдиницыКлиент_ПолучитьПараметрНаСервере(Источник, "Наименование"));
		СопоставлениеДляЕдиницы.Вставить("Ссылка", Источник);
		
		Если Не ЗначениеЗаполнено(Владелец) Тогда
			Владелец = СопоставлениеДляЕдиницыКлиент_ПолучитьПараметрНаСервере(Источник, "Владелец");
		КонецЕсли;
		
		СопоставлениеДляЕдиницы.Вставить("Владелец", Владелец);
	Иначе
		ЗаполнитьЗначенияСвойств(СопоставлениеДляЕдиницы, Источник);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СопоставлениеДляЕдиницыКлиент_Ключ(СопоставлениеДляЕдиницы) Экспорт
	
	Если ЗначениеЗаполнено(СопоставлениеДляЕдиницы.Ссылка) Тогда
		Возврат СопоставлениеДляЕдиницы.Ссылка;
	ИначеЕсли ЗначениеЗаполнено(СопоставлениеДляЕдиницы.ОКЕИ) Тогда
		Возврат СопоставлениеДляЕдиницы.ОКЕИ + "_" + СопоставлениеДляЕдиницы.Название;
	Иначе
		Возврат СопоставлениеДляЕдиницы.Название;
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Функция СопоставлениеДляЕдиницыКлиент_Получить(СопоставлениеДляЕдиницы, КлючПоиска) Экспорт
	
	Если КлючПоиска = "Владелец" Тогда
		Если ЗначениеЗаполнено(СопоставлениеДляЕдиницы.Владелец) Тогда
			// Ничего не делаем, владелец уже заполнен
		ИначеЕсли ЗначениеЗаполнено(СопоставлениеДляЕдиницы.Ссылка) Тогда
			// Если ссылка есть, то владелец не должен быть пустым. Прочерк, если в принципе нет.
			Попытка
				// Пока через Try, переделать на параметр от ини конфигурации
				СопоставлениеДляЕдиницы.Владелец = СопоставлениеДляЕдиницы.Ссылка.Владелец;
			Исключение
			КонецПопытки;
			Если Не ЗначениеЗаполнено(СопоставлениеДляЕдиницы.Владелец)
					Или Не ЭтоСсылкаНаСправочникНоменклатуры(СопоставлениеДляЕдиницы.Владелец) Тогда
						// TODO Добавить передачу вида справочника номенклатуры вторым параметром
				// Не удалось установить владельца. Вроде не должно быть ошибкой
				СопоставлениеДляЕдиницы.Владелец = "-";
			КонецЕсли;
		Иначе
			СопоставлениеДляЕдиницы.Владелец = "";
		КонецЕсли;
		Возврат СопоставлениеДляЕдиницы.Владелец;
	ИначеЕсли КлючПоиска = "Единица"
				ИЛИ КлючПоиска = "Ссылка" Тогда
		КлючПоиска = "Ссылка"; // Подменяем ключ поиска для совместимости
		Попытка
			// На УФ всего 1 вариант. На ОФ нашел 3.
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				МетаданныеНоменклатурыРеквизиты = СопоставлениеДляЕдиницы.Владелец.Метаданные().Реквизиты;
				Если МетаданныеНоменклатурыРеквизиты.Найти("БазоваяЕдиницаИзмерения") <> Неопределено Тогда
					КлючПараметра = "БазоваяЕдиницаИзмерения";
				ИначеЕсли МетаданныеНоменклатурыРеквизиты.Найти("ЕдиницаИзмерения") <> Неопределено Тогда
					КлючПараметра = "ЕдиницаИзмерения";	
				Иначе
					КлючПараметра = "БазоваяЕдиница";
				КонецЕсли; 
			#Иначе
				КлючПараметра = "ЕдиницаИзмерения";
			#КонецЕсли
			СопоставлениеДляЕдиницы.Ссылка = СопоставлениеДляЕдиницыКлиент_ПолучитьПараметрНаСервере(СопоставлениеДляЕдиницы.Владелец, КлючПараметра);
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	Иначе
		
		// Словили неожиданный ключ? Хреново, но ситуация исключительная, пока не обрабатываем
		Попытка
			Возврат СопоставлениеДляЕдиницы[КлючПоиска]; 
		Исключение 
			Возврат Неопределено;
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат СопоставлениеДляЕдиницы[КлючПоиска];
	
КонецФункции

&НаКлиенте
Процедура СопоставлениеДляЕдиницыКлиент_Вставить(СопоставлениеДляЕдиницы, КлючВставить, ЗначениеВставить) Экспорт
	
	Перем КлючДобавитьВДанные, ЗначениеЗаполнить;
	
	Если		КлючВставить = "Ссылка" Тогда
		Если ЗначениеЗаполнено(ЗначениеВставить) Тогда
			
			СопоставлениеДляЕдиницы.Ссылка = ЗначениеВставить;
			
			// Если ссылка есть, то владелец не должен быть пустым. Прочерк, если в принципе нет.
			Попытка
				СопоставлениеДляЕдиницы.Владелец = ЗначениеВставить.Владелец;
			Исключение
			КонецПопытки;
			ВидыСправочниковНоменклатуры = ПолучитьЗначениеПараметраСбис("ВидыСправочниковНоменклатуры");
			Если НЕ ЗначениеЗаполнено(СопоставлениеДляЕдиницы.Владелец)
					Или Не ЭтоСсылкаНаСправочникНоменклатуры(СопоставлениеДляЕдиницы.Владелец, ВидыСправочниковНоменклатуры) Тогда
				// Не удалось установить владельца. Вроде не должно быть ошибкой
				СопоставлениеДляЕдиницы.Владелец = "-";
			КонецЕсли;
			
		Иначе
			
			СопоставлениеДляЕдиницы.Владелец = "";
			
		КонецЕсли;
	ИначеЕсли КлючВставить = "Владелец" Тогда
		 СопоставлениеДляЕдиницы.Владелец = ЗначениеВставить;
	ИначеЕсли	КлючВставить = "Название" Тогда
		
		Если ЗначениеЗаполнено(ЗначениеВставить) Тогда
			СопоставлениеДляЕдиницы.Название = ЗначениеВставить;
		Иначе
			СопоставлениеДляЕдиницы.Название = Строка(СопоставлениеДляЕдиницы.Ссылка);
		КонецЕсли;
		
	ИначеЕсли	КлючВставить = "Коэффициент" Тогда
		
		Если ЗначениеЗаполнено(ЗначениеВставить) Тогда
			СопоставлениеДляЕдиницы[КлючВставить] = ЗначениеВставить;
		Иначе
			СопоставлениеДляЕдиницы[КлючВставить] = "1";
		КонецЕсли;
		
	ИначеЕсли	СопоставлениеДляЕдиницы.Свойство(КлючВставить) Тогда
		
		СопоставлениеДляЕдиницы[КлючВставить] = ЗначениеВставить;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеДляЕдиницыКлиент_Заполнить(СопоставлениеДляЕдиницы, Источник, КлючПоиска, ДопПараметры = Неопределено) Экспорт
	
	Перем КлючДобавитьВДанные, ЗначениеЗаполнить;
	
	Если Не ДопПараметры.Свойство("Ключ", КлючДобавитьВДанные) Тогда 
		КлючДобавитьВДанные = КлючПоиска;
	КонецЕсли;
	Если	Не	Источник.Свойство(КлючПоиска, ЗначениеЗаполнить)
		Или Не	ЗначениеЗаполнено(ЗначениеЗаполнить) Тогда
		Возврат;
	КонецЕсли;
	
	СопоставлениеДляЕдиницы.Вставить(КлючДобавитьВДанные, ЗначениеЗаполнить);
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеДляЕдиницыКлиент_Заполнить1С(СтрокаНоменклатуры1С, СопоставлениеЗаполнить, ДопПараметры = Неопределено) Экспорт
	
	Перем СЛокальнаяПеременная;
	
	Если		СопоставлениеЗаполнить.Свойство("ЕдИзмОрг", СЛокальнаяПеременная) Тогда
		// Наименование единицы измерения в старом формате
	ИначеЕсли	СопоставлениеЗаполнить.Свойство("ЕдИзм1С", СЛокальнаяПеременная) Тогда
		// Наименование единицы измерения в новом формате
	КонецЕсли;
	
	Если	ЗначениеЗаполнено(СЛокальнаяПеременная)
		И	СтрокаНоменклатуры1С.Единицы.Получить(СЛокальнаяПеременная) = Неопределено Тогда
		ЕдиницаСопоставление = НовыйСопоставлениеДляЕдиницыКлиент();
		СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСопоставление, "Ссылка", СЛокальнаяПеременная);
	Иначе
		Возврат;
	КонецЕсли;
	
	Если СопоставлениеЗаполнить.Свойство("Ссылка") Тогда
		Владелец = СопоставлениеЗаполнить.Ссылка;
	Иначе
		Владелец = СопоставлениеЗаполнить.Номенклатура;
	КонецЕсли;
	
	СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСопоставление, "Владелец", Владелец); // Владелец у единицы должен быть заполнен всегда
	
	Если	СопоставлениеЗаполнить.Свойство("ОКЕИ_1С", СЛокальнаяПеременная)
		И	ЗначениеЗаполнено(СЛокальнаяПеременная) Тогда    
		ОКЕИ = СопоставлениеЗаполнить.ОКЕИ_1С; 
	ИначеЕсли СопоставлениеЗаполнить.Свойство("ОКЕИ_1С", СЛокальнаяПеременная)
		И	ЗначениеЗаполнено(СЛокальнаяПеременная) Тогда
		ОКЕИ = СопоставлениеЗаполнить.ОКЕИ; 
	Иначе
		ОКЕИ = "796" // По умолчанию ставим штуки, на онлайн делать запрос без ОКЕИ нельзя (с) Сыч
	КонецЕсли;
	
	СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСопоставление, "ОКЕИ", ОКЕИ);
	
	Если		СопоставлениеЗаполнить.Свойство("Коэффициент",	СЛокальнаяПеременная) Тогда
		// Коэффициент в старом формате
	ИначеЕсли	СопоставлениеЗаполнить.Свойство("Коэффициент1С",	СЛокальнаяПеременная) Тогда
		// Коэффициент в новом формате
	КонецЕсли;
	Если ЗначениеЗаполнено(СЛокальнаяПеременная) Тогда
		СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСопоставление, "Коэффициент", СЛокальнаяПеременная);
	КонецЕсли;
	
	Если	СопоставлениеЗаполнить.Свойство("ЕдИзмНаименование1С",	СЛокальнаяПеременная)
		И	ЗначениеЗаполнено(СЛокальнаяПеременная) Тогда
		СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСопоставление, "Название", СЛокальнаяПеременная);
	Иначе
		СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСопоставление, "Название", Строка(ЕдиницаСопоставление.Ссылка));
	КонецЕсли;	
	
	ОписаниеНоменклатуры1СКлиент_Вставить(СтрокаНоменклатуры1С, "Единица", ЕдиницаСопоставление);

КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеДляЕдиницыКлиент_ЗаполнитьСБИС(СтрокаСопоставленияСБИС, СопоставлениеЗаполнить) Экспорт
	
	Перем СЛокальнаяПеременная;
	
	ЕдиницаСопоставление = НовыйСопоставлениеДляЕдиницыКлиент();
	
	Если		СопоставлениеЗаполнить.Свойство("ЕдИзмОКЕИ", СЛокальнаяПеременная) Тогда 
		// ОКЕИ в старом формате вариант 1	
	ИначеЕсли	СопоставлениеЗаполнить.Свойство("ОКЕИ", СЛокальнаяПеременная) Тогда
		// ОКЕИ в старом формате вариант 2
	ИначеЕсли	СопоставлениеЗаполнить.Свойство("ЕдИзмОКЕИ_СБИС", СЛокальнаяПеременная) Тогда
		// ОКЕИ в новом формате вариант 1
	ИначеЕсли	СопоставлениеЗаполнить.Свойство("ОКЕИ_СБИС", СЛокальнаяПеременная) Тогда
		// ОКЕИ в новом формате вариант 2
	КонецЕсли;
	Если ЗначениеЗаполнено(СЛокальнаяПеременная) Тогда
		СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСопоставление, "ОКЕИ", СЛокальнаяПеременная);
	КонецЕсли;
	
	Если		СопоставлениеЗаполнить.Свойство("ЕдИзмНаименование",	СЛокальнаяПеременная) Тогда
		// Наименование единицы измерения в старом формате вариант 1
	ИначеЕсли 	СопоставлениеЗаполнить.Свойство("ЕдИзм",				СЛокальнаяПеременная) Тогда
		// Наименование единицы измерения в старом формате вариант 2
	ИначеЕсли	СопоставлениеЗаполнить.Свойство("ЕдИзмНаименованиеСБИС",СЛокальнаяПеременная) Тогда
		// Наименование единицы измерения в новом формате
	КонецЕсли;	
	Если ЗначениеЗаполнено(СЛокальнаяПеременная) Тогда
		СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСопоставление, "Название", СЛокальнаяПеременная);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЕдиницаСопоставление.ОКЕИ) И Не ЗначениеЗаполнено(ЕдиницаСопоставление.Название) Тогда
		Возврат;	
	КонецЕсли;
	
	Если СопоставлениеЗаполнить.Свойство("КоэффициентСБИС",	СЛокальнаяПеременная) Тогда
		// Коэффициент в новом формате
	КонецЕсли;
	Если ЗначениеЗаполнено(СЛокальнаяПеременная) Тогда
		СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСопоставление, "Коэффициент", СЛокальнаяПеременная);
	КонецЕсли;
	
	СтрокаСопоставленияСБИСКлиент_Вставить(СтрокаСопоставленияСБИС, "Единица", ЕдиницаСопоставление);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СопоставлениеДляЕдиницыКлиент_ПолучитьПараметрНаСервере(Ссылка, КлючПараметра)
	
	ОбъектПоиска = Ссылка.ПолучитьОбъект();
	Возврат ОбъектПоиска[КлючПараметра];
	
КонецФункции

