
&НаКлиенте
Процедура ФильтрУстановитьВидимость(Раздел)

	РазделДляЭлементов	= Раздел;
	Если		РазделДляЭлементов = "ФормаСопоставитьСДокументами1С" Тогда
		
		ФильтрПериодУстановитьВидимость(ФильтрПериод, Раздел);
		
	ИначеЕсли   РазделДляЭлементов = "ФормаГлавноеОкноНоменклатура" Тогда
		
		//Не меняется
		
	Иначе
			
		ПутьЭлементов = "ВариантыФильтров." + РазделДляЭлементов + ".";
		ФильтрПериодУстановитьВидимость(ФильтрПериод, "");
		
		ЭлементФильтрКонтрагент		= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, ПутьЭлементов + "КонтрагентГруппа.ФильтрКонтрагент");
		ЭлементФильтрОрганизация	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, ПутьЭлементов + "ФильтрОрганизация");
		ЭлементФильтрСостояние		= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, ПутьЭлементов + "ФильтрСостояние");

		ЭлементФильтрКонтрагент.Видимость	= Истина;
		ЭлементФильтрОрганизация.Видимость	= Истина;
		ЭлементФильтрСостояние.Видимость	= Истина;
		
	КонецЕсли;

	ФильтрУстановитьВидимость_ТочкаВхода();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПериодУстановитьВидимость(Период, Раздел = "")

	Если Не ЗначениеЗаполнено(Период) Тогда
		
		ЭлементФильтрПериод	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, Раздел + "ФильтрПериод");
		Период				= ЭлементФильтрПериод.СписокВыбора.НайтиПоИдентификатору(0).Значение;
		
	КонецЕсли;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, Раздел + "СПо").Видимость = Период = "За период";
	//МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, Раздел + "ФильтрДатаКнц").Видимость = Период = "За период";
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрУстановитьВидимость_ТочкаВхода()

	МодульОбработки = МодульОбъектаКлиент();
	
	ЛокальныйКэш	= МодульОбработки.ПолучитьТекущийЛокальныйКэш();
	НазваниеРаздела = МодульОбработки.СтруктураРазделаГО_Получить(ЛокальныйКэш.Текущий, "Название");
	ТипРаздела		= МодульОбработки.СтруктураРазделаГО_Получить(ЛокальныйКэш.Текущий, "Тип");

	НаборФормПоиска = Новый Массив;
	НаборФормПоиска.Добавить("Раздел_" + НазваниеРаздела + "_" + ТипРаздела);
	НаборФормПоиска.Добавить("Раздел_" + НазваниеРаздела + "_Шаблон");

	КлиентскаяТочкаВхода = МодульОбработки.НайтиФункциюСеансаОбработки("ФильтрУстановитьВидимость", НаборФормПоиска);
	КлиентскаяТочкаВхода.ФильтрУстановитьВидимость(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрУстановитьТипыПолей_ПривестиПоле(ФильтрЭлемент, КлючФильтра)
	Перем ОписаниеТипа;
	
	ОписаниеТиповФильтра = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолейФильтра");
	Попытка
		
		ОписаниеТипа					= ОписаниеТиповФильтра[КлючФильтра];
		ФильтрЭлемент.ОграничениеТипа	= ОписаниеТипа;
		ФильтрЭлемент.ВыбиратьТип		= Ложь;
		ЭтаФорма[КлючФильтра]			= ОписаниеТипа.ПривестиЗначение();
		
	Исключение
		
		ОшибкаУстановкиФильтра = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "ФайлыНастроекОбщее.ФильтрУстановитьТипыПолей_ПривестиПоле");
		МодульОбъектаКлиент().СообщитьСбисИсключение(ОшибкаУстановкиФильтра, Новый Структура("СтатусСообщения", "message"));
		
	КонецПопытки;
	
КонецПроцедуры

#Область include_core2_vo2_Формы_ФормаУстановкиФильтра_Интерфейс_Команды
#КонецОбласти

#Область include_core2_vo2_Формы_ФормаУстановкиФильтра_Интерфейс_События
#КонецОбласти

#Область include_core2_vo2_Формы_ФормаУстановкиФильтра_Интерфейс_ОбщиеФункции
#КонецОбласти

