
&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыОткрытия)
	
	Если Не ПараметрыФормы.Инициирована Тогда
		
		ПодготовитьФормуКРаботе_Общее(ПараметрыОткрытия);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Подготовить форму к работе без открытия
//
// Параметры:
//  ПараметрыОткрытия	 - 	 - 
//
&НаКлиенте
Процедура ПодготовитьФормуКРаботе(ПараметрыОткрытия) Экспорт
	
	ФормаУстановитьОбщее(ПараметрыОткрытия);
	ПодготовитьФормуКРаботе_Общее(ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьФормуКРаботе_Общее(ПараметрыОткрытия)
    Перем ИмяЗакладкиУстановить, РазделФильтра;
	
	Если Не ПараметрыОткрытия = Неопределено Тогда
		
		ПараметрыОткрытия.Свойство("ВариантФильтра",	ИмяЗакладкиУстановить);
		ПараметрыОткрытия.Свойство("Раздел",			РазделФильтра);
		
	КонецЕсли;
	
	Если ИмяЗакладкиУстановить = Неопределено Тогда
		
		ИмяЗакладкиУстановить = ВладелецФормы.НазваниеКратко();
		
	КонецЕсли;
	
	Если РазделФильтра = Неопределено Тогда
		
		Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
		РазделФильтра = Кэш.Текущий;
		
	КонецЕсли;
	
	РазделГО = РазделФильтра;
	
	ПанельУстановки		= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, 		"ВариантыФильтров");
	СтраницаУстановить	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ПанельУстановки,	ИмяЗакладкиУстановить);

	ПанельУстановки.ТекущаяСтраница = СтраницаУстановить;
	
	Если		ИмяЗакладкиУстановить = "ФормаСопоставитьСДокументами1С" Тогда
		
		ПодготовитьФормуКРаботе_Общее_ФормаСопоставитьСДокументами1С(ПараметрыОткрытия);
		
	ИначеЕсли   ИмяЗакладкиУстановить = "ФормаГлавноеОкноНоменклатура" Тогда
		
		ПодготовитьФормуКРаботе_Общее_ФормаГлавноеОкноНоменклатура(ПараметрыОткрытия);
		
	Иначе
		
		ПодготовитьФормуКРаботе_Общее_ФормаГлавноеОкно(ПараметрыОткрытия);
		
	КонецЕсли;
		
КонецПроцедуры
                                                                      	
&НаКлиенте
Процедура ПодготовитьФормуКРаботе_Общее_ФормаГлавноеОкноНоменклатура(ПараметрыОткрытия)
	
	ПараметрыФильтра = ЗначенияФильтровПоРазделу(ПараметрыОткрытия.ВариантФильтра);
	ЗаполнитьЗначенияСвойств(ПараметрыФильтра, ПараметрыОткрытия.Источник);
	
	ПараметрыФильтра.Свойство("ФильтрМаска", ФильтрМаска);
	ПараметрыФильтра.Свойство("ФильтрТипНоменклатуры", ПараметрПроизвольныйФильтр1);
	ПараметрыФильтра.Свойство("ФильтрНоменклатура", ПараметрПроизвольныйФильтр2);	
	ПараметрыФильтра.Свойство("ФильтрGTIN", ПараметрПроизвольныйФильтр3);
	ПараметрыФильтра.Свойство("ФильтрКодКонтрагента", ПараметрПроизвольныйФильтр4);
	
	МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	ТипыПолейФильтра = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолейФильтра");
	ОписаниеСтроки = Новый ОписаниеТипов("Строка");
	
	Для каждого Фильтр Из ПараметрыФильтра Цикл
		
		Если МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, Фильтр.Ключ) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеИзменить = Новый Структура("Форма, Реквизит", ЭтаФорма, Фильтр.Ключ);
		ИзмененияЭлементов = Новый Структура("УстановитьОграничениеТипа");
		Если НЕ ТипыПолейФильтра.Свойство(Фильтр.Ключ, ИзмененияЭлементов.УстановитьОграничениеТипа) Тогда
			ИзмененияЭлементов.УстановитьОграничениеТипа = ОписаниеСтроки;
		КонецЕсли;
		МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеИзменить, ИзмененияЭлементов);
	
	КонецЦикла;
	
	ОписаниеИзменить = Новый Структура("Форма, Реквизит", ЭтаФорма, "ФильтрНоменклатура");
	ИзмененияЭлементов = Новый Структура("ВыборГруппИЭлементов", "Группы");
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеИзменить, ИзмененияЭлементов);
	
	ФильтрУстановитьВидимость_ТочкаВхода();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьФормуКРаботе_Общее_ФормаГлавноеОкно(ПараметрыОткрытия)
	
	МодульОбработки = МодульОбъектаКлиент();
	
	//ФильтрыОтВладельцаИспользуются = "ФильтрДатаНач, ФильтрДатаКнц, ФильтрСостояние, ФильтрТипыДокументов, ФильтрКонтрагент,
	//| ФильтрКонтрагентПодключен, ФильтрКонтрагентСФилиалами, ФильтрОрганизация, ФильтрОтветственный, ФильтрМаска";
	
	ЭлементФильтрТипыДокументов = МодульОбработки.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ФильтрТипыДокументов");
	ЭлементФильтрТипыДокументов.СписокВыбора.Очистить();

	ЭлементФильтрСостояния = МодульОбработки.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ФильтрСостояние");
	ЭлементФильтрСостояния.СписокВыбора.ЗагрузитьЗначения(ВладелецФормы.СписокСостояний.ВыгрузитьЗначения());
	
	Для Каждого ЭлементСписка Из МодульОбработки.ФильтрТипыДокументовСписок() Цикл
		
		ЭлементФильтрТипыДокументов.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		
	КонецЦикла;
	
	Если Не ПараметрыОткрытия.Источник.ФильтрПериод = Неопределено Тогда
			
		ФильтрПериод = ПараметрыОткрытия.Источник.ФильтрПериод;
		
	КонецЕсли;
	
	//По умолчанию устанавливаем видимость для полей Контрагент,Состояние,Организация
	ПутьЭлементов = "ВариантыФильтров." + ИмяТекущегоВариантаФильтра() + ".";
	
	ЭлементФильтрКонтрагент		= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, ПутьЭлементов + "КонтрагентГруппа.ФильтрКонтрагент");
	ЭлементФильтрОрганизация	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, ПутьЭлементов + "ФильтрОрганизация");
	ЭлементФильтрОтветственный	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, ПутьЭлементов + "ФильтрОтветственный");
	ЭлементФильтрТС				= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, ПутьЭлементов + "ФильтрТС");
	ЭлементФильтрТСНадпись		= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, ПутьЭлементов + "ФильтрТС.Надпись");

	ФильтрУстановитьТипыПолей_ПривестиПоле(ЭлементФильтрКонтрагент,		"ФильтрКонтрагент"); 
	ФильтрУстановитьТипыПолей_ПривестиПоле(ЭлементФильтрОрганизация,	"ФильтрОрганизация");
	ФильтрУстановитьТипыПолей_ПривестиПоле(ЭлементФильтрОтветственный,	"ФильтрОтветственный");
	
	ФильтрУстановитьВидимость(ИмяТекущегоВариантаФильтра());
		
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ПараметрыОткрытия.Источник);
	
	ПараметрыBlockly = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ПараметрыBlockly");
	ПараметрыРаздела = МодульОбъектаКлиент().РазделГО_Получить(ПараметрыОткрытия.Раздел, "ПараметрыРаздела");
	ФормаДиалогаВыбораВО3 = МодульОбъектаКлиент().ПолучитьФормуОбработки("ДиалогВыбораИзСписка", ПараметрыОткрытия);
	
	ДоступенФильтрПоТС = ПараметрыBlockly.Свойство("Доступно_ТорговаяСеть_list")
		И ПараметрыBlockly.Доступно_ТорговаяСеть_list
		И ПараметрыРаздела.Свойство("ДоступенФильтрПоТС")
		И ПараметрыРаздела.ДоступенФильтрПоТС
		И ФормаДиалогаВыбораВО3 <> Ложь;
		
	ЭлементФильтрТС.Видимость = ДоступенФильтрПоТС;
	ЭлементФильтрТСНадпись.Видимость = ДоступенФильтрПоТС;
	ЭлементФильтрТС.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(ФильтрТС) Тогда
		ЭлементФильтрТС.СписокВыбора.Добавить(ФильтрТС, ФильтрТС.Название);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьФормуКРаботе_Общее_ФормаСопоставитьСДокументами1С(ПараметрыОткрытия)
	
	ФильтрыИспользуются	= "ФильтрДатаНач, ФильтрДатаКнц, ФильтрПериод";
	ЗначенияФильтров	= ПараметрыОткрытия.Фильтры;
	
	Если ЗначенияФильтров.ФильтрСтатусСопоставления = Неопределено Тогда
		
		ПараметрПроизвольныйФильтр1 = "";
		
	Иначе
		
		ПараметрПроизвольныйФильтр1 = ЗначенияФильтров.ФильтрСтатусСопоставления;
		
	КонецЕсли;
	
	Если ЗначенияФильтров.ФильтрДельта = Неопределено Тогда
		
		ПараметрПроизвольныйФильтр2 = "";
		
	Иначе
		
		ПараметрПроизвольныйФильтр2 = ЗначенияФильтров.ФильтрДельта;
		
	КонецЕсли;

	ФильтрМаска = ЗначенияФильтров.ФильтрНомер;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ЗначенияФильтров, ФильтрыИспользуются);
	
	ФильтрУстановитьВидимость(ИмяТекущегоВариантаФильтра());
		
КонецПроцедуры	

