
&НаКлиенте
Функция СБИС_РасшифроватьФайл(Кэш, param, ДопПараметры, Отказ) Экспорт

	ВызватьИсключение "Невозможно расшифровать файл.";

КонецФункции

&НаКлиенте
Функция СБИС_СериализоватьСтрокуВBase64(Кэш, ПараметрыСериализовать, ДопПараметры, Отказ) Экспорт
	Возврат сбисСтрокаВBASE64(ПараметрыСериализовать.Строка);
КонецФункции

&НаКлиенте
Функция СБИС_СериализоватьФайлВBase64(Кэш, ПараметрыСериализовать, ДопПараметры, Отказ) Экспорт
	Возврат сбисФайлСКлиентаВBASE64(ПараметрыСериализовать.ПолноеИмяФайла);
КонецФункции  

//Функция сохраняет по ссылке в файл в зависимости от среды и настройки "вызовы на клиенте".
//При успехе возвращает ссылку на файл, куда сохранили
//При неудаче структуру ошибки
&НаКлиенте
Функция СБИС_СохранитьПоСсылкеВФайл(Кэш, ПараметрыФайла, ДопПараметры, Отказ) Экспорт
	Перем ИмяФайлаПолучить;
	
	ПараметрыФайла.Свойство("ИмяФайла", ИмяФайлаПолучить);
	ПараметрыВызова		= Новый Структура("АдресРесурса", ПараметрыФайла.Ссылка);
	Результат			= API_ОтправитьИОбработатьКоманду_Переадресация(Кэш, "Get", ПараметрыВызова, Новый Структура, Отказ);
	
	Если Отказ Тогда
		
		Возврат МодульОбъектаКлиент().НовыйСбисИсключение(Результат, "СБИС.СохранитьПоСсылкеВФайл");
		
	ИначеЕсли Результат.Свойство("ВременноеХранилище") Тогда
		
		Если Не ЗначениеЗаполнено(ИмяФайлаПолучить) Тогда
			
			ИмяФайлаПолучить = МодульОбъектаКлиент().НовыйВременныйФайл();
			
		КонецЕсли;

		Результат = СбисПолучитьФайлНаКлиент(Кэш, ИмяФайлаПолучить, Результат.ВременноеХранилище, Отказ);
		Если Отказ Тогда
			
			Возврат МодульОбъектаКлиент().НовыйСбисИсключение(Результат, "СБИС.СохранитьПоСсылкеВФайл");
			
		КонецЕсли; 
		
		Результат = ИмяФайлаПолучить;
		
	ИначеЕсли ЗначениеЗаполнено(ИмяФайлаПолучить) Тогда
			
		ПереместитьФайл(Результат.Путь, ИмяФайлаПолучить);
		Результат = ИмяФайлаПолучить;
		
	Иначе
		
		Результат = Результат.Путь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Функция записи по ссылке в файл в серверном контексте с возвратом ошибки.
//ПараметрыПолучения:
//	СБИС, парам - аналогичные параметры из Кэш.
//ПараметрыЗапроса: 
//	АдресРесурса	- ссылка на дданные
//	ПутьКФайлу		- ссылка на выбранный адрес для записи. Если не указан, пишем во временный каталог
//Возвращает Строку пути к файлу при успехе, структуру ошибки при неудаче. Неудача отслеживается по флагу Отказа.
&НаСервере
Функция СБИС_СохранитьПоСсылкеВФайл_Сервер(Знач Кэш, Знач ПараметрыЗапроса, Отказ)
	
	Результат = МодульОбъектаСервер().API_ОтправитьИОбработатьКоманду(Кэш, "Get", ПараметрыЗапроса, Новый Структура, Отказ);
	Если Отказ Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	//Файл сохранен, помещаем в хранилище для возврата с клиента на сервер.
	Возврат ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Результат.Путь));
	
КонецФункции

&НаКлиенте
Функция СБИС_ПолучитьПараметрыПакетаДляОткрытияОнлайн(ОписаниеПакета, ДопПараметры) Экспорт
	Кэш = ДопПараметры.Кэш;
	Если	ОписаниеПакета.ИдАккаунта = "" Тогда
		Возврат Новый Структура("ИдДокумента, Тикет", ОписаниеПакета.ИдДокумента, "");
	Иначе
		ДанныеТикета = Кэш.СБИС.МодульОбъектаКлиент.СбисПолучитьТикетДляАккаунта(ОписаниеПакета);
		Возврат Новый Структура("ИдДокумента, Тикет, СтарыйИдСессии", ОписаниеПакета.ИдДокумента, ДанныеТикета.Тикет, ДанныеТикета.СтарыйИдСессии);
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция Интеграция_ФЭДМультиСгенерировать(ПараметрыДокумента, НаборПодстановок, ДопПараметры) Экспорт
	
	Попытка
		Кэш = ДопПараметры.Кэш;
		ДопПараметрыВызова = Новый Структура("СообщатьПриОшибке, ВернутьОшибку",  Ложь, Истина);
		
		Отказ = Ложь;
		ПараметрыВызова = Новый Структура;
		ПараметрыВызова.Вставить("Format",			ПараметрыДокумента);
		ПараметрыВызова.Вставить("SubstitutionList",НаборПодстановок);
		Результат = СбисОтправитьИОбработатьКоманду(ДопПараметры.Кэш, "Integration.FEDMultiGenerate", ПараметрыВызова, ДопПараметрыВызова, Отказ);
		
		Если Отказ Тогда
			МодульОбъектаКлиент().ВызватьСбисИсключение(Результат, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СбисОтправитьИОбработатьКомандуCallSabyApi2");
		КонецЕсли;
		
		Для Каждого файл Из Результат Цикл
			
			файл["Тело"] = МодульОбъектаКлиент().ПрочитатьЗначениеПоBase64Клиент(файл["Тело"]);
			
		КонецЦикла;
		
		Возврат Результат;
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнфоОбОшибке, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".Интеграция_ФЭДМультиСгенерировать");
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Функция АПИ3_ИнитКоннекшен(ПараметрыИнит, ДопПараметрыВызова) Экспорт
	
	ДопПарметрыВызоваИнтеграции = Новый Структура("АдресРесурса, СообщатьПриОшибке, ВернутьОшибку", "/int-settings/service/", Ложь, Истина);
	
	Результат = СбисОтправитьИОбработатьКоманду(ДопПараметрыВызова.Кэш, "API3.InitConnection", ПараметрыИнит, ДопПарметрыВызоваИнтеграции, ДопПараметрыВызова.Отказ);
	Если ДопПараметрыВызова.Отказ Тогда   
		
		Если Результат.code = 302 Тогда
			Результат.details = "Временно не доступен сервис интеграций";
		КонецЕсли;
		
		Возврат ДопПараметрыВызова.Кэш.ОбщиеФункции.сбисИсключение(Результат,  ДопПараметрыВызова.Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".АПИ3_ИнитКоннекшен");
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

// Вызов функции MappingObject.List. Формирует список
// объектов синхронизируемых объектов определенного типа,
// с данными сопоставления и с расшифровкой естественных ключей
//
// Параметры:
//  Кэш  - Структура - Кэш обработки
//  ДопПоля  - Структура - Набор полей, которыми будут расширены
//					возвращаемые записи.
//	Фильтр	- Структура - Параметры фильтрации выборки.
//	Сортировка	- Структура - Параметры сортировки записей в выборке.
//	Навигация	-	 Структура - Параметры для навигации с типом
//					"постраничная", "бесконечный скролл"
//					или "по курсору".
//
// Возвращаемое значение:
//   Структура   - Результат вызова. Список объектов или ошибка
//
&НаКлиенте
Функция MappingObject_List(Кэш, ДопПоля, Фильтр, Навигация, Отказ = Ложь) Экспорт 

	ДопПараметрыВызова = Новый Структура("ЕстьРезультат,АдресРесурса,РежимКонвертации", Истина, "/int-settings/service/", "Стандарт"); 
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("ExtraFields",		ДопПоля);
	ПараметрыВызова.Вставить("Filter",		Фильтр);  
	ПараметрыВызова.Вставить("Pagination",	Навигация);
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "MappingObject.List", ПараметрыВызова, ДопПараметрыВызова, Отказ);
	Если Отказ Тогда
		Результат = Кэш.ОбщиеФункции.сбисИсключение(Результат, "MappingObject.List");
	КонецЕсли;
	Возврат Результат;

КонецФункции // MappingObject_List()

&НаКлиенте
Функция СБИС_ПолучитьСопоставлениеСторон(Кэш, ПараметрыДанныеУчастников, ДопПараметры=Неопределено, Отказ) Экспорт
	ДопПараметры = Новый Структура;
	ПараметрыВызова = Новый Структура("data", ПараметрыДанныеУчастников);
	
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "ExtSysOrganization.MassFind", ПараметрыВызова, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_ПолучитьСопоставлениеСторон");
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Функция ищет сертификат по отпечатку после чего разбирает его
//
// Параметры:
//  params  - Структура - Параметры фильтрации метода
//  ДопПараметры  - Структура - Набор полей, работа с которыми может расширить результат работы функции.
//
// Возвращаемое значение:
//   Структура   - Результат вызова. Список объектов или ошибка
//
&НаКлиенте
Функция Сертификат_ПрочитатьПоОтпечатку(params, ДопПараметры, Отказ=Ложь) Экспорт 
	Кэш = ДопПараметры.Кэш;
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	
	ПараметрыКоманды = Новый Структура("Отпечаток", params.Отпечаток);
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "Сертификат.ПрочитатьПоОтпечатку", ПараметрыКоманды, ДопПараметрыВызова, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".Сертификат_ПрочитатьПоОтпечатку");
	КонецЕсли;
	Возврат Результат;
	
КонецФункции    

&НаКлиенте
Функция SearchNomenclatureCollation(Кэш, params, ДопПараметры, Отказ=Ложь) Экспорт 
	                                                                                                  
	Возврат СбисОтправитьИОбработатьКоманду(Кэш, "ContractorNomenclatureCollation.SearchByContractorData", params, ДопПараметры, Отказ);

КонецФункции  

#Область include_core2_vo2_СпособыОбмена_API_ВнешниеОбертки_СинхронныеОперации_РаботаСЗаказами
#КонецОбласти

#Область include_core2_vo2_СпособыОбмена_API_ВнешниеОбертки_ПрикладнаяСтатистика
#КонецОбласти

#Область include_core2_vo2_СпособыОбмена_API_ВнешниеОбертки_СинхронныеОперации_СБИС
#КонецОбласти

#Область include_core2_vo2_СпособыОбмена_API_ВнешниеОбертки_СинхронныеОперации_ExtSys
#КонецОбласти

