
//Подсчет времени на отправку.
&НаКлиенте
Процедура МассоваяОперация_ВремяОтправки(РезультатОтправки, ИтогОтправки) Экспорт
	
	Если ОбъектSABY_ЭтоТип(ИтогОтправки, "ПрикладнойОбъектSABY") Тогда
		
		ИдентификаторОтправки = АсинхроннаяСбисКоманда_Получить(ИтогОтправки, "Идентификатор");
		
	Иначе
		
		ИдентификаторОтправки = ИтогОтправки;
		
	КонецЕсли;
	ДетализацияОтправки = РезультатОтправки.ДетализацияОтправки.Получить(ИдентификаторОтправки);
	Если ДетализацияОтправки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДатКнц = ПолучитьДатуВМиллисекундах();
	
	ДетализацияОтправки.ВремяВыполнения	= (ДатКнц - ДетализацияОтправки.ДатНач)/1000;
	РезультатОтправки.ВремяОтправки		= РезультатОтправки.ВремяОтправки + ДетализацияОтправки.ВремяВыполнения;
	
КонецПроцедуры

