
//DynamicDirective

//Область, которая собирается одинаково на клиенте и на сервере

// Функция - проверяет объект на принадлежность к типу СБИС
// 
// Возвращаемое значение:
//  Булево - истина если объект принадлежит типу СБИС
//
Функция ЭтоТипСбис(ОбъектПроверка, ТипЗначенияСтрокой) Экспорт
	
	ТипЗначенияФормат	= НРег(ТипЗначенияСтрокой);
	ЭтоТипСБИС			= Ложь;
	
	Если	ТипЗнч(ОбъектПроверка) = Тип("Структура") Тогда
		
		Если	ОбъектПроверка.Свойство("_класс") Тогда
		
			ЭтоТипСБИС	= ТипЗначенияФормат = НРег(ОбъектПроверка._класс)
		
		ИначеЕсли	ТипЗначенияФормат = "вложениесбис" Тогда
			                //Формалка
			ЭтоТипСБИС	=	(		ОбъектПроверка.Свойство("ВерсияФормата")
								И	ОбъектПроверка.Свойство("ПодТип")
								И	ОбъектПроверка.Свойство("Тип")
							)
							//Неформалка
							Или
							(		ОбъектПроверка.Свойство("ПолноеИмяФайла")
								И	ОбъектПроверка.Свойство("Название")
								И	ОбъектПроверка.Свойство("ИмяФайла")
							);

		ИначеЕсли	ТипЗначенияФормат = "сбисисключение" Тогда
			
			ЭтоТипСБИС =	ОбъектПроверка.Свойство("code")
						И	ОбъектПроверка.Свойство("message")
						И	ОбъектПроверка.Свойство("details");
			
		ИначеЕсли	ТипЗначенияФормат = "составпакета" Тогда
						
			ЭтоТипСБИС =	ОбъектПроверка.Свойство("Контрагент")
						И	ОбъектПроверка.Свойство("НашаОрганизация")
						И	ОбъектПроверка.Свойство("Вложение");

		ИначеЕсли	ТипЗначенияФормат = "sbiswarning" Тогда
			
			// Проверка сбисовой ошибки по коду и коду БЛ
			ЭтоТипСБИС =		ОбъектПроверка.Свойство("code")
							И	ОбъектПроверка.code = -32000
						Или		ОбъектПроверка.Свойство("data")
							И	ТипЗнч(ОбъектПроверка.data) = Тип("Структура")
							И	ОбъектПроверка.data.Свойство("classid")
						
		ИначеЕсли	ТипЗначенияФормат = "файлдокумент" Тогда
							
			// Это описание файла данных, сформированного кодом в ПрочитатьДокумент на Файл_{Шаблон}
			ЭтоТипСБИС =	ОбъектПроверка.Свойство("Документ")
						И	ОбъектПроверка.Свойство("ВерсияФормата")
						И	ОбъектПроверка.Свойство("Формат");
							
		КонецЕсли;
		
	ИначеЕсли	ТипЗначенияФормат = "сбисописаниеоповещения" Тогда
		
		Если ГлобальныйКэш.СовместимостьМетодов.Объекты1С.ОписаниеОповещения Тогда
			
			ЭтоТипСБИС = Вычислить("Тип(""ОписаниеОповещения"")") = ТипЗнч(ОбъектПроверка);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ОбъектПроверка) = Тип("ИнформацияОбОшибке") Тогда
		
		ЭтоТипСБИС = ТипЗначенияФормат = "сбисисключение";
		
	КонецЕсли;
	
	Возврат ЭтоТипСБИС;
	
КонецФункции

#Область include_core2_vo2_ОбщиеФункции_JSON_JSONПарсер
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиентСервер_ОбщегоНазначения
#КонецОбласти

