
// Область, которая описывает работу методов, одинаково работающих на клиенте и сервере
// Для ОФ и УФ Обращение пишется одинаково - МодульОбъектаКлиент()/МодульОбъектаСервер() в зависимости от контекста (для ОФ зареймленного)

#Область include_core2_vo2_МодульОбъекта_АПИ_КлиентСервер
#КонецОбласти

//Область, которая собирается одинаково на клиенте и на сервере

#Область include_core_base_Helpers_JSON802
#КонецОбласти

#Область include_core2_vo2_Модуль_МодульОбъектаКлиентСервер_ОбщегоНазначения
#КонецОбласти

