
//Очищалка для временных файлов
&НаКлиенте
Процедура ПроверитьОчиститьВременныеФайлы(ЭтоЗавершениеРаботы = Неопределено, ДопПараметры = Неопределено) Экспорт

	ТекущийСеанс = ГлобальныйКэш.ТекущийСеанс;

	Если Не ТекущийСеанс.Свойство("ВременныеФайлы") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СбисВремяПроверки	= ТекущаяДата();
	ЭтоЗавершениеРаботы	= ЭтоЗавершениеРаботы = Истина;
	
	Для Каждого КлючИЗначение Из ТекущийСеанс.ВременныеФайлы.Файлы Цикл
		
		ВремяОсвободить = ПрикладнойОбъектSABY_Получить(КлючИЗначение.Значение, "ВремяОсвободить");
		Если	Не ЭтоЗавершениеРаботы
			И	(	ВремяОсвободить = Неопределено
				Или	ВремяОсвободить > СбисВремяПроверки) Тогда
				
			Продолжить;
			
		КонецЕсли;
		
		ОчиститьВременныйФайл(КлючИЗначение.Ключ);

	КонецЦикла;
	
	Если ТекущийСеанс.ВременныеФайлы.Файлы.Количество() Тогда
		
		ПодключитьОчисткуВременныхФайлов();
		
	КонецЕсли;
	
КонецПроцедуры

// Функция - возвращает путь к месту создания временного файла. Подключает обработчик ожидания, который очищает файлы по истечении их срока жизни.
//
// Параметры:
//  РасширениеФайлаСоздать	 - Строка	 			 - Расширения для нового файла
//  ВремяЖизниСек			 - Число/Неопределено	 - Время жизни в секундах. Если не указано, то пока файл не освободится принудительно, 
//														либо при завершении работы
// 
// Возвращаемое значение:
//  Строка - путь в возможному месту создания временного файла. Временный файл не создается.
//
&НаКлиенте
Функция НовыйВременныйФайлКлиент(ИмяВременногоФайлаСоздать = Неопределено, РасширениеФайлаСоздать = Неопределено, ВремяЖизниСек = 600, СоздатьНовый = Ложь) Экспорт
	Перем СбисВременныеФайлы, ВремяОсвободитьФайл;
	
	ТекущийСеанс = ГлобальныйКэш.ТекущийСеанс;
	
	Если РасширениеФайлаСоздать = Неопределено Тогда
		
		РасширениеФайлаСоздать = "tmp";
		
	КонецЕсли;
	
	Если НЕ ТекущийСеанс.Свойство("ВременныеФайлы", СбисВременныеФайлы) Тогда
		
		СбисВременныеФайлы = Новый Структура("Файлы, Параметры", Новый Соответствие, Новый Структура);
		ТекущийСеанс.Вставить("ВременныеФайлы", СбисВременныеФайлы);
		
	КонецЕсли;
	
	ИмяФайла = ИмяВременногоФайлаСоздать;
	
	#Если ВебКлиент Тогда
		
		Если ИмяФайла = Неопределено Тогда
			
			ИмяФайла = "sbis_" + Строка(Новый УникальныйИдентификатор());
			
		КонецЕсли;
		
		ИмяФайла = НовыйВременныйФайлКлиент_Вручную(ИмяФайла, РасширениеФайлаСоздать, СоздатьНовый);
		
	#Иначе
		
		Если ИмяФайла = Неопределено Тогда
			
			ИмяФайла = ПолучитьИмяВременногоФайла(РасширениеФайлаСоздать);
			
		Иначе
			
			ИмяФайла = НовыйВременныйФайлКлиент_Вручную(ИмяФайла, РасширениеФайлаСоздать, СоздатьНовый);
			
		КонецЕсли;
		
	#КонецЕсли

	ВремяСоздания		= ТекущаяДата();
	КонтрольЖизниФайла	= Истина;
	Если ВремяЖизниСек = Неопределено Тогда
		
		ВремяОсвободитьФайл = Неопределено;
		
	ИначеЕсли ВремяЖизниСек = "постоянно" Тогда
		
		КонтрольЖизниФайла = Ложь;
		
	Иначе
		
		ВремяОсвободитьФайл = ВремяСоздания + ВремяЖизниСек;
		
	КонецЕсли;
	
	Если КонтрольЖизниФайла Тогда
		
		ОписаниеВременногоФайла = НовыйПрикладнойОбъектSABY("ВременныйФайл");
		ПрикладнойОбъектSABY_Установить(ОписаниеВременногоФайла, "ВремяПолучения",		ВремяСоздания);
		ПрикладнойОбъектSABY_Установить(ОписаниеВременногоФайла, "ВремяОсвободить",	ВремяОсвободитьФайл);
		СбисВременныеФайлы.Файлы.Вставить(ИмяФайла, ОписаниеВременногоФайла);
		ПодключитьОчисткуВременныхФайлов();
		
	КонецЕсли;
	
	Возврат ИмяФайла;
	
КонецФункции

&НаКлиенте
Функция НовыйВременныйФайлКлиент_Вручную(ИмяФайла, РасширениеФайла, СоздатьНовый = Ложь)
	Перем ПересекающиесяФайлы;
	
	ФайлТест		= Новый Файл(ИмяФайла);
	ПолноеИмяФайла	= ФайлТест.ИмяБезРасширения + "." + СтрЗаменить(РасширениеФайла, ".", "") ;
	ПутьКФайлу		= ФайлТест.Путь;
	КаталогПуть		= Новый Файл(ПутьКФайлу);
	Если Не КаталогПуть.Существует() Тогда
		
		// Указано только имя файла
		ПутьКФайлу = КаталогВременныхФайлов();
		
	КонецЕсли;

	ПутьКФайлу = ПутьКФайлу + ПолноеИмяФайла;
	
	Если СоздатьНовый Тогда
		
		Файл = Новый Файл(ПутьКФайлу);
		Если Файл.Существует() Тогда
			
			КэшВременныхФайлов = ПолучитьЗначениеПараметраТекущегоСеанса("ВременныеФайлы");
			Если Не КэшВременныхФайлов.Свойство("ПересекающиесяФайлы", ПересекающиесяФайлы) Тогда
				
				ПересекающиесяФайлы = Новый Соответствие;
				КэшВременныхФайлов.Вставить("ПересекающиесяФайлы", ПересекающиесяФайлы);
				
			КонецЕсли;
			
			ЗначениеДляИмени = ПересекающиесяФайлы.Получить(ПолноеИмяФайла);
			Если ЗначениеДляИмени = Неопределено Тогда
				
				ЗначениеДляИмени = 0;
				
			КонецЕсли;
			ЗначениеДляИмени = ЗначениеДляИмени + 1;
			ПересекающиесяФайлы.Вставить(ПолноеИмяФайла, ЗначениеДляИмени);
			ПолноеИмяФайла	= ИмяФайла + "(" + Формат(ЗначениеДляИмени, "ЧГ=") + ")." + СтрЗаменить(РасширениеФайла, ".", "");
			ПутьКФайлу		= КаталогВременныхФайлов() + ПолноеИмяФайла;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат ПутьКФайлу;
	
КонецФункции

// Процедура - Освободить временный файл
//
// Параметры:
//  ИмяФайла		 - Строка	 - полное имя файла, который освобождаем
//  ОчиститьСразу	 - Булево	 - удаляем отложенно, когда будет возможность, или сразу
//
&НаКлиенте
Процедура ОсвободитьВременныйФайлКлиент(ИмяФайла, ОчиститьСразу = Ложь) Экспорт
	Перем СбисВременныеФайлы;
	
	ТекущийСеанс = ГлобальныйКэш().ТекущийСеанс;
	
	Если Не ТекущийСеанс.Свойство("ВременныеФайлы", СбисВременныеФайлы) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОписаниеВФ = СбисВременныеФайлы.Файлы.Получить(ИмяФайла);
	Если ОписаниеВФ = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ОчиститьСразу Тогда
		
		УдалитьФайлНаКлиенте(ИмяФайла);
		СбисВременныеФайлы.Файлы.Удалить(ИмяФайла);
		
	Иначе
		
		ВремяОсвободить = ПрикладнойОбъектSABY_Получить(ОписаниеВФ, "ВремяПолучения");
		ПрикладнойОбъектSABY_Установить(ОписаниеВФ, "ВремяОсвободить", ВремяОсвободить);
		ПодключитьОчисткуВременныхФайлов(1);
		
	КонецЕсли;
	
КонецПроцедуры

//Очищает временный файл
&НаКлиенте
Процедура ОчиститьВременныйФайл(ИмяФайла)
	Перем СбисВременныеФайлы;
	
	ТекущийСеанс = ГлобальныйКэш.ТекущийСеанс;
	
	Если	Не	ТекущийСеанс.Свойство("ВременныеФайлы", СбисВременныеФайлы)
		Или		СбисВременныеФайлы.Файлы.Получить(ИмяФайла) = Неопределено Тогда
		
		Возврат
		
	КонецЕсли;
	
	УдалитьФайлНаКлиенте(ИмяФайла);
	
	СбисВременныеФайлы.Файлы.Удалить(ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФайлНаКлиенте(ИмяФайла, ИгнорироватьОшибку = Истина)
	
	Попытка
		
		Файл = Новый Файл(ИмяФайла);
		Если Файл.Существует() Тогда
			
			УдалитьФайлы(ИмяФайла);
			
		КонецЕсли;
		
	Исключение
		
		Если ИгнорироватьОшибку Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ОшибкаОбработки = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.УдалитьФайлНаКлиенте");
		ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаОбработки);
		// При ошибке ничего не делаем. Считаем, что уже удалено
		
	КонецПопытки;	
	
КонецПроцедуры

//Очищалка для временных файлов
&НаКлиенте
Процедура ПодключитьОчисткуВременныхФайлов(ВремяСрабатывания = 60)
	
	ПараметрыМониторингаВременныхФайлов = Новый Структура(
	"Периодичность,		ИдентификаторДействия,				ВызватьСразу",
	ВремяСрабатывания,	"ПроверитьОчиститьВременныеФайлы",	Ложь);
	
	ПараметрыМониторингаВременныхФайлов.Вставить("Модуль",			МодульОбъектаКлиент());
	ПараметрыМониторингаВременныхФайлов.Вставить("ИмяПроцедуры",	ПараметрыМониторингаВременныхФайлов.ИдентификаторДействия);
	
	ОтложеннаяОперация	= ПолучитьОтложенноеДействие(ПараметрыМониторингаВременныхФайлов.ИдентификаторДействия);
	Если ОтложеннаяОперация = Неопределено Тогда
		
		ПодключитьОтложенноеДействие(НовыйОтложенноеДействие(ПараметрыМониторингаВременныхФайлов));
		
	ИначеЕсли 	ОтложеннаяОперация.Запущен Тогда 
		
		// Продление операции
		ОтключитьОтложенноеДействие(ОтложеннаяОперация);
		ПодключитьОтложенноеДействие(НовыйОтложенноеДействие(ПараметрыМониторингаВременныхФайлов));		
		
	Иначе
		
		ВремяСрабатывания	= ПолучитьДатуВМиллисекундах(ТекущаяДата() + ВремяСрабатывания);
		Если	ВремяСрабатывания < ОтложенноеДействие_Получить(ОтложеннаяОперация, "СледующийВызовМС") Тогда
			
			ОтложенноеДействие_Установить(ОтложеннаяОперация, "СледующийВызовМС", ВремяСрабатывания);
			ОтключитьОтложенноеДействие(ОтложеннаяОперация);
			ПодключитьОтложенноеДействие(ОтложеннаяОперация);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
	
