
//Очищалка для временных файлов
&НаКлиенте
Процедура ПроверитьОчиститьВременныеФайлы(ЭтоЗавершениеРаботы = Неопределено, ДопПараметры = Неопределено) Экспорт

	ТекущийСеанс = ГлобальныйКэш.ТекущийСеанс;

	Если Не ТекущийСеанс.Свойство("ВременныеФайлы") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СбисВремяПроверки	= ТекущаяДата();
	ЭтоЗавершениеРаботы	= ЭтоЗавершениеРаботы = Истина;
	
	Для Каждого КлючИЗначение Из ТекущийСеанс.ВременныеФайлы.Файлы Цикл
		Если	Не ЭтоЗавершениеРаботы
			И	(	КлючИЗначение.Значение.ВремяОсвободить = Неопределено
				Или	КлючИЗначение.Значение.ВремяОсвободить > СбисВремяПроверки) Тогда
			Продолжить;
		КонецЕсли;
		
		ОчиститьВременныйФайл(КлючИЗначение.Ключ);

	КонецЦикла;
	
	Если ТекущийСеанс.ВременныеФайлы.Файлы.Количество() Тогда
		
		ПодключитьОчисткуВременныхФайлов();
		
	КонецЕсли;
	
КонецПроцедуры

// Функция - возвращает путь к месту создания временного файла. Подключает обработчик ожидания, который очищает файлы по истечении их срока жизни.
//
// Параметры:
//  РасширениеФайлаСоздать	 - Строка	 			 - Расширения для нового файла
//  ВремяЖизниСек			 - Число/Неопределено	 - Время жизни в секундах. Если не указано, то пока файл не освободится принудительно, 
//														либо при завершении работы
// 
// Возвращаемое значение:
//  Строка - путь в возможному месту создания временного файла. Временный файл не создаётся.
//
&НаКлиенте
Функция НовыйВременныйФайлКлиент(РасширениеФайлаСоздать = "tmp", ВремяЖизниСек = 600) Экспорт
	Перем СбисВременныеФайлы, ВремяОсвободитьФайл;
	
	ТекущийСеанс = ГлобальныйКэш.ТекущийСеанс;
	
	Если НЕ ТекущийСеанс.Свойство("ВременныеФайлы", СбисВременныеФайлы) Тогда
		
		СбисВременныеФайлы = Новый Структура("Файлы, Параметры", Новый Соответствие, Новый Структура);
		ТекущийСеанс.Вставить("ВременныеФайлы", СбисВременныеФайлы);
		
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		
		ИмяФайла = КаталогВременныхФайлов() + "sbis_" + Строка(Новый УникальныйИдентификатор()) + "." + СтрЗаменить(РасширениеФайлаСоздать, ".", "");
		
	#Иначе
		
		ИмяФайла = ПолучитьИмяВременногоФайла(РасширениеФайлаСоздать);
		
	#КонецЕсли

	ВремяСоздания = ТекущаяДата();
	Если ВремяЖизниСек = Неопределено Тогда
		
		ВремяОсвободитьФайл = Неопределено;
		
	Иначе
		
		ВремяОсвободитьФайл = ВремяСоздания + ВремяЖизниСек;
		
	КонецЕсли;
	СбисВременныеФайлы.Файлы.Вставить(ИмяФайла, Новый Структура("ВремяПолучения, ВремяОсвободить", ВремяСоздания, ВремяОсвободитьФайл));
	
	ПодключитьОчисткуВременныхФайлов();
	
	Возврат ИмяФайла;
	
КонецФункции

//Очищает временный файл
&НаКлиенте
Процедура ОсвободитьВременныйФайл(ИмяФайла) Экспорт
	Перем СбисВременныеФайлы;
	
	ТекущийСеанс = ГлобальныйКэш.ТекущийСеанс;
	
	Если Не ТекущийСеанс.Свойство("ВременныеФайлы", СбисВременныеФайлы) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОписаниеВФ = СбисВременныеФайлы.Файлы.Получить(ИмяФайла);
	Если ОписаниеВФ = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОписаниеВФ.ВремяОсвободить = ОписаниеВФ.ВремяПолучения;
	ПодключитьОчисткуВременныхФайлов(1)
	
КонецПроцедуры

//Очищает временный файл
&НаКлиенте
Процедура ОчиститьВременныйФайл(ИмяФайла)
	Перем СбисВременныеФайлы;
	
	ТекущийСеанс = ГлобальныйКэш.ТекущийСеанс;
	
	Если	Не	ТекущийСеанс.Свойство("ВременныеФайлы", СбисВременныеФайлы)
		Или		СбисВременныеФайлы.Файлы.Получить(ИмяФайла) = Неопределено Тогда
		
		Возврат
		
	КонецЕсли;
	
	Попытка
		
		Файл = Новый Файл(ИмяФайла);
		Если Файл.Существует() Тогда
			
			УдалитьФайлы(ИмяФайла);
			
		КонецЕсли;
		
	Исключение
		
		// При ошибке ничего не делаем. Считаем, что ВФ был удалён
		
	КонецПопытки;
	
	СбисВременныеФайлы.Файлы.Удалить(ИмяФайла);
	
КонецПроцедуры

//Очищалка для временных файлов
&НаКлиенте
Процедура ПодключитьОчисткуВременныхФайлов(ВремяСрабатывания = 60)
	
	ПараметрыМониторингаВременныхФайлов = Новый Структура(
	"Периодичность,		ИдентификаторДействия,				ВызватьСразу",
	ВремяСрабатывания,	"ПроверитьОчиститьВременныеФайлы",	Ложь);
	
	ПараметрыМониторингаВременныхФайлов.Вставить("Модуль",			МодульОбъектаКлиент());
	ПараметрыМониторингаВременныхФайлов.Вставить("ИмяПроцедуры",	ПараметрыМониторингаВременныхФайлов.ИдентификаторДействия);
	
	ОтложеннаяОперация	= ПолучитьОтложенноеДействие(ПараметрыМониторингаВременныхФайлов.ИдентификаторДействия);
	Если ОтложеннаяОперация = Неопределено Тогда
		
		ПодключитьОтложенноеДействие(НовыйОтложенноеДействие(ПараметрыМониторингаВременныхФайлов));
		
	ИначеЕсли 	ОтложеннаяОперация.Запущен Тогда 
		
		// Продление операции
		ОтключитьОтложенноеДействие(ОтложеннаяОперация);
		ПодключитьОтложенноеДействие(НовыйОтложенноеДействие(ПараметрыМониторингаВременныхФайлов));		
		
	Иначе
		
		ВремяСрабатывания = ПолучитьДатуВМиллисекундах(ТекущаяДата() + ВремяСрабатывания);
		Если	ВремяСрабатывания < ОтложеннаяОперация.СледующийВызовМС Тогда
			
			ОтложеннаяОперация.СледующийВызовМС = ВремяСрабатывания;
			ОтключитьОтложенноеДействие(ОтложеннаяОперация);
			ПодключитьОтложенноеДействие(ОтложеннаяОперация);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
	
