
&НаКлиенте
Процедура Асинх_СБИС_СписокСертификатов(АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт
	
	Результат = Новый Структура("Сертификат", Новый СписокЗначений);
	АсинхронноеСбисСобытие = МодульОбъектаКлиент().НовыйАсинхронноеСбисСобытие(АсинхроннаяСБИСКоманда, Результат, "Message");
	МодульОбъектаКлиент().АсинхроннаяСбисКоманда_ВызватьСобытие(АсинхроннаяСбисКоманда, АсинхронноеСбисСобытие);

КонецПроцедуры

&НаКлиенте
Процедура Асинх_СБИС_ПрочитатьДокумент(АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт

	Кэш				= МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш(); 
    ОшибкаОтправки	= Ложь;
	
	СтруктураРезультата = СБИС_ПрочитатьДокумент(Кэш, АсинхроннаяСБИСКоманда.АргументВызова, Новый Структура, ОшибкаОтправки);

	Если ОшибкаОтправки Тогда
		
		МодульОбъектаКлиент().ВызватьСбисИсключение(СтруктураРезультата, "API.СБИС_ПрочитатьДокумент")
		
	КонецЕсли;

	АсинхронноеСбисСобытие = МодульОбъектаКлиент().НовыйАсинхронноеСбисСобытие(АсинхроннаяСБИСКоманда, СтруктураРезультата, "Message");
	МодульОбъектаКлиент().АсинхроннаяСбисКоманда_ВызватьСобытие(АсинхроннаяСбисКоманда, АсинхронноеСбисСобытие);
	
КонецПроцедуры

&НаКлиенте
Функция ПрочитатьДокумент_Подписки(МассоваяОперация) Экспорт
	
	ПодпискаОтвет	= Новый Структура("Функция, ФункцияОшибки, Модуль, МодульОшибки",
					"Асинх_ПрочитатьДокумент_Ответ",
					"МассоваяОперация_Асинх_ПрочитатьДокумент_Ошибка",
					ЭтаФорма,
					МодульОбъектаКлиент());
	ПодпискаОшибка	= Новый Структура("Функция, ФункцияОшибки, Модуль",
					ПодпискаОтвет.ФункцияОшибки,
					МассоваяОперация.ПараметрыОтправки.ИмяОбработчикаФатальныхОшибок,
					МодульОбъектаКлиент());
	ПодпискиПрочитатьДокумент	= Новый Структура;
	ПодпискиПрочитатьДокумент.Вставить("Message",	ПодпискаОтвет);
	ПодпискиПрочитатьДокумент.Вставить("Error",		ПодпискаОшибка);
	
	Возврат ПодпискиПрочитатьДокумент;
	
КонецФункции

// Процедура - обработка ответа на ПрочитатьДокумент
//
// Параметры:
//  АсинхронноеСбисСобытие	 - АсинхронноеСбисСобытие - структура события ответа
//  ПараметрыКоманды		 - ПараметрыКоманды	 - структура ЦепочкаКомандОбработки, ДанныеКоманды
//
&НаКлиенте
Процедура Асинх_ПрочитатьДокумент_Ответ(АсинхронноеСбисСобытие, ПараметрыВызова) Экспорт

	КомандаЗавершена		= ПараметрыВызова.Команда;
	ЦепочкаКомандОбработки	= МодульОбъектаКлиент().АсинхроннаяСбисКоманда_Получить(КомандаЗавершена, "ЦепочкаКомандОбработки");
	
	// Следующая команда будет подготовка структуры документов. Установить готовность, прочитанный документ больше не понадобится
	МодульОбъектаКлиент().ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Статус", "ГотовКЗапуску");
	
КонецПроцедуры

#Область include_core2_vo2_СпособыОбмена_ИнтеграцияКаталог_WriteDocumentEx
#КонецОбласти 

#Область include_core2_vo2_СпособыОбмена_ИнтеграцияКаталог_ExecuteActionEx  
#КонецОбласти 

#Область include_core2_vo2_СпособыОбмена_ИнтеграцияКаталог_WriteAttachment  
#КонецОбласти

#Область include_core2_vo2_СпособыОбмена_ИнтеграцияКаталог_СобытияОтправки
#КонецОбласти

#Область include_core2_vo2_СпособыОбмена_ИнтеграцияКаталог_АсинхронныеОтветы
#КонецОбласти

