
&НаКлиенте
Процедура Асинх_СБИС_СписокСертификатов(АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт
	
	Результат = Новый Структура("Сертификат", Новый СписокЗначений);
	АсинхронноеСбисСобытие = МодульОбъектаКлиент().НовыйАсинхронноеСбисСобытие(АсинхроннаяСБИСКоманда.Идентификатор, Результат, "Message");
	МодульОбъектаКлиент().АсинхроннаяСбисКоманда_ВызватьСобытие(АсинхроннаяСбисКоманда, АсинхронноеСбисСобытие);

КонецПроцедуры

#Область include_core2_vo2_СпособыОбмена_ИнтеграцияКаталог_WriteDocumentEx
#КонецОбласти 

#Область include_core2_vo2_СпособыОбмена_ИнтеграцияКаталог_ExecuteActionEx  
#КонецОбласти 

#Область include_core2_vo2_СпособыОбмена_ИнтеграцияКаталог_WriteAttachment  
#КонецОбласти

#Область include_core2_vo2_СпособыОбмена_ИнтеграцияКаталог_СобытияОтправки
#КонецОбласти

#Область include_core2_vo2_СпособыОбмена_ИнтеграцияКаталог_АсинхронныеОтветы
#КонецОбласти

