
// Функция получает складские параметры документа  из СДР.Параметры
//
// Параметры:
//  params  - Структура - Параметры фильтрации метода
//  ДопПараметры  - Структура - Набор полей, работа с которыми может расширить результат работы функции.
//
// Возвращаемое значение:
//   Структура   - Результат вызова. Список объектов или ошибка
//
&НаКлиенте
Функция ExtSysMarking_GetParams(params, ДопПараметры, Отказ=Ложь) Экспорт 
	
	Возврат Новый Структура;

КонецФункции 

// Функция - Заглушка для совместимости
//
// Параметры:  
//	Кэш						- Структура	- Кэш обработки
//  ВходящийПараметрМетода  - Структура - Параметры фильтрации метода
//  ДопПараметры  			- Структура - Набор полей, работа с которыми может расширить результат работы функции 
//  Отказ					- Булево	- Признак отказа.
//
// Возвращаемое значение:
//   Структура   - Результат вызова. Список объектов или ошибка
//
&НаКлиенте
Функция GisTransport_GetResendingFixationConfigVI(Кэш, ВходящийПараметрМетода,  ДопПараметры, Отказ) Экспорт
	
	Возврат Неопределено;   
	
КонецФункции

