
// Функция - создать объект 1С
//
// Параметры:
//  ОбъектТип	 - Строка					 - Полное имя типа
//	ДопПараметры - Неопределено/Структура	 - расширение
//		УИДСсылки - Уникальный идентификатор для задания ссылки нового
// 
// Возвращаемое значение:
//  Объект 1С - новый объект
//
Функция НовыйОбъект1С(ОбъектТип, ДопПараметры = Неопределено)
	Перем ИДСсылкиНового;
	
	Попытка
		
		ОбъектКлюч		= НРег(СокрЛП(ОбъектТип));
		ОбъектПодТип	= Сред(ОбъектТип, Найти(ОбъектТип, ".") + 1);
		Если Не ДопПараметры = Неопределено Тогда
			
			ДопПараметры.Свойство("УИДСсылки", ИДСсылкиНового);
			
		КонецЕсли;
		
		Если ИДСсылкиНового = Неопределено Тогда
			
			ИДСсылкиНового = Новый УникальныйИдентификатор;
			
		КонецЕсли;
		
		ПараметрыОбъекта = Новый Массив;
		ПараметрыОбъекта.Добавить(ИДСсылкиНового);
		
		Если		Лев(ОбъектКлюч, 8) = "документ" Тогда
			
			Попытка

				Объект1СЗначение = Документы[ОбъектПодТип].СоздатьЭлемент();
				Объект1СЗначение.УстановитьСсылкуНового(Новый(Тип("ДокументСсылка." + ОбъектПодТип), ПараметрыОбъекта));
				
			Исключение
				
				ВызватьИсключение СбисИсключение_Выгрузить(НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаСервер.НовыйОбъект1С", 767));
				
			КонецПопытки;
			
		ИначеЕсли	Лев(ОбъектКлюч, 10) = "справочник" Тогда
			
			Попытка
				
				Объект1СЗначение = Справочники[ОбъектПодТип].СоздатьЭлемент();
				Объект1СЗначение.УстановитьСсылкуНового(Новый(Тип("СправочникСсылка." + ОбъектПодТип), ПараметрыОбъекта));
				
			Исключение
				
				ВызватьИсключение СбисИсключение_Выгрузить(НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаСервер.НовыйОбъект1С", 767));
				
			КонецПопытки;
			
		ИначеЕсли Лев(ОбъектКлюч, 16) = "регистрысведений" Тогда

			Попытка
				
				Объект1СЗначение = РегистрыСведений[ОбъектПодТип].СоздатьМенеджерЗаписи();
				
			Исключение
				
				ВызватьИсключение СбисИсключение_Выгрузить(НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаСервер.НовыйОбъект1С", 767));
				
			КонецПопытки;
			
		ИначеЕсли Лев(ОбъектКлюч, 22) = "планвидовхарактеристик" Тогда
			
			Попытка

				Объект1СЗначение = ПланыВидовХарактеристик[ОбъектПодТип].СоздатьЭлемент();
				Объект1СЗначение.УстановитьСсылкуНового(Новый(Тип("ПланВидовХарактеристикСсылка." + ОбъектПодТип), ПараметрыОбъекта));
				
			Исключение
				
				ВызватьИсключение СбисИсключение_Выгрузить(НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаСервер.НовыйОбъект1С", 767));
				
			КонецПопытки;
			
		Иначе
			
			ВызватьИсключение СбисИсключение_Выгрузить(НовыйСбисИсключение(, "МодульОбъектаСервер.НовыйОбъект1С", 779,, "Не поддерживаемый тип 1С"));

		КонецЕсли;
		
	Исключение
		
		СбисДамп = Новый Структура("Тип, ПодТип", ОбъектТип, ОбъектПодТип);
		ВызватьИсключение СбисИсключение_Выгрузить(НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаСервер.НовыйОбъект1С",,,,СбисДамп));
		
	КонецПопытки;
	
	Возврат Объект1СЗначение;

КонецФункции

// Функция - даёт представление объекта 1С в нужном падеже
//
// Параметры:
//  ОбъектТип	 - Строка	 - склоняемый тип 1С
//  ДопПараметры - Структура	 - (Н) ПризнакПадеж - падеж, ОбъектПодТип - строка, имя метаданных объекта, ЭтоНовый - булево, новый объект или нет
// 
// Возвращаемое значение:
//  Строка - пример: нового справочника "ОбъектПодТип" / записи регистра сведений "ОбъектПодТип"  
//
Функция ПредставлениеОбъекта1С(ОбъектТип, ДопПараметры = Неопределено)
	Перем ПризнакПадеж, ПризнакСклонения2, ПризнакСклонения3, ПризнакСклонения4, ПредставлениеМетаданные, ОбъектПодТип, ЭтоНовый;
	
	Если Не ДопПараметры = Неопределено Тогда
		ДопПараметры.Свойство("ПризнакПадеж",	ПризнакПадеж);
		ДопПараметры.Свойство("ОбъектПодТип",	ОбъектПодТип);
		ДопПараметры.Свойство("ЭтоНовый",		ЭтоНовый);
	КонецЕсли;
	
	Если   		ПризнакПадеж = "Р" Тогда
		
		ПризнакСклонения1 = "а";
		ПризнакСклонения2 = "ого";
		ПризнакСклонения3 = "ую";
		ПризнакСклонения4 = "ь";
		
	ИначеЕсли   ПризнакПадеж = "Д" Тогда
		
		ПризнакСклонения1 = "у";
		ПризнакСклонения2 = "ому";
		ПризнакСклонения3 = "ой";
		ПризнакСклонения4 = "и";
		
	ИначеЕсли   ПризнакПадеж = "Т" Тогда
		
		ПризнакСклонения1 = "ом";
		ПризнакСклонения2 = "ым";
		ПризнакСклонения3 = "ой";
		ПризнакСклонения4 = "ью";
		
	ИначеЕсли   ПризнакПадеж = "П" Тогда
		
		ПризнакСклонения1 = "е";
		ПризнакСклонения2 = "ом";
		ПризнакСклонения3 = "ой";
		ПризнакСклонения4 = "и";
		
	Иначе
		
		ПризнакСклонения1 = "";
		ПризнакСклонения2 = "ый";
		ПризнакСклонения3 = "ую";
		ПризнакСклонения4 = "ь";
		
	КонецЕсли;
	
	ЭтоНовый = ТипЗнч(ЭтоНовый) = Тип("Булево") И ЭтоНовый;
	
	Если ОбъектТип = "Справочник" Тогда
		
		ТекстТип				= "справочник{ПризнакСклонения1}";
		ПредставлениеМетаданные = Метаданные.Справочники.Найти(ОбъектПодТип);
		
		Если ЭтоНовый Тогда
			
			ТекстТип = "нов{ПризнакСклонения3} запис{ПризнакСклонения4} " + ТекстТип;
			
		КонецЕсли;
			
	ИначеЕсли ОбъектТип = "ПланВидовХарактеристик" Тогда
		
		ТекстТип				= "план{ПризнакСклонения1} видов характеристик";
		ПредставлениеМетаданные = Метаданные.ПланыВидовХарактеристик.Найти(ОбъектПодТип);
		
		Если ЭтоНовый Тогда
			
			ТекстТип = "нов{ПризнакСклонения3} запис{ПризнакСклонения4} " + ТекстТип;
			
		КонецЕсли;

	ИначеЕсли ОбъектТип = "Документ" Тогда
		
		ТекстТип				= "документ{ПризнакСклонения1}";
		ПредставлениеМетаданные = Метаданные.Документы.Найти(ОбъектПодТип);
		
		Если ЭтоНовый Тогда
			
			ТекстТип = "нов{ПризнакСклонения2} " + ТекстТип;
			
		КонецЕсли;
		
	ИначеЕсли ОбъектТип = "РегистрыСведений" Тогда

		ТекстТип				= "регистр{ПризнакСклонения1} сведений";
		ПредставлениеМетаданные = Метаданные.РегистрыСведений.Найти(ОбъектПодТип);
		
		Если ЭтоНовый Тогда
			
			ТекстТип = "нов{ПризнакСклонения3} запис{ПризнакСклонения4} " + ТекстТип;
			
		КонецЕсли;
		
	Иначе
		
		ТекстТип = "неизвестн{ПризнакСклонения2} объект{ПризнакСклонения1}";
		
	КонецЕсли;
	
	Если Не ПредставлениеМетаданные = Неопределено Тогда
		
		ТекстТип = ТекстТип + " " + ПредставлениеМетаданные.Синоним;
		
	КонецЕсли;
	
	Возврат СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(ТекстТип,	
				"{ПризнакСклонения1}",	ПризнакСклонения1),
				"{ПризнакСклонения2}",	ПризнакСклонения2),
				"{ПризнакСклонения3}",	ПризнакСклонения3),
				"{ПризнакСклонения4}",	ПризнакСклонения4);
	
КонецФункции

Процедура ЗаполнитьОбъект1СНашимиДанными(Объект1СЗначение, Объект1ССтрукутраНаша, ДопПараметры)
	Перем ИниОбъекта, ДополнятьТабЧасть, РедактироватьТабЧасть, ПроводитьЗапись, ЗаполняемыеТабЧасти, ЗаполнитьДаннымиДругогоОбъекта, ДокументОснование;
	
	ДопПараметры.Свойство("ЗаполнитьДаннымиДругогоОбъекта",		ЗаполнитьДаннымиДругогоОбъекта); 
	ДопПараметры.Свойство("ДокументОснование",					ДокументОснование);
	ДопПараметры.Свойство("ДополнятьТабЧасть",					ДополнятьТабЧасть);
	ДопПараметры.Свойство("РедактироватьТабЧасть",				РедактироватьТабЧасть);  
	ДопПараметры.Свойство("ПроводитьЗапись",					ПроводитьЗапись);
	
	Если Не ДопПараметры.Свойство("ЗаполняемыеТабЧасти", ЗаполняемыеТабЧасти) Тогда 
		
		ЗаполняемыеТабЧасти = Новый Массив
		
	КонецЕсли;
	
	Если Не ДопПараметры.Свойство("Ини", ИниОбъекта) Тогда 
		
		ИниОбъекта = Новый Структура;
		
	КонецЕсли;				
	
	ЗаполнитьДаннымиДругогоОбъекта		= ЗаполнитьДаннымиДругогоОбъекта	= Истина;
	ДополнятьТабЧасть					= ДополнятьТабЧасть					= Истина;
	РедактироватьТабЧасть				= РедактироватьТабЧасть				= Истина;
	
	Если ЗаполнитьДаннымиДругогоОбъекта Тогда
		
		Объект1СЗначение.Заполнить(ДокументОснование);  
		
		Возврат;
		
	КонецЕсли;	
	
	//Заполняем объект данными		
	Для Каждого Элемент Из Объект1ССтрукутраНаша Цикл
		
		Попытка
			Если ТипЗнч(Элемент.Значение) = Тип("Массив") Тогда
				
				// ТЧ редактируется только если есть соответствующий узел в мТаблДок
				Если	РедактироватьТабЧасть
					И	ИниОбъекта.Свойство("мТаблДок")
					И	ИниОбъекта.мТаблДок.Свойство(Элемент.Ключ)	 Тогда
					
					КлючиПоиска = РассчитатьЗначениеSABY("КлючСтроки", Новый Структура("ини", ИниОбъекта.мТаблДок[Элемент.Ключ]));
					Если ЗначениеЗаполнено(КлючиПоиска) Тогда
						
						сбисДозаполнитьТабличнуюЧасть(Объект1СЗначение, Элемент, КлючиПоиска, ИниОбъекта);
						
					КонецЕсли;
				Иначе
					
					Если Не ДополнятьТабЧасть ИЛИ ЗаполняемыеТабЧасти.Найти(Элемент.Ключ) = Неопределено Тогда
						
						Объект1СЗначение[Элемент.Ключ].Очистить();
						
					КонецЕсли;
					
					Для Каждого Строка Из Элемент.Значение Цикл
						
						НоваяСтрока = Объект1СЗначение[Элемент.Ключ].Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
						
					КонецЦикла; 
					
				КонецЕсли;
				
				// Есть ТЧ, пока не проверяем.
				ПроводитьЗапись = Истина;
				
			Иначе
				
				ПроводитьЗапись = Истина;
				Объект1СЗначение[Элемент.Ключ] = Элемент.Значение;
			
			КонецЕсли;
			
		Исключение
			
			// Свойство в структуре не совпадает с данными документа. Делать тут проверку по метаданным пока не целесообразно, 
			// т.к. транзакции мы не используем и тут придётся всё переписать, а по быстродействию - 99% свойств совпадает.
			Продолжить;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Попытка
		// Выполняем обработчики по строкам табличных частей документа
		Если ДопПараметры.Ини.Свойство("мТаблДок") Тогда
			ТабличныеЧастиДокумента = Объект1СЗначение.Метаданные().ТабличныеЧасти;
			Для каждого ТабЧасть Из ТабличныеЧастиДокумента Цикл
				Если	ДопПараметры.Ини.мТаблДок.Свойство(ТабЧасть.Имя)
						И ДопПараметры.Ини.мТаблДок[ТабЧасть.Имя].Свойство("мОбработчикПередЗаписьюНаСервере") Тогда
					Для каждого СтрокаТЧ Из Объект1СЗначение[ТабЧасть.Имя] Цикл
						ДопПараметрыОбработчика = Новый Структура;
						ДопПараметрыОбработчика.Вставить("ПересчитыватьНДСПоДанным1С", ?(ДопПараметры.Ини.Свойство("ПересчитыватьНДСПоДанным1С"), ДопПараметры.Ини.ПересчитыватьНДСПоДанным1С.РассчитанноеЗначение, 2));	
						ДопПараметрыОбработчика.Вставить("ПересчитыватьЦеныПоДанным1С", ?(ДопПараметры.Ини.Свойство("ПересчитыватьЦеныПоДанным1С"), ДопПараметры.Ини.ПересчитыватьЦеныПоДанным1С.РассчитанноеЗначение, 2));
						сбисВыполнитьОбработчикиПоСтрокеТЧ(ДопПараметры.Ини.мТаблДок[ТабЧасть.Имя].мОбработчикПередЗаписьюНаСервере, Объект1СЗначение, ТабЧасть.Имя,	СтрокаТЧ, ДопПараметрыОбработчика);
						ПроводитьЗапись = Истина;
					КонецЦикла;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
	Исключение
		
		// TODO прикрутить проброску возникших в процессе ошибок.
		Ошибка = ИнформацияОбОшибке();
		
	КонецПопытки;
	
	//Выполняем обработчики по документу
	Попытка
		Если ДопПараметры.Ини.Свойство("мОбработчикПередЗаписьюНаСервере") Тогда
			ДопПараметрыОбработчика = Новый Структура;
			ДопПараметрыОбработчика.Вставить("ПересчитыватьНДСПоДанным1С", ?(ДопПараметры.Ини.Свойство("ПересчитыватьНДСПоДанным1С"), ДопПараметры.Ини.ПересчитыватьНДСПоДанным1С.РассчитанноеЗначение, 2));
			ДопПараметрыОбработчика.Вставить("ПересчитыватьЦеныПоДанным1С", ?(ДопПараметры.Ини.Свойство("ПересчитыватьЦеныПоДанным1С"), ДопПараметры.Ини.ПересчитыватьЦеныПоДанным1С.РассчитанноеЗначение, 2));
			ДопПараметрыОбработчика.Вставить("АвтоматическиеСкидкиВПродажах", ?(ДопПараметры.Ини.Свойство("_АвтоматическиеСкидкиВПродажах"), ДопПараметры.Ини._АвтоматическиеСкидкиВПродажах.РассчитанноеЗначение, Ложь));
			ДопПараметрыОбработчика.Вставить("МодульРасчетаСкидок", ?(ДопПараметры.Ини.Свойство("МодульРасчетаСкидок"), ДопПараметры.Ини.МодульРасчетаСкидок.РассчитанноеЗначение, Ложь));
			сбисВыполнитьОбработчикиПоДокументу(ДопПараметры.Ини.мОбработчикПередЗаписьюНаСервере, Объект1СЗначение, ДопПараметрыОбработчика);
			ПроводитьЗапись = Истина;
		КонецЕсли;							
	Исключение
		
		// TODO прикрутить проброску возникших в процессе ошибок.
		Ошибка = ИнформацияОбОшибке();
		
	КонецПопытки;	
	ДопПараметры.Вставить("ПроводитьЗапись", ПроводитьЗапись = Истина);
	
КонецПроцедуры

Функция ЗаполнитьОбъект1СПроизвольнымиДанными(Объект1СЗначение, Объект1ССтрукутраНаша, ДопПараметры)
	Перем ПараметрПроверить;
	
	ДанныеЗаполнитьКопия = СоздатьКопиюОбъекта(Объект1ССтрукутраНаша);
	НаборТЧ				 = Новый Структура;
	Результат			 = Новый Структура("Изменен", Ложь);
	СвойстваИсключить  	 = "";
	
	// Отделить Тч от реквизитов шапки
	Для Каждого ОбъектМетаданных Из Объект1СЗначение.Метаданные().ТабличныеЧасти Цикл
		
		Если Объект1ССтрукутраНаша.Свойство(ОбъектМетаданных.Имя, ПараметрПроверить) Тогда
			
			НаборТЧ.Вставить(ОбъектМетаданных.Имя, ПараметрПроверить);
			ДанныеЗаполнитьКопия.Удалить(ОбъектМетаданных.Имя);
			СвойстваИсключить = ОбъектМетаданных.Имя + ",";
			
		КонецЕсли;

	КонецЦикла;
	СвойстваИсключить = Сред(СвойстваИсключить, 1, СтрДлина(СвойстваИсключить) - 1);
	
	ЗаполнитьЗначенияСвойств(ДанныеЗаполнитьКопия, Объект1СЗначение); // Для проверки изменений и определния необходимости записи.
	ЗаполнитьЗначенияСвойств(Объект1СЗначение, Объект1ССтрукутраНаша,,СвойстваИсключить);
	
	Если Объект1СЗначение.ЭтоНовый() Тогда
		
		Результат.Изменен = Истина;
		
	Иначе 
		
		// Проверить изменения
		Для Каждого Элемент Из ДанныеЗаполнитьКопия Цикл
			
			Если Элемент.Значение = Объект1ССтрукутраНаша[Элемент.Ключ] Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Результат.Изменен = Истина;
			Прервать;
				
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьТабличныеЧастиОбъекта(Объект1СЗначение, НаборТЧ, Результат, ДопПараметры);
	
	Возврат Результат;
		
КонецФункции

Процедура ЗаполнитьТабличныеЧастиОбъекта(Объект1СЗначение, НаборТЧ, Результат, ДопПараметры)
	Перем ПравилаДляОбработкиТЧ, ПравилоДляТЧ, РезультатПоТекущейТЧ;
	
	Если	Не ДопПараметры.Свойство("ПравилаОбработки", ПравилаДляОбработкиТЧ)
		Или	Не ПравилаДляОбработкиТЧ.Свойство("ТабличныеЧасти", ПравилаДляОбработкиТЧ)Тогда
		
		ПравилаДляОбработкиТЧ = Новый ФиксированнаяСтруктура;
		//ДопПараметры.ПравилаОбработки.Вставить("ТабличныеЧасти", ПравилаДляОбработкиТЧ);
		
	КонецЕсли;
	
	РезультатПоТч = Новый Структура;
	Результат.Вставить("ТабличныеЧасти", РезультатПоТч);
	
	Для Каждого КлючИЗначениеТЧ Из НаборТЧ Цикл
		
		Если Не РезультатПоТч.Свойство(КлючИЗначениеТЧ.Ключ, РезультатПоТекущейТЧ) Тогда
			
			РезультатПоТекущейТЧ = Новый Структура("Очищалась, Изменено, Добавлено", Ложь, Новый Массив, Новый Массив);
			
		КонецЕсли;
		
		Если Не ПравилаДляОбработкиТЧ.Свойство(КлючИЗначениеТЧ.Ключ, ПравилоДляТЧ) Тогда
			
			ПравилоДляТЧ = Новый ФиксированнаяСтруктура;
			
		КонецЕсли;
		
		ИзменитьСтрокиТабличнойЧасти(Объект1СЗначение, КлючИЗначениеТЧ, ПравилоДляТЧ, РезультатПоТекущейТЧ);
		Результат.Изменен = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция - Изменить строки табличной части
//
// Параметры:
//  Объект1СЗначение		 - Объект1С	 - изменяемый объект
//  ТабличнаяЧастьОписание	 - КлючИЗначение/Структура с полями Ключ и Значение	 - изменяемые строки
//  ПравилоДляЗаполненияТч	 - Структура	 - 
// 
// Возвращаемое значение:
//   - 
//
Процедура ИзменитьСтрокиТабличнойЧасти(Объект1СЗначение, ТабличнаяЧастьОписание, РезультатЗаполнить, ПравилоДляЗаполненияТч)
	Перем РезультатИзмененияТЧ;
	
	ТабличинаяЧастьЗаполнить = Объект1СЗначение[ТабличнаяЧастьОписание.Ключ];
	
	// Правило очистки ТЧ
	Если	Не РезультатЗаполнить.Очищалась	
		И	(Не ПравилоДляЗаполненияТч.Свойство("Очистить")
			Или	ПравилоДляЗаполненияТч.Очистить) Тогда
		
		// Чистим ТЧ один раз если не задано, или стояла очистка. На случай заполнения одной ТЧ из разных источников
		РезультатЗаполнить.Очищалась = Истина;
		ТабличинаяЧастьЗаполнить.Очистить();
		
	КонецЕсли;

	Если ТипЗнч(ТабличнаяЧастьОписание.Значение) = Тип("Массив") Тогда
		
		Для Каждого СтрокаЗначение Из ТабличнаяЧастьОписание.Значение Цикл
			
			ОбработатьСтрокуДляТабличнойЧасти(ТабличинаяЧастьЗаполнить, СтрокаЗначение, РезультатЗаполнить, ПравилоДляЗаполненияТч);
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ТабличнаяЧастьОписание.Значение) = Тип("Структура") Тогда
		
		ОбработатьСтрокуДляТабличнойЧасти(ТабличинаяЧастьЗаполнить, ТабличнаяЧастьОписание.Значение, РезультатЗаполнить, ПравилоДляЗаполненияТч);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработатьСтрокуДляТабличнойЧасти(ТабличинаяЧастьЗаполнить, СтрокаЗначение, РезультатЗаполнения, ПравилоДляЗаполненияТч)
	Перем ПоискСтрокиДляИзменения;

	ПравилоДляЗаполненияТч.Свойство("ПоискСтрокиДляИзменения", ПоискСтрокиДляИзменения);

	ДобавитьСтроку =	Не	ПравилоДляЗаполненияТч.Свойство("ДобавитьНовые")
					Или		ПравилоДляЗаполненияТч.ДобавитьНовые;
	Если Не ПоискСтрокиДляИзменения = Неопределено Тогда
		
		КлючиДляНайти = Новый Структура(ПоискСтрокиДляИзменения.Ключи);
		ЗаполнитьЗначенияСвойств(КлючиДляНайти, СтрокаЗначение);
		
		СтрокиДляТЧ = ТабличинаяЧастьЗаполнить.НайтиСтроки(КлючиДляНайти);
		Если СтрокиДляТЧ.Количество() Тогда
			
			ДобавитьСтроку = Ложь;
			Для Каждого СтрокаДляТЧ Из СтрокиДляТЧ Цикл
				
				ЗаполнитьЗначенияСвойств(СтрокаДляТЧ, СтрокаЗначение);
				РезультатЗаполнения.Изменено.Добавить(СтрокаДляТЧ);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДобавитьСтроку Тогда
		
		СтрокаДляТЧ = ТабличинаяЧастьЗаполнить.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДляТЧ, СтрокаЗначение);
		РезультатЗаполнения.Добавлено.Добавить(СтрокаДляТЧ);
		
	КонецЕсли;

КонецПроцедуры

