
//DynamicDirective

// Функция - Получает значение параметра по описанию
//
// Параметры:
//  ИмяПараметраСбис - Ключ	 - 
//  ДопПараметры	 - 	 - 
// 
// Возвращаемое значение:
//  Произвольный - значение параметра по ключу
//
Функция ПараметрSABY(КлючПараметра, ДопПараметры = Неопределено) Экспорт
	Перем ТипПараметра, ЗначениеПараметраСбис, ИсточникПроверкиПараметра;
	
	Если Не ДопПараметры = Неопределено Тогда
		
		Если ТипЗнч(ДопПараметры) = Тип("Строка") Тогда
			
			ТипПараметра = ДопПараметры;
			
		Иначе
			
			ДопПараметры.Свойство("ЛокальныйКэш",	ИсточникПроверкиПараметра);
			ДопПараметры.Свойство("Тип",			ТипПараметра);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИсточникПроверкиПараметра = Неопределено Тогда
		
		ИсточникПроверкиПараметра = ГлобальныйКэш();
		Если ИсточникПроверкиПараметра = Неопределено Тогда
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если		ТипПараметра = Неопределено Тогда
				
		РезультатПоиска =	ИсточникПроверкиПараметра.Парам.Свойство					(КлючПараметра, ЗначениеПараметраСбис)
						Или	ИсточникПроверкиПараметра.СБИС.Свойство						(КлючПараметра, ЗначениеПараметраСбис)
						Или	ИсточникПроверкиПараметра.СБИС.ПараметрыИнтеграции.Свойство	(КлючПараметра, ЗначениеПараметраСбис)
						Или	ИсточникПроверкиПараметра.ТекущийСеанс.Параметры.Свойство	(КлючПараметра, ЗначениеПараметраСбис)
						Или	ИсточникПроверкиПараметра.ТекущийСеанс.Модули.Свойство		(КлючПараметра, ЗначениеПараметраСбис);
		
	ИначеЕсли	ТипПараметра = "Пользователь" Тогда
						
		РезультатПоиска =	ИсточникПроверкиПараметра.Парам.Свойство					(КлючПараметра, ЗначениеПараметраСбис);

	ИначеЕсли	ТипПараметра = "Сбис" Тогда
		
		ИсточникПроверкиПараметра = ИсточникПроверкиПараметра.СБИС;
		РезультатПоиска =	ИсточникПроверкиПараметра.Свойство						(КлючПараметра, ЗначениеПараметраСбис)
						Или	ИсточникПроверкиПараметра.ПараметрыИнтеграции.Свойство	(КлючПараметра, ЗначениеПараметраСбис)		
						Или	ИсточникПроверкиПараметра.ДанныеИнтеграции.Свойство		(КлючПараметра, ЗначениеПараметраСбис)
						Или	(	ИсточникПроверкиПараметра.ДанныеИнтеграции.Свойство		("Объекты", ЗначениеПараметраСбис)
							И	ЗначениеПараметраСбис.Свойство(КлючПараметра, ЗначениеПараметраСбис));		

	ИначеЕсли	ТипПараметра = "Сеанс" Тогда
		
		ИсточникПроверкиПараметра = ИсточникПроверкиПараметра.ТекущийСеанс;
		РезультатПоиска =	ИсточникПроверкиПараметра.Свойство									(КлючПараметра, ЗначениеПараметраСбис)	
						ИЛИ	ИсточникПроверкиПараметра.Интерфейс.Свойство						(КлючПараметра, ЗначениеПараметраСбис)
						ИЛИ	ИсточникПроверкиПараметра.Модули.Свойство							(КлючПараметра, ЗначениеПараметраСбис)
						ИЛИ	ИсточникПроверкиПараметра.Параметры.Свойство						(КлючПараметра, ЗначениеПараметраСбис)
						ИЛИ	ИсточникПроверкиПараметра.ОписаниеКонфигурации.Свойство				(КлючПараметра, ЗначениеПараметраСбис)
						ИЛИ	ИсточникПроверкиПараметра.ОписаниеКонфигурации.ТипыПолей1С.Свойство	(КлючПараметра, ЗначениеПараметраСбис);
			
	ИначеЕсли	ТипПараметра = "Технический" Тогда
		
		ИсточникПроверкиПараметра = ИсточникПроверкиПараметра.Парам.ТехническиеПараметры;
		ИсточникПроверкиПараметра.Свойство(КлючПараметра, ЗначениеПараметраСбис);	

	ИначеЕсли	ТипПараметра = "Настройки" Тогда
		
		ИсточникПроверкиПараметра = ИсточникПроверкиПараметра.КэшНастроек;
		ИсточникПроверкиПараметра.Свойство(КлючПараметра, ЗначениеПараметраСбис);	
	
	КонецЕсли; 
		
	Возврат ЗначениеПараметраСбис;
	
КонецФункции

