
//DynamicDirective

// Функция - Возвращает параметры для чтения файла настройки по текущему вложению
//
// Параметры:
//  ВложениеСБИС - 	 - 
//  ДопПараметры - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВложениеСБИС_Получить_ПараметрыИни(ВложениеСБИС, ДопПараметры)

	Результат = Новый Структура("Версия, Направление, Тип");
	
	Если	Не ВложениеСбис.Свойство("ФорматДляЗагрузки",	Результат.Тип)
		И	Не ВложениеСбис.Свойство("Тип",					Результат.Тип) Тогда
		
		НазваниеВложение = ВложениеСБИС_Получить(ВложениеСбис, "Название");
		Если		СтрЧислоВхождений(НРег(НазваниеВложение), "накладная") Тогда
			Результат.Тип = "ЭДОНакл";
		ИначеЕсли	СтрЧислоВхождений(НРег(НазваниеВложение), "фактура")
				И	СтрЧислоВхождений(НРег(НазваниеВложение), "счет")	Тогда
			Результат.Тип = "СчФктр";
		ИначеЕсли	СтрЧислоВхождений(НРег(НазваниеВложение), "акт №") Тогда
			Результат.Тип = "АктВр";
		ИначеЕсли	СтрЧислоВхождений(НРег(НазваниеВложение), "счет на")
				Или	СтрЧислоВхождений(НРег(НазваниеВложение), "заказ")	Тогда
			Результат.Тип = "Заказ";
		Иначе
			
			ОшибкаОпределенияИни = НовыйСбисИсключение(, "МодульОбъектаКлиент.ВложениеСБИС_Получить", 779, , "Неизвестный тип вложения " + НазваниеВложение);
			ВызватьИсключение СбисИсключение_Представление(ОшибкаОпределенияИни);
			
		КонецЕсли;
		
	КонецЕсли;
	Результат.Тип = СтрЗаменить(Результат.Тип, "-", "");

	Если	Не ВложениеСбис.Свойство("Направление", Результат.Направление)	Тогда
		
		Результат.Направление = "Входящий";
		
	КонецЕсли;
	
	Если	ВложениеСбис.Свойство("ВерсияФорматаДляЗагрузки", Результат.Версия)	Тогда
		
		Результат.Версия = СтрЗаменить(Результат.Версия, ".", "_");
		
	Иначе
		
		Результат.Версия = "3_01";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции		

//DynamicDirective

// Функция - возвращает признак наличия подконтрольного товара 
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - Структура вложения
//  ДопПараметры - Структура	 - расширение работы функции
// 
// Возвращаемое значение:
//  Структура - Список признаков подконтрольного товара
//
Функция ВложениеСБИС_Получить_ПризнакГоссистемы(ВложениеСБИС, ДопПараметры)
	
	СтруктураФайла = ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
	
	ПутьТаблДок = "Файл.Документ.ТаблДок.СтрТабл";
	
	ПутьКМаркируемомуТовару		= "НомСредИдентТов";
	ПутьКПрослеживаемомуТовару	= "СведПрослеж";
	
	ТаблДок = ДанныеИзУниверсальнойКоллекцииПоПути(СтруктураФайла, ПутьТаблДок);     

	// Параметры, которые требуется определить по ТЧ товаров с марк и прослеж.
	НаличиеМаркированногоТовара		= Ложь; 
	НаличиеПрослеживаемогоТовара	= Ложь;
		
	Для Каждого СтрТабл Из ТаблДок Цикл
		
		НаличиеМаркированногоТовараВСтроке = Ложь;
		
		НаличиеМаркированногоТовараВСтроке = ЗначениеЗаполнено(ДанныеИзУниверсальнойКоллекцииПоПути(СтрТабл, ПутьКМаркируемомуТовару));
		
		Если Не НаличиеМаркированногоТовара И НаличиеМаркированногоТовараВСтроке Тогда 
			
			// Пока не найдена маркировка, проверять. 
			НаличиеМаркированногоТовара = Истина;
			
		КонецЕсли; 
		
		Если Не НаличиеПрослеживаемогоТовара Тогда
			
			// Пока не найдена прослежка, проверять. 
			НаличиеПрослеживаемогоТовара = ЗначениеЗаполнено(ДанныеИзУниверсальнойКоллекцииПоПути(СтрТабл, ПутьКПрослеживаемомуТовару));
			
		КонецЕсли;
		
	КонецЦикла; 
	
	ПризнакиПодконтрольногоТовара = Новый Структура;
	
	ПризнакиПодконтрольногоТовара.Вставить("ЕстьМаркировка",		НаличиеМаркированногоТовара); 
	ПризнакиПодконтрольногоТовара.Вставить("ЕстьПрослеживаемость",	НаличиеПрослеживаемогоТовара); 
	
	Возврат ПризнакиПодконтрольногоТовара;	
	
КонецФункции

