
//DynamicDirective

// Функция - Возвращает параметры для чтения файла настройки по текущему вложению
//
// Параметры:
//  ВложениеСБИС - 	 - 
//  ДопПараметры - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВложениеСБИС_Получить_ПараметрыИни(ВложениеСБИС, ДопПараметры)

	Результат = Новый Структура("Версия, Направление, Тип");
	
	Если	Не ВложениеСбис.Свойство("ФорматДляЗагрузки",	Результат.Тип)
		И	Не ВложениеСбис.Свойство("Тип",					Результат.Тип) Тогда
		
		НазваниеВложение = ВложениеСБИС_Получить(ВложениеСбис, "Название");
		Если		СтрЧислоВхождений(НРег(НазваниеВложение), "накладная") Тогда
			Результат.Тип = "ЭДОНакл";
		ИначеЕсли	СтрЧислоВхождений(НРег(НазваниеВложение), "фактура")
				И	СтрЧислоВхождений(НРег(НазваниеВложение), "счет")	Тогда
			Результат.Тип = "СчФктр";
		ИначеЕсли	СтрЧислоВхождений(НРег(НазваниеВложение), "акт №") Тогда
			Результат.Тип = "АктВр";
		ИначеЕсли	СтрЧислоВхождений(НРег(НазваниеВложение), "счет на")
				Или	СтрЧислоВхождений(НРег(НазваниеВложение), "заказ")	Тогда
			Результат.Тип = "Заказ";
		Иначе
			
			ОшибкаОпределенияИни = НовыйСбисИсключение(, "МодульОбъектаКлиент.ВложениеСБИС_Получить", 779, , "Неизвестный тип вложения " + НазваниеВложение);
			ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаОпределенияИни);
			
		КонецЕсли;
		
	КонецЕсли;
	Результат.Тип = СтрЗаменить(Результат.Тип, "-", "");

	Если	Не ВложениеСбис.Свойство("Направление", Результат.Направление)	Тогда
		
		Результат.Направление = "Входящий";
		
	КонецЕсли;
	
	Если	ВложениеСбис.Свойство("ВерсияФорматаДляЗагрузки", Результат.Версия)	Тогда
		
		Результат.Версия = СтрЗаменить(Результат.Версия, ".", "_");
		
	Иначе
		
		Результат.Версия = "3_01";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции		

//DynamicDirective

// Функция - возвращает признак наличия подконтрольного товара 
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - Структура вложения
//  ДопПараметры - Структура	 - расширение работы функции
// 
// Возвращаемое значение:
//  Структура - Список признаков подконтрольного товара
//
Функция ВложениеСБИС_Получить_ПризнакГоссистемы(ВложениеСБИС, ДопПараметры)
	Перем ВидМаркированногоТовара;
	
	СтруктураФайла = ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
	
	ПутьТаблДок = "Файл.Документ.ТаблДок.СтрТабл";
	
	ПутьКМаркируемомуТовару		= "НомСредИдентТов";
	ПутьКПрослеживаемомуТовару	= "СведПрослеж";
	
	ТаблДок = ДанныеИзУниверсальнойКоллекцииПоПути(СтруктураФайла, ПутьТаблДок);     

	// Параметры, которые требуется определить по ТЧ товаров с марк и прослеж.
	ВидыМаркированногоТовара		= Новый Массив;
	НаличиеКодовМаркировки			= Ложь;
	НаличиеПрослеживаемогоТовара	= Ложь;
	
	// TODO Для формата 3.03 предусмотреть поиск ТаблДок в "Файл.Документ.СписокСтрТабл.СтрТабл" через классы 3.01/3.03
	// Проблемы: 
	// 1. Клиент-сервер, нет доступа к формам, возможно через метод класса ВложениеСБИС с отдельной реализацией функции
	//		на клиенте - вызов с поиском по формату
	//		на сервере - в лоб, через "Если", расширяя остальные форматы по мере пополнения
	// 2. Возможно, есть различия в структуре прослежки/маркировке
	Если ЗначениеЗаполнено(ТаблДок) Тогда

		Для Каждого СтрТабл Из ТаблДок Цикл
				
			ПараметрыСтроки = ДанныеИзУниверсальнойКоллекцииПоПути(СтрТабл, "Параметр");
			
			// Добавим вид маркировки товара
			Если ЗначениеЗаполнено(ПараметрыСтроки) Тогда
				ВидМаркированногоТовара = НайтиВМассивеСтруктурЗначениеПоИмени(ПараметрыСтроки, "ТовГрМарк");
			КонецЕсли;
			
			Если  ЗначениеЗаполнено(ВидМаркированногоТовара) И ВидыМаркированногоТовара.Найти(ВидМаркированногоТовара) = Неопределено Тогда
					
				ВидыМаркированногоТовара.Добавить(ВидМаркированногоТовара);
			
			КонецЕсли;	
			
			Если Не НаличиеКодовМаркировки Тогда 
				
				// Пока не найдены коды маркировки, проверять. 
				НаличиеКодовМаркировки = ЗначениеЗаполнено(ДанныеИзУниверсальнойКоллекцииПоПути(СтрТабл, ПутьКМаркируемомуТовару));
				
			КонецЕсли;
			
			Если Не НаличиеПрослеживаемогоТовара Тогда
				
				// Пока не найдена прослежка, проверять. 
				НаличиеПрослеживаемогоТовара = ЗначениеЗаполнено(ДанныеИзУниверсальнойКоллекцииПоПути(СтрТабл, ПутьКПрослеживаемомуТовару));
				
			КонецЕсли;
			
		КонецЦикла;

	КонецЕсли;
	
	ПризнакиПодконтрольногоТовара = Новый Структура;
	
	ПризнакиПодконтрольногоТовара.Вставить("ВидыМаркированногоТовара",		ВидыМаркированногоТовара);
	ПризнакиПодконтрольногоТовара.Вставить("ЕстьМаркировка",				ЗначениеЗаполнено(ВидыМаркированногоТовара));
	ПризнакиПодконтрольногоТовара.Вставить("ЕстьКодыМаркировки",			НаличиеКодовМаркировки); 
	ПризнакиПодконтрольногоТовара.Вставить("ЕстьПрослеживаемость",			НаличиеПрослеживаемогоТовара); 
	
	Возврат ПризнакиПодконтрольногоТовара;
	
КонецФункции

