
//DynamicDirective

// Функция - получить значение по ключу от вложения
//
// Параметры:
//  ВложениеСбис			 - ВложениеСБИС	 - экземпляр, от которого надо получить значение
//  КлючПараметраПолучить	 - Строка		 - что хотим получить ПараметрыДанныхВложения, УстановленныйПодразделИни
//  ДопПараметры			 - Структура	 - Расширение
// 
// Возвращаемое значение:
//  Произвольный - Найденное значение. Неопределено, если ничего
//
Функция ВложениеСБИС_Получить(ВложениеСбис, КлючПараметраПолучить, ДопПараметры = Неопределено) Экспорт
	Перем Результат, лПромежуточноеЗначение;
	
	Если		КлючПараметраПолучить = "ПараметрыИни"
			Или	КлючПараметраПолучить = "ПараметрыДанныхВложения" Тогда
		
		Возврат ВложениеСБИС_Получить_ПараметрыИни(ВложениеСБИС, ДопПараметры);
			
	ИначеЕсли КлючПараметраПолучить = "СтруктураФайла" Тогда
		
		// Считаем структурой файла структуру документа по данным 1С.
		Если	Не ВложениеСбис.Свойство("СтруктураФайла",		Результат)
			И	Не ВложениеСбис.Свойство("СтруктураДокумента",	Результат) Тогда 
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	ИначеЕсли	КлючПараметраПолучить = "Название" Тогда
		
		Если Не ВложениеСбис.Свойство("Название", Результат) Тогда 
			
			СтруктураФайла = ВложениеСБИС_Получить(ВложениеСбис, "СтруктураФайла");
			Если Не СтруктураФайла = Неопределено Тогда
			
				Результат = Результат.Файл.Имя;
				
			Иначе
				
				Результат = "";
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли	КлючПараметраПолучить = "Идентификатор" Тогда
		
		Если	Не ВложениеСбис.Свойство("Идентификатор", Результат)
			Или	Не ЗначениеЗаполнено(Результат) Тогда 
			
			Результат = ВложениеСБИС_Получить(ВложениеСбис, "Название");
			
        КонецЕсли;

	ИначеЕсли	КлючПараметраПолучить = "ТипВерсияВложения" Тогда

		//Если ЗначениеЗаполнено(ВложениеСБИС_Получить(ВложениеСбис, "XMLДокумента")) Тогда
			
			ПараметрыИни	= ВложениеСБИС_Получить(ВложениеСбис, "ПараметрыИни");
			Результат		= ПараметрыИни.Тип + "_" + ПараметрыИни.Версия;
			Результат		= СтрЗаменить(Результат, ".", "_");
			
		//КонецЕсли;
 
	ИначеЕсли	КлючПараметраПолучить = "ФайлИни" Тогда
		
		//Возвращает полную инишку для обработки вложения
		ИмяУстановленнойИни = ВложениеСБИС_Получить(ВложениеСБИС, "ИмяИни");
		
		Если ИмяУстановленнойИни = Неопределено Тогда
			
			Возврат ИниПоПараметрам(Новый Структура("Вложение", ВложениеСБИС));
			
		КонецЕсли;
		
		Возврат ИниПоПараметрам(ИмяУстановленнойИни);

	ИначеЕсли	КлючПараметраПолучить = "УстановленныйПодразделИни"
			Или	КлючПараметраПолучить = "СтруктураИниФайла" Тогда
		
		//Возвращает подраздел инишки вложения, который на текущий момент установлен для обработки
		ВложениеСбис.Свойство("СтруктураИниФайла", Результат);

	ИначеЕсли	КлючПараметраПолучить = "ПодходящийДокумент" Тогда
		
		// Возвращает подходищий по данным и установленному подразделу инишки документ
		Возврат ВложениеСБИС_ПодходящийДокумент(ВложениеСбис, ДопПараметры);
						
	ИначеЕсли	КлючПараметраПолучить = "Зашифрован" Тогда
		
		ВложениеСбис.Свойство("Зашифрован", Результат);
		Возврат Результат = "Да"
			Или	Результат = Истина;
		
	ИначеЕсли	КлючПараметраПолучить = "Зашировать" Тогда
		// Признак применения шифрования при формирования подготовки к отпраке
		
		ВыборочноеШифрование	= ПолучитьЗначениеПараметраСбис("ШифроватьВыборочно");
		ВыборочноеШифрование	=	Не	ВыборочноеШифрование
								Или (	ВыборочноеШифрование
									И	ВложениеСбис.Свойство("Шифрование", Результат)
									И	Результат = Истина);
		Возврат ПолучитьЗначениеПараметраСбис("Шифрование")
			И	ВыборочноеШифрование;

	ИначеЕсли	КлючПараметраПолучить = "ДанныеФайла" Тогда
		
		Возврат ВложениеСБИС_ДанныеФайла(ВложениеСбис);
		
	ИначеЕсли	КлючПараметраПолучить = "СторонаПоРоли" Тогда
		
		Возврат ВложениеСБИС_СторонаПоРоли(ВложениеСбис, ДопПараметры);
		
	ИначеЕсли	КлючПараметраПолучить = "Поля1С" Тогда
		
		Возврат ВложениеСБИС_Получить_Поля1С(ВложениеСбис, ДопПараметры);
		
	ИначеЕсли	КлючПараметраПолучить = "РассчитанныйОбъект" Тогда
		
		Возврат ВложениеСБИС_РассчитанныйОбъект(ВложениеСбис, ДопПараметры);
		
	ИначеЕсли	КлючПараметраПолучить = "ТипОбъекта" Тогда
		
		Возврат ВложениеСБИС_Получить_ТипОбъекта(ВложениеСбис, ДопПараметры);

	ИначеЕсли	КлючПараметраПолучить = "Статус" Тогда
		
		Возврат ВложениеСБИС_Получить(ВложениеСбис, "СтатусыВложения").Общий;
		
	ИначеЕсли КлючПараметраПолучить = "Модифицирован" Тогда
		
		Если НЕ ВложениеСбис.Свойство(КлючПараметраПолучить, Результат) Тогда
			Результат = Ложь;
		КонецЕсли;
		
	ИначеЕсли	КлючПараметраПолучить = "ТипВложения" Тогда 			

		СтруктураФайла = ВложениеСБИС_Получить(ВложениеСбис, "СтруктураФайла");	   
		
		Если ЗначениеЗаполнено(СтруктураФайла) Тогда
			
			// Пока как костыль берем формат от структуры файла, если по какой-то причине не заполнено на вложении. 
			Результат = СтруктураФайла.Файл.Формат;
			
		Иначе
			
			Результат = ПрименитьФорматКСтроке(ВложениеСбис.Тип, "-", "убрать");
			
		КонецЕсли;
				
	ИначеЕсли	КлючПараметраПолучить = "СтруктураРучныхПравок" Тогда
		
		Результат = Новый Структура;
		Если ВложениеСбис.Параметры.Свойство("РедактируемыеПоля") Тогда
			
			Для Каждого РучноеПоле Из ВложениеСбис.Параметры.РедактируемыеПоля Цикл
				
				Если	    РучноеПоле.Значение = Неопределено
					Или	Не	РучноеПоле.Значение.Свойство("Путь")
					Или		РучноеПоле.Значение.Путь = Неопределено Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				Результат.Вставить(РучноеПоле.Значение.Путь, РучноеПоле.Значение.Значение);
				
			КонецЦикла;
			
		КонецЕсли;

	ИначеЕсли	КлючПараметраПолучить = "ТекстHTML"
			Или	КлючПараметраПолучить = "ВизуализацияДокумента" Тогда
			
		Возврат ВложениеСБИС_Получить_ВизуализацияДокумента(ВложениеСБИС, ДопПараметры);	
			
	ИначеЕсли КлючПараметраПолучить = "ОбновитьВизуализацию" Тогда
		
		Если НЕ ВложениеСбис.Свойство(КлючПараметраПолучить, Результат) Тогда
			Результат = Ложь;
		КонецЕсли;
		
	ИначеЕсли КлючПараметраПолучить = "ПараметрыНоменклатуры" Тогда
		
		ПараметрыВложения = ВложениеСБИС_Получить(ВложениеСБИС, "Параметры");
		Если		ПараметрыВложения = Неопределено
			Или	Не	ПараметрыВложения.Свойство("Номенклатура", Результат)Тогда
			
			Возврат Неопределено;
			
		КонецЕсли;

	ИначеЕсли КлючПараметраПолучить = "Подписи" Тогда
		
		Если Не ВложениеСбис.Свойство("Подпись", Результат) Тогда
			
			Результат = Новый Массив;
			
		КонецЕсли;

	ИначеЕсли КлючПараметраПолучить = "ДанныеСтруктурыФайла" Тогда
		
		Если Не ВложениеСбис.Свойство(КлючПараметраПолучить, Результат) Тогда

			Результат = Новый Структура("Синонимы, Поля", Новый Соответствие, Новый Соответствие); 
			ВложениеСБИС.Вставить("ДанныеСтруктурыФайла", Результат);
			
		КонецЕсли;
		
	ИначеЕсли КлючПараметраПолучить = "СтатусыВложения" Тогда
		
		Если Не ВложениеСбис.Свойство(КлючПараметраПолучить, Результат) Тогда
			
			Результат = Новый Структура("Общий, Заголовок");
			ВложениеСБИС.Вставить("СтатусыВложения", Результат);
			
		КонецЕсли;   
			
	ИначеЕсли КлючПараметраПолучить = "ПризнакиГоссистемы" Тогда
		
		Возврат ВложениеСБИС_Получить_ПризнакГоссистемы(ВложениеСБИС, ДопПараметры);  

	Иначе
		
		ЕстьРезультат = ВложениеСбис.Свойство(КлючПараметраПолучить, Результат)
					Или		ВложениеСбис.Свойство("Параметры")
						И	ВложениеСбис.Параметры.Свойство(КлючПараметраПолучить, Результат)
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

