
//DynamicDirective
Функция яИнтеграцияSABY_Выгрузить_ЗаписьWriteConnection(ИнтеграцияSABY, ДопПараметры)
    Перем РасширениеВыгрузки;
	
	ПараметрыСистемы				 = ГлобальныйКэш_Получить("ПараметрыСистемы");
	
	ЗаписьWriteConnection		= Новый Структура;
	ИдПодключения				= ИнтеграцияSABY_Получить(ИнтеграцияSABY, "Идентификатор");
	ПараметрыКонфигурации		= ИнтеграцияSABY_Получить(ИнтеграцияSABY, "ПараметрыКонфигурации");
	ПараметрыРаботыПодключения	= ИнтеграцияSABY_Получить(ИнтеграцияSABY, "ПараметрыРаботы");
	ТипНастроек					= ИнтеграцияSABY_Получить(ИнтеграцияSABY, "ТипНастроек");
		
	ЭтоНовоеПодключение =	ПараметрыРаботыПодключения.Статус = "Удален"
						Или ПараметрыРаботыПодключения.Статус = "Новый";
	Если ЭтоНовоеПодключение Тогда
		
		// Создание или восстановление нового подключения
		ЗаписьWriteConnection.Вставить("url",		ПараметрыСистемы.Конфигурация.URL);
		ЗаписьWriteConnection.Вставить("service",	ПараметрыСистемы.Платформа.Сервис + ПараметрыСистемы.Платформа.ВерсияСервис);
		ЗаписьWriteConnection.Вставить("subsystem",	ПараметрыКонфигурации.subsystem);
		ЗаписьWriteConnection.Вставить("version",	Формат(ПривестиВерсию(ПараметрыКонфигурации.version, "СтрокуВЧисло"), "ЧРГ=; ЧН=0; ЧГ=0"));
		
		Если ЗначениеЗаполнено(ИдПодключения) Тогда
			
			//Если требуется создать подключение с конкретным ИД
			ЗаписьWriteConnection.Вставить("id", ИдПодключения);
			
		КонецЕсли;
		
	Иначе
		
		ЗаписьWriteConnection.Вставить("id", ИдПодключения);
		
	КонецЕсли;
	
	ЗаписьWriteConnection.Вставить("name_connection",	ИнтеграцияSABY_Получить(ИнтеграцияSABY, "Название"));
	ЗаписьWriteConnection.Вставить("auto_update",		ИнтеграцияSABY_Получить(ИнтеграцияSABY, "Автообновление"));
	ЗаписьWriteConnection.Вставить("update_date",		Формат(ИнтеграцияSABY_Получить(ИнтеграцияSABY, "ДатаИзмененияНастроек"),"ДФ=""гггг-ММ-дд ЧЧ:мм:сс"""));
	ЗаписьWriteConnection.Вставить("for_all", Истина);
	
	ini_array = Новый Массив;
	
	Возврат Новый Структура("props, ini", ЗаписьWriteConnection, ini_array);
	
КонецФункции

