
// Функция - Конструктор класса данных для формирования кода маркировки
// 
// Возвращаемое значение:
//  Структура - Объект класса
//
&НаКлиенте
Функция НовыйДанныеШтрихкода() Экспорт
	
	СтруктураДанныхШтрихкода = ДанныеШтрихкода_Пустой(); 
	
	Возврат СтруктураДанныхШтрихкода;
	
КонецФункции  

// Функция - Конструктор класса данных для формирования кода маркировки
// 
// Возвращаемое значение:
//  Структура - Объект класса
//
&НаКлиенте
Функция ДанныеШтрихкода_Пустой()  
	
	ДанныеШтрихкода = Новый Структура;
	
	ДанныеШтрихкода.Вставить("_класс", "ДанныеШтрихкода"); 
	ДанныеШтрихкода.Вставить("Вид", "");  
	ДанныеШтрихкода.Вставить("ЗначениеШтрихкода", ""); 
	ДанныеШтрихкода.Вставить("ОсобенностьУчета", ""); 
	ДанныеШтрихкода.Вставить("ТипУпаковки", "");
	
	Возврат ДанныеШтрихкода;
	
КонецФункции 

// Процедура - Устанавливает значения в данные штрихкода 
//
// Параметры:
//  ДанныеШтрихкода 	- Структура 	- Объект данных штрихкода
//  КлючУстановить		- Строка 		- Ключ добавляемой информации
//  ЗначениеУстановить	- Строка		- Значение добаляемой информации
//
&НаКлиенте
Процедура ДанныеШтрихкода_Установить(ДанныеШтрихкода, КлючУстановить, ЗначениеУстановить, ДопПараметры = Неопределено) Экспорт 
	
	ДанныеШтрихкода[КлючУстановить] = ЗначениеУстановить;
	
КонецПроцедуры

// Процедура - Обновляет значения в данных штрихкода 
//
// Параметры:
//  ДанныеШтрихкода - Структура 	- Объект данных штрихкода
//  Изменения		- Структура 	- Изменения к объекту данных 
//  ДопПараметры	- Структура		- Набор данных для расширения работы процедуры
//
&НаКлиенте
Процедура ДанныеШтрихкода_Обновить(ДанныеШтрихкода, Изменения, ДопПараметры = Неопределено) Экспорт 
	
	Если Изменения.Свойство("ЗначениеШтрихкода") Тогда 
		
		ДанныеШтрихкода_ОбновитьЗначениеШтрихкода(ДанныеШтрихкода, Изменения); 
		
	ИначеЕсли Изменения.Свойство("ВидШтрихкода") Тогда 
		
		ДанныеШтрихкода_ОбновитьВидШтрихкода(ДанныеШтрихкода, Изменения, ДопПараметры);  
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ДанныеШтрихкода_ОбновитьЗначениеШтрихкода(ДанныеШтрихкода, Изменения, ДопПараметры = Неопределено)
	
	ЗначениеШтрихкода	= ДанныеШтрихкода_Получить(ДанныеШтрихкода, "ЗначениеШтрихкода");  
	ОсобенностьУчета	= ДанныеШтрихкода_Получить(ДанныеШтрихкода, "ОсобенностьУчета");
	
	// Вырезаем скобки у разделителей не полностью потому, что скобки могут содержаться в КИ и КИГУ
	Если Лев(ЗначениеШтрихкода, 1) = "(" Тогда
		Если Сред(ЗначениеШтрихкода, 4, 1) = ")" Тогда    // (00), (01), (02)
			ЗначениеШтрихкода = Сред(ЗначениеШтрихкода, 2, 2)+ Сред(ЗначениеШтрихкода, 5);
		КонецЕсли;
		Если Сред(ЗначениеШтрихкода, 17, 1) = "(" И Сред(ЗначениеШтрихкода, 20, 1) = ")" Тогда          // (21), для коробов табака (11), (13), (37)
			ЗначениеШтрихкода = Сред(ЗначениеШтрихкода, 1, 16) + Сред(ЗначениеШтрихкода, 18, 2) + Сред(ЗначениеШтрихкода, 21);
		КонецЕсли;
		Если ОсобенностьУчета = "Молоко" Тогда
			Если Сред(ЗначениеШтрихкода, 32, 4) = "(17)" Тогда
				ЗначениеШтрихкода = Сред(ЗначениеШтрихкода, 1, 31) + "17" + Сред(ЗначениеШтрихкода, 36);
			КонецЕсли;
			Если Сред(ЗначениеШтрихкода, 32, 6) = "(7003)" Тогда
				ЗначениеШтрихкода = Сред(ЗначениеШтрихкода, 1, 31) + "7003" + Сред(ЗначениеШтрихкода, 38);
			КонецЕсли;
		КонецЕсли;
		Если ОсобенностьУчета = "Обувь" Тогда   // В экспериментальных кодах (выданных в 2019 году) присутствует разделитель (240). Общая длина кода для них 38 символов.
			Если Сред(ЗначениеШтрихкода, 32, 5) = "(240)" Тогда
				ЗначениеШтрихкода = Сред(ЗначениеШтрихкода, 1, 31) + "240" + Сред(ЗначениеШтрихкода, 37);
			КонецЕсли;
		КонецЕсли;
		Если ОсобенностьУчета = "Табак" Или ОсобенностьУчета = "АльтернативныйТабак" Или ОсобенностьУчета = "НикотиносодержащаяПродукция" Тогда
			Если (Сред(ЗначениеШтрихкода, 17, 2) = "11" Или Сред(ЗначениеШтрихкода, 17, 2) = "13") Тогда
				Если Сред(ЗначениеШтрихкода, 25, 4) = "(21)" Тогда
					ЗначениеШтрихкода = Сред(ЗначениеШтрихкода, 1, 24) + "21" + Сред(ЗначениеШтрихкода, 29);
				ИначеЕсли Сред(ЗначениеШтрихкода, 25, 4) = "(37)" Тогда
					ЗначениеШтрихкода = Сред(ЗначениеШтрихкода, 1, 24) + "37" + Сред(ЗначениеШтрихкода, 29);
					Если Сред(ЗначениеШтрихкода, 35, 4) = "(21)" Тогда
						ЗначениеШтрихкода = Сред(ЗначениеШтрихкода, 1, 34) + "21" + Сред(ЗначениеШтрихкода, 39);
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли Сред(ЗначениеШтрихкода, 17, 2) = "37" И Сред(ЗначениеШтрихкода, 27, 4) = "(21)" Тогда
				ЗначениеШтрихкода = Сред(ЗначениеШтрихкода, 1, 26) + "21" + Сред(ЗначениеШтрихкода, 31);
			КонецЕсли;
			Если Найти(ЗначениеШтрихкода, "(240)") Тогда   // Для коробов клиенты могут сами создавать коды, в частности встречаются коды с данным разделителем после серийника, у которого требуется обрезать скобки
				ЗначениеШтрихкода = СтрЗаменить(ЗначениеШтрихкода, "(240)", "240");
			КонецЕсли;
			Если Найти(ЗначениеШтрихкода, "(8005)") Тогда  // по рекомендациям ЧЗ с 26 символа, но у клиентов встречаются коды, где данный разделитель находится дальше 
				ЗначениеШтрихкода = СтрЗаменить(ЗначениеШтрихкода, "(8005)", "8005");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеШтрихкода_Установить(ДанныеШтрихкода, "ЗначениеШтрихкода", ЗначениеШтрихкода);

КонецПроцедуры     

&НаКлиенте
Процедура ДанныеШтрихкода_ОбновитьВидШтрихкода(ДанныеШтрихкода, Изменения, ДопПараметры = Неопределено)
	
	РасширеннаяРаботаСМаркировкой	= ДопПараметры.РасширеннаяРаботаСМаркировкой; 
	НовыйФорматУПД 					= ДопПараметры.НовыйФорматУПД;
	
	ВидШтрихкода 		= ДанныеШтрихкода_Получить(ДанныеШтрихкода, "Вид");	
	ЗначениеШтрихкода	= ДанныеШтрихкода_Получить(ДанныеШтрихкода, "ЗначениеШтрихкода");  
	ОсобенностьУчета	= ДанныеШтрихкода_Получить(ДанныеШтрихкода, "ОсобенностьУчета"); 
	ТипУпаковки			= ДанныеШтрихкода_Получить(ДанныеШтрихкода, "ТипУпаковки");  		
    КодНомУпак 			= ДанныеШтрихкода_Получить(ДанныеШтрихкода, "ГрупповаяУпаковка", ДопПараметры); 
	КодВФорматеОСУ		= ДанныеШтрихкода_Получить(ДанныеШтрихкода, "КодОСУ");
					
	// Отрезаем лидирующие нуля для всего, кроме табака и всего, что под фичей и является водой или антисептиком
	// Проблема в том, что ЧЗ, по воде и антисептикам допускает формирование КИТУ как с лидирующими нулями, так и без.
	// Из-за этого коды маркировки не проходят в системе ЧЗ.
	// 1С, при этом, нули отрезает всегда.
	// Ждем позиции ЧЗ, по формированию единого формата КИТУ. 
	КИТУБезЛидирующихНулей = НЕ ОсобенностьУчета = "Табак"
								И НЕ ОсобенностьУчета = "АльтернативныйТабак"
								И НЕ ОсобенностьУчета = "НикотиносодержащаяПродукция"
								И НЕ (РасширеннаяРаботаСМаркировкой
										И (ОсобенностьУчета = "УпакованнаяВода"
										ИЛИ ОсобенностьУчета = "Антисептики"
										ИЛИ ОсобенностьУчета = "БАДы"
										ИЛИ ОсобенностьУчета = "КреслаКоляски"));   
	
	Если ТипУпаковки = "МаркированныйТовар" Тогда
		ВидШтрихкода = "КИЗ";
		Если ОсобенностьУчета = "Обувь" Тогда
			Если Сред(ЗначениеШтрихкода, 32, 4)="(91)" Тогда
				ЗначениеШтрихкода = Лев(ЗначениеШтрихкода, 31);
			ИначеЕсли Сред(ЗначениеШтрихкода, 39, 4)="(91)" Тогда   // экспериментальный код
				ЗначениеШтрихкода = Лев(ЗначениеШтрихкода, 38);
			КонецЕсли;    // если нет разделителя (91), то считаем, что код лежит в готовом виде и ничего не обрезаем
		ИначеЕсли	ОсобенностьУчета = "Шины"			Или ОсобенностьУчета = "Духи"			Или ОсобенностьУчета = "ЛегкаяПромышленность" 
			Или ОсобенностьУчета = "Велосипеды"			Или ОсобенностьУчета = "КреслаКоляски"	Или ОсобенностьУчета = "УпакованнаяВода" 
			Или ОсобенностьУчета = "Антисептики"		Или ОсобенностьУчета = "БАДы"			Или ОсобенностьУчета = "Пиво" Тогда
			ЗначениеШтрихкода = Лев(ЗначениеШтрихкода, 31);
		ИначеЕсли ОсобенностьУчета = "Фотоаппараты" Тогда
			ЗначениеШтрихкода = Лев(ЗначениеШтрихкода, 38);
		КонецЕсли;
		
	ИначеЕсли КодНомУпак Тогда // объемно-сортовой учет
		
		ВидШтрихкода = "НомУпак"; 
		
	ИначеЕсли КодВФорматеОСУ
		И НовыйФорматУПД Тогда
		
		ВидШтрихкода = "КолВедМарк"; 
		ЗначениеШтрихкода = Сред(ЗначениеШтрихкода, 19, 26);
		
	Иначе
		
		ВидШтрихкода = "ИдентТрансУпак"; 
		
		Если КИТУБезЛидирующихНулей Тогда 
			
			Если СтрДлина(ЗначениеШтрихкода) = 20 И Лев(ЗначениеШтрихкода, 2) = "00" Тогда 
				
				ЗначениеШтрихкода = Сред(ЗначениеШтрихкода, 3); 
				
			КонецЕсли;   
			
		КонецЕсли; 
		
		// Очистим значение от скобок в разделителях	
		ШтрихкодБезСкобок = ШтрихкодБезСкобок(ЗначениеШтрихкода, Новый Массив);  
		
		Если ШтрихкодБезСкобок.Количество() Тогда   
			
			ЗначениеШтрихкода = СбисСтрСоединить(ШтрихкодБезСкобок, ""); 
			
		КонецЕсли;

	КонецЕсли; 
	
	ДанныеШтрихкода_Установить(ДанныеШтрихкода, "Вид", ВидШтрихкода);  
	ДанныеШтрихкода_Установить(ДанныеШтрихкода, "ЗначениеШтрихкода", ЗначениеШтрихкода);
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеШтрихкода_Получить(ДанныеШтрихкода, КлючПолучить, ДопПараметры = Неопределено) 
	
	Перем ЗначениеИтог;
	
	Если КлючПолучить = "ГрупповаяУпаковка" Тогда
		
		ЗначениеИтог = ДанныеШтрихкода_ПолучитьГрупповаяУпаковка(ДанныеШтрихкода, ДопПараметры);
		
	ИначеЕсли КлючПолучить = "КодОСУ" Тогда
		
		ЗначениеИтог = ДанныеШтрихкода_ПолучитьКодОСУ(ДанныеШтрихкода); 
		
	ИначеЕсли КлючПолучить = "ТабакНомУпак" Тогда 
		
		ЗначениеИтог = ДанныеШтрихкода_ПолучитьТабакНомУпак(ДанныеШтрихкода);  
		
	ИначеЕсли КлючПолучить = "БАДыНомУпак" Тогда 
		
		ЗначениеИтог = ДанныеШтрихкода_ПолучитьБАДыНомУпак(ДанныеШтрихкода);
	
	Иначе
	
		ДанныеШтрихкода.Свойство(КлючПолучить, ЗначениеИтог);   
		
	КонецЕсли;
	
	Возврат ЗначениеИтог;
	
КонецФункции  

&НаКлиенте
Функция ДанныеШтрихкода_ПолучитьГрупповаяУпаковка(ДанныеШтрихкода, ДопПараметры = Неопределено) 
	
	НовыйФорматУПД 		= ДопПараметры.НовыйФорматУПД;
	
	ЗначениеШтрихкода	= ДанныеШтрихкода_Получить(ДанныеШтрихкода, "ЗначениеШтрихкода");  
	ОсобенностьУчета	= ДанныеШтрихкода_Получить(ДанныеШтрихкода, "ОсобенностьУчета"); 
	ТипУпаковки			= ДанныеШтрихкода_Получить(ДанныеШтрихкода, "ТипУпаковки"); 
	
	// Определяем соответствует ли код маркировки передаче товара в объемно-сортовом разрезе учета  	
	КодВФорматеОСУ = ДанныеШтрихкода_Получить(ДанныеШтрихкода, "КодОСУ"); 
							
	// Определяем блоки, потребительские наборы, прочие групповые упаковки (КИГУ) по никотиносодержащей продукции						
	ТабачнаяПродукцияНомУпак = ДанныеШтрихкода_Получить(ДанныеШтрихкода, "ТабакНомУпак");	
							
	// Определяем групповые упаковки (КИГУ) по упакованной воде						
	УпакованнаяВодаНомУпак = ОсобенностьУчета = "УпакованнаяВода"
								И	Лев(ЗначениеШтрихкода,2) = "01"
								И	Сред(ЗначениеШтрихкода, 17, 2) = "21";  
								
	// Определяем групповые упаковки (КИГУ) по пиву						
	УпакованноеПивоНомУпак = ОсобенностьУчета = "Пиво"
								И	Лев(ЗначениеШтрихкода,2) = "01"
								И	Сред(ЗначениеШтрихкода, 17, 2) = "21"; 
								
	// Определяем наборы (КИГУ) по легкой промышленности						
	НаборНомУпак = ОсобенностьУчета = "ЛегкаяПромышленность"
								И	Лев(ЗначениеШтрихкода,2) = "01"
								И	Сред(ЗначениеШтрихкода, 17, 2) = "21"
								И	(ТипУпаковки = "МультитоварнаяУпаковка"
									Или ТипУпаковки = "МонотоварнаяУпаковка"); 
								
	// Определяем наборы (КИГУ) БАДам
	БАДыНомУпак = ДанныеШтрихкода_Получить(ДанныеШтрихкода, "БАДыНомУпак");
								
	// Определяем, что код КИГУ необходимо положить в узел НомУпак 							
	КодНомУпак = (ТипУпаковки = "МонотоварнаяУпаковка"
					И (ТабачнаяПродукцияНомУпак
					Или УпакованнаяВодаНомУпак
					Или УпакованноеПивоНомУпак)) 					
					Или (КодВФорматеОСУ
					И НЕ НовыйФорматУПД)
					Или НаборНомУпак
					Или БАДыНомУпак; 
					
	Возврат КодНомУпак;
	
КонецФункции  

&НаКлиенте
Функция ДанныеШтрихкода_ПолучитьБАДыНомУпак(ДанныеШтрихкода, ДопПараметры = Неопределено) 
	
	ОсобенностьУчета	= ДанныеШтрихкода_Получить(ДанныеШтрихкода, "ОсобенностьУчета");
	ЗначениеШтрихкода	= ДанныеШтрихкода_Получить(ДанныеШтрихкода, "ЗначениеШтрихкода");
	
	БАДыНомУпак = ОсобенностьУчета = "БАДы"
					И	Лев(ЗначениеШтрихкода,2) = "01"
					И	Сред(ЗначениеШтрихкода, 17, 2) = "21";  
 				
	Возврат БАДыНомУпак;						
							
КонецФункции

&НаКлиенте
Функция ДанныеШтрихкода_ПолучитьКодОСУ(ДанныеШтрихкода, ДопПараметры = Неопределено) 
	
	ОсобенностьУчета	= ДанныеШтрихкода_Получить(ДанныеШтрихкода, "ОсобенностьУчета");
	ЗначениеШтрихкода	= ДанныеШтрихкода_Получить(ДанныеШтрихкода, "ЗначениеШтрихкода");
	
	ЭтоКодОСУ = СбисЭтоКодОСУ(ЗначениеШтрихкода)
						И (ОсобенностьУчета = "УпакованнаяВода"
							Или ОсобенностьУчета = "Молоко"
							Или ОсобенностьУчета = "БАДы"
							Или ОсобенностьУчета = "Антисептики"
							Или ОсобенностьУчета = "СоковаяПродукция"
							Или ОсобенностьУчета = "ТабачноеСырье"
							Или ОсобенностьУчета = "БытоваяХимия"
							Или ОсобенностьУчета = "КормаДляЖивотных"
							Или ОсобенностьУчета = "КонсервированнаяПродукция"
							Или ОсобенностьУчета = "Морепродукты"
							Или ОсобенностьУчета = "РастительныеМасла");  
							
	Возврат ЭтоКодОСУ;						
							
КонецФункции     
							
&НаКлиенте
Функция ДанныеШтрихкода_ПолучитьТабакНомУпак(ДанныеШтрихкода, ДопПараметры = Неопределено) 
	
	ОсобенностьУчета	= ДанныеШтрихкода_Получить(ДанныеШтрихкода, "ОсобенностьУчета");
	ЗначениеШтрихкода	= ДанныеШтрихкода_Получить(ДанныеШтрихкода, "ЗначениеШтрихкода");
	
	ТабакНомУпак = (ОсобенностьУчета = "Табак" 
						Или ОсобенностьУчета = "АльтернативныйТабак" 
						Или ОсобенностьУчета = "НикотиносодержащаяПродукция")
						И	Лев(ЗначениеШтрихкода,2) = "01"
						И	Сред(ЗначениеШтрихкода, 17, 2) = "21" 
						И	(	Сред(ЗначениеШтрихкода, 26, 4) = "8005" 
						// встретился у клиента непонятный штрихкод 01146033990011272001212005/05/22/2/3/0001, который не подходит ни под одно описание, 
						// но должен выгружаться в ИдентТрансУпак (как во входящем ЭД)
						Или СтрДлина(СокрЛП(ЗначениеШтрихкода)) = 25);  
 				
	Возврат ТабакНомУпак;						
							
КонецФункции

