
//Функция заполняет пользовательские параметры в Кэш.ПараметрыФильтра для дальнейшей проверки настроек.
&НаКлиенте
Функция		СбисЗаполнитьДополнительныеПараметрыФильтра(Кэш, ДополнительныеПараметры, Отказ)Экспорт
	Перем СтруктураИни;
	Если Не ДополнительныеПараметры.Свойство("Ини", СтруктураИни) Тогда
		СтруктураИни = Кэш.Ини;
	КонецЕсли;
	Кэш.ПараметрыФильтра.Очистить();
	Если	ДополнительныеПараметры.Свойство("СформироватьРазделыПоДанным")
		И	ДополнительныеПараметры.СформироватьРазделыПоДанным Тогда
		СбисСтруктураРазделов = СбисСформироватьСтруктуруРазделов(Кэш, СтруктураИни, ДополнительныеПараметры);
	Иначе
		СбисСтруктураРазделов = Кэш.ФормаНастроек.ПолучитьСтруктуруРазделов(Кэш,,Отказ);
	КонецЕсли;
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.СбисИсключение(сбисСтруктураРазделов, "ФайлыНастроекОбщее.сбисЗаполнитьДополнительныеПараметрыФильтра");
	КонецЕсли;
	
	ДопПараметрыФильтра = Новый Структура("РасставитьЭлементы, ДобавитьНадписи, ОбновитьЭлементы", Ложь, Ложь, Ложь);
	Для Каждого Раздел Из СбисСтруктураРазделов Цикл
		
		Если Раздел.Ключ = "БезРаздела" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Для Каждого ПодРаздел Из Раздел.Значение.Список Цикл
			
			Если	Не	ПодРаздел.Значение.Свойство("ЕстьЗапросРеестра")
				Или	Не	ПодРаздел.Значение.ЕстьЗапросРеестра Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ФормаДопФильтра = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("сбисСписокДопПараметровФильтра", 
																	"Фильтр_Раздел_" + Раздел.Ключ + "_" + ПодРаздел.Ключ, 
																	"Фильтр_Раздел_" + Раздел.Ключ + "_Шаблон");
			Если ФормаДопФильтра = Ложь Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ДобавитьДополнительныеПараметрыФильтра(Кэш, ФормаДопФильтра, ДопПараметрыФильтра);
			
		КонецЦикла;
	КонецЦикла;
	Возврат Кэш.ПараметрыФильтра;
	
КонецФункции

// Добавляет на форму главного окна все элементы пользовательских фильтров	
&НаКлиенте
Процедура	ДобавитьДополнительныеПараметрыФильтра(Кэш, ФормаДопФильтра, ДопПараметры = Неопределено) Экспорт
	
	Если Не ТипЗнч(Кэш.ГлавноеОкно) = ТипЗнч(ФормаДопФильтра) Тогда
		
		Возврат;
		
	//Управляемое приложение
	ИначеЕсли Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		Кэш.ГлавноеОкно.ОчиститьДополнительныеПараметрыФильтра(ФормаДопФильтра);
	//Обычное приложение	
	Иначе
		#Если Не ВебКлиент Тогда
			
			ДобавитьДополнительныеЭлементыФормыФильтра(Кэш, ФормаДопФильтра, ДопПараметры);
			
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

#Если Не ВебКлиент Тогда

&НаКлиенте
Функция ДобавитьДополнительныеЭлементыФормыФильтра(Кэш, ФормаДопФильтра, ДопПараметры = Неопределено) Экспорт

	ПараметрыДобавленияЭлементов = Новый Структура("РасставитьЭлементы, ДобавитьНадписи, ОбновитьЭлементы", Истина, Истина, Истина);
	Если Не ДопПараметры = Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(ПараметрыДобавленияЭлементов, ДопПараметры);
		
	КонецЕсли;
				
	СбисСписокЭлементовФильтра = ТаблицаДополнительныхЭлементов_ПолучитьТаблицуЭлементов(Кэш, ФормаДопФильтра, ПараметрыДобавленияЭлементов);
	ДобавитьДополнительныеПараметрыФильтра_ОбычныеФормы(Кэш, ФормаДопФильтра, СбисСписокЭлементовФильтра, ПараметрыДобавленияЭлементов);
	
	Возврат СбисСписокЭлементовФильтра.Скопировать(СбисСписокЭлементовФильтра.НайтиСтроки(Новый Структура("ЕстьПользовательскийЭлемент",	Истина)))
	
КонецФункции

//Для УФ сюда не попадаем. 
&НаКлиенте
Процедура	ДобавитьДополнительныеПараметрыФильтра_ОбычныеФормы(Кэш, ФормаДопФильтра, СбисСписокЭлементовФильтра, ДопПараметры)
	
	//Сперва заполним в Кэш.ПараметрыФильтра значения фильтра
	СписокДопФильтров = СбисСписокЭлементовФильтра.Скопировать(СбисСписокЭлементовФильтра.НайтиСтроки(Новый Структура("ЭтоДопФильтр",		Истина)));
	Для Каждого СтрокаТаблицы Из СписокДопФильтров Цикл
		
		Элемент = СтрокаТаблицы.ПользовательскийЭлемент;
		Кэш.ПараметрыФильтра.Вставить(Элемент.Имя, Элемент.Значение);
		
	КонецЦикла;
	
	// Требуется расставить элементы на форме на случай, если один элемент попадает в разные разделы
	СписокДопЭлементов	= СбисСписокЭлементовФильтра.Скопировать(СбисСписокЭлементовФильтра.НайтиСтроки(Новый Структура("ЕстьПользовательскийЭлемент",	Истина)));
	ГлавноеОкно			= Кэш.ГлавноеОкно;
	
	//Отслеживаем появление бегунка на панели фильтра. На случай, если понадобится привести к одной границе остальные пользовательские фильтры	
	КонтрольныйЭлемент	= ГлавноеОкно.ЭлементыФормы.ФильтрПериод;
	КонтрольнаяШирина	= 219;//Прописана ширина элемента из конфигуратора. Если в какой-то момент она не равна значению элемента, то меняем ширину 
	ШиринаМенялась		= Ложь;
	
	СписокДопЭлементов.Сортировать("Верх");
	КэшДобавлений = Новый СписокЗначений;
	
	Если ДопПараметры.ОбновитьЭлементы Тогда
		
		КрайнийЭлемент = СписокДопЭлементов[СписокДопЭлементов.Количество()-1];
		
		НижняяГраница = КрайнийЭлемент.Верх + КрайнийЭлемент.Высота + 7;
		Если ГлавноеОкно.ЭлементыФормы.ПанельУстановкиФильтра.Высота < НижняяГраница Тогда
			ГлавноеОкно.ЭлементыФормы.ПанельУстановкиФильтра.Высота = НижняяГраница;
		КонецЕсли;
	
		Для Каждого СтрокаТаблицыОтбор Из СписокДопЭлементов Цикл
			
			СтрокаТаблицы = СбисСписокЭлементовФильтра.Найти(СтрокаТаблицыОтбор.КлючСтроки, "КлючСтроки");
			ДопЭлемент = СтрокаТаблицы.ДопЭлемент;
			Попытка
				
				Элемент = СтрокаТаблицы.ПользовательскийЭлемент;
				
				Если СтрокаТаблицы.ТиповойЭлемент = Неопределено Тогда
					
					СтрокаТаблицы.ТиповойЭлемент = ГлавноеОкно.ЭлементыФормы.Добавить(ТипЗнч(Элемент), Элемент.Имя, Истина, ГлавноеОкно.ЭлементыФормы.ПанельУстановкиФильтра);
					
				КонецЕсли;
				
				СтрокаТаблицы.ТиповойЭлемент.Видимость	= Истина;
				СтрокаТаблицы.ЕстьТиповойЭлемент		= Истина;
				
				Если СтрокаТаблицы.ЭтоДопФильтр Тогда
					
					СтрокаТаблицы.ТиповойЭлемент.ТипЗначения = Элемент.ТипЗначения;
					СтрокаТаблицы.ТиповойЭлемент.ЦветТекстаКнопки = Элемент.ЦветТекстаКнопки;
					СтрокаТаблицы.ТиповойЭлемент.ЦветФонаКнопки = Элемент.ЦветФонаКнопки;
					СтрокаТаблицы.ТиповойЭлемент.ЦветРамки = Элемент.ЦветРамки;
					
					Если ТипЗнч(Элемент) <> Тип("Флажок") Тогда
						
						СтрокаТаблицы.ТиповойЭлемент.КнопкаВыбора = Элемент.КнопкаВыбора;
						
					КонецЕсли;
					
				КонецЕсли;

				Если		ТипЗнч(Элемент) = Тип("Флажок") Тогда
					
					СтрокаТаблицы.ТиповойЭлемент.Заголовок = Элемент.Заголовок;
					
				ИначеЕсли	ТипЗнч(Элемент) = Тип("ПолеВыбора") Тогда
					
					СтрокаТаблицы.ТиповойЭлемент.СписокВыбора = Элемент.СписокВыбора;
					
				КонецЕсли;
							
				Если Не ДопПараметры.РасставитьЭлементы Тогда
					
					// Элементы расставлять не нужно, разместим "как есть".
					Продолжить;
					
				КонецЕсли;
								
				СтрокаТаблицы.ТиповойЭлемент.Значение = Элемент.Значение;
				СтрокаТаблицы.ТиповойЭлемент.Высота = СтрокаТаблицы.Высота;
				СтрокаТаблицы.ТиповойЭлемент.Ширина = Элемент.Ширина;
				СтрокаТаблицы.ТиповойЭлемент.Лево = Элемент.Лево;
				СтрокаТаблицы.ТиповойЭлемент.Верх = СтрокаТаблицы.Верх;
				СтрокаТаблицы.ТиповойЭлемент.ЦветТекста = Элемент.ЦветТекста;
				СтрокаТаблицы.ТиповойЭлемент.Шрифт = Элемент.Шрифт;
				Если СтрокаТаблицы.ЭтоДопФильтр Тогда
					
					СтрокаТаблицы.ТиповойЭлемент.УстановитьПривязку(ГраницаЭлементаУправления.Право, ГлавноеОкно.ЭлементыФормы.ПанельУстановкиФильтра,ГраницаЭлементаУправления.Право);
					
				КонецЕсли;
				
				Если 	Не ШиринаМенялась
					И	Не КонтрольнаяШирина = КонтрольныйЭлемент.Ширина Тогда
					
					ШиринаМенялась = Истина;
					СНомераЭлементаСжать = СписокДопЭлементов.Индекс(СтрокаТаблицыОтбор);
					
				КонецЕсли;
				
				Если СтрокаТаблицы.Добавляемый Тогда
					
					КэшДобавлений.Добавить(Элемент.Имя);
					
				КонецЕсли;
				
			Исключение
				
				Сообщить(ОписаниеОшибки());
				
			КонецПопытки;
			
		КонецЦикла;
	
	КонецЕсли;
	
	Если ШиринаМенялась	Тогда//Добавленные программно элементы, надо сжать, если на форме появлися бегунок до их добавления на панель. Остальные ужимаются через привязку.
		Для шаг = СНомераЭлементаСжать По СписокДопЭлементов.Количество()-1 Цикл
			СтрокаТаблицы = СписокДопЭлементов[шаг];
			Если Не СтрокаТаблицы.КонтрольШирины Тогда
				Продолжить;
			КонецЕсли;
			Элемент = ГлавноеОкно.ЭлементыФормы[СтрокаТаблицы.ДопЭлемент.Значение];
			Элемент.Ширина = Элемент.Ширина - (КонтрольнаяШирина - КонтрольныйЭлемент.Ширина);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

//Формирует таблицу добавочных элементов для обычных форм.
&НаСервере
Функция		ТаблицаДополнительныхЭлементов_ПолучитьТаблицуЭлементов(Кэш, ФормаДопФильтра, ДопПараметры)
	//Обычное приложение
	СписокДопЭлементов = ФормаДопФильтра.сбисСписокДопПараметровФильтра();
	Если СписокДопЭлементов.Количество() = 0 Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	ГлавноеОкно			= Кэш.ГлавноеОкно;
	ПараметрыЗаполнения = ТаблицаДополнительныхЭлементов_ПолучитьПараметрыЗаполнения(Кэш);
	ПараметрыЗаполнения.Вставить("ФормаДопФильтра", ФормаДопФильтра);
	
	Для Каждого ДопЭлемент Из СписокДопЭлементов Цикл
		
		ПараметрыЗаполнения.Вставить("ДопЭлемент", ДопЭлемент);
		ДанныеЭлемента = ТаблицаДополнительныхЭлементов_ПолучитьЭлементДляДобавления(Кэш, ПараметрыЗаполнения);
		
		//Сперва определим поля ввода фильтров. Так, как порядок передачи может идти вразнобой, а надписи надо равнять с полями
		Если		ДанныеЭлемента.ПользовательскийЭлемент = Неопределено
			Или	Не (МодульОбъектаСервер().ЭлементМеняетДанные(ДанныеЭлемента.ПользовательскийЭлемент)) Тогда

			// Для ОФ Модуль сервер и клиент - одно и тоже
			Продолжить;
			
		КонецЕсли;
		
		ДанныеЭлемента.Вставить("ЭтоДопФильтр",	Истина);	
		//Это поле, управляющее данными на форме, а значит к ней должен быть подвязан фильтр.
		ТаблицаДополнительныхЭлементов_ДобавитьЭлемент(Кэш, ДанныеЭлемента, ПараметрыЗаполнения);
		//Если	ДанныеЭлемента.ЭтоДопЭлемент
		//	И	ПараметрыЗаполнения.КрайнийЭлемент.Верх < ДанныеЭлемента.ПользовательскийЭлемент.Верх Тогда
		//	
		//	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения.КрайнийЭлемент, ДанныеЭлемента.ПользовательскийЭлемент);
		//	
		//КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыЗаполнения.Вставить("ДопФильтры", ПараметрыЗаполнения.Таблица.НайтиСтроки(Новый Структура("ЭтоДопФильтр", Истина)));
	
	Если ДопПараметры.ДобавитьНадписи Тогда
		
		Для Каждого ДопЭлемент Из СписокДопЭлементов Цикл
			ПараметрыЗаполнения.Вставить("ДопЭлемент", ДопЭлемент);
			ДанныеЭлемента = ТаблицаДополнительныхЭлементов_ПолучитьЭлементДляДобавления(Кэш, ПараметрыЗаполнения);
			//Надписи добавляем в последнюю очередь, когда все прочие элементы уже добавлены.
			Если	ДанныеЭлемента.ПользовательскийЭлемент = Неопределено
				Или	МодульОбъектаСервер().ЭлементМеняетДанные(ДанныеЭлемента.ПользовательскийЭлемент) Тогда
				// Для ОФ Модуль сервер и клиент - одно и тоже
				Продолжить;
			КонецЕсли;
			ДанныеЭлемента.Вставить("ЭтоДопФильтр",					Ложь);		// Это поле, не управляющее данными на форме, а значит надпись.
			ДанныеЭлемента.Вставить("ЭтоПользовательскийЭлемент",	Истина);	// Т.к. указано в списке пользовательских полей, то автоматом ставим свойство
			ТаблицаДополнительныхЭлементов_ДобавитьЭлемент(Кэш, ДанныеЭлемента, ПараметрыЗаполнения);
		КонецЦикла;
		
	КонецЕсли;
	ПараметрыЗаполнения.Таблица.Колонки.Удалить("Верх_было");
	
	Возврат ПараметрыЗаполнения.Таблица;
	
КонецФункции

//Определяет параметры заполнения для поиска и добавления новых элементов.
&НаСервере
Функция		ТаблицаДополнительныхЭлементов_ПолучитьПараметрыЗаполнения(Кэш)
	
	ПараметрыЗаполнения = Новый Структура("Таблица,СчетчикДобавочных,КрайнийЭлемент,Смещение");
	
	ГлавноеОкно = Кэш.ГлавноеОкно;
	ТаблицаСоответствияЭлементов = Новый ТаблицаЗначений;
	ТаблицаСоответствияЭлементов.Колонки.Добавить("КлючСтроки", Новый ОписаниеТипов("Строка"));		//УИД строки
	ТаблицаСоответствияЭлементов.Колонки.Добавить("Верх");
	ТаблицаСоответствияЭлементов.Колонки.Добавить("Высота");
	ТаблицаСоответствияЭлементов.Колонки.Добавить("Лево");			
	ТаблицаСоответствияЭлементов.Колонки.Добавить("Имя");          									//Это данные элементов для поиска и позиционирования
	ТаблицаСоответствияЭлементов.Колонки.Добавить("Верх_было");										//Это старые координаты по высоте элемента, до его установки на новое место
	ТаблицаСоответствияЭлементов.Колонки.Добавить("ЭтоДопФильтр");									//Флаг, определяет то, что поле является элементом управления и ввода данных.
	ТаблицаСоответствияЭлементов.Колонки.Добавить("ЕстьТиповойЭлемент");							//Флаг, определяет наличие элемента на ГО/Форме установки фильтра для поиска
	ТаблицаСоответствияЭлементов.Колонки.Добавить("ЕстьПользовательскийЭлемент");					//Флаг, определяет наличие пользовательского элемента на форме ВФК.
	ТаблицаСоответствияЭлементов.Колонки.Добавить("ДопЭлемент");									//Элемент соответствия списку, возвращаемому из формы фильтра функцией сбисСписокДопПараметровФильтра
	ТаблицаСоответствияЭлементов.Колонки.Добавить("Добавляемый");									//Определяет число добавленных элементов по высоте для изменения размера панели фильтра
	ТаблицаСоответствияЭлементов.Колонки.Добавить("ПользовательскийЭлемент");						//Значение элемента формы доп. фильтра.
	ТаблицаСоответствияЭлементов.Колонки.Добавить("ТиповойЭлемент");								//Значение элемента формы либо главного окна, либо формы установки фильтра (НЕ ВФК)
	ТаблицаСоответствияЭлементов.Колонки.Добавить("КонтрольШирины");								//Флаг управляет необходимостью сжать элементы при добавлении наформу, чтобы привести правую границу к одному виду при добавлении бегунка на панель
	//Сперва получим список стандартных фильтров.Так, как 1С не умеет получать элементы панели, то бежим все в цикле	
	СписокЭлементовФильтра	= Неопределено;
	Если Не Кэш.КэшНастроек.Свойство("СписокЭлементовФильтра",СписокЭлементовФильтра) Тогда // Кэшируем список, чтобы каждый раз не бегать по всем элементам
		СписокЭлементовФильтра = Новый СписокЗначений;
		Для Каждого ЭлементГлавноеОкно	Из ГлавноеОкно.ЭлементыФормы	Цикл
			
			Если Не	(	Лев(ЭлементГлавноеОкно.Имя, 6) = "Фильтр"
				И	(	ТипЗнч(ЭлементГлавноеОкно) = Тип("ПолеВвода")
				Или	ТипЗнч(ЭлементГлавноеОкно) = Тип("ПолеВыбора")
				Или ТипЗнч(ЭлементГлавноеОкно) = Тип("Флажок")))Тогда
				Продолжить;
			КонецЕсли;
			
			СписокЭлементовФильтра.Добавить(ЭлементГлавноеОкно.Имя);
			
		КонецЦикла;
		Кэш.КэшНастроек.Вставить("СписокЭлементовФильтра",СписокЭлементовФильтра);
	КонецЕсли;	
	Для Каждого	ИмяОсновногоФильтра Из СписокЭлементовФильтра Цикл
		
		НовоеСоответствие = ТаблицаСоответствияЭлементов.Добавить();
		НовоеСоответствие.КлючСтроки = Новый УникальныйИдентификатор;
		ЗаполнитьЗначенияСвойств(НовоеСоответствие, ГлавноеОкно.ЭлементыФормы[ИмяОсновногоФильтра.Значение]);
		НовоеСоответствие.ТиповойЭлемент = ГлавноеОкно.ЭлементыФормы[ИмяОсновногоФильтра.Значение];
		
	КонецЦикла;
	
	ТаблицаСоответствияЭлементов.ЗаполнитьЗначения(Ложь,	"ЭтоДопФильтр, ЕстьПользовательскийЭлемент");
	ТаблицаСоответствияЭлементов.ЗаполнитьЗначения(Истина,	"ЕстьТиповойЭлемент");
	ТаблицаСоответствияЭлементов.Сортировать("Верх Убыв");
	
	ПараметрыЗаполнения.СчетчикДобавочных	= 0;
	ПараметрыЗаполнения.Смещение			= 0;
	ПараметрыЗаполнения.Таблица				= ТаблицаСоответствияЭлементов;
	ПараметрыЗаполнения.КрайнийЭлемент		= Новый Структура("Верх,Высота");//Крайний элемент стандартной панели фильтров для рассчета добавления новых элементов на панель в конце
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения.КрайнийЭлемент, ТаблицаСоответствияЭлементов[0].ТиповойЭлемент);
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

//Ищем элемент доп.фильтра. Сперва на главном окне, если уже добавлен, а затем на форме доп фильтра для добавления.
&НаСервере
Функция		ТаблицаДополнительныхЭлементов_ПолучитьЭлементДляДобавления(Кэш, ПараметрыЗаполнения)
	
	Результат				= Новый Структура("ЕстьТиповойЭлемент, ЕстьПользовательскийЭлемент, ТиповойЭлемент, ПользовательскийЭлемент", Ложь, Истина);
	ИмяЭлемента				= ПараметрыЗаполнения.ДопЭлемент.Значение;
	ПользовательскийЭлемент	= ПараметрыЗаполнения.ФормаДопФильтра.ЭлементыФормы.Найти(ИмяЭлемента);
	ТиповойЭлемент			= Кэш.ГлавноеОкно.ЭлементыФормы.Найти(ИмяЭлемента);
	
	Если ТиповойЭлемент = Неопределено Тогда
		
		ПараметрыЗаполнения.Смещение = 24;
		Если ПользовательскийЭлемент = Неопределено Тогда
			
			//Получаем элемент на форме доп. фильтра.
			Сообщить("Отсутствует элемент " + ИмяЭлемента + " на форме пользовательского фильтра.");
			Возврат Результат;
			
		КонецЕсли;
		
	Иначе
		
		ПараметрыЗаполнения.Смещение	= 0;
		Результат.ЕстьТиповойЭлемент	= Истина;	// Т.к. указано в списке пользовательских полей, то автоматом ставим свойство
		
	КонецЕсли; 
	
	Результат.ТиповойЭлемент			= ТиповойЭлемент;
	Результат.ПользовательскийЭлемент	= ПользовательскийЭлемент;
	
	Возврат Результат;
	
КонецФункции

//Добавляем элемент в таблицу заполнения формы.
&НаСервере
Процедура	ТаблицаДополнительныхЭлементов_ДобавитьЭлемент(Кэш, ДанныеЭлемента, ПараметрыЗаполнения)
	
	Элемент		= ДанныеЭлемента.ПользовательскийЭлемент;
	ИмяЭлемента	= ПараметрыЗаполнения.ДопЭлемент.Значение;	
	
	СоответствиеКоординат = ПараметрыЗаполнения.Таблица.Найти(ИмяЭлемента, "Имя");
	Если Не СоответствиеКоординат = Неопределено Тогда
		
		Возврат;//Такой элемент уже есть в таблице
		
	КонецЕсли;
	
	Если ДанныеЭлемента.ЭтоДопФильтр Тогда
		
		Если Элемент.Верх <= ПараметрыЗаполнения.КрайнийЭлемент.Верх Тогда//Накладывается поверх стандартного
			//Найдем фильтры, накладываемые поверх стандартных и определим параметры наложения
			Добавляемый				= Ложь;
			СоответствиеКоординат	= ПараметрыЗаполнения.Таблица.Найти(Элемент.Верх, "Верх_было");
			
			Если ПараметрыЗаполнения.Смещение > 0 Тогда//Поиск по координатам со смещением, образовавшимся после добавления элемента.
				
				Если СоответствиеКоординат = Неопределено Тогда
					СоответствиеКоординат = ПараметрыЗаполнения.Таблица.Найти(Элемент.Верх + ПараметрыЗаполнения.Смещение, "Верх_было");
				КонецЕсли;
				
				Если СоответствиеКоординат = Неопределено Тогда //Если не удалось найти по Верх_Было, попытаемся найти типовой элемент для наложения поверх
					
					СтрокиОтбора = ПараметрыЗаполнения.Таблица.НайтиСтроки(Новый Структура("Верх, Добавляемый",
															Элемент.Верх + ПараметрыЗаполнения.Смещение, Ложь));
				
					Если СтрокиОтбора.Количество() Тогда
						СоответствиеКоординат = СтрокиОтбора[0];
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			Если СоответствиеКоординат = Неопределено Тогда//По какой-то причине не удалось определить координаты, для наложения поверх. Добавим в конец панели.
				СоответствиеКоординат = ПараметрыЗаполнения.Таблица.Добавить();
				СоответствиеКоординат.КлючСтроки = Новый УникальныйИдентификатор;
				СоответствиеКоординат.Верх = ПараметрыЗаполнения.КрайнийЭлемент.Верх + ПараметрыЗаполнения.КрайнийЭлемент.Высота + 7;
				ПараметрыЗаполнения.КрайнийЭлемент.Верх = СоответствиеКоординат.Верх;
				ПараметрыЗаполнения.КрайнийЭлемент.Высота = Элемент.Высота;
				Добавляемый = Истина;
			ИначеЕсли Не СоответствиеКоординат.Лево = Элемент.Лево Тогда//На случай, если на одном уровне находятся несколько элементов управления.
				НовоеСоответствиеКоординат = ПараметрыЗаполнения.Таблица.Добавить();
				ЗаполнитьЗначенияСвойств(НовоеСоответствиеКоординат, СоответствиеКоординат);
				НовоеСоответствиеКоординат.КлючСтроки = Новый УникальныйИдентификатор;
				СоответствиеКоординат = НовоеСоответствиеКоординат;
			КонецЕсли;	
			ЗаполнитьЗначенияСвойств(СоответствиеКоординат, Элемент,,"Верх");
			СоответствиеКоординат.ДопЭлемент	= ПараметрыЗаполнения.ДопЭлемент;
			СоответствиеКоординат.Верх_было		= Элемент.Верх;
			СоответствиеКоординат.Добавляемый	= Добавляемый;
			СоответствиеКоординат.ПользовательскийЭлемент	= Элемент;
			
		Иначе
			
			//Если не стандартный, то просто добавим в конец панели
			СоответствиеКоординат = ПараметрыЗаполнения.Таблица.Добавить();
			СоответствиеКоординат.КлючСтроки = Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(СоответствиеКоординат, Элемент);
			СоответствиеКоординат.Верх						= ПараметрыЗаполнения.КрайнийЭлемент.Верх + ПараметрыЗаполнения.КрайнийЭлемент.Высота + 7;
			СоответствиеКоординат.Верх_было 				= Элемент.Верх;
			СоответствиеКоординат.Добавляемый				= Истина;
			СоответствиеКоординат.ДопЭлемент				= ПараметрыЗаполнения.ДопЭлемент;
			СоответствиеКоординат.ПользовательскийЭлемент	= Элемент;
			
			ПараметрыЗаполнения.СчетчикДобавочных = ПараметрыЗаполнения.СчетчикДобавочных + 1;
			ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения.КрайнийЭлемент, СоответствиеКоординат);
			
		КонецЕсли;
		
	Иначе
		
		СоответствиеКоординат = ПараметрыЗаполнения.Таблица.Найти(Элемент.Имя, "Имя");
		Если	СоответствиеКоординат = Неопределено Тогда
			// Элемента нет в таблице
			
			ЭлементВИнтерфейсе = Кэш.ГлавноеОкно.ЭлементыФормы.Найти(Элемент.Имя);
			СоответствиеКоординат = ПараметрыЗаполнения.Таблица.Добавить();
			СоответствиеКоординат.КлючСтроки = Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(СоответствиеКоординат, Элемент);
			СоответствиеКоординат.ДопЭлемент				= ПараметрыЗаполнения.ДопЭлемент;
			СоответствиеКоординат.Добавляемый				= Ложь;
			СоответствиеКоординат.ПользовательскийЭлемент	= Элемент;
			
			Если Не ЭлементВИнтерфейсе = Неопределено Тогда
				
				// Он уже есть в интерфейсе
				СоответствиеКоординат.ТиповойЭлемент = ЭлементВИнтерфейсе;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Для Каждого ДопФильтр Из ПараметрыЗаполнения.ДопФильтры Цикл
			Если	ДопФильтр.Верх_Было + 5 > СоответствиеКоординат.Верх//Ищем соответствующий надписи доп. фильтр со смещением в +-5.
				И	ДопФильтр.Верх_Было - 5 < СоответствиеКоординат.Верх Тогда
				СоответствиеКоординат.Верх = СоответствиеКоординат.Верх + (ДопФильтр.Верх - ДопФильтр.Верх_было);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СоответствиеКоординат.ЭтоДопФильтр					= ДанныеЭлемента.ЭтоДопФильтр;
	СоответствиеКоординат.ЕстьТиповойЭлемент			= ДанныеЭлемента.ЕстьТиповойЭлемент;
	СоответствиеКоординат.ЕстьПользовательскийЭлемент	= ДанныеЭлемента.ЕстьПользовательскийЭлемент;
	СоответствиеКоординат.ТиповойЭлемент				= ДанныеЭлемента.ТиповойЭлемент;
	
	//Если правая граница элемента ближе, чем на 20 к границе панели, то смотрим необходимость ужать элемент
	Если Кэш.ГлавноеОкно.ЭлементыФормы.ПанельУстановкиФильтра.Ширина - (Элемент.Лево+Элемент.Ширина) < 20 Тогда
		
		СоответствиеКоординат.КонтрольШирины = Истина;
		
	Иначе
		
		СоответствиеКоординат.КонтрольШирины = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

