
&НаКлиенте
Процедура ИнтеграцияSABY_Прочитать(ИнтеграцияSABY, ДопПараметры = Неопределено) Экспорт
	
	Отказ					= Ложь;
	ИдентификаторНастроек	= МодульОбъектаКлиент().ИнтеграцияSaby_Получить(ИнтеграцияSABY, "Идентификатор");
	КлассПодключенияЗаписи	= НовыйIntegrationConnection(ЛокальныйКэш(), Новый Структура("Идентификатор", ИдентификаторНастроек), Отказ);
	Если Отказ Тогда
		
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(КлассПодключенияЗаписи);
		
	КонецЕсли;
	
	// Пока вместо чтения переопределить класс интеграции. Да, костыль и говнокод.
	ИнтеграцияSABY = КлассПодключенияЗаписи;
	
КонецПроцедуры

&НаКлиенте
Функция ИнтеграцияSABY_Записать(ИнтеграцияSABY, ДопПараметры, Отказ) Экспорт
	Перем КлючЗаписи;
	
	Если ДопПараметры = Неопределено Тогда
		
		КлючЗаписи = "Полный";
		
	ИначеЕсли ТипЗнч(ДопПараметры) = Тип("Строка") Тогда
		
		КлючЗаписи = ДопПараметры;
		
	Иначе
		
		ДопПараметры.Свойство("КлючЗаписи", КлючЗаписи);
		
		
	КонецЕсли;
	
	Если КлючЗаписи = "Параметры" Тогда
		КлассIntegrationConnection_СохранитьСбисПараметры(ЛокальныйКэш(), ИнтеграцияSABY, Новый Структура, Отказ);
		Если Отказ Тогда
			Возврат МодульОбъектаКлиент().НовыйСбисИсключение(, "ФайлыНастроекСервер.ЗаписатьОбщиеНастройкиПодключения", 616301);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

