
// Функция - Реализация чтения коннекшена при работе через каталог
//
// Параметры:
//  КоннекшенSABY	 - 	 - 
//  ДопПараметры	 - 	 - 
//  Отказ			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
//DynamicDirective
Процедура КоннекшенSaby_Прочитать(КоннекшенSaby, ДопПараметры = Неопределено) Экспорт
	
	Если Не МодульОбъектаКлиент().КоннекшенSaby_Получить(КоннекшенSaby, "ИнициированыДанные") = Истина Тогда
		
		яКоннекшенSaby_Инициировать(КоннекшенSaby);
		
	КонецЕсли;
	
	Если Не МодульОбъектаКлиент().КоннекшенSABY_Получить(КоннекшенSaby, "ЧтениеПоТребованию") Тогда
		
		ОшибкаДозапроса = Ложь;
		РезультатВызова = яКоннекшенSaby_ПрочитатьИни(КоннекшенSaby, ДопПараметры, ОшибкаДозапроса);
		Если  ОшибкаДозапроса Тогда
			
			ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(РезультатВызова, "ФайлыНастроекСервер.КоннекшенSaby.Прочитать");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция - Реализация завершения коннекшена при работе через каталог
//
// Параметры:
//  КоннекшенSABY	 - КоннекшенSaby			 - установленное подключение, с которым работал модуль
//  ДопПараметры	 - Неопределено, Структура	 - расширение
// 
// Возвращаемое значение:
//   - 
//
//DynamicDirective
Процедура КоннекшенSABY_ЗавершитьРаботу(КоннекшенSaby, ДопПараметры = Неопределено) Экспорт

	// Пока просто заглушка
	
КонецПроцедуры

