
// Функция - Реализация чтения коннекшена при работе через каталог
//
// Параметры:
//  КоннекшенSABY	 - 	 - 
//  ДопПараметры	 - 	 - 
//  Отказ			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Процедура КоннекшенSaby_Прочитать(КоннекшенSaby, ДопПараметры = Неопределено) Экспорт
	
	яКоннекшенSaby_Инициировать(КоннекшенSaby);
	Если Не МодульОбъектаКлиент().КоннекшенSABY_Получить(КоннекшенSaby, "ЧтениеПоТребованию") Тогда
		
		ОшибкаДозапроса = Ложь;
		РезультатВызова = яКоннекшенSaby_ПрочитатьИни(КоннекшенSaby, ДопПараметры, ОшибкаДозапроса);
		Если  ОшибкаДозапроса Тогда
			
			ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(РезультатВызова, "ФайлыНастроекСервер.КоннекшенSaby.Прочитать");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - инициировать структуру ини класса значениями по-умолчанию
//
// Параметры:
//  Кэш							 - ЛокальныйКэш					 - структура кэша
//  КлассIntegrationConnection	 - КлассIntegrationConnection	 - структура текущего класса
//
&НаКлиенте
Процедура	яКоннекшенSaby_Инициировать(КоннекшенSaby)
	
	Отказ			= Ложь;
	Кэш				= ЛокальныйКэш();
	ПараметрыМеню	= СбисОписаниеИниМеню(Кэш);
	
	// Ини запросить на шару, без контроля, т.к. меню и конфигурации может не быть
	ПараметрыЧтенияИни	= МодульОбъектаКлиент().КоннекшенSABY_Выгрузить(КоннекшенSaby, "ПараметрыДляЧтенияИни"); 
	ДанныеБЛ			= _КлассIntegrationConnection_ВыполнитьЧтениеСБЛ(Кэш, КоннекшенSaby, ПараметрыЧтенияИни, Отказ);
	
	Если Отказ Тогда
		
		ИсключениеИнициироватьИни = МодульОбъектаКлиент().НовыйСбисИсключение(	ДанныеБЛ,
																				"ФайлыНастроекСервер.КлассIntegrationConnection_ИнициироватьИниПоУмолчанию");
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(ИсключениеИнициироватьИни);

	КонецЕсли;
	
	ПараметрыОбработки = Новый Структура("ДанныеБЛ", ДанныеБЛ);
	
	//При инициализации не требуется проверять шаблон. Либо есть данные по ИД, либо это конфиг, либо ошибка - нет подключения
	РезультатОбработки = _КлассIntegrationConnection_ЗаполнитьПоДанным(Кэш, КоннекшенSaby, ПараметрыОбработки, Отказ);
	Если Отказ Тогда

		ИсключениеИнициироватьИни = МодульОбъектаКлиент().НовыйСбисИсключение(	РезультатОбработки,
																				"ФайлыНастроекСервер.КлассIntegrationConnection_ИнициироватьИниПоУмолчанию");
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(ИсключениеИнициироватьИни);
		
	КонецЕсли;
	
	//Инициируем структуру ини пустыми значениями
	ДанныеСписка = КлассIntegrationConnection_СписокИни(Кэш, КоннекшенSaby, Новый Структура, Отказ);
	Если Отказ Тогда
		
		ИсключениеИнициироватьИни = МодульОбъектаКлиент().НовыйСбисИсключение(	ДанныеСписка,
																				"ФайлыНастроекСервер.КлассIntegrationConnection_ИнициироватьИниПоУмолчанию");
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(ИсключениеИнициироватьИни);
		
	КонецЕсли;
	
	ИниДанные	= МодульОбъектаКлиент().КоннекшенSaby_Получить(КоннекшенSaby, "Ини");
	
	Для Каждого ЭлементСписка Из ДанныеСписка.Данные Цикл
		
		ИмяИни = ПолучитьИмяИни(Кэш.КэшНастроек.ПараметрыНастроек, ЭлементСписка.name);
		
		Если ИниДанные.Свойство(ИмяИни) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ИниДанные.Вставить(ИмяИни, Неопределено);
		
	КонецЦикла;
	
	МодульОбъектаКлиент().КоннекшенSABY_Установить(КоннекшенSABY, "Ини", ИниДанные); 
	
КонецПроцедуры

//Функция дозаполняет класс ини недостающими данными
&НаКлиенте
Функция		яКоннекшенSaby_ПрочитатьИни(КоннекшенSaby, ПараметрыЗапросаВходящие, Отказ)
	Перем ДанныеСпискаДляЧтения;
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	
	ПараметрыЗапросаИни	= Новый Структура;

	Если	Не	ПараметрыЗапросаВходящие = Неопределено Тогда
			
		ПараметрыЗапросаВходящие.Свойство("ДанныеСписка", ДанныеСпискаДляЧтения);
		Если ПараметрыЗапросаВходящие.Свойство("КонтролироватьИни") Тогда
			
			ПараметрыЗапросаИни.Вставить("КонтролироватьИни", ПараметрыЗапросаВходящие.КонтролироватьИни);
			
		КонецЕсли;
		
		Если ПараметрыЗапросаВходящие.Свойство("ИсправитьПроблемыИни") Тогда
			
			ПараметрыЗапросаИни.Вставить("ИсправитьПроблемыИни", ПараметрыЗапросаВходящие.ИсправитьПроблемыИни);
			
		КонецЕсли;

		Если	ПараметрыЗапросаВходящие.Свойство("ТолькоПользовательские") Тогда
			
			ПараметрыЗапросаИни.Вставить("ТолькоПользовательские", ПараметрыЗапросаВходящие.ТолькоПользовательские);
			
		КонецЕсли;

	КонецЕсли;
	
	Если ДанныеСпискаДляЧтения = Неопределено Тогда
		
		ДанныеСписка = яКоннекшенSaby_ДанныеСписка(КоннекшенSaby, ПараметрыЗапросаВходящие, Отказ);
		ДанныеСпискаДляЧтения = ДанныеСписка["Данные"];
		
	КонецЕсли;
	
	ПараметрыЗапросаИни.Вставить("СписокИни", ДанныеСпискаДляЧтения);
	
	// Лутаем ини по списку
	РезультатДозапроса = КлассIntegrationConnection_ПолучитьИни(Кэш, КоннекшенSaby, ПараметрыЗапросаИни, Отказ);
	Если Отказ Тогда
		Возврат	Кэш.ОбщиеФункции.СбисИсключение(РезультатДозапроса, "ФайлыНастроекСервер.КоннекшенSaby.ДозапроситьИни");
	КонецЕсли;
	
	Результат = Новый Структура;
	Для Каждого ЭлементСписка Из ДанныеСпискаДляЧтения Цикл
		КлючИни = ПолучитьИмяИни(Кэш.КэшНастроек.ПараметрыНастроек, ЭлементСписка.name);
		Если Не РезультатДозапроса.Свойство(КлючИни) Тогда
			Продолжить;
		КонецЕсли;
		Результат.Вставить(КлючИни, РезультатДозапроса[КлючИни]);
	КонецЦикла;
	
	МодульОбъектаКлиент().КоннекшенSaby_Установить(КоннекшенSaby, "Ини", Результат);
	
	Возврат Результат;
КонецФункции

// Функция - Я коннекшен saby данные списка
//
// Параметры:
//  КоннекшенSaby			 - КоннекшенSaby			 - от которого нужно получить сведения о списке ини
//  ПараметрыЗапросаВходящие - Неопределено/Структура	 - Если неопределено, то список для чтения будет взят о включенных ини на подключении (в меню)
//  Отказ					 - Булево					 - признак ошибки
// 
// Возвращаемое значение:
//  Структура - с полями "Карта, Данные". Где оба списка выстроены одинаково по индексам.
//		Карта: СписокЗначений для быстрого поиска требуемого значения по представлению ини
//		Данные: Массив структур с подготовленными параметрами для запроса данных ини.
//
&НаКлиенте
Функция		яКоннекшенSaby_ДанныеСписка(КоннекшенSaby, ПараметрыЗапросаВходящие = Неопределено, Отказ = Ложь)
	Перем СписокИниПоиска, СтруктураИскать;
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	ПараметрыСборкаСписка = Новый Структура("Искать");
	
	Если ПараметрыЗапросаВходящие = Неопределено Тогда
		
		// По-умолчанию

	ИначеЕсли ТипЗнч(ПараметрыЗапросаВходящие) = Тип("Строка") Тогда
		
		// Читается одна определенная ини в формате vo2
		СтруктураИскать = Новый Структура("Включено, Имя", "01", Новый Массив);
		СтруктураИскать.Имя.Добавить(ПолучитьИмяИни(Кэш.КэшНастроек.ПараметрыНастроек, ПараметрыЗапросаВходящие, "во_json"));
		
	Иначе
		
		Если ПараметрыЗапросаВходящие.Свойство("СписокИни_ВО", СписокИниПоиска) Тогда
		
			// Указаны имена ини в формате vo2. Берем значения не от класса, а сконвертировав имена. Чтоб не думалось, ищем и в т.ч. и среди отключенных.
			СтруктураИскать = Новый Структура("Включено, Имя", "01", Новый Массив);
			Если ТипЗнч(СписокИниПоиска) = Тип("Структура") Тогда
				Для Каждого УстановленныйФайл Из СписокИниПоиска Цикл
					СтруктураИскать.Имя.Добавить(ПолучитьИмяИни(Кэш.КэшНастроек.ПараметрыНастроек, УстановленныйФайл.Ключ, "во_json"));
				КонецЦикла;
			Иначе	
				Для Каждого УстановленныйФайл Из ПараметрыЗапросаВходящие.СписокИни_ВО Цикл
					СтруктураИскать.Имя.Добавить(ПолучитьИмяИни(Кэш.КэшНастроек.ПараметрыНастроек, УстановленныйФайл, "во_json"));
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
		// Есть расширение на чтение типа ини. По-умолчанию берутся только те, с которыми умеет работать vo2
		Если ПараметрыЗапросаВходящие.Свойство("ДоступныеТипыИни") Тогда
			
			ПараметрыСборкаСписка.Вставить("ДоступныеТипыИни", ПараметрыЗапросаВходящие.ДоступныеТипыИни);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураИскать = Неопределено Тогда
		
		// Формируем структуру для запроса ини по объекту. Зависит от набора уже установленных ини.
		ДанныеИни = МодульОбъектаКлиент().КоннекшенSaby_Получить(КоннекшенSaby, "Ини");
		Если ЗначениеЗаполнено(ДанныеИни) Тогда
			
			// Ини есть, нужно запросить их. Чтоб не думалось, ищем и в т.ч. и среди отключенных.
			СтруктураИскать = Новый Структура("Включено, Имя", "01", Новый Массив);
			Для Каждого КлючИЗначениеИни Из ДанныеИни Цикл
				Если Не КлючИЗначениеИни.Значение = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				СтруктураИскать.Имя.Добавить(ПолучитьИмяИни(Кэш.КэшНастроек.ПараметрыНастроек, КлючИЗначениеИни.Ключ, "во_json"));
			КонецЦикла;
			
		Иначе
			
			// Ини еще не прочитаны. Берется список включеных из меню.
	        СтруктураИскать = Новый Структура("Включено", "1");
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыСборкаСписка.Искать = СтруктураИскать;
	
	//Пропустим требуемые параметры для получения списка через сбисМеню подключения на предмет того, а есть ли там вообще такая ини
	ДанныеСписка = КлассIntegrationConnection_СписокИни(Кэш, КоннекшенSaby, ПараметрыСборкаСписка, Отказ);
	Если Отказ Тогда
		
		Возврат	МодульОбъектаКлиент().НовыйСбисИсключение(ДанныеСписка, "ФайлыНастроекСервер.КоннекшенSaby.ДанныеСписка");
		
	КонецЕсли;
	
	Возврат ДанныеСписка;
	
КонецФункции

