  
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

&НаКлиенте
Функция сбисОписанияПрограмм(Кэш) Экспорт   
	
	АлгоритмПодписиВПолучитьИнформациюМК = Кэш.СовместимостьМетодов.АлгоритмПодписи.АлгоритмПодписиПолучитьИнформацию;
	
	Если Кэш.Ини.Свойство("Конфигурация") и Кэш.Ини.Конфигурация.Свойство("мПрограммыЭП") и Не ЗначениеЗаполнено(Кэш.Парам.НастройкиКриптографии.ИмяПрограммы) Тогда
		ОписанияПрограмм = сбисПолучитьНастройкиКриптографии(Кэш); 
		Для каждого СвойстваПрограммы Из ОписанияПрограмм Цикл
			СвойстваПрограммы.Вставить("АлгоритмПодписиВПолучитьИнформациюМК" , АлгоритмПодписиВПолучитьИнформациюМК);
		КонецЦикла;	
	Иначе
		ОписанияПрограмм = Новый Массив;
		СвойстваПрограммы = Новый Структура(); 
		НастройкиКриптографии = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("НастройкиКриптографии");
		СвойстваПрограммы.Вставить("ИмяПрограммы", НастройкиКриптографии.ИмяПрограммы); 
		СвойстваПрограммы.Вставить("ПутьКПрограмме", НастройкиКриптографии.ПутьКПрограмме);
		СвойстваПрограммы.Вставить("ТипПрограммы", НастройкиКриптографии.ТипПрограммы);
		СвойстваПрограммы.Вставить("АлгоритмПодписиВПолучитьИнформациюМК", АлгоритмПодписиВПолучитьИнформациюМК); 	
		ОписанияПрограмм.Добавить(СвойстваПрограммы);
	КонецЕсли;  
	
	Возврат ОписанияПрограмм;
КонецФункции
&НаСервере
Функция сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм, Алгоритм = Неопределено) Экспорт
	
	Менеджер = Неопределено;
	Для Каждого СвойстваПрограммы Из ОписанияПрограмм Цикл
		
		Попытка
			ИнформацияМодуля = СредстваКриптографии.ПолучитьИнформациюМодуляКриптографии(
				СвойстваПрограммы.ИмяПрограммы,
				СвойстваПрограммы.ПутьКПрограмме,
				СвойстваПрограммы.ТипПрограммы);
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если ИнформацияМодуля = Неопределено Тогда
			Менеджер = Неопределено;
			Продолжить;
		КонецЕсли;
		
		Попытка
			Менеджер = Новый МенеджерКриптографии(
				СвойстваПрограммы.ИмяПрограммы,
				СвойстваПрограммы.ПутьКПрограмме,
				СвойстваПрограммы.ТипПрограммы);
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если Алгоритм = Неопределено Тогда 
			Прервать;
		КонецЕсли;	  
		
		Если СвойстваПрограммы.АлгоритмПодписиВПолучитьИнформациюМК Тогда
			Для каждого АлгоритмПодписи Из ИнформацияМодуля.АлгоритмыПодписи Цикл
				Если Алгоритм.Найти(АлгоритмПодписи) = Неопределено Тогда
					Менеджер = Неопределено;
					Прервать;
				КонецЕсли; 
			КонецЦикла;
		Иначе 
			Если Алгоритм.Найти(Менеджер.АлгоритмПодписи) = Неопределено Тогда
				Менеджер = Неопределено;
				Продолжить;
			КонецЕсли; 
		КонецЕсли;	
		
		Прервать; // Требуемый менеджер криптографии получен.
	КонецЦикла;  
	Если Менеджер = Неопределено Тогда
		ОшибкаКриптографии = МодульОбъектаСервер().НовыйСбисИсключение(731102,"МодульОбъекта.МенеджерКриптографииБазовый",,,"Не удалось создать менеджер криптографии");
		ВызватьИсключение МодульОбъектаСервер().СбисИсключение_Выгрузить(ОшибкаКриптографии);
	КонецЕсли;
	Возврат Менеджер;
	
КонецФункции

&НаКлиенте
Функция сбисПолучитьНастройкиКриптографии(Кэш) Экспорт
	Контекст = Новый Структура("Документ, СтрТабл, Ини",,);
	Контекст.Ини = Новый Структура;
	Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Контекст.Ини, Кэш.Ини.Конфигурация.мПрограммыЭП);
	
	НастройкиЭП = Кэш.ОбщиеФункции.ПолучитьДанныеДокумента1С(Кэш.Ини.Конфигурация.мПрограммыЭП, Неопределено, Новый Структура, Кэш.Парам);
    Возврат НастройкиЭП.ПрограммыЭП;
КонецФункции
     
&НаКлиенте
Функция сбисСписокСертификатовДляАвторизации(Кэш, ТекстОшибки) Экспорт

	Попытка
		
		Возврат сбисСписокСертификатовДляАвторизацииНаСервере(сбисОписанияПрограмм(Кэш), ТекстОшибки);	
		
	Исключение
		
		ОшибкаЧтенияСертификатов = МодульОбъектаСервер().НовыйСбисИсключение(ИнформацияОбОшибке(), "ЭлектроннаяПодписьНаСервере.сбисСписокСертификатовДляАвторизации");
		МодульОбъектаКлиент().СбисСообщить(ОшибкаЧтенияСертификатов);
		ТекстОшибки = МодульОбъектаСервер().СбисИсключение_Выгрузить(ОшибкаЧтенияСертификатов, "Сообщение");
		Возврат Новый Массив;
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция сбисСписокСертификатовДляАвторизацииНаСервере(ОписанияПрограмм, ТекстОшибки) Экспорт
	СертификатыДляАвторизации = Новый Массив();
	Попытка
		МенеджерКриптографии = сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм);
	Исключение
		ОшибкаСозданияКриптографии = МодульОбъектаСервер().НовыйСбисИсключение(ИнформацияОбОшибке(), "ЭлектроннаяПодписьНаСервере.сбисСписокСертификатовДляАвторизацииНаСервере");
		ВызватьИсключение МодульОбъектаСервер().СбисИсключение_Выгрузить(ОшибкаСозданияКриптографии);
	КонецПопытки;
	
	ХранилищеСертификатовКриптографии = МенеджерКриптографии.ПолучитьХранилищеСертификатов();
	Сертификаты = ХранилищеСертификатовКриптографии.ПолучитьВсе(); 
	Для Каждого Серт из Сертификаты Цикл
		Попытка
			СертДвоичныеДанные = СтрЗаменить(СтрЗаменить(Base64Строка(Серт.Выгрузить()),Символы.ПС,""),Символы.ВК,"");
			СертОтпечаток = СтрЗаменить(Строка(Серт.Отпечаток), " ", "");
			СертификатыДляАвторизации.Добавить(Новый Структура("ДвоичныеДанные,Отпечаток,Название,ФИО,Должность,ДействителенПо",СертДвоичныеДанные, СертОтпечаток,Серт.Субъект.CN, Серт.Субъект.SN+" "+Серт.Субъект.GN,?(Серт.Субъект.Свойство("T"),Серт.Субъект.T,""),Серт.ДатаОкончания));
		Исключение
		КонецПопытки;
	КонецЦикла;
	Возврат СертификатыДляАвторизации;

КонецФункции

&НаКлиенте
Функция сбисСписокЛокальныхСертификатов(Кэш, ТекстОшибки) Экспорт

	Попытка
		
		Возврат сбисСписокЛокальныхСертификатовНаСервере(сбисОписанияПрограмм(Кэш), ТекстОшибки);	
		
	Исключение
		
		ОшибкаЧтенияСертификатов = МодульОбъектаСервер().НовыйСбисИсключение(ИнформацияОбОшибке(), "ЭлектроннаяПодписьНаСервере.сбисСписокЛокальныхСертификатов");
		МодульОбъектаКлиент().СбисСообщить(ОшибкаЧтенияСертификатов);
		ТекстОшибки = МодульОбъектаСервер().СбисИсключение_Выгрузить(ОшибкаЧтенияСертификатов, "Сообщение");
		Возврат Новый СписокЗначений;
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция сбисСписокЛокальныхСертификатовНаСервере(ОписанияПрограмм, ТекстОшибки) Экспорт
	ЛокальныеСертификаты = Новый СписокЗначений;
	Попытка
		МенеджерКриптографии = сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм);
	Исключение    
		ОшибкаСозданияКриптографии = МодульОбъектаСервер().НовыйСбисИсключение(ИнформацияОбОшибке(), "ЭлектроннаяПодписьНаСервере.сбисСписокЛокальныхСертификатовНаСервере");
		ВызватьИсключение МодульОбъектаСервер().СбисИсключение_Выгрузить(ОшибкаСозданияКриптографии);
	КонецПопытки;
	
	ХранилищеСертификатовКриптографии = МенеджерКриптографии.ПолучитьХранилищеСертификатов();
	Сертификаты = ХранилищеСертификатовКриптографии.ПолучитьВсе(); 
	Для Каждого Серт из Сертификаты Цикл
		Попытка
			СертДвоичныеДанные = СтрЗаменить(СтрЗаменить(Base64Строка(Серт.Выгрузить()),Символы.ПС,""),Символы.ВК,"");
			СертОтпечаток = СтрЗаменить(Строка(Серт.Отпечаток), " ", "");
			Сертификат = Новый Структура;
			Сертификат.Вставить("ДвоичныеДанные",СертДвоичныеДанные);
			Сертификат.Вставить("Отпечаток",СертОтпечаток);
			Сертификат.Вставить("Название",Серт.Субъект.CN);
			Сертификат.Вставить("ФИО",Серт.Субъект.SN+" "+Серт.Субъект.GN);
			Сертификат.Вставить("Должность",?(Серт.Субъект.Свойство("T"),Серт.Субъект.T,""));
			Сертификат.Вставить("ДействителенПо",Серт.ДатаОкончания);
			ЛокальныеСертификаты.Добавить(Сертификат);
		Исключение
		КонецПопытки;
	КонецЦикла;
	Возврат ЛокальныеСертификаты;

КонецФункции

&НаКлиенте
Функция сбисДвоичныеДанныеСертификатаПоОтпечатку(Кэш, Отпечаток) Экспорт
	Возврат сбисДвоичныеДанныеСертификатаПоОтпечаткуНаСервере(сбисОписанияПрограмм(Кэш), Отпечаток);	
КонецФункции  
&НаСервере
Функция сбисДвоичныеДанныеСертификатаПоОтпечаткуНаСервере(ОписанияПрограмм, Отпечаток) Экспорт
	Попытка
		МенеджерКриптографии = сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм);
	Исключение    
		Возврат Ложь;
	КонецПопытки;
	ХранилищеСертификатовКриптографии = МенеджерКриптографии.ПолучитьХранилищеСертификатов();
	Сертификаты = ХранилищеСертификатовКриптографии.ПолучитьВсе(); 
	Для Каждого Серт из Сертификаты Цикл
		Если СтрЗаменить(Строка(Серт.Отпечаток), " ", "") = Отпечаток Тогда
			Возврат СтрЗаменить(СтрЗаменить(Base64Строка(Серт.Выгрузить()),Символы.ПС,""),Символы.ВК,"");
		КонецЕсли;
	КонецЦикла;
КонецФункции

// Функция выбрает подходящий сертификат
//
// Параметры:
//  Кэш				 - Структура	 - Кэш внешней обработки
//  СертификатыДок	 - Массив	 - Список сертификатов, которыми возможно подписание
//  ТекстОшибки		 - Строка	 - Текст ошибки при подборе сертификата
//  ДопПараметры	 - Стркутура	 - Дополнительные параметры подбора
// 
// Возвращаемое значение:
//  Структура - Описание сертификата
//
&НаКлиенте
Функция сбисВыбратьПодходящийСертификат(Кэш, СертификатыДок, ТекстОшибки, ДопПараметры = Неопределено) Экспорт 
	
	Возврат сбисВыбратьПодходящийСертификатНаСервере(сбисОписанияПрограмм(Кэш), СертификатыДок, Кэш.Парам, ТекстОшибки, ДопПараметры);
	
КонецФункции

// Функция выбрает подходящий сертификат с сервера
//
// Параметры:
//  ОписанияПрограмм - 	 - 
//  СертификатыДок	 - Массив	 - Список сертификатов, которыми возможно подписание
//	КэшПарам	- Структура	- Параметры внешней обработки
//  ТекстОшибки		 - Строка	 - Текст ошибки при подборе сертификата
//  ДопПараметры	 - Стркутура	 - Дополнительные параметры подбора
// 
// Возвращаемое значение:
//  Структура - Описание сертификата
//
&НаСервере
Функция сбисВыбратьПодходящийСертификатНаСервере(ОписанияПрограмм, СертификатыДок, КэшПарам, ТекстОшибки, ДопПараметры = Неопределено) Экспорт
	
	Результат = Новый Структура();
	
	Попытка
		МенеджерКриптографии = сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм);
	Исключение    
		ОшибкаСозданияКриптографии = МодульОбъектаСервер().НовыйСбисИсключение(ИнформацияОбОшибке(), "ЭлектроннаяПодписьНаСервере.сбисВыбратьПодходящийСертификатНаСервере");
		ТекстОшибки = МодульОбъектаСервер().СбисИсключение_Выгрузить(ОшибкаСозданияКриптографии, "Сообщение");
	КонецПопытки;
	
	Если ТекстОшибки = "" Тогда
		
		Попытка 
			
			ХранилищеСертификатовКриптографии = МенеджерКриптографии.ПолучитьХранилищеСертификатов();
			Сертификаты = ХранилищеСертификатовКриптографии.ПолучитьВсе();
			
		Исключение
			ОшибкаСозданияКриптографии = МодульОбъектаСервер().НовыйСбисИсключение(ИнформацияОбОшибке(), "ЭлектроннаяПодписьНаСервере.сбисВыбратьПодходящийСертификатНаСервере");
			ТекстОшибки = МодульОбъектаСервер().СбисИсключение_Выгрузить(ОшибкаСозданияКриптографии, "Сообщение");
		КонецПопытки; 
		
	КонецЕсли; 
	
	Алгоритм = Неопределено;
	
	Для Каждого СертДок Из СертификатыДок Цикл
		
		Если СертДок.Ключ.Тип = "Отложенный"
			Или СертДок.Ключ.Тип = "ОтложенныйСПодтверждением"
			Или СертДок.Ключ.Тип = "Серверный" Тогда  
			
			Результат.Вставить("СертификатДляПодписания", Неопределено);
			Результат.Вставить("СертификатДок", СертДок); 
			Результат.Вставить("Алгоритм", Алгоритм);
			Возврат Результат;             
			
		ИначеЕсли СертДок.Ключ.Тип = "Клиентский"
			И ТекстОшибки = "" Тогда
			
			Для Каждого Серт Из Сертификаты Цикл
				
				СертОтпечаток = СтрЗаменить(Строка(Серт.Отпечаток), " ", "");
				
				Если  СертОтпечаток = СертДок.Отпечаток Тогда 
					
                    СертДД = Серт.Выгрузить(); 
					
					Если Не ЗначениеЗаполнено(КэшПарам.НастройкиКриптографии.ИмяПрограммы) Тогда  // используются штатные настройки 1С, надо выбрать подходящую по алгоритму подписи
						
						Попытка 
							
							Алгоритм = сбисВыбратьНаборАлгоритмовДляСозданияПодписи(СертДок.Алгоритм);
							
							Если Алгоритм.Найти(МенеджерКриптографии.АлгоритмПодписи) = Неопределено Тогда
								
								Попытка
									сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм, Алгоритм);
								Исключение
									// если не удалось создать менеджер криптографии с нужным алгоритмом, то продолжим поиск подходящего серта   
									ОшибкаСозданияКриптографии = МодульОбъектаСервер().НовыйСбисИсключение(ИнформацияОбОшибке(), "ЭлектроннаяПодписьНаСервере.сбисВыбратьПодходящийСертификатНаСервере");
									ТекстОшибки = МодульОбъектаСервер().СбисИсключение_Выгрузить(ОшибкаСозданияКриптографии, "Сообщение");
									Продолжить;
								КонецПопытки;
								
							КонецЕсли; 
							
						Исключение
							//
						КонецПопытки;
						
					КонецЕсли;                               
					
					Если ДопПараметры = Неопределено 
						Или ДопПараметры.Свойство("ИНННашейОрганизаци")
							И (ДопПараметры.ИНННашейОрганизаци = СертДок.ИНН
								Или СтрДлина(СертДок.ИНН) > СтрДлина(ДопПараметры.ИНННашейОрганизаци)) Тогда
								
						Результат.Вставить("СертификатДляПодписания", Base64Строка(СертДД));    
						Результат.Вставить("СертификатДок", СертДок); 
						Результат.Вставить("Алгоритм", Алгоритм);
						Возврат Результат;
						
					ИначеЕсли Не ЗначениеЗаполнено(Результат) Тогда
						
						Результат.Вставить("СертификатДляПодписания", Base64Строка(СертДД));    
						Результат.Вставить("СертификатДок", СертДок); 
						Результат.Вставить("Алгоритм", Алгоритм);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат ?(ЗначениеЗаполнено(Результат), Результат, Ложь);

КонецФункции

&НаКлиенте
Функция сбисПодписатьФайл(Кэш, ПолноеИмяФайла, Сертификат, Алгоритм, ТекстОшибки) Экспорт

	ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
	Попытка
		
		Подпись = сбисПодписатьФайлНаСервере(сбисОписанияПрограмм(Кэш), Base64Строка(ДвоичныеДанные), Сертификат, Алгоритм, ТекстОшибки);
		
	Исключение
		
		ОшибкаПодписания = МодульОбъектаСервер().НовыйСбисИсключение(ИнформацияОбОшибке(), "ЭлектроннаяПодписьНаСервере.сбисПодписатьФайл");
		МодульОбъектаКлиент().СбисСообщить(ОшибкаПодписания);
		ТекстОшибки = МодульОбъектаСервер().СбисИсключение_Выгрузить(ОшибкаПодписания, "Сообщение");
		Подпись = Ложь;
		
	КонецПопытки;
	
	Возврат Подпись; 
	
КонецФункции

&НаКлиенте
Функция сбисПодписатьДвоичныеДанные(Кэш, ДвоичныеДанные, Сертификат, Алгоритм, ТекстОшибки) Экспорт

	Попытка
		
		Подпись = сбисПодписатьФайлНаСервере(сбисОписанияПрограмм(Кэш), ДвоичныеДанные, Сертификат, Алгоритм, ТекстОшибки);
		
	Исключение
		
		ОшибкаПодписания = МодульОбъектаСервер().НовыйСбисИсключение(ИнформацияОбОшибке(), "ЭлектроннаяПодписьНаСервере.сбисПодписатьФайл");
		МодульОбъектаКлиент().СбисСообщить(ОшибкаПодписания);
		ТекстОшибки = МодульОбъектаСервер().СбисИсключение_Выгрузить(ОшибкаПодписания, "Сообщение");
		Подпись = Ложь;
		
	КонецПопытки;

	Возврат Подпись; 
	
КонецФункции

&НаСервере
Функция сбисПодписатьФайлНаСервере(ОписанияПрограмм, ДвоичныеДанные, Сертификат, Алгоритм, ТекстОшибки) Экспорт
	Попытка
		МенеджерКриптографии = сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм, Алгоритм);
	Исключение    
		ОшибкаСозданияКриптографии = МодульОбъектаСервер().НовыйСбисИсключение(ИнформацияОбОшибке(), "ЭлектроннаяПодписьНаСервере.сбисПодписатьФайлНаСервере");
		ВызватьИсключение МодульОбъектаСервер().СбисИсключение_Выгрузить(ОшибкаСозданияКриптографии);
	КонецПопытки;
	Серт = Новый СертификатКриптографии(Base64Значение(Сертификат));
	Подпись = МенеджерКриптографии.Подписать(Base64Значение(ДвоичныеДанные), Серт);
	Возврат СтрЗаменить(СтрЗаменить(Base64Строка(Подпись),Символы.ПС,""),Символы.ВК,"");
КонецФункции

&НаКлиенте
Функция сбисРасшифровать(Кэш, ДвоичныеДанные, ПолноеИмяФайла) Экспорт
	Рез = сбисРасшифроватьНаСервере(сбисОписанияПрограмм(Кэш), Base64Строка(ДвоичныеДанные));
	РезДвоичныеДанные = Base64Значение(Рез);
	РезДвоичныеДанные.Записать(ПолноеИмяФайла);
КонецФункции 

&НаСервере
Функция сбисРасшифроватьНаСервере(ОписанияПрограмм, ДвоичныеДанные) Экспорт
	МенеджерКриптографии = сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм);
	ДвоичныеДанныеРашифрованные = МенеджерКриптографии.Расшифровать(Base64Значение(ДвоичныеДанные));
	НедопустимыеСимволы = Новый Массив;
	НедопустимыеСимволы.Добавить(Символы.ПС);
	НедопустимыеСимволы.Добавить(Символы.ВК);
	ДанныеВозврат = Base64Строка(ДвоичныеДанныеРашифрованные);
	Для Каждого НедопустимыйСимвол Из НедопустимыеСимволы Цикл
		ДанныеВозврат = СтрЗаменить(ДанныеВозврат, НедопустимыйСимвол, "");
	КонецЦикла;
	Возврат ДанныеВозврат;
КонецФункции  
&НаСервере
Функция сбисВыбратьНаборАлгоритмовДляСозданияПодписи(Алгоритм) Экспорт
	
	Алгоритмы = сбисИменаАлгоритмовПодписиГОСТ_34_10_2012_256();
	Если Алгоритмы.Найти(Алгоритм)<>Неопределено Тогда
		Возврат Алгоритмы;
	КонецЕсли; 
	Алгоритмы = сбисИменаАлгоритмовПодписиГОСТ_34_10_2012_512();
	Если Алгоритмы.Найти(Алгоритм)<>Неопределено Тогда
		Возврат Алгоритмы;
	КонецЕсли;
	Алгоритмы = сбисИменаАлгоритмовПодписиГОСТ_34_10_2001();
	Если Алгоритмы.Найти(Алгоритм)<>Неопределено Тогда
		Возврат Алгоритмы;
	КонецЕсли;
	Алгоритмы = сбисИменаАлгоритмовПодписиГОСТ_34_10_94();
	Если Алгоритмы.Найти(Алгоритм)<>Неопределено Тогда
		Возврат Алгоритмы;
	КонецЕсли;
	Алгоритмы = Новый Массив;
	Алгоритмы.Добавить("RSA_SIGN");
	Алгоритмы.Добавить("SHA1RSA");     // приходит от СБИС
	Алгоритмы.Добавить("SHA1WithRSASignature");    // приходит от СБИС
	Алгоритмы.Добавить("SHA256RS");   // приходит от СБИС
	Если Алгоритмы.Найти(Алгоритм)<>Неопределено Тогда
		Возврат Алгоритмы;
	КонецЕсли;
	
	Возврат сбисИменаАлгоритмовПодписиГОСТ_34_10_2012_256();
	
КонецФункции

&НаСервере
Функция сбисИменаАлгоритмовПодписиГОСТ_34_10_94()
	
	Имена = Новый Массив;
	Имена.Добавить("ГОСТ 34.10-94"); // Представление.
	Имена.Добавить("GOST R 34.10-94");
	
	Возврат Имена;
	
КонецФункции
&НаСервере
Функция сбисИменаАлгоритмовПодписиГОСТ_34_10_2001()
	
	Имена = Новый Массив;
	Имена.Добавить("ГОСТ 34.10-2001"); // Представление.
	Имена.Добавить("ГОСТ Р 34.10-2001");  // приходит от СБИС
	Имена.Добавить("GOST R 34.10-2001");
	Имена.Добавить("ECR3410-CP");
	
	Возврат Имена;
	
КонецФункции
&НаСервере
Функция сбисИменаАлгоритмовПодписиГОСТ_34_10_2012_256()
	
	Имена = Новый Массив;
	Имена.Добавить("ГОСТ 34.10-2012 256"); // Представление.
	Имена.Добавить("ГОСТ Р 34.10-2012 256");   // приходит от СБИС
	Имена.Добавить("GR 34.10-2012 256");
	Имена.Добавить("GOST 34.10-2012 256");
	Имена.Добавить("GOST R 34.10-12 256");
	Имена.Добавить("GOST3410-12-256");
	
	Возврат Имена;
	
КонецФункции
&НаСервере
Функция сбисИменаАлгоритмовПодписиГОСТ_34_10_2012_512()
	
	Имена = Новый Массив;
	Имена.Добавить("ГОСТ 34.10-2012 512"); // Представление. 
	Имена.Добавить("ГОСТ Р 34.10-2012 512");   // приходит от СБИС
	Имена.Добавить("GR 34.10-2012 512");
	Имена.Добавить("GOST 34.10-2012 512");
	
	Возврат Имена;
	
КонецФункции