
//DynamicDirective

//Конструктор ExtSysException
//БазоваяОшибка		- (необяз) ExtSysException(СбисИсключение)/ИнформацияОбОшибке/Структура("code, message, detail, dump, help")/Строка (в json/произвольная)/Число(код ошибки)
//СбисИмяКоманды	- Имя команды в стек
//Работает если в БазовойОшибке что-то неопределено, иначе берутся значения по-умолчанию
//СбисКод			- (необяз)код для новой ошибки. 		По-умолч 100
//СбисСообщение		- (необяз)сообщение для новой ошибки.	По-умолч сообщение по коду 
//СбисДетализация	- (необяз)детализация для новой ошибки.	По-умолч сообщение по коду
//СбисДамп			- (необяз)дамп ошибки
//СбисХелп			- (необяз)ссылка на решение проблемы
Функция НовыйСбисИсключение(БазоваяОшибка	= Неопределено,	СбисИмяКоманды	= Неопределено,
							СбисКод			= Неопределено,	СбисСообщение	= Неопределено, СбисДетализация=Неопределено, 
							СбисДанные		= Неопределено,	СбисХелп		= Неопределено) Экспорт
	
	СбисИсключение		= СбисИсключение_Пустое(СбисКод, СбисСообщение, СбисДетализация, СбисИмяКоманды, СбисДанные);
	КонтекстОбъединения	= Новый Структура("СообщениеУказаноЯвно", ЗначениеЗаполнено(СбисСообщение)); // Если сообщение указано явно в конструкторе, то оно не обновляется.

	//Проверить перегрузки для конструктора
	
	
	Если БазоваяОшибка = Неопределено Тогда
		
		// Базовая ошибка неопределена, это генерация нового исключения
		СбисОсновнаяОшибка	= СбисИсключение_ПоВходнымПараметры(СбисИсключение);

	ИначеЕсли	ТипЗнч(БазоваяОшибка) = Тип("ИнформацияОбОшибке")	Тогда
		
		СбисОсновнаяОшибка = СбисИсключение_ИнформацияОбОшибке(БазоваяОшибка, СбисИсключение);
		
	ИначеЕсли	ТипЗнч(БазоваяОшибка) = Тип("Строка")				Тогда
		
		СбисОсновнаяОшибка = СбисИсключение_Строка(БазоваяОшибка);
		
	ИначеЕсли	ТипЗнч(БазоваяОшибка) = Тип("Число")				Тогда
		
		СбисОсновнаяОшибка = СбисИсключение_Число(БазоваяОшибка);
		
	ИначеЕсли	ТипЗнч(БазоваяОшибка) = Тип("Структура")			Тогда
		
		СбисОсновнаяОшибка = СбисИсключение_Структура(БазоваяОшибка, СбисИсключение);
		
	ИначеЕсли	ТипЗнч(БазоваяОшибка) = Тип("Соответствие")			Тогда
		
		СбисОсновнаяОшибка = СбисИсключение_Соответствие(БазоваяОшибка);
		
	Иначе
		
		//Неизвестная ошибка
		СбисОсновнаяОшибка		= СбисИсключение_Пустое();
		СбисОсновнаяОшибка.dump = НовыйДампОшибки(БазоваяОшибка);
		
	КонецЕсли;
	
	НовыйСбисИсключение_ОбъединитьОшибки(СбисИсключение, СбисОсновнаяОшибка, КонтекстОбъединения);
	
	Возврат СбисИсключение;
	
КонецФункции

//DynamicDirective

// Функция - Get метод для исключений
//
// Параметры:
//  СбисИсключение	 - СбисИсключение	 - текущая ошибка
//  КлючПолучить	 - Строка			 - ключ, значение которого надо извлечь из класса
// 
// Возвращаемое значение:
//  Произвольный - значение по ключу
//
Функция СбисИсключение_Получить(СбисИсключение, КлючПолучить) Экспорт 
	
	Если		КлючПолучить = "Данные" Тогда
		
		Возврат СбисИсключение.data;
		
	ИначеЕсли	КлючПолучить = "Код" Тогда
		
		Возврат СбисИсключение.code;
		
	ИначеЕсли	КлючПолучить = "ДополнительныйКод" Тогда
		
		Возврат СбисИсключение.extCode;

	ИначеЕсли	КлючПолучить = "ПолныйКод" Тогда
		
		Возврат Число(Строка(СбисИсключение.code) + Строка(СбисИсключение.extCode));
		
	КонецЕсли;
	
КонецФункции

//DynamicDirective

//Процедура генерирует и вызывает ExtSysException(СбисИсключение)
Процедура ВызватьСбисИсключение(БазоваяОшибка=Неопределено, СбисИмяКоманды,
								СбисКод=Неопределено, СбисСообщение=Неопределено, СбисДетализация=Неопределено, СбисДамп=Неопределено, СбисХелп=Неопределено) Экспорт
								
	ИсключениеВызов = НовыйСбисИсключение(БазоваяОшибка, СбисИмяКоманды, СбисКод, СбисСообщение, СбисДетализация, СбисДамп, СбисХелп);
	ВызватьИсключение(СбисИсключение_ВСтроку(ИсключениеВызов));
	
КонецПроцедуры

//DynamicDirective

Функция НовыйДампОшибки(ОснованиеДампа = Неопределено,
						ДетализацияОшибки = Неопределено, ИсходнаяСтрока= Неопределено, НомерСтроки = Неопределено, ИмяМодуля = Неопределено)
							
	СбисОснованиеОшибки = Новый Структура(
	"ДетализацияОшибки, ИсходнаяСтрока, НомерСтроки, ИмяМодуля",
	ДетализацияОшибки, ИсходнаяСтрока, НомерСтроки, ИмяМодуля);
							
	Если ТипЗнч(ОснованиеДампа) = Тип("ИнформацияОбОшибке") Тогда						

		ЗаполнитьЗначенияСвойств(СбисОснованиеОшибки, ОснованиеДампа);
		СбисОснованиеОшибки.ИсходнаяСтрока = СокрЛП(СбисОснованиеОшибки.ИсходнаяСтрока);
		
	ИначеЕсли ЭтоТипСбис(ОснованиеДампа, "СбисИсключение") Тогда
		
		СбисОснованиеОшибки.ИмяМодуля = ОснованиеДампа.methodName;
		Если ДетализацияОшибки = Неопределено Тогда
			
			СбисОснованиеОшибки.ДетализацияОшибки = ОснованиеДампа.details;
			
		КонецЕсли;
		
	ИначеЕсли ОснованиеДампа = Неопределено Тогда
		
		
	Иначе
		
		// Не знаем, что за основание, добавить в дамп
		СбисОснованиеОшибки.Вставить("Основание", ОснованиеДампа);
		
		Если СбисОснованиеОшибки.ИмяМодуля = Неопределено Тогда
			
			СбисОснованиеОшибки.ИмяМодуля = "МодульОбъектаКлиент.НовыйДампОшибки";
			
		КонецЕсли;
		
		Если СбисОснованиеОшибки.ИсходнаяСтрока = Неопределено Тогда
			
			Попытка
				
				СбисОснованиеОшибки.ИсходнаяСтрока	= Строка(ОснованиеДампа);
				
			Исключение
				
				СбисОснованиеОшибки.ИсходнаяСтрока	= ОписаниеОшибки();
				
			КонецПопытки;
			
		КонецЕсли;

	КонецЕсли;
	
	Возврат СбисОснованиеОшибки;
		
КонецФункции			

//DynamicDirective

Процедура НовыйСбисИсключение_ОбъединитьОшибки(СбисИсключение, СбисОсновнаяОшибка, КонтектОбъединения)
	Перем СбисСтек;
	
	ОбновитьТекстСообщения = Не КонтектОбъединения.СообщениеУказаноЯвно;
	
	//Если не указаны основные поля для новой ошибки
	Если СбисИсключение.code = Неопределено Тогда
		
		СбисИсключение.code		= СбисОсновнаяОшибка.code;
		СбисИсключение.extCode	= СбисОсновнаяОшибка.extCode;
		
	ИначеЕсли СбисОсновнаяОшибка.code = СбисИсключение.code
			И ЗначениеЗаполнено(СбисОсновнаяОшибка.extCode) Тогда
			
		// Код не меняется и есть код-расширение ошибки, то взять перегенерированное сообщение
		ОбновитьТекстСообщения	= Ложь;
		СбисИсключение.extCode	= СбисОсновнаяОшибка.extCode;
		СбисИсключение.message	= СбисОсновнаяОшибка.message;
		
	Иначе
		
		// Код был изменен, код расширения так же никуда не идет, останется в стэке.
		
	КонецЕсли;
	
	Если СбисИсключение.message = Неопределено Тогда
		
		// Нет сообщения ни в основной, ни в обрабатываемой ошибке
		Если СбисОсновнаяОшибка.message = Неопределено Тогда
			
			ОбновитьТекстСообщения = Истина;
			
		ИначеЕсли Не СбисИсключение_СообщениеПоКоду(СбисОсновнаяОшибка.code) = СбисОсновнаяОшибка.message Тогда 
			
			СбисИсключение.message	= СбисОсновнаяОшибка.message;
			ОбновитьТекстСообщения	= Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбновитьТекстСообщения Тогда
		
		СбисИсключение.message = СбисИсключение_ТекстСообщения(СбисИсключение);
		
	КонецЕсли;
	
	Если СбисИсключение.details = Неопределено Тогда
		
		Если СбисОсновнаяОшибка.details = Неопределено Тогда
		
			СбисИсключение.details = СбисИсключение.message;
			
		Иначе
			
			СбисИсключение.details = СбисОсновнаяОшибка.details;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Если СбисИсключение.help = Неопределено Тогда
		
		Если	СбисОсновнаяОшибка.Свойство("help") Тогда
			
			СбисИсключение.help = СбисОсновнаяОшибка.help;
			
		КонецЕсли;
		
	КонецЕсли;
		
	// В ошибке не своего стека, проинитим с добавлением основной ошибки в стек
	СбисИсключение_ДобавитьВСтек(СбисИсключение, СбисОсновнаяОшибка);
	
	// data от ошибки прокидывается на верхний уровень всегда.
	Если СбисИсключение.data = Неопределено Тогда
		
		СбисИсключение.data = СбисОсновнаяОшибка.data;
		
	КонецЕсли;
		
КонецПроцедуры
	
//DynamicDirective

// Функция - особенности генерации исключений для метода СБИС.ПрочитатьДокумент
//
// Параметры:
//  СбисИсключение	 - СбисИсключение	 - ошибка, полученная от БЛ
// 
// Возвращаемое значение:
//  СбисИсключение - после проверки с обновленным кодом.
//
Функция ПерегенерироватьСбисИсключение_ПрочитатьДокумент(СбисИсключение, ДопПараметры = Неопределено) Экспорт
	Перем ПараметрИзДоп, ИсключениеРезультат, РасширениеКод;

	ИсключениеРезультат = СбисИсключение_Пустое(СбисИсключение);
	ИсключениеРезультат.methodName = "МодульОбъектаКлиент.ПерегенерироватьСбисИсключение_ПрочитатьДокумент";
	ИсключениеРезультат.Вставить("stack", СоздатьКопиюОбъекта(СбисИсключение.stack));
	
	Если Лев(ИсключениеРезультат.details, 36) = "Не найден документ с идентификатором" Тогда
		
		ИсключениеРезультат.code = 779; // Не получен объект
		
	КонецЕсли;

	// Для прочитать документ есть документ 1С
	Если		ДопПараметры.Свойство("Основание", ПараметрИзДоп)
		И	Не	ПараметрИзДоп = Неопределено Тогда
		
		Если ДопПараметры.Черновик Тогда
			
			РасширениеКод = "002";
			ИсключениеРезультат.details	= "Отправка черновика невозможна. Необходимо очистить сопоставление и повторить попытку.";
			//ИсключениеРезультат.details	= ПрименитьФорматКСтроке("Для отправки документа {СтрШаблон}, необходимо очистить сопоставление.", ДопПараметры.Основание);
			
		Иначе
			
			РасширениеКод = "001";
			
		КонецЕсли;
		
		ДампРезультат				= Новый ФиксированнаяСтруктура("ИсходноеИсключение", СбисИсключение);
		ИсключениеРезультат.dump	= ДампРезультат;
		
	КонецЕсли; 
	
	ИсключениеРезультат.extCode	= РасширениеКод;
	ИсключениеРезультат.message	= СбисИсключение_СообщениеПоДополнительномуКоду(ИсключениеРезультат.code, ИсключениеРезультат.extCode);
	
	Если	Не ИсключениеРезультат.code		= СбисИсключение.code
		Или	Не ИсключениеРезультат.extCode	= СбисИсключение.extCode Тогда
		
		// Изменился код, обновить записи в стеке
		СбисИсключение_ДобавитьВСтек(ИсключениеРезультат, СбисИсключение);
		
	КонецЕсли;
	
	Возврат ИсключениеРезультат;
	
КонецФункции
						
//DynamicDirective

// Функция - возвращает пустое исключение
// 
// Возвращаемое значение:
//   - 
//
Функция СбисИсключение_Пустое(	СбисОснование = 100,			СбисСообщение = "Неизвестная ошибка системы",	СбисДетализация = Неопределено,
								СбисИмяКоманды = Неопределено,	СбисДанные = Неопределено,						РасширениеКода = Неопределено)

	НовыйИсключение = Новый Структура("_класс, code, message, details, methodName, dump, help, data, extCode, stack", "СбисИсключение");
	Если ТипЗнч(СбисОснование) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(НовыйИсключение, СбисОснование);
		НовыйИсключение.dump		= Неопределено; // dump от ошибки в виде структуры будет data
		
	Иначе
		
		НовыйИсключение.code		= СбисОснование;
		НовыйИсключение.message		= СбисСообщение;
		НовыйИсключение.details		= СбисДетализация;
		НовыйИсключение.data		= СбисДанные;
		НовыйИсключение.extCode		= РасширениеКода;
		НовыйИсключение.methodName	= СбисИмяКоманды;
		НовыйИсключение.stack		= Новый Массив;
		
	КонецЕсли;
	
	Если НовыйИсключение.details = Неопределено Тогда
		
		НовыйИсключение.details = НовыйИсключение.message;
		
	КонецЕсли;
	
	Возврат НовыйИсключение;

КонецФункции

//DynamicDirective

// Функция - возвращает пустое исключение
// 
// Возвращаемое значение:
//   - 
//
Функция СбисИсключение_ВСтроку(СбисИсключение, ДопПарамеры = Неопределено) Экспорт 

	Если	Не ТипЗнч(СбисИсключение) = Тип("Структура")
		Или Не СбисИсключение.Свойство("code") 
		Или Не СбисИсключение.Свойство("details") Тогда
		
		ИсключениеВСтроку = НовыйСбисИсключение(СбисИсключение, ДопПарамеры);
		
	Иначе
		
		ИсключениеВСтроку = СбисИсключение;
		
	КонецЕсли;
	
	#Если НаСервере Тогда
		
		Возврат СбисИсключение_ВСтрокуСервер(ИсключениеВСтроку, ДопПарамеры);
		
	#Иначе
		
		Возврат СбисИсключение_ВСтрокуВызовСервера(ИсключениеВСтроку, ДопПарамеры);
		
	#КонецЕсли

КонецФункции

//DynamicDirective

Процедура СбисИсключение_ДобавитьВСтек(СбисИсключение, ИсключениеДобавить)
	Перем СтарыйСбисСтек;
	
	СбисСтек = СбисИсключение.stack;
	
	СбисЗаписьВСтек = Новый Структура("methodName, code, extCode, message, dump, data");
	ЗаполнитьЗначенияСвойств(СбисЗаписьВСтек, ИсключениеДобавить);

	Если		ИсключениеДобавить.Свойство("method_Name") Тогда
		
		СбисЗаписьВСтек.methodName = ИсключениеДобавить.method_Name;
		
	ИначеЕсли	ИсключениеДобавить.Свойство("Action") Тогда
		
		СбисЗаписьВСтек.methodName = ИсключениеДобавить.Action;
		
	КонецЕсли;
	
	СбисСтек.Вставить(0, СбисЗаписьВСтек);
	Если	ИсключениеДобавить.Свойство("stack", СтарыйСбисСтек)
		И	ЗначениеЗаполнено(СтарыйСбисСтек) Тогда
		
		// Пробросить в конец элементы от старого стека
		Для Каждого ЭлементСтарогоСтека Из СтарыйСбисСтек Цикл
			
			СбисСтек.Добавить(ЭлементСтарогоСтека);
			
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры

//DynamicDirective

Функция СбисИсключение_ИзСтроки(СтрокаСбисИсключение, ДопПарамеры = Неопределено) Экспорт 

	#Если НаСервере Тогда
		
		Возврат СбисИсключение_ИзСтрокиСервер(СтрокаСбисИсключение, ДопПарамеры);

	#Иначе
		
		Возврат СбисИсключение_ИзСтрокиВызовСервера(СтрокаСбисИсключение, ДопПарамеры);
		
	#КонецЕсли
	
КонецФункции

//DynamicDirective

Функция СбисИсключение_ПрочитатьJSON(СбисИсключение) 
	
	#Если НаСервере Тогда
		
		Возврат сбисПрочитатьJSON(СбисИсключение);
		
	#Иначе
		
		Возврат СбисРаботаСJSON.сбисПрочитатьJSON(СбисИсключение);
		
	#КонецЕсли
	
КонецФункции

//DynamicDirective

// Функция - генерирует ExtSysException из информации об ошибке
//
// Параметры:
//  ВыбранныйИнформацияОбОшибке	 - ИнформацияОбОшибке	 - вызванное исключение, которое не является запакованным ExtSysException
// 
// Возвращаемое значение:
//  Структура - ExtSysException
//
Функция СбисИсключение_ИнформацияОбОшибке(БазоваяОшибка, ГенерируемоеИсключение)
	
	Если	ТипЗнч(БазоваяОшибка.Описание) = Тип("Строка")
		И	Лев(БазоваяОшибка.Описание, 5) = "{""#""," Тогда
		
		Попытка
			
			ВосстановленноеИсключение = СбисИсключение_ИзСтроки(БазоваяОшибка.Описание);
			
			Если ЭтоТипСбис(ВосстановленноеИсключение, "СбисИсключение") Тогда
				
				НовоеИсключение = ВосстановленноеИсключение;
				
			Иначе
				
				НовоеИсключение = СбисИсключение_Пустое(ВосстановленноеИсключение);
				
			КонецЕсли;
			
			НовоеИсключение.dump = НовыйДампОшибки(БазоваяОшибка);
			
			Возврат НовоеИсключение;
			
		Исключение
			
			//Это не завёрнутый ExtSysException, дальше разбираем как 1С-ное исключение
		
		КонецПопытки;
			
	КонецЕсли;

    Возврат СбисИсключение_ИнформацияОбОшибке_ЗаполнитьНаОсновании(БазоваяОшибка, ГенерируемоеИсключение);
	
КонецФункции 

//DynamicDirective

// Функция - гадание на кофейной гуще для стартового определения кода, если ловим 1С-ное исключение.
//
// Параметры:
//  СообщениеОбОшибке	 - Строка				 - сообщение ошибки
//  ДетализацияОшибки	 - Строка				 - детализация ошибки
//  ПредполагаемыйКод	 - Число/Неопределено	 - код предполагаемой ошибки, требующий уточнения
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - основной код и расширение
//
Функция СбисИсключение_ОпределитьКодыПоСообщениям(ОснованиеОшибки, ДетализацияДоп = Неопределено, КодДоп = Неопределено)
	Перем КодРасширения;
	
	КодНовогоИсключения	= 500;
	
	Если ЭтоТипСбис(ОснованиеОшибки, "СбисИсключение") Тогда
		
		СообщениеОбОшибке = ОснованиеОшибки.message;
		ДетализацияОшибки = ОснованиеОшибки.details;
		ПредполагаемыйКод = ОснованиеОшибки.code;
		
	Иначе
		
		СообщениеОбОшибке = ОснованиеОшибки;
		ДетализацияОшибки = ДетализацияДоп;
		ПредполагаемыйКод = КодДоп;
		
	КонецЕсли;
	
	Если ПредполагаемыйКод = 300 Тогда
		
		КодНовогоИсключения = ПредполагаемыйКод;
		Если Найти(ДетализацияОшибки, "SSL connect error") Тогда
			
			КодНовогоИсключения	= 301;
			КодДоп				= 301;
			КодРасширения		= 101;
			
		КонецЕсли;
		
	ИначеЕсли ПредполагаемыйКод = 710 Тогда
		
		Если Найти(СообщениеОбОшибке, "Отсустствуют активные этапы") Тогда
			
			КодНовогоИсключения	= ПредполагаемыйКод;
			КодРасширения		= 101;
			
		КонецЕсли;
		
	ИначеЕсли ПредполагаемыйКод = 719 Тогда
		
		КодНовогоИсключения = ПредполагаемыйКод;
		Если	Найти(ДетализацияОшибки, "отменено") Тогда
			
			КодРасширения		= 104;
			
		КонецЕсли;
		
	ИначеЕсли ПредполагаемыйКод = 747 Тогда
		
		КодНовогоИсключения = ПредполагаемыйКод;
		Если	(	Найти(ДетализацияОшибки, "Отсутствует")
				Или Найти(ДетализацияОшибки, "не удалось получить"))
			И	Найти(ДетализацияОшибки, "ини файл") Тогда
			
			КодРасширения		= 200;
			
		КонецЕсли;

	ИначеЕсли ПредполагаемыйКод = 770 Тогда
		
		Если Найти(СообщениеОбОшибке, НСтр("ru = 'ЗагрузитьТаблицуСтилейXSLИзСтроки' en = 'LoadXSLStylesheetFromString'")) Тогда
			
			КодНовогоИсключения = ПредполагаемыйКод;
			КодРасширения		= 101;
			
		КонецЕсли;	
		
	ИначеЕсли ПредполагаемыйКод = 765 Тогда
		
		Если Найти(ДетализацияОшибки, "СпособСопоставленияНоменклатуры") Тогда
		
			КодНовогоИсключения = ПредполагаемыйКод;
			КодРасширения = 101;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если КодРасширения = Неопределено Тогда
		
		Если		Найти(ДетализацияОшибки, "ODBC")
			И	 Не Найти(ДетализацияОшибки, "dbf' уже существует") Тогда
				
			КодНовогоИсключения	= 776;
			КодРасширения		= 101;
			
		ИначеЕсли ДетализацияОшибки = "Не подключен файл статусов DBF." Тогда
			
			КодНовогоИсключения	= 753;
			КодРасширения		= 101;
			
		ИначеЕсли Найти(ДетализацияОшибки, "Недостаточно прав") Тогда
			
			КодНовогоИсключения	= 753;
			Если Найти(ОснованиеОшибки, "(Выполнить)") Тогда
				
				КодРасширения = 101;
				
			КонецЕсли;

		ИначеЕсли Найти(ДетализацияОшибки, "Тип не определен") Тогда
			
			КодНовогоИсключения	= 612;
			
		ИначеЕсли Найти(ДетализацияОшибки, "евозможно расшифровать файл") Тогда
	
			КодНовогоИсключения	= 735;
			КодРасширения		= 101;
			
		КонецЕсли;
		
	КонецЕсли;

	Если КодРасширения = Неопределено Тогда
		
		Если		КодНовогоИсключения = 500
			И	Не	ПредполагаемыйКод = 100
			И	Не	ПредполагаемыйКод = Неопределено Тогда
			
			// Не удалось определить код, но при этом предполагаемый код не дефолтный. Установить его как результат
			КодНовогоИсключения = ПредполагаемыйКод;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура("code, extCode", КодНовогоИсключения, КодРасширения);
	
КонецФункции

//DynamicDirective

// Функция - генерирует ExtSysException из информации об ошибке
//
// Параметры:
//  ВыбранныйИнформацияОбОшибке	 - ИнформацияОбОшибке	 - вызванное исключение, которое не является запакованным ExtSysException
// 
// Возвращаемое значение:
//  Структура - ExtSysException
//
Функция СбисИсключение_ИнформацияОбОшибке_ЗаполнитьНаОсновании(БазоваяОшибка, ГенерируемоеИсключение)
	Перем СообщениеОбОшибке;
	
	СложнаяСтруктура		= Ложь;
	КодНовогоИсключения		= 500;
	
	СтруктураОшибкиСообщения = БазоваяОшибка;
	Пока ТипЗнч(СтруктураОшибкиСообщения.Причина) = Тип("ИнформацияОбОшибке") Цикл
		СтруктураОшибкиСообщения = СтруктураОшибкиСообщения.Причина;
		СложнаяСтруктура = Истина;
	КонецЦикла;
	
	Если СложнаяСтруктура Тогда
		
		СообщениеОбОшибке	= БазоваяОшибка.Описание;
		ДетализацияОшибки	= СтруктураОшибкиСообщения.Описание;
		
	ИначеЕсли БазоваяОшибка.Причина = Неопределено Тогда
		
		ДетализацияОшибки	= БазоваяОшибка.Описание;
		
	Иначе
		
		СообщениеОбОшибке	= БазоваяОшибка.Описание;
		ДетализацияОшибки	= БазоваяОшибка.Причина;
		
	КонецЕсли;
	
	КодыНовогоИсключения = СбисИсключение_ОпределитьКодыПоСообщениям(СообщениеОбОшибке, ДетализацияОшибки, ГенерируемоеИсключение.code);
	
	Если ЗначениеЗаполнено(КодыНовогоИсключения.extCode) Тогда
		
		// Сообщение должно быть установлено по кодам
		СообщениеОбОшибке = Неопределено;
		
	ИначеЕсли	КодыНовогоИсключения.code = 776 Тогда
		
		СообщениеОбОшибке = ДетализацияОшибки;
		
	ИначеЕсли	КодыНовогоИсключения.code	= 717 Тогда
		
		ДетализацияОшибки	= СообщениеОбОшибке + " " + ДетализацияОшибки;
		СообщениеОбОшибке	= Неопределено;	
		
	КонецЕсли;

	СбисОсновнаяОшибка = СбисИсключение_Пустое(	КодыНовогоИсключения.code, СообщениеОбОшибке, ДетализацияОшибки,
												БазоваяОшибка.ИмяМодуля,, КодыНовогоИсключения.extCode);
												
	СбисОсновнаяОшибка.dump	= НовыйДампОшибки(БазоваяОшибка, ДетализацияОшибки);
	СбисОсновнаяОшибка.help	= СбисИсключение_РешениеПроблемыПоИсключению(СбисОсновнаяОшибка);												
	Если ЗначениеЗаполнено(КодыНовогоИсключения.extCode) Тогда
		
		СбисОсновнаяОшибка.message	= СбисИсключение_ТекстСообщения(СбисОсновнаяОшибка);
		
	КонецЕсли;
	
	Возврат СбисОсновнаяОшибка;
	
КонецФункции
	
//DynamicDirective

Функция СбисИсключение_ТекстСообщения(СбисИсключение)
	
	Если ЗначениеЗаполнено(СбисИсключение.extCode) Тогда
		
		Возврат СбисИсключение_СообщениеПоДополнительномуКоду(СбисИсключение.code, СбисИсключение.extCode);
		
	КонецЕсли;
	
	Возврат СбисИсключение_СообщениеПоКоду(СбисИсключение.code);
	
КонецФункции

//DynamicDirective

// Функция - возвращает текст сообщения по коду https://wiki.razgovorov.ru/index.php/Коды_ошибок 
//
// Параметры:
//  СбисКодОшибки	 - Число	 - код ошибки
// 
// Возвращаемое значение:
//  Строка - текст ошибки по коду
//
Функция СбисИсключение_СообщениеПоКоду(СбисКодОшибки) Экспорт
	Если		СбисКодОшибки = 100 Тогда
		Возврат "Неизвестная ошибка системы";
	ИначеЕсли	СбисКодОшибки = 300 Тогда
		Возврат "Неизвестная ошибка БЛ";
	ИначеЕсли	СбисКодОшибки = 301 Тогда
		Возврат "Сервис Saby.Диск временно недоступен"; 
	ИначеЕсли	СбисКодОшибки = 302 Тогда
		Возврат "Сайт на техническом обслуживании. Повторите попытку позднее";  
	ИначеЕсли	СбисКодОшибки = 303 Тогда	
		Возврат "Аутентификация не выполнена. Требуется подтверждение действия";
	ИначеЕсли	СбисКодОшибки = 304 Тогда
		Возврат "Фатальная ошибка при аутентификации";
	ИначеЕсли	СбисКодОшибки = 305 Тогда
		Возврат "Аутентификация не выполнена. Неправильные логин/пароль.";
	ИначеЕсли	СбисКодОшибки = 310 Тогда
		Возврат "Фатальная ошибка входных параметров";
	ИначеЕсли	СбисКодОшибки = 315 Тогда
		Возврат "Фатальная ошибка криптографии";
	ИначеЕсли	СбисКодОшибки = 320 Тогда
		Возврат "Фатальная ошибка модуля работы с формализованными документами";
	ИначеЕсли 	СбисКодОшибки = 325 Тогда
		Возврат "Фатальная ошибка запуска в документооборот"; 
	ИначеЕсли 	СбисКодОшибки = 330 Тогда
		Возврат "Фатальная ошибка поиска абонентского ящика";
	ИначеЕсли 	СбисКодОшибки = 335 Тогда
		Возврат "Фатальная ошибка лицензирования";
	ИначеЕсли 	СбисКодОшибки = 340 Тогда
		Возврат "Фатальная ошибка ФЛК.";
	ИначеЕсли 	СбисКодОшибки = 346 Тогда
		Возврат "Невозможно выполнить преобразование."; 
	ИначеЕсли 	СбисКодОшибки = 350 Тогда
		Возврат "Неизвестная нефатальная ошибка БЛ";
	ИначеЕсли 	СбисКодОшибки = 355 Тогда
		Возврат "Неизвестная ошибка внутреннего сервиса";	
	ИначеЕсли 	СбисКодОшибки = 356 Тогда
		Возврат "Запрос обрабатывается. Повторите позже";
	ИначеЕсли 	СбисКодОшибки = 357 Тогда
		Возврат "Нефатальная ошибка аутентификации.";
	ИначеЕсли	СбисКодОшибки = 400 Тогда
		Возврат "Неизвестная ошибка Saby Плагина";
	ИначеЕсли	СбисКодОшибки = 412 Тогда
		Возврат	"Работа Saby Плагин остановлена";
	ИначеЕсли	СбисКодОшибки = 409 Тогда
		Возврат "Сеанс с учетной системой завершен";
	ИначеЕсли	СбисКодОшибки = 500 Тогда
		Возврат "Неизвестная ошибка клиента";
	ИначеЕсли	СбисКодОшибки = 600 Тогда
		Возврат "Неизвестная ошибка настроек";
	ИначеЕсли	СбисКодОшибки = 604 Тогда
		Возврат "Ошибка получения данных из ИС";
	ИначеЕсли	СбисКодОшибки = 608 Тогда
		Возврат "Некорректное описание параметра в файле настроек";
	ИначеЕсли	СбисКодОшибки = 610 Тогда
		Возврат "Отсутствует файл настроек для данного типа данных";		
	ИначеЕсли	СбисКодОшибки = 612 Тогда
		Возврат "Не удалось определить тип ИС";		
	ИначеЕсли	СбисКодОшибки = 700 Тогда
		Возврат "Неизвестная ошибка подключения"; 
	ИначеЕсли 	СбисКодОшибки = 702 Тогда
		Возврат "Неверно указано имя пользователя или пароль";
	ИначеЕсли	СбисКодОшибки = 703 Тогда
		Возврат "Ошибка создания подключения к ИС";
	ИначеЕсли	СбисКодОшибки = 709 Тогда
		Возврат "Ошибка в ограничении доступа к данным";
	ИначеЕсли	СбисКодОшибки = 710 Тогда
		Возврат "Ошибка блокировки данных";
	ИначеЕсли	СбисКодОшибки = 717 Тогда
		Возврат "Несовместимая версия файла базы данных";
	ИначеЕсли	СбисКодОшибки = 719 Тогда
		Возврат "Ошибка интерфейса";
	ИначеЕсли	СбисКодОшибки = 721 Тогда
		Возврат "Неверно указан ИНН";
	ИначеЕсли	СбисКодОшибки = 723 Тогда
		Возврат "Идентификатор пакета не определен";
	ИначеЕсли	СбисКодОшибки = 724 Тогда
		Возврат "Организация неопределена";
	ИначеЕсли	СбисКодОшибки = 726 Тогда
		Возврат "Вложения неопределены";
	ИначеЕсли	СбисКодОшибки = 729 Тогда
		Возврат "Ошибка ФЛК";
	ИначеЕсли	СбисКодОшибки = 735 Тогда
		Возврат "Данная операция недоступна";
	ИначеЕсли	СбисКодОшибки = 744 Тогда
		Возврат "Ошибка записи или чтения 1С";
	ИначеЕсли	СбисКодОшибки = 747 Тогда
		Возврат "Ошибка файлов настроек";
	ИначеЕсли	СбисКодОшибки = 755 Тогда
		Возврат "Не найден сертификат ЭП";
	ИначеЕсли	СбисКодОшибки = 756 Тогда
		Возврат "Подключение недоступно";
	ИначеЕсли	СбисКодОшибки = 759 Тогда
		Возврат "Невозможно соединиться с удаленным сервером";
	ИначеЕсли	СбисКодОшибки = 760 Тогда
		Возврат "Неверные параметры фильтра";
	ИначеЕсли	СбисКодОшибки = 762 Тогда
		Возврат "Версия системы не поддерживается";
	ИначеЕсли	СбисКодОшибки = 765 Тогда
		Возврат "Значение не найдено в таблице настроек";
	ИначеЕсли	СбисКодОшибки = 767 Тогда
		Возврат "Ошибка при создании объекта";
	ИначеЕсли	СбисКодОшибки = 770 Тогда
		Возврат "Ошибка XSLT";
	ИначеЕсли	СбисКодОшибки = 772 Тогда
		Возврат "Ошибка работы с файловой системой";
	ИначеЕсли	СбисКодОшибки = 773 Тогда
		Возврат "Неизвестная ошибка при выполнении метода";	
	ИначеЕсли	СбисКодОшибки = 775 Тогда
		Возврат "Не получен ответ от SABY плагина";	
	ИначеЕсли	СбисКодОшибки = 776 Тогда
		Возврат "Запуск программы/функции/метода не удался";	
	ИначеЕсли	СбисКодОшибки = 779 Тогда
		Возврат "Не найден объект";	
	ИначеЕсли	СбисКодОшибки = 780 Тогда
		Возврат "Не заполнено обязательное поле";
	ИначеЕсли 	СбисКодОшибки = 784 Тогда
		Возврат "Ошибка в настройках соединения";
	ИначеЕсли 	СбисКодОшибки = 785 Тогда
		Возврат "Ошибка во входящих данных";
	ИначеЕсли	СбисКодОшибки = 790 Тогда
		Возврат "Обработка прервана пользователем"
	КонецЕсли;
	Возврат "Неизвестная ошибка системы";
КонецФункции

//DynamicDirective

Функция СбисИсключение_СообщениеПоДополнительномуКоду(ОсновнойКодОшибки, ДополнительныйКодОшибки) Экспорт
	
	Если ОсновнойКодОшибки = 301 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Ошибка работы с защищенным соединением.";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 710 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Отсустствуют активные этапы для запуска в документооборот";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 717 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Ошибка подключения файла статусов DBF.";
		
		КонецЕсли;

	ИначеЕсли ОсновнойКодОшибки = 719 Тогда
		
		Если ДополнительныйКодОшибки = 104 Тогда
			
			Возврат "Действие отменено";
		
		КонецЕсли;

	ИначеЕсли ОсновнойКодОшибки = 735 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Работа с зашифрованными файлами не поддерживается на текущем способе обмена.";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 747 Тогда
		
		Если ДополнительныйКодОшибки = 200 Тогда
			
			Возврат "Отсутствует ини файл";
		
		КонецЕсли;

	ИначеЕсли ОсновнойКодОшибки = 753 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Недостаточно прав для выполнения запроса.";
		
		КонецЕсли;

	ИначеЕсли ОсновнойКодОшибки = 765 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Ошибка установки пользовательского параметра.";
		
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 776 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Возникла проблема при работе с COM-объектом «ADODB.Connection";

		КонецЕсли;		

	ИначеЕсли ОсновнойКодОшибки = 779 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Не удалось прочитать документ. Возможно, что он недоступен для Вашего пользователя, или был удален.";
			
		ИначеЕсли ДополнительныйКодОшибки = 102 Тогда
			
			Возврат "Ошибка отправки черновика. Возможно, документ был сопоставлен некорректно, или был удален.";
			
		КонецЕсли;
		
	ИначеЕсли ОсновнойКодОшибки = 770 Тогда
		
		Если ДополнительныйКодОшибки = 101 Тогда
			
			Возврат "Не удалось загрузить описание преобразования XSL из строки.";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СбисИсключение_СообщениеПоКоду(ОсновнойКодОшибки);
	
КонецФункции

//DynamicDirective

// Функция - возвращает код ошибки https://wiki.razgovorov.ru/index.php/Коды_ошибок по https://saby.ru/help/integration/api/error_code
//
// Параметры:
//  СбисКодОшибки	 - Строка	 - код ошибки Warning
// 
// Возвращаемое значение:
//  Число - коду ошибки
//
Функция СбисИсключение_КодПоAPIСБИС(КодApiSBIS) Экспорт

	КодApiSBIS_Полный	= ВРег(КодApiSBIS);
	КодApiSBIS_33		= Лев(КодApiSBIS_Полный, 33);
	КодApiSBIS_28		= Лев(КодApiSBIS_Полный, 28);
	

	Если КодApiSBIS_Полный = "{В-0000-1AA0000F1002}" Тогда
		Возврат 710;   
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000001002}" Тогда
		Возврат 303; 
	ИначеЕсли	КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000001000}" Тогда
		Возврат 304;
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA000001001}" Тогда
		Возврат 305;
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1FA0000A0001}" Тогда
		Возврат 346; 
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1AA0000F1002}" Тогда
		Возврат 356; 
	ИначеЕсли   КодApiSBIS_Полный = "{00000000-0000-0000-0000-1AA000001000}" Тогда
		Возврат 357; 
		
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA00001" Тогда
		Возврат 310;
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA00002" Тогда
		Возврат 315;
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA00003" Тогда
		Возврат 320;
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA00004" Тогда
		Возврат 325; 
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA00008" Тогда
		Возврат 330;
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA0000D" Тогда
		Возврат 335;
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1FA0000F" Тогда
		Возврат 340;
	ИначеЕсли   КодApiSBIS_33 = "{00000000-0000-0000-0000-1AA00001" Тогда
		Возврат 355;	
	ИначеЕсли   КодApiSBIS_28 = "{00000000-0000-0000-0000-1AA" Тогда
		Возврат 350; 		
	Иначе
		Возврат 100;
	КонецЕсли;
КонецФункции
	
//DynamicDirective

// Функция - генерирует ExtSysException из информации об ошибке
//
// Параметры:
//  ВыбранныйИнформацияОбОшибке	 - ИнформацияОбОшибке	 - вызванное исключение, которое не является запакованным ExtSysException
// 
// Возвращаемое значение:
//  Структура - ExtSysException
//
Функция СбисИсключение_РешениеПроблемыПоИсключению(СбисИсключение)
	
	Если СбисИсключение.code = 301 Тогда
		
		Если СбисИсключение.extCode  = 101 Тогда
			
			Возврат "https://saby.ru/help/integration/1C_set/modul/typical_errors/internet_error";
			
		КонецЕсли;
		
	ИначеЕсли СбисИсключение.code = 735 Тогда

		Если	СбисИсключение.extCode = 101 Тогда
			
			Возврат "https://saby.ru/help/integration/1C_set/modul/exchange";
			
		КонецЕсли;

	ИначеЕсли СбисИсключение.code = 776 Тогда
		
		Если	СбисИсключение.extCode = 101 Тогда
			
			Возврат "https://saby.ru/help/integration/catalog/driver_not_found";
			
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

//DynamicDirective

// Функция - генерирует ExtSysException из строки
//
// Параметры:
//  БазоваяОшибка	 - Строка	 - исключение, которое может быть сериализованнйо в JSON строкой, либо просто сообщением.
// 
// Возвращаемое значение:
//  Структура - ExtSysException
//
Функция СбисИсключение_Строка(БазоваяОшибка)
    Перем СтрокаРазбора, ДампОшибки, ДампДетализация, ДампИмяМодуля, ДампНомерСтроки, ДампИсходнаяСтрока;
	
	Если Лев(БазоваяОшибка, 1) = "{" Тогда
		
		//Это JSON - объект с ошибкой
		СтрокаРазбора = БазоваяОшибка;
		
	ИначеЕсли	Лев(БазоваяОшибка,35) = "callBLObject(): Метод бизнес логики"
		И		Найти(БазоваяОшибка,"вернул ошибку") Тогда
		
		ИмяМодуля		= СтрЗаменить(БазоваяОшибка, "callBLObject(): Метод бизнес логики", Символы.ПС);
		ИмяМодуля		= СтрЗаменить(БазоваяОшибка, "вернул ошибку", Символы.ПС);
		
		//Это ошибка от БЛ в формате JSON
		СтрокаРазбора	= Сред(БазоваяОшибка, Найти(БазоваяОшибка,"{"));
		СтрокаРазбора	= Лев(СтрокаРазбора, СтрДлина(СтрокаРазбора)-1);
		
		ДампДетализация		= Лев(БазоваяОшибка, Найти(БазоваяОшибка,"{") - 1);
		ДампИмяМодуля		= СтрПолучитьСтроку(ИмяМодуля, 2);
		ДампИмяМодуля		= "Saby." + ИмяМодуля;
		ДампИсходнаяСтрока	= "callBLObject(): Метод бизнес логики " + ИмяМодуля + "вернул ошибку";
		ДампОшибки			= НовыйДампОшибки(, ДампДетализация, ДампИсходнаяСтрока,  ДампНомерСтроки, ДампИмяМодуля);
		
		
	ИначеЕсли Найти(БазоваяОшибка, "{""jsonrpc"":") Тогда
		
		//Это ошибка от БЛ в формате JSON
		НачалоТелаСтроки	= Найти(БазоваяОшибка,"{""jsonrpc"":");
		СтрокаРазбора		= Сред(БазоваяОшибка, НачалоТелаСтроки);
		ДампДетализация		= Лев(БазоваяОшибка, НачалоТелаСтроки - 1);
		ДампИсходнаяСтрока	= "{""jsonrpc"":";
		ДампОшибки			= НовыйДампОшибки(, ДампДетализация, ДампИсходнаяСтрока,  ДампНомерСтроки, ДампИмяМодуля);
		
	КонецЕсли;
	
	Если СтрокаРазбора = Неопределено Тогда
		
		//Это сообщение неизвестной ошибки.
		СбисОсновнаяОшибка = СбисИсключение_Пустое(,БазоваяОшибка);
		
	Иначе
		
		Попытка
			
			СбисОшибкаИзJSON = СбисИсключение_ПрочитатьJSON(СтрокаРазбора);
			Если СбисОшибкаИзJSON.Свойство("Error") Тогда
				
				СбисОшибкаИзJSON = СбисОшибкаИзJSON.Error;
				
			КонецЕсли;
			
			СбисОсновнаяОшибка = СбисИсключение_Пустое(СбисОшибкаИзJSON);
			
			
		Исключение
			
			СбисОсновнаяОшибка = СбисИсключение_Пустое(,БазоваяОшибка);
			
		КонецПопытки;
		
	КонецЕсли; 

	СбисОсновнаяОшибка.dump	= ДампОшибки;
	
	Возврат СбисОсновнаяОшибка;
	
КонецФункции	

//DynamicDirective

Функция СбисИсключение_Число(БазоваяОшибка)
	
	СбисОсновнаяОшибка = СбисИсключение_Пустое(БазоваяОшибка, СбисИсключение_СообщениеПоКоду(БазоваяОшибка));
    Возврат СбисОсновнаяОшибка;
	
КонецФункции

//DynamicDirective

// Функция - генерирует ExtSysException из структуры
//
// Параметры:
//  БазоваяОшибка	 - Строка	 - исключение, которое может быть сериализованнйо в JSON строкой, либо просто сообщением.
// 
// Возвращаемое значение:
//  Структура - ExtSysException
//
Функция СбисИсключение_Структура(БазоваяОшибка, ГенерируемоеИсключение)
    Перем ДампОшибки, ДампДетализация, ДампИмяМодуля, ДампНомерСтроки, ДампИсходнаяСтрока;
	
	Если ЭтоТипСбис(БазоваяОшибка, "SbisWarning") Тогда
		
		СбисОсновнаяОшибка			= СбисИсключение_Пустое(БазоваяОшибка);
		СбисОсновнаяОшибка.details	= БазоваяОшибка.message;
		ДампИсходнаяСтрока			= БазоваяОшибка.data.classid;
		ДампИмяМодуля				= "Saby.Warning";
		СбисОсновнаяОшибка.code		= СбисИсключение_КодПоAPIСБИС(ВРег(ДампИсходнаяСтрока));

		Если	БазоваяОшибка.Свойство("details", ДампДетализация)
			И	СбисОсновнаяОшибка.code = 100
			И	Лев(ДампДетализация, "1") = "{" Тогда
			
			// Не удалось определить ошибку по ClsID БЛ, проверить наличие запакованного ExtException.
			ЗапакованнаяОшибка = СбисПрочитатьJSON(ДампДетализация);
			Если ЭтоТипСбис(ЗапакованнаяОшибка, "ExtException") Тогда
				
				СбисОсновнаяОшибка.code		= ЗапакованнаяОшибка.code;
				СбисОсновнаяОшибка.message	= ЗапакованнаяОшибка.message;
				ДампДетализация				= ЗапакованнаяОшибка.detail;
				ДампИмяМодуля				= "Integration.ExtException";

				БазоваяОшибка = ЗапакованнаяОшибка;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если БазоваяОшибка.Свойство("stack") Тогда
			
			СбисОсновнаяОшибка.Вставить("stack", БазоваяОшибка.stack);
			
		КонецЕсли;
		
		СбисОсновнаяОшибка.dump = НовыйДампОшибки(, ДампДетализация, ДампИсходнаяСтрока, ДампНомерСтроки, ДампИмяМодуля);
		
	ИначеЕсли ЭтоТипСбис(БазоваяОшибка, "СоставПакета") Тогда	
		
		// Оборачивание ошибок типа Документ СБИС. Возможно, вынести в отдельную функцию.
		КодыНовогоИсключения	= СбисИсключение_ОпределитьКодыПоСообщениям(ГенерируемоеИсключение);
		ТекстОшибки				= СбисИсключение_СообщениеПоДополнительномуКоду(КодыНовогоИсключения.code, КодыНовогоИсключения.extCode);
		СбисОсновнаяОшибка		= СбисИсключение_Пустое(КодыНовогоИсключения.code, ТекстОшибки,,,,КодыНовогоИсключения.extCode);
		
	ИначеЕсли	БазоваяОшибка.Свойство("code")
			И	БазоваяОшибка.Свойство("detail") Тогда
			
		// Это ошибка плагина, модуля (ExtSDK2)
		СбисОсновнаяОшибка = СбисИсключение_Пустое(БазоваяОшибка);
		СбисОсновнаяОшибка.details = БазоваяОшибка.detail;
		Если БазоваяОшибка.Свойство("dump") Тогда
			
			// Переложить дамп ошибки в data, т.к. для плагина это оно и есть
			СбисОсновнаяОшибка.data = БазоваяОшибка.dump;

		КонецЕсли;
					
		Если БазоваяОшибка.Свойство("method_name") Тогда
			
			СбисОсновнаяОшибка.methodName = БазоваяОшибка.method_name;

		КонецЕсли;

	Иначе
		
		СбисОсновнаяОшибка = СбисИсключение_Пустое(БазоваяОшибка);
		
	КонецЕсли;
	
	Возврат СбисОсновнаяОшибка;
	
КонецФункции

//DynamicDirective
Функция СбисИсключение_Соответствие(БазоваяОшибка)
		
	СбисОсновнаяОшибка = СбисИсключение_Пустое(); 
	Источник = БазоваяОшибка; 
	Если Источник["Error"] <> Неопределено Тогда
		Источник = БазоваяОшибка["Error"]; 
	КонецЕсли;	
	Для Каждого КлючОшибки Из СбисОсновнаяОшибка Цикл
		СбисОсновнаяОшибка[КлючОшибки.Ключ] = Источник[КлючОшибки.Ключ];	
	КонецЦикла;	
	
	Если СбисОсновнаяОшибка.details = Неопределено Тогда
		СбисОсновнаяОшибка.Вставить("details",Источник["detail"]);	
	КонецЕсли;
	
	Возврат СбисОсновнаяОшибка;
	
КонецФункции

// Функция - перегенерирует ошибку на основании ТОЛЬКО входящих параметров, когда базовая ошибка в конструкторе была неопределена
//
// Параметры:
//  БазоваяОшибка	 - СбисИсключение	 - Класс, заполнененный теми параметрами, что пришли на вход в конструктор и которые нужно проверить
// 
// Возвращаемое значение:
//  СбисИсключение - готовое исключение с уточненным сценарием, текстами и ссылкой на решение
//
//DynamicDirective
Функция СбисИсключение_ПоВходнымПараметры(БазоваяОшибка)

	КодыНовогоИсключения	= СбисИсключение_ОпределитьКодыПоСообщениям(БазоваяОшибка.message, БазоваяОшибка.details, БазоваяОшибка.code);
	СбисОсновнаяОшибка		= СбисИсключение_Пустое(КодыНовогоИсключения.code,
													СбисИсключение_СообщениеПоДополнительномуКоду(КодыНовогоИсключения.code, КодыНовогоИсключения.extCode),
													БазоваяОшибка.details,
													БазоваяОшибка.methodName,,КодыНовогоИсключения.extCode);
	СбисОсновнаяОшибка.help	= СбисИсключение_РешениеПроблемыПоИсключению(СбисОсновнаяОшибка);												
	СбисОсновнаяОшибка.dump = НовыйДампОшибки(БазоваяОшибка);
	
	Возврат СбисОсновнаяОшибка;
	
КонецФункции

