
&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыСообщения)
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ТихийРежим") Тогда 
		Возврат;
	КонецЕсли;
	
	ПредупреждениеАдресСсылка		= ?(ПараметрыСообщения.Свойство("АдресСсылка"), ПараметрыСообщения.АдресСсылка, "");
	ПредупреждениеСсылка			= ?(ПараметрыСообщения.Свойство("ТекстСсылка"), ПараметрыСообщения.ТекстСсылка, "");
	ПредупреждениеСтруктураОшибки 	= ?(ПараметрыСообщения.Свойство("СтруктураОшибки"), ПараметрыСообщения.СтруктураОшибки, "");
	ПредупреждениеТекстЭлемент 	= Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма,"ПредупреждениеТекст");
	ПредупреждениеТекстЭлемент.Заголовок  = ПараметрыСообщения.Текст;
	
КонецПроцедуры

