
&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыСообщения)
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ТихийРежим") Тогда 
		Возврат;
	КонецЕсли;
	
	ПредупреждениеАдресСсылка		= ?(ПараметрыСообщения.Свойство("АдресСсылка"),		ПараметрыСообщения.АдресСсылка, "");
	ПредупреждениеСтруктураОшибки 	= ?(ПараметрыСообщения.Свойство("СтруктураОшибки"),	ПараметрыСообщения.СтруктураОшибки, "");
	
	Если ЗначениеЗаполнено(ПредупреждениеСтруктураОшибки) Тогда
		
		РешениеПроблемыОписание = МодульОбъектаКлиент().Saby_ExtException_Get(ПараметрыСообщения.СтруктураОшибки, "hint");
		ПредупреждениеСсылка	= РешениеПроблемыОписание.text;
		
	Иначе	
		
		ПредупреждениеСсылка	= "";
		
	КонецЕсли;
	
	ПредупреждениеТекстЭлемент = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПредупреждениеТекст");
	ПредупреждениеТекстЭлемент.Заголовок  = ПараметрыСообщения.Текст;
	
КонецПроцедуры

