
&НаКлиенте
Процедура СтатистикаSABY_ОбработатьАутентификацию(ПараметрыСтатистики, Результат)
	
	РезультатОтправки = ПараметрыСтатистики.РезультатОтправки;
    ДетальноеСообщение = ПараметрыСтатистики.ДетальноеСообщение;
    ПараметрыСообщения = Новый Структура("count, action_param, action_name, name_integration, Прикладная", 
	1, ДетальноеСообщение, "Аутентификация", "Auth", РезультатОтправки.ПрикладнаяСтатистика);
    НовоеСообщение = СтатистикаSABY_СформироватьСтатистикуДляIntegration(ПараметрыСообщения);
    Результат.Сообщения.Добавить(НовоеСообщение);   
	
КонецПроцедуры   

