
&НаКлиенте
Процедура СтатистикаSABY_ОбработатьЗагрузку(ПараметрыСтатистики, Результат)
	
	РезультатОтправки = ПараметрыСтатистики.Результат;
    Если ПараметрыСтатистики.Результат.Всего.Выполнено Тогда
        ПараметрыСообщения = Новый Структура("count, action_param, action_name, name_integration, Прикладная", 
            ПараметрыСтатистики.Результат.Всего.Выполнено, ПараметрыСтатистики.ИмяРеестра, "Загрузка", "Export", РезультатОтправки.ПрикладнаяСтатистика);
        НовоеСообщение = СтатистикаSABY_СформироватьСтатистикуДляIntegration(ПараметрыСообщения);
        Результат.Сообщения.Добавить(НовоеСообщение);
    КонецЕсли;
    
    Для Каждого ОшибкаЗагрузки Из ПараметрыСтатистики.Результат.Ошибки.ДетализацияОшибок Цикл
        СтатистикаSABY_ОбработатьОшибкиЗагрузки(ОшибкаЗагрузки, ПараметрыСтатистики, Результат);
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Функция СтатистикаSABY_ОбработатьОшибкиЗагрузки(ОшибкаЗагрузки, ПараметрыСтатистики, Результат)
	
	РезультатОтправки = ПараметрыСтатистики.Результат;
    ПараметрыСообщения = Новый Структура("count, code, action_param, action_name, error_name, error_detail, Прикладная", 
        1, 100, ПараметрыСтатистики.ИмяРеестра, "Загрузка", РезультатОтправки.ПрикладнаяСтатистика);
    ТекстОшибки = ОшибкаЗагрузки.Ключ;
    ПараметрыСообщения.error_name = ТекстОшибки;
    ПараметрыСообщения.code = 100;
    
    КодОшибки = ПараметрыСтатистики.Результат.Ошибки.СоответствиеКодов.Получить(ТекстОшибки);
    Если КодОшибки <> Неопределено Тогда
        ПараметрыСообщения.code = Формат(КодОшибки, "ЧГ=0");
    КонецЕсли;
    
    Для Каждого ДетализацияОшибки Из ОшибкаЗагрузки.Значение Цикл
        СтатистикаSABY_ОбработатьДетализациюОшибкиЗагрузки(ДетализацияОшибки, ПараметрыСообщения, Результат);
	КонецЦикла;
	
КонецФункции 

&НаКлиенте
Функция СтатистикаSABY_ОбработатьДетализациюОшибкиЗагрузки(ДетализацияОшибки, ПараметрыСообщения, Результат)
	
	СбисСтек = Новый Массив;
    ЗаписьВСтек = Новый Структура("message, details, code, method_name", 
        ДетализацияОшибки.Состояние, ДетализацияОшибки.Сообщение, ПараметрыСообщения.code, "ЗагрузитьУпорядоченныйСоставПакетаВыбраннымСпособом");
    
    СбисДампОшибки = Новый Структура;
    ПараметрыОтправки = Новый Структура;
    ПараметрыОтправки.Вставить("ini_name", ПараметрыСообщения.action_param);
    
    Для Каждого СбисОбработанОбъект Из ДетализацияОшибки.ОбработаныОбъекты1С Цикл
        Если Не СбисОбработанОбъект.Ошибки Тогда
            Продолжить;
        КонецЕсли;
        
        Если ПараметрыОтправки.Свойство("value") Тогда
            СбисДампДополнительныеОбъекты = Неопределено;
            Если Не СбисДампОшибки.Свойство("ДополнительныеОбъекты", СбисДампДополнительныеОбъекты) Тогда
                СбисДампДополнительныеОбъекты = Новый Массив;
                СбисДампОшибки.Вставить("ДополнительныеОбъекты", СбисДампДополнительныеОбъекты);
            КонецЕсли;
            СбисДампДополнительныеОбъекты.Добавить(Новый Структура("value, type", Строка(СбисОбработанОбъект.Ссылка), СбисОбработанОбъект.Тип));
            Продолжить;
        КонецЕсли;
        
        ПараметрыОтправки.Вставить("value", Строка(СбисОбработанОбъект.Ссылка));
        ПараметрыОтправки.Вставить("type", СбисОбработанОбъект.Тип);
    КонецЦикла;
    
    Если ЗначениеЗаполнено(СбисДампОшибки) Тогда
        ЗаписьВСтек.Вставить("dump", СбисДампОшибки);
    КонецЕсли;
    
    СбисСтек.Добавить(ЗаписьВСтек);
    ПараметрыСообщения.error_detail = ДетализацияОшибки.Сообщение;
    НовоеСообщение = СтатистикаSABY_СформироватьСтруктуруОшибки(ПараметрыСообщения);
    НовоеСообщение.data.Вставить("stack", СбисСтек);
    НовоеСообщение.data.Вставить("param", ПараметрыОтправки);
	СформированнаяОшибка = СтатистикаSABY_СформироватьСтатистикуОшибокДляIntegration(ПараметрыСообщения, НовоеСообщение);
    Результат.Ошибки.Добавить(СформированнаяОшибка); 
	
КонецФункции 

