
&НаКлиенте
Процедура СтатистикаSABY_ОбработатьОбновление(ПараметрыСтатистики, Результат)
	
	ПараметрыСтатистикиОтправка = Новый Структура;
    Отказ = Ложь;
    
    // Получаем данные по настройкам
    ДанныеПоНастройкам = ГлавноеОкно.Кэш.ФормаНастроек.ПолучитьИнформациюПоНастройкам(ГлавноеОкно.Кэш, ПараметрыСтатистикиОтправка, Отказ);
    
    // Формируем дамп данных
    Дамп = СтатистикаSABY_СформироватьДампДляОбновления(ДанныеПоНастройкам);
    
    // Обрабатываем ошибки обновления
    СтатистикаSABY_ОбработатьОшибкиОбновления(ПараметрыСтатистики, Дамп, Результат);
    
    // Формируем сообщение о выполненных действиях
    СтатистикаSABY_ОбработатьДействияОбновления(ПараметрыСтатистики, Дамп, Результат); 
	
КонецПроцедуры 

&НаКлиенте
Функция СтатистикаSABY_СформироватьДампДляОбновления(ДанныеПоНастройкам)
    Дамп = Новый Структура("Действия, Xslt, Ини, Функции", Новый Массив, Новый Массив, Новый Массив, ДанныеПоНастройкам.EPF.ЕстьИзменения);
    
    // Добавляем XSLT файлы
    Для Каждого ФайлНастроек Из ДанныеПоНастройкам.XSLT Цикл
        Если Не ФайлНастроек.ЕстьИзменения Или Найти(ФайлНастроек.ИмяФайла, "Утвердить") Тогда
            Продолжить; // Пропускаем файлы без изменений или связанные с титулами
        КонецЕсли;
        Дамп.Xslt.Добавить(Новый Структура("file_name", ФайлНастроек.ИмяФайла));
    КонецЦикла;
    
    // Добавляем INI файлы
    Для Каждого ФайлНастроек Из ДанныеПоНастройкам.XML Цикл
        Если Не ФайлНастроек.ЕстьИзменения Тогда
            Продолжить;
        КонецЕсли;
        Дамп.Ини.Добавить(Новый Структура("ini_name", ФайлНастроек.Ини_ИмяИни));
    КонецЦикла;
    
    Возврат Дамп;
КонецФункции   

&НаКлиенте
Функция СтатистикаSABY_ОбработатьОшибкиОбновления(ПараметрыСтатистики, Дамп, Результат)
    РезультатДействия = ПараметрыСтатистики.Результат;
    ПараметрыСообщения = Новый Структура("count, code, action_param, action_name, error_name, error_detail", 0, 100, "Ошибка обновления", "Обновление");
    
    Для Каждого ОшибкаДействия Из РезультатДействия.Ошибки.ДетализацияОшибок Цикл
        ТекстОшибки = ОшибкаДействия.Ключ;
        ПараметрыСообщения.count = 1;
        ПараметрыСообщения.error_name = ТекстОшибки;
        
        // Определяем код ошибки
        КодОшибки = РезультатДействия.Ошибки.СоответствиеКодов.Получить(ТекстОшибки);
        Если КодОшибки <> Неопределено Тогда
            ПараметрыСообщения.code = Формат(КодОшибки, "ЧГ=0");
        КонецЕсли;
        
        Для Каждого ДетализацияОшибки Из ОшибкаДействия.Значение Цикл
            СтатистикаSABY_ОбработатьДетализациюОшибкиОбновления(ДетализацияОшибки, ПараметрыСообщения, Дамп, Результат);
        КонецЦикла;
    КонецЦикла;
КонецФункции 

&НаКлиенте
Функция СтатистикаSABY_ОбработатьДействияОбновления(ПараметрыСтатистики, Дамп, Результат)
    РезультатДействия = ПараметрыСтатистики.Результат;
    
    // Добавляем выполненные действия в дамп
    Для Каждого ДействиеПриОбновлении Из РезультатДействия.Действие.ДетализацияВыполнено Цикл
        Дамп.Действия.Добавить(Новый Структура("update_action_name", ДействиеПриОбновлении.Ключ));
    КонецЦикла;
    
    // Формируем сообщение о выполненных действиях
    ПараметрыСообщения = Новый Структура("count, action_param, action_name, data, name_integration", 
	1, РезультатДействия.Параметры.ВерсияБыло, "Обновление", Дамп, "UpdateProduct");
    НовоеСообщение = СтатистикаSABY_СформироватьСтатистикуДляIntegration(ПараметрыСообщения);
    Результат.Сообщения.Добавить(НовоеСообщение);
КонецФункции

&НаКлиенте
Функция СтатистикаSABY_ОбработатьДетализациюОшибкиОбновления(ДетализацияОшибки, ПараметрыСообщения, Дамп, Результат)
    СбисСтек = Неопределено;
    
    // Генерируем стек ошибки, если он отсутствует
    Если Не ДетализацияОшибки.Данные.Свойство("stack", СбисСтек) Тогда
        СбисСтек = Новый Массив;
        ЗаписьВСтек = Новый Структура("message, details, code");
        ЗаполнитьЗначенияСвойств(ЗаписьВСтек, ДетализацияОшибки.Данные);
        ЗаписьВСтек.Вставить("method_name", "Обновление");
        Если ДетализацияОшибки.Данные.Свойство("dump") Тогда
            ЗаписьВСтек.Вставить("dump", ДетализацияОшибки.Данные.dump);
        КонецЕсли;
        СбисСтек.Добавить(ЗаписьВСтек);
    КонецЕсли;
    
    ПараметрыОтправки = ДетализацияОшибки.Данные.dump;
    ПараметрыСообщения.error_detail = ДетализацияОшибки.Сообщение;
    
    НовоеСообщение = СтатистикаSABY_СформироватьСтруктуруОшибки(ПараметрыСообщения);
    НовоеСообщение.data.Вставить("stack", СбисСтек);
    НовоеСообщение.data.Вставить("param", ПараметрыОтправки);
	СформированнаяОшибка = СтатистикаSABY_СформироватьСтатистикуОшибокДляIntegration(ПараметрыСообщения, НовоеСообщение);
    Результат.Ошибки.Добавить(СформированнаяОшибка);
КонецФункции

