
//Функция генерирует сообщение об успешной операции на сервис статистики
&НаКлиенте
Функция СтатистикаSABY_СформироватьСтруктуруОперации(ПараметрыСтатистики)
	СтруктураПараметров = Новый Структура();
	Для Каждого КлючИЗначение Из ПараметрыСтатистики Цикл 
		СтруктураПараметров.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	СтруктураПараметров.Вставить("service",		"ext1C");
	СтрокаМодуль = ГлобальныйКэш.ПараметрыСистемы.Обработка.КраткаяВерсия + "_" + ГлобальныйКэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя;
	СтруктураПараметров.Вставить("module", 			СтрокаМодуль);
	СтруктураПараметров.Вставить("subsystem",		ГлобальныйКэш.КэшНастроек.ПараметрыНастроек.ПрефиксУстановленныхНастроек);
	СтруктураПараметров.Вставить("connection_id",	"0");//connection_id не передаем.
	
	Возврат СтруктураПараметров;
	
КонецФункции    

//Функция генерирует готовое сообщение об ошибке для сервиса статистики
&НаКлиенте
Функция СтатистикаSABY_СформироватьСтруктуруОшибки(ПараметрыСтатистики)
	СтруктураПараметров = СтатистикаSABY_СформироватьСтруктуруОперации(ПараметрыСтатистики);
	//Добавим в data поля шапки статистики
	stat_data = ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.СбисСкопироватьОбъектНаКлиенте(СтруктураПараметров);
	//Допишем информацию о системе для записи.
	system_info = Новый Структура;
	system_info.Вставить("configuration_info",		ГлобальныйКэш.ПараметрыСистемы.Конфигурация.ПодробнаяИнформация);
	system_info.Вставить("configuration_version",	ГлобальныйКэш.ПараметрыСистемы.Конфигурация.Версия);
	system_info.Вставить("platform_version",		ГлобальныйКэш.ПараметрыСистемы.Клиент.ВерсияПриложения);
	system_info.Вставить("os_client",				ГлобальныйКэш.ПараметрыСистемы.Клиент.ТипОС);
	system_info.Вставить("os_server",				ГлобальныйКэш.ПараметрыСистемы.Сервер.ТипОС);
	system_info.Вставить("first_launch",			ПолучитьЗначениеПараметраТекущегоСеанса("ПервыйЗапуск"));
	system_info.Вставить("sdk_version",				ГлобальныйКэш.СБИС.ПараметрыИнтеграции.Версия);
	stat_data.Вставить("systemInfo", system_info);
	СтруктураПараметров.Вставить("data", stat_data);
	Возврат СтруктураПараметров;		
	
КонецФункции

&НаКлиенте
Функция СтатистикаSABY_СформироватьСтатистикуДляIntegration(ПараметрыСтатистики)
	
	ПараметрыСистемы = ГлобальныйКэш_Получить("ПараметрыСистемы");
	СведенияОбИнтеграции	= ПолучитьЗначениеПараметраТекущегоСеанса("СведенияОбИнтеграции");
	КэшНастроек =  ГлобальныйКэш_Получить("КэшНастроек"); 
	
	Если ПараметрыСтатистики.Свойство("ActionData") Тогда
		ActionData = ПараметрыСтатистики.ActionData;
	Иначе
		ActionData = Новый Структура;
	КонецЕсли;
	
	Если ПараметрыСтатистики.Свойство("Count") Тогда
		Количество = ПараметрыСтатистики.Count;
	Иначе
		Количество = 1;
	КонецЕсли;
	
	Если ПараметрыСтатистики.Свойство("name_integration") Тогда
        action = ПараметрыСтатистики.name_integration;
	Иначе 
		action = "Other";
	КонецЕсли;
	
	Если ПараметрыСтатистики.Свойство("Прикладная") И ПараметрыСтатистики.Прикладная <> Неопределено Тогда
		ActionContext = ПрикладнаяСтатистика_ПолучитьПараметр(ПараметрыСтатистики.Прикладная, "ТипДокумента");
	Иначе 
		ActionContext = "";
	КонецЕсли;
	
	Статистика = Новый Структура;
	SystemInfo = Новый Структура;
	SystemInfo.Вставить("ExtSysType",			"1C");
	SystemInfo.Вставить("ExtSysSubtype",		СтатистикаSABY_ИзвлечьПрефикс(КэшНастроек.ПараметрыНастроек.ПрефиксУстановленныхНастроек));//из Кэша
	SystemInfo.Вставить("ExtSysVersion",		ПараметрыСистемы.Конфигурация.Версия);//из Кэша
	SystemInfo.Вставить("Product",				ПараметрыСистемы.Обработка.ИмяПродукта);//собираем из Кэша пример vo2_1c_82_of
	SystemInfo.Вставить("ProductVersion",		ПараметрыСистемы.Обработка.Версия);// версия обработки ProductVersion
	SystemInfo.Вставить("Connector",			СведенияОбИнтеграции.Параметры.ИмяКоннкетора);//
	SystemInfo.Вставить("ApiType",				"edo");
	SystemInfo.Вставить("CustomizationType",	"301");
	МассивActions = Новый Массив;
	Actions = Новый Структура;
	Actions.Вставить("ActionName",				action);
	Actions.Вставить("ActionContext",			ActionContext);
	Actions.Вставить("ActionData", 				ActionData);
	Actions.Вставить("ActionCount",				Количество);
	Статистика.Вставить("SystemInfo",			SystemInfo); 
	МассивActions.Добавить(Actions);
	Статистика.Вставить("Actions",				МассивActions);
	
	Возврат Статистика
КонецФункции 

&НаКлиенте
Функция СтатистикаSABY_ИзвлечьПрефикс(Строка)
    Если Не ЗначениеЗаполнено(Строка) Тогда
        Возврат "";
    КонецЕсли;
    
    // Находим позицию первого дефиса
    ПозицияДефиса = Найти(Строка, "-");
    
    // Если дефис не найден — возвращаем всю строку
    Если ПозицияДефиса = 0 Тогда
        Возврат Строка;
    КонецЕсли;
    
    // Возвращаем часть строки до первого дефиса
    Возврат Лев(Строка, ПозицияДефиса - 1);
КонецФункции

&НаКлиенте
Функция СтатистикаSABY_СформироватьСтатистикуОшибокДляIntegration(ПараметрыСтатистики, НовоеСообщение)
	
	ПараметрыСистемы = ГлобальныйКэш_Получить("ПараметрыСистемы");
	СведенияОбИнтеграции	= ПолучитьЗначениеПараметраТекущегоСеанса("СведенияОбИнтеграции");
	КэшНастроек =  ГлобальныйКэш_Получить("КэшНастроек"); 
	action = "Other";
	Количество = 1;
	
	Если ПараметрыСтатистики.Свойство("Прикладная") И ПараметрыСтатистики.Прикладная <> Неопределено Тогда
		ActionContext = ПрикладнаяСтатистика_ПолучитьПараметр(ПараметрыСтатистики.Прикладная, "ТипДокумента");
	Иначе 
		ActionContext = "Ошибка";
	КонецЕсли;
	
	Если ПараметрыСтатистики.Свойство("Ошибка") Тогда
        ErrorMessage = ПараметрыСтатистики.Ошибка.message;
		ErrorDetail = ПараметрыСтатистики.Ошибка.details;
		ErrorCode = ПараметрыСтатистики.Ошибка.code;	
	Иначе 
		ErrorMessage = ПараметрыСтатистики.error_name;
		ErrorDetail = ПараметрыСтатистики.error_detail;
		ErrorCode = ПараметрыСтатистики.code;
	КонецЕсли;
		
	Статистика = Новый Структура;
	SystemInfo = Новый Структура;
	SystemInfo.Вставить("ExtSysType",			"1C");
	SystemInfo.Вставить("ExtSysSubtype",		СтатистикаSABY_ИзвлечьПрефикс(КэшНастроек.ПараметрыНастроек.ПрефиксУстановленныхНастроек));
	SystemInfo.Вставить("ExtSysVersion",		ПараметрыСистемы.Конфигурация.Версия);
	SystemInfo.Вставить("Product",				ПараметрыСистемы.Обработка.ИмяПродукта);
	SystemInfo.Вставить("ProductVersion",		ПараметрыСистемы.Обработка.Версия);
	SystemInfo.Вставить("Connector",			СведенияОбИнтеграции.Параметры.ИмяКоннкетора);
	SystemInfo.Вставить("ApiType",				"edo");
	SystemInfo.Вставить("CustomizationType",	"301");
	МассивErrors = Новый Массив;
	Errors = Новый Структура;
	Errors.Вставить("ActionName",				action);
	Errors.Вставить("ActionContext",			ActionContext);
	Errors.Вставить("ErrorData", 				НовоеСообщение.data);
	Errors.Вставить("ErrorCount",				1);
	Errors.Вставить("ErrorMessage",				ErrorMessage);
	Errors.Вставить("ErrorDetail",				ErrorDetail);
	Errors.Вставить("ErrorCode",				ErrorCode);
	Статистика.Вставить("SystemInfo",			SystemInfo); 
	МассивErrors.Добавить(Errors);
	Статистика.Вставить("Errors",				МассивErrors);
	
	Возврат Статистика
КонецФункции

