
&НаКлиенте
Процедура СтатистикаSABY_ОбработатьОтправку(ПараметрыСтатистики, Результат)
	
	РезультатОтправки = ПараметрыСтатистики.РезультатОтправки;
	
	Отправлено	= МассоваяОперация_Получить(РезультатОтправки, "Отправлено");
 	Ошибок		= МассоваяОперация_Получить(РезультатОтправки, "Ошибок");
   // Успешная отправка
    Если Не Отправлено = Неопределено И Отправлено Тогда
        ПараметрыСообщения = Новый Структура("count, action_param, action_name, name_integration, Прикладная", 
            РезультатОтправки.Отправлено, ПараметрыСтатистики.ИмяРеестра, "Отправка", "Import", РезультатОтправки.ПрикладнаяСтатистика);
        НовоеСообщение = СтатистикаSABY_СформироватьСтатистикуДляIntegration(ПараметрыСообщения);
        Результат.Сообщения.Добавить(НовоеСообщение);
    КонецЕсли;
    
    // Ошибки отправки
    Если Ошибок Тогда
        СтатистикаSABY_ОбработатьОшибкиОтправки(РезультатОтправки, ПараметрыСтатистики, Результат);
	КонецЕсли;
	
КонецПроцедуры       

&НаКлиенте
Процедура СтатистикаSABY_ОбработатьОшибкиОтправки(РезультатОтправки, ПараметрыСтатистики, Результат)
	
	Для Каждого ОшибкаОтправки Из РезультатОтправки.ДетализацияОшибок Цикл
        ПараметрыСообщения = Новый Структура("count, code, action_param, action_name, error_name, error_detail, Прикладная", 
            0, 100, ПараметрыСтатистики.ИмяРеестра, "Отправка", РезультатОтправки.ПрикладнаяСтатистика);
        ТекстОшибки = ОшибкаОтправки.Ключ;
        ПараметрыСообщения.error_name = ТекстОшибки;
        ПараметрыСообщения.code = 100;
        
        // Поиск соответствия кодов ошибок
        Если РезультатОтправки.Свойство("СоответствиеКодовИТекстовОшибок") Тогда
            КодОшибки = РезультатОтправки.СоответствиеКодовИТекстовОшибок.Получить(ТекстОшибки);
            Если КодОшибки <> Неопределено Тогда
                ПараметрыСообщения.code = Формат(КодОшибки, "ЧГ=0");
            КонецЕсли;
        КонецЕсли;
        
        Для Каждого ДетализацияОшибки Из ОшибкаОтправки.Значение Цикл
            СтатистикаSABY_ОбработатьДетализациюОшибкиОтправки(ДетализацияОшибки, ПараметрыСообщения, Результат);
        КонецЦикла;
	КонецЦикла; 
	
КонецПроцедуры 

&НаКлиенте
Функция СтатистикаSABY_ОбработатьДетализациюОшибкиОтправки(ДетализацияОшибки, ПараметрыСообщения, Результат)
	
	СбисСтек = Неопределено;
    Если Не ДетализацияОшибки.СтруктураОшибки.Свойство("stack", СбисСтек) Тогда
        СбисСтек = Новый Массив;
        ЗаписьВСтек = Новый Структура("message,details,code");
        ЗаполнитьЗначенияСвойств(ЗаписьВСтек, ДетализацияОшибки.СтруктураОшибки);
        ЗаписьВСтек.Вставить("method_name", "WriteDocumentEx");
        Если ДетализацияОшибки.СтруктураОшибки.Свойство("dump") Тогда
            ЗаписьВСтек.Вставить("dump", ДетализацияОшибки.СтруктураОшибки.dump);
        КонецЕсли;
        СбисСтек.Добавить(ЗаписьВСтек);
    КонецЕсли;
    
    ПараметрыОтправки = Новый Структура;
    ПараметрыОтправки.Вставить("ini_name", ПараметрыСообщения.action_param);
	Если ДетализацияОшибки.Свойство("ОбработанДокумент1С") Тогда
    	ПараметрыОтправки.Вставить("value", Строка(ДетализацияОшибки.ОбработанДокумент1С));
	КонецЕсли;
    ПараметрыОтправки.Вставить("type", "ДокументСсылка." + ПараметрыСообщения.action_param);
    
    ПараметрыСообщения.error_detail = ДетализацияОшибки.Сообщение;
    НовоеСообщение = СтатистикаSABY_СформироватьСтруктуруОшибки(ПараметрыСообщения);
    НовоеСообщение.data.Вставить("stack", СбисСтек);
    НовоеСообщение.data.Вставить("param", ПараметрыОтправки);
	СформированнаяОшибка = СтатистикаSABY_СформироватьСтатистикуОшибокДляIntegration(ПараметрыСообщения, НовоеСообщение);
    Результат.Ошибки.Добавить(СформированнаяОшибка); 
	
КонецФункции 

