
&НаКлиенте
Процедура СтатистикаSABY_ОбработатьОшибку(ПараметрыСтатистики, Результат)
	
	СбисСтек = Неопределено;
    ПараметрыСообщения = Новый Структура("count, code, action_param, action_name, error_name, error_detail, Прикладная", 
        1, 100, "Ошибка", "Ошибка");
    
    Если Не ПараметрыСтатистики.Ошибка.Свойство("stack", СбисСтек) Тогда
        СбисСтек = Новый Массив;
        ЗаписьВСтек = ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.СбисСкопироватьОбъектНаКлиенте(ПараметрыСтатистики.Ошибка);
        СбисСтек.Добавить(ЗаписьВСтек);
    КонецЕсли;
    
    ПараметрыСообщения.code = Формат(ПараметрыСтатистики.Ошибка.code, "ЧГ=0");
    ПараметрыСообщения.error_name = ПараметрыСтатистики.Ошибка.message;
    ПараметрыСообщения.error_detail = ПараметрыСтатистики.Ошибка.details;
    
    НовоеСообщение = СтатистикаSABY_СформироватьСтруктуруОшибки(ПараметрыСообщения);
    НовоеСообщение.data.Вставить("stack", СбисСтек);
	СформированнаяОшибка = СтатистикаSABY_СформироватьСтатистикуОшибокДляIntegration(ПараметрыСообщения, НовоеСообщение);
    Результат.Ошибки.Добавить(СформированнаяОшибка); 
	
КонецПроцедуры

