
&НаКлиенте
Процедура СтатистикаSABY_ОбработатьПрикладнуюСтатистику(ПараметрыСтатистики, Результат)
	
	ДопПараметрыСтатистики = Новый ФиксированнаяСтруктура("Имя", "Обработка 1С");
    
	Если ПараметрыСтатистики.Свойство("Сообщения") Тогда
		
		Если ТипЗнч(ПараметрыСтатистики.Сообщения) = Тип("Структура") Тогда
			
	        ПараметрыСообщения = Новый Структура("Функционал, Количество, Действие, Контекст", ДопПараметрыСтатистики.Имя, 1);
	        ЗаполнитьЗначенияСвойств(ПараметрыСообщения, ПараметрыСтатистики.Сообщения);
	        Результат.Прикладная.Добавить(ПараметрыСообщения);
	        
	    ИначеЕсли ТипЗнч(ПараметрыСтатистики.Сообщения) = Тип("Массив") Тогда
			
			Для Каждого ЭлементНаЗапись Из ПараметрыСтатистики.Сообщения Цикл
	            ПараметрыСообщения = Новый Структура("Функционал, Количество, Действие, Контекст", ДопПараметрыСтатистики.Имя, 1);
	            ЗаполнитьЗначенияСвойств(ПараметрыСообщения, ЭлементНаЗапись);
	            Результат.Прикладная.Добавить(ПараметрыСообщения);
	        КонецЦикла;
	        
		Иначе
			
	        ПараметрыСообщения = Новый Структура("Функционал, Количество, Действие, Контекст", ДопПараметрыСтатистики.Имя, 1);
	        СтрокаРазделить = СтрЗаменить(ПараметрыСтатистики.Сообщения, ".", Символы.ПС);
	        ПараметрыСообщения.Контекст = СтрПолучитьСтроку(СтрокаРазделить, 1);
	        ПараметрыСообщения.Действие = СтрПолучитьСтроку(СтрокаРазделить, 2);
	        Результат.Прикладная.Добавить(ПараметрыСообщения);
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыСтатистики.Свойство("Объект") Тогда
		
		СтатистикаSABY_Прикладная_ЗаполнитьСообщенияПоОбъекту(ПараметрыСтатистики.Объект, Результат, ПараметрыСтатистики);
		
	ИначеЕсли ПараметрыСтатистики.Свойство("Объекты") Тогда
		
		Для Каждого ОбъектДляСтатистики Из ПараметрыСтатистики.Объекты Цикл
			
			СтатистикаSABY_Прикладная_ЗаполнитьСообщенияПоОбъекту(ОбъектДляСтатистики, Результат, ПараметрыСтатистики);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатистикаSABY_Прикладная_ЗаполнитьСообщенияПоОбъекту(ОбъектДляСтатистики, Результат, ДопПараметры)
	Перем СпособФормированияВложения;
	
	Если ЭтоТипСбис(ОбъектДляСтатистики, "ВложениеСБИС") Тогда
		
		ПараметрыВложения = ВложениеСБИС_Получить(ОбъектДляСтатистики, "Параметры");
		
		Если		ПараметрыВложения = Неопределено
			Или Не	ПараметрыВложения.Свойство("СпособФормирования", СпособФормированияВложения) Тогда
			
			ПараметрыСообщения = Новый Структура("Функционал, Количество, Действие, Контекст", ДопПараметры.Имя, 1,
													"Неизвестно", "Формирование документов");
													
			Результат.Прикладная.Добавить(ПараметрыСообщения);
			
			
		Иначе
			
			ПараметрыСообщения = Новый Структура("Функционал, Количество, Действие, Контекст", ДопПараметры.Имя, 1,
													СпособФормированияВложения, "Формирование документов");
													
			Результат.Прикладная.Добавить(ПараметрыСообщения);
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

