
// Функция запускает проверку проверку прослеживаемых позиций через обертку метода RNPT.SendDoc
//
// Параметры:
//  params  - Структура - Параметры фильтрации метода
//  ДопПараметры  - Структура - Набор полей, работа с которыми может расширить результат работы функции.
//
// Возвращаемое значение:
//   Структура   - Результат вызова. Список объектов или ошибка
//
&НаКлиенте
Функция ExtSysMarking_SendDocumentRNPT(params, ДопПараметры, Отказ=Ложь) Экспорт  

	Кэш = ДопПараметры.Кэш;
	Возврат Кэш.СБИС.ДанныеИнтеграции.Объекты.Форма_ExtSDK2.ExtSysMarking_SendDocumentRNPT(params, ДопПараметры, Отказ);
	
КонецФункции 

