
&НаКлиенте
Процедура ПриВыделенииСтроки(ВыделенныеСтроки, ДопПараметры) Экспорт
	
	// Если реестр пустой, пока ничего не делаем
	Если ВыделенныеСтроки = Неопределено
		ИЛИ НЕ ВыделенныеСтроки.Количество()
		ИЛИ НЕ МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РеестрЗаказов")) Тогда
	
		Возврат
	
	КонецЕсли;
	
	ГлавноеОкно = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаГлавноеОкно");
	
	ПерваяСтрока = ВыделенныеСтроки[0].Значение;
	ТекущееДействие = МодульОбъектаКлиент().СоставПакета_Получить(ПерваяСтрока.СоставПакета[0].Значение, "ТекущееДействие");
	
	ОбработатьЗаказ = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "ОбработатьЗаказ");
	
	Если ТекущееДействие.Количество() = 1 Тогда
	
		ОбработатьЗаказ.Заголовок = ТекущееДействие[0].Представление;
	
	Иначе
	
		ОбработатьЗаказ.Заголовок = "Обработать";
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗаказ(СписокЗаказов, ДопПараметры = Неопределено) Экспорт
	
	// Если реестр пустой, пока ничего не делаем
	Если СписокЗаказов = Неопределено
		ИЛИ НЕ СписокЗаказов.Количество()
		ИЛИ НЕ МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РеестрЗаказов")) Тогда
	
		Возврат
	
	КонецЕсли;
	
	ГлавноеОкно = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаГлавноеОкно");
	
	ПерваяСтрока = СписокЗаказов[0].Значение;
	ТекущееДействие = МодульОбъектаКлиент().СоставПакета_Получить(ПерваяСтрока.СоставПакета[0].Значение, "ТекущееДействие");
	
	ДопПараметрыВыполнить = Новый Структура("СписокСтрокРеестра", СписокЗаказов);
	
	Если ТекущееДействие.Количество() = 1 Тогда
		
		МодульОбъектаКлиент().ПользовательскиеДействия_Выполнить(ТекущееДействие[0], ДопПараметрыВыполнить);
		
	Иначе
		
		СписокДляВыбора = Новый СписокЗначений;
		
		Для каждого Действие Из ТекущееДействие Цикл
		
			СписокДляВыбора.Добавить(Действие, Действие.Представление);
		
		КонецЦикла;
		
		ОбработатьЗаказ = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "ОбработатьЗаказ");
		Обработчик = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ОбработатьЗаказЗавершить",
																		ЭтаФорма,
																		ДопПараметрыВыполнить);
		ДопПараметрыВыбора = Новый Структура("ЭлементПривязки, Обработчик, Форма", ОбработатьЗаказ, Обработчик, ГлавноеОкно);
		МодульОбъектаКлиент().СбисВыбратьИзСписка(СписокДляВыбора, ДопПараметрыВыбора);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗаказЗавершить(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	МодульОбъектаКлиент().ПользовательскиеДействия_Выполнить(РезультатВыбора.Значение, ДопПараметры);
	
КонецПроцедуры

