
&НаКлиенте
Процедура ПриВыделенииСтроки(ВыделенныеСтроки, ДопПараметры) Экспорт
	
	// Если реестр пустой, пока ничего не делаем
	Если ВыделенныеСтроки = Неопределено
		ИЛИ НЕ ВыделенныеСтроки.Количество()
		ИЛИ НЕ МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РеестрЗаказов")) Тогда
	
		Возврат
	
	КонецЕсли;
	
	ГлавноеОкно = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаГлавноеОкно");
	
	ПерваяСтрока = ВыделенныеСтроки[0].Значение;
	ТекущееДействие = МодульОбъектаКлиент().СоставПакета_Получить(ПерваяСтрока.СоставПакета[0].Значение, "ТекущееДействие");
	
	ОбработатьЗаказ = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "ОбработатьЗаказ");
	
	Если ТекущееДействие.Количество() = 1 Тогда
	
		ОбработатьЗаказ.Заголовок = ТекущееДействие[0].Представление;
	
	Иначе
	
		ОбработатьЗаказ.Заголовок = "Обработать";
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗаказ(СписокЗаказов, ДопПараметры = Неопределено) Экспорт
	
	// Если реестр пустой, пока ничего не делаем
	Если СписокЗаказов = Неопределено
		ИЛИ НЕ СписокЗаказов.Количество()
		ИЛИ НЕ МодульОбъектаКлиент().ПолучитьЗначениеФичи(Новый Структура("НазваниеФичи", "РеестрЗаказов")) Тогда
	
		Возврат
	
	КонецЕсли;
	
	ГлавноеОкно = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаГлавноеОкно");
	
	// ТекущееДействие = МодульОбъектаКлиент().СоставПакета_Получить(ПерваяСтрока.СоставПакета[0].Значение, "ТекущееДействие");
	 ТекущееДействие = МодульОбъектаКлиент().РазделГО_НаборКоманд(МестныйКэш.Текущий);
	
	ДопПараметрыВыполнить = Новый Структура("СписокСтрокРеестра", СписокЗаказов);
	
	Если ТекущееДействие.Количество() = 1 Тогда
		
		МодульОбъектаКлиент().ПользовательскиеДействия_Выполнить(ТекущееДействие[0], ДопПараметрыВыполнить);
		
	Иначе
		
		СписокДляВыбора = Новый СписокЗначений;
		
		Для каждого Действие Из ТекущееДействие Цикл
		
			СписокДляВыбора.Добавить(Действие, Действие.Представление);
		
		КонецЦикла;
		
		ОбработатьЗаказ = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ГлавноеОкно, "ОбработатьЗаказ");
		Обработчик = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ОбработатьЗаказЗавершить",
																		ЭтаФорма,
																		ДопПараметрыВыполнить);
		ДопПараметрыВыбора = Новый Структура("ЭлементПривязки, Обработчик, Форма", ОбработатьЗаказ, Обработчик, ГлавноеОкно);
		МодульОбъектаКлиент().СбисВыбратьИзСписка(СписокДляВыбора, ДопПараметрыВыбора);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗаказЗавершить(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	МодульОбъектаКлиент().ПользовательскиеДействия_Выполнить(РезультатВыбора.Значение, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Функция СписокПользовательскихДействийРаздела(РазделГО) Экспорт
	
	ГлавноеОкно = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаГлавноеОкно");
	АккордеонДополнительный = ГлавноеОкно.АккордеонДополнительный;
	
	СписокОпераций = Новый СписокЗначений;
	
	Если НЕ АккордеонДополнительный.Свойство("ТекущаяФазаДокумента")
		ИЛИ НРег(АккордеонДополнительный.ТекущаяФазаДокумента) = "вработе"
		ИЛИ НРег(АккордеонДополнительный.ТекущаяФазаДокумента) = "всезаказы" Тогда
	
		СписокОпераций.Добавить("ОбработатьМассово", "Обработать");
	
	ИначеЕсли НРег(АккордеонДополнительный.ТекущаяФазаДокумента) = "утверждение" Тогда
	
		СписокОпераций.Добавить("ЗагрузитьВ1С",	"Загрузить в 1С");
		СписокОпераций.Добавить("Утвердить",	"Утвердить");
		СписокОпераций.Добавить("Отклонить",	"Отклонить");  	
		  
	ИначеЕсли НРег(АккордеонДополнительный.ТекущаяФазаДокумента) = "ожиданиеподтвержденияодоставке" Тогда
	
		СписокОпераций.Добавить("ЗагрузитьВ1С",	"Загрузить в 1С");
	
	ИначеЕсли НРег(АккордеонДополнительный.ТекущаяФазаДокумента) = "отгрузка" Тогда
	
		СписокОпераций.Добавить("ЗагрузитьВ1С",	"Загрузить в 1С"); 
		СписокОпераций.Добавить("Отгрузить",				"Отгрузить");
		СписокОпераций.Добавить("СвязатьСОтгрузкой",		"Создать документ отгрузки");
	
	ИначеЕсли НРег(АккордеонДополнительный.ТекущаяФазаДокумента) = "отправитьдокументы" Тогда
	
		СписокОпераций.Добавить("ОтправитьЮЗДДляЗаказов",		"Отправить");
		СписокОпераций.Добавить("ОбработатьРезультатыПриемки",	"Обработать результат приемки"); 
		СписокОпераций.Добавить("ИгнорироватьРасхождения",	"Игнорировать расхождения при приемке");
	
	КонецЕсли;
	
	Возврат СписокОпераций;
	
КонецФункции

