
&НаКлиенте
Функция		_КлассIntegrationConnection_ОсновныеПоля(Кэш)
	
	ЭкземплярКласса = МодульОбъектаКлиент().НовыйКоннекшенSABY();
	МодульОбъектаКлиент().ОбъектSABY_Установить(ЭкземплярКласса, "Тип", "КлассIntegrationConnection");
	
	ПараметрыРаботы = МодульОбъектаКлиент().КоннекшенSABY_Получить(ЭкземплярКласса, "ПараметрыРаботы");
	ПараметрыРаботы.Вставить("Статус", "Новый");
	ПараметрыРаботы.Вставить("ТипНастроек", "Стандартные");
	ПараметрыРаботы.Вставить("Шаблон");

    ЭкземплярКласса.Вставить("Идентификатор");
	ЭкземплярКласса.Вставить("Данные",	Новый Структура("Ини, Прочие, Меню, Параметры"));

	Возврат ЭкземплярКласса;
	
КонецФункции

// Процедура - инициировать структуру ини класса значениями по-умолчанию
//
// Параметры:
//  Кэш							 - ЛокальныйКэш					 - структура кэша
//  КлассIntegrationConnection	 - КлассIntegrationConnection	 - структура текущего класса
//
&НаКлиенте
Процедура	КлассIntegrationConnection_ИнициироватьИниПоУмолчанию(Кэш, КлассIntegrationConnection)
	
	Отказ			= Ложь;
	ЗапроситьМеню	= Ложь;
	ПараметрыМеню	= СбисОписаниеИниМеню(Кэш);
	
	// Если запрашивается меню, то сразу запросить конфигурацию
	ЗапроситьМеню			=	КлассIntegrationConnection.Данные.Меню = Неопределено;
	ЗапроситьКонфигурацию	=		ЗапроситьМеню
							Или		КлассIntegrationConnection.Данные.Ини = Неопределено
							Или	Не	КлассIntegrationConnection.Данные.Ини.Свойство("Конфигурация")
							Или		КлассIntegrationConnection.Данные.Ини.Конфигурация = Неопределено;
							
	СписокИниПолучить = Новый Массив;
	Если ЗапроситьМеню Тогда
	
		СписокИниПолучить.Добавить(ПараметрыМеню);
		
	КонецЕсли;
	
	Если ЗапроситьКонфигурацию Тогда
		
		СписокИниПолучить.Добавить(Новый Структура("name, type, active, data", "Конфигурация", "Система", Истина));
		
	КонецЕсли;
	
	Если Не СписокИниПолучить.Количество() Тогда
		
		СписокИниПолучить = Неопределено;//Иначе придут все ини
		
	КонецЕсли;
	
	// Ини запросить на шару, без контроля, т.к. меню и конфигурации может не быть
	ПараметрыЧтенияИни = Новый Структура("СписокИни", СписокИниПолучить);
	ДанныеБЛ = _КлассIntegrationConnection_ВыполнитьЧтениеСБЛ(Кэш, КлассIntegrationConnection, ПараметрыЧтенияИни, Отказ);
	
	Если Отказ Тогда
		
		ИсключениеИнициироватьИни = МодульОбъектаКлиент().НовыйСбисИсключение(	ДанныеБЛ,
																				"ФайлыНастроекСервер.КлассIntegrationConnection_ИнициироватьИниПоУмолчанию");
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(ИсключениеИнициироватьИни);

	КонецЕсли;
	
	ПараметрыОбработки = Новый Структура("ДанныеБЛ", ДанныеБЛ);
	
	//При инициализации не требуется проверять шаблон. Либо есть данные по ИД, либо это конфиг, либо ошибка - нет подключения
	РезультатОбработки = _КлассIntegrationConnection_ЗаполнитьПоДанным(Кэш, КлассIntegrationConnection, ПараметрыОбработки, Отказ);
	Если Отказ Тогда

		ИсключениеИнициироватьИни = МодульОбъектаКлиент().НовыйСбисИсключение(	РезультатОбработки,
																				"ФайлыНастроекСервер.КлассIntegrationConnection_ИнициироватьИниПоУмолчанию");
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(ИсключениеИнициироватьИни);
		
	КонецЕсли;
	
	//Инициируем структуру ини пустыми значениями
	ДанныеСписка = КлассIntegrationConnection_СписокИни(Кэш, КлассIntegrationConnection, Новый Структура, Отказ);
	Если Отказ Тогда
		
		ИсключениеИнициироватьИни = МодульОбъектаКлиент().НовыйСбисИсключение(	ДанныеСписка,
																				"ФайлыНастроекСервер.КлассIntegrationConnection_ИнициироватьИниПоУмолчанию");
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(ИсключениеИнициироватьИни);
		
	КонецЕсли;
	
	Если КлассIntegrationConnection.Данные.Ини = Неопределено Тогда
		
		КлассIntegrationConnection.Данные.Ини = Новый Структура;
		
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из ДанныеСписка.Данные Цикл
		
		ИмяИни = ПолучитьИмяИни(Кэш.КэшНастроек.ПараметрыНастроек, ЭлементСписка.name);
		
		Если КлассIntegrationConnection.Данные.Ини.Свойство(ИмяИни) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		КлассIntegrationConnection.Данные.Ини.Вставить(ИмяИни, Неопределено);
		
	КонецЦикла;
	
	КлассIntegrationConnection.ПараметрыРаботы.ИнициированыДанные = Истина;	
	
КонецПроцедуры

