
&НаКлиенте
Функция		_КлассIntegrationConnection_ОсновныеПоля(Кэш)
	//Статус				- возможные значнения: "Новый"(по-умолч), "Активен"(актуален), "Удален"(был удалён в процессе работы с БЛ)
	//ТипНастроек			- возможные значнения: "Стандартные"(по-умолч), "Пользовательские", "Шаблон", "Неизвестно"("Пользовательские"/"Шаблон", при чтении)
	//Автообновление		- возможные значнения: True/False - признак автооподбора config под текущую версию
	//Изменен				- возможные значнения: True/False - признак того, менялся ли класс из интерфейса
	//Инициирован			- возможные значнения: True/False - признак того, инитился ли класс по его слепку с БЛ
	//ДатаИзмененияНастроек - Дата. Последнее изменение настроек
	//Шаблон				- УИД шаблона коннекшена, если есть.
	//Пользователь			- ИД пользователя, которому принадлежит коннекшен.
	//ВерсияКонфиг			- Номер версии конфига, из которого был создан коннешен. При отключенном автообновлении берётся версия отсюда.
	

	ПараметрыРаботыIntegrationConnection = Новый Структура	
	("Статус,	ТипНастроек,	Автообновление,	Изменен, ИнициированаШапка, ИнициированыДанные, ДатаИзмененияНастроек, Шаблон, Пользователь, ВерсияКонфиг, Демо"
	,"Новый",	"Стандартные",	Истина,		 	Ложь,	 Ложь,				Ложь,			  	ТекущаяДата());
	ПараметрыРаботыIntegrationConnection.Вставить("ПроверитьИниПриСохранении", Ложь);
	//Определяет работу с настройкой:
	//Отправлять- если нет необходимости записывать на сервис, то флаг переключить в ложь. Тогда изменения будут кэшироваться в выбранном подключении
	//Обновить	- флаг изменения в параметрах. Если переключен в истину, то будет проведена отправка на сервис.
	ПараметрыРаботыIntegrationConnection.Вставить("СбисПараметры",	Новый Структура("Обновить, Отправлять", Ложь, Истина));
	ПараметрыРаботыIntegrationConnection.Вставить("СбисМеню",		Новый Структура("Обновить, Отправлять", Ложь, Истина));
	//Список ини, которые требуется отправить на БЛ при записи.
	ПараметрыРаботыIntegrationConnection.Вставить("СбисИни",			Новый Структура("СписокОтправить", Новый Массив));
	Результат = Новый Структура(
	"_класс,						ПараметрыРаботы,						Данные,											Название,	ПараметрыКонфигурации,	Идентификатор"
	,"КлассIntegrationConnection",	ПараметрыРаботыIntegrationConnection,	Новый Структура("Ини, Прочие, Меню, Параметры"),"");	
	Возврат Результат;
	
КонецФункции

// Процедура - инициировать структуру ини класса значениями по-умолчанию
//
// Параметры:
//  Кэш							 - ЛокальныйКэш					 - структура кэша
//  КлассIntegrationConnection	 - КлассIntegrationConnection	 - структура текущего класса
//
&НаКлиенте
Процедура	КлассIntegrationConnection_ИнициироватьИниПоУмолчанию(Кэш, КлассIntegrationConnection)
	
	Отказ			= Ложь;
	ЗапроситьМеню	= Ложь;
	ПараметрыМеню	= СбисОписаниеИниМеню(Кэш);
	
	// Если запрашивается меню, то сразу запросить конфигурацию
	ЗапроситьМеню			=	КлассIntegrationConnection.Данные.Меню = Неопределено;
	ЗапроситьКонфигурацию	=		ЗапроситьМеню
							Или		КлассIntegrationConnection.Данные.Ини = Неопределено
							Или	Не	КлассIntegrationConnection.Данные.Ини.Свойство("Конфигурация")
							Или		КлассIntegrationConnection.Данные.Ини.Конфигурация = Неопределено;
							
	СписокИниПолучить = Новый Массив;
	Если ЗапроситьМеню Тогда
	
		СписокИниПолучить.Добавить(ПараметрыМеню);
		
	КонецЕсли;
	
	Если ЗапроситьКонфигурацию Тогда
		
		СписокИниПолучить.Добавить(Новый Структура("name, type, active, data", "Конфигурация", "Система", Истина));
		
	КонецЕсли;
	
	Если Не СписокИниПолучить.Количество() Тогда
		
		СписокИниПолучить = Неопределено;//Иначе придут все ини
		
	КонецЕсли;
	
	// Ини запросить на шару, без контроля, т.к. меню и конфигурации может не быть
	ПараметрыЧтенияИни = Новый Структура("СписокИни", СписокИниПолучить);
	ДанныеБЛ = _КлассIntegrationConnection_ВыполнитьЧтениеСБЛ(Кэш, КлассIntegrationConnection, ПараметрыЧтенияИни, Отказ);
	
	Если Отказ Тогда
		
		ИсключениеИнициироватьИни = МодульОбъектаКлиент().НовыйСбисИсключение(	ДанныеБЛ,
																				"ФайлыНастроекСервер.КлассIntegrationConnection_ИнициироватьИниПоУмолчанию");
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Представление(ИсключениеИнициироватьИни);

	КонецЕсли;
	
	ПараметрыОбработки = Новый Структура("ДанныеБЛ", ДанныеБЛ);
	
	//При инициализации не требуется проверять шаблон. Либо есть данные по ИД, либо это конфиг, либо ошибка - нет подключения
	РезультатОбработки = _КлассIntegrationConnection_ЗаполнитьПоДанным(Кэш, КлассIntegrationConnection, ПараметрыОбработки, Отказ);
	Если Отказ Тогда

		ИсключениеИнициироватьИни = МодульОбъектаКлиент().НовыйСбисИсключение(	РезультатОбработки,
																				"ФайлыНастроекСервер.КлассIntegrationConnection_ИнициироватьИниПоУмолчанию");
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Представление(ИсключениеИнициироватьИни);
		
	КонецЕсли;
	
	//Инициируем структуру ини пустыми значениями
	ДанныеСписка = КлассIntegrationConnection_СписокИни(Кэш, КлассIntegrationConnection, Новый Структура, Отказ);
	Если Отказ Тогда
		
		ИсключениеИнициироватьИни = МодульОбъектаКлиент().НовыйСбисИсключение(	ДанныеСписка,
																				"ФайлыНастроекСервер.КлассIntegrationConnection_ИнициироватьИниПоУмолчанию");
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Представление(ИсключениеИнициироватьИни);
		
	КонецЕсли;
	
	Если КлассIntegrationConnection.Данные.Ини = Неопределено Тогда
		
		КлассIntegrationConnection.Данные.Ини = Новый Структура;
		
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из ДанныеСписка.Данные Цикл
		
		ИмяИни = ПолучитьИмяИни(Кэш.КэшНастроек.ПараметрыНастроек, ЭлементСписка.name);
		
		Если КлассIntegrationConnection.Данные.Ини.Свойство(ИмяИни) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		КлассIntegrationConnection.Данные.Ини.Вставить(ИмяИни, Неопределено);
		
	КонецЦикла;
	
	КлассIntegrationConnection.ПараметрыРаботы.ИнициированыДанные = Истина;	
	
КонецПроцедуры

