
//DynamicDirective

Функция API_СведенияОбИнтеграции() Экспорт

	ЛокальныйКэш = МодульОбъектаКлиентСервер().ПолучитьТекущийЛокальныйКэш();
	
	ПараметрыИнтеграции = Новый Структура;
	ПараметрыИнтеграции.Вставить("ГенераторФЭД",				Истина);
	ПараметрыИнтеграции.Вставить("Шифрование",					Ложь);
	ПараметрыИнтеграции.Вставить("МногопоточныйРежим",			Ложь);
	ПараметрыИнтеграции.Вставить("ДоступныСерверныеНастройки",	Истина);
	ПараметрыИнтеграции.Вставить("ВремяОжиданияОтвета",			60);
	ПараметрыИнтеграции.Вставить("ИмяКоннкетора",				"1c-http");
	ПараметрыИнтеграции.Вставить("ВремяОжиданияОтвета_Отправка",120);
	ПараметрыИнтеграции.Вставить("КоличествоПотоков",			10);
	Если		ЛокальныйКэш.Свойство("ГлавноеОкно")
		И Не	ЛокальныйКэш.ГлавноеОкно.ПараметрыФормы = Неопределено Тогда
		
		ПараметрыИнтеграции.Вставить("ВключитьВО3",				ЛокальныйКэш.ГлавноеОкно.ПараметрыФормы.ДоступностьВО3);	

	Иначе     

		ПараметрыИнтеграции.Вставить("ВключитьВО3",				Ложь);
		
	КонецЕсли;	
	ПараметрыИнтеграции.Вставить("СтатусыВРазрезеРегламента",	Истина);
	ПараметрыИнтеграции.Вставить("ВстроеннаяКриптография",		Истина);// Используется криптография 1С
	ПараметрыИнтеграции.Вставить("ИмяВнутреннегоМодуля",		"API");// Имя для поиска функций вызова
	
	СведенияОбИнтеграции = Новый Структура("Имя, Параметры, Версия", "API", ПараметрыИнтеграции);
	СведенияОбИнтеграции.Версия = ЛокальныйКэш.ПараметрыСистемы.Обработка.Версия;
	Возврат СведенияОбИнтеграции;
	
КонецФункции

//DynamicDirective

Функция API_ОтправитьИОбработатьКоманду(Кэш, Метод, ПараметрыМетода, ДопПараметры, Отказ) Экспорт 
	
	ПараметрыВыполненияЗапроса = Новый Структура("Метод, Параметры", Метод, ПараметрыМетода);
	ПараметрыВыполненияЗапроса.Вставить("Заголовки",	СбисСформироватьЗаголовки(Кэш.Парам, ДопПараметры));
	ПараметрыВыполненияЗапроса.Вставить("Прокси",		СбисСформироватьПрокси(Кэш));
	
	ДопПараметры.Вставить("СовместимостьHTTP",	Кэш.СовместимостьМетодов.HTTPСоединение.ФункцияПолучить);
	ДопПараметры.Вставить("СовместимостьSSL",	Кэш.СовместимостьМетодов.HTTPСоединение.OpenSSL);

	Если Метод = "Get" Тогда
		
		ДопПараметры.Вставить("Timeout", 60);
		РезультатКоманды	= GetЗапрос_Выполнить(ПараметрыВыполненияЗапроса, ДопПараметры, Отказ);
		
	Иначе
		
		ДопПараметры.Вставить("АдресСервера", Кэш.СБИС.АдресСервера);
		РезультатКоманды	= POSTЗапрос_Выполнить(ПараметрыВыполненияЗапроса, ДопПараметры, Отказ);

	КонецЕсли;
	
	Если Отказ Тогда
		
		//Если упало при попытке отправки сообщения, то уже готовая ошибка
		РезультатОтвет = МодульОбъектаКлиентСервер().НовыйСбисИсключение(РезультатКоманды, "API.ОтправитьИОбработатьКоманду");
		
	ИначеЕсли Метод = "Get" Тогда
		
		РезультатОтвет = Новый Структура("Тип, Путь", "Файл", РезультатКоманды);

		Если	ПараметрыМетода.Свойство("Прочитать")
			И	ПараметрыМетода.Прочитать Тогда
			
			РезультатОтвет.Вставить("Данные", API_ПрочитатьФайл(Кэш, РезультатКоманды, Отказ));
			
		КонецЕсли;	
		
	Иначе
		
		РезультатОтвет = РезультатКоманды;
		
	КонецЕсли;
	
	Возврат РезультатОтвет;
	
КонецФункции

//DynamicDirective

Функция API_ПрочитатьФайл(Кэш, СсылкаНаФайл, Отказ)

	Результат = "";
	
	Если Прав(СсылкаНаФайл, 4) = "html" Тогда
		Текст = Новый ЧтениеТекста(СсылкаНаФайл);
		СбисСтрокаКодировка = Кэш.КэшЗначенийИни.КодировкиЧтенияФайлов.ПоУмолчанию.ДляВсех;
		//Проверим первые 3 строки на предмет наличия там строки с описанием кодировки файла
		Для СчетчикСтрок = 1 По 3 Цикл
			СтрокаРезультат = СокрЛП(Текст.ПрочитатьСтроку());
			Если Не Лев(СтрокаРезультат, 5) = "<META" Тогда
				Продолжить;
			КонецЕсли;
			Для Каждого КодировкаДляЧтения Из Кэш.КэшЗначенийИни.КодировкиЧтенияФайлов.Определять Цикл
				Если Найти(СтрокаРезультат, "charset=" + КодировкаДляЧтения) Тогда
					СбисСтрокаКодировка = КодировкаДляЧтения;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Прервать;
		КонецЦикла;
		
		Текст = Новый ЧтениеТекста(СсылкаНаФайл, СбисСтрокаКодировка);
		Результат = Текст.Прочитать();
		Если Лев(Результат, 9) = "<!DOCTYPE" Тогда  // для PDF, JPEG
			Результат = "";
		КонецЕсли;
		
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

//DynamicDirective

//Делает вызов команды и возвращает результат, либо ошибку
Функция POSTЗапрос_Выполнить(ПараметрыКоманды, ДопПараметры, Отказ)
	Перем ИдСессии, АдресРесурса, ТекстЗапроса, ПреобразовыватьДаты, РезультатОтвет;
	
	Если Не ДопПараметры.Свойство("АдресРесурса", АдресРесурса) Тогда
		
		АдресРесурса = "/service/?srv=1";
		
	КонецЕсли;
	
	Протокол	= "https";
	АдресСервера= СтрЗаменить(ДопПараметры.АдресСервера, Протокол + "://","");
	
	Если Не ПараметрыКоманды.Свойство("ТекстЗапроса", ТекстЗапроса) Тогда
	
		ДопПараметрыТекста = Новый Структура("Метод, Режим", ПараметрыКоманды.Метод, "API");
		Если ДопПараметры.Свойство("РежимКонвертации") Тогда
			ДопПараметрыТекста.Режим = ДопПараметры.РежимКонвертации;
		КонецЕсли;
		
		ТекстЗапроса = МодульОбъектаКлиентСервер().ПреобразоватьЗначениеВJSON(ПараметрыКоманды.Параметры, ДопПараметрыТекста);
		ТекстЗапроса = "{""jsonrpc"":""2.0"",""method"":""" + ПараметрыКоманды.Метод + """,""params"":" + ТекстЗапроса + ",""id"":1}" ;
		
	КонецЕсли;

	Попытка
		
		Если Не	ДопПараметры.Свойство("СовместимостьHTTP")
			Или	ДопПараметры.СовместимостьHTTP Тогда
			
			Попытка
				
				ИспользованиеBOM = Вычислить("ИспользованиеByteOrderMark.Авто"); 
				
			Исключение
				
				Отказ 			= Истина;
				СбисИсключение	= МодульОбъектаКлиентСервер().НовыйСбисИсключение(,
					МодульОбъектаКлиентСервер_Представление() + ".POSTЗапрос.Выполнить",
					716,
					"Платформа не поддерживается. Используйте версию выше текущей",
					"Платформа не поддерживается. Используйте версию выше текущей");
						
				Возврат СбисИсключение; 
				
			КонецПопытки;
			
			Соединение = Новый HTTPСоединение(АдресСервера, , , , ПараметрыКоманды.Прокси, , Новый ЗащищенноеСоединениеOpenSSL());
			сбисHTTPЗапрос = Вычислить("Новый HTTPЗапрос(АдресРесурса)");
			сбисHTTPЗапрос.Заголовки = ПараметрыКоманды.Заголовки;
			сбисHTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса, "UTF-8", ИспользованиеBOM);
			РезультатHTTP = Соединение.ОтправитьДляОбработки(сбисHTTPЗапрос);
			Если	РезультатHTTP.КодСостояния = 200 Тогда	
				
				// Код 200 считаем успешным ответом.
				// Код 401 потеряна авторизация, но оценка должна произойти при оценке текста ответа Not authorized
				Результат = РезультатHTTP.ПолучитьТелоКакСтроку();
				
			Иначе	

				// Все остальное - проблемы
				Отказ = Истина;
				// Собрать ошибку со статусом http
				Результат	= МодульОбъектаКлиентСервер().НовыйСбисИсключение("http" + Строка(РезультатHTTP.КодСостояния),"МодульОбъекта.POSTЗапрос_Выполнить");
				// Собрать, собственно, ошибку которую вернул БЛ
				ТелоОшибки	= РезультатHTTP.ПолучитьТелоКакСтроку();
				Результат	= МодульОбъектаКлиентСервер().НовыйСбисИсключение(ТелоОшибки, Результат);
				Возврат Результат;
				
			КонецЕсли;
			
	
		Иначе
			//Формируем параметры к отправке
			
			ИмяФайлаЗапрос	= МодульОбъектаКлиентСервер().НовыйВременныйФайл(,"txt");
			ИмяФайлаОтвет	= МодульОбъектаКлиентСервер().НовыйВременныйФайл(,"txt");
			POSTПараметры = Новый ЗаписьТекста(ИмяФайлаЗапрос, КодировкаТекста.UTF8,, Истина, Символы.ПС);  
			POSTПараметры.Записать(ТекстЗапроса);
			POSTПараметры.Закрыть();			
			
			Если ДопПараметры.СовместимостьSSL Тогда
				
				сбисSSL = Новый ЗащищенноеСоединениеOpenSSL();
				
			Иначе
				
				сбисSSL = Истина;
				
			КонецЕсли;
			
			Соединение = Новый HTTPСоединение(АдресСервера, , , , ПараметрыКоманды.Прокси, , сбисSSL);
			
			Попытка
				
				Соединение.ОтправитьДляОбработки(ИмяФайлаЗапрос, АдресРесурса, ИмяФайлаОтвет, ПараметрыКоманды.Заголовки);
				
			Исключение
				
				ОшибкаВыполненияЗапроса = МодульОбъектаКлиентСервер().НовыйСбисИсключение(
					ИнформацияОбОшибке(),
					МодульОбъектаКлиентСервер_Представление() + "Соединение.ОтправитьДляОбработки",
					300);
				Отказ = Истина;
				
			КонецПопытки;		
			//Читаем ответ
			ЧтениеОтвета = Новый ЧтениеТекста(ИмяФайлаОтвет, КодировкаТекста.UTF8, Символы.ПС);
			Результат = ЧтениеОтвета.Прочитать();
			
			Если	Результат = Неопределено
				И	Отказ Тогда
				
				Возврат ОшибкаВыполненияЗапроса;
				
			КонецЕсли;
			
			ЧтениеОтвета.Закрыть();
			
			МодульОбъектаКлиентСервер().ОсвободитьВременныйФайл(ИмяФайлаЗапрос);
			МодульОбъектаКлиентСервер().ОсвободитьВременныйФайл(ИмяФайлаОтвет);
			
		КонецЕсли;
	Исключение
		
		Отказ = Истина;
		Результат = МодульОбъектаКлиентСервер().НовыйСбисИсключение(
			ИнформацияОбОшибке(),
			МодульОбъектаКлиентСервер_Представление() + "POSTЗапрос.Выполнить");

	КонецПопытки;
	
	//Разберем и оценим результат
	Если Не ДопПараметры.Свойство("ПреобразовыватьДаты", ПреобразовыватьДаты) Тогда
		
		ПреобразовыватьДаты = Истина;
		
	КонецЕсли;
	
	Попытка
		
		РезультатВыполнения = МодульОбъектаКлиентСервер().СбисПрочитатьJSON(Результат,,,ПреобразовыватьДаты);
		
	Исключение
		
		Отказ = Истина;
		
		Если Лев(СокрЛП(Результат), 1) = "{" Тогда     
			
			// кривой json не смогли разобрать
			РезультатВыполнения = МодульОбъектаКлиентСервер().НовыйСбисИсключение(, МодульОбъектаКлиентСервер_Представление() + "РаботаСJSON.СбисПрочитатьJSON",
				785, "Ошибка во входящих данных",
				"Ошибка при разборе ответа от сервера: " + ОписаниеОшибки());
			
		Иначе
			
			// в РезультатКоманды вернулась ошибка строкой
			РезультатВыполнения = МодульОбъектаКлиентСервер().НовыйСбисИсключение(Результат, , , ,);  
			
		КонецЕсли;
		
	КонецПопытки;
	
	Если Отказ Тогда
		
		РезультатОтвет = РезультатВыполнения;
		
	ИначеЕсли РезультатВыполнения.Свойство("error", РезультатОтвет) Тогда
		
		Отказ = Истина;
		РезультатОтвет = МодульОбъектаКлиентСервер().НовыйСбисИсключение(
			РезультатОтвет,
			МодульОбъектаКлиентСервер_Представление() + ПараметрыКоманды.Метод);
		
	ИначеЕсли Не РезультатВыполнения.Свойство("result", РезультатОтвет) Тогда
		
		Если	ДопПараметры.Свойство("ЕстьРезультат")
			И	ДопПараметры.ЕстьРезультат Тогда
			
			Отказ = Истина;
			РезультатОтвет = МодульОбъектаКлиентСервер().НовыйСбисИсключение(
				,
				МодульОбъектаКлиентСервер_Представление() + "POSTЗапрос.Выполнить",
				775,
				"Не удалось получить ответ сервера",
				"Отсутствует результат выполнения метода " + ПараметрыКоманды.Метод + "()");
			
		Иначе
			
			РезультатОтвет = РезультатВыполнения;
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат РезультатОтвет;
	
КонецФункции

//DynamicDirective

Функция GetЗапрос_Выполнить(ПараметрыЗапроса, ДопПараметры, Отказ)
	Перем HTTPСоединение;
	
	ВремяНачалаЗапроса	= ТекущаяДата();
	AnswerType			= "message";
	ПараметрыGET		= ПараметрыЗапроса.Параметры;
	
	Если Не ПараметрыЗапроса.Свойство("ВремяНачала") Тогда
		
		ПараметрыЗапроса.Вставить("ВремяНачала", ВремяНачалаЗапроса);
		
	ИначеЕсли   ДопПараметры.Свойство("Timeout")
			И	ПараметрыЗапроса.ВремяНачала + ДопПараметры.Timeout < ВремяНачалаЗапроса Тогда
		
		Отказ = Истина;//Для избежания зацикливания при формировании файлов, рекурсивно вызываем определенное время.
		Возврат Новый Структура("code, message, details", 100, "Ошибка получения файла", "Превышено время ожидания");
		
	КонецЕсли;
	
	Если Не ПараметрыЗапроса.Свойство("АдресСервера") Тогда
		
		// Указан длинный адрес ресурса, распаковать параметры
		СбисАдресСервера	= СтрЗаменить(СтрЗаменить(ПараметрыGET.АдресРесурса, "://", "/"), "/", Символы.ПС);
		ПараметрыЗапроса.Вставить("Протокол",				СтрПолучитьСтроку(СбисАдресСервера, 1));
		ПараметрыЗапроса.Вставить("АдресСервера",			СтрПолучитьСтроку(СбисАдресСервера, 2));
		ПараметрыЗапроса.Вставить("АдресРесурсаВЗапрос",	Сред(ПараметрыGET.АдресРесурса, Найти(ПараметрыGET.АдресРесурса,
																							ПараметрыЗапроса.АдресСервера) + СтрДлина(ПараметрыЗапроса.АдресСервера) + 1));
		
	КонецЕсли;
	
	Если Не ПараметрыЗапроса.Свойство("ПутьКФайлу") Тогда
		
		РасширениеФайла = Неопределено;
		ПараметрыЗапроса.Параметры.Свойство("Расширение", РасширениеФайла);
		ПараметрыЗапроса.Вставить("ПутьКФайлу", МодульОбъектаКлиентСервер().НовыйВременныйФайл(, РасширениеФайла));
		
    КонецЕсли;
	
	СтрокаСоединения	= "Новый HTTPСоединение(ПараметрыЗапроса.АдресСервера,,,,ПараметрыЗапроса.Прокси,";
	
	//Параметры защищенного соединения
	Если ПараметрыЗапроса.Протокол = "https" Тогда
		
		Если ДопПараметры.СовместимостьSSL Тогда
			
			СтрокаСоединения = СтрокаСоединения + ",Новый ЗащищенноеСоединениеOpenSSL())";
			
		Иначе
			
			СтрокаСоединения = СтрокаСоединения + "Истина)";
			
		КонецЕсли;
		
	Иначе
		
		СтрокаСоединения = СтрокаСоединения + ")";
		
	КонецЕсли;
	
	////В случае переадресации, или ожидания запроса может придти готовое подключение
	//Если Не ДопПараметры.Свойство("Соединение", HTTPСоединение) Тогда
	//	
	HTTPСоединение = Вычислить(СтрокаСоединения);
		
	//КонецЕсли;
	
	//Для старых платформ механизм читеения ответа с проверкой переадресацией отличается
	Если ДопПараметры.СовместимостьHTTP Тогда 
		HTTPЗапрос = Вычислить("Новый HTTPЗапрос(ПараметрыЗапроса.АдресРесурсаВЗапрос)");
		HTTPЗапрос.Заголовки = ПараметрыЗапроса.Заголовки;
		Попытка
			HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос, ПараметрыЗапроса.ПутьКФайлу);
		Исключение
			Отказ = Истина;
			Возврат Новый Структура("code, message,details", 100, "Ошибка получения файла", ОписаниеОшибки());
		КонецПопытки;
		AnswerType = HTTPОтвет.Заголовки.Получить("X-ExceptionType");
		Если	HTTPОтвет.КодСостояния = 500
			Или	AnswerType = "error"
			Или AnswerType = "warning" Тогда
			Отказ = Истина;
		КонецЕсли;
	Иначе
		Попытка
			HTTPСоединение.Получить(ПараметрыЗапроса.АдресРесурсаВЗапрос, ПараметрыЗапроса.ПутьКФайлу, ПараметрыЗапроса.Заголовки);
		Исключение
			Ошибка = ИнформацияОбОшибке();
			Отказ = Истина;
		КонецПопытки;
		Если Отказ Тогда
			HTTPОтвет = Ошибка;
			Пока Не HTTPОтвет.Причина = Неопределено Цикл
				HTTPОтвет = HTTPОтвет.Причина;
			КонецЦикла;
			ПричинаОшибки = HTTPОтвет.Описание;
			КодОшибки = СтрЗаменить(СтрЗаменить(ПричинаОшибки,"(",Символы.ПС), ")", Символы.ПС);
			Попытка
				КодОшибки = Число(СтрПолучитьСтроку(КодОшибки, СтрЧислоСтрок(КодОшибки)));
			Исключение
				Возврат Новый Структура("code,message,details", 100, "Ошибка получения файла", ПричинаОшибки);
			КонецПопытки;
			HTTPОтвет = Новый Структура("КодСостояния", КодОшибки);			
		Иначе	
			//Проверим переадресацию
			СбисПереадресация = Новый ЧтениеТекста(ПараметрыЗапроса.ПутьКФайлу);
			СбисПереадресация = СбисПереадресация.ПрочитатьСтроку();
			Если Найти(СбисПереадресация, "Found. Redirecting to") Тогда
				HTTPОтвет = Новый Структура("КодСостояния, Заголовки", 302, Новый Соответствие);
				HTTPОтвет.Заголовки.Вставить("Location", СокрЛП(СтрПолучитьСтроку(СтрЗаменить(СбисПереадресация, "Redirecting to", Символы.ПС),2)));
			Иначе
				HTTPОтвет = Новый Структура("КодСостояния", 200);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	ДопПараметры.Вставить("Соединение", HTTPСоединение);
	Если Отказ Тогда
		//Смотрим ответ, если пришла ошибка
		ЧтениеТекст = Новый ЧтениеТекста(ПараметрыЗапроса.ПутьКФайлу, "utf-8");
		Попытка
			ТекстАнализОшибки = ЧтениеТекст.Прочитать();
		Исключение
			ТекстАнализОшибки = "Не удалось прочитать ответ: " + ОписаниеОшибки();
		КонецПопытки;
		ЧтениеТекст = Неопределено;
		
		//Читаем файл, чтоб понять что за ошибка нам пришла.
		Если		Найти(ТекстАнализОшибки, "{00000000-0000-0000-0000-1aa0000f1002}") Тогда
			Отказ		= Ложь;
			лТаймаут	= ПараметрыЗапроса.Заголовки.Получить("X-Timeout")/1000;
			Пока ВремяНачалаЗапроса + лТаймаут > ТекущаяДата() Цикл
				//Ожидание по задержке, после чего повторяем запрос.
			КонецЦикла;
			СбисРезультат = GetЗапрос_Выполнить(ПараметрыЗапроса, ДопПараметры, Отказ);
		ИначеЕсли	Найти(ТекстАнализОшибки, "{00000000-0000-0000-0000-1fa0000a0001}") Тогда
			СбисРезультат = Новый Структура("code,message,details", 786, "Ошибка генерации PDF", "Файл невозможно преобразовать в PDF");
		Иначе
			СбисРезультат = Новый Структура("code,message,details", 100, "Ошибка получения файла", ТекстАнализОшибки);
		КонецЕсли;
		
	ИначеЕсли HTTPОтвет.КодСостояния = 302 Тогда
		
		//Делаем переадресацию
		СбисАдресСервера = СтрЗаменить(СтрЗаменить(СтрЗаменить(HTTPОтвет.Заголовки.Получить("Location")	, ПараметрыЗапроса.АдресРесурсаВЗапрос,	"")
																										, ПараметрыЗапроса.Протокол,			"")
																										, "://",		"");
																										
		ПараметрыЗапроса.Вставить("АдресСервера", СбисАдресСервера);
		СбисРезультат = GetЗапрос_Выполнить(ПараметрыЗапроса, ДопПараметры, Отказ);
		
	ИначеЕсли HTTPОтвет.КодСостояния = 404 Тогда
		
		Отказ = Истина;
		СбисРезультат = Новый Структура("code,message,details",
			735,
			"Данная операция недоступна",
			"URL """ + ПараметрыЗапроса.АдресСервера + ПараметрыЗапроса.АдресРесурсаВЗапрос + """ не найден.");
		
	Иначе
		
		HTTPСоединение = Неопределено;
		СбисРезультат = ПараметрыЗапроса.ПутьКФайлу;
		
	КонецЕсли;
	
	Возврат СбисРезультат
	
КонецФункции

//DynamicDirective

//Формирует Прокси по параметрам
Функция СбисСформироватьПрокси(Кэш, Протокол=Неопределено) Экспорт
	Перем СовместимостьМетодов;
	
	МестныйКэшПарам = Кэш.Парам;
	Если МестныйКэшПарам.ТипПрокси = "Вручную" Тогда
		
		// Ручные настройки прокси-сервера.
		ТипЧисло			= Новый ОписаниеТипов("Число");
		ПроксиПорт			= ТипЧисло.ПривестиЗначение(МестныйКэшПарам.ПроксиПорт);
		ПротоколыПрописать	= Новый Массив;
		
		Если Протокол = Неопределено Тогда
			
			ПротоколыПрописать.Добавить("ftp");
			ПротоколыПрописать.Добавить("http");
			ПротоколыПрописать.Добавить("https");
			
		Иначе
			
			ПротоколыПрописать.Добавить(Протокол);
			
		КонецЕсли;
		
		Прокси = Новый ИнтернетПрокси;
			
		Для Каждого ПротоколПрописать Из ПротоколыПрописать Цикл 
			
			Если Кэш.СовместимостьМетодов.HTTPСоединение.ФункцияПолучить Тогда 
				
				Прокси.Установить(ПротоколПрописать, МестныйКэшПарам.ПроксиСервер, ПроксиПорт, МестныйКэшПарам.ПроксиЛогин, МестныйКэшПарам.ПроксиПароль, Ложь);
				
			Иначе
				
				Прокси.Установить(ПротоколПрописать, МестныйКэшПарам.ПроксиСервер, ПроксиПорт);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Прокси.Пользователь								= МестныйКэшПарам.ПроксиЛогин;
		Прокси.Пароль									= МестныйКэшПарам.ПроксиПароль;
		Прокси.НеИспользоватьПроксиДляЛокальныхАдресов	= Истина;
		
	ИначеЕсли МестныйКэшПарам.ТипПрокси = "Автоматически" Тогда
		
		// Системные настройки прокси-сервера.
		Прокси = Новый ИнтернетПрокси(Истина);
		
	Иначе
		
		// Не использовать прокси-сервер.
		Прокси = Новый ИнтернетПрокси(Ложь);
		
	КонецЕсли;
	Возврат Прокси;
КонецФункции

//DynamicDirective

//Функция формирует заголовки для выполнения запроса, аналогично старой, но с измененной структурой
//КэшПарам:
//	Аналогичные параметры из Кэш.
//ДополнительныеПараметры: 
//	ИдСессии	- (Необязательный) ид активной сессии
//	ТаймАут		- (Необязательный) таймаут для заголовка в секундах.
Функция СбисСформироватьЗаголовки(КэшПарам, ДопПараметры) Экспорт
	Перем лТаймАут, лСессия;
	
	Заголовки = Новый Соответствие;
	
	Если Не ДопПараметры.Свойство("ИдСессии", лСессия)  Тогда
		
		лСессия = КэшПарам.ИдентификаторСессии;
		
	КонецЕсли;
	
	Если Не ДопПараметры.Свойство("ТаймАут", лТаймАут) Тогда
		
		лТаймАут = 1;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(лСессия) Тогда
		
		Заголовки.Вставить("X-SBISSessionID",	лСессия);
		
	КонецЕсли;
	
	Заголовки.Вставить("X-Timeout",			Формат(лТаймАут * 1000, "ЧН=0; ЧГ=0"));
	Заголовки.Вставить("Content-Type",		"application/json; charset=utf-8");
	
	Если КэшПарам.Свойство("UserAgent") Тогда
		
		Заголовки.Вставить("User-Agent",	КэшПарам.UserAgent);
		
	Иначе
		
		Заголовки.Вставить("User-Agent",	КэшПарам.ПолнаяВерсияПродукта);  
		
	КонецЕсли;

	Возврат Заголовки;
	
КонецФункции

