
//DynamicDirective

Функция API_СБИС_Аутентифицировать(Кэш, СтруктураПараметровЗапроса, ДопПараметрыВходящие, Отказ)

	ДопПараметры	= Новый Структура("СообщатьПриОшибке, ЕстьРезультат, ИдСессии, АдресРесурса, ОчиститьПараметры", Ложь, Истина, "", "/auth/service/", Истина);
	ИмяМетода		= "СБИС.Аутентифицировать";
	
	Возврат API_ОтправитьИОбработатьКоманду(Кэш, ИмяМетода, СтруктураПараметровЗапроса, ДопПараметры, Отказ);

КонецФункции

//DynamicDirective

Функция API_СБИС_СписокДокументов(Кэш, filter, ДопПараметрыВходящие, Отказ)

	СтруктураПараметровЗапроса = Новый Структура("Фильтр", filter);
	ДопПараметры	= Новый Структура("СообщатьПриОшибке, ЕстьРезультат", Ложь, Истина);
	ИмяМетода		= "СБИС.СписокДокументов";
	
	Возврат API_ОтправитьИОбработатьКоманду(Кэш, ИмяМетода, СтруктураПараметровЗапроса, ДопПараметры, Отказ)
	
КонецФункции

