
// Процедура - выполняет авторизацию на онлайне по сертификату, по логину/паролю, либо по сохраненному ранее идентификатору сессии.
//
// Параметры:
//	ПараметрыАвторизации		 - Структура	 - Параметры авторизации в сбис, аналогично Кэш.Парам. Дополнительный ключ ОписаниеОповещенияОЗакрытииФормыАвторизации для открытия формы авторизации на УФ. 		
//	ДопПараметры				 - Структура	 - расширение
//		ОбработчикРезультата:	 ОписаниеОповещения/Структура с полями "ИмяПроцедуры, ДополнительныеПараметры, Модуль" - обработчик, который будет вызван
//		ПоказатьИнтерфейс:		 Булево (Необязательный, Истина) если не удалось авторизоваться, то будет открыто окно авторизации
//		УстановитьНастройки:	 Булево (Необязательный, Ложь) будут получены и установлены настройки
//		ПолнаяОшибка: 			 Булево (Необязательный, Ложь) если включено, в случае ошибки, будет получен исходный класс ошибки, а не приведенный текст.
//
&НаКлиенте
Процедура ВИ_АвторизоватьсяВSABY(ПараметрыАвторизации = Неопределено, ДопПараметры) Экспорт
	Перем ПоказатьИнтерфейсЕслиНеАвторизованы, ОбработчикРезультата;
	
	ИдСессииСохранен	= МодульОбъектаКлиент().ПолучитьПараметрПользователя("ИдентификаторСессии");
	МодульИнтеграции	= МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция");
	
	Если Не	ДопПараметры.Свойство("ОбработчикРезультата", ОбработчикРезультата) Тогда
			
		ВызватьИсключение "Ошибка авторизации в SABY: Не указан обработчик для продолжения!";
		
	КонецЕсли;
	
	Если Не ДопПараметры.Свойство("ПоказатьИнтерфейс", ПоказатьИнтерфейсЕслиНеАвторизованы) Тогда
	
		ПоказатьИнтерфейсЕслиНеАвторизованы = Истина;
		
	КонецЕсли;
	
	ОбработчикПродолжить = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ВИ_АвторизоватьсяВSABY_Ответ", ЭтаФорма, ДопПараметры);
	
	Если	ЗначениеЗаполнено(ИдСессииСохранен)
		И	МодульИнтеграции.СБИС_ПроверитьСессию(ИдСессииСохранен) Тогда
		
		 МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(ИдСессииСохранен, ОбработчикПродолжить);
		
	Иначе
		
		ДопПараметрыАвторизовать = Новый ФиксированнаяСтруктура("ПоказатьИнтерфейс, ОбработчикПродолжить", ПоказатьИнтерфейсЕслиНеАвторизованы, ОбработчикПродолжить);
		МодульОбъектаКлиент().АвторизоватьсяВSABY(ПараметрыАвторизации, ДопПараметрыАвторизовать);
		
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - обработчик для продолжения авторизации и оценки результата в случае, если открывается форма авторизации
//
// Параметры:
//  Результатавторизации - Произвольный	 - итог авторизации
//  ДопПараметры		 - Произвольный	 - Аргументы для продолжения после авторизации
//
&НаКлиенте
Процедура ВИ_АвторизоватьсяВSABY_Ответ(Результатавторизации = Неопределено, ДопПараметры) Экспорт
	
	Если Результатавторизации = Неопределено Тогда
		
		ОшибкаАвторизации = МодульОбъектаКлиент().НовыйСбисИсключение(, "ВИ.АвторизоватьсяВSABY.Ответ", 719, , "Авторизация не выполнена, так как действие было отменено");
		
	ИначеЕсли МодульОбъектаКлиент().ЭтоТипСбис(Результатавторизации, "СбисИсключение") Тогда
		
		ОшибкаАвторизации = Результатавторизации;
		
	ИначеЕсли	ДопПараметры.Свойство("УстановитьНастройки")
			И	ДопПараметры.УстановитьНастройки Тогда
			
		// Надо сделать полноценный запуск после авторизации
		ВИ_УстановитьНастройки(, ДопПараметры);
		Возврат;
		
	Иначе
		
		// Это обычная авторизация, устанавливать настройки не надо.
		МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(Истина, ДопПараметры.ОбработчикРезультата);
		Возврат;
		
	КонецЕсли;
	
	Если	ДопПараметры.Свойство("ПолнаяОшибка")
		И	ДопПараметры.ПолнаяОшибка Тогда
		
		ОшибкаДляВыдачи = ОшибкаАвторизации;
		
	Иначе
		
		ОшибкаДляВыдачи = МодульОбъектаКлиент().СбисИсключение_Представление(ОшибкаАвторизации, "Сообщение");
		
	КонецЕсли;
	
	МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(ОшибкаДляВыдачи, ДопПараметры.ОбработчикРезультата);
 
КонецПроцедуры

// Процедура выполняет чтение и установку настроек - ини.
//Параметры
//	ПараметрыУстановить			 - Структура	 - сохраненные параметры, идентичные Кэш.Парам, которые настроят запуск с определенными аргументами. Если не указано, то будет восстановлено по текущему пользователю 1С
//	ДопПараметры				 - Структра		 - расширение
//		ОбработчикРезультата:	 ОписаниеОповещения/Структура с полями "ИмяПроцедуры, ДополнительныеПараметры, Модуль" обработчик, который будет вызван после успешного/неудачного запуска
//		ПолнаяОшибка: 			 Булево (Необязательный, Ложь)		если включено, в случае ошибки, будет получен исходный класс ошибки, а не приведенный текст.
//
&НаКлиенте
Процедура ВИ_УстановитьНастройки(ПараметрыУстановить = Неопределено, ДопПараметры) Экспорт
	Перем ОбработчикРезультата;

	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	
	Если Кэш = Неопределено Тогда
		
		ВызватьИсключение "Ошибка установки настроек SABY: Для запуска требуется установить Кэш!";
		
	КонецЕсли;
	
	Если Не	ДопПараметры.Свойство("ОбработчикРезультата", ОбработчикРезультата) Тогда
			
		ВызватьИсключение "Ошибка установки настроек SABY: Не указан обработчик для продолжения!";
		
	КонецЕсли;

	Если Не ПараметрыУстановить = Неопределено Тогда
		
		Для Каждого КлючИЗначение Из ПараметрыУстановить Цикл
			
			МодульОбъектаКлиент().ИзменитьПараметрПользователя(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Попытка
		
		МодульОбъектаКлиент().ЗаполнитьСведенияОПользователеИАккаунте(Новый Структура, Кэш);
		Кэш.ГлавноеОкно.ЗаполнитьКонтекстВО3();
		
	Исключение
		
		ОшибкаУстановкаНастроек = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "ВИ.УстановитьНастройки");;
		
		Если	ДопПараметры.Свойство("ПолнаяОшибка")
			И	ДопПараметры.ПолнаяОшибка Тогда
			
			ОшибкаДляВыдачи = ОшибкаУстановкаНастроек;
			
		Иначе
			
			ОшибкаДляВыдачи = МодульОбъектаКлиент().СбисИсключение_Представление(ОшибкаУстановкаНастроек, "Сообщение");
			
		КонецЕсли;
		
		МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(ОшибкаДляВыдачи, ДопПараметры.ОбработчикРезультата);
		
		Возврат;
		
	КонецПопытки;
	
	сбисПрочитатьНастройки(Кэш);
	
	//Записываем версию в данные реквизитов формы
	Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("НоваяВерсия") Тогда
		
		МодульОбъектаКлиент().ИзменитьПараметрСбис("ПредВерсия", Кэш.ПараметрыСистемы.Обработка.Версия);
		ПараметрыЗаписи = Новый Структура("ВыполнитьВручную, Парам", Истина, Кэш.Парам);
		Кэш.ГлавноеОкно.сбисСохранитьЗначения(ПараметрыЗаписи);
		
	КонецЕсли;
	
	МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(Истина, ДопПараметры.ОбработчикРезультата);
	
КонецПроцедуры
	
// Функция читает настройки пользователя, выполняет обновление настроек при изменении версии и проверку при изменении настроек
//Параметры
//	Кэш:						структура, кэш обработки Sbis1C
//	ДополнительныеПараметры:	резерв
//
//Возвращает
//	Истина, если ини прошли проверку и успешно установлены.
&НаКлиенте
Функция сбисПрочитатьНастройки(Кэш, ДополнительныеПараметры=Неопределено) Экспорт	

	//Чтение подготовленных настроек 
	Кэш.ГлавноеОкно.сбисПолучитьУстановитьНастройки(Кэш, Ложь);
	Кэш.Вставить("ИниВПорядке", Кэш.КэшНастроек.ИниВПорядке);//Обратная совместимость роботов и ВФК
	Возврат Кэш.КэшНастроек.ИниВПорядке;
	
КонецФункции

// Функция формирует структуру кэша обработки, включает обмен со СБИС.
//ДополнительныеПараметры:		необязательная структура, может содержать поля, аналогичные Кэш.Парам (функция ВосстановитьПараметрыПользователя) При наличии заменяет одноименные поля в кэш.парам.
//                              пример изменения способа обмена: Новый Структура("СпособОбмена", 0); (sdk:0, каталог:1, API:3, extSDK:4, extSDK с шифрованием:5 extSDK2:6, extSDK2 с шифрованием: 7)
//Возвращает
//	Структуру кэш в случае успешного заполнения параметров и активации обмена. 
//	Строку ошибки включения обмена при неудаче
&НаКлиенте
Функция сбисПодготовитьКэш(ДопПараметры=Неопределено, Отказ=Ложь) Экспорт	
	
	Перем КлючУникальности;
	
	Если НЕ	(	ЗначениеЗаполнено(ДопПараметры) 
			И	ДопПараметры.Свойство("КлючУникальности", КлючУникальности)) Тогда
		КлючУникальности = Неопределено;
	КонецЕсли; 
	
	ГлавноеОкно = УстановитьФормуВладельца(КлючУникальности);
	
	Если НЕ ЗначениеЗаполнено(ДопПараметры) Тогда  
		ДопПараметры = Новый Структура;
	КонецЕсли;  
	
	ДопПараметры.Вставить("КлючУникальности", КлючУникальности);

	ПараметрыПередать = Новый Структура("ТихийРежим", Истина);
	ПараметрыПередать.Вставить("Парам",						ДопПараметры);
	ПараметрыПередать.Вставить("РежимЗапускаГлавногоОкна",	"ВнешнийИнтерфейс");
	РезультатПодготовки = ГлавноеОкно.ПослеОткрытияЗаполнитьКэш(ПараметрыПередать, Отказ);
	Если Отказ Тогда
		Возврат РезультатПодготовки.message + "(" + РезультатПодготовки.details + ")";
	КонецЕсли;
	Кэш			= РезультатПодготовки;
	ОбменВключен= Кэш.Интеграция.Включить(Кэш, ДопПараметры, Отказ);
	Если Не ОбменВключен = Истина Тогда   // если не удалось включить SDK или Плагин
		Отказ = Истина;
		Возврат ОбменВключен;
	КонецЕсли;

	Возврат Кэш;
КонецФункции

&НаКлиенте
Функция УстановитьФормуВладельца(КлючУникальностиВладельца)

	УстановитьГлавноеОкно = Истина;
	
	Если Не ВладелецФормы = Неопределено Тогда
				
		Если ВладелецФормы.КлючУникальности = КлючУникальностиВладельца Тогда
			
			Попытка
				
				ГлавноеОкно 			= ВладелецФормы;
				Кэш						= ГлавноеОкно.Кэш;
				УстановитьГлавноеОкно	= Ложь;
				
			Исключение
				
				Сообщить("Установленный владелец формы не является формой ""Главное окно""");
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если УстановитьГлавноеОкно Тогда
		
		ИмяОбработкиПолучить = "ФормаГлавноеОкно";
		Если Не ИмяФормы = Неопределено Тогда
			
			ИмяОбработкиПолучить = Сред(ИмяФормы, 1, СтрДлина(ИмяФормы) - 16) + ИмяОбработкиПолучить;
			
		КонецЕсли;
		
		ГлавноеОкно		= ПолучитьФорму(ИмяОбработкиПолучить, , КлючУникальности);
		Кэш				= ГлавноеОкно.Кэш;
		ВладелецФормы	= ГлавноеОкно;
		
	КонецЕсли;
	
	Возврат ГлавноеОкно;
	
КонецФункции

