
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	ОбработкаОповещенияОбработчик(ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещенияТиповойОбработчик(ИмяСобытия, Параметр, Источник)
	
	// Закрытие формы просмотра при закрытии обработки	
	Если ИмяСобытия = "SABY.ПриЗавершенииРаботы" Тогда
		
		Если Не ПараметрыФормы = Неопределено Тогда
			
			ПараметрыФормы.Вставить("РежимЗакрытия", "ЗавершениеРаботы");
			
		КонецЕсли;

		Если ЭтаФорма.Открыта() Тогда
			
			ЭтаФорма.Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

