
#Область include_local_СистемныеИнтерфейсы_ИнтерфейсныйМодуль_СобытияФормы_ПриОткрытии
#КонецОбласти

&НаКлиенте
Процедура ПриОткрытииТиповойОбработчик(Отказ)
	Перем ФормаИнициирована;
	
	Если	Не	ПараметрыФормы = Неопределено
		И		ПараметрыФормы.Свойство("Инициирована", ФормаИнициирована)
		И		ФормаИнициирована Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Отказ = Истина;
	ИсключениеОткрытие = МодульОбъектаКлиент().НовыйСбисИсключение(735, НазваниеКратко() + ".ПриОткрытииПроверитьСтатус",,,"Форма " + НазваниеКратко() + " не была инициирована.");
	МодульОбъектаКлиент().СообщитьСбисИсключение(ИсключениеОткрытие, Новый Структура("Отложенно", Истина));
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Закрыть();
		
	#КонецЕсли
	
КонецПроцедуры

