
#Область include_core_base_Транспорт_ИмяСвойстваТранспорта //&НаКлиенте
#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьКонтекстВО3() Экспорт
	Если Не МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ВключитьВО3") Тогда
		Возврат;
	КонецЕсли;
	Если Не Кэш.КэшНастроек.ИниВПорядке Тогда
		Возврат;
	КонецЕсли;

	last_event = get_prop(context_params,"last_event", Новый Структура);
	last_event.Вставить("date", Формат(ДатаПоследнегоЗапросаСтатусов, "ДФ='dd.MM.yyyy HH.mm.ss'"));
	context_params.Вставить("last_event",last_event);
	
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
	ТранспортИнтеграции.ВладелецФормы = ЭтаФорма;
	#КонецЕсли
	Если BlocklyExecutor = Неопределено Тогда
		BlocklyExecutor = ПолучитьФормуBlockly(ЭтаФорма);		
	КонецЕсли;
	BlocklyExecutor.ИнициироватьТранспорт(ТранспортИнтеграции);
	
	context_params.Вставить("Тема", Тема);
	//context_params.Вставить("ConnectionId", Кэш.КэшНастроек.ВыбранныеНастройки.Идентификатор);
	////context_param.Вставить("DemoLicense", get_prop(connection_info, "DemoLicense"));
	//
	//fio = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("Пользователь");  
	//ИдАккаунта = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ИдАккаунта");
	//СтруктураАккаунтФИО = Новый Структура;
	//СтруктураАккаунтФИО.Вставить("account", ИдАккаунта);
	//СтруктураАккаунтФИО.Вставить("user_fio", СокрЛП(fio));
	//ТранспортИнтеграции.ЗаписатьСессию(context_params, СтруктураАккаунтФИО);
	//
	//connection_info = Новый Соответствие();
	//connection_info.Вставить("ConnectionId", Кэш.КэшНастроек.ВыбранныеНастройки.Идентификатор);
	//connection_info.Вставить("ExtSysSettingsId", Кэш.КэшНастроек.ВыбранныеНастройки.ПараметрыКонфигурации.subsystem);
	
	Попытка
		//BlocklyExecutor.ПослеПолученияПодключения(context_params, connection_info);
		ТранспортИнтеграции.ПослеАутентификации(context_params);
	Исключение
		ТекущийРаздел.Вставить("Шаблон", "СтраницаЗаглушка");
		ИнфОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфОбОшибке);
		type = get_prop(СтруктураОшибки, "type");
		Если type = "ChooseIntegration" Тогда 
			ПарамФормы = Новый Структура;
			ПарамФормы.Вставить("context_params", ЭтаФорма.context_params);	
			ПарамФормы.Вставить("МассивИнтеграций", get_prop(СтруктураОшибки, "dump", Новый Массив));	
			ОткрытьФормуОбработки("ВыборИнтеграции", ПарамФормы, ЭтаФорма,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Возврат;
		КонецЕсли;
		Картинка = КартинкаОшибка();
		ПоказатьОповещениеПользователя(
			"Ошибка",,
			СтруктураОшибки.message,
			Картинка);
	КонецПопытки;
	
	Попытка
		КэшФорм.ИменаФорм = ФормыПросмотра();
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
		СбисИсключение = МодульОбъектаКлиент().НовыйСбисИсключение(, "ФормаГлавноеОкно.ЗаполнитьКонтекстВО3", , СтруктураОшибки.message, СтруктураОшибки.detail);
		СбисСообщитьОбОшибке(Кэш, СбисИсключение, Новый Структура("ФормаВладелец", ЭтаФорма));
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОчисткуСессииВО3()  
	Если get_prop(ЭтаФорма.context_params, "AutoAuth", Ложь) = Ложь Тогда
		ВыйтиНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ЭтотОбъектНаКлиенте() 
	Возврат ЭтаФорма;
КонецФункции
