
&НаКлиенте
Процедура ПроверитьИУстановитьКэш(СбисДополнительныеПараметры = Неопределено)
	Перем ПараметрыПользователяВходящие;
	
	ДопПараметры = Новый Структура;
	
	Если ЗначениеЗаполнено(СбисДополнительныеПараметры)
		И СбисДополнительныеПараметры.Свойство("Парам", ПараметрыПользователяВходящие)
		И ПараметрыПользователяВходящие.Свойство("КлючУникальности") Тогда
		
		ДопПараметры.Вставить("КлючУникальности", СбисДополнительныеПараметры.Парам.КлючУникальности);
		
	КонецЕсли;

	
	Попытка
		
		ТекущийМодульОбъекта = МодульОбъектаКлиент(ДопПараметры);
		
	Исключение
		
		ВызватьИсключение("Возникла неизвестная ошибка при запуске обработки. Модуль объекта не был получен: " + ОписаниеОшибки());
		
	КонецПопытки;
	
	Если			ТекущийМодульОбъекта = Неопределено Тогда
		
		ВызватьИсключение("Возникла неизвестная ошибка при запуске обработки. Модуль объекта не был определен.");
		
	ИначеЕсли Не	ТекущийМодульОбъекта.ГлобальныйКэш = Неопределено Тогда 
		
		Если ЗначениеЗаполнено(ПараметрыПользователяВходящие) Тогда
			
			ТекущийМодульОбъекта.ИзменитьПараметрыСбисМассово(ПараметрыПользователяВходящие);
			
		КонецЕсли;	

		// считаем, что всё ок если глобальный кэш был установлен
		Возврат;
		
	КонецЕсли;
	
	Попытка
		
		ТекущийМодульОбъекта.НастроитьКэшОбработки(ЭтаФорма);
		
	Исключение
		
		СообщениеОшибки			= "Ошибка настройки стартовых параметров обработки.";
		ИсходнаяОшибкаСтарта	= ТекущийМодульОбъекта.НовыйСбисИсключение(ИнформацияОбОшибке(), "ФормаГлавноеОкно.ПроверитьИУстановитьКэш"); 
		ОшибкаУстановкиКэш 		= ТекущийМодульОбъекта.НовыйСбисИсключение(ИсходнаяОшибкаСтарта,, 703, СообщениеОшибки, ИсходнаяОшибкаСтарта.details);
		ВызватьИсключение(ТекущийМодульОбъекта.СбисИсключение_Представление(ОшибкаУстановкиКэш, "ПолныйТекст"));
		
	КонецПопытки;
	
	УстановитьСтартовыеПараметрыПользователя(СбисДополнительныеПараметры);
	
КонецПроцедуры

// Процедура заполняет структуру Кэша	
&НаКлиенте
Функция КэшПодготовить(СбисДополнительныеПараметры=Неопределено, Отказ=Ложь) Экспорт
    Перем ТекущийМодульОбъекта;
	
	СбисПоказатьСостояние("Установка параметров");
	
	ПроверитьИУстановитьКэш(СбисДополнительныеПараметры);
	
	Возврат Кэш;
	
КонецФункции

&НаКлиенте
Процедура УстановитьСтартовыеПараметрыПользователя(СбисДополнительныеПараметры = Неопределено) Экспорт
	
	ТекущийМодульОбъекта = МодульОбъектаКлиент();
	
	Если ЗначениеЗаполнено(СбисДополнительныеПараметры) Тогда
		
		Для Каждого КлючИЗначение Из СбисДополнительныеПараметры Цикл
			
			Если КлючИЗначение.Ключ = "Парам" Тогда
				
				Продолжить;
				
			ИначеЕсли КлючИЗначение.Ключ = "РежимЗапускаГлавногоОкна" Тогда
				
				РежимЗапускаГлавногоОкна = КлючИЗначение.Значение;
				Продолжить;
				
			КонецЕсли;
			
			Кэш.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ВосстановитьПараметрыПользователя(СбисДополнительныеПараметры);
	
	ТекущийМодульОбъекта.ОбновитьПараметрГлобальногоМодуля("Парам",	Кэш.Парам);
	ТекущийМодульОбъекта.ИзменитьПараметрSABY("АдресСервера",		Кэш.Парам.АдресСервера);
	ТекущийМодульОбъекта.ИзменитьПараметрSABY("ТихийРежим",			Кэш.ТихийРежим);
	
	РежимОтладкиПереключить = ТекущийМодульОбъекта.ПараметрSABY("УстановитьОтладку", "Технический");
	Если РежимОтладкиПереключить = Истина Тогда
		
		ТекущийМодульОбъекта.ИзменитьПараметрSABY("РежимОтладки",		Истина);
		ТекущийМодульОбъекта.ИзменитьПараметрSABY("УстановитьОтладку",, "Технический");
		
	КонецЕсли;
	
КонецПроцедуры

//Устанавливает в Кэш формы для работы с настройками и методами работы с сервисом
&НаКлиенте
Функция ОпределитьИнтеграциюРабочиеФормы(Кэш, ПараметрыИнтеграции, СбисДополнительныеПараметры=Неопределено)	Экспорт
	
	Если СбисДополнительныеПараметры = Неопределено Тогда
		СбисДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	Если НЕ СбисДополнительныеПараметры.Свойство("ВызыватьРекурсивно") Тогда
		СбисДополнительныеПараметры.Вставить("ВызыватьРекурсивно", Истина);
	КонецЕсли;
	Если НЕ СбисДополнительныеПараметры.Свойство("ВключатьОбмен") Тогда
		СбисДополнительныеПараметры.Вставить("ВключатьОбмен", Истина);
	КонецЕсли;
	
	//Переделал передачу параметров на структуру, чтобы нормально добавить адрес сервера и его дальнейшую передачу
	ПараметрыИнтеграции_До = Новый Структура("СпособОбмена, СпособХраненияНастроек, АдресСервера");
	ЗаполнитьЗначенияСвойств(ПараметрыИнтеграции_До, ПараметрыИнтеграции);
	
	сбисПоказатьСостояние("Подключение SDK", ЭтаФорма);
	
	СбисМодульИнтеграции	= МодульОбъектаКлиент().ПараметрSABY("Интеграция", "ТекущийСеанс");
	МодульНастроек			= МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("Настройки");
	
	Если СбисМодульИнтеграции = Неопределено Тогда
		
		МодульОбъектаКлиент().ИзменитьПараметрСбис("СпособОбмена", ПараметрыИнтеграции.СпособОбмена);
		СбисМодульИнтеграции = МодульОбъектаКлиент().ПараметрSABY("Интеграция", "ТекущийСеанс");
		
	КонецЕсли;
	
	Если МодульНастроек = Неопределено Тогда
		
		ОпределитьФормуРаботыСНастройками(Кэш, ПараметрыИнтеграции.СпособОбмена, ПараметрыИнтеграции.СпособХраненияНастроек);
		МодульНастроек = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("Настройки");
		
	КонецЕсли;
	
	ВключениеВыполнено = Ложь;
	Если СбисДополнительныеПараметры.ВызыватьРекурсивно Тогда
		Результат = МодульНастроек.УстановитьПараметрыИнтеграции_ДоВключения(Кэш, ПараметрыИнтеграции, СбисДополнительныеПараметры, ВключениеВыполнено);
		Если ВключениеВыполнено Тогда//Если менялись параметры соединения, например, изменен в каталоге изменен адрес сервера, то включение уже выполнялось через рекурсивный вызов и повторно делать незачем
			сбисСпрятатьСостояние(ЭтаФорма);
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	ОбменВключен	= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ОбменВключен");
	ОшибкаВключения	= Ложь;
	
	// Включаем интеграцию сразу, только если не вызов извне и запуск не был отменен специально
	Если СбисДополнительныеПараметры.ВключатьОбмен Тогда
		
		МодульНастроек.сбисПодключитьЗаплатки(Кэш, Кэш.Парам);
		СведенияОбИнтеграции	= МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("СведенияОбИнтеграции");
		
		// Точка входя для включения обмена через ВФК (например, чтобы запустить плагин силами 1С)
		ИмяИнтеграции			= СведенияОбИнтеграции.Имя;
		СбисМодульИнтеграции	= МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("Включить", ИмяИнтеграции);
		Если СбисМодульИнтеграции = Ложь Тогда
			
			СбисМодульИнтеграции = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("Интеграция");
			
		КонецЕсли;
		ОбменВключен = СбисМодульИнтеграции.Включить(Кэш, ПараметрыИнтеграции, ОшибкаВключения);
		
		Если	ОшибкаВключения
			И	СбисДополнительныеПараметры.Свойство("ПолнаяОшибка")
			И	СбисДополнительныеПараметры.ПолнаяОшибка Тогда
			
			Возврат ОбменВключен;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ТихийРежим") Тогда

		УстановитьЭлементыПоТекущейИнтеграции();
		
	КонецЕсли;

	Если Не ОбменВключен = Истина Тогда
		
		сбисСпрятатьСостояние(ЭтаФорма);
		Если	СбисДополнительныеПараметры.Свойство("ПолнаяОшибка")
			И	СбисДополнительныеПараметры.ПолнаяОшибка Тогда
			
			Возврат МодульОбъектаКлиент().НовыйСбисИсключение(775102, "ФормаГлавноеОкно.ОпределитьИнтеграциюРабочиеФормы");
			
		Иначе
		
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;

	//Дошли досюда, значит всё должно быть включено. Проверим, что в процессе включения ничего не поменялось 
	УспешноУстнановлено = Истина;
	ЗначениеПараметра = Неопределено;
	Для Каждого КлючИЗначение Из ПараметрыИнтеграции_До Цикл
		Если Не ПараметрыИнтеграции.Свойство(КлючИЗначение.Ключ, ЗначениеПараметра) 
			Или ЗначениеПараметра= КлючИЗначение.Значение Тогда
			Продолжить;
		КонецЕсли;
		УспешноУстнановлено = Ложь;
		Прервать;
	КонецЦикла;

	сбисСпрятатьСостояние(ЭтаФорма);
	Возврат УспешноУстнановлено;	
	
КонецФункции

//Устанавливает в Кэш форму, в зависимости от установленного способа обмена
&НаКлиенте
Процедура ОпределитьФормуИнтеграции(ЛокальныйКэш, ВидОбмена) Экспорт
	
	МодульОбъектаКлиент().ИзменитьПараметрСбис("СпособОбмена", ВидОбмена);	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЭлементыПоТекущейИнтеграции() Экспорт
	Перем ЗаголовокИнтеграции;
	
	СведенияОбИнтеграции	= МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("СведенияОбИнтеграции");
	НадписьВерсия			= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ВерсияИнтеграции");
	
	Если СведенияОбИнтеграции.Свойство("Актуален") И Не СведенияОбИнтеграции.Актуален Тогда
		
		ШрифтДляТекста = Новый Шрифт(,8,Истина,,Истина);
		
		НадписьВерсия.ЦветТекста	= WebЦвета.Красный;
		НадписьВерсия.Шрифт			= ШрифтДляТекста;
		НадписьВерсия.Гиперссылка	= Истина;
		
	Иначе
		
		ШрифтДляТекста = Новый Шрифт(,8); 
		НадписьВерсия.ЦветТекста	= WebЦвета.Черный;
		НадписьВерсия.Шрифт			= ШрифтДляТекста;
		НадписьВерсия.Гиперссылка	= Ложь;
		
	КонецЕсли;
	
	ВерсияИнтеграции	= СведенияОбИнтеграции.Версия;
	Если Не СведенияОбИнтеграции.Свойство("Заголовок", ЗаголовокИнтеграции) Тогда
		
		ЗаголовокИнтеграции	= СведенияОбИнтеграции.Имя;
		
	КонецЕсли;
		
	ЗаголовокНадписи = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ВерсияИнтеграции.Надпись");
	ЗаголовокНадписи.Заголовок = ЗаголовокИнтеграции;	
	
КонецПроцедуры

//Устанавливает в Кэш форму, в зависимости от выбранного способа хранения настроек
&НаКлиенте
Процедура ОпределитьФормуРаботыСНастройками(ЛокальныйКэш, ВидОбмена, ВидХраненияНастроек, ПараметрыИнициализации=Неопределено) Экспорт
	
	МодульИнтеграцииЛокальный	= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("Интеграция",	Новый Структура("ЛокальныйКэш", ЛокальныйКэш));
	СведенияОбИнтеграции		= МодульИнтеграцииЛокальный.СведенияОбИнтеграции(); 
	Если		ВидХраненияНастроек = 1
		И Не	СведенияОбИнтеграции.Параметры.ДоступныСерверныеНастройки Тогда
		ВидХраненияНастроек	= 0;
	КонецЕсли;
	
	МодульОбъектаКлиент().ИзменитьПараметрСбис("СпособХраненияНастроек", ВидХраненияНастроек, Новый Структура("Параметры", ПараметрыИнициализации));
	
КонецПроцедуры

// Начальное заполнение всех необходимых для работы объектов	
&НаКлиенте
Функция ПослеОткрытияЗаполнитьКэш(СбисДополнительныеПараметры=Неопределено, Отказ=Ложь) Экспорт
	
	РезультатПодготовки = КэшПодготовить(СбисДополнительныеПараметры, Отказ);
	
	Если Отказ Тогда
		Возврат РезультатПодготовки;
	КонецЕсли;

	СбисОбновитьЗаголовокФормы(Кэш.СБИС);
	ОпределитьИнтеграциюРабочиеФормы(Кэш, Кэш.Парам);
	
	Возврат Кэш;
	
КонецФункции

// Обработчик для Веб-клиента	
&НаКлиенте
Процедура ПослеУстановитьРасширениеРаботыСФайлами(ДопПараметры = Неопределено) Экспорт
	
	СтартОбработкиВО2(, ДопПараметры);
	
КонецПроцедуры

// Начально заполнение всех необходимых для работы объектов	
&НаКлиенте
Процедура СтартОбработкиВО2(АргументВыполнение = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	ОтказЗапуска = Ложь;
	ДополнительныеПараметрыКэша = Новый Структура;
	ДополнительныеПараметрыКэша.Вставить("РежимЗапускаГлавногоОкна", "Обычный");
	РезультатЗапуска = ПослеОткрытияЗаполнитьКэш(ДополнительныеПараметрыКэша, ОтказЗапуска);
	
	Если ОтказЗапуска Тогда
		
		СбисСообщитьОбОшибке(Кэш, РезультатЗапуска);
		
	ИначеЕсли МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ОтложенныйЗапуск") Тогда
		
		// ничего не делаем
		Возврат;
		
	Иначе
		
		//СбисПодготовитьРеестрДлительныхОпераций(); TODO раскомментировать, когда потребуется.
		ПослеОткрытияАвторизация();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОткрытияАвторизация(СбисДополнительныеПараметры = Неопределено) Экспорт
	Перем ОбработчикПродолжить;
	
	Если СбисДополнительныеПараметры = Неопределено Тогда
		
		СбисДополнительныеПараметры = Новый Структура;	
		
	КонецЕсли;
	
	ОбработчикПродолжить = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("сбисПослеАвторизации", ЭтаФорма, СбисДополнительныеПараметры);
	
	// Авторизация
	сбисПоказатьСостояние("Авторизация", ЭтаФорма);
	
	context_params = СБИСПараметры();
	ОткрытьФормуАвторизацииПриОтсутствииСессии(context_params, ТранспортИнтеграции, ОбработчикПродолжить, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура сбисПоследняяВерсия(Кэш)
	Отказ = Ложь;
	сбисВерсияНаСервере = Кэш.ОбщиеФункции.сбисПолучитьНомерВерсииОбработкиПоПараметрам(Кэш, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

// Процедура заполняет сохраняемые параметры обработки
//
// Параметры:
//  СбисДополнительныеПараметры	 - Структура - дополнителные параметры функции
//
&НаКлиенте
Процедура ВосстановитьПараметрыПользователя(СбисДополнительныеПараметры = Неопределено) Экспорт
	Перем ПараметрыПользователяВходящие, ВосстановленныйПараметрПользователя;
	
	МодульТекущий = МодульОбъектаКлиент();
	
	ЗначПоУмолчанию = МодульТекущий.ПараметрыСбисПоУмолчанию();
	
	// Восстановить сохраненные параметры пользователя
	Попытка
		
		ПараметрыВосстановлены = СбисСохраненныеЗначения();
		
	Исключение
		
		МодульТекущий.СбисСообщить(ИнформацияОбОшибке(), "ФормаГлавноеОкно.ВосстановитьПараметрыПользователя");
		ПараметрыВосстановлены = Новый Соответствие;
		
	КонецПопытки;
	
	Если		СбисДополнительныеПараметры = Неопределено
		Или	Не	СбисДополнительныеПараметры.Свойство("Парам", ПараметрыПользователяВходящие)Тогда
		
		ПараметрыПользователяВходящие = Новый Структура;
		
	КонецЕсли;
	
	// Описание параметров, которые всегда должны быть восстановлены значением по-умолчанию
	ПараметрыНеВосстанавливаются = Новый Массив;
	ПараметрыНеВосстанавливаются.Добавить("ЧтениеНастроекПоТребованию");
	ПараметрыНеВосстанавливаются.Добавить("РежимОтладки");
	ПараметрыНеВосстанавливаются.Добавить("UserAgent");
	ПараметрыНеВосстанавливаются.Добавить("ПолнаяВерсияПродукта");
	
	// Описание параметров, которые если оказались сохраненными пустыми, то должны быть восстановлены значением по-умолчанию
	ПараметрыНеМогутБытьПустыми = Новый Массив;
	ПараметрыНеМогутБытьПустыми.Добавить("ЗаписейНаСтранице1С");
	ПараметрыНеМогутБытьПустыми.Добавить("ЗаписейНаСтранице");
	ПараметрыНеМогутБытьПустыми.Добавить("РеквизитКодаНоменклатуры");
	ПараметрыНеМогутБытьПустыми.Добавить("АдресСервера");
	
	Для Каждого КлючИЗначениеДефолт Из ЗначПоУмолчанию Цикл
		
		Если Не ПараметрыПользователяВходящие.Свойство(КлючИЗначениеДефолт.Ключ, ВосстановленныйПараметрПользователя) Тогда
			
			Если ПараметрыНеВосстанавливаются.Найти(КлючИЗначениеДефолт.Ключ) = Неопределено Тогда

				ВосстановленныйПараметрПользователя = ПараметрыВосстановлены.Получить(КлючИЗначениеДефолт.Ключ);
				
			КонецЕсли;
			
			Если	Не ПараметрыНеМогутБытьПустыми.Найти(КлючИЗначениеДефолт.Ключ) = Неопределено
				И	Не ЗначениеЗаполнено(ВосстановленныйПараметрПользователя) Тогда
				
				ВосстановленныйПараметрПользователя = КлючИЗначениеДефолт.Значение;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВосстановленныйПараметрПользователя = Неопределено	Тогда
			
			ВосстановленныйПараметрПользователя = КлючИЗначениеДефолт.Значение;
			
		КонецЕсли;
		
		Кэш.Парам.Вставить(КлючИЗначениеДефолт.Ключ, ВосстановленныйПараметрПользователя);
		
	КонецЦикла;	
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Кэш.Парам);
	
	ВерсияБылаСохранена = Кэш.Парам.ПредВерсия;
	ЭтоПервыйЗапуск		= ВерсияБылаСохранена = Неопределено;
	ЭтоНоваяВерсия		= Не	ЭтоПервыйЗапуск
						И		МодульТекущий.СбисНоваяВерсия(Кэш.ПараметрыСистемы.Обработка.Версия, ВерсияБылаСохранена);
						
	МодульТекущий.ИзменитьПараметрТекущегоСеанса("ПервыйЗапуск",	ЭтоПервыйЗапуск);
	МодульТекущий.ИзменитьПараметрТекущегоСеанса("НоваяВерсия",		ЭтоНоваяВерсия);
	
	
КонецПроцедуры

&НаКлиенте
Процедура СбисПослеСменыАккаунта(Результат, СбисДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
		// Отмена изменения аккаунта
		Возврат;
		
	КонецЕсли;
	
	СбисПослеАвторизации(Результат, СбисДополнительныеПараметры)
	
КонецПроцедуры
	
&НаКлиенте
Процедура СбисПослеАвторизации(Результат, СбисДополнительныеПараметры) Экспорт

	ЕстьИзмененияАккаунта = Ложь;
	Если Результат = Неопределено Тогда
		
		// Отмена действия
		Если Не МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("Авторизован") Тогда
			
			// Если авторизации нет и дейтсвие отменено, то завершить работу
			МодульОбъектаКлиент().ИзменитьПараметрПользователя("ЗапомнитьПароль",		Ложь);
			МодульОбъектаКлиент().ИзменитьПараметрПользователя("ЗапомнитьСертификат",	Ложь);
			МодульОбъектаКлиент().ЗавершитьРаботуSABY();
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	context_params = Результат;
	Session = ТранспортИнтеграции.УИДСессии(context_params);
	МодульОбъектаКлиент().ИзменитьПараметрСбис("ИдентификаторСессии", Session);
	МодульОбъектаКлиент().ИзменитьПараметрСбис("Авторизован",	Истина);
	
	ОбновитьЗаголовокФормы();
	
	Пользователь_До	= Пользователь;
	Попытка
		МодульОбъектаКлиент().ЗаполнитьСведенияОПользователеИАккаунте(Новый Структура, Кэш);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		СбисСообщитьОбОшибке(Кэш, Кэш.ОбщиеФункции.СбисИсключение(ИнфОбОшибке, "сбисПослеАвторизации")); 
	КонецПопытки;
	
	ЕстьИзмененияОбмена			= Не (СпособОбмена			= Кэш.Парам.СпособОбмена);
	ЕстьИзмененияНастроек		= Не (СпособХраненияНастроек= Кэш.Парам.СпособХраненияНастроек);
	ЕстьИзмененияПользователя	= Не (Пользователь_До		= Пользователь) И Не Пользователь_До = "";
	
	Если СбисДополнительныеПараметры = Неопределено Тогда
		
		СбисДополнительныеПараметры = Новый Структура;
		
	КонецЕсли;
	Если ЕстьИзмененияОбмена Тогда
		ИзмененияОбмена = Новый Структура("СпособОбмена, СпособОбменаДо", Кэш.Парам.СпособОбмена, СпособОбмена);
		Если СбисДополнительныеПараметры.Свойство("ИзмененияОбмена") Тогда
			СбисДополнительныеПараметры.ИзмененияОбмена = ИзмененияОбмена;	
		Иначе
			СбисДополнительныеПараметры.Вставить("ИзмененияОбмена", ИзмененияОбмена);	
		КонецЕсли;
	КонецЕсли;
	Если	СбисДополнительныеПараметры.Свойство("ИзмененаФормаНастроек")
		И	СбисДополнительныеПараметры.ИзмененаФормаНастроек Тогда
		ЕстьИзмененияНастроек = Истина;
	КонецЕсли;
	Если ЕстьИзмененияНастроек Тогда
		//был изменен способ хранения настроек. Нужно будет перечитать список доступных конфигураций, если соберёмся в раздел файлов.
		СбисДополнительныеПараметры.Вставить("ИзмененаФормаНастроек", Истина);
		Кэш.ФормаНастроек.ПараметрыРаботы.Вставить("ИзмененаФормаНастроек",	Истина);
	КонецЕсли;
	Если ЕстьИзмененияПользователя Тогда
		//был изменен пользователь. Для серверных настроек понадобится перечитать подключение.
		Кэш.ФормаНастроек.ПараметрыРаботы.Вставить("ИзменениеПользователя",	Истина);
	КонецЕсли;
	Если	СбисДополнительныеПараметры.Свойство("АккаунтИзменился")
		И	СбисДополнительныеПараметры.АккаунтИзменился Тогда
		//был изменен пользователь. Для серверных настроек понадобится перечитать подключение.
		Кэш.ФормаНастроек.ПараметрыРаботы.Вставить("ИзменениеАккаунта",		Истина);
		ЕстьИзмененияАккаунта = Истина;
	КонецЕсли;

	СпособХраненияНастроек		= Кэш.Парам.СпособХраненияНастроек;
	СпособОбмена				= Кэш.Парам.СпособОбмена;
	КаталогОбмена				= Кэш.Парам.КаталогОбмена;
	ШифроватьВыборочно			= Кэш.Парам.ШифроватьВыборочно;
	КаталогНастроек				= Кэш.Парам.КаталогНастроек;
	ИнтеграцияAPIВызовыНаКлиенте= Кэш.Парам.ИнтеграцияAPIВызовыНаКлиенте;
	
	Если	ЕстьИзмененияНастроек
		Или	ЕстьИзмененияПользователя 
		Или ЕстьИзмененияАккаунта Тогда
		СбисДополнительныеПараметры.Вставить("ОбновитьКонтент", Истина);
	КонецЕсли;
	
	ПослеОткрытияЗавершение(СбисДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокФорм()
	СписокФорм = Новый СписокЗначений;
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		МетаданныеФорм = ЭтотОбъект.Метаданные().Формы;
	#Иначе
		МетаданныеФорм = РеквизитФормыВЗначение("Объект").Метаданные().Формы;
	#КонецЕсли	
	Для Каждого Фрм Из МетаданныеФорм Цикл
		СписокФорм.Добавить(Фрм.Имя);	
	КонецЦикла;
	Возврат СписокФорм;
КонецФункции

&НаКлиенте
Процедура СбисПодготовитьРеестрДлительныхОпераций()
	фрм = сбисПолучитьФорму("ФормаДлительныеОперации",,,ЭтаФорма);
	фрм.ПодготовитьРеестрКРаботе();		
КонецПроцедуры
