
#Область include_core_base_Транспорт_ИмяСвойстваТранспорта //&НаКлиенте
#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьКонтекстВО3()
	Если Не МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ВключитьВО3") Тогда
		Возврат;
	КонецЕсли;
	Если Не Кэш.КэшНастроек.ИниВПорядке Тогда
		Возврат;
	КонецЕсли;
	Если context_params = Неопределено Тогда
		context_params = Новый Структура();
	КонецЕсли;
	АдрСервера = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("АдресСервера");
	АдрСервера = СтрЗаменить(АдрСервера, "online.", "ie-1c.");
	АдрСервера = СтрЗаменить(АдрСервера, ".sbis", ".saby");
	АдрСервера = Лев(АдрСервера, СтрДлина(АдрСервера) - 1);
	context_params.Вставить("api_url", АдрСервера);
	context_params.Удалить("Proxy");
	ТипПрокси = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ТипПрокси");
	Если ТипПрокси = "Вручную" Тогда
		Proxy = Новый Структура;
		Порт = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ПроксиПорт");
		ТипЧисло  = Новый ОписаниеТипов("Число");
		Порт = ТипЧисло.ПривестиЗначение(Порт);
		АдресСервераСтр	= СтрЗаменить(АдрСервера, ":", Символы.ПС);
		Proxy.Вставить("Protocol", СтрПолучитьСтроку(АдресСервераСтр, 1));
		Proxy.Вставить("Server", МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ПроксиСервер"));
		Proxy.Вставить("Port", Порт);
		Proxy.Вставить("User", МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ПроксиЛогин"));
		Proxy.Вставить("Password", МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ПроксиПароль"));
		context_params.Вставить("Proxy", Proxy);
	КонецЕсли;
	
	ИмяСвойстваТранспорта = ИмяСвойстваТранспорта();
	Если СпособОбмена = 6 Или СпособОбмена = 7 Тогда
		context_params.Вставить(ИмяСвойстваТранспорта, "ExtSdk2");
	ИначеЕсли СпособОбмена = 8 Тогда
		context_params.Вставить(ИмяСвойстваТранспорта, "SabyPluginConnector");
	ИначеЕсли СпособОбмена = 9 Тогда
		context_params.Вставить(ИмяСвойстваТранспорта, "SabyHttpsClient");
	Иначе
		context_params.Вставить(ИмяСвойстваТранспорта, "API");
	КонецЕсли;

	ИдентификаторСессии = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ИдентификаторСессии");
	СтруктураСессии = Новый Структура;
	СтруктураСессии.Вставить("session", ИдентификаторСессии);
	// BSLLS:DeprecatedCurrentDate-off
	СтруктураСессии.Вставить("session_begin", ТекущаяДата());
	// BSLLS:DeprecatedCurrentDate-on
	ТранспортИнтеграции.ЗаписатьСессию(context_params, СтруктураСессии);

	last_event = get_prop(context_params,"last_event", Новый Структура);
	last_event.Вставить("date", Формат(ДатаПоследнегоЗапросаСтатусов, "ДФ='dd.MM.yyyy HH.mm.ss'"));
	context_params.Вставить("last_event",last_event);
	
	ТранспортИнтеграции.ВладелецФормы = ЭтаФорма;
	BlocklyExecutor.ИнициироватьТранспорт(ТранспортИнтеграции);
	
	ДопПараметры = Новый Структура("СтруктураАккордеона", АккордеонЭДО);
	Попытка
		КэшФорм.ИменаФорм = ПослеОткрытияНаКлиенте(ДопПараметры);
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
		СбисИсключение = МодульОбъектаКлиент().НовыйСбисИсключение(, "ФормаГлавноеОкно.ЗаполнитьКонтекстВО3", , СтруктураОшибки.message, СтруктураОшибки.detail);
		СбисСообщитьОбОшибке(Кэш, СбисИсключение, Новый Структура("ФормаВладелец", ЭтаФорма));
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Функция ЭтотОбъектНаКлиенте() 
	Возврат ЭтаФорма;
КонецФункции
