
////////////////////////////////////////////////////
//////////Переделано для совместимости ОФ УФ////////

//Процедура открывает карточку документа на сайте online.saby.ru	
&НаКлиенте
Функция ОткрытьДокументОнлайнПоПакету(Пакет, Кэш, ДопПараметры = Неопределено) Экспорт
	ОткрытьОнлайн = Ложь;
	Ссылка = ""; 
	
	Если НЕ ДопПараметры = Неопределено
		И ДопПараметры.Свойство("ОткрытьОнлайн") Тогда
		ОткрытьОнлайн = ДопПараметры.ОткрытьОнлайн;
	КонецЕсли;
	
	ОбработчикРезультата = Кэш.ОбщиеФункции.СбисОписаниеОповещения(Кэш, "ОткрытьДокументОнлайнПоПакетуЗавершение", ЭтаФорма, Новый Структура("Кэш, Отказ", Кэш, Ложь)); 
	Если Кэш.Текущий.Раздел = "1" или Кэш.Текущий.Раздел = "2" или Кэш.Текущий.Раздел = "8" или Кэш.Текущий.Раздел = "7" Тогда
		Кэш.ОбщиеФункции.СбисВыполнитьОписаниеОповещения(Кэш, Новый Структура("Ссылка, Пакет", Пакет.СсылкаДляНашаОрганизация, Пакет), ОбработчикРезультата); 
	ИначеЕсли Кэш.Текущий.Раздел = "3" или Кэш.Текущий.Раздел = "4" Тогда
		//UAA НоваяЛента
		
		ПараметрыПакетаСБИС = Кэш.ОбщиеФункции.ИдентификаторСБИСПоДокументу(Кэш, Пакет);	
		МодульОбъектаКлиент().КомандаОткрытьДокументОнлайн(Новый Структура("Пакет, ПараметрыПакетаСБИС", Пакет, ПараметрыПакетаСБИС), Новый Структура("Кэш, ОбработчикРезультата, ОткрытьОнлайн", Кэш, ОбработчикРезультата, ОткрытьОнлайн));			
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьДокументОнлайнПоПакетуЗавершение(Результат, ДопПараметры) Экспорт
	Перем СоздатьЧерновик;
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		Сообщить(Результат);
		Возврат;
	ИначеЕсли ДопПараметры.Отказ Тогда
		СбисСообщитьОбОшибке(ДопПараметры.Кэш, Результат);
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(Результат.Ссылка) Тогда
		Сообщить("Вероятно, документ был удален в Saby");
		Возврат;
	КонецЕсли;	
	
	//1190434889
	Если ДопПараметры.Кэш.Парам.СоздаватьЧерновик 
		И ДопПараметры.Свойство("СоздатьЧерновик",СоздатьЧерновик) 
		И СоздатьЧерновик Тогда
		Возврат;
	КонецЕсли;
	
	Если	ДопПараметры.Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение
		И	ДопПараметры.Кэш.Текущий.Раздел = "8" Тогда
		//Для ОФ временно не доступно
		Отказ = Ложь;
		Попытка
			фрм = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ПоказатьДокументОнлайн", "ФормаHTML", ДопПараметры)
		Исключение
			МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), Новый Структура("ИмяКоманды", "ГлавноеОкно.ОткрытьДокументОнлайнПоПакетуЗавершение"));	
			Возврат;
		КонецПопытки;
		Если фрм = Ложь Тогда
			Сообщить("Не удалось получить форму просмотра документа");
			Возврат;
		КонецЕсли;
		фрм.ПоказатьДокументОнлайн(ДопПараметры.Кэш, Результат.Ссылка, Результат.Пакет);
	Иначе
		ЗапуститьПриложение(Результат.Ссылка);
	КонецЕсли;
КонецПроцедуры

//Процедура инициирует перезапуск главной формы.
//Флаги характеризуют глубину перезапуска.
//Флаг изменения интеграции означает, чтонеобходима повторная авторизация
//Флаг изменения формы настроек означает сброс собранных настроек для повторной обработки, переустановку параметров и проверку необходимости авторизации, если там что-то изменено.
&НаКлиенте
Процедура ПерезапуститьГлавноеОкно(ПараметрыИнтеграции, ИзмененаИнтеграция=Истина,ИзмененаФормаНастроек=Истина)	Экспорт
		
	ПовторАвторизации = Ложь;
	СпособОбменаДо = Кэш.Парам.СпособОбмена;
	
	Если ИзмененаИнтеграция Тогда          
		ПовторАвторизации = Истина;
		Если	(ПараметрыИнтеграции.СпособОбмена = 7	Или Кэш.Парам.СпособОбмена = 7)
			И	(ПараметрыИнтеграции.СпособОбмена = 6	Или Кэш.Парам.СпособОбмена = 6) Тогда
			//Идентичные модули, переавторизация не требуется
			ПовторАвторизации = Ложь;
		КонецЕсли;

		Если Кэш.Парам.СпособОбмена = 1 и Не ЗначениеЗаполнено(Кэш.Парам.КаталогОбмена) Тогда
			КаталогОбменаНачалоВыбора(сбисЭлементФормы(ЭтаФорма, "КаталогОбмена"),"", Истина);
		КонецЕсли;
		СбисДополнительныеПараметры = Новый Структура("ВызыватьРекурсивно", Ложь);
		ОпределитьИнтеграциюРабочиеФормы(Кэш, ПараметрыИнтеграции, СбисДополнительныеПараметры);  
	Иначе//Интеграцию не меняли, однако могли быть изменены параметры обмена, настроек и сервера в сбисПараметрах. Проверить параметры и запустить авторизацию, если надо
		Если ИзмененаФормаНастроек Тогда
			ОпределитьФормуРаботыСНастройками(Кэш, ПараметрыИнтеграции.СпособОбмена, ПараметрыИнтеграции.СпособХраненияНастроек);
		КонецЕсли;
		Кэш.ФормаНастроек.УстановитьПараметрыИнтеграции_ДоВключения(Кэш, ПараметрыИнтеграции, Новый Структура("ВызыватьРекурсивно", Истина), ПовторАвторизации);
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Кэш.Парам, ПараметрыИнтеграции);
	Если Не ИзмененаФормаНастроек Тогда
		ИзмененаФормаНастроек = (Не СпособХраненияНастроек = Кэш.Парам.СпособХраненияНастроек);
	КонецЕсли;
	//Если в процессе поменялось в параметрах, то отображаем и на Главном окне
	СпособОбмена			= Кэш.Парам.СпособОбмена;
	СпособХраненияНастроек	= Кэш.Парам.СпособХраненияНастроек;
	
	ПараметрыЗавершения = Новый Структура;
	ПараметрыЗавершения.Вставить("ПовторныйЗапуск",			Истина);
	ПараметрыЗавершения.Вставить("ИзмененаФормаНастроек",	ИзмененаФормаНастроек);
	ПараметрыЗавершения.Вставить("РазделДо",				Кэш.Текущий.ТипДок);
	Если ПараметрыИнтеграции.СпособОбмена <> СпособОбменаДо Тогда 
		ПараметрыЗавершения.Вставить("ИзмененияОбмена", Новый Структура("СпособОбмена, СпособОбменаДо", ПараметрыИнтеграции.СпособОбмена, СпособОбменаДо));
	КонецЕсли;
	
	Если ПовторАвторизации Тогда
		ПослеОткрытияАвторизация(ПараметрыЗавершения);
	Иначе
		Если ИзмененаФормаНастроек Тогда
			КэшНастроек = МодульОбъектаКлиент().ГлобальныйКэш_Получить("КэшНастроек");
			МодульОбъектаКлиент().КэшНастроек_Очистить(КэшНастроек, "ОчиститьСобранныеНастройки");
		КонецЕсли;
		ПослеОткрытияЗавершение(ПараметрыЗавершения);
	КонецЕсли;

	Если Не ИзмененаФормаНастроек Тогда
		Если Кэш.Парам.СпособХраненияНастроек = 1 Тогда
			ФормаАвторизации = СбисПолучитьФорму("Вход",,,ЭтаФорма);
			Если ФормаАвторизации.Открыта() Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		СтруктураНастроек = Кэш.ФормаНастроек.ПолучитьПараметрыСБИС(Кэш, Кэш.Парам.ИдентификаторНастроек);
		Если СтруктураНастроек.Свойство("ИспользоватьГенератор") Тогда
			Кэш.Парам.ИспользоватьГенератор = СтруктураНастроек.ИспользоватьГенератор; 
	        ИспользоватьГенератор = СтруктураНастроек.ИспользоватьГенератор; 
		КонецЕсли;
		Если СтруктураНастроек.Свойство("СпособОбмена") Тогда
			Кэш.ФормаНастроек.СохранитьПараметрыСБИС(Кэш,Новый Структура("СпособОбмена", СпособОбмена), Кэш.Парам.ИдентификаторНастроек);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПерейтиВРаздел(СбисИмяРаздела, ДопПараметры=Неопределено) Экспорт
	
	Если Не Кэш.Свойство("ОбщиеФункции") Тогда
		Сообщить("При запуске обработки произошла ошибка. Переход по разделам заблокирован");
		Возврат Ложь;
	КонецЕсли;
	ИнициализацияРаботыВыделенияСтрок();

#Область include_local_ГлавноеОкноПерейтиВРаздел	
#КонецОбласти

КонецФункции

&НаКлиенте
Функция ПерейтиВРазделВО2(РазделВО2Перейти, ДопПараметры=Неопределено)
	
	Если ДопПараметры = Неопределено Тогда 
		
		ДопПараметры = Новый Структура;
		
	КонецЕсли;
	
	МодульОбъектаКлиент = МодульОбъектаКлиент();
	
	Если МодульОбъектаКлиент.ЭтоТипСбис(РазделВО2Перейти, "РазделГО") Тогда
		
		// Переходим в уже настроенный раздел
		Выбор = РазделВО2Перейти;
		
	Иначе
		
		Если ПустаяСтрока(РазделВО2Перейти) Тогда
		
			РазделВО2Перейти = СбисПолучитьИмяКнопкиПоРазделу(Кэш.Парам.РазделПоУмолчанию);
			
		КонецЕсли;
		
		ДопПараметры.Вставить("ТекущийРаздел", Кэш.Текущий);
		Выбор = МодульОбъектаКлиент.НовыйРазделГО(РазделВО2Перейти, ДопПараметры);
		
	КонецЕсли;
	
	Если МодульОбъектаКлиент.РазделГО_Пустой(Выбор)  Тогда
		
		// Пустой раздел. Отменяем переход
		Возврат Ложь;
		
	КонецЕсли;
	
	Предыдущий	= Выбор.ПредыдущийРаздел;
	Кэш.Текущий	= Выбор;
	Отказ		= Ложь;
	
	Попытка

		МодульОбъектаКлиент.РазделГО_ПрименитьФильтр(Выбор);
		МодульОбъектаКлиент.РазделГО_Подготовить(Выбор);
		СтруктураДляОбновленияФормы = Выбор.Форма.ОбновитьКонтент(Кэш);
		Если МодульОбъектаКлиент.ЭтоТипСбис(СтруктураДляОбновленияФормы, "СбисИсключение") Тогда
			
			СбисИсключение = СтруктураДляОбновленияФормы;
			Отказ = Истина;
			
		КонецЕсли;
		
	Исключение
		
		СбисИсключение = МодульОбъектаКлиент.НовыйСбисИсключение(	ИнформацияОбОшибке(),
																	"ФормаГлавноеОкно.ПерейтиВРазделВО2",
																	,
																	,
																	"Произошла ошибка при переходе в раздел " + Выбор.ОписаниеРаздела.Название + ". Переход прерван.");
		Отказ = Истина;
		
	КонецПопытки;
	
	

	Если Отказ Тогда 
		
		Если СбисИсключение.code = 779 
			И СбисИсключение.extcode = 201 Тогда
			
			СбисИсключение = МодульОбъектаКлиент.НовыйСбисИсключение(СбисИсключение,"ФормаГлавноеОкно.ПерейтиВРазделВО2",,"Неправильно указана сторона фильтрации"); 
			
		КонецЕсли;
		
		МодульОбъектаКлиент.СообщитьСбисИсключение(СбисИсключение, Новый Структура("Отправлять", Ложь));
		
		Если Не СбисИсключение.code = 304 Тогда
			ПерейтиВРазделВО2_НачатьВосстановлениеРаздела(Выбор, ДопПараметры);
		КонецЕсли;
		// Не получилось перейти в новый раздел, выйти, вернуть неудачу
		Возврат Ложь;
		
	КонецЕсли;
	
	МодульОбъектаКлиент.РазделГО_СохранитьФильтр(Предыдущий);
	
	// Выполнить подготовку раздела
	фрм = МодульОбъектаКлиент.НайтиФункциюСеансаОбработки("ОбновитьКонтентПодговитьРаздел", Выбор.ОписаниеРаздела.ФормыРаздела);
	Если Не фрм = Ложь Тогда
		
		// Сделаем общую, предваритульную подготовку раздела
		Попытка

			ПараметрыПодготовки		= Новый Структура("Выбор, ДанныеОбновить", Выбор, СтруктураДляОбновленияФормы);
			ДопПараметрыПодготовки	= Новый Структура("Кэш", Кэш);
			фрм.ОбновитьКонтентПодговитьРаздел(ПараметрыПодготовки, ДопПараметрыПодготовки);
			
		Исключение
			
			СбисИсключение = МодульОбъектаКлиент.НовыйСбисИсключение(	ИнформацияОбОшибке(),
																		"ФормаГлавноеОкно.ПерейтиВРазделВО2",
																		773,
																		,
																		"Произошла ошибка при подготовке раздела " + Выбор.ОписаниеРаздела.Название + ". Переход прерван.");
			МодульОбъектаКлиент.СообщитьСбисИсключение(СбисИсключение);
			Отказ = Истина;
				
		КонецПопытки;
		
		Если Отказ Тогда 
			
			ПерейтиВРазделВО2_НачатьВосстановлениеРаздела(Выбор, ДопПараметры);
			// Не получилось перейти в новый раздел, выйти, вернуть неудачу
			Возврат Ложь;
				
		КонецЕсли;
	
	КонецЕсли;

	// Обновляем данные на форме главного окна
	Попытка
		
		ОбновитьПоляФормы(СтруктураДляОбновленияФормы);
		ПерейтиВРазделВО2_ОФ(Выбор);	
	
	Исключение
		
		СбисИсключение = МодульОбъектаКлиент.НовыйСбисИсключение(ИнформацияОбОшибке(), "ФормаГлавноеОкно.ПерейтиВРазделВО2");
		МодульОбъектаКлиент.СообщитьСбисИсключение(СбисИсключение);
		Отказ = Истина;
		
	КонецПопытки;

	Если Отказ Тогда 
		
		ПерейтиВРазделВО2_НачатьВосстановлениеРаздела(Выбор, ДопПараметры);
		Возврат Ложь;
		
	КонецЕсли;  
			
	фрм = МодульОбъектаКлиент.НайтиФункциюСеансаОбработки("сбисОформлениеДопПолейРеестра", Выбор.ОписаниеРаздела.ФормыРаздела);
	
	Если фрм <> Ложь Тогда
		
		фрм.сбисОформлениеДопПолейРеестра(Кэш);
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПерейтиВРазделВО2_ОФ(РазделГО, ДопПараметры=Неопределено)
	
	Если Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Предыдущий = РазделГО.ПредыдущийРаздел;
	// Прячем пользовательские параметры фильтра предыдущего раздела
	Если	ЗначениеЗаполнено(Предыдущий) 
		И	ЗначениеЗаполнено(Предыдущий.ОписаниеРаздела.Номер) Тогда
		
		ФормаДопФильтраПред = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("сбисСписокДопПараметровФильтра",
																				Предыдущий.ОписаниеРаздела.ФормыФильтра);

		Если ФормаДопФильтраПред <> ложь Тогда
			
			СкрытьДополнительныеПараметрыФильтра(ФормаДопФильтраПред);
			
		КонецЕсли;
		
	КонецЕсли;
	// Устанавливаем пользовательские параметры фильтра для текущего раздела
	
	ФормаДопФильтра = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("сбисСписокДопПараметровФильтра",
																		РазделГО.ОписаниеРаздела.ФормыФильтра);
	
	Если ФормаДопФильтра <> ложь Тогда
		
		ПоказатьДополнительныеПараметрыФильтра(ФормаДопФильтра);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВРазделВО2_НачатьВосстановлениеРаздела(АргументВосстановить, ДопПараметры) Экспорт
	
	ПерейтиВопрос = Ложь;
	
	Если МодульОбъектаКлиент().ЭтоТипСбис(АргументВосстановить, "РазделГО") Тогда
		
		РазделВО2Текущий = АргументВосстановить;
		Если РазделВО2Текущий.ПредыдущийРаздел = Неопределено Тогда
			
			РазделВО2Перейти	= МодульОбъектаКлиент().НовыйРазделГО("АккордеонПолученные11");
			
		Иначе 
			
			РазделВО2Перейти	= РазделВО2Текущий.ПредыдущийРаздел;
			
		КонецЕсли;
		
	Иначе
		
		РазделВО2Текущий			= ДопПараметры.РазделБыл;
		РазделВО2Перейти			= ДопПараметры.РазделПерейти;
		Если АргументВосстановить	= КодВозвратаДиалога.Нет Тогда
		
			Таблица_РеестрДокументов.Очистить();
			Таблица_РеестрСобытий.Очистить();
			МодульОбъектаКлиент().СбисСообщить("Отображение реестра может работать некорректно!");
			Возврат;
						
		КонецЕсли;
		
	КонецЕсли;
	
	Если РазделВО2Текущий.Имя = РазделВО2Перейти.Имя Тогда
		
		// Тот же раздел, ничего не делать
		Возврат;
		
	КонецЕсли;
	
	Если ДопПараметры = Неопределено Тогда
		
		ДопПараметры = Новый Структура;
		
	ИначеЕсли	ДопПараметры.Свойство("ВосстановлениеРаздела")
			И	ДопПараметры.ВосстановлениеРаздела Тогда
	
		Таблица_РеестрДокументов.Очистить();
		Таблица_РеестрСобытий.Очистить();
		МодульОбъектаКлиент().СбисСообщить("Переход невозможен. Отображение реестра может работать некорректно!");
		Возврат;
		
	КонецЕсли;
	
	Если Не ДопПараметры.Свойство("ПерейтиВопрос") Тогда
			
		ПерейтиВопрос = Истина;

	КонецЕсли;
	
	ДопПараметры.Вставить("ПерейтиВопрос", ПерейтиВопрос);
	
	Если ПерейтиВопрос Тогда
		
		ТекстВопроса = "Возникла ошибка при переходе в раздел " + РазделВО2Текущий.ОписаниеРаздела.Название + ".
		|Вернуться в предыдущий?";
		ДопПараметры.Вставить("РазделПерейти",	РазделВО2Перейти);
		ДопПараметры.Вставить("РазделБыл",		РазделВО2Текущий);
		ОбработчикПосле = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПерейтиВРазделВО2_НачатьВосстановлениеРаздела", ЭтаФорма, ДопПараметры);
		МодульОбъектаКлиент().СбисПоказатьВопрос(ОбработчикПосле, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;	

	ДопПараметры.Вставить("ВосстановлениеРаздела", Истина);
			
	// Выставить структуру аккорденона без раздела, чтобы потом кодом переключилось правильно
	СформироватьСтруктуруАккордеона(Аккордеон);
	
	// Переход делаем отложенно, чтобы сперва сработал клик на аккордеоне, а потом уже он переставился.
	ОтложенноПерейти = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПерейтиВРазделВО2_ВосстановитьРаздел", ЭтаФорма, ДопПараметры);
	МодульОбъектаКлиент().ПодключитьОтложенноеДействие(ОтложенноПерейти, РазделВО2Перейти);
		
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВРазделВО2_ВосстановитьРаздел(РазделПерехода, ДопПараметры=Неопределено) Экспорт

	СформироватьСтруктуруАккордеона(Аккордеон, Новый Структура("Раздел", РазделПерехода));
	ПерейтиВРазделВО2(РазделПерехода, ДопПараметры);

КонецПроцедуры

//Функция открывает окно диалога выбора папки
&НаКлиенте
Функция сбисВыбратьКаталог(лТекущийКаталог, Отказ=Ложь) Экспорт
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	ДиалогОткрытия.Каталог		= лТекущийКаталог;
	ДиалогОткрытия.Заголовок	= "Выберите каталог"; 
	Если ДиалогОткрытия.Выбрать() Тогда 
		Возврат Кэш.ОбщиеФункции.СбисФорматКаталога(ДиалогОткрытия.Каталог, Кэш.ПараметрыСистемы.Клиент)
	Иначе
		Отказ = Истина;
		Возврат лТекущийКаталог;
	КонецЕсли;
КонецФункции

//Дописывает окончание к выбранному каталогу.
&НаКлиенте
Функция сбисФорматКаталога(лТекущийКаталог) Экспорт
	Возврат лТекущийКаталог + ?(Прав(лТекущийКаталог, 1) = "\", "", "\");	
КонецФункции

//Процедура завершает текущую сессию на онлайне и предлагает авторизоваться, в случае авторизации обновляет информацию на главном окне	
&НаКлиенте
Процедура сбисВыйти() Экспорт
	
	Попытка
		
		МодульОбъектаКлиент().СбисДействияПриВыходеИзАккаунта();
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		СбисСообщитьОбОшибке(Кэш, ИнформацияОбОшибке);
		
	КонецПопытки;
	
	Кэш.Интеграция.ЗакрытьСессию(Кэш);
	СбисДополнительныеПараметры	= Новый Структура("ПовторныйЗапуск, РазделДо", Истина, Кэш.Текущий.ТипДок);
	ОбработчикПосле			= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("сбисПослеАвторизации", ЭтаФорма, СбисДополнительныеПараметры);
    МодульОбъектаКлиент().ИзменитьПараметрСбис("ИдентификаторСессии", "");
	ВыйтиИОткрытьАвторизацию(ОбработчикПосле);	
КонецПроцедуры

// Процедура проверяет структуру настроек, обновляет данные на форме об установленных настройках, заполняет разделы Продажа и Покупка подразделами	
&НаКлиенте
Процедура СбисОбновитьИнформациюНастроекНаГлавномОкне(ЛокальныйКэш, УстановленныеИниФайлы=Неопределено, Отказ=Ложь) Экспорт

	Если ЛокальныйКэш.ТихийРежим Тогда
		Возврат;
	КонецЕсли;
	
	СбисОбновитьЗаголовокФормы(ЛокальныйКэш.СБИС); 

КонецПроцедуры

&НаКлиенте
Процедура СбисОбновитьЗаголовокФормы(ОсновныеПараметрыФормы, ДопПараметры=Неопределено) 
	НовыйЗаголовок		= ОсновныеПараметрыФормы.ПараметрыИнтеграции.ПредставлениеСервера;
	ДобавитьКЗаголовку	= "";
	Если Не ОсновныеПараметрыФормы.ПараметрыИнтеграции.Пользователь = Неопределено Тогда
		МассивФИО = Кэш.ОбщиеФункции.РазбитьСтрокуВМассивНаКлиенте(ОсновныеПараметрыФормы.ПараметрыИнтеграции.Пользователь, " ");
		Если МассивФИО.Количество() = 3 Тогда
			ДобавитьКЗаголовку = МассивФИО[0] + " " + Лев(МассивФИО[1], 1) + "." + Лев(МассивФИО[2], 1) + ".";
		Иначе
			ДобавитьКЗаголовку = ОсновныеПараметрыФормы.ПараметрыИнтеграции.Пользователь;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОсновныеПараметрыФормы.ПараметрыИнтеграции.Демо) Тогда
		Если Не ПустаяСтрока(ДобавитьКЗаголовку) Тогда
			ДобавитьКЗаголовку = ДобавитьКЗаголовку + " ";
		КонецЕсли;
		Если ОсновныеПараметрыФормы.ПараметрыИнтеграции.Демо > ТекущаяДата() Тогда
			ДобавитьКЗаголовку = ДобавитьКЗаголовку + "Демо-версия до " + Формат(ОсновныеПараметрыФормы.ПараметрыИнтеграции.Демо, "ДФ=dd.MM.yyyy");
		Иначе
			ДобавитьКЗаголовку = ДобавитьКЗаголовку + "Пробный период истек";
		КонецЕсли;
	КонецЕсли;
	Если Не ПустаяСтрока(ДобавитьКЗаголовку) Тогда 
		ИдАккаунта = ОсновныеПараметрыФормы.ПараметрыИнтеграции.ИдАккаунта; 
		Если ЗначениеЗаполнено(ИдАккаунта) Тогда
			ДобавитьКЗаголовку = ДобавитьКЗаголовку + ", аккаунт " + ИдАккаунта;
		КонецЕсли;  	
		НовыйЗаголовок = НовыйЗаголовок + " (" + ДобавитьКЗаголовку + ")";
	КонецЕсли;
	ЭтаФорма.Заголовок = НовыйЗаголовок;
КонецПроцедуры

//Проверяет, что строка является каталогом и открывает его в проводнике
&НаКлиенте
Процедура сбисОткрытьКаталог(ВыбранныйКаталог) Экспорт
	Попытка
		Файл = Новый Файл(ВыбранныйКаталог);
		Если Файл.ЭтоКаталог() Тогда
			ЗапуститьПриложение(ВыбранныйКаталог);
		Иначе
			Сообщить("Неверно указан путь к каталогу настроек.");
		КонецЕсли;
	Исключение
		Сообщить("Не удалось открыть каталог настроек.");
	КонецПопытки;
КонецПроцедуры

//Процедура вызывает очистку сохраненного кэша настроек ини
&НаКлиенте
Процедура сбисОчиститьКэшНастроек() Экспорт 
	Кэш.ФормаНастроек.сбисОчиститьКэшНастроек(Кэш);
КонецПроцедуры

// Функция возвращает название раздела в аккордеоне по красивому названию.
&НаКлиенте
Функция СбисПолучитьИмяКнопкиПоРазделу(РазделТест) Экспорт
	
	Если РазделТест = "Полученные" Тогда
		Возврат "АккордеонПолученные11";
	ИначеЕсли РазделТест = "Отправленные" Тогда
		Возврат "АккордеонОтправленные22";
	ИначеЕсли РазделТест = "Продажа" Тогда
		Возврат "АккордеонПродажаДок033";
	ИначеЕсли РазделТест = "Учет" Тогда
		Возврат "АккордеонУчетДок077";
	ИначеЕсли	РазделТест = "Задачи"
			И	Найти("34567", Строка(Кэш.Парам.СпособОбмена)) Тогда
		Возврат "АккордеонЗадачи88";
	Иначе
		Возврат "АккордеонПокупкаДок044";
	КонецЕсли;
	
КонецФункции

//Не использовать! Использовать с формы работы с настройками общее
//Вызов получения и установки настроек
&НаКлиенте
Процедура СбисПолучитьУстановитьНастройки(ЛокальныйКэш, СказатьЧтоВсеХорошо, Отказ=Ложь) Экспорт
	Попытка
		Кэш.ФормаНастроекОбщее.СбисПолучитьИУстановитьНастройкиВКэш(Новый Структура("ПринудительнаяПроверка, ПродолжитьУстановку", СказатьЧтоВсеХорошо, Истина), Кэш)
	Исключение
		Отказ = Истина;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		СбисОшибка = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке, "ФормаГлавноеОкно.СбисПолучитьУстановитьНастройки");
		СбисСообщитьОбОшибке(ЛокальныйКэш, СбисОшибка, Новый Структура("ФормаВладелец", ЭтаФорма));
	КонецПопытки;
КонецПроцедуры

//Формирует структуру раздела по его имени из аккордеона. Вынесено в отделную функцию для внешнего интерфейса.
&НаКлиенте
Функция сбисСтруктураВыбранногоРаздела(ЛокальныйКэш, ИмяВыбранногоРаздела) Экспорт
	
	Возврат МодульОбъектаКлиент().НовыйРазделГО(ИмяВыбранногоРаздела);

КонецФункции

&НаКлиенте
Процедура сбисПослеПросмотраНовости(Результат) Экспорт
	
	Если Результат = Неопределено ИЛИ Кэш = Неопределено Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

//Функция меняет в указанной таблице колонки
&НаСервере
Процедура НастроитьКолонкиФормы(СтруктраДляОбновленияФормы) Экспорт
	Перем ДобавитьКолоноки, УдалитьКолонки;
	
	СтруктураПолей	= СтруктраДляОбновленияФормы.СтруктураПолей;
	
	Если СтруктураПолей.Свойство("КолонкиИзменить")	Тогда	
		КолонкиТаблицы	= ЭтаФорма;
		ПутьККолонкам	= СтрЗаменить(СтруктраДляОбновленияФормы.ПутьККолонкам, ".",	Символы.ПС);
		Для	шаг = 1 По СтрЧислоСтрок(ПутьККолонкам)	Цикл
			КолонкиТаблицы	= КолонкиТаблицы[СтрПолучитьСтроку(ПутьККолонкам,шаг)];
		КонецЦикла;
		Для	Каждого ДанныеКолонки Из СтруктураПолей.КолонкиИзменить	Цикл
			ИмяКолонки		= ДанныеКолонки.ПолноеИмяКолонки;
			КолонкаТаблицы	= КолонкиТаблицы.Найти(ИмяКолонки);                           
			Если	КолонкаТаблицы = Неопределено	Тогда
				Продолжить;
			КонецЕсли;
			
			Для	Каждого	ПараметрРеактировать Из ДанныеКолонки.ПараметрыИзменить	Цикл
				Попытка
					КолонкаТаблицы[ПараметрРеактировать.Ключ]	= ПараметрРеактировать.Значение;
				Исключение
					Продолжить;
				КонецПопытки;
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;                                                                         
	
	Если СтруктураПолей.Свойство("КолонкиДобавить", ДобавитьКолоноки) Тогда
		КвалификаторыСтроки = Новый КвалификаторыСтроки();
		ОписаниеТипа = Новый ОписаниеТипов("Строка", ,КвалификаторыСтроки);
		      
		#Если Не ТолстыйКлиентОбычноеПриложение Тогда
		// Добавление колонок таблицы значений
			ТЧ = РеквизитФормыВЗначение(СтруктраДляОбновленияФормы.ИмяТаблицы);
			ДобавляемыеРеквизиты = Новый Массив;
			НомерПоследнего = ДобавитьКолоноки.ВГраница();
			Для Индекс = 0 По НомерПоследнего Цикл
				Если ТЧ.Колонки.Найти(ДобавитьКолоноки[Индекс]) = Неопределено Тогда
					НовРеквизит = Новый РеквизитФормы(ДобавитьКолоноки[Индекс], ОписаниеТипа, СтруктраДляОбновленияФормы.ИмяТаблицы, ДобавитьКолоноки[Индекс]);
					ДобавляемыеРеквизиты.Добавить(НовРеквизит);
				КонецЕсли;
			КонецЦикла;
			ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			Для Каждого Колонка Из ДобавитьКолоноки Цикл                                
				
				ИмяТаблицыФормы = СтруктраДляОбновленияФормы.ИмяТаблицы;
				Если СтруктраДляОбновленияФормы.Свойство("ИмяТаблицыФормы") Тогда
					ИмяТаблицыФормы = СтруктраДляОбновленияФормы.ИмяТаблицыФормы;
				КонецЕсли;
				
				НовПоле = Элементы.Найти(ИмяТаблицыФормы + Колонка);
				Если НовПоле = Неопределено Тогда
					НовПоле = Элементы.Добавить(ИмяТаблицыФормы + Колонка, Тип("ПолеФормы"), Элементы.Найти(ИмяТаблицыФормы));
					НовПоле.Вид = ВидПоляФормы.ПолеВвода;
					НовПоле.ПутьКДанным = СтруктраДляОбновленияФормы.ИмяТаблицы + "." + Колонка;
				КонецЕсли;
			КонецЦикла;
		#Иначе
			ДобавляемыеРеквизиты = Новый Массив;
			ИмяТаблицыФормы = СтруктраДляОбновленияФормы.ИмяТаблицы;
			Если СтруктраДляОбновленияФормы.Свойство("ИмяТаблицыФормы") Тогда
				ИмяТаблицыФормы = СтруктраДляОбновленияФормы.ИмяТаблицыФормы;
			КонецЕсли;			

			НомерПоследнего = ДобавитьКолоноки.ВГраница();
			Для Индекс = 0 По НомерПоследнего Цикл 
				Если ЭлементыФормы[ИмяТаблицыФормы].Значение.Колонки.Найти(ДобавитьКолоноки[Индекс]) = Неопределено Тогда
					Если ЭлементыФормы[ИмяТаблицыФормы].Колонки.Найти(ДобавитьКолоноки[Индекс]) = Неопределено Тогда
						Поле = ЭлементыФормы[ИмяТаблицыФормы].Колонки.Добавить(ДобавитьКолоноки[Индекс]);
					Иначе
						Поле = ЭлементыФормы[ИмяТаблицыФормы].Колонки.Найти(ДобавитьКолоноки[Индекс])
					КонецЕсли;
					ЭлементыФормы[ИмяТаблицыФормы].Значение.Колонки.Добавить(ДобавитьКолоноки[Индекс], ОписаниеТипа);
					Поле.Данные = ДобавитьКолоноки[Индекс];
				КонецЕсли;
			КонецЦикла;
			//Для Каждого Колонка Из ДобавитьКолоноки Цикл
			//КонецЦикла;
		#КонецЕсли
	КонецЕсли;
	
	Если СтруктураПолей.Свойство("КолонкиУдалить", УдалитьКолонки) Тогда
		#Если Не ТолстыйКлиентОбычноеПриложение Тогда
			Для Каждого Колонка Из УдалитьКолонки Цикл
				Поле = Элементы.Найти(СтруктраДляОбновленияФормы.ИмяТаблицы + Колонка);
				Если Поле = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Элементы.Удалить(Поле);
			КонецЦикла; 
			
			ТЧ = РеквизитФормыВЗначение(СтруктраДляОбновленияФормы.ИмяТаблицы);	
			УдаляемыеРеквизиты = Новый Массив;
			НомерПоследнего = УдалитьКолонки.ВГраница();
			Для Индекс = 0 По НомерПоследнего Цикл
				Если ТЧ.Колонки.Найти(УдалитьКолонки[Индекс]) <> Неопределено Тогда
					УдаляемыеРеквизиты.Добавить(СтруктраДляОбновленияФормы.ИмяТаблицы + "." + УдалитьКолонки[Индекс]);
				КонецЕсли;
			КонецЦикла;
			ИзменитьРеквизиты(,УдаляемыеРеквизиты);
		#Иначе
			Для Каждого Колонка Из УдалитьКолонки Цикл	
				Поле = ЭлементыФормы[СтруктраДляОбновленияФормы.ИмяТаблицы].Значение.Колонки.Найти(Колонка);
				Если Поле = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ЭлементыФормы[СтруктраДляОбновленияФормы.ИмяТаблицы].Значение.Колонки.Удалить(Поле);
				КолонкаТЧ = ЭлементыФормы[СтруктраДляОбновленияФормы.ИмяТаблицы].Колонки.Найти(Колонка);
				Если КолонкаТЧ <> Неопределено Тогда
					ЭлементыФормы[СтруктраДляОбновленияФормы.ИмяТаблицы].Колонки.Удалить(КолонкаТЧ);
				КонецЕсли;
			КонецЦикла;	
			УдаляемыеРеквизиты = Новый Массив;
			НомерПоследнего = УдалитьКолонки.ВГраница();
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЕще(Элемент)
	
	ДопПараметры = Новый Структура;
	МодульОбъектаКлиент = МодульОбъектаКлиент();
	Отказ = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ЭтаФорма[Элемент.Имя].Удалить(ТекущиеДанные);
	
	Попытка
		СтруктураДляОбновленияФормы = Кэш.Текущий.Форма.ОбновитьКонтент(Кэш);
	Исключение
		
		ДетализацияИсключения = "Произошла ошибка при переходе в раздел "
								+ Кэш.Текущий.ОписаниеРаздела.Название
								+ ". Переход прерван.";

		СбисИсключение = МодульОбъектаКлиент.НовыйСбисИсключение(	ИнформацияОбОшибке(),
																	"ФормаГлавноеОкно.ПерейтиВРазделВО2",
																	773,
																	,
																	ДетализацияИсключения);
																	
		МодульОбъектаКлиент.СообщитьСбисИсключение(СбисИсключение);
		Отказ = Истина;
		
	КонецПопытки;

	Если Отказ Тогда 
		
		ПерейтиВРазделВО2_НачатьВосстановлениеРаздела(Кэш.Текущий, ДопПараметры);
		// Не получилось перейти в новый раздел, выйти, вернуть неудачу
		Возврат;
		
	КонецЕсли;
	
	// Обновляем данные на форме главного окна
	Попытка
		
		ПараметрыОбновления = Новый Структура("ОчиститьТаблицу", Ложь);
		ОбновитьПоляФормы(СтруктураДляОбновленияФормы, ПараметрыОбновления);	
	
	Исключение
		
		СбисИсключение = МодульОбъектаКлиент.НовыйСбисИсключение(ИнформацияОбОшибке(), "ФормаГлавноеОкно.ПерейтиВРазделВО2");
		МодульОбъектаКлиент.СообщитьСбисИсключение(СбисИсключение);
		Отказ = Истина;
		
	КонецПопытки;

	Если Отказ Тогда 
		
		ПерейтиВРазделВО2_НачатьВосстановлениеРаздела(Кэш.Текущий, ДопПараметры);
		Возврат;
		
	КонецЕсли; 

КонецПроцедуры

/////работа с сохраняемыми значениями/////

// Функция - восстанавливает параметры пользователя 
// 
// Возвращаемое значение:
//  Соответствие - сохраняемые параметры пользователя (реквизиты ГО)
//
&НаКлиенте
Функция СбисСохраненныеЗначения() Экспорт
	
	ПараметрыПользователяСоответствие = СбисСохраненныеЗначенияНаСервере();
	
	Если ПараметрыПользователяСоответствие = Неопределено Тогда
		
		ПараметрыПользователяСоответствие = Новый Соответствие;
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			// Для переноса параметров, восстановить из сбисПарам, если в 1С не нашлось.
			ПараметрыПользователяСтруктура = ВосстановитьЗначение("сбисПарам");
			Если Не ПараметрыПользователяСтруктура = Неопределено Тогда
					
				Для Каждого КлючИЗначениеПарам Из ПараметрыПользователяСтруктура Цикл
					ПараметрыПользователяСоответствие.Вставить(КлючИЗначениеПарам.Ключ, КлючИЗначениеПарам.Значение);
				КонецЦикла;
				
			КонецЕсли;
			
		#КонецЕсли
		
	КонецЕсли;
	
	Возврат ПараметрыПользователяСоответствие;
	
КонецФункции

//Выполняет дозапись указанных настроек в ручном режиме. Необходимо для работы ВИ, без открытия формы
&НаСервере
Функция СбисСохраненныеЗначенияНаСервере()
	
	Попытка
		
		Возврат ХранилищеСистемныхНастроек.Загрузить(ЭтаФорма.ИмяФормы + "/ТекущиеДанные");
		
	Исключение
		
		ОшибкаВосстановить = МодульОбъектаСервер().НовыйСбисИсключение(ИнформацияОбОшибке(), "ФормаГлавноеОкно.СбисВосстановитьКэшПарамНаСервере");
		ВызватьИсключение МодульОбъектаСервер().СбисИсключение_Выгрузить(ОшибкаВосстановить);
		
	КонецПопытки;
	
КонецФункции

//Выполняет запись текущих настроек обработки
//Возвращает истина при успехе, структуру ошибки при неудаче.
&НаКлиенте
Функция СбисСохранитьЗначения(ПараметрыЗаписи, Отказ = Ложь) Экспорт
	Перем ПараметрыДляЗаписать;
	
	Если Не ПараметрыЗаписи.Свойство("Парам", ПараметрыДляЗаписать) Тогда
		
		ПараметрыДляЗаписать = ПараметрыЗаписи;
		
	КонецЕсли;
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Возврат СбисСохранитьЗначенияНаСервере(ПараметрыДляЗаписать, Отказ);
		
	#Иначе
		
		//Делаем через внешний интерфейс.
		Если ПараметрыЗаписи.ВыполнитьВручную Тогда
			
			Возврат СбисСохранитьЗначенияНаСервере(ПараметрыДляЗаписать, Отказ);
			
		//Если делаем вызов перед закрытием, то просто записываем в реквизиты и платформа делает сама стандартым механизмом.
		Иначе
			
			ЗаполнитьЗначенияСвойств(ЭтаФорма, ПараметрыДляЗаписать);
			
		КонецЕсли;
		
	#КонецЕсли
	
	Возврат Истина;
	
КонецФункции

//Выполняет дозапись указанных настроек в ручном режиме. Необходимо для работы ВИ, без открытия формы
&НаСервере
Функция СбисСохранитьЗначенияНаСервере(ПараметрыЗаписи, Отказ)
	
	Попытка
		СоответствиеНастроек = ХранилищеСистемныхНастроек.Загрузить(ЭтаФорма.ИмяФормы + "/ТекущиеДанные");
	Исключение
		Отказ = Истина;
		Возврат Новый Структура("code, message, details", 100, "Неизвестная ошибка системы", "Ошибка чтения из хранилища настроек: " + ОписаниеОшибки());
	КонецПопытки;
	Если СоответствиеНастроек = Неопределено Тогда
		СоответствиеНастроек = Новый Соответствие;
	КонецЕсли;
	Для Каждого КлючИЗначениеОбновить Из ПараметрыЗаписи Цикл
		СоответствиеНастроек.Вставить(КлючИЗначениеОбновить.Ключ, КлючИЗначениеОбновить.Значение);
	КонецЦикла;
	Попытка
		ХранилищеСистемныхНастроек.Сохранить(ЭтаФорма.ИмяФормы+"/ТекущиеДанные",,СоответствиеНастроек);	
	Исключение
		Отказ = Истина;
		Возврат Новый Структура("code, message, details", 100, "Неизвестная ошибка системы", "Ошибка записи в хранилище настроек: " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Истина
	
КонецФункции

/////Вывод списка/////

&НаКлиенте
Процедура сбисВывестиДанныеВТаблДок(Кнопка)
	
	фрм = сбисНайтиФормуФункции("сбисВывестиСписок","Форма_ВывестиСписок","Форма_ВывестиСписок",Кэш);	
	Если Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		фрм.сбисВывестиСписок(Кэш, ВывестиСписокСфромироватьКонтекстНаСервере(Кэш.ТаблДок.Имя));
	Иначе
		фрм.сбисВывестиСписок(Кэш);
	КонецЕсли;
	
КонецПроцедуры

//УФ функция формирует контекст для вывода списка управляемых форм.
//&НаСервере
Функция ВывестиСписокСфромироватьКонтекстНаСервере(ТабличнаяЧасть)
	
	Контекст	= Новый	Структура();
	КолонкиНеДобавлять	= Новый	Массив;
	
	//На форме списка не выйдет обратиться к колонкам другой формы, поэтому данные по колонкам собираем заранее, на сервере в главном окне.
	Колонки			= ЭтаФорма.Элементы[ТабличнаяЧасть].ПодчиненныеЭлементы;
	
	СтруктураЗаголовков		= Новый	Структура("Видимые, Невидимые", Новый	Структура, Новый	Структура);
	Для	Каждого	Колонка	Из	Колонки	Цикл
		МногострочныйПуть	= СтрЗаменить(Колонка.ПутьКДанным,".",Символы.ПС);
		Если	Колонка.Видимость
			И	Колонка.Доступность	Тогда
			СтруктураЗаголовков.Видимые.Вставить(СтрПолучитьСтроку(МногострочныйПуть,СтрЧислоСтрок(МногострочныйПуть)), Колонка.Заголовок);
		Иначе
			Если	Колонка.Доступность	Тогда
				СтруктураЗаголовков.Невидимые.Вставить(СтрПолучитьСтроку(МногострочныйПуть,СтрЧислоСтрок(МногострочныйПуть)), Колонка.Заголовок);
			Иначе
				КолонкиНеДобавлять.Добавить(СтрПолучитьСтроку(МногострочныйПуть,СтрЧислоСтрок(МногострочныйПуть)));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//Проверим невидимые элементы
	ТабличнаяЧастьКолонкиВсе = ЭтаФорма.РеквизитФормыВЗначение(ТабличнаяЧасть, Тип("ТаблицаЗначений")).СкопироватьКолонки();
	Для	Каждого	Колонка	Из	ТабличнаяЧастьКолонкиВсе.Колонки	Цикл
		Если	СтруктураЗаголовков.Видимые.Свойство(Колонка.Имя)
			Или		СтруктураЗаголовков.Невидимые.Свойство(Колонка.Имя)
			Или	Не	КолонкиНеДобавлять.Найти(Колонка.Имя)=Неопределено Тогда
			Продолжить;
		Иначе
			СтруктураЗаголовков.Невидимые.Вставить(Колонка.Имя, Колонка.Имя);
		КонецЕсли;	
	КонецЦикла;
	
	Если	Не	СтруктураЗаголовков.Видимые.Количество()
		И	Не	СтруктураЗаголовков.Невидимые.Количество()	Тогда
		СтруктураЗаголовков	= Неопределено;
	КонецЕсли;
	
	Контекст.Вставить("СтруктураЗаголовков",	СтруктураЗаголовков);
	Контекст.Вставить("ТабличнаяЧасть",			ТабличнаяЧасть);
	Контекст.Вставить("Данные", ЗначениеВСтрокуВнутр(ЭтаФорма[ТабличнаяЧасть].Выгрузить()));
	
	Возврат	Контекст;
	
КонецФункции

&НаКлиенте
Процедура РеестрСправочниковСтраницыПриСменеСтраницы(Элемент)
	
	Если Элемент.ТекущаяСтраница.Имя = "СтраницаНоменклатураКонтрагентов" Тогда
		
		ДопПараметры = Новый Структура("ПараметрыРаздела", Новый Структура);
		ДопПараметры.ПараметрыРаздела.Вставить("СтраницаПрайсЛист", Кэш.Текущий.Имя);
		ПерейтиВРаздел("АккордеонНоменклатураКонтрагентов66", ДопПараметры);
		
	ИначеЕсли Кэш.Текущий.ПараметрыРаздела.Свойство(Элемент.ТекущаяСтраница.Имя) Тогда
		ПерейтиВРаздел(Кэш.Текущий.ПараметрыРаздела[Элемент.ТекущаяСтраница.Имя]);
	Иначе 
		ПерейтиВРаздел("АккордеонСправочникиДок166");
	КонецЕсли;
	
КонецПроцедуры

/////Аккордеон/////

