
////////////////////////////////////////////////////
////////////////////Работа Формы////////////////////
////////////////////////////////////////////////////

#Область include_core2_vo2_ОбщиеФункции_ФормаГлавноеОкно_События
#КонецОбласти

&НаКлиенте
Процедура ПересчитыватьЦеныПоДанным1СПриИзменении(Элемент)
	ПараметрыПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитыватьНДСПоДанным1СПриИзменении(Элемент)
	ПараметрыПриИзменении(Элемент);
КонецПроцедуры

//Процедура записывает в Кэш измененный параметр	
&НаКлиенте
Процедура ПараметрыПриИзменении(Элемент) Экспорт
	
	ПутьКДаннымФормы = Сред(Элемент.Имя, Найти(Элемент.Имя, "_") + 1);
	МодульОбъектаКлиент().ИзменитьПараметрСбис(ПутьКДаннымФормы, ЭтаФорма[ПутьКДаннымФормы]);
	
КонецПроцедуры

&НаКлиенте
Процедура Таблица_СервисВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//alo
	ТекущиеДанныеСтроки = ВыбраннаяСтрока;
	Если Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		ТекущиеДанныеСтроки = Элемент.ТекущиеДанные;
	КонецЕсли;
	Контекст = Новый структура(ТекущиеДанныеСтроки.Ключ, ТекущиеДанныеСтроки.Команда);
	Контекст.Вставить("Кэш",Кэш);
	Кэш.ОбщиеФункции.РассчитатьЗначение(ТекущиеДанныеСтроки.Ключ,Контекст,Кэш);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрМаскаПриИзменении(Элемент)
	
	ТекущийРазделГО = Кэш.Текущий;
	
	ТекущийРазделГО.Фильтр.ФильтрМаска = ФильтрМаска;
	МодульОбъектаКлиент().ИзменитьПараметрСбис("ПараметрыФильтра", ТекущийРазделГО.Фильтр);
	сбисПослеУстановкиФильтра(Истина, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура Таблица_РеестрМаппингаВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	ТекущиеДанныеСтроки = ВыбраннаяСтрока;
	Если Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		ТекущиеДанныеСтроки = Элемент.ТекущиеДанные;
	КонецЕсли; 
	
	ОткрытыеКаталоги = Кэш.Текущий.ПараметрыРаздела.ОткрытыеКаталоги;
	МодульОбъектаКлиент = МодульОбъектаКлиент();
	
	Если Не ТекущиеДанныеСтроки.ClientParentUid_ = Истина Тогда
	ИначеЕсли МодульОбъектаКлиент.СбисСтек_Пустой(ОткрытыеКаталоги)
		Или Не МодульОбъектаКлиент.СбисСтек_ВзятьБезУдаления(ОткрытыеКаталоги) = ТекущиеДанныеСтроки.ClientIdUid Тогда
		
		МодульОбъектаКлиент.СбисСтек_Положить(ОткрытыеКаталоги, ФильтрРодитель);
		ФильтрРодитель = ТекущиеДанныеСтроки.ClientIdUid;
		Кэш.Текущий.Форма.ОбновитьКонтент(Кэш);
		ФильтрСтраница = 1;
	Иначе
	
		ФильтрРодитель = МодульОбъектаКлиент.СбисСтек_Взять(ОткрытыеКаталоги);
		Кэш.Текущий.Форма.ОбновитьКонтент(Кэш);
		ФильтрСтраница = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Таблица_РеестрПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные <> Неопределено
		И Элемент.ТекущиеДанные.Номер = "Загрузить еще" Тогда
	
		ЗагрузитьЕще(Элемент);
	
	КонецЕсли;
	
КонецПроцедуры
	
//////////////////////Кнопки////////////////////////

#Область include_core2_vo2_ОбщиеФункции_ФормаГлавноеОкно_РаботаФормы_Кнопки
#КонецОбласти

/////////////////Генерируемые кнопки/////////////////

//Функция добавляет кнопку на командную панель главного окна. Вызов функции происходит через поиск в Кэш.МенюРазделов по текущему разделу и идентификатору(имени) кнопки
&НаСервере
Функция СбисДобавитьКнопку(Знач ПараметрыКнопки, Отказ) Экспорт
	Попытка
		Если ПараметрыКнопки.УправляемоеПриложение Тогда
			Если ЭтаФорма.Команды.Найти(ПараметрыКнопки.Имя) = Неопределено Тогда
				НоваяКоманда			= ЭтаФорма.Команды.Добавить(ПараметрыКнопки.Имя);
				НоваяКоманда.Действие	= "сбисВыполнитьКомандуГенерируемойКнопки";//Имя процедуры
				НоваяКоманда.Заголовок	= ПараметрыКнопки.Заголовок;
			КонецЕсли;	
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить(ПараметрыКнопки.Имя,
					                                 Тип("КнопкаФормы"),
													 ЭтаФорма.Элементы[ПараметрыКнопки.Панель]);
			НовыйЭлемент.ИмяКоманды = ПараметрыКнопки.Имя;
		Иначе
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				сбисКнопкиПанели = ЭтаФорма.ЭлементыФормы[ПараметрыКнопки.Панель].Кнопки;
				сбисКнопкиПанели.Добавить(ПараметрыКнопки.Имя, ТипКнопкиКоманднойПанели.Действие, ПараметрыКнопки.Заголовок, Новый Действие("сбисВыполнитьКомандуГенерируемойКнопки"));
			#КонецЕсли
		КонецЕсли;
	Исключение
		Отказ = Истина;
		Возврат Новый Структура("code,message,details", 773, "Неизвестная ошибка при выполнении метода", "Ошибка при добавлении кнопки " + ПараметрыКнопки.Имя + " на форму главного окна: " + ИнформацияОбОшибке().Описание);
	КонецПопытки;
	
КонецФункции

//Функция очищает панель кнопок (КО)
&НаСервере
Функция сбисОчиститьПанельКнопок(Знач ПараметрыПанели, Отказ) Экспорт
	
	Попытка
		Если ПараметрыПанели.УправляемоеПриложение Тогда
			ЭлементыУдалить = ЭтаФорма.Элементы[ПараметрыПанели.Имя].ПодчиненныеЭлементы;
			Пока ЭлементыУдалить.Количество() Цикл
				ЭтаФорма.Элементы.Удалить(ЭлементыУдалить[0]);
			КонецЦикла;
		Иначе
			ЭтаФорма.ЭлементыФормы[ПараметрыПанели.Имя].Кнопки.Очистить();
		КонецЕсли;                                                                                                                   
	Исключение
		Отказ = Истина;
		Возврат Новый Структура("code,message,details", 773, "Неизвестная ошибка при выполнении метода", "Ошибка при удалении кнопок панели " + ПараметрыПанели.Имя + " главного окна: " + ИнформацияОбОшибке().Описание);
	КонецПопытки;
		
КонецФункции

&НаКлиенте
Процедура СбисКомандаПанелиПечать(Команда)
	СписокОтмеченныхДокументов = ТаблДокПолучитьВыбранныеСтроки();
	ПараметрыПечати = Новый Структура("Кэш, ВФоне,ФормаВызова", Кэш, Истина, ЭтаФорма);
	СписокДляВыбора = Кэш.ОбщиеФункции.ПолучитьВложенияПакетовНаПечать(СписокОтмеченныхДокументов, ПараметрыПечати);
	РезультатПечати = Кэш.ОбщиеФункции.СбисМассоваяПечать(СписокДляВыбора, ПараметрыПечати);
КонецПроцедуры

//Функция делает вызов в зависимости от того, какая команда из должна быть выполнена
&НаКлиенте
Процедура СбисВыполнитьКомандуГенерируемойКнопки(Команда) Экспорт 
	
	Попытка
		МодульОбъектаКлиент().ВызватьОбработчикКнопки(Новый Структура("Имя", Команда.Имя));
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		СбисИсключение = МодульОбъектаКлиент().НовыйСбисИсключение(ИнфоОбОшибке, "ФормаГлавноеОкно.СбисВыполнитьКомандуГенерируемойКнопки");
		МодульОбъектаКлиент().СообщитьСбисИсключение(СбисИсключение);
	КонецПопытки;

КонецПроцедуры

//Функция генерируемой кнопки отправки в справочниках (Раздел_Справочники_Шаблон.НаСменуРаздела)
&НаКлиенте
Функция ОтправитьПрайс(ЛокальныйКэш = Неопределено, сбисПараметрыОбработчика = Неопределено) Экспорт
	Перем ОписаниеТипаЦен, ИмяРеестра;
	
	Если ЛокальныйКэш = Неопределено Тогда
		//Для поиска функции без возникновения исключения, просто выйдем.
		Возврат Истина;
	КонецЕсли;
	
	СписокОтмеченных = Новый СписокЗначений;
	ПолучитьВыбранныеСтроки(СписокОтмеченных, сбисПолучитьЭлементыДерева(Таблица_РеестрСправочников));
	
	Если	Не СписокОтмеченных.Количество() Тогда
		МодульОбъектаКлиент().СбисСообщить("Отметьте номенклатуру, для которой необходимо сформировать прайс-лист");
		Возврат Истина;
	КонецЕсли;
	Типы1С = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолей1С");
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КэшироватьФорму",	Ложь);
	ПараметрыОткрытия.Вставить("ПолучитьНовую",		Истина);
	ПараметрыОткрытия.Вставить("Владелец",			ЭтаФорма);
	
	Если НЕ Типы1С.Свойство("ТипЦен", ОписаниеТипаЦен) Тогда
		мНоменклатура = Кэш.ФормаНастроек.Ини(Кэш, ИмяРеестра);
		Если	мНоменклатура.Свойство("мФайл",			мНоменклатура) 
			И	мНоменклатура.Свойство("Номенклатура",	мНоменклатура) Тогда
			Если мНоменклатура.Свойство("ТипЦенНоменклатуры") Тогда
				ИмяСправочника = СокрЛП(Сред(мНоменклатура.ТипЦенНоменклатуры.Значение, Найти(мНоменклатура.ТипЦенНоменклатуры.Значение, ".") + 1));
				ТипСправочника = "СправочникСсылка." + ИмяСправочника;
			Иначе
				ТипСправочника = "СправочникСсылка.ТипыЦенНоменклатуры";
			КонецЕсли;
			ОписаниеТипаЦен = Новый Структура("ОписаниеТипа",  Новый ОписаниеТипов(ТипСправочника));
		КонецЕсли;
	КонецЕсли;

	КонструкторФорм = МодульОбъектаКлиент().НовыйКонструкторФорм();
	
	ЭлементДата = Новый Структура("Имя, Заголовок, Тип", "Дата", "Дата цен", Новый ОписаниеТипов("Дата"));
	МодульОбъектаКлиент().КонструкторФорм_ДобавитьЭлемент(КонструкторФорм, ЭлементДата);
	УстанавливаемоеЗначение = Новый Структура("Элемент, Значение", "Дата", ТекущаяДата());
	МодульОбъектаКлиент().КонструкторФорм_УстановитьЗначениеРеквизита(КонструкторФорм, УстанавливаемоеЗначение);
	СвойствоСписок = Новый Структура("Элемент, Свойство", "Дата", Новый Структура);
	СвойствоСписок.Свойство.Вставить("Формат", "ДФ=dd.MM.yyyy");
	СвойствоСписок.Свойство.Вставить("ФорматРедактирования", "ДФ=dd.MM.yyyy");
	МодульОбъектаКлиент().КонструкторФорм_УстановитьСвойство(КонструкторФорм, СвойствоСписок);
	
	ЭлементОрганизация = Новый Структура("Имя, Заголовок, Тип", "Организация", "Организация", Типы1С.Организация.ОписаниеТипа);
	МодульОбъектаКлиент().КонструкторФорм_ДобавитьЭлемент(КонструкторФорм, ЭлементОрганизация);
	
	ЭлементТипЦен = Новый Структура("Имя, Заголовок, Тип", "ТипЦен", "Тип цен", ОписаниеТипаЦен.ОписаниеТипа);
	МодульОбъектаКлиент().КонструкторФорм_ДобавитьЭлемент(КонструкторФорм, ЭлементТипЦен);
	
	КомандаОткрыть = Новый Структура("Имя, Заголовок", "Открыть", "Открыть документ");
	МодульОбъектаКлиент().КонструкторФорм_ДобавитьКоманду(КонструкторФорм, КомандаОткрыть);
	
	ПарамФормы = Новый Структура("ФормаЗаполнения", КонструкторФорм);

	ФормаЗаполненияДанных	= МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаПрограммнаяГенерация", ПараметрыОткрытия);
	ОбработчикЗакрытия		= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ОтправитьПрайс_Завершить", ЭтаФорма);
	
	ФормаЗаполненияДанных.ОписаниеОповещенияОЗакрытии = ОбработчикЗакрытия;
	ФормаЗаполненияДанных.Заголовок = "Укажите данные для заполнения документа";
	ФормаЗаполненияДанных.ПоказатьПоверх(ПарамФормы);
	
КонецФункции

&НаКлиенте
Функция ОтправитьПрайс_Завершить(Результат, ДопПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат Истина;
	КонецЕсли;
	Отказ = Ложь;
	СписокОтмеченных = Новый СписокЗначений;
	ПолучитьВыбранныеСтроки(СписокОтмеченных, сбисПолучитьЭлементыДерева(Таблица_РеестрСправочников));
	ИниНоменклатуры = Кэш.ФормаНастроек.Ини(Кэш, "Номенклатура");
	Если		Не СписокОтмеченных.Количество() Тогда
		Сообщить("Отметьте номенклатуру, для которой необходимо сформировать прайс-лист");
		Возврат Неопределено;
	ИначеЕсли	Не ЗначениеЗаполнено(Результат.ТипЦен) Тогда
		Сообщить("Укажите тип цен номенклатуры");
		Возврат Неопределено;
	ИначеЕсли	Не (	ИниНоменклатуры.Свойство("мФайл")
					И	ИниНоменклатуры.мФайл.Свойство("Номенклатура")) Тогда
		Сообщить("В файле настроек Номенклатура отсутствует настройка для формирования прайса.");
		Возврат Неопределено;
	КонецЕсли;
	фрм = сбисНайтиФормуФункции("ПодготовитьСтруктуруПрайса", "РаботаСДокументами1С");
	//В методе формирования прайса укажем, что ожидаем структуру результата, без записи в файл
	ПараметрыПодготовки = Новый Структура(	"Ини, ДанныеКаталога, ПараметрыПрайса"
											,ИниНоменклатуры.мФайл.Номенклатура
											,Новый Структура("СписокНоменклатуры, Организация", СписокОтмеченных, Результат.Организация)
											,Новый Структура(	"РеквизитСопоставленияНоменклатуры, ТипЦенНоменклатуры,	ДатаЦен, ТипCML, ОжидаемыйРезультат"
																,Кэш.Парам.РеквизитСопоставленияНоменклатуры
																,Результат.ТипЦен
																,Результат.Дата
																,"Прайс"
																,"СтруктураФайла"));
																
	МассивФайлов = фрм.ПодготовитьСтруктуруПрайса(Кэш, ПараметрыПодготовки, Отказ);
	
	Если Отказ Тогда
		сбисСообщитьОбОшибке(Кэш, МассивФайлов);
		Возврат Ложь;
	КонецЕсли;
	фрм = сбисНайтиФормуФункции("ПоказатьФорму", "ФормаОтправкиКорреспонденции");	
	фрм.ПоказатьФорму(Кэш, Новый Структура("СписокФайлов, Организация, ТипПакета", МассивФайлов, Результат.Организация, "PriceMatchingIn"));
	ОбновитьКонтент();
	Возврат Истина;
КонецФункции

// Пережитки прошлого не используется!
&НаКлиенте
Функция ОтправитьСогласованиеЦен(ЛокальныйКэш=Неопределено, сбисПараметрыОбработчика=Неопределено) Экспорт
	Если ЛокальныйКэш = Неопределено Тогда
		//Для поиска функции без возникновения исключения, просто выйдем.
		Возврат Истина;
	КонецЕсли;
	Отказ = Ложь;
	СписокОтмеченных = Новый СписокЗначений;
	ПолучитьВыбранныеСтроки(СписокОтмеченных, сбисПолучитьЭлементыДерева(Таблица_РеестрСправочников));
	ИниНоменклатуры = ЛокальныйКэш.ФормаНастроек.Ини(ЛокальныйКэш, "Номенклатура");
	Если		Не СписокОтмеченных.Количество() Тогда
		Сообщить("Отметьте номенклатуру, для которой необходимо сформировать прайс-лист");
		Возврат Неопределено;
	ИначеЕсли	Не ЗначениеЗаполнено(ТипЦен) Тогда
		Сообщить("Укажите тип цен номенклатуры");
		Возврат Неопределено;
	ИначеЕсли	Не (	ИниНоменклатуры.Свойство("мФайл")
					И	ИниНоменклатуры.мФайл.Свойство("Номенклатура")) Тогда
		Сообщить("В файле настроек Номенклатура отсутствует настройка для формирования прайса.");
		Возврат Неопределено;
	КонецЕсли;
	фрм = сбисНайтиФормуФункции("ПодготовитьСтруктуруПрайса", "РаботаСДокументами1С");
	//В методе формирования прайса укажем, что ожидаем структуру результата, без записи в файл
	ПараметрыПодготовки = Новый Структура(	"Ини, ДанныеКаталога, ПараметрыПрайса"
											,ИниНоменклатуры.мФайл.Номенклатура
											,Новый Структура("СписокНоменклатуры, Организация", СписокОтмеченных, ВладелецКаталога)
											,Новый Структура(	"РеквизитСопоставленияНоменклатуры, ТипЦенНоменклатуры,	ДатаЦен, ТипCML, ОжидаемыйРезультат, Тип, ВерсияФормата"
																,ЛокальныйКэш.Парам.РеквизитСопоставленияНоменклатуры
																,ТипЦен
																,ДатаЦен
																,"Прайс"
																,"СтруктураФайла"
																,"СогласованиеЦен"
																,"3.01"));
																
	МассивФайлов = фрм.ПодготовитьСтруктуруПрайса(Кэш, ПараметрыПодготовки, Отказ);
	
	Если Отказ Тогда
		сбисСообщитьОбОшибке(Кэш, МассивФайлов);
		Возврат Ложь;
	КонецЕсли;
	фрм = сбисНайтиФормуФункции("ПоказатьФорму", "ФормаОтправкиКорреспонденции");	
	фрм.ПоказатьФорму(ЛокальныйКэш, Новый Структура("СписокФайлов, Организация, ТипПакета", МассивФайлов, ВладелецКаталога, "PriceMatchingIn"));
	ОбновитьКонтент();
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ПоказатьСогласованиеЦен(ЛокальныйКэш = Неопределено, сбисПараметрыОбработчика = Неопределено) Экспорт
	Если ЛокальныйКэш = Неопределено Тогда
		//Для поиска функции без возникновения исключения, просто выйдем.
		Возврат;
	КонецЕсли;
	
	СписокОтмеченных = Новый СписокЗначений;
	ПолучитьВыбранныеСтроки(СписокОтмеченных, сбисПолучитьЭлементыДерева(Таблица_РеестрСправочников));
	
	Если	Не СписокОтмеченных.Количество() Тогда
		МодульОбъектаКлиент().СбисСообщить("Отметьте номенклатуру, для которой необходимо сформировать документ");
		Возврат;
	КонецЕсли;
	
	Типы1С = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолей1С");
	МодульСогласованияЦен = МодульОбъектаКлиент().ПолучитьФормуОбработки("Файл_СогласованиеЦен_3_01");
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КэшироватьФорму",	Ложь);
	ПараметрыОткрытия.Вставить("ПолучитьНовую",		Истина);
	ПараметрыОткрытия.Вставить("Владелец",			ЭтаФорма);
	
	
	КонструкторФорм = МодульОбъектаКлиент().НовыйКонструкторФорм();
	
	ЭлементДата = Новый Структура("Имя, Заголовок, Тип", "Дата", "Дата цен", Новый ОписаниеТипов("Дата"));
	МодульОбъектаКлиент().КонструкторФорм_ДобавитьЭлемент(КонструкторФорм, ЭлементДата);
	УстанавливаемоеЗначение = Новый Структура("Элемент, Значение", "Дата", ТекущаяДата());
	МодульОбъектаКлиент().КонструкторФорм_УстановитьЗначениеРеквизита(КонструкторФорм, УстанавливаемоеЗначение);
	СвойствоСписок = Новый Структура("Элемент, Свойство", "Дата", Новый Структура);
	СвойствоСписок.Свойство.Вставить("Формат", "ДФ=dd.MM.yyyy");
	СвойствоСписок.Свойство.Вставить("ФорматРедактирования", "ДФ=dd.MM.yyyy");
	МодульОбъектаКлиент().КонструкторФорм_УстановитьСвойство(КонструкторФорм, СвойствоСписок);
	
	ЭлементДата = Новый Структура("Имя, Заголовок, Тип", "ТипДокумента", "Тип документа", Новый ОписаниеТипов);
	МодульОбъектаКлиент().КонструкторФорм_ДобавитьЭлемент(КонструкторФорм, ЭлементДата);
	СписокДоступныхЗначений = МодульСогласованияЦен.ПодтипыДокумента();
	СвойствоСписок = Новый Структура("Элемент, Свойство", "ТипДокумента", Новый Структура);
	СвойствоСписок.Свойство.Вставить("СписокВыбора", СписокДоступныхЗначений);
	МодульОбъектаКлиент().КонструкторФорм_УстановитьСвойство(КонструкторФорм, СвойствоСписок);
	СвойствоВыборИзСписка = Новый Структура("Элемент, Свойство", "ТипДокумента", Новый Структура);
	СвойствоВыборИзСписка.Свойство.Вставить("РежимВыбораИзСписка", Истина);
	МодульОбъектаКлиент().КонструкторФорм_УстановитьСвойство(КонструкторФорм, СвойствоВыборИзСписка);
	УстанавливаемоеЗначение = Новый Структура("Элемент, Значение", "ТипДокумента", "Согласование цен");
	МодульОбъектаКлиент().КонструкторФорм_УстановитьЗначениеРеквизита(КонструкторФорм, УстанавливаемоеЗначение);
	
	ЭлементОрганизация = Новый Структура("Имя, Заголовок, Тип", "Организация", "Организация", Типы1С.Организация.ОписаниеТипа);
	МодульОбъектаКлиент().КонструкторФорм_ДобавитьЭлемент(КонструкторФорм, ЭлементОрганизация);
	
	ЭлементТипЦен = Новый Структура("Имя, Заголовок, Тип", "ТипЦен", "Тип цен", Типы1С.ТипЦен.ОписаниеТипа);
	МодульОбъектаКлиент().КонструкторФорм_ДобавитьЭлемент(КонструкторФорм, ЭлементТипЦен);
	
	ЭлементКонтрагент = Новый Структура("Имя, Заголовок, Тип", "Контрагент", "Контрагент", Типы1С.Контрагент.ОписаниеТипа);
	МодульОбъектаКлиент().КонструкторФорм_ДобавитьЭлемент(КонструкторФорм, ЭлементКонтрагент);
	
	ЭлементКонтрагент = Новый Структура("Имя, Заголовок, Тип", "Договор", "Договор", Типы1С.Договор.ОписаниеТипа);
	МодульОбъектаКлиент().КонструкторФорм_ДобавитьЭлемент(КонструкторФорм, ЭлементКонтрагент);
	
	ЭлементДата = Новый Структура("Имя, Заголовок, Тип", "ПериодНачало", "Цена действительна с", Новый ОписаниеТипов("Дата"));
	МодульОбъектаКлиент().КонструкторФорм_ДобавитьЭлемент(КонструкторФорм, ЭлементДата);
	СвойствоСписок = Новый Структура("Элемент, Свойство", "ПериодНачало", Новый Структура);
	СвойствоСписок.Свойство.Вставить("Формат", "ДФ=dd.MM.yyyy");
	СвойствоСписок.Свойство.Вставить("ФорматРедактирования", "ДФ=dd.MM.yyyy");
	МодульОбъектаКлиент().КонструкторФорм_УстановитьСвойство(КонструкторФорм, СвойствоСписок);
	
	ЭлементДата = Новый Структура("Имя, Заголовок, Тип", "ПериодОкончание", "Цена действительна до", Новый ОписаниеТипов("Дата"));
	МодульОбъектаКлиент().КонструкторФорм_ДобавитьЭлемент(КонструкторФорм, ЭлементДата);
	СвойствоСписок = Новый Структура("Элемент, Свойство", "ПериодОкончание", Новый Структура);
	СвойствоСписок.Свойство.Вставить("Формат", "ДФ=dd.MM.yyyy");
	СвойствоСписок.Свойство.Вставить("ФорматРедактирования", "ДФ=dd.MM.yyyy");
	МодульОбъектаКлиент().КонструкторФорм_УстановитьСвойство(КонструкторФорм, СвойствоСписок);
	
	ИниСогласованияЦен = Кэш.ФормаНастроек.Ини(Кэш, "СогласованиеЦен");
	НеОтбиратьСкладам = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов").РассчитатьЗначение("НеОтбиратьСкладам",
																															ИниСогласованияЦен,
																															Кэш);

	Если Типы1С.Свойство("Склады")
		И НеОтбиратьСкладам <> Истина Тогда
	
		ЭлементСклад = Новый Структура("Имя, Заголовок, Тип", "Склад", "Остатки по складам", Новый ОписаниеТипов("СписокЗначений"));
		МодульОбъектаКлиент().КонструкторФорм_ДобавитьЭлемент(КонструкторФорм, ЭлементСклад);
		ПараметрыИзменения = Новый Структура("Имя, Свойства", "Склад", Новый Структура);
		ПараметрыИзменения.Свойства.Вставить("ТипЗначения", Типы1С.Склады.ОписаниеТипа);
		МодульОбъектаКлиент().КонструкторФорм_ИзменитьЭлемент(КонструкторФорм, ПараметрыИзменения);
	
	КонецЕсли;
	
	КомандаОткрыть = Новый Структура("Имя, Заголовок", "Открыть", "Открыть документ");
	МодульОбъектаКлиент().КонструкторФорм_ДобавитьКоманду(КонструкторФорм, КомандаОткрыть);
	
	ПарамФормы = Новый Структура("ФормаЗаполнения", КонструкторФорм);

	ФормаЗаполненияДанных	= МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаПрограммнаяГенерация", ПараметрыОткрытия);
	ОбработчикЗакрытия		= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПоказатьСогласованиеЦен_Продолжить", ЭтаФорма);
	
	ФормаЗаполненияДанных.ОписаниеОповещенияОЗакрытии = ОбработчикЗакрытия;
	ФормаЗаполненияДанных.Заголовок = "Укажите данные для заполнения документа";
	ФормаЗаполненияДанных.ПоказатьПоверх(ПарамФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСогласованиеЦен_Продолжить(Результат, ДопПараметры) Экспорт

	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	СписокОтмеченных = Новый СписокЗначений;
	ПолучитьВыбранныеСтроки(СписокОтмеченных, сбисПолучитьЭлементыДерева(Таблица_РеестрСправочников));
	
	Если	Не СписокОтмеченных.Количество() Тогда
		МодульОбъектаКлиент().СбисСообщить("Отметьте номенклатуру, для которой необходимо сформировать прайс-лист");
		Возврат;
	КонецЕсли;
	
	Если	Не ЗначениеЗаполнено(Результат.ТипЦен) Тогда
		МодульОбъектаКлиент().СбисСообщить("Укажите тип цен номенклатуры");
		Возврат;
	КонецЕсли;
	
	Если	Не ЗначениеЗаполнено(Результат.ТипДокумента) Тогда
		МодульОбъектаКлиент().СбисСообщить("Укажите тип документа");
		Возврат;
	КонецЕсли;
	
	ИнформацияОДокументе = Новый Структура;
	ИнформацияОДокументе.Вставить("Документы1С", Новый СписокЗначений);
	ИнформацияОДокументе.Вставить("СоставПакета", Новый СписокЗначений);
	
	Документ1С = Новый Структура;
	Документ1С.Вставить("Дата", Результат.Дата); 
	Документ1С.Вставить("Номер", ""); 
	Документ1С.Вставить("Регламент", Результат.ТипДокумента.Регламент);
	Документ1С.Вставить("ТипДокумента", Новый Структура("Тип, Подтип, ВерсияТипа, ВерсияПодтипа")); 
	Документ1С.Вставить("Контрагент", Результат.Контрагент);  
	Документ1С.Вставить("Договор", Результат.Договор);
	Документ1С.Вставить("Организация", Результат.Организация);   
	Документ1С.Вставить("ПериодНачало", Результат.ПериодНачало);    
	Документ1С.Вставить("ПериодОкончание", Результат.ПериодОкончание);
	Документ1С.Вставить("ТипЦен", Результат.ТипЦен); 
	Документ1С.Вставить("Идентификатор", Новый УникальныйИдентификатор); 
	Документ1С.Вставить("Товары", Новый Массив);
	Документ1С.Вставить("Склады", Новый Массив);
	Документ1С.Вставить("Имя", "Сбис_СогласованиеЦен");
	Документ1С.Вставить("ИмяСети", Результат.ТипДокумента.ИмяСети);
	
	ЗаполнитьЗначенияСвойств(Документ1С.ТипДокумента, Результат.ТипДокумента);
	
	Для каждого Товар Из СписокОтмеченных.ВыгрузитьЗначения() Цикл
		Документ1С.Товары.Добавить(Новый Структура("Номенклатура", Товар));
	КонецЦикла;
	
	Если Результат.Свойство("Склад") Тогда
		Для каждого Склад Из Результат.Склад.ВыгрузитьЗначения() Цикл
			Документ1С.Склады.Добавить(Склад);
		КонецЦикла;
	КонецЕсли;
	
	ИнформацияОДокументе.Документы1С.Добавить(Документ1С);
	ИнформацияОДокументе.СоставПакета.Добавить(Документ1С, "СогласованиеЦен");
	
	Результат = Новый Структура("Ссылка, Пакет", "");
	
	ДопПараметрыОткрытия = Новый Структура("ИнформацияОДокументе", ИнформацияОДокументе);
	ОбработчикРезультата = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПоказатьСогласованиеЦен_Завершить", ЭтаФорма, ДопПараметрыОткрытия);
	ДанныеПакета = Новый Структура("ИмяИни, Документ1С, СоставПакета", "СогласованиеЦен", Документ1С);
	ЗаполнитьЗначенияСвойств(ДанныеПакета, ИнформацияОДокументе);
	ДопПараметрыЧерновика = Новый Структура("Результат, ОбработчикРезультата", Результат, ОбработчикРезультата);
	МодульОбъектаКлиент().СоздатьЧерновик(ДанныеПакета, ДопПараметрыЧерновика);
	Если МодульОбъектаКлиент().ЭтоТипСбис(ДопПараметрыЧерновика.Результат, "СбисИсключение") Тогда
		МодульОбъектаКлиент().СообщитьСбисИсключение(ДопПараметрыЧерновика.Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСогласованиеЦен_Завершить(Результат, ДопПараметры) Экспорт

	Если НЕ Результат.Отправлено Тогда
		
		Кэш.Вставить("РезультатОтправки", МодульОбъектаКлиент().МассоваяОперация_Скопировать(Результат, Истина));
		
		ПараметрыПоказать = Новый ФиксированнаяСтруктура("Владелец", ЭтаФорма);
		МодульОбъектаКлиент().МассоваяОперация_Показать(Кэш.РезультатОтправки, ПараметрыПоказать);
		
		Если Результат.Свойство("ОтправкаИзПересылки") Тогда
			МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаПересылкаПакетов").ПослеОтправки(Кэш);
		КонецЕсли;
		
		Возврат;
	
	КонецЕсли;
	
	Модуль = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ПоказатьДокумент", Кэш.Текущий.ФормыРаздела);
	
	ПараметрыОткрытия = Новый Структура("МассивПакетов, Документы1С, СоставПакета", ДопПараметры.МассивГотовыхПакетов);
	МодульОбъектаКлиент().СоставПакета_Записать_Завершить(Результат, ДопПараметры);
    ЗаполнитьЗначенияСвойств(ПараметрыОткрытия, ДопПараметры.ИнформацияОДокументе);
    
    Попытка
        Модуль.ПоказатьДокумент(Кэш, ПараметрыОткрытия);
	Исключение
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ФормаГлавноеОкно.ПоказатьСогласованиеЦен_Завершить");
	КонецПопытки;
	
	ОбновитьКонтент();
	
КонецПроцедуры

&НаКлиенте
Функция ОтправитьКаталог(ЛокальныйКэш = Неопределено, сбисПараметрыОбработчика = Неопределено) Экспорт
	Перем ОписаниеТипаЦен;
	
	Если ЛокальныйКэш = Неопределено Тогда
		//Для поиска функции без возникновения исключения, просто выйдем.
		Возврат Истина;
	КонецЕсли;
	
	СписокОтмеченных = Новый СписокЗначений;
	ПолучитьВыбранныеСтроки(СписокОтмеченных, сбисПолучитьЭлементыДерева(Таблица_РеестрСправочников));
	
	Если	Не СписокОтмеченных.Количество() Тогда
		МодульОбъектаКлиент().СбисСообщить("Отметьте номенклатуру, для которой необходимо отправить каталог");
		Возврат Истина;
	КонецЕсли;
	
	Типы1С = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолей1С");
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КэшироватьФорму",	Ложь);
	ПараметрыОткрытия.Вставить("ПолучитьНовую",		Истина);
	ПараметрыОткрытия.Вставить("Владелец",			ЭтаФорма);
	
	Если НЕ Типы1С.Свойство("ТипЦен", ОписаниеТипаЦен) Тогда 
		ИмяРеестра = Кэш.Текущий.ОписаниеРаздела.Ини;
		мНоменклатура = Кэш.ФормаНастроек.Ини(Кэш, ИмяРеестра);
		Если	мНоменклатура.Свойство("мФайл",			мНоменклатура) 
			И	мНоменклатура.Свойство("Номенклатура",	мНоменклатура) Тогда
			Если мНоменклатура.Свойство("ТипЦенНоменклатуры") Тогда
				ИмяСправочника = СокрЛП(Сред(мНоменклатура.ТипЦенНоменклатуры.Значение, Найти(мНоменклатура.ТипЦенНоменклатуры.Значение, ".") + 1));
				ТипСправочника = "СправочникСсылка." + ИмяСправочника;
			Иначе
				ТипСправочника = "СправочникСсылка.ТипыЦенНоменклатуры";
			КонецЕсли;
			ОписаниеТипаЦен = Новый Структура("ОписаниеТипа",  Новый ОписаниеТипов(ТипСправочника));
		КонецЕсли;
	КонецЕсли;
	
	КонструкторФорм = МодульОбъектаКлиент().НовыйКонструкторФорм();
	
	ЭлементОрганизация = Новый Структура("Имя, Заголовок, Тип", "Организация", "Организация", Типы1С.Организация.ОписаниеТипа);
	МодульОбъектаКлиент().КонструкторФорм_ДобавитьЭлемент(КонструкторФорм, ЭлементОрганизация);
	
	ЭлементТипЦен = Новый Структура("Имя, Заголовок, Тип", "ТипЦен", "Тип цен", ОписаниеТипаЦен.ОписаниеТипа);
	МодульОбъектаКлиент().КонструкторФорм_ДобавитьЭлемент(КонструкторФорм, ЭлементТипЦен);
	
	КомандаОткрыть = Новый Структура("Имя, Заголовок", "Открыть", "Загрузить каталог");
	МодульОбъектаКлиент().КонструкторФорм_ДобавитьКоманду(КонструкторФорм, КомандаОткрыть);
	
	ПарамФормы = Новый Структура("ФормаЗаполнения", КонструкторФорм);

	ФормаЗаполненияДанных	= МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаПрограммнаяГенерация", ПараметрыОткрытия);
	ОбработчикЗакрытия		= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ОтправитьКаталог_Завершить", ЭтаФорма);
	
	ФормаЗаполненияДанных.ОписаниеОповещенияОЗакрытии = ОбработчикЗакрытия;
	ФормаЗаполненияДанных.Заголовок = "Укажите данные для заполнения документа";
	ФормаЗаполненияДанных.ПоказатьПоверх(ПарамФормы);
	
КонецФункции

&НаКлиенте
Функция ОтправитьКаталог_Завершить(Результат, ДопПараметры) Экспорт 
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат Истина;
	КонецЕсли;
	// Формирует и отправляет на онлайн каталог товаров
	Если Кэш.Парам.СпособОбмена = 1 Тогда // каталог
		Сообщить("Отправить каталог товаров можно только при способе обмена SDK или API. Способ обмена указывается в разделе Настройки");
		Возврат Неопределено;
	КонецЕсли;
	ИниНоменклатуры = Кэш.ФормаНастроек.Ини(Кэш, "Номенклатура");
	Если НЕ (ИниНоменклатуры.Свойство("мФайл") И ИниНоменклатуры.мФайл.Свойство("Номенклатура")) Тогда
		Сообщить("В файле настроек Номенклатура отсутствует настройка для формирования каталога.");
		Возврат Неопределено;
	КонецЕсли;
	СписокОтмеченных = Новый СписокЗначений;
	ПолучитьВыбранныеСтроки(СписокОтмеченных, сбисПолучитьЭлементыДерева(Таблица_РеестрСправочников));
	ДанныеКаталога = Новый Структура("СписокНоменклатуры, Организация", СписокОтмеченных, Результат.Организация);
	ИниНоменклатура = Новый Структура;
	Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(ИниНоменклатура, ИниНоменклатуры.мФайл.Номенклатура);
	ПараметрыФормированияКаталога = Новый Структура("РеквизитСопоставленияНоменклатуры", Кэш.Парам.РеквизитСопоставленияНоменклатуры);
	Если ЗначениеЗаполнено(Результат.ТипЦен) Тогда
		ПараметрыФормированияКаталога.Вставить("ТипЦенНоменклатуры", Результат.ТипЦен);
	КонецЕсли;
	КаталогОтправлен = Кэш.ОбщиеФункции.сбисСформироватьОтправитьКаталогТоваров(Кэш, ДанныеКаталога,ИниНоменклатура,ПараметрыФормированияКаталога);
	Если КаталогОтправлен <> Ложь Тогда
		Сообщить("Каталог товаров успешно отправлен");
	КонецЕсли;
	ОтметитьВсе = Ложь;
	ОбновитьКонтент();
	Возврат Истина;
КонецФункции

//Функция генерируемой кнопки отправки в справочниках (Раздел_Справочники_Шаблон.НаСменуРаздела)
&НаКлиенте
Функция ЗагрузитьСотрудниковВСБИС(ЛокальныйКэш=Неопределено, сбисПараметрыОбработчика=Неопределено) Экспорт
	Если ЛокальныйКэш = Неопределено Тогда
		//Для поиска функции без возникновения исключения, просто выйдем.
		Возврат Истина;
	КонецЕсли;
	СписокОтмеченных = Новый СписокЗначений;
	ПолучитьВыбранныеСтроки(СписокОтмеченных, сбисПолучитьЭлементыДерева(Таблица_РеестрСправочников));
	Ини = ЛокальныйКэш.ФормаНастроек.Ини(ЛокальныйКэш, "Сотрудники");
	Если Не СписокОтмеченных.Количество() Тогда
		Сообщить("Отметьте сотрудников, которых необходимо загрузить в Saby");
		Возврат Неопределено;
	КонецЕсли;
	Если Не (Ини.Свойство("мФайл") И Ини.мФайл.Свойство("Сотрудники")) Тогда
		Сообщить("Отсутствует настройка для загрузки сотрудников в Saby");
		Возврат Неопределено;
	КонецЕсли;
	Ини = Ини.мФайл.Сотрудники;
	сбисПоказатьСостояние("Формирование данных по сотрудникам", ЭтаФорма);
	фрм	= сбисНайтиФормуФункции("сбисСформироватьДанныеСотрудников","РаботаСДокументами1С");
	ДанныеСотрудников = фрм.сбисСформироватьДанныеСотрудников(ЛокальныйКэш, СписокОтмеченных, Ини);
	сбисПоказатьСостояние("Загрузка сотрудников в Saby", ЭтаФорма);
	Результат = Истина;
	Отказ = Ложь;
	РезультатОтправки = ЛокальныйКэш.Интеграция.сбисЗаписатьСотрудников(Кэш, ДанныеСотрудников, Отказ);
	сбисСпрятатьСостояние(ЭтаФорма);
	
	Если Отказ Тогда
		Результат = Ложь;
	КонецЕсли;
	
	РезультатОтправки.НеОтправлено = РезультатОтправки.Ошибок;
	РезультатОтправки.Вставить("ЗаголовкиФормыРезультатов", Новый Структура("Форма, ПоложительныйРезультат, ОтрицательныйРезультат, Объект1С, ТиповыеОшибки", "Результат загрузки", "Загружено", "Не загружено", "Сотрудник" ""));
	Кэш.Вставить("РезультатОтправки", РезультатОтправки);
	фрм = сбисНайтиФормуФункции("ПоказатьРезультатОтправки","ФормаРезультатОтправки","", Кэш);
	фрм.ПоказатьРезультатОтправки(Кэш);
	Кэш.Удалить("РезультатОтправки");
	Возврат Результат;
КонецФункции

//////////////////////Прочее////////////////////////

&НаСервере
Функция СбисУстановитьКонтекстноеМеню(ИмяЭлемента, ИмяМеню) Экспорт
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Для Каждого ЭлементМеню Из ЭтаФорма.Элементы[ИмяЭлемента].КонтекстноеМеню.ПодчиненныеЭлементы Цикл
			Если Найти(ЭлементМеню.Имя, ИмяМеню) = 1 Тогда 
				сбисУстановитьВидимостьЭлементаМеню(ЭлементМеню, Истина);
			Иначе
				сбисУстановитьВидимостьЭлементаМеню(ЭлементМеню, Ложь);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ЭтаФорма.ЭлементыФормы[ИмяЭлемента].КонтекстноеМеню=ЭтаФорма.ЭлементыФормы[ИмяМеню];
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция сбисУстановитьВидимостьЭлементаМеню(ЭлементМеню, ВидимостьЭлемента)
	ЭлементМеню.Видимость = ВидимостьЭлемента;
	Если ТипЗнч(ЭлементМеню) = Тип("ГруппаФормы") Тогда
		Для Каждого ПодЭлемент Из ЭлементМеню.ПодчиненныеЭлементы Цикл
			сбисУстановитьВидимостьЭлементаМеню(ПодЭлемент, ВидимостьЭлемента);
		КонецЦикла;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СбисПоказатьЗначение(ЛокальныйКэш, ОбъектСсылкаПоказать) Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если ЛокальныйКэш.СовместимостьМетодов.Объекты1С.ПоказатьЗначение Тогда
			СбисСтрокаВыполнить = "ПоказатьЗначение(,ОбъектСсылкаПоказать)";
		Иначе
			СбисСтрокаВыполнить = "ОткрытьЗначение(ОбъектСсылкаПоказать)";
		КонецЕсли;
		Выполнить(СбисСтрокаВыполнить);
	#Иначе
		ПоказатьЗначение(,ОбъектСсылкаПоказать);
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Функция СбисПолноеИмяКолонки(ТчИмя, КолонкаИмя) Экспорт
	
	Возврат СтрЗаменить(МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ШаблонРеквизитаКолонок"), "{%ТЧ%}", ТчИмя) + КолонкаИмя;
	
КонецФункции

//Процедура запускает отправку документов по отмеченным записям	
&НаКлиенте
Процедура ЗагрузитьВыбранныеДокументыОтчетности(Ответ, СбисДополнительныеПараметры) Экспорт
	Перем ИмяРеестра, Ини;
	Если Ответ = 2 Тогда
		ВсеДокументы = Истина;
		Если	Не Кэш.Разделы.Продажа.Свойство(Кэш.Текущий.Имя, ИмяРеестра)
			Или	Не Кэш.Ини.Свойство(ИмяРеестра, Ини) Тогда
			Возврат;
		ИначеЕсли Ини = Неопределено Тогда
			Ини = Кэш.ФормаНастроек.Ини(Кэш, ИмяРеестра);
		КонецЕсли;
		СтруктураДляОбновленияФормы = Кэш.ОбщиеФункции.СбисОбновитьРеестрДокументов1С(Ини, Кэш);
		СписокОтмеченныхДокументов = Новый СписокЗначений;
		СписокОтмеченныхДокументов.ЗагрузитьЗначения(СтруктураДляОбновленияФормы.Таблица_РеестрДокументов);
	Иначе
		СписокОтмеченныхДокументов = ТаблДокПолучитьВыбранныеСтроки();
	КонецЕсли;
	ВсеДокументы = Ложь;
	ИмяДокумента = Кэш.Текущий.ТипДок;
	СбисДействие = Кэш.ОбщиеФункции.РезультатДействия_Новый(Кэш, Новый Структура("ПредставлениеОперации, ФормаВызова, СтатусыДляОбработки", "ЗагрузкаОтчетности", ЭтаФорма, Истина));

	ОписаниеОповещенияРезультат = Кэш.ОбщиеФункции.СбисОписаниеОповещения(Кэш, "ОбработчикРезультатаЗагрузкиОтчетности", ЭтаФорма, Новый Структура("Кэш, РезультатДействия", Кэш, СбисДействие));
	ПараметрыМетода = Новый Структура("СписокДокументов, ОбработчикРезультата, РезультатДействия", СписокОтмеченныхДокументов, ОписаниеОповещенияРезультат, СбисДействие);
	
	фрм = СбисНайтиФормуФункции("ЗагрузитьОтчетность", "Документ_" + ИмяДокумента, "Документ_Шаблон", Кэш);
	фрм.ЗагрузитьОтчетность(Кэш, ПараметрыМетода);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикРезультатаЗагрузкиОтчетности(РезультатЗагрузки, ПараметрыОбработки) Экспорт
	ПараметрыСообщить = Новый Структура("СообщитьНеВыполнено", Ложь);
	Кэш.ОбщиеФункции.РезультатДействия_СообщитьРезультат(РезультатЗагрузки, ПараметрыСообщить);
КонецПроцедуры

&НаКлиенте
Процедура СбисОбработкаПрерывания() Экспорт
	ОбработкаПрерыванияПользователя();
КонецПроцедуры

// Процедура устанавливает оформление 2х гиперссылок, предлагающих обновиться
// Параметры:
//	- СледующееДействие (строка):
//									- "Предложить обновление"
//									- "Предложить перезапуск"
//									- "Не требуется"
//	- ВерсияСильноУстарела (булево)
//  - РаботаНаНестабильнойВерсии (булево)
&НаКлиенте
Процедура сбисУстановитьОформлениеГиперссылокОбновления(СледующееДействие, ДопПараметры = Неопределено) Экспорт

	СтатусВерсииПользователя = 0;
	НоваяВерсия = "*версия не указана*";
	Если ЗначениеЗаполнено(ДопПараметры) Тогда
		Если ДопПараметры.Свойство("СтатусВерсииПользователя") Тогда
			СтатусВерсииПользователя = ДопПараметры.СтатусВерсииПользователя;
		КонецЕсли;
		Если ДопПараметры.Свойство("НоваяВерсия") Тогда
			НоваяВерсия = ДопПараметры.НоваяВерсия;
		КонецЕсли;
	КонецЕсли;
	
	ТекстСообщения = "";
	Если СледующееДействие = "Предложить обновление" Тогда 
		Если Число(СтатусВерсииПользователя) = 4 Тогда
			ТекстСообщения = "Внимание! Текущая версия содержит критические ошибки. Доступна стабильная версия " + НоваяВерсия 
								+ ". Рекомендуем обновить обработку.";
		ИначеЕсли Число(СтатусВерсииПользователя) = 3 Тогда
			ТекстСообщения = "Внимание! Текущая версия не совместима. Доступна стабильная версия " + НоваяВерсия
								+ ". Рекомендуем обновить обработку.";
		ИначеЕсли Число(СтатусВерсииПользователя) = 2 Тогда
			ТекстСообщения = "Текущая версия устарела. Доступна новая версия " + НоваяВерсия;
		Иначе
			ТекстСообщения = "Доступна новая версия " + НоваяВерсия;
		КонецЕсли;
	ИначеЕсли СледующееДействие = "Предложить перезапуск" Тогда
		ТекстСообщения = "Обновление прошло успешно, перезапустите обработку!";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		АргументДействия = Новый Структура(	"Текст, 		ФормаВладелец, 	ЭлементНазначения, 	СтатусСообщения",
											ТекстСообщения, ЭтаФорма, 		"Выход", 			СтатусСообщения.Внимание);
		МодульОбъектаКлиент().СбисСообщить(АргументДействия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура сбисЗадатьВопросПослеОбновления() Экспорт

	Кнопки = Новый СписокЗначений;
	ТекстВопроса = "Установка обновления прошла успешно." + Символы.ПС + "Для завершения обновления необходим";
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		ТекстВопроса = ТекстВопроса + " перезапуск 1С.";
		Кнопки.Добавить(1, "Перезапустить 1С:Предприятие сейчас");
		
	#Иначе
		
		ТекстВопроса = ТекстВопроса + " перезапуск обработки.";
		Кнопки.Добавить(1, "Завершить работу в Saby");
		
	#КонецЕсли
	
	Кнопки.Добавить(2, "Временно продолжить работу на старой версии");
	
	ОбработчикПослеОбновления = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("сбисЗадатьВопросПослеОбновленияЗавершение", ЭтаФорма);
	МодульОбъектаКлиент().СбисПоказатьВопрос(ОбработчикПослеОбновления, ТекстВопроса, Кнопки,, 1)

КонецПроцедуры

&НаКлиенте
Процедура сбисЗадатьВопросПослеОбновленияЗавершение(Ответ, СбисДополнительныеПараметры = Неопределено) Экспорт
	
	Если Ответ = 1 Тогда
		
		АргументЗавершения = Неопределено;
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			АргументЗавершения = Новый Структура("ЗавершитьРаботуПредприятия, ПерезапуститьПредприятие", Истина, Истина);
			
		#КонецЕсли
		МодульОбъектаКлиент().ЗавершитьРаботуSABY(АргументЗавершения);
		
	Иначе
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			ТекстАргумент = "Для корректной работы обработки необходимо завершить обновление. Перезапустите 1С:Предприятие.";
			
		#Иначе
			
			ТекстАргумент = "Для корректной работы обработки необходимо завершить обновление. Перезапустите обработку.";
			
		#КонецЕсли
		
		АргументДействия = Новый Структура("Текст, ФормаВладелец, ЭлементНазначения, СтатусСообщения", ТекстАргумент, ЭтаФорма, "Выход", СтатусСообщения.Внимание);
		ОтложенноеДействиеОбновления = МодульОбъектаКлиент().НовыйОтложенноеДействие(Новый Структура(
		"Аргумент,			ИмяПроцедуры,				Модуль,		ДополнительныеПараметры,	Периодичность,	ВызватьСразу,	ИдентификаторДействия,  ЧислоВызовов", 
		АргументДействия,	"СбисСообщитьПользователю",	ЭтаФорма,	Кэш,						60*15,			Ложь, 			"ВывестиСообщениеОНеобходимостиПерезапускаПослеОбновления"));
		
		МодульОбъектаКлиент().ПодключитьОтложенноеДействие(ОтложенноеДействиеОбновления);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПереключенияАккаунта()

	фрм = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаСменыАккаунта");

	ДопПараметры		= Новый Структура("ПовторныйЗапуск, РазделДо", Истина, Кэш.Текущий.ТипДок);
	ПараметрыОткрыть	= Новый Структура("Пользователь", Пользователь);
	
	фрм.ОписаниеОповещенияОЗакрытии = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("СбисПослеАвторизации", ЭтаФорма, ДопПараметры);
	фрм.ПоказатьПоверх(ПараметрыОткрыть);
	
КонецПроцедуры

// Обрабатываем выбор действия для списка документов
//
// Параметры:
//  Результат  - Структура - Выбранное сбис действие
//                 выполняемое для списка документов
//  ДопПараметры  - Структура - СписокВыделенныхДокументов
//
&НаКлиенте
Процедура ПослеВыбораСбисДействия(Результат, ДопПараметры) Экспорт 

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФункции = Новый Структура;
	ПараметрыФункции.Вставить("СчСерт", 						0);
	ПараметрыФункции.Вставить("СписокСертификатов", 			Неопределено);
	ПараметрыФункции.Вставить("Кэш", 							Кэш);
	ПараметрыФункции.Вставить("Команда", 						Результат.Значение);
	ПараметрыФункции.Вставить("СписокОтмеченныхДокументов", 	ДопПараметры.СписокОтмеченныхДокументов);
	ПараметрыФункции.Вставить("ИмяМетодаДляПродолжения", 		"СбисВыполнитьДействиеДляДокументовЗавершить");
    Кэш.ОбщиеФункции.СбисПередВыполнитьДействие(ПараметрыФункции);
КонецПроцедуры // ПослеВыбораСбисДействия()

