
// Сопоставление
&НаКлиенте
Функция ТаблДокПолучитьВыбранныеСтроки() Экспорт
	// Функция формирует список отмеченных строк таблицы с документами	
	СписокСтрок = Новый СписокЗначений;
	Для Каждого СтрокаТаблицы из ЭтаФорма[Кэш.ТаблДок.Имя] Цикл
		Если СтрокаТаблицы.Отмечен Тогда
			СписокСтрок.Добавить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	Если СписокСтрок.Количество()=0 и Кэш.ТаблДок.ТекущаяСтрока<>Неопределено Тогда
		СписокСтрок.Добавить(Кэш.ТаблДок.ТекущиеДанные);
	КонецЕсли;
	Возврат СписокСтрок;
КонецФункции
&НаКлиенте
Процедура УдалитьСопоставление(Команда)
	// Процедура удаляет сопоставление документов СБИС и 1С	
	СписокСтрок = ТаблДокПолучитьВыбранныеСтроки();
	
	//KES 050751151 Статусы в разрезе регламентов (СОПОСТАВЛЕНИЕ)--> 11 +
	МассивСтатусРегламент = Новый Массив;
	Если Кэш.ФормаРаботыСоСтатусами = "Статусы_Регистры" 
	   И (Кэш.Парам.СпособОбмена = 0 ИЛИ Кэш.Парам.СпособОбмена = 3)
	   И Кэш.Ини.Конфигурация.Свойство("СтатусРегламент") Тогда
			МассивСтатусРегламент = Кэш.ОбщиеФункции.РазбитьСтрокуВМассивНаКлиенте(Кэш.Ини.Конфигурация.СтатусРегламент.Значение,",");
	КонецЕсли;
	//<-- KES 050751151 Статусы в разрезе регламентов (СОПОСТАВЛЕНИЕ)

	Если СписокСтрок.Количество()>0 Тогда
		фрм = сбисНайтиФормуФункции("УдалитьПараметрыДокументаСБИСПарам",Кэш.ФормаРаботыСоСтатусами,"",Кэш);
		СтруктураСвойств = Новый Структура("ДокументСБИС_Ид,ДокументСБИС_ИдВложения,ДокументСБИС_Статус,ДокументСБИС_СтатусГос");	 // alo СтатусГос
		Для Каждого Строка из СписокСтрок Цикл
			
			
			Если Кэш.Текущий.Раздел = "3" или Кэш.Текущий.Раздел = "4" Тогда
				Если МассивСтатусРегламент.Количество()>0 Тогда  // для разделов Продажа/Покупка мы не знаем для какого регламента удалить сопоставление 
					Сообщить("При ведении статусов документов в разрезе регламентов удаление сопоставления из разделов Продажа/Покупка недоступно. Удалите сопоставление вручную из дополнительных реквизитов документа 1С.");
					Возврат;
				КонецЕсли;
				Префикс = "";
				Для каждого Док1С из Строка.Значение.СоставПакета Цикл
					фрм.УдалитьПараметрыДокументаСБИСПарам(СтруктураСвойств, Док1С.Значение, Кэш.Ини, Кэш.Парам.ИдентификаторНастроек, Новый Структура("Регламент",Префикс));
				КонецЦикла;
			Иначе
				//KES 050751151 Статусы в разрезе регламентов (СОПОСТАВЛЕНИЕ)--> 12  +
				//в параметры выносной функции УдалитьПараметрыДокументаСБИС не передать регламент
				Префикс = "";
				Если Строка.Значение.СоставПакета.Количество() > 0 Тогда
					СоставПакета = Строка.Значение.СоставПакета[0].Значение;
					Если НРЕГ(СоставПакета.Направление) = "исходящий" 
						И СоставПакета.Свойство("Регламент") 
						И СоставПакета.Регламент.Свойство("Название") 
						И НЕ МассивСтатусРегламент.Найти(СоставПакета.Регламент.Название)=Неопределено Тогда
						Префикс = СоставПакета.Регламент.Название;	
					КонецЕсли;
				КонецЕсли;
				//<-- KES 050751151 Статусы в разрезе регламентов (СОПОСТАВЛЕНИЕ) 
				
				Для каждого Вложение из Строка.Значение.Документы1С Цикл
					Если Вложение.Значение = Неопределено Тогда
						Продолжить;
					КонецЕсли;	
										
					//KES 050751151 Статусы в разрезе регламентов (СОПОСТАВЛЕНИЕ)--> 13 +
					фрм.УдалитьПараметрыДокументаСБИСПарам(СтруктураСвойств, Вложение.Значение, Кэш.Ини, Кэш.Парам.ИдентификаторНастроек, Новый Структура("Регламент",Префикс));
					//<-- KES 050751151 Статусы в разрезе регламентов (СОПОСТАВЛЕНИЕ) 

					Вложение.Значение = Неопределено;
				КонецЦикла;	
			КонецЕсли;
		КонецЦикла;	
	Иначе 
		Сообщить("Не выбран ни один документ");
	КонецЕсли;
	ОбновитьКонтент();
КонецПроцедуры
&НаКлиенте
Процедура ПараметрыСтатусовПриИзменении(Элемент)
	// Процедура записывает параметры запроса статусов. При следующем запросе статусов в фильтре будут указаны данные параметры	
	СтруктураНастроек = Новый Структура("ДатаПоследнегоЗапросаСтатусов,ИдентификаторПоследнегоСобытия", ДатаПоследнегоЗапросаСтатусов,ИдентификаторПоследнегоСобытия);
	Кэш.ФормаНастроек.СохранитьПараметрыСБИС(Кэш,СтруктураНастроек,Кэш.Парам.ИдентификаторНастроек);
КонецПроцедуры

