&НаКлиенте
Процедура ИзменитьСоответствиеНоменклатуры() 
	
	СопоставлениеНоменклатуры	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Таблица_НоменклатураКонтрагентов").ТекущиеДанные.СопоставлениеНоменклатуры;
	фрм							= МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаУстановкаСооответствияНоменклатуры");
	фрм.Показать(Кэш, Новый Структура("Контрагент, СопоставлениеНоменклатуры",КонтрагентНоменклатуры, СопоставлениеНоменклатуры));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСоответствиеНоменклатуры(Команда)
	
	фрм = сбисПолучитьФорму("ФормаУстановкаСооответствияНоменклатуры");
	фрм.Показать(Кэш, Новый Структура("Контрагент",КонтрагентНоменклатуры));
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСоответствиеНоменклатуры(Команда)
	НоменклатураКонтрагентов		= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Таблица_НоменклатураКонтрагентов"); 
	ТекущаяСтрока					= НоменклатураКонтрагентов.ТекущиеДанные;
    стрНоменклатура					= Новый Структура("Ссылка, ИдСБИС",ТекущаяСтрока.Ссылка, ТекущаяСтрока.Код);
	фрм								= Кэш.ГлавноеОкно.сбисНайтиФормуФункции("НоменклатураПоставщика_ЕдиничноеУдаление",Кэш.ФормаРаботыСНоменклатурой);
	стрКонтрагент					= МодульОбъектаКлиент().ПолучитьФормуОбработки("РаботаСДокументами1С").сбисЗаполнитьСтруктуруКонтрагента(КонтрагентНоменклатуры);
	
	фрм.НоменклатураПоставщика_ЕдиничноеУдаление(Новый Структура("Номенклатура, Контрагент", 
		ТекущаяСтрока.СопоставлениеНоменклатуры, стрКонтрагент), Новый Структура("Кэш",Кэш));
		
	Таблица_НоменклатураКонтрагентов.Удалить(Таблица_НоменклатураКонтрагентов.Индекс(НоменклатураКонтрагентов.ТекущиеДанные));	
КонецПроцедуры

&НаКлиенте
Процедура сбисЗаполнитьСписокСправочникаНоменклатурыКонтрагентов(Список) Экспорт
	Таблица_НоменклатураКонтрагентов.Очистить();
	
	Для Каждого Соответствие Из Список Цикл
		
		СтрокаТаблицы							= Таблица_НоменклатураКонтрагентов.Добавить();
		СтрокаТаблицы.Наименование				= Соответствие.НоменклатураСБИС.Наименование;
		СтрокаТаблицы.Код						= Соответствие.НоменклатураСБИС.Код;
		СтрокаТаблицы.СопоставлениеНоменклатуры = Соответствие; 
		СтрокаТаблицы.Ссылка.ЗагрузитьЗначения(СоответствиеВМассив(Соответствие.Номенклатура1С,"Ключ")); 

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНоменклатурыПриИзменении(Элемент)
	ОбновитьКонтент();
КонецПроцедуры


//Перенести в модульобъектаклиент
&НаКлиенте
Функция СоответствиеВМассив(Соответствие, ИмяЭлемента = "")
	
	Результат = Новый Массив;
	
	Для Каждого КлючЗначение Из Соответствие Цикл
		
		Если ИмяЭлемента = "Ключ" Тогда
			
			Результат.Добавить(КлючЗначение.Ключ);
			
		ИначеЕсли ЗначениеЗаполнено(ИмяЭлемента) Тогда
			
			Результат.Добавить(КлючЗначение.Значение[ИмяЭлемента]);
			
		Иначе
			
			Результат.Добавить(КлючЗначение.Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

