
/////////////////////Стандартный////////////////////

// Процедура - вызывается после установки фильтра, включая пользовательские формы фильтра.
//
// Параметры:
//  Результат	 - Истина/Неопределено		 - нажали на отбор или нет
//  Параметры	 - Структура/Непределено 	 - Что надо установить
//
&НаКлиенте
Процедура СбисПослеУстановкиФильтра(Результат = Неопределено, ПараметрыВходящие = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
		
	ТекущийРазделГО = Кэш.Текущий;
	
	Если Не	ПараметрыВходящие = Неопределено 
		И	ПараметрыВходящие.Свойство("ФормаФильтраРазделаПольз") Тогда
		
		// Заполнить фильтры с пользовательской формы в текущий фильтр
		МодульОбъектаКлиент().РазделГО_ОбновитьФильтр(ТекущийРазделГО, ПараметрыВходящие.ФормаФильтраРазделаПольз);
		
	КонецЕсли;
	
	МодульОбъектаКлиент().РазделГО_СохранитьФильтр(ТекущийРазделГО);
	МодульОбъектаКлиент().РазделГО_ПрименитьФильтр(ТекущийРазделГО);
	ФильтрОбновитьПанель();
	ОбновитьКонтент();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОткрытьПанельУстановки(Элемент)

	МодульОбработка			= МодульОбъектаКлиент();
	
	РазделДляФильтра		= Кэш.Текущий;
	НазваниеРаздела 		= МодульОбработка.РазделГО_Получить(Кэш.Текущий, "Название");
	ТипРаздела				= МодульОбработка.РазделГО_Получить(Кэш.Текущий, "Тип");
	ПараметрыПриЗакрытии	= Новый Структура;
	ОбработчикФильтра		= МодульОбработка.НовыйСбисОписаниеОповещения("сбисПослеУстановкиФильтра", ЭтаФорма, ПараметрыПриЗакрытии);
	
	ФормыФильтраПольз		= Новый Массив;
	ФормыФильтраПольз.Добавить("Фильтр_Раздел_" + НазваниеРаздела + "_" + ТипРаздела);
	ФормыФильтраПольз.Добавить("Фильтр_Раздел_" + НазваниеРаздела + "_Шаблон");
	
	ПользовательскийФильтр = МодульОбъектаКлиент().ПользовательскаяТочкаВхода(, ФормыФильтраПольз);
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Если Не ПользовательскийФильтр = Неопределено Тогда
			
			ПараметрыФильтра = РазделДляФильтра.ПараметрыФильтра;
			
			Если	Не ПараметрыФильтра.Свойство("Установлен")
				Или	Не ПараметрыФильтра.Установлен Тогда
				
				Если	РазделДляФильтра.ПредыдущийРаздел.ПараметрыФильтра.Свойство("Установлен")
					И	РазделДляФильтра.ПредыдущийРаздел.ПараметрыФильтра.Установлен
					И	Не	РазделДляФильтра.ПредыдущийРаздел.ПараметрыФильтра.ПользовательскаяФормаФильтра = ПользовательскийФильтр.Модуль Тогда
					// Есть пользовательская форма фильтра у предыдущего раздела
					
					Для Каждого ЭлементБылДобавлен Из РазделДляФильтра.ПредыдущийРаздел.ПараметрыФильтра.ДопЭлементы Цикл
						
						ЭлементБылДобавлен.ТиповойЭлемент.Видимость = Ложь;
						
					КонецЦикла;
					
				КонецЕсли;
				
				ПараметрыФильтра.Вставить("Установлен",						Ложь);
				ПараметрыФильтра.Вставить("ПользовательскаяФормаФильтра",	ПользовательскийФильтр.Модуль);
				ПараметрыФильтра.Вставить("ИнтерфейснаяФормаФильтра",		ЭтаФорма);
				
				ДопФильтры = Кэш.ФормаНастроекОбщее.ДобавитьДополнительныеЭлементыФормыФильтра(Кэш, ПользовательскийФильтр.Модуль);
				ПараметрыФильтра.Вставить("ДопЭлементы", ДопФильтры);
				
				ПараметрыФильтра.Вставить("Установлен", Истина);
				
			КонецЕсли;
			
			// Есть ВФК фильтра ОФ. Показать его как панель.
			ФильтрУстановитьВидимость(ФильтрПериод);
			фрм = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ФильтрУстановитьВидимость", Кэш.Текущий.ОписаниеРаздела.ФормыРаздела);	
			фрм.ФильтрУстановитьВидимость(ЭтаФорма);
			ФильтрУстановитьВидимостьПослеЗаполнения();
			
			Возврат;
			
		КонецЕсли;
		
	#Иначе

		Если Не ПользовательскийФильтр = Неопределено Тогда
			
			// Есть ВФК фильтра УФ. Показать форму "как есть".
			ПараметрыПриЗакрытии.Вставить("ФормаФильтраРазделаПольз", ПользовательскийФильтр.Модуль);
			ПользовательскийФильтр.Модуль.ОписаниеОповещенияОЗакрытии = ОбработчикФильтра;
			ПользовательскийФильтр.Модуль.Открыть();
			Возврат;
			
		КонецЕсли;
		
	#КонецЕсли
	
	ПараметрыПолученияФорм	= Новый Структура("КэшироватьФорму",	Ложь);
	ПараметрыОткрытияФормы	= Новый Структура("Раздел, Источник",	РазделДляФильтра, РазделДляФильтра.Фильтр);

	Если НазваниеРаздела = "Справочники" Тогда
		
		ПараметрыОткрытияФормы.Вставить("ВариантФильтра", "ФормаГлавноеОкноНоменклатура");
		
	КонецЕсли;
	
	ФормаФильтра = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаУстановкиФильтра"); 
	ФормаФильтра.ОписаниеОповещенияОЗакрытии = ОбработчикФильтра;
	ФормаФильтра.ПоказатьПоверх(ПараметрыОткрытияФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущееЗначениеФильтраНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ФильтрОткрытьПанельУстановки("");
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОчистить(Элемент) Экспорт
	
	МодульОчисткиФильтра	= МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ФильтрОчистить", Кэш.Текущий.ФормыРаздела);
	ТекущийРазделГО			= Кэш.Текущий;
	
	Если МодульОчисткиФильтра = Ложь Тогда
		
		// Получить дефолтный фильтр
		ТекущийРазделГО.Фильтр = МодульОбъектаКлиент().РазделГО_Получить(ТекущийРазделГО, "ПустойФильтр");
		
	Иначе
		
		// На случай пользовательской функции очистки фильтра
		МодульОчисткиФильтра.ФильтрОчистить(Кэш);
		
		// После очистки, заполнить от формы новые параметры в фильтр
		ЗаполнитьЗначенияСвойств(ТекущийРазделГО.Фильтр, ЭтаФорма);
		
		// Временный костыль для заполнения пользовательского фильтра
		Если ТекущийРазделГО.Фильтр.Свойство("ПараметрыФильтра") Тогда
			
			Для Каждого ПользовательскийПараметрФильтра Из ТекущийРазделГО.Фильтр.ПараметрыФильтра Цикл
				
				Если Кэш.ПараметрыФильтра.Свойство(ПользовательскийПараметрФильтра.Ключ) Тогда
					
					ТекущийРазделГО.Фильтр.ПараметрыФильтра[ПользовательскийПараметрФильтра.Ключ] = Кэш.ПараметрыФильтра[ПользовательскийПараметрФильтра.Ключ];
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	МодульОбъектаКлиент().РазделГО_СохранитьФильтр(ТекущийРазделГО);
	МодульОбъектаКлиент().РазделГО_ПрименитьФильтр(ТекущийРазделГО);
	ФильтрОбновитьПанель();
	ОбновитьКонтент();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОбновитьПанель() Экспорт

	ПустойФильтраРаздела = МодульОбъектаКлиент().РазделГО_Получить(Кэш.Текущий, "ПустойФильтр");
	ПараметрыДляПустогоФильтра = Новый ФиксированнаяСтруктура("Фильтр", ПустойФильтраРаздела);
	
	ТекущееЗначениеФильтра	= МодульОбъектаКлиент().РазделГО_Получить(Кэш.Текущий, "ПредставлениеФильтра");
	ЗначениеПустогоФильтра	= МодульОбъектаКлиент().РазделГО_Получить(Кэш.Текущий, "ПредставлениеФильтра", ПараметрыДляПустогоФильтра);
	ЭлементПанель			= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПанельФильтра");
	ИмяСтраницы				= ?(ТекущееЗначениеФильтра = ЗначениеПустогоФильтра, "ФильтраНет", "ФильтрЕсть");
	ЭлементПанель.ТекущаяСтраница = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭлементПанель, ИмяСтраницы);

КонецПроцедуры

// Функция - Временное решение для работы фильтров - собирает полный набор параметров для запросов. Переделать на хранение в объкте разделов
// 
// Возвращаемое значение:
//  Структура - со всеми необходимыми параметрами для работы реестра
//
&НаКлиенте
Функция Реестры1С_ПолныйФильтр() Экспорт

	// функция формирует структуру фильтров, которые используются в запросе документов 1С при построении списка документов в разделах Продажа и Покупка	
	ПараметрыФильтра = Новый Структура("ФильтрМаска, ФильтрДатаНач, ФильтрДатаКнц, ФильтрКонтрагент, ФильтрКонтрагентПодключен, ФильтрДокумент, ФильтрОрганизация, ФильтрСостояние, ФильтрОтветственный, ВсеДокументы");
	ЗаполнитьЗначенияСвойств(ПараметрыФильтра, ЭтаФорма);
	
	ПараметрыФильтра.Вставить("РазмерСтраницы",	 ЗаписейНаСтранице1С); 
	ПараметрыФильтра.Вставить("Страница",		 ФильтрСтраница);
	ПараметрыФильтра.Вставить("ФильтрЕстьЕще",	 Ложь);
	
	// Добавляем пользовательские фильтры
	Если Кэш.ПараметрыФильтра.Количество() Тогда
		
		ПараметрыФильтра.Вставить( "Пользовательские", Новый Структура);
		Для Каждого Элемент Из Кэш.ПараметрыФильтра Цикл
			
			ПараметрыФильтра.Пользовательские.Вставить( Элемент.Ключ, Элемент.Значение);		
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПараметрыФильтра;	
	
КонецФункции

///////////////////Пользователський/////////////////

// Очищает в Кэше значения пользовательских фильтров для текущего раздела	
&НаКлиенте
Функция ОчиститьДополнительныеПараметрыФильтра(ФормаДопФильтра) Экспорт
	СписокДопЭлементов = ФормаДопФильтра.сбисСписокДопПараметровФильтра();
	ПараметрыУстановки = Новый Структура("ФормаДопФильтра, ДопЭлемент", ФормаДопФильтра);
	Отказ = Ложь;
	Для Каждого ДопЭлемент Из СписокДопЭлементов Цикл
		ПараметрыУстановки.ДопЭлемент = ДопЭлемент;
		РезультатУстановки = УстановитьЗначениеЭлементаФильтра(Кэш, ПараметрыУстановки, Отказ);
		Если Отказ Тогда
			сбисСообщитьОбОшибке(Кэш, РезультатУстановки);
			Отказ = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецФункции

//Устанавливает значение для элемента фильтра.
//ЛокальныйКэш
//	Структура инициированного кэша с отвязкой от ГП.
//ПараметрыФильтра
//	Структура с полями "ФормаДопФильтра", "ДопЭлемент" - элемент, возвращаемый формой в списке пользовательских фильтров
//Отказ
//	Булево. Флаг ошибок в процессе установки и возврата структуры ошибки
//Возвращает
//	В случае ошибки, структура описания ошибки.
//	В случае, если это не элемент фильтра - Ложь.
//	В случае успешной установки - Истина;
&НаКлиенте
Функция УстановитьЗначениеЭлементаФильтра(ЛокальныйКэш, ПараметрыФильтра, Отказ) Экспорт
	
	ФормаДопФильтра = ПараметрыФильтра.ФормаДопФильтра;
	ДопЭлемент		= ПараметрыФильтра.ДопЭлемент;
	Попытка
		Если ЛокальныйКэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
			ДопЭлемент_Значение	= ФормаДопФильтра[ДопЭлемент.Значение];
		Иначе
			ДопЭлемент_Элемент	= ЭтаФорма.ЭлементыФормы[ДопЭлемент.Значение];
			ДопЭлемент_Тип		= ТипЗнч(ДопЭлемент_Элемент);
			Если Не	(	ДопЭлемент_Тип = Тип("ПолеВвода")
					Или	ДопЭлемент_Тип = Тип("ПолеВыбора")
					Или	ДопЭлемент_Тип = Тип("Флажок")) Тогда
				Возврат Ложь;
			КонецЕсли;
			ДопЭлемент_Значение	= ДопЭлемент_Элемент.Значение;
		КонецЕсли;
	Исключение
		СтруктураОшибки = Новый Структура("code, message, details", 100, "Неизвестная ошибка системы", "Ошибка при определении дополнительного элемента фильтра " + ДопЭлемент.Значение + ": " + ОписаниеОшибки());
		Возврат СтруктураОшибки;
	КонецПопытки;
	
	ДопЭлемент_Значение_Тип = ТипЗнч(ДопЭлемент_Значение);
	ПараметрФильтра = "";//По-умолчанию, оставляем строку, как было.
	Если		ДопЭлемент_Значение_Тип = Тип("Дата") Тогда
		ПараметрФильтра = '0001.01.01';
	ИначеЕсли	ДопЭлемент_Значение_Тип = Тип("Число") Тогда
		ПараметрФильтра = 0;
	ИначеЕсли	ДопЭлемент_Значение_Тип = Тип("Булево") Тогда
		ПараметрФильтра = Ложь;
	ИначеЕсли	ДопЭлемент_Значение_Тип = Тип("СписокЗначений") Тогда
		ПараметрФильтра = Новый СписокЗначений;
		ПараметрФильтра.ТипЗначения = ДопЭлемент_Значение.ТипЗначения;//Ограничение типа тоже перенести.
	КонецЕсли;
	
	ЛокальныйКэш.ПараметрыФильтра.Вставить(ДопЭлемент.Значение, ПараметрФильтра);
	Если Не ЛокальныйКэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		ДопЭлемент_Элемент.Значение = ПараметрФильтра;
	КонецЕсли;
	Возврат Истина;

КонецФункции

// ОФ Показывает на форме элементы пользовательских фильтров	
&НаКлиенте
Функция ПоказатьДополнительныеПараметрыФильтра(ФормаДопФильтра) Экспорт
	СписокДопЭлементов = ФормаДопФильтра.сбисСписокДопПараметровФильтра();
	Для Каждого Элемент Из СписокДопЭлементов Цикл
		Попытка  
			ЭтаФорма.ЭлементыФормы[Элемент.Значение].Видимость = Истина;
		Исключение
		КонецПопытки;
	КонецЦикла;	
КонецФункции

// ОФ Скрывает на форме элементы пользовательских фильтров	
&НаКлиенте
Функция СкрытьДополнительныеПараметрыФильтра(ФормаДопФильтра) Экспорт
	СписокДопЭлементов =  ФормаДопФильтра.сбисСписокДопПараметровФильтра();
	Для Каждого Элемент Из СписокДопЭлементов Цикл
		Попытка  
			ЭтаФорма.ЭлементыФормы[Элемент.Значение].Видимость = Ложь;
		Исключение
		КонецПопытки;
	КонецЦикла;	
КонецФункции

// ОФ Записывает в Кэш значения пользовательских фильтров для текущего раздела	
&НаКлиенте
Функция УстановитьДополнительныеПараметрыФильтра(ФормаДопФильтра) Экспорт
	СписокДопЭлементов =  ФормаДопФильтра.сбисСписокДопПараметровФильтра();
	Для Каждого Элемент Из СписокДопЭлементов Цикл
		Попытка  
			Если ТипЗнч(ЭтаФорма.ЭлементыФормы[Элемент.Значение]) = Тип("ПолеВвода") или ТипЗнч(ЭтаФорма.ЭлементыФормы[Элемент.Значение]) = Тип("ПолеВыбора") или ТипЗнч(ЭтаФорма.ЭлементыФормы[Элемент.Значение]) = Тип("Флажок") Тогда
				Кэш.ПараметрыФильтра.Вставить(Элемент.Значение,ЭтаФорма.ЭлементыФормы[Элемент.Значение].Значение);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;	
КонецФункции

