
/////////////////////Стандартный////////////////////

//Функция складывает в структуру текущие значения фильтра для последующего их восстановления	
&НаКлиенте
Функция СбисВосстановитьФильтр(Кэш, СтруктураФильта) Экспорт

	Если СтруктураФильта = Неопределено Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	СтруктураФильта.Свойство("ФильтрПериод",				ФильтрПериод);
	СтруктураФильта.Свойство("ФильтрДатаНач",				ФильтрДатаНач);                               
	СтруктураФильта.Свойство("ФильтрДатаКнц",				ФильтрДатаКнц);
	СтруктураФильта.Свойство("ФильтрСостояние",				ФильтрСостояние);
	СтруктураФильта.Свойство("ФильтрКонтрагент",			ФильтрКонтрагент);
	СтруктураФильта.Свойство("ФильтрКонтрагентПодключен",	ФильтрКонтрагентПодключен); 
	СтруктураФильта.Свойство("ФильтрКонтрагентСФилиалами",	ФильтрКонтрагентСФилиалами);
	СтруктураФильта.Свойство("ФильтрОрганизация",			ФильтрОрганизация);
	СтруктураФильта.Свойство("ФильтрСтраница",				ФильтрСтраница);
	СтруктураФильта.Свойство("ФильтрОтветственный",			ФильтрОтветственный);
	СтруктураФильта.Свойство("ФильтрТипыДокументов",		ФильтрТипыДокументов);
	СтруктураФильта.Свойство("ФильтрМаска",					ФильтрМаска);                             
	
	//Заполним дополнительные параметры фильтра
	Если СтруктураФильта.Свойство("ПараметрыФильтра") Тогда
		Для Каждого Элемент Из СтруктураФильта.ПараметрыФильтра Цикл
			Кэш.ПараметрыФильтра.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
	МодульОбъектаКлиент().ИзменитьПараметрСбис("ПараметрыФильтра", СтруктураФильта);
	
КонецФункции

// Процедура - вызывается после установки фильтра, включая пользовательские формы фильтра.
//
// Параметры:
//  Результат	 - Истина/Неопределено		 - нажали на отбор или нет
//  Параметры	 - Структура/Непределено 	 - Что надо установить
//
&НаКлиенте
Процедура СбисПослеУстановкиФильтра(Результат, ПараметрыВходящие) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
		
	ТекущийРазделГО = Кэш.Текущий;
	
	Если	Не	ПараметрыВходящие = Неопределено 
		И		ПараметрыВходящие.Свойство("ФормаФильтраРазделаПольз") Тогда
		
		// Заполнить фильтры с пользовательской формы в текущий фильтр
		МодульОбъектаКлиент().СтруктураРазделаГО_ОбновитьФильтр(ТекущийРазделГО, ПараметрыВходящие.ФормаФильтраРазделаПольз);
		
	КонецЕсли;
	
	МодульОбъектаКлиент().СтруктураРазделаГО_СохранитьФильтр(ТекущийРазделГО);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ТекущийРазделГО.Фильтр);
	ФильтрОбновитьПанель();	
	ОбновитьКонтент();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОткрытьПанельУстановки(Элемент)

	МодульОбработка			= МодульОбъектаКлиент();
	
	РазделДляФильтра		= Кэш.Текущий;
	НазваниеРаздела 		= МодульОбработка.СтруктураРазделаГО_Получить(Кэш.Текущий, "Название");
	ТипРаздела				= МодульОбработка.СтруктураРазделаГО_Получить(Кэш.Текущий, "Тип");
	ПараметрыПриЗакрытии	= Новый Структура;
	ОбработчикФильтра		= МодульОбработка.НовыйСбисОписаниеОповещения("сбисПослеУстановкиФильтра", ЭтаФорма, ПараметрыПриЗакрытии);
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		ФильтрУстановитьВидимость(ФильтрПериод);
		фрм = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ФильтрУстановитьВидимость", Кэш.Текущий.ОписаниеРаздела.ФормыРаздела);	
		фрм.ФильтрУстановитьВидимость(ЭтаФорма);
		ФильтрУстановитьВидимостьПослеЗаполнения();
		Возврат;
		
	#Иначе
		
		ОбъектПользовательскойВФК	= МодульОбработка.ГлобальныйКэш_Получить("ВнешниеФункции");
		ПараметрыПолученияФорм		= Новый Структура("ОбработкаОбъект, КэшироватьФорму, ПолучитьНовую", ОбъектПользовательскойВФК, Ложь, Истина);
		ФормаФильтраРазделаПольз	= МодульОбработка.ПолучитьФормуОбработки("Фильтр_Раздел_" + НазваниеРаздела + "_" + ТипРаздела, ПараметрыПолученияФорм);
		Если ФормаФильтраРазделаПольз = Ложь Тогда
			
			ФормаФильтраРазделаПольз = МодульОбработка.ПолучитьФормуОбработки("Фильтр_Раздел_" + НазваниеРаздела + "_Шаблон", ПараметрыПолученияФорм);
			
		КонецЕсли;
	
		Если Не ФормаФильтраРазделаПольз = Ложь Тогда 
			
			ПараметрыПриЗакрытии.Вставить("ФормаФильтраРазделаПольз", ФормаФильтраРазделаПольз);
			ФормаФильтраРазделаПольз.ОписаниеОповещенияОЗакрытии = ОбработчикФильтра;
			ФормаФильтраРазделаПольз.Открыть();
			Возврат;
			
		КонецЕсли;
		
	#КонецЕсли
	
	ПараметрыПолученияФорм	= Новый Структура("КэшироватьФорму",	Ложь);
	ПараметрыОткрытияФормы	= Новый Структура("Раздел, Источник",	РазделДляФильтра, РазделДляФильтра.Фильтр);

	Если НазваниеРаздела = "Справочники" Тогда
		
		ПараметрыОткрытияФормы.Вставить("ВариантФильтра", "ФормаГлавноеОкноНоменклатура");
		
	КонецЕсли;
	
	ФормаФильтра = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаУстановкиФильтра"); 
	ФормаФильтра.ОписаниеОповещенияОЗакрытии = ОбработчикФильтра;
	ФормаФильтра.ПоказатьПоверх(ПараметрыОткрытияФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущееЗначениеФильтраНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ФильтрОткрытьПанельУстановки("");
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОчистить(Элемент) Экспорт
	
	МодульОчисткиФильтра = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ФильтрОчистить", Кэш.Текущий.ФормыРаздела);
	Если МодульОчисткиФильтра = Ложь Тогда
		
		Кэш.Текущий.Фильтр = МодульОбъектаКлиент().СтруктураРазделаГО_Получить(Кэш.Текущий, "ПустойФильтр");
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Кэш.Текущий.Фильтр);
		МодульОбъектаКлиент().ИзменитьПараметрСбис("ПараметрыФильтра", Кэш.Текущий.Фильтр);
		
	Иначе
		
		// На случай пользовательской функции очистки фильтра
		МодульОчисткиФильтра.ФильтрОчистить(Кэш);
		
	КонецЕсли;
	
	МодульОбъектаКлиент().СтруктураРазделаГО_СохранитьФильтр(Кэш.Текущий);
	ФильтрОбновитьПанель();	
	ОбновитьКонтент();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОбновитьПанель() Экспорт
	
	ТекущееЗначениеФильтра	= МодульОбъектаКлиент().СтруктураРазделаГО_Получить(Кэш.Текущий, "ПредставлениеФильтра");
	ЭлементПанель			= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПанельФильтра");
	ИмяСтраницы				= ?(ТекущееЗначениеФильтра = "", "ФильтраНет", "ФильтрЕсть");
	ЭлементПанель.ТекущаяСтраница = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭлементПанель, ИмяСтраницы);

КонецПроцедуры

///////////////////Пользователський/////////////////

// Очищает в Кэше значения пользовательских фильтров для текущего раздела	
&НаКлиенте
Функция ОчиститьДополнительныеПараметрыФильтра(ФормаДопФильтра) Экспорт
	СписокДопЭлементов = ФормаДопФильтра.сбисСписокДопПараметровФильтра();
	ПараметрыУстановки = Новый Структура("ФормаДопФильтра, ДопЭлемент", ФормаДопФильтра);
	Отказ = Ложь;
	Для Каждого ДопЭлемент Из СписокДопЭлементов Цикл
		ПараметрыУстановки.ДопЭлемент = ДопЭлемент;
		РезультатУстановки = УстановитьЗначениеЭлементаФильтра(Кэш, ПараметрыУстановки, Отказ);
		Если Отказ Тогда
			сбисСообщитьОбОшибке(Кэш, РезультатУстановки);
			Отказ = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецФункции

//Устанавливает значение для элемента фильтра.
//ЛокальныйКэш
//	Структура инициированного кэша с отвязкой от ГП.
//ПараметрыФильтра
//	Структура с полями "ФормаДопФильтра", "ДопЭлемент" - элемент, возвращаемый формой в списке пользовательских фильтров
//Отказ
//	Булево. Флаг ошибок в процессе установки и возврата структуры ошибки
//Возвращает
//	В случае ошибки, структура описания ошибки.
//	В случае, если это не элемент фильтра - Ложь.
//	В случае успешной установки - Истина;
&НаКлиенте
Функция УстановитьЗначениеЭлементаФильтра(ЛокальныйКэш, ПараметрыФильтра, Отказ) Экспорт
	
	ФормаДопФильтра = ПараметрыФильтра.ФормаДопФильтра;
	ДопЭлемент		= ПараметрыФильтра.ДопЭлемент;
	Попытка
		Если ЛокальныйКэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
			ДопЭлемент_Значение	= ФормаДопФильтра[ДопЭлемент.Значение];
		Иначе
			ДопЭлемент_Элемент	= ЭтаФорма.ЭлементыФормы[ДопЭлемент.Значение];
			ДопЭлемент_Тип		= ТипЗнч(ДопЭлемент_Элемент);
			Если Не	(	ДопЭлемент_Тип = Тип("ПолеВвода")
					Или	ДопЭлемент_Тип = Тип("ПолеВыбора")
					Или	ДопЭлемент_Тип = Тип("Флажок")) Тогда
				Возврат Ложь;
			КонецЕсли;
			ДопЭлемент_Значение	= ДопЭлемент_Элемент.Значение;
		КонецЕсли;
	Исключение
		СтруктураОшибки = Новый Структура("code, message, details", 100, "Неизвестная ошибка системы", "Ошибка при определении дополнительного элемента фильтра " + ДопЭлемент.Значение + ": " + ОписаниеОшибки());
		Возврат СтруктураОшибки;
	КонецПопытки;
	
	ДопЭлемент_Значение_Тип = ТипЗнч(ДопЭлемент_Значение);
	ПараметрФильтра = "";//По-умолчанию, оставляем строку, как было.
	Если		ДопЭлемент_Значение_Тип = Тип("Дата") Тогда
		ПараметрФильтра = '0001.01.01';
	ИначеЕсли	ДопЭлемент_Значение_Тип = Тип("Число") Тогда
		ПараметрФильтра = 0;
	ИначеЕсли	ДопЭлемент_Значение_Тип = Тип("Булево") Тогда
		ПараметрФильтра = Ложь;
	ИначеЕсли	ДопЭлемент_Значение_Тип = Тип("СписокЗначений") Тогда
		ПараметрФильтра = Новый СписокЗначений;
		ПараметрФильтра.ТипЗначения = ДопЭлемент_Значение.ТипЗначения;//Ограничение типа тоже перенести.
	КонецЕсли;
	
	ЛокальныйКэш.ПараметрыФильтра.Вставить(ДопЭлемент.Значение, ПараметрФильтра);
	Если Не ЛокальныйКэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		ДопЭлемент_Элемент.Значение = ПараметрФильтра;
	КонецЕсли;
	Возврат Истина;

КонецФункции

// ОФ Показывает на форме элементы пользовательских фильтров	
&НаКлиенте
Функция ПоказатьДополнительныеПараметрыФильтра(ФормаДопФильтра) Экспорт
	СписокДопЭлементов = ФормаДопФильтра.сбисСписокДопПараметровФильтра();
	Для Каждого Элемент Из СписокДопЭлементов Цикл
		Попытка  
			ЭтаФорма.ЭлементыФормы[Элемент.Значение].Видимость = Истина;
		Исключение
		КонецПопытки;
	КонецЦикла;	
КонецФункции

// ОФ Скрывает на форме элементы пользовательских фильтров	
&НаКлиенте
Функция СкрытьДополнительныеПараметрыФильтра(ФормаДопФильтра) Экспорт
	СписокДопЭлементов =  ФормаДопФильтра.сбисСписокДопПараметровФильтра();
	Для Каждого Элемент Из СписокДопЭлементов Цикл
		Попытка  
			ЭтаФорма.ЭлементыФормы[Элемент.Значение].Видимость = Ложь;
		Исключение
		КонецПопытки;
	КонецЦикла;	
КонецФункции

// ОФ Записывает в Кэш значения пользовательских фильтров для текущего раздела	
&НаКлиенте
Функция УстановитьДополнительныеПараметрыФильтра(ФормаДопФильтра) Экспорт
	СписокДопЭлементов =  ФормаДопФильтра.сбисСписокДопПараметровФильтра();
	Для Каждого Элемент Из СписокДопЭлементов Цикл
		Попытка  
			Если ТипЗнч(ЭтаФорма.ЭлементыФормы[Элемент.Значение]) = Тип("ПолеВвода") или ТипЗнч(ЭтаФорма.ЭлементыФормы[Элемент.Значение]) = Тип("ПолеВыбора") или ТипЗнч(ЭтаФорма.ЭлементыФормы[Элемент.Значение]) = Тип("Флажок") Тогда
				Кэш.ПараметрыФильтра.Вставить(Элемент.Значение,ЭтаФорма.ЭлементыФормы[Элемент.Значение].Значение);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;	
КонецФункции

// ОФ Скрывает Дополнительный аккордеон
&НаКлиенте
Процедура СкрытьДополнительныйАккордеон() Экспорт
	Если МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "АккордеонДополнительныйHTML").Видимость Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "АккордеонДополнительныйHTML").Видимость = Ложь;
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Контент").Лево = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Контент").Лево 
		- МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "АккордеонДополнительныйHTML").Ширина;
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Контент").Ширина = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Контент").Ширина 
		+ МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "АккордеонДополнительныйHTML").Ширина;
	КонецЕсли;
КонецПроцедуры

