
// АЛЯРМ! НЕ ИСПОЛЬЗОВАТЬ - УСТАРЕЛО 
&НаКлиенте
Функция СбисПолучитьФорму(СбисИмяФормы, Объект1С = Неопределено, ПарамФормы = Неопределено, СбисВладелецФормы = Неопределено) Экспорт
	
	Попытка
		ПараметрыЗапросаФормы = Новый Структура;
		ПараметрыЗапросаФормы.Вставить("Владелец",			СбисВладелецФормы);
		ПараметрыЗапросаФормы.Вставить("ОбработкаОбъект",	Объект1С);
		ПараметрыЗапросаФормы.Вставить("Параметры",			ПарамФормы);
		Возврат МодульОбъектаКлиент().ПолучитьФормуОбработки(СбисИмяФормы, ПараметрыЗапросаФормы);
	Исключение
		Результат		= Ложь;
		ИнфоОбОшибке	= ИнформацияОбОшибке();
		ОшибкаПолученияФормы= МодульОбъектаКлиент().НовыйСбисИсключение(ИнфоОбОшибке, "ФормаГлавноеОкно.СбисПолучитьФорму");
		ПолноеИмяФормы		= МодульОбъектаКлиент().ПолучитьФормуОбработки_ПолноеИмяФормы(СбисИмяФормы, Объект1С);
		БезопасноеИмяФормы	= МодульОбъектаКлиент().ПолучитьФормуОбработки_БезопасноеИмяФормы(ПолноеИмяФормы, Объект1С);
		
		МодульОбъектаКлиент().СообщитьСбисИсключение(ОшибкаПолученияФормы);
		МодульОбъектаКлиент().ПолучитьФормуОбработки_ЗакэшироватьФорму(Результат, БезопасноеИмяФормы);
		Возврат Результат;
	КонецПопытки;
	
КонецФункции

//На случай неоходимости вывода не на ГО, передаётся форма с элементом ПанельОжидания
&НаКлиенте
Процедура СбисПоказатьСостояние(ТекстСостояния, Форма = Неопределено, Индикатор = Неопределено, Пояснение="") Экспорт
	
	МодульОбъектаКлиент().ПоказатьСостояниеSABY(ТекстСостояния,
		Новый ФиксированнаяСтруктура("Интерфейс, Индикатор, Пояснение", ЭтаФорма, Индикатор, Пояснение));
		
КонецПроцедуры

//На случай неоходимости вывода не на ГО, передаётся форма с элементом ПанельОжидания
&НаКлиенте
Процедура СбисСпрятатьСостояние(Форма = Неопределено) Экспорт

	
	МодульОбъектаКлиент().ПоказатьСостояниеSABY(,
		Новый ФиксированнаяСтруктура("Интерфейс", Форма));

КонецПроцедуры

&НаКлиенте
Функция сбисПолучитьЭлементыДерева(Элемент) Экспорт
	Если Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		Возврат Элемент.ПолучитьЭлементы();
	КонецЕсли;
	Возврат Элемент.Строки;
КонецФункции
Функция сбисПолучитьМакет(ИмяМакета)
	
	Возврат МодульОбъектаСервер().ПолучитьМакетОбработкиНаСервере(ИмяМакета);


КонецФункции


