
// функции для совместимости кода 
&НаКлиенте
Функция СбисПолучитьФорму(СбисИмяФормы, Объект1С = Неопределено, ПараметрыФормы = Неопределено, СбисВладелецФормы = Неопределено) Экспорт
	
	Попытка
		ПараметрыЗапросаФормы = Новый Структура;
		ПараметрыЗапросаФормы.Вставить("Владелец",			СбисВладелецФормы);
		ПараметрыЗапросаФормы.Вставить("ОбработкаОбъект",	Объект1С);
		ПараметрыЗапросаФормы.Вставить("Параметры",			ПараметрыФормы);
		Возврат МодульОбъектаКлиент().ПолучитьФормуОбработки(СбисИмяФормы, ПараметрыЗапросаФормы);
	Исключение
		Результат		= Ложь;
		ИнфоОбОшибке	= ИнформацияОбОшибке();
		ОшибкаПолученияФормы= МодульОбъектаКлиент().НовыйСбисИсключение(ИнфоОбОшибке, "ФормаГлавноеОкно.СбисПолучитьФорму");
		ПолноеИмяФормы		= МодульОбъектаКлиент().ПолучитьФормуОбработки_ПолноеИмяФормы(СбисИмяФормы, Объект1С);
		БезопасноеИмяФормы	= МодульОбъектаКлиент().ПолучитьФормуОбработки_БезопасноеИмяФормы(ПолноеИмяФормы, Объект1С);
		
		МодульОбъектаКлиент().СообщитьСбисИсключение(ОшибкаПолученияФормы);
		МодульОбъектаКлиент().ПолучитьФормуОбработки_ЗакэшироватьФорму(Результат, БезопасноеИмяФормы);
		Возврат Результат;
	КонецПопытки;
	
КонецФункции

//На случай неоходимости вывода не на ГО, передаётся форма с элементом ПанельОжидания
&НаКлиенте
Процедура СбисПоказатьСостояние(ТекстСостояния, Форма = Неопределено, Индикатор = Неопределено, Пояснение="") Экспорт
	Если Форма = Неопределено Тогда
		ФормаВывода = ЭтаФорма;
	Иначе
		ФормаВывода = Форма;
	КонецЕсли;
	Если ТипЗнч(ФормаВывода) = Тип("УправляемаяФорма") Тогда
		Состояние(ТекстСостояния, Индикатор, Пояснение);
	Иначе
		ФормаВывода.ЭлементыФормы.ПанельОжидания.Видимость	= Истина;
		ФормаВывода.НадписьОжидания		= Символы.ПС + ТекстСостояния;
		ФормаВывода.НадписьПояснение	= Пояснение;
		Если Индикатор = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ФормаВывода.ЭлементыФормы.Индикатор.Видимость	= Истина;
		ФормаВывода.ЭлементыФормы.Индикатор.Значение	= Индикатор;
	КонецЕсли;	
КонецПроцедуры

//На случай неоходимости вывода не на ГО, передаётся форма с элементом ПанельОжидания
&НаКлиенте
Процедура СбисСпрятатьСостояние(Форма = Неопределено) Экспорт
	Если Форма = Неопределено Тогда
		ФормаВывода = ЭтаФорма;
	Иначе
		ФормаВывода = Форма;
	КонецЕсли;
	Если ТипЗнч(ФормаВывода) = Тип("УправляемаяФорма") Тогда
		Возврат;
	КонецЕсли;
	ФормаВывода.ЭлементыФормы.ПанельОжидания.Видимость = Ложь;
	ФормаВывода.ЭлементыФормы.Индикатор.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Функция сбисПолучитьЭлементыДерева(Элемент) Экспорт
	Если Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		Возврат Элемент.ПолучитьЭлементы();
	КонецЕсли;
	Возврат Элемент.Строки;
КонецФункции
Функция сбисПолучитьМакет(ИмяМакета)
	
	Возврат МодульОбъектаСервер().ПолучитьМакетОбработкиНаСервере(ИмяМакета);


КонецФункции


