
&НаКлиенте
Процедура ВложениеСБИС_ЗаполнитьПараметрыПередРасчетом_ВходящийКонтекст(ВложениеСБИС) 
	
	ФункцииРасчета		= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	СтруктураИниФайла	= ВложениеСБИС_Получить(ВложениеСБИС, "УстановленныйПодразделИни");

	Если ПолучитьЗначениеПараметраСбис("ЗаполнениеКонтрагента1С") = "ГрузополучательСБИС" Тогда  
		
		Контрагент_Роль = "Грузополучатель";
				
		Если	СтруктураИниФайла.Свойство("Контрагент_Роль")
			И	СтруктураИниФайла.Контрагент_Роль.Свойство("Значение") 
			И	ВложениеСБИС.Свойство("Контрагент1С") Тогда
			
				КонтрагентРоль	= ФункцииРасчета.РассчитатьЗначение("Контрагент_Роль", СтруктураИниФайла);
				ИмяРеквизита	= Сред(	СтруктураИниФайла.мСторона[КонтрагентРоль].Сторона.Значение, 
										Найти(СтруктураИниФайла.мСторона[КонтрагентРоль].Сторона.Значение, ".") + 1);
											
				ВложениеСБИС.ВходящийКонтекст.РассчитанноеЗначение.Вставить(ИмяРеквизита, Контрагент_Роль);			
						
			КонецЕсли;
			
	Иначе
		
		Контрагент_Роль = "Покупатель";
		
		Если	СтруктураИниФайла.Свойство("Контрагент_Роль")
			И	СтруктураИниФайла.Контрагент_Роль.Свойство("Значение") 
			И	ВложениеСБИС.Свойство("Контрагент1С") Тогда
			
				КонтрагентРоль	= ФункцииРасчета.РассчитатьЗначение("Контрагент_Роль", СтруктураИниФайла);
				ИмяРеквизита	= Сред(СтруктураИниФайла.мСторона[КонтрагентРоль].Сторона.Значение, 
											Найти(СтруктураИниФайла.мСторона[КонтрагентРоль].Сторона.Значение,".")+1);
				
				ВложениеСБИС.ВходящийКонтекст.РассчитанноеЗначение.Вставить(ИмяРеквизита, Контрагент_Роль);							
						
		КонецЕсли;
				
	КонецЕсли;
	
	СкладПоУмолчанию	= ПолучитьЗначениеПараметраСбис("СкладПоУмолчанию");
	РасСчетПоУмолчанию	= ПолучитьЗначениеПараметраСбис("РасСчетПоУмолчанию");
	АвтоматическоеПроведениеЗаказов	= ПолучитьЗначениеПараметраСбис("АвтоматическоеПроведениеЗаказов");
	Если ЗначениеЗаполнено(СкладПоУмолчанию) Тогда
		
		ВложениеСБИС.ВходящийКонтекст.РассчитанноеЗначение.Вставить("Склад", СкладПоУмолчанию);
		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(РасСчетПоУмолчанию) Тогда
		
		ВложениеСБИС.ВходящийКонтекст.РассчитанноеЗначение.Вставить("РасСчет", РасСчетПоУмолчанию);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АвтоматическоеПроведениеЗаказов) Тогда
		
		ВложениеСБИС.ВходящийКонтекст.РассчитанноеЗначение.Вставить("АвтоматическоеПроведениеЗаказов", АвтоматическоеПроведениеЗаказов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_ЗаполнитьПараметрыПередРасчетом_РучныеПравки(ВложениеСБИС, РассчитываемыйОбъект)

	Если РассчитываемыйОбъект = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
		
	РучныеПравки		= ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураРучныхПравок");
	СтруктураИниФайла	= ВложениеСБИС_Получить(ВложениеСБИС, "УстановленныйПодразделИни");
	ФункцииРасчета		= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	
	Для Каждого РучноеПоле Из РучныеПравки Цикл
		
		РассчитываемыйОбъект.Вставить(РучноеПоле.Ключ, РучноеПоле.Значение);
		
	КонецЦикла;
		
	Если ВложениеСБИС.Свойство("РучноеИзменение") И ВложениеСБИС.РучноеИзменение = Истина Тогда
		// Старый алгоритм отпилить в 4100
		Попытка
			Если	СтруктураИниФайла.Свойство("Договор")
				И	СтруктураИниФайла.Договор.Свойство("Значение")
				И	ВложениеСБИС.Свойство("Договор1С") Тогда
				
				ИмяРеквизита = Сред(СтруктураИниФайла.Договор.Значение, Найти(СтруктураИниФайла.Договор.Значение,".")+1);
				РассчитываемыйОбъект.Вставить(ИмяРеквизита, ВложениеСБИС.Договор1С);
				
			КонецЕсли;
			
			Если	СтруктураИниФайла.Свойство("Документ_Дата")
				И	СтруктураИниФайла.Документ_Дата.Свойство("Значение")
				И	ВложениеСБИС.Свойство("Дата1С") Тогда
				
				ИмяРеквизита = Сред(СтруктураИниФайла.Документ_Дата.Значение, Найти(СтруктураИниФайла.Документ_Дата.Значение,".")+1);
				РассчитываемыйОбъект.Вставить(ИмяРеквизита, ВложениеСБИС.Дата1С);
				
			КонецЕсли;
			
			Если	СтруктураИниФайла.Свойство("Контрагент_Роль")
				И	СтруктураИниФайла.Контрагент_Роль.Свойство("Значение")
				И	ВложениеСБИС.Свойство("Контрагент1С") Тогда
				
				КонтрагентРоль = ФункцииРасчета.РассчитатьЗначение("Контрагент_Роль", СтруктураИниФайла);
				ИмяРеквизита = Сред(СтруктураИниФайла.мСторона[КонтрагентРоль].Сторона.Значение, Найти(СтруктураИниФайла.мСторона[КонтрагентРоль].Сторона.Значение,".")+1);
				РассчитываемыйОбъект.Вставить(ИмяРеквизита, ВложениеСБИС.Контрагент1С);
				
			КонецЕсли;
			
		Исключение
			
			СообщитьСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ВложениеСБИС_ЗаполнитьПараметрыПередРасчетом_РучныеПравки");
			
		КонецПопытки;
		
	КонецЕсли;

КонецПроцедуры


// Процедура - заполняет текущий экземпляр класса по данным файла
//
// Параметры:
//  ВложениеСБИС	 - Структура	- (О) экземпляр класса
//  ДанныеЗаполнить	 - Структура	- (О) входные данные заполнить
//		Файл:				 Файл	 - описание файла, от которого заполняется информация
//		ПолноеИмяФайла:		 Строка	 - Если не указан Файл. Полный путь к файлу 
//		ИмяФайла:			 Строка	 - Если не указан Файл. Краткое имяфайла
//		Название:            Строка	 - Если не указан Файл. Представление файла
//		Шифрование (Н):		 Булево	 - признак шифрования вложения
//
&НаКлиенте
Процедура яВложениеСБИС_Заполнить_Файл(ВложениеСБИС, ДанныеЗаполнить) 
	Перем ФайлЗначение, лШифрование;
	
	Если ДанныеЗаполнить.Свойство("Файл", ФайлЗначение) Тогда 
		
		ПолноеИмяФайла	= ФайлЗначение.ПолноеИмя;
		ИмяФайла		= ФайлЗначение.Имя;
		Название		= ФайлЗначение.Имя;
		
	Иначе
		
		ПолноеИмяФайла	= ДанныеЗаполнить.ПолноеИмяФайла;
		ИмяФайла		= ДанныеЗаполнить.ИмяФайла;
		Название		= ДанныеЗаполнить.Название;
		
	КонецЕсли;
	
	ВложениеСБИС_Установить(ВложениеСБИС, "Название",		Название);
	ВложениеСБИС_Установить(ВложениеСБИС, "ПолноеИмяФайла",	ПолноеИмяФайла);
	ВложениеСБИС_Установить(ВложениеСБИС, "ИмяФайла",		ИмяФайла);
	ВложениеСБИС_Установить(ВложениеСБИС, "ТипДанных",		"ВнешнийФайл");

	ВложениеСБИС_Установить(ВложениеСБИС, "ТребуетПодписания", Истина);	
	
КонецПроцедуры

