
&НаКлиенте
Процедура ВложениеСБИС_ЗаполнитьПоДокументФайл_НеобязательныеПоля(ВложениеСБИС, ДанныеЗаполнить)
	Перем ВерсияФайлаСформированаОбработкой, ФорматФайлаСформированаОбработкой;
	
	ФункцииРаботыСДокументами	= ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции");
	Кэш							= ПолучитьТекущийЛокальныйКэш();	
  	КонтекстДляРасчета			= Новый Структура("ФайлДанные", ДанныеЗаполнить.ГрязныйИни);

	СвязанныеДокументы1С	= ФункцииРаботыСДокументами.сбисПолучитьСвязанныеДокументы1С(Кэш,	КонтекстДляРасчета);

	// Надо сопоставить номенклатуру перед отправкой
	НоменклатураКодКонтрагента	= ФункцииРаботыСДокументами.РассчитатьЗначение("НоменклатураКодКонтрагента",	КонтекстДляРасчета.ФайлДанные);
	// Идентификатор ГК на документ
	ИдентификаторГосконтракта	= ФункцииРаботыСДокументами.РассчитатьЗначение("ИдентификаторГосконтракта",		КонтекстДляРасчета.ФайлДанные);
	Примечание					= ФункцииРаботыСДокументами.РассчитатьЗначение("Примечание",					КонтекстДляРасчета.ФайлДанные);
	// провести документ в СБИС сразу после записи и переходу по этапу.
	ПровестиВСБИС				= ФункцииРаботыСДокументами.РассчитатьЗначение("Провести",						КонтекстДляРасчета.ФайлДанные);

	ДопПоля = Новый Структура;
	Если КонтекстДляРасчета.ФайлДанные.Свойство("ДопПоля") Тогда
		ДопПоляИзДокумента = Кэш.ОбщиеФункции.РазбитьСтрокуВМассивНаКлиенте(КонтекстДляРасчета.ФайлДанные.ДопПоля, ",");
		Если ДопПоляИзДокумента.Количество() Тогда
			ДопПоля = ДопПоляИзДокумента;	
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Примечание) Тогда
		
		ВложениеСБИС.Примечание = Примечание;
		
	КонецЕсли;
	
	Если	ЗначениеЗаполнено(СвязанныеДокументы1С)
		И	ДанныеЗаполнить.Свойство("ДокументСсылка") Тогда
		
		СвязанныеДокументы1С.Вставить(0, ДанныеЗаполнить.ДокументСсылка);
		ВложениеСБИС.Документы1С = СвязанныеДокументы1С;
		
	КонецЕсли;
	
	// Для отправителя может быть задан сертификат
	Если ЗначениеЗаполнено(ВложениеСБИС.Отправитель) Тогда
		
		СертификатОтправителя	= ПрочитатьДополнительныйПараметрСтороны(ВложениеСБИС.Отправитель, "Сертификат");
		Если ЗначениеЗаполнено(СертификатОтправителя) Тогда
			
			ВложениеСБИС.Сертификат = СертификатОтправителя;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Поля, которых по-умолчанию нет в классе
	Если ДанныеЗаполнить.Свойство("ДокументСсылка") Тогда
		
		ВложениеСБИС.Вставить("Документ1С",	ДанныеЗаполнить.ДокументСсылка);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НоменклатураКодКонтрагента) Тогда
		
		ВложениеСБИС.Вставить("НоменклатураКодКонтрагента",	НоменклатураКодКонтрагента);
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ДопПоля) Тогда
		
		ВложениеСБИС.Вставить("ДопПоля", ДопПоля);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПровестиВСБИС) Тогда
		
		ВложениеСБИС.Вставить("Провести", ПровестиВСБИС);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторГосконтракта) Тогда
		
		ВложениеСБИС.ДанныеСтруктурыФайла.Поля.Вставить("Госконтракт", ИдентификаторГосконтракта);
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ВложениеСБИС_ЗаполнитьПоДокументФайл_ОтправительПолучатель(ВложениеСБИС, ДанныеЗаполнить)
	Перем лДанныеСторон, РольСтороны, СертификатОтправителя, ЗапретРедакцииПолучателя;
	
	ФункцииРаботыСДокументами	= ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции");
	ДокФайлОписание				= ДанныеЗаполнить.ФайлДанные;

	// Определить стороны вложения - отправитель, получатель
	Если Не ДанныеЗаполнить.Свойство("ДанныеСторон", лДанныеСторон) Тогда
		
		Если ДанныеЗаполнить.Свойство("ПутьКСторонам") Тогда
			
			лДанныеСторон = ПолучитьДанныеПоПути(Новый Структура("Данные, Путь", ДокФайлОписание, ДанныеЗаполнить.ПутьКСторонам));
			
		ИначеЕсли ДокФайлОписание.Свойство("Документ") Тогда
			
			лДанныеСторон = ДокФайлОписание.Документ;
			
		Иначе
			
			лДанныеСторон = ДокФайлОписание;
			
		КонецЕсли;
		
		ДанныеЗаполнить.Вставить("ДанныеСторон", лДанныеСторон);
		
	КонецЕсли;
	
	ОтправительДанные	= "";
	ПолучательДанные	= "";
	
	Если Не лДанныеСторон = Неопределено Тогда
		
		Если ДанныеЗаполнить.Свойство("ОтправительРоль", РольСтороны)
			И лДанныеСторон.Свойство(РольСтороны) Тогда
			
			ОтправительДанные		= ФункцииРаботыСДокументами.сбисСкопироватьОбъектНаКлиенте(лДанныеСторон[РольСтороны]);
	
		КонецЕсли;
		
		Если ДанныеЗаполнить.Свойство("ПолучательРоль", РольСтороны)
			И лДанныеСторон.Свойство(РольСтороны) Тогда
			
			ПолучательДанные			= ФункцииРаботыСДокументами.сбисСкопироватьОбъектНаКлиенте(лДанныеСторон[РольСтороны]);
			// Для получателя проверить запрет редакций
			ЗапретРедакцииПолучателя	= ПрочитатьДополнительныйПараметрСтороны(ПолучательДанные, "ЗапретРедакций");

			Если ЗапретРедакцииПолучателя = Истина Тогда
				
				ПолучательДанные.Вставить("ЗапретРедакций", ЗапретРедакцииПолучателя);		
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;		
	ВложениеСБИС.Отправитель	= ОтправительДанные;
	ВложениеСБИС.Получатель		= ПолучательДанные;
	
КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_ЗаполнитьПоДокументФайл_РасчетныеПоля(ВложениеСБИС, ДанныеЗаполнить)
	Перем Тип, ПодТип, ВерсияФормата, ПодВерсияФормата;
	
	ВложениеСБИС_ЗаполнитьПоДокументФайл_ОтправительПолучатель(ВложениеСБИС,		ДанныеЗаполнить);
	
	ФункцииРаботыСДокументами	= ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции");
	Кэш							= ПолучитьТекущийЛокальныйКэш();
	
	КонтекстДляРасчета	= Новый Структура("ФайлДанные", ДанныеЗаполнить.ГрязныйИни);
	Док					= ДанныеЗаполнить.ДокументФайл;
	ДокФайлОписание		= ДанныеЗаполнить.ФайлДанные;
	
	ОтветственныйСтруктура	= ФункцииРаботыСДокументами.ПолучитьСтруктуруОтветственного(Кэш,	КонтекстДляРасчета);
	ПодразделениеСтруктура	= ФункцииРаботыСДокументами.ПолучитьСтруктуруПодразделения(Кэш,		КонтекстДляРасчета);
	РегламентСтруктура		= ФункцииРаботыСДокументами.ПолучитьСтруктуруРегламента(Кэш,		КонтекстДляРасчета);
	ОснованияМассив			= ФункцииРаботыСДокументами.ПолучитьМассивОснований(Кэш,			КонтекстДляРасчета);  
	СвязанныеДокументы1С	= ФункцииРаботыСДокументами.сбисПолучитьСвязанныеДокументы1С(Кэш,	КонтекстДляРасчета);

	ВложениеДанные  = Новый Структура;
	ФункцииРаботыСДокументами.ЗаполнитьАтрибуты(Кэш, "Вложение", ДанныеЗаполнить.ГрязныйИни, ВложениеДанные);
	
	// Может быть прокинуто 
	Если Не	ВложениеДанные.Свойство("Тип", Тип) Тогда
		
		ДанныеЗаполнить.Свойство("Тип", Тип);
		
	КонецЕсли;
	
	Если Не	ВложениеДанные.Свойство("ПодТип", ПодТип) Тогда
		
		ДанныеЗаполнить.Свойство("ПодТип", ПодТип);
		
	КонецЕсли;
	
	Если Не	ВложениеДанные.Свойство("ВерсияФормата", ВерсияФормата) Тогда
		
		ДанныеЗаполнить.Свойство("ВерсияФормата", ВерсияФормата);
		
	КонецЕсли;
	
	Если Не	ВложениеДанные.Свойство("ПодВерсияФормата", ПодВерсияФормата) Тогда
		
		ДанныеЗаполнить.Свойство("ПодВерсияФормата", ПодВерсияФормата);
		
	КонецЕсли;
	
	// используется генератор ФЭД для формирования XML
	ИспользоватьГенератор		= ФункцииРаботыСДокументами.РассчитатьЗначение("ИспользоватьГенератор",			КонтекстДляРасчета.ФайлДанные);
	
	ВложениеСБИС.Ответственный			= ОтветственныйСтруктура;
	ВложениеСБИС.Подразделение			= ПодразделениеСтруктура;
	ВложениеСБИС.Регламент				= РегламентСтруктура;
	ВложениеСБИС.ДокументОснование		= ОснованияМассив;
	ВложениеСБИС.Тип					= Тип;
	ВложениеСБИС.ПодТип					= ПодТип;
	ВложениеСБИС.ВерсияФормата			= ВерсияФормата;
	ВложениеСБИС.ПодВерсияФормата		= ПодВерсияФормата;

	ВложениеСБИС.Вставить("СтруктураДокумента",	Док);
	ВложениеСБИС_Заполнить(ВложениеСБИС, ИспользоватьГенератор = Истина, "ИспользоватьГенератор");
	ВложениеСБИС_ЗаполнитьПоДокументФайл_НеобязательныеПоля(ВложениеСБИС, ДанныеЗаполнить);
			
КонецПроцедуры	

&НаКлиенте
Процедура ВложениеСБИС_ЗаполнитьПоДокументФайл_МодулиВложения(ВложениеСБИС, ДанныеЗаполнить)
	Перем ВерсияФайлаСформированаОбработкой, ФорматФайлаСформированаОбработкой;
	
	НаборМодулейФормата = Новый Массив;
	ДокФайлОписание		= ДанныеЗаполнить.ФайлДанные;
	Если ДокФайлОписание.Свойство("ВерсияФормата", ВерсияФайлаСформированаОбработкой)  Тогда
		
		ВерсияФайлаСформированаОбработкой = СтрЗаменить(СтрЗаменить(ВерсияФайлаСформированаОбработкой, ".", "_"), " ", "");
		
	Иначе
		
		ВерсияФайлаСформированаОбработкой = "3_01";		
		
	КонецЕсли;
		
	Если ДокФайлОписание.Свойство("Формат", ФорматФайлаСформированаОбработкой)  Тогда
		
		НаборМодулейФормата.Добавить("Файл_" + СтрЗаменить(СтрЗаменить(ФорматФайлаСформированаОбработкой, ".", "_"), " ", "") + "_" + ВерсияФайлаСформированаОбработкой);		
		
	КонецЕсли;
	
	Если Не ВерсияФайлаСформированаОбработкой = "3_01" Тогда
		
		НаборМодулейФормата.Добавить("Файл_Шаблон_" + ВерсияФайлаСформированаОбработкой);
		
	КонецЕсли;
	
	НаборМодулейФормата.Добавить("Файл_Шаблон");
	
	ВложениеСБИС.Параметры.НаборМодулейДляФормата = НаборМодулейФормата;
	
КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_ЗаполнитьПоДокументФайл_ТочкаВходаПередФормированием(ВложениеСБИС, ДанныеЗаполнить)
	Перем ВерсияФайлаСформированаОбработкой, ФорматФайлаСформированаОбработкой;
	
	НаборМодулейФормата = ВложениеСБИС.Параметры.НаборМодулейДляФормата ;
	
	// Вызов перед формированием вложения
	ТочкаВходаВФК = ПользовательскаяТочкаВхода("ВложениеСБИС_ПередФормированием", НаборМодулейФормата, ПолучитьТекущийЛокальныйКэш());
	Если Не ТочкаВходаВФК = Неопределено Тогда
		
		АргументыТочкиВхода = СоздатьКопиюОбъекта(ДанныеЗаполнить, Новый Структура("ГлубокаяКопия", Ложь));
		АргументыТочкиВхода.Вставить("Вложение", ВложениеСБИС);
		
		ВызватьПользовательскуюТочкуВхода(ТочкаВходаВФК, АргументыТочкиВхода);
		
		ВложениеСБИС = АргументыТочкиВхода.Вложение;
		ВложениеСБИС.Параметры.Вставить("Вызов_сбисПослеФормированияДокумента", Ложь);
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнить, АргументыТочкиВхода);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_ЗаполнитьПоДокументФайл_ТочкаВходаПослеФормирования(ВложениеСБИС, ДанныеЗаполнить)
	
	НаборМодулейФормата = ВложениеСБИС.Параметры.НаборМодулейДляФормата;
	
	// Вызов перед формированием вложения
	ТочкаВходаВФК = ПользовательскаяТочкаВхода("ВложениеСБИС_ПослеФормирования", НаборМодулейФормата, ПолучитьТекущийЛокальныйКэш());
	Если Не ТочкаВходаВФК = Неопределено Тогда
		
		АргументыТочкиВхода = СоздатьКопиюОбъекта(ДанныеЗаполнить, Новый Структура("ГлубокаяКопия", Ложь));
		АргументыТочкиВхода.Вставить("Вложение", ВложениеСБИС);
		
		ВызватьПользовательскуюТочкуВхода(ТочкаВходаВФК, АргументыТочкиВхода);
		
		ВложениеСБИС = АргументыТочкиВхода.Вложение;
		ВложениеСБИС.Параметры.Вставить("Вызов_сбисПослеФормированияДокумента", Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_ЗаполнитьПоДокументФайл_ОбратноеСопоставлениеНоменклатуры(ВложениеСБИС, ДанныеЗаполнить)

	ФункцииРаботыСДокументами	= ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции");
	
	ИспользоватьОбратноеСопоставление = ФункцииРаботыСДокументами.РассчитатьЗначение("ИспользоватьСопоставлениеНоменклатуры", ДанныеЗаполнить.ГрязныйИни);
	ИспользоватьОбратноеСопоставление = ИспользоватьОбратноеСопоставление = Истина
									И	ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры_ОбратноеСопоставление")
									И	ПолучитьЗначениеПараметраСБИС("ИспользоватьОбратноеСопоставление");
	
	
	ВложениеСБИС_Заполнить(ВложениеСБИС, ИспользоватьОбратноеСопоставление, "ИспользоватьСопоставлениеНоменклатуры");

	Если Не ИспользоватьОбратноеСопоставление Тогда
		
		Возврат;
		
	КонецЕсли;

	// Взять таблдок и сформировать классы сопоставления, вставить последнее во Вложение
		
	МодульОснованиеПоТипу = НайтиФункциюСеансаОбработки("НайтиОснованиеПоТипу", ВложениеСБИС.Параметры.НаборМодулейДляФормата);
	Если МодульОснованиеПоТипу = Ложь Тогда
		
		Возврат;
		
	КонецЕсли;
		
	Основание = МодульОснованиеПоТипу.НайтиОснованиеПоТипу(ДанныеЗаполнить.ДокументФайл, "Заказ");
	Если Не ЗначениеЗаполнено(Основание) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеОснования = Новый Структура("Название, Дата, Номер, Идентификатор, Тип");
	ЗаполнитьЗначенияСвойств(ДанныеОснования, Основание);    
	ДанныеОснования.Тип = "ЗаказВх";
	
	ВложениеСБИС_Заполнить(ВложениеСБИС, ДанныеОснования, "ДокументДляСопоставления");
	ВложениеСБИС_Заполнить(ВложениеСБИС, "ФормаОбратногоСопоставления", "ФормаСопоставленияНоменклатуры");
	
	ФайлПерегенерируется = ИспользоватьГенераторДляВложения(ВложениеСБИС);
	ВложениеСБИС_Заполнить(ВложениеСБИС, ФайлПерегенерируется, "ФайлПерегенерируется");
	
	ВложениеСБИС_ПропатчитьНовымСопоставлением(ВложениеСБИС);
КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_ЗаполнитьПоДокументФайл_СопоставлениеНоменклатуры(ВложениеСБИС, КонтекстСопоставления)

	ФункцииРаботыСДокументами	= ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции");
	
	Если НЕ МодульОбъектаКлиент().ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры")
		И НЕ МодульОбъектаКлиент().ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры4100")
		ИЛИ НЕ МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИспользоватьНовоеСопоставлениеНоменклатуры") Тогда 
		Возврат;
	КонецЕсли;
		
	МодульОснованиеПоТипу = НайтиФункциюСеансаОбработки("НайтиОснованиеПоТипу", ВложениеСБИС.Параметры.НаборМодулейДляФормата);
	Если МодульОснованиеПоТипу = Ложь Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Основание = МодульОснованиеПоТипу.НайтиОснованиеПоТипу(КонтекстСопоставления.ДокументФайл, "Заказ");
	Если Не ЗначениеЗаполнено(Основание) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеОснования = Новый Структура("Название, Дата, Номер, Идентификатор, Тип");
	ЗаполнитьЗначенияСвойств(ДанныеОснования, Основание);    
	ДанныеОснования.Тип = "ЗаказВх";
	
	ВложениеСБИС_Заполнить(ВложениеСБИС, ДанныеОснования, "ДокументДляСопоставления");
	
	ФайлПерегенерируется = ИспользоватьГенераторДляВложения(ВложениеСБИС);
	ВложениеСБИС_Заполнить(ВложениеСБИС, ФайлПерегенерируется, "ФайлПерегенерируется");
	
	ВложениеСБИС_ПропатчитьНовымСопоставлением(ВложениеСБИС, КонтекстСопоставления);
	
КонецПроцедуры

