
&НаКлиенте
Процедура НайтиПодходящиеДокументы_ЗаполнитьФильтры(ПараметрыЗаполнить)
	
	НайтиПодходящиеДокументы_ЗаполнитьПараметрыФильтра(ПараметрыЗаполнить);
	НайтиПодходящиеДокументы_УстановитьФильтрПоДатеНомеру(ПараметрыЗаполнить);

	//Обработка контрагента
	Если ПараметрыЗаполнить.ЕстьПоискПоКонтрагенту Тогда
		
		ПараметрыЗаполнить.Вставить("Ключ", "Контрагент");
		Попытка
			
			НайтиПодходящиеДокументы_УстановитьФильтрПоСтороне(ПараметрыЗаполнить);
			
		Исключение
			
			ВызватьСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ВложениеСБИС_НайтиПодходящиеДокументы");
			
		КонецПопытки;
		
	КонецЕсли;

	//Обработка организации
	Если ПараметрыЗаполнить.ЕстьПоискПоОрганизации Тогда

		ПараметрыЗаполнить.Вставить("Ключ", "Организация");
		Попытка
			
			НайтиПодходящиеДокументы_УстановитьФильтрПоСтороне(ПараметрыЗаполнить);
			
		Исключение
			
			ВызватьСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ВложениеСБИС_НайтиПодходящиеДокументы");
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры
	
// Процедура - заполнить параметры фильтра: тип, дата, номер
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - Структура вложения
//  ДопПараметры - Структура	 - расширение
// 
&НаКлиенте
Процедура НайтиПодходящиеДокументы_ЗаполнитьПараметрыФильтра(ПараметрыЗаполнить)
	Перем	УзелИниПоиска, ИмяИниДляПоиска, ТипОбъектаПоиск, ПНВыборки;
	
	Если ПараметрыЗаполнить.Свойство("НомерВыборки", ПНВыборки) Тогда
		
		ПНВыборки = ПНВыборки + 1;

	Иначе
		
		ПНВыборки = 1;
		
	КонецЕсли;
	ПараметрыЗаполнить.Вставить("НомерВыборки", ПНВыборки);
	
	РежимПоискаДокумента = ПараметрыЗаполнить.Режим;
	ТекущийРазделИни	 = ПараметрыЗаполнить.УзелИни;
	ОписаниеЗапроса		 = ПараметрыЗаполнить.ОписаниеЗапроса;
	ЕстьТипОбъекта		 = ПараметрыЗаполнить.Свойство("Тип",	ТипОбъектаПоиск);

	ОписаниеЗапроса.Формат.Вставить("УсловияЗапроса" + ПНВыборки, "");
	
	ШаблонВыборки = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|Объект.Ссылка КАК ОбъектСсылка
		|{ШаблонВременнаяТаблицаДокументов}
		|ИЗ
		| {ТипОбъект" + ПНВыборки + "} КАК Объект
		|ГДЕ
		|	НЕ Объект.ПометкаУдаления{УсловияЗапроса" + ПНВыборки + "}
		|СГРУППИРОВАТЬ ПО Объект.Ссылка";
	
	Если		ПНВыборки = 1 Тогда
		
		ОписаниеЗапроса.Текст = ШаблонВыборки;
		ОписаниеЗапроса.Формат.Вставить("ШаблонВременнаяТаблицаДокументов",	"");
		
	Иначе
		
		Если	ПНВыборки = 2 Тогда
			
			// Обрабатывается больше 1 типа документов за раз
			ОписаниеЗапроса.Формат.Вставить("ШаблонВременнаяТаблицаДокументов", "
																				|ПОМЕСТИТЬ ВременнаяТаблицаДокументы");
			ОписаниеЗапроса.Текст = СтрЗаменить(ОписаниеЗапроса.Текст, "СГРУППИРОВАТЬ ПО Объект.Ссылка", "
			|//{ШаблонОбъединить}
			|;
			|ВЫБРАТЬ
			|	ВременнаяТаблицаДокументы.ОбъектСсылка КАК ОбъектСсылка
			|ИЗ
			|	ВременнаяТаблицаДокументы КАК ВременнаяТаблицаДокументы
	        |
			|СГРУППИРОВАТЬ ПО
			|	ВременнаяТаблицаДокументы.ОбъектСсылка");
			
		КонецЕсли;

		ШаблонВыборки	= СтрЗаменить(ШаблонВыборки,	"{ШаблонВременнаяТаблицаДокументов}",	"");
		ШаблонВыборки	= СтрЗаменить(ШаблонВыборки,	"СГРУППИРОВАТЬ ПО Объект.Ссылка",		"");
		ШаблонВыборки	= СтрЗаменить(ШаблонВыборки,	"ВЫБРАТЬ РАЗРЕШЕННЫЕ",					"ВЫБРАТЬ ");
		ШаблонВыборки	= "
						|ОБЪЕДИНИТЬ ВСЕ
						|
						|" + ШаблонВыборки + "
						|//{ШаблонОбъединить}";
						
		ОписаниеЗапроса.Текст = СтрЗаменить(ОписаниеЗапроса.Текст, "//{ШаблонОбъединить}", ШаблонВыборки); 

	КонецЕсли;

	МодульФункцийДокуметов	= ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов;

	Если РежимПоискаДокумента = "Основание" Тогда

		// Поиск основания
		Если Не ЕстьТипОбъекта Тогда
			
			Если	ТекущийРазделИни.Свойство("Документ_Основание",	УзелИниПоиска)
				И	УзелИниПоиска.Свойство("Тип", ТипОбъектаПоиск) Тогда
				
				ДокументТип = СтрЗаменить(ТипОбъектаПоиск, ",", Символы.ПС);
				
				// Пока берется первый тип из списка. Если надо поиск по нескольким типам, доработать на пакетный запрос
				Для НомерСтрокиТип = 1 По СтрЧислоСтрок(ДокументТип) Цикл
					
					ЕстьТипОбъекта	= Истина;
					ТипОбъектаПоиск	= СтрПолучитьСтроку(ДокументТип, НомерСтрокиТип);
					Прервать;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если Не УзелИниПоиска.Свойство("Ини", ИмяИниДляПоиска) Тогда
				
				ИмяИниДляПоиска = ПараметрыЗаполнить.Вложение.ИмяИни;
				
			КонецЕсли;
				
			// Переопределить узел ини по типу основания
			ФайлИни = ИниПоПараметрам(ИмяИниДляПоиска);

			Если	Не	ФайлИни = Неопределено
				И 		ФайлИни.Свойство("мДокумент") Тогда
				
				ТипОбъектаПроверить = НРег(СтрПолучитьСтроку(СтрЗаменить(ТипОбъектаПоиск, ".", Символы.ПС), 2));
				Для Каждого мДокументИни Из ФайлИни.мДокумент Цикл
					
					ДокументТип = МодульФункцийДокуметов.РассчитатьЗначение("Документ", мДокументИни.Значение);
					ДокументТип = НРег(СтрПолучитьСтроку(СтрЗаменить(ДокументТип, ".", Символы.ПС), 2));
					Если Не НРег(ДокументТип) = НРег(ТипОбъектаПроверить) Тогда
						Продолжить;
					КонецЕсли;
					УзелИниПоиска = мДокументИни.Значение;
					Прервать;
					
				КонецЦикла;
					
			КонецЕсли;
			
		КонецЕсли;
	
	ИначеЕсли Не ЕстьТипОбъекта Тогда
		
		ТипОбъектаПоиск	= ВложениеСБИС_Получить(ПараметрыЗаполнить.Вложение, "ТипОбъекта", Новый Структура("Раздел_мДокумент, СоставПакета", ТекущийРазделИни, ПараметрыЗаполнить.СоставПакета));
		ЕстьТипОбъекта	= ЗначениеЗаполнено(ТипОбъектаПоиск);

	КонецЕсли;
	
	Если Не ЕстьТипОбъекта Тогда

		ВызватьСбисИсключение(760, "МодульОбъектаКлиент.НайтиПодходящиеДокументы_ЗаполнитьПараметрыФильтра",,, "Отсутствует описание типа документа для поиска.");
		
	КонецЕсли;

//	Если УзелИниПоиска = Неопределено Тогда
//		
//		ВызватьСбисИсключение(760, "МодульОбъектаКлиент.НайтиПодходящиеДокументы_ЗаполнитьПараметрыФильтра",,, "Отсутствует узел файла настроек для поиска.");
//		
//	КонецЕсли;

	//Тип объекта
	Если ЗначениеЗаполнено(ТипОбъектаПоиск) Тогда

		Если Найти(ТипОбъектаПоиск, ".") Тогда
			
			СсылочныйТип = СсылочныйТипСтрокой(ТипОбъектаПоиск);
			СсылочныйТип = СтрЗаменить(СсылочныйТип, ".", Символы.ПС);
			ТипОбъектаМетаданные	= СтрЗаменить(СтрПолучитьСтроку(СсылочныйТип, 1), "Ссылка", "");
			ТипОбъектаПоиск			= СтрПолучитьСтроку(СсылочныйТип, 2);
			
		Иначе
			
			ТипОбъектаМетаданные = "Документ";
			
		КонецЕсли;
		ОписаниеЗапроса.Формат.Вставить("ТипОбъект" + ПНВыборки, ТипОбъектаМетаданные + "." + ТипОбъектаПоиск);

	Иначе
		
		ВызватьСбисИсключение(760, "МодульОбъектаКлиент.НайтиПодходящиеДокументы_ЗаполнитьПараметрыФильтра",,, "Отсутствует описание типа объекта.");
		
	КонецЕсли;
	
КонецПроцедуры

// Функция - необязательные доп поля фильтра
//
// Параметры:
//  ВложениеСБИС	 - ВложениеСБИС	 - Структура вложения
//  ДопПараметры	 - Структура	 - расширение
//
// Возвращаемое значение:
//  Струкутра - поля фильтра
//
&НаКлиенте
Функция ВложениеСБИС_НайтиПодходящиеДокументы_ОсновныеПоляФильтра(ВложениеСБИС, ДопПараметры)
	Перем ЗначениеПараметраЗаполнить;
	
	ОписаниеЗапроса		 = Новый Структура("Параметры, Формат, Текст", Новый Структура, Новый Структура);
	ПараметрыФильтра	 = Новый Структура("ОписаниеЗапроса, Режим, УзелИни", ОписаниеЗапроса);
	
	СоставПакета = ДопПараметры.СоставПакета;
	
	СтатусВложения	= ВложениеСБИС_Получить(ВложениеСБИС, "Статус");
	Если	СтатусВложения = "Разобран"
		Или	СтатусВложения = "ИниУстановлена" Тогда
		
		ПараметрыПодборПолей	= Новый ФиксированнаяСтруктура("СоставПакета, Режим", СоставПакета, ПараметрыФильтра.Режим);
		Поля1С					= ВложениеСБИС_Получить(ВложениеСБИС, "Поля1С", ПараметрыПодборПолей);

	Иначе
		
		Поля1С = Новый Структура;
		
	КонецЕсли;
	
	ПараметрыФильтра.Вставить("Вложение",		ВложениеСБИС);
	ПараметрыФильтра.Вставить("СоставПакета",	СоставПакета);
	
	// Прокинуть режим получения для полей 1С
	Если Не ДопПараметры.Свойство("Режим", ПараметрыФильтра.Режим) Тогда
		
		ПараметрыФильтра.Режим = "Фильтр";
		
	КонецЕсли;

	Если	ДопПараметры.Свойство("Документ_Номер",	ЗначениеПараметраЗаполнить) Тогда
		
		ПараметрыФильтра.Вставить("Узел_Номер",	ЗначениеПараметраЗаполнить);
		
	КонецЕсли;
	
	Если	ДопПараметры.Свойство("Документ_НомерВх",		ЗначениеПараметраЗаполнить)  Тогда
		
		ПараметрыФильтра.Вставить("Узел_НомерДополнительный",	ЗначениеПараметраЗаполнить);
		
	КонецЕсли;
	
	Если	ДопПараметры.Свойство("Номер1С", ЗначениеПараметраЗаполнить) Тогда
		
		ПараметрыФильтра.Вставить("Номер1С",	ЗначениеПараметраЗаполнить);
		
	КонецЕсли;

	Если	ДопПараметры.Свойство("НомерДополнительный",	ЗначениеПараметраЗаполнить)
		Или	ВложениеСБИС.Свойство("НомерОснование",			ЗначениеПараметраЗаполнить)
		Или	ВложениеСБИС.Свойство("Номер",					ЗначениеПараметраЗаполнить)Тогда
		
		ПараметрыФильтра.Вставить("НомерДополнительный",	ЗначениеПараметраЗаполнить);
		
	КонецЕсли;

	Если	ДопПараметры.Свойство("Дата1С", ЗначениеПараметраЗаполнить) Тогда
		
		ПараметрыФильтра.Вставить("Дата1С",	ЗначениеПараметраЗаполнить);
		
	ИначеЕсли	Поля1С.Свойство	("Дата", ЗначениеПараметраЗаполнить)
			И	Не ЗначениеПараметраЗаполнить = Неопределено
			И	ЗначениеПараметраЗаполнить.Доступность Тогда
			
		ПараметрыФильтра.Вставить("Дата1С",	ЗначениеПараметраЗаполнить.Значение);
			
	КонецЕсли;
	
	Если	ДопПараметры.Свойство("ДатаВспомогательная",	ЗначениеПараметраЗаполнить)
		Или	ДопПараметры.Свойство("Документ_ДатаВх",		ЗначениеПараметраЗаполнить) Тогда
		
		ПараметрыФильтра.Вставить("ДатаВспомогательная",	ЗначениеПараметраЗаполнить);
		
	КонецЕсли;
	
	Если ДопПараметры.Свойство("ПоляПоиска") Тогда
		
		// Набор внешних настраиваемых полей
		ПараметрыФильтра.Вставить("ПоляПоиска",			ДопПараметры.ПоляПоиска);
		
	КонецЕсли;
	
	ПараметрыФильтра.Вставить("ЕстьПоискПоКонтрагенту", Не ПолучитьЗначениеПараметраСбис("СопоставлениеПоКонтрагенту") = "Не использовать");
	ПараметрыФильтра.Вставить("ЕстьПоискПоОрганизации", Не ПолучитьЗначениеПараметраСбис("СопоставлениеПоОрганизации") = "Не использовать");
	
	//Обработка контрагента
	Если ПараметрыФильтра.ЕстьПоискПоКонтрагенту Тогда
		
		Если		ДопПараметры.Свойство("Контрагент1С") Тогда
			
			ПараметрыФильтра.Вставить("Контрагент1С",	ДопПараметры.Контрагент1С);
			
		ИначеЕсли	ДопПараметры.Свойство("КонтрагентСБИС") Тогда
			
			ПараметрыФильтра.Вставить("КонтрагентСБИС",	ДопПараметры.КонтрагентСБИС);
			
		ИначеЕсли	Поля1С.Свойство	("Контрагент", ЗначениеПараметраЗаполнить)
			И	Не ЗначениеПараметраЗаполнить = Неопределено
			И	ЗначениеПараметраЗаполнить.Доступность Тогда
			
			ПараметрыФильтра.Вставить("Контрагент1С",	ЗначениеПараметраЗаполнить.Значение);
			
		Иначе
			
			ВызватьСбисИсключение(760, "МодульОбъектаКлиент.ВложениеСБИС_НайтиПодходящиеДокументы_ЗаполнитьДопПоляФильтра",,,
										"Отсутствуют данные для определения стороны Контрагент.");
		КонецЕсли;
		
	КонецЕсли;

	//Обработка организации
	Если ПараметрыФильтра.ЕстьПоискПоОрганизации Тогда

		Если		ДопПараметры.Свойство("Организация1С") Тогда
			
			ПараметрыФильтра.Вставить("Организация1С",		ДопПараметры.Организация1С);
			
		ИначеЕсли	ДопПараметры.Свойство("ОрганизацияСБИС") Тогда
			
			ПараметрыФильтра.Вставить("ОрганизацияСБИС",	ДопПараметры.ОрганизацияСБИС);
			
		ИначеЕсли	Поля1С.Свойство	("Организация", ЗначениеПараметраЗаполнить)
			И	Не ЗначениеПараметраЗаполнить = Неопределено
			И	ЗначениеПараметраЗаполнить.Доступность Тогда
			
			ПараметрыФильтра.Вставить("Организация1С",	ЗначениеПараметраЗаполнить.Значение);
			
		Иначе
			
			ВызватьСбисИсключение(760, "МодульОбъектаКлиент.ВложениеСБИС_НайтиПодходящиеДокументы_ЗаполнитьДопПоляФильтра",,,
										"Отсутствуют данные пакета для определения стороны Организация.");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПараметрыФильтра;
	
КонецФункции

&НаКлиенте
Функция ВложениеСБИС_НайтиПодходящиеДокументы_ПроверитьПоТипу(ВложениеСБИС, ДопПараметры)
	
	СписокДокументовПроверить = ВложениеСБИС.Документы1С.ВыгрузитьЗначения();
	
	Если ДопПараметры.Свойство("ПодходящийДокумент") Тогда
		
		//Добавить для выборки по типу, первым по списку
		СписокДокументовПроверить.Вставить(0, ДопПараметры.ПодходящийДокумент);
		
	КонецЕсли;
	
	// Для редактирующих вложений, в выборку поиска документа добавить по СоставПакета
	ПараметрыВложения	= ВложениеСБИС_Получить(ВложениеСБИС, "Параметры");
	Если ПараметрыВложения.ВозможноРедактироватьДокумент	
		Или	ПараметрыВложения.РедактироватьТабЧасть Тогда
		
		СоставПакета = ДопПараметры.СоставПакета;
		Если СоставПакета.Свойство("Документы1С") Тогда
			
			Для Каждого ЭлементСписка Из СоставПакета.ДОкументы1С Цикл
				
				СписокДокументовПроверить.Добавить(ЭлементСписка.Значение);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

	Если ЗначениеЗаполнено(СписокДокументовПроверить) Тогда
		
		ТребуемыйТип		= ВложениеСБИС_Получить(ВложениеСБИС, "ТипОбъекта", ДопПараметры);
		РезультатЗапроса	= ВыбратьДокументыПоТипамВызовСервера(СписокДокументовПроверить, ТребуемыйТип);
		СсылкиПоТипу		= РезультатЗапроса.Получить(ТребуемыйТип);
		Если		ЗначениеЗаполнено(СсылкиПоТипу)
			И	Не	(	ДопПараметры.Свойство("ВсеПодходящие")
					И	ДопПараметры.ВсеПодходящие) Тогда
			
			Возврат СсылкиПоТипу;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

// Процедура - Вложение СБИС найти подходящие документы установить фильтр по стороне
//
// Параметры:
//  ПараметрыВходящие	 - Структура	 - параметры установки
//
&НаКлиенте
Процедура НайтиПодходящиеДокументы_УстановитьФильтрПоСтороне(ПараметрыУстановить)
    Перем УзелИниСтороны, лРасчитанныйПараметр, ИмяРеквизитаСтороны, МассивСторон;
	
	УзелИниПоиска	= ПараметрыУстановить.УзелИни;
	КлючПоиска		= ПараметрыУстановить.Ключ;
	ПНВыборки		= ПараметрыУстановить.НомерВыборки;
	ОписаниеЗапроса	= ПараметрыУстановить.ОписаниеЗапроса;
	
	Если Не ОписаниеЗапроса.Параметры.Свойство(КлючПоиска + 1) Тогда
		
		// Стороны для запроса обрабатываются один раз.
		Если		ПараметрыУстановить.Свойство(КлючПоиска + "1С",	лРасчитанныйПараметр) Тогда
			
			// Указан контрагент в готовом виде
			
		ИначеЕсли	ПараметрыУстановить.Свойство(КлючПоиска + "СБИС",	лРасчитанныйПараметр) Тогда
			
			ПараметрыПоискаКарточки	= Новый Структура("УзелИниПоиска, ТипСтороны", УзелИниПоиска, КлючПоиска);
			МассивСторон			= Сторона_НайтиКарточки1С(лРасчитанныйПараметр, ПараметрыПоискаКарточки);

			Если Не ЗначениеЗаполнено(МассивСторон) Тогда
				
				ВызватьСбисИсключение(760, "МодульОбъектаКлиент.НайтиПодходящиеДокументы_УстановитьФильтрПоСтороне",,, "Не найдены данные стороны " + КлючПоиска + " в 1С.", Новый Структура("Сторона", лРасчитанныйПараметр));
				
			КонецЕсли;
				
		КонецЕсли;
		
		Если МассивСторон = Неопределено Тогда

			МассивСторон = Новый Массив;
			Если ЗначениеЗаполнено(лРасчитанныйПараметр) Тогда
				
				МассивСторон.Добавить(лРасчитанныйПараметр);
				
			КонецЕсли;
			
		КонецЕсли;

		ОписаниеЗапроса.Параметры.Вставить(КлючПоиска + 1, МассивСторон);
		
	КонецЕсли;
	
	//Проверить наличие в ини узла для определения поиска по контрагенту
	Если ИмяРеквизитаСтороны = Неопределено Тогда
		
		// Условие (реквизит) для поиска может отличаться
		КлючСтороны				= ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.РассчитатьЗначение(КлючПоиска + "_Роль", УзелИниПоиска);
		
		Если		КлючСтороны = Неопределено
			Или Не	УзелИниПоиска.мСторона.Свойство(КлючСтороны, УзелИниСтороны) Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ИмяРеквизитаСтороны	= СтроковоеЗначениеУзлаИни(УзелИниСтороны.Сторона, Новый Структура("ИмяРеквизита", Истина));
		
	КонецЕсли;

	ОписаниеЗапроса.Формат["УсловияЗапроса" + ПНВыборки]	=	ОписаниеЗапроса.Формат["УсловияЗапроса" + ПНВыборки]
															+ 	Символы.ПС
															+ " И Объект." + ИмяРеквизитаСтороны+" В (&" + КлючПоиска + "1)";
	
КонецПроцедуры

// Процедура - Вложение СБИС найти подходящие документы установить фильтр по стороне
//
// Параметры:
//  ПараметрыВходящие	 - Структура	 - параметры установки
//
&НаКлиенте
Процедура НайтиПодходящиеДокументы_УстановитьФильтрПоДатеНомеру(ПараметрыУстановить)
	Перем ЗначениеНомер;
		
	НайтиПодходящиеДокументы_УстановитьФильтрПоДате		(ПараметрыУстановить);
	НайтиПодходящиеДокументы_УстановитьФильтрПоДатеВх	(ПараметрыУстановить);
	НайтиПодходящиеДокументы_УстановитьФильтрПоНомеру	(ПараметрыУстановить);
	//
	//ПараметрыЗапросаИтого = ПараметрыУстановить.ОписаниеЗапроса.Параметры;
	//Если	НЕ ПараметрыЗапросаИтого.Свойство("Номер" + ПараметрыУстановить.НомерВыборки, ЗначениеНомер)
	//	Или	НЕ ЗначениеЗаполнено(ЗначениеНомер) Тогда   

	//	//  Если в СБИС не заполнены дата и номер, то нет смысла проводить поиск
	//	ВызватьСбисИсключение(760, "МодульОбъектаКлиент.НайтиПодходящиеДокументы1СПоПараметрам",,, "Не указаны номер или входящий номер для поиска документа.");
	//	
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НайтиПодходящиеДокументы_УстановитьФильтрПоДате(ПараметрыУстановить)
	Перем	ИмяРеквизитаРасчет, ИмяРеквизитаРасчетВспом, ПоляПоиска,
		ЗначениеДата, ЗначениеДатаВх, ЗначениеНомер, ЗначениеНомерВх;
		
	ОписаниеЗапроса	= ПараметрыУстановить.ОписаниеЗапроса;
	УзелИниПоиска	= ПараметрыУстановить.УзелИни;
	
	Если	ПараметрыУстановить.Свойство("Дата1С", ЗначениеДата) Тогда
		
		ЕстьДата = Истина;
		
	Иначе
		
		ПараметрыПодборПолей	= Новый ФиксированнаяСтруктура("СоставПакета, Режим", ПараметрыУстановить.СоставПакета, ПараметрыУстановить.Режим);
		Поля1С					= ВложениеСБИС_Получить(ПараметрыУстановить.Вложение, "Поля1С", ПараметрыПодборПолей);
		ЕстьДата	=	Поля1С.Свойство	("Дата", ЗначениеДата)
					И	Не ЗначениеДата = Неопределено
					И	ЗначениеДата.Доступность;
					
		Если ЕстьДата Тогда
			
			// Взять по-умолчанию путь от поля 1С, но может быть переопределено спец. узлом поиска.
			ИмяРеквизитаРасчет	= ЗначениеДата.Путь;
			ЗначениеДата		= ЗначениеДата.Значение;
			
		Иначе
			
			ЕстьДата = ПараметрыУстановить.Вложение.Свойство ("Дата", ЗначениеДата);
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если ЕстьДата Тогда
	
		//определить как искать дату
		Если	УзелИниПоиска.Свойство("Поиск_Дата") Тогда
			
			// Указан узел для поиска по дате
			ИмяРеквизитаРасчет = УзелИниПоиска.Поиск_Дата;

		ИначеЕсли ИмяРеквизитаРасчет = Неопределено Тогда
			
			Если Не УзелИниПоиска.Свойство("Документ_Дата", ИмяРеквизитаРасчет) Тогда
				
				ИмяРеквизитаРасчет = "Дата";
				
			КонецЕсли;
			
		КонецЕсли;
		ПараметрыСопоставлениеДатаДок = Новый ФиксированнаяСтруктура("Значение, Отклонение, Префикс", 
										ПолучитьЗначениеПараметраСбис("ПоискПоДате"),
										ПолучитьЗначениеПараметраСбис("ПоискПоДате_Отклонение"),
										"Док");
		
		НайтиПодходящиеДокументы_ФильтрСопоставлениеПоДате(ПараметрыУстановить, ЗначениеДата, ИмяРеквизитаРасчет, ПараметрыСопоставлениеДатаДок);
			
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура НайтиПодходящиеДокументы_УстановитьФильтрПоДатеВх(ПараметрыУстановить)
	Перем	ИмяРеквизитаРасчет, ИмяРеквизитаРасчетВспом, ПоляПоиска,
		ЗначениеДата, ЗначениеДатаВх, ЗначениеНомер, ЗначениеНомерВх;
		
	ОписаниеЗапроса	= ПараметрыУстановить.ОписаниеЗапроса;
	УзелИниПоиска	= ПараметрыУстановить.УзелИни;
	
	//Обработка Даты Прочие
	//Обработка Входящая, Дата
	ЕстьПоискПоДатеВХ			= Ложь;
	ПараметрыСопоставлениеДатаВх = Новый ФиксированнаяСтруктура("Значение, Отклонение, Префикс", 
									ПолучитьЗначениеПараметраСбис("ПоискВходящаяДата"),
									ПолучитьЗначениеПараметраСбис("ПоискВходящаяДата_Отклонение"),
									"Вх");
	Если	ПараметрыУстановить.Свойство("ПоляПоиска", ПоляПоиска) Тогда
		
		Если ПоляПоиска.Свойство("Дата1С", ПоляПоиска) Тогда
			
			Для Каждого КлючИЗначениеПараметр Из ПоляПоиска.Значение Цикл
				
				КлючНастройкиПоиск1 = "Поиск_Дата"		+ КлючИЗначениеПараметр.Ключ;
				КлючНастройкиПоиск2 = "Документ_Дата"	+ КлючИЗначениеПараметр.Ключ;
				Если	Не УзелИниПоиска.Свойство(КлючНастройкиПоиск1, ИмяРеквизитаРасчет)
					И	Не УзелИниПоиска.Свойство(КлючНастройкиПоиск2, ИмяРеквизитаРасчет) Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				ЕстьПоискПоДатеВХ = Истина;
				НайтиПодходящиеДокументы_ФильтрСопоставлениеПоДате(ПараметрыУстановить, КлючИЗначениеПараметр.Значение, ИмяРеквизитаРасчет, ПараметрыСопоставлениеДатаВх);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не	ЕстьПоискПоДатеВХ	
		И	ПараметрыУстановить.Свойство("ДатаВспомогательная",	ЗначениеДатаВх)
		И	ЗначениеЗаполнено(ЗначениеДатаВх)
		И	(	ПараметрыУстановить.Свойство("УзелДатаВспомогательная",	ИмяРеквизитаРасчет)
			Или	УзелИниПоиска.Свойство("Документ_ДатаВх",				ИмяРеквизитаРасчет)) Тогда
					
		НайтиПодходящиеДокументы_ФильтрСопоставлениеПоДате(ПараметрыУстановить, ЗначениеДатаВх, ИмяРеквизитаРасчет, ПараметрыСопоставлениеДатаВх);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиПодходящиеДокументы_ФильтрСопоставлениеПоДате(ПараметрыУстановить, ЗначениеДаты, УзелРеквизита, ПараметрыФильтра)
	
	ИмяРеквизитаРасчет	= СтроковоеЗначениеУзлаИни(УзелРеквизита, Новый Структура("ИмяРеквизита", Истина));
	СтрокаИмяПараметра	= ПараметрыФильтра.Префикс + "Дата";
	ПараметрДляЗапрос	= ЗначениеДаты;
	ОписаниеЗапроса		= ПараметрыУстановить.ОписаниеЗапроса;
	ПНВыборки			= ПараметрыУстановить.НомерВыборки;
	
	Если		ПараметрыФильтра.Значение = 1 Тогда

		УсловиеДобавить = " И Объект.{ИмяРеквизитаДатаВх} = &{СтрокаИмяПараметра}Нач" + ПНВыборки + "";
		
	ИначеЕсли	ПараметрыФильтра.Значение = 2 Тогда
		
		Поиск_Отклонение	= ПараметрыФильтра.Отклонение;			
		УсловиеДобавить		= " И Объект.{ИмяРеквизитаДатаВх} МЕЖДУ &{СтрокаИмяПараметра}Нач" + ПНВыборки + " И &{СтрокаИмяПараметра}Кнц" + ПНВыборки;
		Если		ТипЗнч(Поиск_Отклонение) = Тип("Число") Тогда
			
			СекундДобавить	= Поиск_Отклонение * 86400;
			ПараметрДатаНач = НачалоДня	(ЗначениеДаты - СекундДобавить);
			ПараметрДатаКнц	= КонецДня	(ЗначениеДаты + СекундДобавить);
			
		ИначеЕсли	Поиск_Отклонение = "Дата" Тогда
			
			ПараметрДатаНач = НачалоДня(ЗначениеДаты);
			ПараметрДатаКнц	= КонецДня(ЗначениеДаты);
			
		ИначеЕсли	Поиск_Отклонение = "Месяц" Тогда
			
			ПараметрДатаНач = НачалоМесяца(ЗначениеДаты);
			ПараметрДатаКнц	= КонецМесяца(ЗначениеДаты);
			
		ИначеЕсли	Поиск_Отклонение = "Квартал" Тогда

			ПараметрДатаНач = НачалоКвартала(ЗначениеДаты);
			ПараметрДатаКнц	= КонецКвартала(ЗначениеДаты);
			
		ИначеЕсли	Поиск_Отклонение = "Год" Тогда
			
			ПараметрДатаНач = НачалоГода(ЗначениеДаты);
			ПараметрДатаКнц	= КонецГода(ЗначениеДаты);
			
		Иначе
			
			Возврат;
			
		КонецЕсли;
		
		ОписаниеЗапроса.Параметры.Вставить(СтрокаИмяПараметра + "Нач" + ПНВыборки,	ПараметрДатаНач);
		ОписаниеЗапроса.Параметры.Вставить(СтрокаИмяПараметра + "Кнц" + ПНВыборки,	ПараметрДатаКнц);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыФормат = Новый ФиксированнаяСтруктура("ИмяРеквизитаДатаВх, СтрокаИмяПараметра",
						ИмяРеквизитаРасчет, СтрокаИмяПараметра);
	
	ОписаниеЗапроса.Параметры.Вставить(СтрокаИмяПараметра  + "Нач" + ПНВыборки, ПараметрДляЗапрос);
	ОписаниеЗапроса.Формат["УсловияЗапроса" + ПНВыборки]	=	ОписаниеЗапроса.Формат["УсловияЗапроса" + ПНВыборки]
															+ 	Символы.ПС
															+	ПрименитьФорматКСтроке(УсловиеДобавить, ПараметрыФормат);
		
КонецПроцедуры

&НаКлиенте
Процедура НайтиПодходящиеДокументы_СопоставлениеПоНомеру(ПараметрыУстановить, ЗначениеНомера, УзелРеквизитаРасчет, ЗначениеСопоставлениеПоНомеру = Неопределено)
	
	ОписаниеЗапроса		= ПараметрыУстановить.ОписаниеЗапроса;
	ПНВыборки			= ПараметрыУстановить.НомерВыборки;

	ИмяРеквизитаНомер	= СтроковоеЗначениеУзлаИни(УзелРеквизитаРасчет, Новый Структура("ИмяРеквизита", Истина));
	ВхождениеНомера		= ЗначениеСопоставлениеПоНомеру = "Вхождение";
	
	Если	ВхождениеНомера Тогда
		
		УсловиеДобавить = " И Объект.{ИмяРеквизитНомер} ПОДОБНО &Номер" + ПНВыборки;

	ИначеЕсли  ЗначениеСопоставлениеПоНомеру = "Точное совпадение" Тогда

		УсловиеДобавить = " И Объект.{ИмяРеквизитНомер} = &Номер" + ПНВыборки;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;

	Если ВхождениеНомера Тогда 
		
		ЗначениеПараметрНомера = "%" + ЗначениеНомера + "%";
		
	Иначе
		
		ЗначениеПараметрНомера = ЗначениеНомера;
		
	КонецЕсли;
	
	ОписаниеЗапроса.Параметры.Вставить("Номер" + ПНВыборки,	ЗначениеПараметрНомера);
	ОписаниеЗапроса.Формат["УсловияЗапроса" + ПНВыборки]	=	ОписаниеЗапроса.Формат["УсловияЗапроса" + ПНВыборки]
															+ 	Символы.ПС
															+	СтрЗаменить(УсловиеДобавить, "{ИмяРеквизитНомер}", ИмяРеквизитаНомер);
		
КонецПроцедуры

// Процедура - Вложение СБИС найти подходящие документы установить фильтр по стороне
//
// Параметры:
//  ПараметрыУстановить	 - Структура	 - параметры установки
//
&НаКлиенте
Процедура НайтиПодходящиеДокументы_УстановитьФильтрПоНомеру(ПараметрыУстановить)
	Перем	ИмяРеквизитаРасчет, ИмяРеквизитаРасчетВспом,
		ЗначениеНомер, ЗначениеНомерВх;
		
	Если НайтиПодходящиеДокументы_УстановленПоискНомераПоДопПолю(ПараметрыУстановить) Тогда
			
		Возврат;
		
	КонецЕсли;
	
	ОписаниеЗапроса					= ПараметрыУстановить.ОписаниеЗапроса;
	УзелИниПоиска					= ПараметрыУстановить.УзелИни;
	ЗначениеСопоставлениеПоНомеру	= ПолучитьЗначениеПараметраСбис("СопоставлениеПоНомеру");
								
	//Обработка Номер
	ЕстьУзелНомераВходящего  =		ПараметрыУстановить.Свойство("Документ_НомерВх",	ИмяРеквизитаРасчетВспом)
							 Или	УзелИниПоиска.Свойство("Документ_НомерВх",	ИмяРеквизитаРасчетВспом);
							
	ЕстьУзелНомера	 =		ПараметрыУстановить.Свойство("Документ_Номер",	ИмяРеквизитаРасчет)
					 Или	УзелИниПоиска.Свойство("Поиск_Номер",			ИмяРеквизитаРасчет)
					 Или	УзелИниПоиска.Свойство("Документ_Номер",		ИмяРеквизитаРасчет);
							
	ЕстьНомерВх	 =	ПараметрыУстановить.Свойство("НомерДополнительный",	ЗначениеНомерВх)
				 И	ЗначениеЗаполнено(ЗначениеНомерВх);
					
	ЕстьНомер1С	 =	ПараметрыУстановить.Свойство("Номер1С",	ЗначениеНомер)
				 И	ЗначениеЗаполнено(ЗначениеНомер);
				 
	Если	Не ЕстьНомер1С
		И	Не ЕстьНомерВх Тогда
		
		// Не искать документ, т.к. иначе уйдет в бесконечную рекурсию
		ПараметрыПодборПолей	= Новый ФиксированнаяСтруктура("СоставПакета, Режим", ПараметрыУстановить.СоставПакета, ПараметрыУстановить.Режим);
		Поля1С					= ВложениеСБИС_Получить(ПараметрыУстановить.Вложение, "Поля1С", ПараметрыПодборПолей);
		
		// Нет специально указанного основного или дополнительного номера. Взять его от поля разобранного документа.
		ЕстьНомер1С =	(	Поля1С.Свойство("Номер", 		ЗначениеНомер)
					И	Не ЗначениеНомер = Неопределено
					И	ЗначениеНомер.Доступность
					И	ЗначениеНомер.Свойство("Значение", ЗначениеНомер))
								И	ЗначениеЗаполнено(ЗначениеНомер);
						
	КонецЕсли;
							
	Если Не ЕстьУзелНомера Тогда
		
		ТипОбъекта = ПараметрыУстановить.ОписаниеЗапроса.Формат["ТипОбъект" + ПараметрыУстановить.НомерВыборки];
		Если Лев(ТипОбъекта, 8) = "Документ" Тогда
			
			ИмяРеквизитаРасчет = "Номер";
			
		Иначе
			
			ИмяРеквизитаРасчет = "Код";
			
		КонецЕсли;
		
	КонецЕсли;

	Если		ЕстьНомер1С Тогда
		
		//Поиск по указанному номеру 1С
		НайтиПодходящиеДокументы_СопоставлениеПоНомеру(ПараметрыУстановить, ЗначениеНомер, ИмяРеквизитаРасчет, ЗначениеСопоставлениеПоНомеру)
		
	ИначеЕсли	ЕстьНомерВх Тогда
		
		Если ЕстьУзелНомераВходящего Тогда
			
			НайтиПодходящиеДокументы_СопоставлениеПоНомеру(ПараметрыУстановить, ЗначениеНомерВх, ИмяРеквизитаРасчетВспом, ЗначениеСопоставлениеПоНомеру)
			
		Иначе

			НайтиПодходящиеДокументы_СопоставлениеПоНомеру(ПараметрыУстановить, ЗначениеНомерВх, ИмяРеквизитаРасчет, ЗначениеСопоставлениеПоНомеру)
			
		КонецЕсли;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;

КонецПроцедуры

// Функция - проверяет наличие доп поля для поиска подходящего документа по номеру
//
// Параметры:
//  ПараметрыУстановить - Структура	 - параметры фильтра
// 
// Возвращаемое значение:
//  Булево - Истина если есть поле и оно установлено в фильтр
//
&НаКлиенте
Функция НайтиПодходящиеДокументы_УстановленПоискНомераПоДопПолю(ПараметрыУстановить)
	Перем	ИмяРеквизитаРасчет, ПоляПоиска;
		
	УзелИниПоиска	= ПараметрыУстановить.УзелИни;
								
	ФильтрНомерУстановлен			= Ложь;
	ЗначениеСопоставлениеПоНомеру	= ПолучитьЗначениеПараметраСбис("СопоставлениеПоНомеру");
	Если	ПараметрыУстановить.Свойство("ПоляПоиска", ПоляПоиска) Тогда
		
		// Есть настроенное поле для номера
		Если ПоляПоиска.Свойство("Номер", ПоляПоиска) Тогда
			
			Для Каждого КлючИЗначениеПараметр Из ПоляПоиска.Значение Цикл
				
				КлючНастройкиПоиск1 = "Поиск_Номер"		+ КлючИЗначениеПараметр.Ключ;
				КлючНастройкиПоиск2 = "Документ_Номер"	+ КлючИЗначениеПараметр.Ключ;
				Если	Не УзелИниПоиска.Свойство(КлючНастройкиПоиск1, ИмяРеквизитаРасчет)
					И	Не УзелИниПоиска.Свойство(КлючНастройкиПоиск2, ИмяРеквизитаРасчет) Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				ФильтрНомерУстановлен = Истина;
				НайтиПодходящиеДокументы_СопоставлениеПоНомеру(ПараметрыУстановить, КлючИЗначениеПараметр.Значение, ИмяРеквизитаРасчет, ЗначениеСопоставлениеПоНомеру);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ФильтрНомерУстановлен;

КонецФункции

