
// Функция - Вложение СБИС найти подходящие документы параметры фильтра
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - Структура вложения
//  ДопПараметры - Структура	 - расширение
// 
// Возвращаемое значение:
//  Структура - параметры для поиска документа
//
&НаКлиенте
Функция ВложениеСБИС_НайтиПодходящиеДокументы_ПараметрыФильтра(ВложениеСБИС, ДопПараметры)
	Перем	УзелИниПоиска, ИмяИниДляПоиска, ТипОбъектаПоиск, РежимПоискаДокумента;
	
	Если Не ДопПараметры.Свойство("Режим", РежимПоискаДокумента) Тогда
		
		РежимПоискаДокумента = "Документ"
		
	КонецЕсли;

	ОписаниеЗапроса = Новый Структура("Текст, Параметры, Формат");
	ОписаниеЗапроса.Параметры	= Новый Структура;
	ОписаниеЗапроса.Формат		= Новый Структура("ТипОбъект, УсловияЗапроса", "", "");
	ОписаниеЗапроса.Текст = 
	
	"ВЫБРАТЬ Разрешенные
	|Объект.Ссылка КАК ОбъектСсылка
	|ИЗ
	| {ТипОбъект} КАК Объект
	|ГДЕ
	|	НЕ Объект.ПометкаУдаления{УсловияЗапроса}";

	МодульФункцийДокуметов	= ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов;
	ЕстьТипОбъекта			= ДопПараметры.Свойство("ТипДокумента",	ТипОбъектаПоиск);
	ТекущийРазделИни		= ВложениеСБИС_Получить(ВложениеСБИС, "УстановленныйПодразделИни");

	Если РежимПоискаДокумента = "Основание" Тогда

		// Поиск основания
		Если Не ЕстьТипОбъекта Тогда
			
			Если	(	ДопПараметры.Свойство("ТекущийУзелИни",			УзелИниПоиска)
					Или	ТекущийРазделИни.Свойство("Документ_Основание",	УзелИниПоиска))
				И	УзелИниПоиска.Свойство("Тип", ТипОбъектаПоиск) Тогда
				
				ДокументТип = СтрЗаменить(ТипОбъектаПоиск, ",", Символы.ПС);
				
				// Пока берется первый тип из списка. Если надо поиск по нескольким типам, доработать на пакетный запрос
				Для НомерСтрокиТип = 1 По СтрЧислоСтрок(ДокументТип) Цикл
					
					ЕстьТипОбъекта	= Истина;
					ТипОбъектаПоиск	= СтрПолучитьСтроку(ДокументТип, НомерСтрокиТип);
					Прервать;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если Не УзелИниПоиска.Свойство("Ини", ИмяИниДляПоиска) Тогда
				
				ИмяИниДляПоиска = ВложениеСБИС.ИмяИни;
				
			КонецЕсли;
				
			// Переопределить узел ини по типу основания
			ФайлИни = ИниПоПараметрам(ИмяИниДляПоиска);

			Если	Не	ФайлИни = Неопределено
				И 		ФайлИни.Свойство("мДокумент") Тогда
				
				ТипОбъектаПроверить = НРег(СтрПолучитьСтроку(СтрЗаменить(ТипОбъектаПоиск, ".", Символы.ПС), 2));
				Для Каждого мДокументИни Из ФайлИни.мДокумент Цикл
					
					ДокументТип = МодульФункцийДокуметов.РассчитатьЗначение("Документ", мДокументИни.Значение);
					ДокументТип = НРег(СтрПолучитьСтроку(СтрЗаменить(ДокументТип, ".", Символы.ПС), 2));
					Если Не НРег(ДокументТип) = НРег(ТипОбъектаПроверить) Тогда
						Продолжить;
					КонецЕсли;
					УзелИниПоиска = мДокументИни.Значение;
					Прервать;
					
				КонецЦикла;
					
			КонецЕсли;
			
		КонецЕсли;
	
	Иначе
		
		//Это не подбор основания. Раздел для поиска берется текущий
		УзелИниПоиска = ВложениеСБИС_Получить(ВложениеСБИС, "УстановленныйПодразделИни");
		Если Не ЕстьТипОбъекта Тогда
		
			ТипОбъектаПоиск	= ВложениеСБИС_Получить(ВложениеСБИС, "ТипОбъекта", ДопПараметры);
			ЕстьТипОбъекта	= ЗначениеЗаполнено(ТипОбъектаПоиск);
			
		КонецЕсли;

	КонецЕсли;
	
	Если Не ЕстьТипОбъекта Тогда

		ВызватьСбисИсключение(760, "МодульОбъектаКлиент.ВложениеСБИС_НайтиПодходящиеДокументы_ПараметрыФильтра",,, "Отсутствует описание типа документа для поиска.");
		
	КонецЕсли;

	Если УзелИниПоиска = Неопределено Тогда
		
		ВызватьСбисИсключение(760, "МодульОбъектаКлиент.ВложениеСБИС_НайтиПодходящиеДокументы_ПараметрыФильтра",,, "Отсутствует узел файла настроек для поиска.");
		
	КонецЕсли;

	//Тип объекта
	Если ЗначениеЗаполнено(ТипОбъектаПоиск) Тогда

		Если Найти(ТипОбъектаПоиск, ".") Тогда
			
			СсылочныйТип = СсылочныйТипСтрокой(ТипОбъектаПоиск);
			СсылочныйТип = СтрЗаменить(СсылочныйТип, ".", Символы.ПС);
			ТипОбъектаМетаданные	= СтрЗаменить(СтрПолучитьСтроку(СсылочныйТип, 1), "Ссылка", "");
			ТипОбъектаПоиск			= СтрПолучитьСтроку(СсылочныйТип, 2);
			
		Иначе
			
			ТипОбъектаМетаданные = "Документ";
			
		КонецЕсли;
		ОписаниеЗапроса.Формат.ТипОбъект = ТипОбъектаМетаданные + "." + ТипОбъектаПоиск;

	Иначе
		
		ВызватьСбисИсключение(760, "МодульОбъектаКлиент.ВложениеСБИС_НайтиПодходящиеДокументы_ПараметрыФильтра",,, "Отсутствует описание типа объекта.");
		
	КонецЕсли;
	
	ПараметрыФильтра = Новый Структура("УзелИни, ОписаниеЗапроса, Режим", УзелИниПоиска, ОписаниеЗапроса);
	
	ВложениеСБИС_НайтиПодходящиеДокументы_ЗаполнитьДопПоляФильтра(ВложениеСБИС, ПараметрыФильтра, ДопПараметры);
	
	Возврат ПараметрыФильтра;
	
КонецФункции

// Процедура - необязательные доп поля фильтра
//
// Параметры:
//  ВложениеСБИС	 - ВложениеСБИС	 - Структура вложения
//  ПараметрыФильтра - Структура	 - Результат ВложениеСБИС_НайтиПодходящиеДокументы_ПараметрыФильтра
//  ДопПараметры	 - Структура	 - расширение
//
&НаКлиенте
Процедура ВложениеСБИС_НайтиПодходящиеДокументы_ЗаполнитьДопПоляФильтра(ВложениеСБИС, ПараметрыФильтра, ДопПараметры)
	
	Если ДопПараметры.Свойство("СоставПакета") Тогда
		
		ПараметрыФильтра.Вставить("СоставПакета", ДопПараметры.СоставПакета);
		
	КонецЕсли;
	
	// Прокинуть режим получения для полей 1С
	Если Не ДопПараметры.Свойство("Режим", ПараметрыФильтра.Режим) Тогда
		
		ПараметрыФильтра.Режим = "Фильтр";
		
	КонецЕсли;

	//Обработка даты и номера
	Если ДопПараметры.Свойство("Дата1С") Тогда
		
		ПараметрыФильтра.Вставить("Дата1С",				ДопПараметры.Дата1С);
		
	КонецЕсли;
	
	Если ДопПараметры.Свойство("Номер1С") Тогда
		
		ПараметрыФильтра.Вставить("Номер1С",			ДопПараметры.Номер1С);
		
	КонецЕсли;
		
	Если ДопПараметры.Свойство("Документ_Номер") Тогда
		
		ПараметрыФильтра.Вставить("Документ_Номер",		ДопПараметры.Документ_Номер);
		
	КонецЕсли;

	Если ДопПараметры.Свойство("Документ_Дата") Тогда
		
		ПараметрыФильтра.Вставить("Документ_Дата",		ДопПараметры.Документ_Дата);
		
	КонецЕсли;
	
	Если ДопПараметры.Свойство("Документ_НомерВх") Тогда
		
		ПараметрыФильтра.Вставить("Документ_НомерВх",	ДопПараметры.Документ_НомерВх);
		
	КонецЕсли;
	
	Если ДопПараметры.Свойство("Документ_ДатаВх") Тогда
		
		ПараметрыФильтра.Вставить("Документ_ДатаВх",	ДопПараметры.Документ_ДатаВх);
		
	КонецЕсли;
	
	Если ДопПараметры.Свойство("ПоляПоиска") Тогда
		
		// Набор внешних настраиваемых полей
		ПараметрыФильтра.Вставить("ПоляПоиска",			ДопПараметры.ПоляПоиска);
		
	КонецЕсли;
	
	ПараметрыФильтра.Вставить("ЕстьПоискПоКонтрагенту", Не ПолучитьЗначениеПараметраСбис("СопоставлениеПоКонтрагенту") = "Не использовать");
	ПараметрыФильтра.Вставить("ЕстьПоискПоОрганизации", Не ПолучитьЗначениеПараметраСбис("СопоставлениеПоОрганизации") = "Не использовать");
	
	//Обработка контрагента
	Если ПараметрыФильтра.ЕстьПоискПоКонтрагенту Тогда
		
		ПараметрыФильтра.Вставить("Ключ", "Контрагент");
		
		Если		ДопПараметры.Свойство("Контрагент1С") Тогда
			
			ПараметрыФильтра.Вставить("Контрагент1С",	ДопПараметры.Контрагент1С);
			
		ИначеЕсли	ДопПараметры.Свойство("КонтрагентСБИС") Тогда
			
			ПараметрыФильтра.Вставить("КонтрагентСБИС",	ДопПараметры.КонтрагентСБИС);
			
		ИначеЕсли	ПараметрыФильтра.Свойство("СоставПакета") Тогда
			
			ПараметрыФильтра.Вставить("КонтрагентСБИС",	СоставПакета_Получить(ПараметрыФильтра.СоставПакета, "Контрагент"));
			
		Иначе
			
			ВызватьСбисИсключение(760, "МодульОбъектаКлиент.ВложениеСБИС_НайтиПодходящиеДокументы_ЗаполнитьДопПоляФильтра",,,
										"Отсутствуют данные пакета для определения стороны Контрагент.");
		КонецЕсли;
		
	КонецЕсли;

	//Обработка организации
	Если ПараметрыФильтра.ЕстьПоискПоОрганизации Тогда

		ПараметрыФильтра.Вставить("Ключ", "Организация");
	
		Если		ДопПараметры.Свойство("Организация1С") Тогда
			
			ПараметрыФильтра.Вставить("Организация1С",		ДопПараметры.Организация1С);
			
		ИначеЕсли	ДопПараметры.Свойство("ОрганизацияСБИС") Тогда
			
			ПараметрыФильтра.Вставить("ОрганизацияСБИС",	ДопПараметры.ОрганизацияСБИС);
			
		ИначеЕсли	ПараметрыФильтра.Свойство("СоставПакета") Тогда
			
			ПараметрыФильтра.Вставить("ОрганизацияСБИС",	СоставПакета_Получить(ПараметрыФильтра.СоставПакета, "НашаОрганизация"));
			
		Иначе
			
			ВызватьСбисИсключение(760, "МодульОбъектаКлиент.ВложениеСБИС_НайтиПодходящиеДокументы_ЗаполнитьДопПоляФильтра",,,
										"Отсутствуют данные пакета для определения стороны Организация.");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВложениеСБИС_НайтиПодходящиеДокументы_ПроверитьПоТипу(ВложениеСБИС, ДопПараметры)
	
	СписокДокументовПроверить = ВложениеСБИС.Документы1С.ВыгрузитьЗначения();
	
	Если ДопПараметры.Свойство("ПодходящийДокумент") Тогда
		
		//Добавить для выборки по типу, первым по списку
		СписокДокументовПроверить.Вставить(0, ДопПараметры.ПодходящийДокумент);
		
	КонецЕсли;
	
	// Для редактирующих вложений, в выборку поиска документа добавить по СоставПакета
	ПараметрыВложения	= ВложениеСБИС_Получить(ВложениеСБИС, "Параметры");
	Если ПараметрыВложения.ВозможноРедактироватьДокумент	
		Или	ПараметрыВложения.РедактироватьТабЧасть Тогда
		
		СоставПакета = ДопПараметры.СоставПакета;
		Если СоставПакета.Свойство("Документы1С") Тогда
			
			Для Каждого ЭлементСписка Из СоставПакета.ДОкументы1С Цикл
				
				СписокДокументовПроверить.Добавить(ЭлементСписка.Значение);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

	Если ЗначениеЗаполнено(СписокДокументовПроверить) Тогда
		
		ТребуемыйТип		= ВложениеСБИС_Получить(ВложениеСБИС, "ТипОбъекта", ДопПараметры);
		РезультатЗапроса	= ВыбратьДокументыПоТипамВызовСервера(СписокДокументовПроверить, ТребуемыйТип);
		СсылкиПоТипу		= РезультатЗапроса.Получить(ТребуемыйТип);
		Если		ЗначениеЗаполнено(СсылкиПоТипу)
			И	Не	(	ДопПараметры.Свойство("ВсеПодходящие")
					И	ДопПараметры.ВсеПодходящие) Тогда
			
			Возврат СсылкиПоТипу;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

// Процедура - Вложение СБИС найти подходящие документы установить фильтр по стороне
//
// Параметры:
//  ВложениеСБИС		 - Структура	 - экземпляр класса вложение СБИС
//  ПараметрыВходящие	 - Структура	 - параметры установки
//
&НаКлиенте
Процедура ВложениеСБИС_НайтиПодходящиеДокументы_УстановитьФильтрПоСтороне(ВложениеСБИС, ДопПараметры)
    Перем УзелИниСтороны, лРасчитанныйПараметр, ИмяРеквизитаКонтрагента;
	
	УзелИниПоиска			= ДопПараметры.УзелИни;
	КлючПоиска				= ДопПараметры.Ключ;

	Если    Не ДопПараметры.Свойство(КлючПоиска + "1С",	лРасчитанныйПараметр)
		И	Не ВложениеСБИС.Свойство(КлючПоиска + "1С",	лРасчитанныйПараметр) Тогда 
		// параметр Контрагент переехал в редактируемые поля на просмотр. В условии оставлено для совместимости, на всякий
		
		ПараметрыПодборПолей	= Новый ФиксированнаяСтруктура("СоставПакета, Режим", ДопПараметры.СоставПакета, ДопПараметры.Режим);
		Поля1С					= ВложениеСБИС_Получить(ВложениеСБИС, "Поля1С", ПараметрыПодборПолей);
		Если	Поля1С.Свойство(КлючПоиска, лРасчитанныйПараметр)
			И	ЗначениеЗаполнено(лРасчитанныйПараметр)
			И	лРасчитанныйПараметр.Доступность Тогда
				
			ИмяРеквизитаКонтрагента = лРасчитанныйПараметр.Путь;
			лРасчитанныйПараметр = лРасчитанныйПараметр.Значение;
			
		КонецЕсли;
			
	КонецЕсли;
	
	МассивСторон = Новый Массив;
	Если ЗначениеЗаполнено( лРасчитанныйПараметр) Тогда
		
		МассивСторон.Добавить(лРасчитанныйПараметр);
		
	КонецЕсли;
	
	//Проверить наличие в ини узла для определения поиска по контрагенту
	Если ИмяРеквизитаКонтрагента = Неопределено Тогда
		КлючСтороны				= ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.РассчитатьЗначение(КлючПоиска + "_Роль", УзелИниПоиска);
		
		Если		КлючСтороны = Неопределено
			Или Не	УзелИниПоиска.мСторона.Свойство(КлючСтороны, УзелИниСтороны) Тогда
			Возврат;
		КонецЕсли;
		ИмяРеквизитаКонтрагента	= СтроковоеЗначениеУзлаИни(УзелИниСтороны.Сторона, Новый Структура("ИмяРеквизита", Истина));
		Если    лРасчитанныйПараметр = Неопределено Тогда
			// Параметр все еще не определен, поискать запросом карточку 1С
			Если	ДопПараметры.Свойство(КлючПоиска + "СБИС", лРасчитанныйПараметр) Тогда
			
				ПараметрыПоискаКарточки	= Новый Структура("УзелИниПоиска, ТипСтороны", УзелИниПоиска, КлючПоиска);
				лРасчитанныйПараметр	= Сторона_НайтиКарточки1С(лРасчитанныйПараметр, ПараметрыПоискаКарточки);

				Если Не ЗначениеЗаполнено(лРасчитанныйПараметр) Тогда
					
					ВызватьСбисИсключение(760, "МодульОбъектаКлиент.ВложениеСБИС_НайтиПодходящиеДокументы_УстановитьФильтрПоСтороне",,, "Не найдены данные стороны " + КлючПоиска + " в 1С.", Новый Структура("Сторона", лРасчитанныйПараметр));
					
				КонецЕсли;
			
				МассивСторон = лРасчитанныйПараметр;
				
			Иначе
				
				ВызватьСбисИсключение(760, "МодульОбъектаКлиент.ВложениеСБИС_НайтиПодходящиеДокументы_УстановитьФильтрПоСтороне",,, "Отсутствуют данные стороны " + КлючПоиска + " для определения стороны 1С.");
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	ДопПараметры.ОписаниеЗапроса.Формат.УсловияЗапроса = ДопПараметры.ОписаниеЗапроса.Формат.УсловияЗапроса + Символы.ПС + " И Объект." + ИмяРеквизитаКонтрагента+" В (&" + КлючПоиска + ")";
	ДопПараметры.ОписаниеЗапроса.Параметры.Вставить(КлючПоиска, МассивСторон);
	
КонецПроцедуры

// Процедура - Вложение СБИС найти подходящие документы установить фильтр по стороне
//
// Параметры:
//  ВложениеСБИС		 - Структура	 - экземпляр класса вложение СБИС
//  ПараметрыВходящие	 - Структура	 - параметры установки
//
&НаКлиенте
Процедура ВложениеСБИС_НайтиПодходящиеДокументы_УстановитьФильтрПоДатеНомеру(ВложениеСБИС, ДопПараметры)
	Перем	ИмяРеквизитаРасчет, ИмяРеквизитаРасчетВспом,
		ЗначениеДата, ЗначениеДатаВх, ЗначениеНомер, ЗначениеНомерВх;
		
	ВложениеСБИС_НайтиПодходящиеДокументы_УстановитьФильтрПоДате	(ВложениеСБИС,	ДопПараметры);
	ВложениеСБИС_НайтиПодходящиеДокументы_УстановитьФильтрПоДатеВх	(ВложениеСБИС,	ДопПараметры);
	ВложениеСБИС_НайтиПодходящиеДокументы_УстановитьФильтрПоНомеру	(ВложениеСБИС,	ДопПараметры);
	
	ПараметрыЗапросаИтого = ДопПараметры.ОписаниеЗапроса.Параметры;
	Если НЕ ПараметрыЗапросаИтого.Свойство("Номер") Или НЕ ЗначениеЗаполнено(ПараметрыЗапросаИтого.Номер) Тогда   

		//  Если в СБИС не заполнены дата и номер, то нет смысла проводить поиск
		ВызватьСбисИсключение(760, "МодульОбъектаКлиент.НайтиПодходящиеДокументы1СПоПараметрам",,, "Не указаны номер или входящий номер для поиска документа.");
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_НайтиПодходящиеДокументы_УстановитьФильтрПоДате(ВложениеСБИС, ДопПараметры)
	Перем	ИмяРеквизитаРасчет, ИмяРеквизитаРасчетВспом, ПоляПоиска,
		ЗначениеДата, ЗначениеДатаВх, ЗначениеНомер, ЗначениеНомерВх;
		
	ОписаниеЗапроса	= ДопПараметры.ОписаниеЗапроса;
	УзелИниПоиска	= ДопПараметры.УзелИни;
	
	Если	ДопПараметры.Свойство("Дата1С", ЗначениеДата) Тогда
		
		ЕстьДата = Истина;
		
	Иначе
		
		ПараметрыПодборПолей	= Новый ФиксированнаяСтруктура("СоставПакета, Режим", ДопПараметры.СоставПакета, ДопПараметры.Режим);
		Поля1С					= ВложениеСБИС_Получить(ВложениеСБИС, "Поля1С", ПараметрыПодборПолей);
		ЕстьДата	=	Поля1С.Свойство	("Дата", ЗначениеДата)
					И	Не ЗначениеДата = Неопределено
					И	ЗначениеДата.Доступность;
					
		Если ЕстьДата Тогда
			
			// Взять по-умолчанию путь от поля 1С, но может быть переопределено спец. узлом поиска.
			ИмяРеквизитаРасчет	= ЗначениеДата.Путь;
			ЗначениеДата		= ЗначениеДата.Значение;
			
		Иначе
			
			ЕстьДата = ВложениеСБИС.Свойство ("Дата", ЗначениеДата);
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если ЕстьДата Тогда
	
		//определить как искать дату
		Если	УзелИниПоиска.Свойство("Поиск_Дата") Тогда
			
			// Указан узел для поиска по дате
			ИмяРеквизитаРасчет = УзелИниПоиска.Поиск_Дата;

		ИначеЕсли ИмяРеквизитаРасчет = Неопределено Тогда
			
			Если Не УзелИниПоиска.Свойство("Документ_Дата", ИмяРеквизитаРасчет) Тогда
				
				ИмяРеквизитаРасчет = "Дата";
				
			КонецЕсли;
			
		КонецЕсли;
		ПараметрыСопоставлениеДатаДок = Новый ФиксированнаяСтруктура("Значение, Отклонение, Префикс", 
										ПолучитьЗначениеПараметраСбис("ПоискПоДате"),
										ПолучитьЗначениеПараметраСбис("ПоискПоДате_Отклонение"),
										"Док");
		
		ВложениеСБИС_НайтиПодходящиеДокументы_ФильтрСопоставлениеПоДате(ОписаниеЗапроса, ЗначениеДата, ИмяРеквизитаРасчет, ПараметрыСопоставлениеДатаДок);
			
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_НайтиПодходящиеДокументы_УстановитьФильтрПоДатеВх(ВложениеСБИС, ДопПараметры)
	Перем	ИмяРеквизитаРасчет, ИмяРеквизитаРасчетВспом, ПоляПоиска,
		ЗначениеДата, ЗначениеДатаВх, ЗначениеНомер, ЗначениеНомерВх;
		
	ОписаниеЗапроса	= ДопПараметры.ОписаниеЗапроса;
	УзелИниПоиска	= ДопПараметры.УзелИни;
	
	//Обработка Даты Прочие
	//Обработка Входящая, Дата
	ЕстьПоискПоДатеВХ			= Ложь;
	ПараметрыСопоставлениеДатаВх = Новый ФиксированнаяСтруктура("Значение, Отклонение, Префикс", 
									ПолучитьЗначениеПараметраСбис("ПоискВходящаяДата"),
									ПолучитьЗначениеПараметраСбис("ПоискВходящаяДата_Отклонение"),
									"Вх");
	Если	ДопПараметры.Свойство("ПоляПоиска", ПоляПоиска) Тогда
		
		Если ПоляПоиска.Свойство("Дата", ПоляПоиска) Тогда
			
			Для Каждого КлючИЗначениеПараметр Из ПоляПоиска.Значение Цикл
				
				КлючНастройкиПоиск1 = "Поиск_Дата"		+ КлючИЗначениеПараметр.Ключ;
				КлючНастройкиПоиск2 = "Документ_Дата"	+ КлючИЗначениеПараметр.Ключ;
				Если	Не УзелИниПоиска.Свойство(КлючНастройкиПоиск1, ИмяРеквизитаРасчет)
					И	Не УзелИниПоиска.Свойство(КлючНастройкиПоиск2, ИмяРеквизитаРасчет) Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				ЕстьПоискПоДатеВХ = Истина;
				ВложениеСБИС_НайтиПодходящиеДокументы_ФильтрСопоставлениеПоДате(ОписаниеЗапроса, КлючИЗначениеПараметр.Значение, ИмяРеквизитаРасчет, ПараметрыСопоставлениеДатаВх);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не	ЕстьПоискПоДатеВХ	
		И	(	ДопПараметры.Свойство("ДатаСБИС",	ЗначениеДатаВх)
			Или	ВложениеСБИС.Свойство("Дата",		ЗначениеДатаВх))
		И	ЗначениеЗаполнено(ЗначениеДатаВх)
		И	(	ДопПараметры.Свойство("Документ_ДатаВх",	ИмяРеквизитаРасчет)
			Или	УзелИниПоиска.Свойство("Документ_ДатаВх",	ИмяРеквизитаРасчет)) Тогда
					
		ВложениеСБИС_НайтиПодходящиеДокументы_ФильтрСопоставлениеПоДате(ОписаниеЗапроса, ЗначениеДатаВх, ИмяРеквизитаРасчет, ПараметрыСопоставлениеДатаВх);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_НайтиПодходящиеДокументы_ФильтрСопоставлениеПоДате(ОписаниеЗапроса, ЗначениеДаты, УзелРеквизита, ПараметрыФильтра)
	
	ИмяРеквизитаРасчет	= СтроковоеЗначениеУзлаИни(УзелРеквизита, Новый Структура("ИмяРеквизита", Истина));
	СтрокаИмяПараметра	= ПараметрыФильтра.Префикс + "Дата";
	ПараметрДляЗапрос	= ЗначениеДаты;
	
	Если		ПараметрыФильтра.Значение = 1 Тогда

		УсловиеДобавить = " И Объект.{ИмяРеквизитаДатаВх} = &{СтрокаИмяПараметра}Нач";
		
	ИначеЕсли	ПараметрыФильтра.Значение = 2 Тогда
		
		Поиск_Отклонение	= ПараметрыФильтра.Отклонение;			
		УсловиеДобавить		= " И Объект.{ИмяРеквизитаДатаВх} МЕЖДУ &{СтрокаИмяПараметра}Нач И &{СтрокаИмяПараметра}Кнц";
		Если		ТипЗнч(Поиск_Отклонение) = Тип("Число") Тогда
			
			СекундДобавить	= Поиск_Отклонение * 86400;
			ПараметрДатаНач = НачалоДня	(ЗначениеДаты - СекундДобавить);
			ПараметрДатаКнц	= КонецДня	(ЗначениеДаты + СекундДобавить);
			
		ИначеЕсли	Поиск_Отклонение = "Дата" Тогда
			
			ПараметрДатаНач = НачалоДня(ЗначениеДаты);
			ПараметрДатаКнц	= КонецДня(ЗначениеДаты);
			
		ИначеЕсли	Поиск_Отклонение = "Месяц" Тогда
			
			ПараметрДатаНач = НачалоМесяца(ЗначениеДаты);
			ПараметрДатаКнц	= КонецМесяца(ЗначениеДаты);
			
		ИначеЕсли	Поиск_Отклонение = "Квартал" Тогда

			ПараметрДатаНач = НачалоКвартала(ЗначениеДаты);
			ПараметрДатаКнц	= КонецКвартала(ЗначениеДаты);
			
		ИначеЕсли	Поиск_Отклонение = "Год" Тогда
			
			ПараметрДатаНач = НачалоГода(ЗначениеДаты);
			ПараметрДатаКнц	= КонецГода(ЗначениеДаты);
			
		Иначе
			
			Возврат;
			
		КонецЕсли;
		
		ОписаниеЗапроса.Параметры.Вставить(СтрокаИмяПараметра + "Нач",	ПараметрДатаНач);
		ОписаниеЗапроса.Параметры.Вставить(СтрокаИмяПараметра + "Кнц",	ПараметрДатаКнц);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыФормат = Новый ФиксированнаяСтруктура("ИмяРеквизитаДатаВх, СтрокаИмяПараметра", ИмяРеквизитаРасчет, СтрокаИмяПараметра);
	
	ОписаниеЗапроса.Параметры.Вставить(СтрокаИмяПараметра + "Нач", ПараметрДляЗапрос);
	ОписаниеЗапроса.Формат.УсловияЗапроса	=	ОписаниеЗапроса.Формат.УсловияЗапроса
											+ 	Символы.ПС
											+	ПрименитьФорматКСтроке(УсловиеДобавить, ПараметрыФормат);
		
КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_НайтиПодходящиеДокументы_СопоставлениеПоНомеру(ОписаниеЗапроса, ЗначениеНомера, УзелРеквизитаРасчет, ЗначениеСопоставлениеПоНомеру = Неопределено)
	
	ИмяРеквизитаНомер	= СтроковоеЗначениеУзлаИни(УзелРеквизитаРасчет, Новый Структура("ИмяРеквизита", Истина));
	ВхождениеНомера		= ЗначениеСопоставлениеПоНомеру = "Вхождение";
	
	Если	ВхождениеНомера Тогда
		
		УсловиеДобавить = " И Объект.{ИмяРеквизитНомер} ПОДОБНО &Номер";

	ИначеЕсли  ЗначениеСопоставлениеПоНомеру = "Точное совпадение" Тогда

		УсловиеДобавить = " И Объект.{ИмяРеквизитНомер} = &Номер";
		
	Иначе
		
		Возврат;
		
	КонецЕсли;

	Если ВхождениеНомера Тогда 
		
		ЗначениеПараметрНомера = "%" + ЗначениеНомера + "%";
		
	Иначе
		
		ЗначениеПараметрНомера = ЗначениеНомера;
		
	КонецЕсли;
	
	ОписаниеЗапроса.Параметры.Вставить("Номер",	ЗначениеПараметрНомера);
	ОписаниеЗапроса.Формат.УсловияЗапроса = ОписаниеЗапроса.Формат.УсловияЗапроса + Символы.ПС + 
											СтрЗаменить(УсловиеДобавить, "{ИмяРеквизитНомер}", ИмяРеквизитаНомер);
		
КонецПроцедуры

// Процедура - Вложение СБИС найти подходящие документы установить фильтр по стороне
//
// Параметры:
//  ВложениеСБИС		 - Структура	 - экземпляр класса вложение СБИС
//  ПараметрыВходящие	 - Структура	 - параметры установки
//
&НаКлиенте
Процедура ВложениеСБИС_НайтиПодходящиеДокументы_УстановитьФильтрПоНомеру(ВложениеСБИС, ДопПараметры)
	Перем	ИмяРеквизитаРасчет, ИмяРеквизитаРасчетВспом, ПоляПоиска,
		ЗначениеНомер, ЗначениеНомерВх;
		
	Если ВложениеСБИС_НайтиПодходящиеДокументы_УстановленПоискНомераПоДопПолю(ВложениеСБИС, ДопПараметры) Тогда
			
		Возврат;
		
	КонецЕсли;
	
	ОписаниеЗапроса					= ДопПараметры.ОписаниеЗапроса;
	УзелИниПоиска					= ДопПараметры.УзелИни;
	ЗначениеСопоставлениеПоНомеру	= ПолучитьЗначениеПараметраСбис("СопоставлениеПоНомеру");
								
	// Не искать документ, т.к. иначе уйдет в бесконечную рекурсию
	ПараметрыПодборПолей	= Новый ФиксированнаяСтруктура("СоставПакета, Режим", ДопПараметры.СоставПакета, ДопПараметры.Режим);
	Поля1С					= ВложениеСБИС_Получить(ВложениеСБИС, "Поля1С", ПараметрыПодборПолей);
	//Обработка Номер
	ЕстьУзелНомераВходящего =	ДопПараметры.Свойство("Документ_НомерВх",	ИмяРеквизитаРасчетВспом)
							Или	УзелИниПоиска.Свойство("Документ_НомерВх",	ИмяРеквизитаРасчетВспом);
	ЕстьУзелНомера			=	ДопПараметры.Свойство("Документ_Номер",		ИмяРеквизитаРасчет)
							Или	УзелИниПоиска.Свойство("Поиск_Номер",		ИмяРеквизитаРасчет)
							Или	УзелИниПоиска.Свойство("Документ_Номер",	ИмяРеквизитаРасчет);
	ЕстьНомерВх				=	(	ДопПараметры.Свойство("НомерСБИС",		ЗначениеНомерВх)
								Или	ВложениеСБИС.Свойство("НомерОснование",	ЗначениеНомерВх)
								Или	ВложениеСБИС.Свойство("Номер",			ЗначениеНомерВх))
							И ЗначениеЗаполнено(ЗначениеНомерВх);
	ЕстьНомер1С				=	(	ДопПараметры.Свойство("Номер1С",	ЗначениеНомер)
								Или	(	Поля1С.Свойство("Номер", 		ЗначениеНомер)
									И	Не ЗначениеНомер = Неопределено
									И	ЗначениеНомер.Доступность
									И	ЗначениеНомер.Свойство("Значение", ЗначениеНомер))
								И	ЗначениеЗаполнено(ЗначениеНомер));
	Если		ЕстьНомер1С Тогда
		
		//Поиск по указанному номеру 1С
		ВложениеСБИС_НайтиПодходящиеДокументы_СопоставлениеПоНомеру(ОписаниеЗапроса, ЗначениеНомер, ИмяРеквизитаРасчет, ЗначениеСопоставлениеПоНомеру)
		
	ИначеЕсли 	ЕстьНомерВх  Тогда
		
		Если		ЕстьУзелНомераВходящего Тогда
			
			ВложениеСБИС_НайтиПодходящиеДокументы_СопоставлениеПоНомеру(ОписаниеЗапроса, ЗначениеНомерВх, ИмяРеквизитаРасчетВспом, ЗначениеСопоставлениеПоНомеру)
			
		ИначеЕсли	ЕстьУзелНомера Тогда
			
			ВложениеСБИС_НайтиПодходящиеДокументы_СопоставлениеПоНомеру(ОписаниеЗапроса, ЗначениеНомерВх, ИмяРеквизитаРасчет, ЗначениеСопоставлениеПоНомеру)
			
		Иначе
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;

КонецПроцедуры

// Функция - проверяет наличие доп поля для поиска подходящего документа по номеру
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - структура вложения
//  ДопПараметры - Структура	 - параметры фильтра
// 
// Возвращаемое значение:
//  Булево - Истина если есть поле и оно установлено в фильтр
//
&НаКлиенте
Функция ВложениеСБИС_НайтиПодходящиеДокументы_УстановленПоискНомераПоДопПолю(ВложениеСБИС, ДопПараметры)
	Перем	ИмяРеквизитаРасчет, ПоляПоиска;
		
	ОписаниеЗапроса	= ДопПараметры.ОписаниеЗапроса;
	УзелИниПоиска	= ДопПараметры.УзелИни;
								
	ФильтрНомерУстановлен			= Ложь;
	ЗначениеСопоставлениеПоНомеру	= ПолучитьЗначениеПараметраСбис("СопоставлениеПоНомеру");
	Если	ДопПараметры.Свойство("ПоляПоиска", ПоляПоиска) Тогда
		
		// Есть настроенное поле для номера
		Если ПоляПоиска.Свойство("Номер", ПоляПоиска) Тогда
			
			Для Каждого КлючИЗначениеПараметр Из ПоляПоиска.Значение Цикл
				
				КлючНастройкиПоиск1 = "Поиск_Номер"		+ КлючИЗначениеПараметр.Ключ;
				КлючНастройкиПоиск2 = "Документ_Номер"	+ КлючИЗначениеПараметр.Ключ;
				Если	Не УзелИниПоиска.Свойство(КлючНастройкиПоиск1, ИмяРеквизитаРасчет)
					И	Не УзелИниПоиска.Свойство(КлючНастройкиПоиск2, ИмяРеквизитаРасчет) Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				ФильтрНомерУстановлен = Истина;
				ВложениеСБИС_НайтиПодходящиеДокументы_СопоставлениеПоНомеру(ОписаниеЗапроса, КлючИЗначениеПараметр.Значение, ИмяРеквизитаРасчет, ЗначениеСопоставлениеПоНомеру);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ФильтрНомерУстановлен;

КонецФункции

