
&НаКлиенте
Процедура ВложениеСБИС_Обновить_Поля1С(ВложениеСБИС, Изменения, ДопПараметры)
	Перем ТекущиеИзменения;

	ПоляТекущие			= ВложениеСБИС_Получить(ВложениеСБИС, "Поля1С");
	ПараметрыВложения	= ВложениеСБИС_Получить(ВложениеСБИС, "Параметры");
	Если		Изменения.Поля1С.Свойство("Документ")
		И	Не	Изменения.Поля1С.Документ = ПоляТекущие.Документ.Значение
		И		ВложениеСБИС.Параметры.ВозможноРедактироватьДокумент Тогда
		
		СопоставленныеДокументыВложения					= ВложениеСБИС_Получить(ВложениеСБИС, "Документы1С");
		ВложениеСБИС.Параметры.РедактироватьДокумент	=	ВложениеСБИС.Параметры.ВозможноРедактироватьДокумент
														И	ЗначениеЗаполнено(Изменения.Поля1С.Документ)
														И 	СопоставленныеДокументыВложения.НайтиПоЗначению(Изменения.Поля1С.Документ) = Неопределено;
			
		// При измении документа 1С в режиме редактирования, обновим все поля. Для обычного документа - не трогаем, т.к. поля тянутся не от документа 1С
		ВложениеСБИС.Параметры.Удалить("РассчитанныйОбъект");
		ВложениеСБИС.Параметры.Удалить("РедактируемыеПоля");
		
		ВложениеСБИС_Обновить(ВложениеСБИС, "ИниУстановлена", "Статус");
		
		ДопПараметрыПолей = Новый Структура("СоставПакета, ПодходящийДокумент", ДопПараметры.СоставПакета, Изменения.Поля1С.Документ);
		ВложениеСБИС.Параметры.Вставить("РедактируемыеПоля", ВложениеСБИС_Получить(ВложениеСБИС, "Поля1С", ДопПараметрыПолей));
		
		ВложениеСБИС_Обновить(ВложениеСБИС, "Разобран", "Статус");
		
	КонецЕсли;
	
	Если		Изменения.Поля1С.Свойство("Контрагент", ТекущиеИзменения)
		И	Не	ТекущиеИзменения = ПоляТекущие.Документ.Значение Тогда
		
		// Скинуть сопоставление номенклатуры при измении контрагента вложения, чтобы обновилось
		ПараметрыНоменклатуры = ВложениеСБИС_Получить(ВложениеСБИС, "ПараметрыНоменклатуры");
		ПараметрыНоменклатуры.Сопоставлено = Ложь;   
		ПараметрыПросмотр = ВложениеСБИС_Получить(ВложениеСБИС, "Просмотр", "ФормаПросмотрДокумента");
		
		Если ВложениеСБИС.Параметры.Просмотр Тогда
			
			ПараметрыПросмотр.ПараметрыКонтрагент.ПоказатьСозданиеКарточки = Не	ЗначениеЗаполнено(ТекущиеИзменения);
			
		КонецЕсли;

	КонецЕсли;	
		
	Для Каждого КлючИЗначениеПоля Из Изменения.Поля1С Цикл
		
		ВложениеСБИС.Параметры.РедактируемыеПоля[КлючИЗначениеПоля.Ключ].Значение = КлючИЗначениеПоля.Значение;
		
	КонецЦикла;
			
КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_Обновить_Номенклатура(ВложениеСБИС, Изменения)

	СтруктураФайла = ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");

	Если Не ЗначениеЗаполнено(СтруктураФайла)Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФормыПоФормату = "Файл_" + СтруктураФайла.Файл.Формат + "_" + СтруктураФайла.Файл.ВерсияФормата;
	ИмяФормыПоФормату = ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.сбисЗаменитьНедопустимыеСимволы(ИмяФормыПоФормату);
	
	МассивФормФайл = Новый Массив;
	МассивФормФайл.Добавить("Файл_Шаблон");
	МассивФормФайл.Добавить(ИмяФормыПоФормату);
	
	ФормаФайл = НайтиФункциюСеансаОбработки("ОбновитьНоменклатуруВложения", МассивФормФайл);
	
	Контекст = Новый Структура("ФайлДанные, Изменения", СтруктураФайла, Изменения);
	
	Если ФормаФайл <> Ложь Тогда
		ФормаФайл.ОбновитьНоменклатуруВложения(ПолучитьТекущийЛокальныйКэш(), Контекст);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_Обновить_ПараметрыДокумента(ВложениеСБИС, Изменения)

	СтруктураФайла = ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");

	Если Не ЗначениеЗаполнено(СтруктураФайла)Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФормыПоФормату = "Файл_" + СтруктураФайла.Файл.Формат + "_" + СтруктураФайла.Файл.ВерсияФормата;
	ИмяФормыПоФормату = ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.сбисЗаменитьНедопустимыеСимволы(ИмяФормыПоФормату);
	
	МассивФормФайл = Новый Массив;
	МассивФормФайл.Добавить("Файл_Шаблон");
	МассивФормФайл.Добавить(ИмяФормыПоФормату);
	
	ФормаФайл = НайтиФункциюСеансаОбработки("ОбновитьПараметрыВложения", МассивФормФайл);
	
	Контекст = Новый Структура("ФайлДанные, Изменения", СтруктураФайла, Изменения);
	
	Если ФормаФайл <> Ложь Тогда
		ФормаФайл.ОбновитьПараметрыВложения(ПолучитьТекущийЛокальныйКэш(), Контекст);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_Обновить_Сторона(ВложениеСБИС, Изменения)
	Перем ВходящийКонтекст, РучныеПравки;    
	
	СтруктураФайла = ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");

	Если Не ЗначениеЗаполнено(СтруктураФайла)Тогда
		Возврат;
	КонецЕсли;

	Если Изменения.Свойство("Организация") Тогда 
		
		ИмяСтороны = "Организация";
		ИзменяемыйРеквизит = "Организация";
		ИмяДанныеСтороны = "ДанныеОрганизации";
		
	ИначеЕсли Изменения.Свойство("Контрагент")
		И ПолучитьЗначениеПараметраСбис("ЗаполнениеКонтрагента1С") = "ПокупательСБИС" Тогда
		
		ИмяСтороны = "Контрагент";
		ИзменяемыйРеквизит = "Контрагент";
		ИмяДанныеСтороны = "ДанныеКонтрагента";
		
	ИначеЕсли Изменения.Свойство("Грузополучатель") Тогда
		
		ИмяДанныеСтороны	= "ДанныеГрузополучателя";
		ИмяСтороны			= "Грузополучатель";
		ТипГрузополучателя	= ПолучитьЗначениеПараметраСбис("ТипГрузополучателя");
		Если	ТипГрузополучателя = "ГрузополучательКонтрагент"	
			Или	ПолучитьЗначениеПараметраСбис("ЗаполнениеКонтрагента1С") = "ГрузополучательСБИС" Тогда 
		
			ИзменяемыйРеквизит = "Контрагент";
			
		ИначеЕсли ПолучитьЗначениеПараметраСбис("ТипГрузополучателя")	= "ГрузополучательПартнер" Тогда
			
			ИзменяемыйРеквизит = "Партнер";
			
		Иначе
			
			ИзменяемыйРеквизит = "";
			
		КонецЕсли;
			
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ВходящийКонтекст = ВложениеСБИС_Получить(ВложениеСБИС, "ВходящийКонтекст");
	
	Если ЗначениеЗаполнено(ВходящийКонтекст) Тогда 
		
		Если ВходящийКонтекст.Свойство("ДанныеСторон") Тогда 
			ВходящийКонтекст.ДанныеСторон.Вставить(ИмяДанныеСтороны, Изменения[ИмяСтороны]);
		КонецЕсли;
	
		Если ВходящийКонтекст.Свойство("РассчитанноеЗначение")
			И ЗначениеЗаполнено(ИзменяемыйРеквизит)
			И ВходящийКонтекст.РассчитанноеЗначение.Свойство(ИзменяемыйРеквизит) Тогда 
			ВходящийКонтекст.РассчитанноеЗначение.Вставить(ИзменяемыйРеквизит, Изменения[ИмяСтороны]);
		КонецЕсли;
		
		Если ВложениеСБИС.Свойство("Параметры")
			И ВложениеСБИС.Параметры.Свойство("РедактируемыеПоля")
			И ВложениеСБИС.Параметры.РедактируемыеПоля.Свойство(ИмяСтороны, РучныеПравки) Тогда
			РучныеПравки.Вставить("Значение", Изменения[ИмяСтороны]);
		КонецЕсли;
			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_Обновить_ПодразделИни(ВложениеСБИС, ТекущиеИзменения, ДопПараметры)
	
	ТекущийТипВложение = ВложениеСБИС_Получить(ВложениеСБИС, "ТекущийПодразделИни");
	Если ТекущиеИзменения = ТекущийТипВложение Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыИзменения = Новый ФиксированнаяСтруктура("ПодразделИни, СоставПакета", ТекущиеИзменения ,ДопПараметры.СоставПакета);
	ВложениеСБИС_УстановитьИниЗагрузки(ВложениеСБИС, ПараметрыИзменения);
	ВложениеСБИС_РазобратьНоменклатуру(ВложениеСБИС, ПараметрыИзменения);

КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_Обновить_Статус(ВложениеСБИС, ТекущиеИзменения, ДопПараметры)

	СтатусыВложения = ВложениеСБИС_Получить(ВложениеСбис, "СтатусыВложения");

	Если ЭтоТипСбис(ТекущиеИзменения, "СбисИсключение") Тогда
		
		СтатусУстановить = "Ошибка";
		ВложениеСБИС.СтатусыВложения.Вставить("Ошибка", ТекущиеИзменения)
		
	Иначе
		
		СтатусУстановить = СтрЗаменить(ТекущиеИзменения, " ", "");
		
	КонецЕсли;	
	
	//Доступные статусы
	Если Найти(",иниустановлена,разобран,неподдерживается,ошибка,незаполненыполя,", "," + НРег(СтатусУстановить) + ",") Тогда
	
		СтатусыВложения.Общий = СтатусУстановить;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_ОбновитьДанныеДокумента(ВложениеСБИС, Изменения)
    Перем ВходящийКонтекст, РучныеПравки;    
    
    СтруктураФайла = ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");

    Если Не ЗначениеЗаполнено(СтруктураФайла)Тогда
        Возврат;
    КонецЕсли;

    ИмяФормыПоФормату = "Файл_" + СтруктураФайла.Файл.Формат + "_" + СтруктураФайла.Файл.ВерсияФормата;
    ИмяФормыПоФормату = ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.сбисЗаменитьНедопустимыеСимволы(ИмяФормыПоФормату);
    
    МассивФормФайл = Новый Массив;
    МассивФормФайл.Добавить("Файл_Шаблон");
    МассивФормФайл.Добавить(ИмяФормыПоФормату);
    
    ФормаФайл = НайтиФункциюСеансаОбработки("ОбновитьДанныеВложения", МассивФормФайл);
    
    Контекст = Новый Структура("ФайлДанные, Изменения", СтруктураФайла, Изменения);
    
    Если ФормаФайл <> Ложь Тогда
        ФормаФайл.ОбновитьДанныеВложения(ПолучитьТекущийЛокальныйКэш(), Контекст);
    КонецЕсли;
	
	ВложениеСБИС.Вставить("ОбновитьВизуализацию", Истина);

КонецПроцедуры    

&НаКлиенте
Процедура ВложениеСБИС_ОбновитьТабличныеДанные(ВложениеСБИС, Изменения)  
	
	Перем ФайлПропатчить, ТабличныеДанныеПропатчить; 
	
	Если НЕ ВложениеСБИС.Свойство("Файл", ФайлПропатчить) Тогда  
		 	
		ФайлПропатчить = ВложениеСБИС;
		
	КонецЕсли;    
	
	ДокументПропатчить = ВложениеСБИС_Получить(ФайлПропатчить, "Документ"); 
	
	Если ДокументПропатчить.Свойство("Стр") Тогда 
		
        ДокументПропатчить.Вставить("Стр", Изменения.ТабличныеДанные);
		
	Иначе
		
		ТабличныеДанныеПропатчить = ВложениеСБИС_Получить(ДокументПропатчить, "ТаблДок"); 
		
		ТабличныеДанныеПропатчить.Вставить("СтрТабл", Изменения.ТабличныеДанные); 
		
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_Обновить_ДанныеДокументовПоУмолчанию(ВложениеСБИС, Изменения, ДопПараметры = Неопределено)	
	Перем ПараметрДляИзменения;
	
	ДанныеПросмотраДокумента = ВложениеСБИС_Получить(ВложениеСБИС, "Просмотр", "ФормаПросмотрДокумента");
	ДанныеПросмотраДокумента.ПараметрыПрочихПолей.РазделСохранен = Изменения.ЗапомнитьВыборДокумента;
	
	НастройкиИни = ПараметрSABY("НастройкиИни", "Технический");
	Если НастройкиИни = Неопределено Тогда
		
		НастройкиИни = Новый Структура;
		
	КонецЕсли;
	
	Если Не НастройкиИни.Свойство("Загрузка", ПараметрДляИзменения) Тогда
		
		ПараметрДляИзменения = Новый Структура;
		НастройкиИни.Вставить("Загрузка", ПараметрДляИзменения);
		
	КонецЕсли;
	
	ТекущееИмяИни = ВложениеСБИС_Получить(ВложениеСБИС, "ИмяИни");
	
	Если Изменения.ЗапомнитьВыборДокумента Тогда
	
		ТекущийТипВложение = ВложениеСБИС_Получить(ВложениеСБИС, "ТекущийПодразделИни");
		
		ПараметрДляИзменения.Вставить(ТекущееИмяИни, ТекущийТипВложение);
	
	Иначе
	
		ПараметрДляИзменения.Удалить(ТекущееИмяИни);
	
	КонецЕсли;
	
	ИзменитьПараметрSABY("НастройкиИни", НастройкиИни, "Технический");
	
КонецПроцедуры

