
// Функция - формирует структуру полей для заполнения на форму просмотра
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - экземпляр вложения сбис
//  ДопПараметры - Структура	 - Расширение. СоставПакета - Экземпляр СоставПакета
// 
// Возвращаемое значение:
//  Структура - Договор, Дата, Контрагент
//
&НаКлиенте
Функция ВложениеСБИС_Поля1С(ВложениеСБИС, ДопПараметры)
	Перем ЗначениеВставить, СтруктураДокОбъект, ОписаниеТипа, РежимПоиска;
	
	ДанныеРезультат = Новый Структура("Договор, Дата, Номер, Контрагент, Организация, Документ");
	Если Не ДопПараметры = Неопределено Тогда
		
		ДопПараметры.Свойство("Режим", РежимПоиска);
		
	КонецЕсли;
	ПолучитьДокумент	=	Не	(	РежимПоиска = "Документ"
								Или	РежимПоиска = "Основание"
								Или	РежимПоиска = "Фильтр"
								Или	РежимПоиска = "Разбор");

	СтруктураОбъекта			= ВложениеСБИС_РассчитанныйОбъект(ВложениеСБИС, ДопПараметры);
	СтруктураДанныхДокумента	= ВложениеСБИС_Получить(ВложениеСБИС, "УстановленныйПодразделИни");
	Если Не ЗначениеЗаполнено(СтруктураДанныхДокумента) Тогда
		
		Возврат ДанныеРезультат;
		
	КонецЕсли;
		
	ДанныеРезультат.Договор		= НовыйОписаниеПоля1СВложения(СтруктураОбъекта, "Договор",	СтруктураДанныхДокумента, ДопПараметры);
	ДанныеРезультат.Дата		= НовыйОписаниеПоля1СВложения(СтруктураОбъекта, "Дата",		СтруктураДанныхДокумента, ДопПараметры);
	ДанныеРезультат.Номер		= НовыйОписаниеПоля1СВложения(СтруктураОбъекта, "Номер",	СтруктураДанныхДокумента, ДопПараметры);
	
	ДанныеРезультат.Контрагент	= НовыйОписаниеПоля1СВложения_Сторона(ВложениеСБИС, "Контрагент",	ДопПараметры);
	ДанныеРезультат.Организация	= НовыйОписаниеПоля1СВложения_Сторона(ВложениеСБИС, "Организация",	ДопПараметры);
	
	ДанныеРезультат.Документ = Новый Структура("Доступность, Путь, Тип, Значение", Ложь, "ОбъектСсылка");
	
	// Документ заполняем только если не находимся в режиме разбора вложения.
	// Если это разбор, то документ заполнится после  набора полей
	Если ПолучитьДокумент Тогда	
		
		ДанныеРезультат.Документ = ВложениеСБИС_Поля1С_Документ(ВложениеСБИС, ДопПараметры);
		
	КонецЕсли;
	
	ВложениеСБИС_Поля1С_ЗаполнитьРедактируемыеПоля(ВложениеСБИС, ДанныеРезультат, ДопПараметры);
		
	Возврат ДанныеРезультат;

КонецФункции

&НаКлиенте
Процедура ВложениеСБИС_Поля1С_ЗаполнитьРедактируемыеПоля(ВложениеСБИС, ДанныеРезультат, ДопПараметры)
    Перем ЗначениеУзлаИни;
	
	Если Не ВложениеСБИС.Параметры.РедактироватьДокумент Тогда
		
		Возврат;
		
	КонецЕсли;
		
	СтруктураОбъекта			= ВложениеСБИС_РассчитанныйОбъект(ВложениеСБИС, ДопПараметры);
	СтруктураДанныхДокумента	= ВложениеСБИС_Получить(ВложениеСБИС, "УстановленныйПодразделИни");

	// Если идет редактирование документа, то его поля берутся как ручные изменения и не перезаполняются в процессе
	Для Каждого КлючИЗначениеИни Из СтруктураДанныхДокумента Цикл 
		
		НетЗначенияУзлаДокумент	=		ДанныеРезультат.Свойство(КлючИЗначениеИни.Ключ)
								Или	Не	КлючИЗначениеИни.Значение.Свойство("Значение", ЗначениеУзлаИни)
								Или	Не	ЗначениеЗаполнено(ЗначениеУзлаИни)
								Или	Не	НРег(Лев(ЗначениеУзлаИни, 10)) = "[документ]";
								
		Если НетЗначенияУзлаДокумент Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		КлючДанные = Сред(КлючИЗначениеИни.Ключ, Найти(КлючИЗначениеИни.Ключ, "_"));
		Если Лев(КлючДанные, 1) = "_" Тогда
			Если НРег(Лев(КлючИЗначениеИни.Ключ, 8)) = "документ" Тогда
				КлючДанные = Сред(КлючДанные, 2);
			Иначе
				КлючДанные = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если	КлючДанные = Неопределено
			Или ДанныеРезультат.Свойство(КлючДанные) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеРезультат.Вставить(КлючДанные, НовыйОписаниеПоля1СВложения(СтруктураОбъекта, КлючДанные,	СтруктураДанныхДокумента, ДопПараметры));
		
	КонецЦикла;
		
КонецПроцедуры	

&НаКлиенте
Функция ВложениеСБИС_Поля1С_Документ(ВложениеСБИС, ДопПараметры)
	
	ДанныеРезультат = Новый Структура("Доступность ,Путь, Тип, Значение", Ложь, "ОбъектСсылка");
	// Документ заполняем только если находимся в режиме разбора вложения на просмотр.
	Попытка
		
		ДанныеРезультат.Доступность = Истина;
		ДанныеРезультат.Значение = ВложениеСБИС_Получить(ВложениеСБИС, "ПодходящийДокумент", ДопПараметры);
		
	Исключение
		
		ДанныеРезультат.Вставить("Ошибка", НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ВложениеСБИС_Поля1С_Документ"));
		// TODO Обработать ошибку 
		
	КонецПопытки;
	
	ТипВложения = ВложениеСБИС_Получить(ВложениеСБИС, "ТипОбъекта", ДопПараметры);
	Если Не ТипВложения = Неопределено Тогда 
	
		ДанныеРезультат.Тип = Новый ОписаниеТипов(ТипВложения);
		Если ДанныеРезультат.Значение = Неопределено Тогда
			
			ДанныеРезультат.Значение = ДанныеРезультат.Тип.ПривестиЗначение();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеРезультат;

КонецФункции

// Функция - создает описание для редактируемого поля формы просмотра вложения
//
// Параметры:
//  СтруктураОбъекта	 - Структура	- Структура рассчитанного объекта для получения значения
//  КлючПоля			 - Строка	 	- Путь, через "." для поиска в узле ини
//  СтруктураРазделаИни	 - Ини			- Структура раздела ини файла 
//  ДопПараметры		 - Структура	- Расширение
// 
// Возвращаемое значение:
//  Структура - Доступность, Тип, Значение, Путь
//
&НаКлиенте
Функция НовыйОписаниеПоля1СВложения(СтруктураОбъекта = Неопределено, КлючПоля = Неопределено, СтруктураРазделаИни = Неопределено, ДопПараметры = Неопределено) Экспорт
	Перем ЗначениеВставить, УзелОписаниеПоля, ТипКратко;
	
	СтруктураРеквизита	= Новый Структура("Доступность, Тип, Значение, Путь", Ложь);
	// Доступность - описание узла есть в ини
	// Тип - описание типа поля
	// Значение - полученное значение 1С
	// Путь - путь в создаваемом/перезаполняемом объекте до рекизита, куда надо поместить.
	
	Если СтруктураРазделаИни = Неопределено Тогда
		
		Возврат СтруктураРеквизита;
		
	КонецЕсли;
		
	ПутьДоРеквизита		= СтрЗаменить(КлючПоля, ".", Символы.ПС);
	УзелОписаниеПоля	= СтруктураРазделаИни;
	
	Для СтрПуть = 1 По СтрЧислоСтрок(ПутьДоРеквизита) Цикл
		
		Если НЕ УзелОписаниеПоля.Свойство(СтрПолучитьСтроку(ПутьДоРеквизита, СтрПуть), УзелОписаниеПоля) Тогда
			
			Если	СтрЧислоСтрок(ПутьДоРеквизита) = 1 Тогда 
				
				СтруктураРазделаИни.Свойство("Документ_" + КлючПоля, УзелОписаниеПоля);
				
			КонецЕсли;
			
			Прервать;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Если УзелОписаниеПоля = Неопределено Тогда
		
		Возврат СтруктураРеквизита;
		
	КонецЕсли;

	ИмяРеквизита = СтроковоеЗначениеУзлаИни(УзелОписаниеПоля, Новый Структура("ИмяРеквизита", Истина));
	
	Если ЗначениеЗаполнено(ИмяРеквизита) Тогда
		
		СтруктураРеквизита.Доступность	= Истина;
		СтруктураРеквизита.Путь			= ИмяРеквизита;
		
		Если СтруктураОбъекта = Неопределено Тогда 
			
			Возврат СтруктураРеквизита;
			
		КонецЕсли;
	
		Если СтруктураОбъекта.Свойство(ИмяРеквизита, ЗначениеВставить) Тогда
		
			СтруктураРеквизита.Значение = ЗначениеВставить;
			
		КонецЕсли;
		
		// Определить тип поля
		ТипОпределен = Ложь;
		Если УзелОписаниеПоля.Свойство("Тип") Тогда
			
			Попытка
				
				СтруктураРеквизита.Тип = СоздатьОписаниеТипаПоОбъекту(УзелОписаниеПоля.Тип);
				ТипОпределен = Истина;
				
			Исключение
				
				СтруктураРеквизита.Вставить("Ошибка", НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.НовыйОписаниеПоля1СВложения", 608));
				ТипКратко = СтрЗаменить(УзелОписаниеПоля.Тип, ".", Символы.ПС);
				ТипКратко = СтрПолучитьСтроку(ТипКратко, СтрЧислоСтрок(ТипКратко));
				
			КонецПопытки;
		Иначе
			
			ТипКратко = ИмяРеквизита;
			
		КонецЕсли;
		
		Если ТипОпределен Тогда
			
			// Уже все определено.
			
		ИначеЕсли	Не	ЗначениеВставить = Неопределено
				И	Не  ЗначениеВставить = "" Тогда
				
			СтруктураРеквизита.Тип = СоздатьОписаниеТипаПоОбъекту(ЗначениеВставить);
				
		ИначеЕсли Не ТипКратко = Неопределено Тогда 
			
			ДоступныеТипы1С = ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолей1С");
			Если ДоступныеТипы1С.Свойство(ТипКратко, СтруктураРеквизита.Тип) Тогда
				СтруктураРеквизита.Тип = СтруктураРеквизита.Тип.ОписаниеТипа;
			КонецЕсли;
			
		Иначе
			
			// Не удалось определить тип, реквизит недоступен для редактирования
			СтруктураРеквизита.Доступность = Ложь;

		КонецЕсли;
			
	КонецЕсли;
	
	Возврат СтруктураРеквизита;
	
КонецФункции

// Функция - создает описание для редактируемого поля формы просмотра вложения
//
// Параметры:
//  СтруктураОбъекта	 - Структура	- Структура рассчитанного объекта для получения значения
//  КлючПоля			 - Строка	 	- Путь, через "." для поиска в узле ини
//  СтруктураРазделаИни	 - Ини			- Структура раздела ини файла 
//  ДопПараметры		 - Структура	- Расширение
// 
// Возвращаемое значение:
//  Структура - Доступность, Тип, Значение, Путь
//
&НаКлиенте
Функция НовыйОписаниеПоля1СВложения_Сторона(ВложениеСБИС, КлючПоля, ДопПараметры)
	Перем ЗначениеВставить, УзелОписаниеПоля, ТипКратко;

	СинонимСтороны				= ВложениеСБИС.ДанныеСтруктурыФайла.Синонимы.Получить(КлючПоля);
	СтруктураОбъекта			= ВложениеСБИС_РассчитанныйОбъект(ВложениеСБИС, ДопПараметры);
	СтруктураДанныхДокумента	= ВложениеСБИС_Получить(ВложениеСБИС, "УстановленныйПодразделИни");
	Если СинонимСтороны = Неопределено Тогда
		
		Возврат НовыйОписаниеПоля1СВложения();

	КонецЕсли;
	
	Возврат НовыйОписаниеПоля1СВложения(СтруктураОбъекта, СинонимСтороны + ".Сторона", СтруктураДанныхДокумента.мСторона, ДопПараметры);
	
КонецФункции

