
&НаКлиенте
Функция ВложениеСБИС_Получить_ВизуализацияДокумента(ВложениеСбис, ДопПараметры)
	Перем Результат;
	
	Если	ВложениеСбис.Свойство("ТекстHTML", Результат) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	СбисМодульИнтеграции = ПараметрSABY("Интеграция", "Сеанс");
	
	ВизуализацияПоСсылке =	ВложениеСБИС_Получить(ВложениеСбис, "Зашифрован")
						Или	(	ВложениеСбис.Свойство("Идентификатор")
							И	ЗначениеЗаполнено(ВложениеСбис.Идентификатор) 
							И	ВложениеСБИС.Свойство("СсылкаНаHTML")
							И	ЗначениеЗаполнено(ВложениеСБИС.СсылкаНаHTML));
	
	Если ВизуализацияПоСсылке Тогда
		
		Результат = СбисМодульИнтеграции.ПолучитьHTMLВложения(ПолучитьТекущийЛокальныйКэш(),
											ДопПараметры.СоставПакета.Идентификатор,
											ВложениеСбис);
		
	ИначеЕсли ЗначениеЗаполнено(ВложениеСБИС_Получить(ВложениеСбис, "XMLДокумента")) Тогда
		
		Результат = СбисМодульИнтеграции.ПолучитьHTMLПоXML(ПолучитьТекущийЛокальныйКэш(), ВложениеСбис)	;
		
	Иначе
		
		Результат = "";
	
	КонецЕсли;
	
	ВложениеСбис.Вставить("ТекстHTML", Результат);	
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ВложениеСБИС_Получить_Поля1С(ВложениеСбис, ДопПараметры)
	Перем РедактируемыеПоля, РежимПолей;
	
	Если ВложениеСБИС.Параметры.Свойство("РедактируемыеПоля", РедактируемыеПоля) Тогда
		
		Возврат РедактируемыеПоля;
		
	КонецЕсли;
		
	ЭтоПолныйРасчет = Истина;
	Если 		ДопПараметры = Неопределено
		Или Не	ДопПараметры.Свойство("Режим", РежимПолей) Тогда
		
		РежимПолей = "Полный";
		
	ИначеЕсли	РежимПолей = "Документ"
			Или	РежимПолей = "Основание"
			Или	РежимПолей = "Фильтр" Тогда
		
		ЭтоПолныйРасчет = Ложь;
		
	КонецЕсли;
	
	Если Не	ЭтоПолныйРасчет	
		И	ВложениеСБИС.Параметры.Свойство("ПоляДляПоиска", РедактируемыеПоля) Тогда
		
		Возврат РедактируемыеПоля;
		
	КонецЕсли;
		
	// При первичном расчете полей, не должно браться от подобраного объекта. Поля пересчитаются, когда документ будет найден
	РедактируемыеПоля = ВложениеСБИС_Поля1С(ВложениеСбис, ДопПараметры);
	Если ЭтоПолныйРасчет Тогда
			
		ВложениеСБИС.Параметры.Вставить("РедактируемыеПоля", РедактируемыеПоля);
		Если РежимПолей = "Разбор" Тогда
			
			РедактируемыеПоля.Документ = ВложениеСБИС_Поля1С_Документ(ВложениеСБИС, ДопПараметры);
			Если	ЗначениеЗаполнено(РедактируемыеПоля.Документ.Значение)
				И	ВложениеСБИС.Параметры.ВозможноРедактироватьДокумент Тогда
				
				// Обновить поля 1С уже по найденному документу, т.к. мы его меняем.
				СтруктураОбновить = Новый Структура;
				СтруктураОбновить.Вставить("Документ", РедактируемыеПоля.Документ.Значение);
				РедактируемыеПоля.Документ.Значение = Неопределено;
					
				ДопПараметрыВложения = Новый ФиксированнаяСтруктура("СоставПакета", ДопПараметры.СоставПакета);
				ВложениеСБИС_Обновить(ВложениеСбис, Новый Структура("Поля1С", СтруктураОбновить), ДопПараметрыВложения);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// После обновления с учетом найденного документа, требуется переопределить поля
		РедактируемыеПоля = ВложениеСБИС.Параметры.РедактируемыеПоля;

			
	Иначе
		
		ВложениеСБИС.Параметры.Вставить("ПоляДляПоиска", РедактируемыеПоля);
		
	КонецЕсли;
	
	Возврат РедактируемыеПоля;

КонецФункции

&НаКлиенте
Функция ВложениеСБИС_Получить_ТипОбъекта(ВложениеСБИС, ДопПараметры)
	Перем ТипПолный;
	
	ПараметрыВложения = ВложениеСБИС_Получить(ВложениеСБИС, "Параметры");
	Если   		ПараметрыВложения = Неопределено
		Или	Не	ПараметрыВложения.Свойство("ПолныйТипОбъекта", ТипПолный) Тогда
		
		ТипПолный = ВложениеСБИС_Получить_ПолныйТипОбъекта(ВложениеСБИС, ДопПараметры);
						
	КонецЕсли;
	
	Если		ДопПараметры = Неопределено
		Или	Не	ДопПараметры.Свойство("ТипКратко")
		Или	Не	ДопПараметры.ТипКратко Тогда
		
		Возврат ТипПолный;
		
	КонецЕсли;
	
	ТипОбъекта = СтрПолучитьСтроку(СтрЗаменить(ТипПолный, ".", Символы.ПС), 2);
    Возврат ТипОбъекта;

КонецФункции	

// Функция - возвращает полный тип объекта: 
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - Структура вложения
//  ДопПараметры - Структура	 - расширение
// 
// Возвращаемое значение:
//  Строка - Полное представление типа объекта для вложения по ини, либо найденному документу. Пример: "ДокументСсылка.РеализацияТИС"
//
&НаКлиенте
Функция ВложениеСБИС_Получить_ПолныйТипОбъекта(ВложениеСБИС, ДопПараметры)
	Перем СтруктураИниФайла, ТипПолный, РежимПоиска, ЗначениеУзлаРасчета;

	Если Не ДопПараметры.Свойство("Раздел_мДокумент", СтруктураИниФайла) Тогда
		
		СтруктураИниФайла = ВложениеСБИС_Получить(ВложениеСБИС, "УстановленныйПодразделИни");
		
	КонецЕсли;
	
	ДопПараметры.Свойство("Режим", РежимПоиска);
	ИмяУзлаРасчетаТипа = "Документ";

	Если РежимПоиска = ИмяУзлаРасчетаТипа Тогда
		
		// Это расчет Документ, не отправляем на вычислить а пробуем опредилить по типу на узле
		ЕстьТип	=	СтруктураИниФайла.Свойство(ИмяУзлаРасчетаТипа, ТипПолный)
				И	ТипПолный.Свойство("Тип", ТипПолный);
		
		Возврат ТипПолный;
		
	Иначе
		
		КонтекстДляРассчитать	= Новый Структура("Вложение, СоставПакета", ВложениеСБИС, ДопПараметры.СоставПакета);
		ТипПолный				= ЗначениеУзлаИни_Получить(СтруктураИниФайла, "ТипОбъекта", КонтекстДляРассчитать);
		ПараметрыВложения		= ВложениеСБИС_Получить(ВложениеСБИС, "Параметры");
		Если    Не	ПараметрыВложения = Неопределено
			И	Не	ТипПолный = Неопределено Тогда
			
			ПараметрыВложения.Вставить("ПолныйТипОбъекта", ТипПолный);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТипПолный;

КонецФункции     

