
&НаКлиенте
Процедура ВложениеСБИС_РазобратьНоменклатуру(ВложениеСБИС, ДопПараметры)
	Перем Основание_ТипДокумент, ИниФайл_Документ, УзлыМТаблДок, СоставПакета;

	Документ_Шаблон_Модуль	= ПолучитьФормуОбработки("Документ_Шаблон");
	Файл_Шаблон_Модуль		= ПолучитьФормуОбработки("Файл_Шаблон");
	Функции_Модуль			= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	Кэш						= ПолучитьТекущийЛокальныйКэш();

	СтруктураИниФайла		= ВложениеСБИС_Получить(ВложениеСБИС, "УстановленныйПодразделИни");
	ПараметрыРассчитать		= Новый Структура("Ини", СтруктураИниФайла);
	ДопПараметрыРасчета		= Новый Структура("БратьПосчитанное", Ложь);
	
	// Возможно ли создавать номенклатуру по текущему вложению и ини
	ВозможностьСоздаватьНоменклатуру	= Документ_Шаблон_Модуль.РассчитатьПараметрИни(Кэш,
		"СоздаватьНоменклатуру",,
		ПараметрыРассчитать,
		ДопПараметрыРасчета);
	ВозможностьСоздаватьНоменклатуру	=	ПолучитьЗначениеПараметраТекущегоСеанса("АвтоматическоеСозданиеНоменклатуры")
											И	(	ВозможностьСоздаватьНоменклатуру = Истина
												Или	ВозможностьСоздаватьНоменклатуру = Неопределено);
	СопоставлятьПередЗагрузкой			= Документ_Шаблон_Модуль.РассчитатьЗначение("СопоставлятьПередЗагрузкой", ПараметрыРассчитать);
	СопоставлятьПередЗагрузкой			=	ПолучитьЗначениеПараметраСбис("СопоставлятьПередЗагрузкой")
											И	(	СопоставлятьПередЗагрузкой = Неопределено
												Или СопоставлятьПередЗагрузкой = Истина);
	
	ВложениеСБИС.Параметры.СопоставлятьПередЗагрузкой = СопоставлятьПередЗагрузкой;
	ВложениеСБИС_Заполнить(ВложениеСБИС, ВозможностьСоздаватьНоменклатуру, "СоздаватьНоменклатуру");
	
	ПараметрыНоменклатуры = Новый Структура();
	ПараметрыНоменклатуры.Вставить("НадоСопоставлять",		Ложь);
	ПараметрыНоменклатуры.Вставить("ЕстьХарактеристики",	Ложь);
	ПараметрыНоменклатуры.Вставить("Сопоставлено",			Ложь);
	
	Если    ДопПараметры.Свойство("СоставПакета", СоставПакета)
		И	СоставПакета.Свойство("НоменклатураСопоставлена") Тогда 
		
		// Номенклатура сопоставлена по документу СБИС
		ПараметрыНоменклатуры.Сопоставлено = ПараметрыНоменклатуры.Сопоставлено;
		
	КонецЕсли;

	Если СтруктураИниФайла.Свойство("мТаблДок", УзлыМТаблДок) Тогда
		
		//Определим параметры номенклатуры ини в мТаблДок
		ВложениеСБИС_РазобратьНоменклатуру_ЗаполнитьПараметрыПоТаблДок(ВложениеСБИС, ПараметрыНоменклатуры, УзлыМТаблДок);
		
	ИначеЕсли СтруктураИниФайла.Свойство("мОснование") Тогда
		
		// Если не окажется в пакете документа основания, надо будет сопоставлять
		ПараметрыНоменклатуры.НадоСопоставлять = Истина;
		
		Для Каждого Основание Из СтруктураИниФайла.мОснование Цикл
			Если Не (	Основание.Значение.Свойство("Основание_Документ")
					И	Основание.Значение.Основание_Документ.Свойство("Тип", Основание_ТипДокумент)) Тогда
					
				Продолжить;
				
			КонецЕсли;
			
			Попытка
				
				ТипыОснований = Новый ОписаниеТипов(Основание_ТипДокумент);
				
			Исключение
				
				ОшибкаУзлаИни = НовыйСбисИсключение(ИнформацияОбОшибке(),
													"МодульОбъектаКлиент.ВложениеСБИС_РазобратьНоменклатуру",
													608,
													,
													"Неверное значения атрибута  ""Тип"" узла ""Основание_Документ""");
													
				ВызватьИсключение СбисИсключение_Представление(ОшибкаУзлаИни);
				
			КонецПопытки;
			
			ВложенияПакета = СоставПакета_Получить(ДопПараметры.СоставПакета, "Вложение");
			
			// Ищем в пакете Документ, который будет основанием нашего.  
			Для Каждого ВложениеОснование Из ВложенияПакета Цикл
				
				Если ВложениеСБИС_Получить(ВложениеОснование, "УстановленныйПодразделИни") = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ТипОбъектаВложения = ВложениеСБИС_Получить_ПолныйТипОбъекта(ВложениеОснование, ДопПараметры);
				Если ТипыОснований.СодержитТип(Тип(ТипОбъектаВложения)) Тогда	
					
					// Если есть подходящий, то такой тип будет загружен из пакета и будет использовано его сопоставление, 
					ПараметрыНоменклатуры.НадоСопоставлять = Ложь;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
		
			Если ПараметрыНоменклатуры.НадоСопоставлять Тогда
				
				КонтекстДляРассчитать	= Новый Структура("Вложение, СоставПакета", Новый Структура, ДопПараметры.СоставПакета);
				// Ищем в инишке мДокумент с типом, который может быть основанием текущего документа
				Для Каждого РазделДок Из ИниПоПараметрам(ВложениеСБИС.ИмяИни).мДокумент Цикл   
					РазделДокСтруктураИни = РазделДок.Значение;
					
					ТипПолный = ЗначениеУзлаИни_Получить(РазделДокСтруктураИни, "ТипОбъекта", КонтекстДляРассчитать);
					Если	Не ТипыОснований.СодержитТип(Тип(ТипПолный))
						Или	Не РазделДокСтруктураИни.Свойство("мТаблДок", УзлыМТаблДок) Тогда
						
						Продолжить;
						
					КонецЕсли;
					
					ВложениеСБИС_РазобратьНоменклатуру_ЗаполнитьПараметрыПоТаблДок(ВложениеСБИС, ПараметрыНоменклатуры, УзлыМТаблДок)	

				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;	
			
	КонецЕсли;
	
	Если ВложениеСБИС.Параметры.Просмотр Тогда
		
		ТипНоменклатуры1СПоИни = Функции_Модуль.РассчитатьЗначение("ВидыСправочниковНоменклатуры", СтруктураИниФайла);
		
		Если ЗначениеЗаполнено(ТипНоменклатуры1СПоИни) Тогда
			ПараметрыНоменклатуры.Вставить("ТипНоменклатуры1СПоИни", ТипНоменклатуры1СПоИни);
		КонецЕсли;
		
	КонецЕсли;
	
	ВложениеСБИС.Параметры.Вставить("Номенклатура", ПараметрыНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_РазобратьНоменклатуру_ЗаполнитьПараметрыПоТаблДок(ВложениеСБИС, ПараметрыНоменклатуры, УзлыМТаблДок)
	Перем ПутьКДаннымТЧ;
	
	Для Каждого мТаблДокКлючИЗначение Из УзлыМТаблДок Цикл
		
		УзелМТаблДок = мТаблДокКлючИЗначение.Значение;
		Если УзелМТаблДок.Свойство("Номенклатура") Тогда
			
			ПараметрыНоменклатуры.НадоСопоставлять = Истина;
			Если	УзелМТаблДок.Свойство("ТаблДок")
				И	УзелМТаблДок.ТаблДок.Свойство("Данные") Тогда
				
				ПутьКДаннымТЧ = УзелМТаблДок.ТаблДок.Данные;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если УзелМТаблДок.Свойство("Характеристика") Тогда
			
			ПараметрыНоменклатуры.ЕстьХарактеристики = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПутьКДаннымТЧ = Неопределено Тогда
		
		МодульФорматаДокумента	= ПолучитьФормуОбработки("Файл_Шаблон");
		СтруктураФайла			= ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
		ПутьКДаннымТЧ			= МодульФорматаДокумента.СтруктураФайла_Получить(СтруктураФайла, "ПутьКТабличнойЧасти");
		
	КонецЕсли;

	КлючТЧ						= "ТабличнаяЧасть";
	ДанныеФайла					= ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
	ЗначениеТЧ					= ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции").РассчитатьЗначениеИзСтруктуры(ПутьКДаннымТЧ, ДанныеФайла);
	
	ВложениеСБИС.ДанныеСтруктурыФайла.Поля.Вставить(КлючТЧ, ЗначениеТЧ);
	ВложениеСБИС.ДанныеСтруктурыФайла.Синонимы.Вставить(КлючТЧ + "_ПутьКДанным", ПутьКДаннымТЧ);

КонецПроцедуры

