
// Процедура - устаревшая точка входа сбисПослеФормированияДокумента
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - сформированное вложение
//  Док			 - Структура	 - сформированный документ
//  Контекст	 - Структура	 - контекст расчета
//
&НаКлиенте
Процедура ВложениеСБИС_ПослеФормированияДокумента(ВложениеСБИС, АргументыТочкиВхода) Экспорт
	
	Если ПрикладнойОбъектSABY_Получить(ВложениеСБИС, "Вызов_сбисПослеФормированияДокумента") = Ложь Тогда	
		
		Возврат;
		
	КонецЕсли;

	НаборМодулейДляФормата	= ПрикладнойОбъектSABY_Получить(ВложениеСБИС, "НаборМодулейДляФормата");
	ОбработчикВФК			= ПользовательскаяТочкаВхода("сбисПослеФормированияДокумента", НаборМодулейДляФормата);
	Если ОбработчикВФК <> Неопределено Тогда
		
		ВызватьПользовательскуюТочкуВхода(ОбработчикВФК, АргументыТочкиВхода);
		ПрикладнойОбъектSABY_Установить(ВложениеСБИС, "Вызов_сбисПослеФормированияДокумента", Ложь);
		
	КонецЕсли;	
	
КонецПроцедуры

