
// Процедура - устаревшая точка входа сбисПослеФормированияДокумента
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - сформированное вложение
//  Док			 - Структура	 - сформированный документ
//  Контекст	 - Структура	 - контекст расчета
//
&НаКлиенте
Процедура ВложениеСБИС_ПослеФормированияДокумента(ВложениеСБИС, Контекст) Экспорт
	
	ПараметрыВложения = ВложениеСБИС_Получить(ВложениеСБИС, "Параметры");
	Если 		ЗначениеЗаполнено(ПараметрыВложения)
		И 		ПараметрыВложения.Свойство("Вызов_сбисПослеФормированияДокумента")
		И	Не	ПараметрыВложения.Вызов_сбисПослеФормированияДокумента Тогда	
		
		Возврат;
		
	КонецЕсли;
	
	ОбработчикВФК		= МодульОбъектаКлиент().ПользовательскаяТочкаВхода("сбисПослеФормированияДокумента", ПараметрыВложения.НаборМодулейДляФормата);
	Если ОбработчикВФК <> Неопределено Тогда
		
		Док					= ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураДокумента");
		Аргумент			= Новый Структура("Док, Кэш, Контекст", Док, ПолучитьТекущийЛокальныйКэш(), Контекст);
		ДопПараметрыВызова	= Новый Структура("СообщатьПриОшибке", Истина);
		
		МодульОбъектаКлиент().ВызватьПользовательскуюТочкуВхода(ОбработчикВФК, Аргумент, ДопПараметрыВызова);
		
		Контекст						= Аргумент.Контекст;	// контекст могли передать на сервер и в массиве возвратилась бы его копия
		ВложениеСБИС.СтруктураДокумента = Аргумент.Док;			// на случай, если Док поменялся в функции сбисПослеФормированияДокумента
		
	КонецЕсли;	
	
КонецПроцедуры



