
// Процедура - устаревшая точка входа сбисПослеФормированияДокумента
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - сформированное вложение
//  Док			 - Структура	 - сформированный документ
//  Контекст	 - Структура	 - контекст расчета
//
&НаКлиенте
Процедура ВложениеСБИС_ПослеФормированияДокумента(ВложениеСБИС, Контекст) Экспорт
	
	Если ПрикладнойОбъектSABY_Получить(ВложениеСБИС, "Вызов_сбисПослеФормированияДокумента") = Ложь Тогда	
		
		Возврат;
		
	КонецЕсли;

	НаборМодулейДляФормата	= ПрикладнойОбъектSABY_Получить(ВложениеСБИС, "НаборМодулейДляФормата");
	ОбработчикВФК			= ПользовательскаяТочкаВхода("сбисПослеФормированияДокумента", НаборМодулейДляФормата);
	Если ОбработчикВФК <> Неопределено Тогда
		
		Док					= ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураДокумента");
		Аргумент			= Новый ФиксированнаяСтруктура("Док, Кэш, Контекст", Док, ПолучитьТекущийЛокальныйКэш(), Контекст);
		
		ВызватьПользовательскуюТочкуВхода(ОбработчикВФК, Аргумент);
		
		Контекст						= Аргумент.Контекст;	// контекст могли передать на сервер и в массиве возвратилась бы его копия
		ВложениеСБИС.СтруктураДокумента = Аргумент.Док;			// на случай, если Док поменялся в функции сбисПослеФормированияДокумента
		
	КонецЕсли;	
	
КонецПроцедуры

