
// Процедура - устаревшая точка входа сбисПослеФормированияДокумента
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - сформированное вложение
//  Док			 - Структура	 - сформированный документ
//  Контекст	 - Структура	 - контекст расчета
//
&НаКлиенте
Процедура ВложениеСБИС_ПослеФормированияДокумента(ВложениеСБИС, Контекст) Экспорт
	
	Если ПрикладнойОбъектSABY_Получить(ВложениеСБИС, "Вызов_сбисПослеФормированияДокумента") = Ложь Тогда	
		
		Возврат;
		
	КонецЕсли;

	НаборМодулейДляФормата	= ПрикладнойОбъектSABY_Получить(ВложениеСБИС, "НаборМодулейДляФормата");
	ОбработчикВФК			= ПользовательскаяТочкаВхода("сбисПослеФормированияДокумента", НаборМодулейДляФормата);
	Если ОбработчикВФК <> Неопределено Тогда
		
		Док					= ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураДокумента");
		АргументыТочкиВхода = Новый Структура("Док, Кэш, Контекст", Док, ПолучитьТекущийЛокальныйКэш(), Контекст);
		
		ВызватьПользовательскуюТочкуВхода(ОбработчикВФК, АргументыТочкиВхода);
		
		// После вызова проверить косяки с передачей переменных на сервер.
		ВложениеДляОбновить = ВложениеСБИС;
		Если Не Контекст = АргументыТочкиВхода.Контекст Тогда
			
			// Контекст передавали на сервер. Нужно найти вложение в измененном на сервере документе
			Контекст = АргументыТочкиВхода.Контекст;
			ВложениеДляОбновить = СоставПакета_Получить(Контекст.СоставПакета, "Вложение", ВложениеСБИС);
			
		КонецЕсли;
		
		Если Не АргументыТочкиВхода.Док = Док Тогда
			
			// Док передавался на сервер в функции сбисПослеФормированияДокумента.
			ВложениеСбис_Обновить(ВложениеДляОбновить, АргументыТочкиВхода.Док, "СтруктураФайла");
			
		КонецЕсли;
		
		ПрикладнойОбъектSABY_Установить(ВложениеДляОбновить, "Вызов_сбисПослеФормированияДокумента", Ложь);
		
	КонецЕсли;	
	
КонецПроцедуры

