
&НаКлиенте
Функция ВложениеСБИС_СторонаПоРоли_Вспомогательные(ВложениеСБИС, РольДО)
	Перем ДанныеСтороныПоВспомогательнойРоли;

	ДанныеСтруктураФайла	= ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
	ИмяВспомогательнойРоли	= "Грузо" + РольДО;

	//Поиск вспомогательной стороны
	Если 		ДанныеСтруктураФайла = Неопределено
		Или	Не	ДанныеСтруктураФайла.Файл.Документ.Свойство(ИмяВспомогательнойРоли, ДанныеСтороныПоВспомогательнойРоли) Тогда
		
		//Нет данных файла на вложении, неоткуда брать доп роль, либо вспомогательной роли нет
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат ДанныеСтороныПоВспомогательнойРоли;
	
КонецФункции

// Функция - определяет сторону по роли, с учетом дополнительной: Получатель/Грузополучатель, Отправитель/Грузоотрправитель.
//	вспомогательная сторона может стать основной, если выполнены условия:
//	1. совпадает ИНН
//	2. заполнен КПП (ГП/ГО) и отличается от основной роли и код филиала(не пустой) либо
//	(считаем, что является филиалом)
//	3. не стоит явного запрета на смену (доп.свойство на карточке в 1С "ИспользоватьКакПолучателя(Отправителя)")
//
// Параметры:
//  ВложениеСБИС - класс вложение СБИС	- структура с данными сторон
//  РольДО		 - строка				- роль Отправитель/Получатель
// 
// Возвращаемое значение:
//  класс сторона - структура для роли документооборота
//
&НаКлиенте
Функция ВложениеСБИС_СторонаПоРоли_Документооборот(ВложениеСБИС, РольДО)
	Перем ДанныеСтруктураФайла, ДанныеСтороныПоРоли, ДанныеСтороныПоВспомогательнойРоли, ЗапретРедакций;

	ДанныеСтороныПоРоли = ВложениеСБИС_СторонаПоРоли_Основные(ВложениеСБИС, РольДО);
	
	//Если определение сторон с учетом филиала отключено для пользователя, то вернуть найденные данные по роли
	Если		ДанныеСтороныПоРоли = Неопределено
		Или	Не	ПолучитьЗначениеПараметраСбис("Филиалы_" + РольДО) Тогда
		
		Возврат ДанныеСтороныПоРоли;
		
	КонецЕсли;
	
	ДанныеСтороныПоВспомогательнойРоли = ВложениеСБИС_СторонаПоРоли_Вспомогательные(ВложениеСБИС, РольДО);

	//Нет данных файла на вложении, неоткуда брать основную роль.
	Если	ДанныеСтороныПоРоли = Неопределено
		И	ДанныеСтороныПоВспомогательнойРоли = Неопределено Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
		
	ИспользоватьКакРольОсн		= ПрочитатьДополнительныйПараметрСтороны(ДанныеСтороныПоРоли, "ИспользоватьКак" + РольДО);
	ВспомогательнаяРольФилиал	= Ложь;

	Если	ДанныеСтороныПоВспомогательнойРоли = Неопределено Тогда
		
		ИспользоватьКакРольОсн	= Истина;
		
	Иначе
		
		ИспользоватьКакРольДоп	= ПрочитатьДополнительныйПараметрСтороны(ДанныеСтороныПоВспомогательнойРоли, "ИспользоватьКак" + РольДО);
		ПлоскиеДанныеРоли		= Сторона_Выгрузить(ДанныеСтороныПоРоли);
		ПлоскиеДанныеВспомРоли	= Сторона_Выгрузить(ДанныеСтороныПоВспомогательнойРоли);
		ЗапретРедакций			= ДанныеСтороныПоРоли.Свойство("ЗапретРедакций") И ДанныеСтороныПоРоли.ЗапретРедакций;
		
		//Стоит явный признак на доп стороне использовать как %роль%, либо это филиал: 
		//Заполнен и отличается КПП, либо КПП заполнен и совпадает, но отличается КодФилиала
		Если 	ПлоскиеДанныеРоли.ИНН = ПлоскиеДанныеВспомРоли.ИНН
			И	ЗначениеЗаполнено(ПлоскиеДанныеРоли.КПП)
			И	ЗначениеЗаполнено(ПлоскиеДанныеВспомРоли.КПП) Тогда
			//Проверить, что филиал - заполнен и отличается КФ, либо заполнен, но отличается КПП.
			ВспомогательнаяРольФилиал =	Не	ПлоскиеДанныеРоли.КПП = ПлоскиеДанныеВспомРоли.КПП
									Или	(		ЗначениеЗаполнено(ПлоскиеДанныеВспомРоли.КодФилиала)
										И	Не	ПлоскиеДанныеРоли.КодФилиала = ПлоскиеДанныеВспомРоли.КодФилиала);
		
		КонецЕсли;
	КонецЕсли;
	
	ИспользоватьКакРольДоп =	ИспользоватьКакРольДоп = Истина
							Или	ВспомогательнаяРольФилиал;
	
	Если		ИспользоватьКакРольОсн = Истина
		Или	Не	ИспользоватьКакРольДоп Тогда 

		//Явный признак на основной стороне использовать как %роль%, либо нет доп. стороны, либо не филиал
		ДанныеРезультат = ДанныеСтороныПоРоли;

	Иначе

		//Стоит явный признак на доп стороне использовать как %роль%, либо это филиал
		ДанныеРезультат = ДанныеСтороныПоВспомогательнойРоли;
		
	КонецЕсли;
	
	ДанныеРезультат = ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.СбисСкопироватьОбъектНаКлиенте(ДанныеРезультат);

	//Прокинуть признак запрета редакций, если был
	Если	Не	ЗапретРедакций = Неопределено
		И		ЗапретРедакций Тогда
	
		ДанныеРезультат.Вставить("ЗапретРедакций", Истина);
		
	КонецЕсли;
	
	//Установить код страны, если явно отсутсвует
	Если		ДанныеРезультат.Свойство("СвЮЛ")
		И	Не	ДанныеРезультат.СвЮл.Свойство("КодСтраны") Тогда
		
		ДанныеРезультат.СвЮЛ.Вставить("КодСтраны", "643");
		
	КонецЕсли;
	
	Возврат ДанныеРезультат	
	
КонецФункции

&НаКлиенте
Функция ВложениеСБИС_СторонаПоРоли_Основные(ВложениеСБИС, РольДО)
	Перем ДанныеСтороныПоРоли;

	//Проверка основной стороны
	Если Не ВложениеСБИС.Свойство(РольДО, ДанныеСтороныПоРоли) Тогда
		
		// На вложении нет такой роли
		Возврат Неопределено;
		
	КонецЕсли;
	
	ДанныеСтруктураФайла = ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
	
	Если	Не	ДанныеСтруктураФайла = Неопределено
		И	Не	ТипЗнч(ДанныеСтороныПоРоли) = Тип("Структура") Тогда
		
		// Если на сторона на вложении не структура и есть данные файл.документ то взять оттуда по роли.
		ДанныеСтороныПоРоли = ДанныеСтруктураФайла.Файл.Документ[РольДО];
		
	КонецЕсли;
	
	Возврат ДанныеСтороныПоРоли;
	
	
КонецФункции

// Функция - возвращает сторону для сопоставления номенклтуры по роли
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - структура вложения от которого берется роль
//  ДопПараметры - Структура	 - расширение
// 
// Возвращаемое значение:
//  Сторона/Неопределено - структура стороны сопоставления
//
&НаКлиенте
Функция ВложениеСБИС_СторонаПоРоли_СопоставлениеНоменклатуры(ВложениеСБИС, ДопПараметры)
	
	ДанныеСтруктурыФайла	= ВложениеСБИС_Получить(ВложениеСБИС, "ДанныеСтруктурыФайла");
	ФункцииДокументов		= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");

	КонтрагентРоль		= ДанныеСтруктурыФайла.Синонимы.Получить("Контрагент");
	ОрганизацияРоль		= ДанныеСтруктурыФайла.Синонимы.Получить("Организация");
	СопоставлениеРоль	= ДанныеСтруктурыФайла.Синонимы.Получить("Сопоставление");
	
	Если КонтрагентРоль = СопоставлениеРоль Тогда
					
		Поля1С				= ВложениеСбис_Получить(ВложениеСБИС, "Поля1С");
		КонтрагентВложения	= Поля1С.Контрагент.Значение;
		
		Если ЗначениеЗаполнено(КонтрагентВложения) Тогда
			
			// Есть ссылка на контрагента 1С, по которому работает сопоставление. Прочитать карточку, взять его данные как сопоставление
			Кэш = ПолучитьТекущийЛокальныйКэш();
			сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "СтороныПоСсылкам", КонтрагентВложения); 
			сбисОписаниеОбъекта.Значение = ФункцииДокументов.сбисПолучитьЗначениеРассчитанногоОбъекта(Кэш, сбисОписаниеОбъекта);
			
			Если сбисОписаниеОбъекта.Значение = Неопределено Тогда
				
				СписокСторонПолучить = Новый Массив;
				СписокСторонПолучить.Добавить(КонтрагентВложения);
				
				ДанныеСторон	= ПрочитатьСтороныПоДанным1С(СписокСторонПолучить);
				ДанныеСтороны	= ДанныеСторон.Получить(КонтрагентВложения);
				
				Если ДанныеСтороны.Свойство("Ошибка") Тогда
					
					ОшибкаСтороныСопоставления = НовыйСбисИсключение(	ДанныеСтороны.Ошибка,
																		"МодульОбъектаКлиент.ВложениеСБИС_СторонаПоРоли_СопоставлениеНоменклатуры");
					
					Если ОшибкаСтороныСопоставления.code = 721 Тогда
						
						// Контрагент не заполнен в 1С клиента, взять в качестве основы для сопоставления значение по документу
						сбисОписаниеОбъекта.Значение = ДанныеСтруктурыФайла.Поля.Получить("Сопоставление");
						
					Иначе
						
						ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаСтороныСопоставления);
	
					КонецЕсли;
					
				Иначе
					
					сбисОписаниеОбъекта.Значение = ДанныеСтороны.Результат;
					
				КонецЕсли;
				
				сбисОписаниеОбъекта.Значение.Вставить("Контрагент1С", КонтрагентВложения);
				ФункцииДокументов.сбисЗакэшироватьЗначениеРассчитанногоОбъекта(Кэш, сбисОписаниеОбъекта);
				
			КонецЕсли;
			
			КонтрагентДляСопоставления = сбисОписаниеОбъекта.Значение;
			
		Иначе
			
			// Берем Сторону от документ как данные для сопоставления.
			СтрКонтрагента				= ДанныеСтруктурыФайла.Поля.Получить("Контрагент");  
			КонтрагентДляСопоставления	= Новый Структура;
			ФункцииДокументов.СбисСкопироватьСтруктуруНаКлиенте(КонтрагентДляСопоставления, СтрКонтрагента);
			
			КонтрагентДляСопоставления.Вставить("ИдентификаторЛица", Сторона_Получить(СтрКонтрагента, "ИдентификаторЛица")); 
			
			Если Не КонтрагентВложения = Неопределено Тогда
			
				КонтрагентДляСопоставления.Вставить("Контрагент1С", КонтрагентВложения);
			
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(КонтрагентДляСопоставления) Тогда
			
			СтрКонтрагента = Новый Структура;
			
		КонецЕсли;
		
	ИначеЕсли ОрганизацияРоль = СопоставлениеРоль Тогда
		
		// Надо искать по данным организации, ссылка на организацию не подходит, т.к. нужен контрагент.
		СтрКонтрагента = ДанныеСтруктурыФайла.Поля.Получить("Организация");  
		Если НЕ ЗначениеЗаполнено(СтрКонтрагента) Тогда
			
			СтрКонтрагента = Новый Структура;
			
		КонецЕсли;	
			
		КонтрагентДляСопоставления = Новый Структура;
		ФункцииДокументов.СбисСкопироватьСтруктуруНаКлиенте(КонтрагентДляСопоставления, СтрКонтрагента);
		
		КонтрагентДляСопоставления.Вставить("ИдентификаторЛица", Сторона_Получить(СтрКонтрагента, "ИдентификаторЛица"));
		
	Иначе
		
		КонтрагентДляСопоставления = Неопределено;
		
	КонецЕсли;
	
	Возврат КонтрагентДляСопоставления;
	
КонецФункции

