
// Процедура - устанавливает на текущее вложение СБИС ини загрузки
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - Структура, вложение в которое устанавливаем параметры
//  ДопПараметры - Структура	 - СоставПакета
//
&НаКлиенте
Процедура ВложениеСБИС_УстановитьИниЗагрузки(ВложениеСБИС, ДопПараметры)
	Перем мСторонаДокумента;
	
	СбисОбщиеФункции	= ПолучитьЗначениеПараметраСбис("ФункцииДокументов");
	ПолныйСоставПакета	= ДопПараметры.СоставПакета;
	
	ПараметрыИни		= ВложениеСБИС_Получить(ВложениеСБИС, "ПараметрыДанныхВложения");
	
	Файл_Формат			= ПараметрыИни.Тип;
	Файл_ВерсияФормата	= ПараметрыИни.Версия;
	НаправлениеВложения	= ПараметрыИни.Направление;
	СтруктураФайла		= ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
	ИмяИни				= ВложениеСБИС_Получить(ВложениеСБИС, "ИмяИни");
	КэшДляРасчетов		= ПолучитьТекущийЛокальныйКэш();
	ДопПараметрыРасчета	= Новый Структура("БратьПосчитанное", Ложь);
	
	// Подбор имени и значения ини на загрузку.
	Если ИмяИни = Неопределено Тогда
		Если	Не ЗначениеЗаполнено(НаправлениеВложения) 
			Или	Не ЗначениеЗаполнено(Файл_Формат) Тогда
			Возврат;
		КонецЕсли;
		
		ИмяИниКратко	= СтрЗаменить(Файл_Формат, "счФактКор", "СчФактКор") + "_" + Файл_ВерсияФормата;
		ИмяИни			= "Загрузка_" + НаправлениеВложения + "_" + ИмяИниКратко;
		Ини				= ИниПоПараметрам(ИмяИни);
		
		Если		Ини = Неопределено
			И Не	НаправлениеВложения = "Исходящий" Тогда
			
			// если нет файла настроек с полным именем, то пытаемся найти со старым
			ИмяИни	= ИмяИниКратко;
			Ини		= ИниПоПараметрам(ИмяИни);
			
		КонецЕсли;
		ВложениеСБИС.Вставить("ИмяИни", ИмяИни);
	
	Иначе
		
		Ини = ИниПоПараметрам(ИмяИни);
		
	КонецЕсли;
		
	ВложениеСБИС_УстановитьИниЗагрузки_РазделмДокумент(ВложениеСБИС, Ини, ДопПараметры);
	
	СтруктураИниФайла = ВложениеСБИС_Получить(ВложениеСБИС, "УстановленныйПодразделИни");
	
	Если СтруктураИниФайла = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеСтруктурыФайла = Новый Структура("Синонимы, Поля", Новый Соответствие, Новый Соответствие); 
	ВложениеСБИС.Вставить("ДанныеСтруктурыФайла", ДанныеСтруктурыФайла);
	
	ВложениеСБИС_УстановитьИниЗагрузки_ПараметрыСторон(ВложениеСБИС, ДопПараметры);
	
	Документ_Модуль		= ПолучитьФормуОбработки("Документ_Шаблон");
	Функции_Модуль		= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	ПараметрыРассчитать	= Новый Структура("Ини", СтруктураИниФайла);
	
	ВозможноРедактироватьДокумент		= Документ_Модуль.РассчитатьЗначение("РедактироватьДокумент",	ПараметрыРассчитать) = Истина;
	ВозможноРедактироватьТабЧасть		= Функции_Модуль.РассчитатьЗначение("РедактироватьТабЧасть",	СтруктураИниФайла) = Истина;

	ВложениеСБИС.Параметры.ВозможноРедактироватьДокумент	= ВозможноРедактироватьДокумент;
	// Определяем редактируется ли документ, или перезаполняется существующий при установке полей 1С, когда будет подобран документ.
	ВложениеСБИС.Параметры.РедактироватьДокумент	= Ложь;
	// Редактирование таб.части - старый механизм для актов расхождения. Определяется через инишку признаком "РедактироватьТабЧастьРедактироватьТабЧасть"
	ВложениеСБИС.Параметры.РедактироватьТабЧасть	= ВозможноРедактироватьТабЧасть;
	ВложениеСБИС.Параметры.Удалить("ПолныйТипОбъекта");		// Тип объекта в виде ДокументСсылка.ТипДокументаПоМетаданным

	ВложениеСБИС.Параметры.Удалить("РедактируемыеПоля");	// Кэш функции Поля1С вложения при полном расчете, включая изменения пользователя
	ВложениеСБИС.Параметры.Удалить("РассчитанныйОбъект");	// Кэш функции РассчитанныйОбъект вложения при полном расчете

	ВложениеСБИС.Параметры.Удалить("ПоляДляПоиска");		// Кэш функции Поля1С вложения при неполном расчете (поиск документа/основания)
	ВложениеСБИС.Параметры.Удалить("БазовыеПоляОбъекта");	// Кэш функции РассчитанныйОбъект вложения при при неполном расчете (поиск документа/основания
	
	ВложениеСБИС_Обновить(ВложениеСБИС, Новый ФиксированнаяСтруктура("Статус", "ИниУстановлена"));

	ПараметрыПоляПОлучить = Новый ФиксированнаяСтруктура("СоставПакета, Режим", ПолныйСоставПакета, "Разбор");
	Поля1С = ВложениеСБИС_Получить(ВложениеСБИС, "Поля1С", ПараметрыПоляПОлучить);

	Если ВложениеСБИС.Параметры.Просмотр Тогда 
		
		ВложениеСБИС_РазобратьДляПросмотра(ВложениеСБИС, ДопПараметры);	
		
	КонецЕсли;
	
	ВложениеСБИС_Обновить(ВложениеСБИС, Новый ФиксированнаяСтруктура("Статус", "Разобран"));
	
КонецПроцедуры

&НаКлиенте
Функция ВложениеСБИС_УстановитьИниЗагрузки_ВыбратьПодразделИниПоУмолчанию(ВложениеСБИС, ПодобранныйИни, ДопПараметры)

	СбисОбщиеФункции	= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
 	ПолныйСоставПакета	= ДопПараметры.СоставПакета;

	ПараметрыИни		= ВложениеСБИС_Получить(ВложениеСБИС, "ПараметрыДанныхВложения");
	СтруктураФайла		= ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");

	Файл_Формат			= ПараметрыИни.Тип;
	Файл_ВерсияФормата	= ПараметрыИни.Версия;
	фрмПольз = НайтиФункциюСеансаОбработки("ОпределитьТипЗагружаемогоДокумента", "Файл_" + Файл_Формат + "_" + Файл_ВерсияФормата);
	Если фрмПольз = Ложь Тогда		

		// Выбор раздела файла настроек для загрузки
		РегламентВоВложении	= СбисОбщиеФункции.РассчитатьЗначениеИзСтруктуры("Файл.Документ.Параметр.ДокументВидОперации", СтруктураФайла); 
		РегламентНаПакете	= ПолныйСоставПакета.Регламент.Название; 
		
		ДокументПриоритетЗагрузки = Новый СписокЗначений;
		
		Для Каждого ИниДокумент Из ПодобранныйИни.мДокумент Цикл
			
			РеглНаПакетеСовпал = Ложь; 
			Если ИниДокумент.Значение.Свойство("РеестрСБИС_Операция") Тогда
				РегламентПакет_мДокумент	= СбисОбщиеФункции.РассчитатьЗначение("РеестрСБИС_Операция", ИниДокумент.Значение);
				РеглНаПакетеСовпал			= НРег(РегламентПакет_мДокумент) = НРег(РегламентНаПакете);
			КонецЕсли;
			
			//Если указан документ по-умолчанию, тогда берем его и останавливает подбор
			ДокументПоУмолчанию = СбисОбщиеФункции.РассчитатьЗначение("ДокументПоУмолчанию", ИниДокумент.Значение);
			ДокументПоУмолчанию =	ДокументПоУмолчанию = "1"
								Или	ДокументПоУмолчанию = Истина;
			
			РеглНаВложенииСовпал = Ложь;
			Если ИниДокумент.Значение.Свойство("ДокументВидОперации") Тогда
				
				Если ИниДокумент.Значение.ДокументВидОперации.Свойство("Данные") Тогда
					РегламентВоВложении = СбисОбщиеФункции.РассчитатьЗначениеИзСтруктуры(ИниДокумент.Значение.ДокументВидОперации.Данные, СтруктураФайла);
				КонецЕсли;
				
				РегламентВложение_мДокумент = СбисОбщиеФункции.РассчитатьЗначение("ДокументВидОперации", ИниДокумент.Значение);
				Если ЗначениеЗаполнено(РегламентВложение_мДокумент) Тогда
					РегламентВложение_мДокумент = СбисОбщиеФункции.РазбитьСтрокуВМассивНаКлиенте(РегламентВложение_мДокумент,",");
					Для Каждого Регл Из РегламентВложение_мДокумент Цикл
						Если ( НРег(Регл) = НРег(РегламентВоВложении) )  Тогда
							РеглНаВложенииСовпал = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
			Если		РеглНаПакетеСовпал И РеглНаВложенииСовпал Тогда
				
				//Регламент на пакете и вложении совпадают - наивысший приоритет
				ДокументПриоритетЗагрузки.Добавить(ИниДокумент.Ключ, 0);
				
			ИначеЕсли	РеглНаВложенииСовпал Тогда
				
				ДокументПриоритетЗагрузки.Добавить(ИниДокумент.Ключ, 1);
				
			ИначеЕсли	РеглНаПакетеСовпал Тогда
				
				ДокументПриоритетЗагрузки.Добавить(ИниДокумент.Ключ, 2);

			ИначеЕсли	ДокументПоУмолчанию Тогда
				
				ДокументПриоритетЗагрузки.Добавить(ИниДокумент.Ключ, 3);
				
			Иначе

				ДокументПриоритетЗагрузки.Добавить(ИниДокумент.Ключ, 4);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ДокументПриоритетЗагрузки.Количество() Тогда
			ДокументПриоритетЗагрузки.СортироватьПоПредставлению();
			ИниДокументВыбран = ПодобранныйИни.мДокумент[ДокументПриоритетЗагрузки[0].Значение];
			ИмяПодразделИни = ДокументПриоритетЗагрузки[0].Значение;
		КонецЕсли;
		
	Иначе
		
		// Пользовательская точка входа для определения подраздела
		ПараметрыОпределенияТипа = Новый Структура("СоставПакета, Вложение, Ини, Кэш");
		ПараметрыОпределенияТипа.СоставПакета	= ПолныйСоставПакета;
		ПараметрыОпределенияТипа.Вложение		= ВложениеСБИС;
		ПараметрыОпределенияТипа.Ини			= ПодобранныйИни;
		ПараметрыОпределенияТипа.Кэш			= ПолучитьТекущийЛокальныйКэш();
		
		ТипДок = фрмПольз.ОпределитьТипЗагружаемогоДокумента(ПараметрыОпределенияТипа);
		ИниДокументВыбран = ПодобранныйИни.мДокумент[ТипДок];
		ИмяПодразделИни = ТипДок;
		
	КонецЕсли;
	
	Возврат ИмяПодразделИни;
		
КонецФункции
	
&НаКлиенте
Процедура ВложениеСБИС_УстановитьИниЗагрузки_ЗаполнитьРоли(ВложениеСБИС, ПутиКДанным, РолиПоИни)
	Перем мСторонаДокумента, УзелМСторона;
	
	СтруктураИниФайла = ВложениеСБИС_Получить(ВложениеСБИС, "УстановленныйПодразделИни");

	Если Не СтруктураИниФайла.Свойство("мСторона", мСторонаДокумента) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтруктураФайла			= ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
	ДанныеСтруктурыФайла	= ВложениеСБИС_Получить(ВложениеСБИС, "ДанныеСтруктурыФайла");

	// Есть узлы мСтороны для рассчета данных сторон
	// Заполнить синонимы и данные сторон рассчета
	Для Каждого КлючИЗначениеУзелМСторона Из мСторонаДокумента Цикл
		
		РольДляСоответствия = РолиПоИни.Получить(КлючИЗначениеУзелМСторона.Ключ);
		Если РольДляСоответствия = Неопределено Тогда
			
			// Роль без определения, вставить как есть
			ДанныеСтруктурыФайла.Синонимы.Вставить(КлючИЗначениеУзелМСторона.Ключ, КлючИЗначениеУзелМСторона.Ключ);
			РольДляСоответствия = КлючИЗначениеУзелМСторона.Ключ;
			
		Иначе
				
			ДанныеСтруктурыФайла.Синонимы.Вставить(РольДляСоответствия,				КлючИЗначениеУзелМСторона.Ключ);
			ДанныеСтруктурыФайла.Синонимы.Вставить(КлючИЗначениеУзелМСторона.Ключ,	РольДляСоответствия);
			
		КонецЕсли;
		
		Если Не КлючИЗначениеУзелМСторона.Значение.Свойство("Сторона", УзелМСторона) Тогда
			
			Продолжить;
			
		// Костыли для определения данных сторон
		ИначеЕсли	УзелМСторона.Свойство("Данные") Тогда
			
			ПутьМСтороны = УзелМСторона.Данные;
			ПутиКДанным.Вставить(РольДляСоответствия, ПутьМСтороны)
			
		ИначеЕсли	УзелМСторона.Свойство("Вычислить") Тогда
			
			Попытка
				
				// Король костылей. На шару пробуем найти переадресацию на другой узел ини. ПЕРЕДЕЛАТЬ!
				УзелМСторона = СтруктураИниФайла[УзелМСторона.Вычислить];
				ПутиКДанным.Вставить(РольДляСоответствия, УзелМСторона.Данные)
				
			Исключение
				
				ПутьМСтороны = Неопределено;
				
			КонецПопытки;
			
		Иначе
			
			ПутьМСтороны = Неопределено;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Определить сторону для сопоставления номенклатуры
	ПараметрыИни			= ВложениеСБИС_Получить(ВложениеСБИС, "ПараметрыДанныхВложения");
	РольДляСоответствия		= РолиПоИни.Получить("Сопоставление");
	Если Не РольДляСоответствия = Неопределено Тогда
		
		КонтрагентСопоставления = ДанныеСтруктурыФайла.Синонимы.Получить(РольДляСоответствия);
		Если КонтрагентСопоставления = Неопределено Тогда
			
			// Роль определена узлом, но отсутствует в мСтороне
			ТекстСообщения			=	"Для роли в узле ""КонтрагентДляСопоставленияНоменклатуры_Роль"" " +
										РольДляСоответствия +
										" отсутствует описание узла мСторона";
			ОшибкаРолиСопоставления	= НовыйСбисИсключение(608, "МодульОбъектаКлиент.ВложениеСБИС_УстановитьИниЗагрузки_ЗаполнитьРоли",,,ТекстСообщения);
			ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаРолиСопоставления);
			
		КонецЕсли;
		
	Иначе
		
		РольДляСоответствия = РолиПоИни.Получить("Контрагент");
		
		// В документе нет ни роли для сопоставления, ни роли контрагента.
		// Временный костыль для сопоставления по организации. Перенести в разбор номенклатры.
		Если РольДляСоответствия = Неопределено Тогда
			
			РольДляСоответствия = РолиПоИни.Получить("Организация");
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеСтруктурыФайла.Синонимы.Вставить("Сопоставление", РольДляСоответствия);
	ПутиКДанным.Вставить("Сопоставление", ПутиКДанным.Получить(ДанныеСтруктурыФайла.Синонимы.Получить(РольДляСоответствия)))
	
КонецПроцедуры

// Процедура - устанавливает на текущее вложение СБИС пути к данным и синонимы сторон по их ролям
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - Структура, вложение в которое устанавливаем параметры
//  ДопПараметры - Структура	 - СоставПакета
//
&НаКлиенте
Процедура ВложениеСБИС_УстановитьИниЗагрузки_ПараметрыСторон(ВложениеСБИС, ДопПараметры)
	Перем ПутьКонтрагента;
	
	Функции_Модуль		= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	Файл_Шаблон_Модуль	= ПолучитьФормуОбработки("Файл_Шаблон");
	
	СтруктураФайла			= ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
	СтруктураИниФайла		= ВложениеСБИС_Получить(ВложениеСБИС, "УстановленныйПодразделИни");
	ДанныеСтруктурыФайла	= ВложениеСБИС_Получить(ВложениеСБИС, "ДанныеСтруктурыФайла");
	
	РолиПоИни	= Новый Соответствие;
	ПутиКДанным	= Новый Соответствие;

	РолиПоИни.Вставить("Контрагент",	Функции_Модуль.РассчитатьЗначение("Контрагент_Роль",	СтруктураИниФайла));
	РолиПоИни.Вставить("Организация",	Функции_Модуль.РассчитатьЗначение("Организация_Роль",	СтруктураИниФайла));
	РолиПоИни.Вставить("Сопоставление",	Функции_Модуль.РассчитатьЗначение("КонтрагентДляСопоставленияНоменклатуры_Роль", СтруктураИниФайла));
	
	КонтрагентРольЗначение	= РолиПоИни.Получить("Контрагент");
	ОрганизацияРольЗначение	= РолиПоИни.Получить("Организация");
	Если Не КонтрагентРольЗначение = Неопределено Тогда
		
		РолиПоИни.Вставить(КонтрагентРольЗначение,	"Контрагент");
		
	КонецЕсли;
	
	Если Не ОрганизацияРольЗначение = Неопределено Тогда
		
		РолиПоИни.Вставить(ОрганизацияРольЗначение,	"Организация");
		
	КонецЕсли;

	Если ВложениеСБИС.Свойство("НоменклатураКодКонтрагента") Тогда
		
		// Какой-то костыль, непонятно для чего оно нужно, совместимость.
		ПутьКонтрагента = Файл_Шаблон_Модуль.СтруктураФайла_Получить(СтруктураФайла, "ПутьКОсновнымДанным") + ВложениеСБИС.Получатель;
		ПутиКДанным.Вставить("Контрагент", ПутьКонтрагента)
		
	КонецЕсли;

	ВложениеСБИС_УстановитьИниЗагрузки_ЗаполнитьРоли(ВложениеСБИС, ПутиКДанным, РолиПоИни);
	
	Для Каждого КлючИЗначениеПуть Из ПутиКДанным Цикл
		
		Если КлючИЗначениеПуть.Значение = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		ДанныеСтруктурыФайла.Синонимы.Вставить(	КлючИЗначениеПуть.Ключ + "_ПутьКДанным", КлючИЗначениеПуть.Значение);
		ДанныеСтруктурыФайла.Поля.Вставить(	КлючИЗначениеПуть.Ключ,
											Функции_Модуль.РассчитатьЗначениеИзСтруктуры(КлючИЗначениеПуть.Значение, СтруктураФайла));
		
	КонецЦикла;
										
КонецПроцедуры

&НаКлиенте
Процедура ВложениеСБИС_УстановитьИниЗагрузки_РазделмДокумент(ВложениеСБИС, ПодобранныйИни, ДопПараметры)
	Перем  мДокументИзИни, ИниДокументВыбран;	

	СбисОбщиеФункции	= ПолучитьЗначениеПараметраСбис("ФункцииДокументов");
	
	Если ПодобранныйИни = Неопределено Тогда
		
		//Нет ини для загрузки
		ПараметрыОбновить = Новый ФиксированнаяСтруктура("Статус", "Не поддерживается");
		ВложениеСБИС_Обновить(ВложениеСБИС, ПараметрыОбновить, Новый ФиксированнаяСтруктура("Ини", Ложь));
		Возврат;
		
	ИначеЕсли Не ПодобранныйИни.Свойство("мДокумент", мДокументИзИни) Тогда
		
		// Ини есть, но в нем нет мДокумент
		ПараметрыОбновить = Новый ФиксированнаяСтруктура("Статус", "Не поддерживается");
		ВложениеСБИС_Обновить(ВложениеСБИС, ПараметрыОбновить, Новый ФиксированнаяСтруктура("Ини", Истина));
		Возврат;
		
	КонецЕсли;
	
	Если ДопПараметры.Свойство("ПодразделИни") Тогда
		
		ИмяПодразделИни = ДопПараметры.ПодразделИни;
		// Устанавливается конкретно указанный мДокумент
		Если Не мДокументИзИни.Свойство(ИмяПодразделИни, ИниДокументВыбран) Тогда
			
			СообщениеОшибки			= "В файле настроек " + ВложениеСБИС.ИмяИни + " отсутствует требуемый подраздел " + ИмяПодразделИни;
			ОшибкаВыбораНастройки	= НовыйСбисИсключение(, "МодульОбъектаКлиент.ВложениеСБИС_УстановитьИниЗагрузки", 779,, СообщениеОшибки);
			ВызватьИсключение(СбисИсключение_Представление(ОшибкаВыбораНастройки));
			
		КонецЕсли;

	Иначе
		
		ИмяПодразделИни		= ВложениеСБИС_УстановитьИниЗагрузки_ВыбратьПодразделИниПоУмолчанию(ВложениеСБИС, ПодобранныйИни, ДопПараметры);
		ИниДокументВыбран	= мДокументИзИни[ИмяПодразделИни];
				
	КонецЕсли;
	
	ВложениеСБИС.Вставить("СтруктураИниФайла", СбисОбщиеФункции.СбисСкопироватьОбъектНаКлиенте(ИниДокументВыбран));
	
КонецПроцедуры	

