
//Функция, в зависимости от выбранного действия, формирует параметры к отправке на сервис статистики
&НаКлиенте
Функция СтатистикаSABY_СформироватьДанныеСообщений(ПараметрыСтатистики, ДопПараметры = Неопределено)
    Результат = Новый Структура("Сообщения, Ошибки, Прикладная", Новый Массив, Новый Массив, Новый Массив);
    
    // Инициализация параметров
    Если Не ПараметрыСтатистики.Свойство("ИмяРеестра") Тогда
        ПараметрыСтатистики.Вставить("ИмяРеестра", ГлавноеОкно.Кэш.Текущий.ТипДок);
    КонецЕсли;
    
    Действие = ПараметрыСтатистики.Действие;
    
    // Выбор обработки в зависимости от действия
    Если Действие = "Отправка" Тогда
        СтатистикаSABY_ОбработатьОтправку(ПараметрыСтатистики, Результат);
        
    ИначеЕсли Действие = "Загрузка" Тогда
       СтатистикаSABY_ОбработатьЗагрузку(ПараметрыСтатистики, Результат);
	   
    ИначеЕсли Действие = "Ошибка" Тогда
        СтатистикаSABY_ОбработатьОшибку(ПараметрыСтатистики, Результат);
        
    ИначеЕсли Действие = "Обновление" Тогда
        СтатистикаSABY_ОбработатьОбновление(ПараметрыСтатистики, Результат);
        
    ИначеЕсли Действие = "Аутентификация" Тогда
        СтатистикаSABY_ОбработатьАутентификацию(ПараметрыСтатистики, Результат);
        
    ИначеЕсли Действие = "ПрикладнаяСтатистика" Тогда
        СтатистикаSABY_ОбработатьПрикладнуюСтатистику(ПараметрыСтатистики, Результат);
		
    КонецЕсли;
    
    Возврат Результат;
	
КонецФункции

#Область include_core2_vo2_МодульОбъекта_Клиент_СтатистикаSABY_СформироватьДанные_Отправка
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_СтатистикаSABY_СформироватьДанные_Загрузка
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_СтатистикаSABY_СформироватьДанные_Ошибка
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_СтатистикаSABY_СформироватьДанные_Обновление
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_СтатистикаSABY_СформироватьДанные_Аутентификация
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_СтатистикаSABY_СформироватьДанные_ПрикладнаяСтатистика
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_СтатистикаSABY_СформироватьДанные_Общее
#КонецОбласти

