
// Функция - возвращает имя формы без полного пути.
// 
// Возвращаемое значение:
//  Строка - краткое имя формы по метаданным
//
&НаКлиенте 
Функция НазваниеКратко() Экспорт
	
		Попытка
			
			ПолноеИмяФормы	= СтрЗаменить(ИмяФормы, ".", Символы.ПС);
			КраткоеИмяФормы	= СтрПолучитьСтроку(ПолноеИмяФормы, СтрЧислоСтрок(ПолноеИмяФормы));
			
		Исключение
			
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				
				//Делать через перебор метаданных.
				Для Каждого ФормаМетаданные Из Метаданные().Формы Цикл
					
					ФормаЗначение = МодульОбъектаКлиент().ПолучитьФормуОбработки(ФормаМетаданные.Имя);
					Если ФормаЗначение = ЭтаФорма Тогда
						
						КраткоеИмяФормы = ФормаМетаданные.Имя;
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
			#Иначе
				
				//На УФ не будет падать, свойство есть всегда.
				
			#КонецЕсли
				
		КонецПопытки;
	
	Возврат КраткоеИмяФормы;
	
КонецФункции	

