
&НаКлиенте
Функция СБИС_Аутентифицировать(Кэш, СтруктураПараметровЗапроса, ДопПараметрыВходящие, Отказ) Экспорт

	Если Не ЗначениеЗаполнено(СтруктураПараметровЗапроса.Логин) Тогда 
		
		ОшибкаАвторизации = МодульОбъектаКлиент().НовыйСбисИсключение(,
													МодульОбъектаКлиент().ПараметрSABY("ИнтеграцияИмя") + ".СБИС.Аутентифицировать",
													785,
													"Не указаны логин/пароль для авторизации");
		Отказ = Истина;
		Возврат ОшибкаАвторизации;
		
	КонецЕсли;
	
	ДопПараметры = Новый Структура("СообщатьПриОшибке, ЕстьРезультат, ИдСессии, АдресРесурса");
	ДопПараметры.СообщатьПриОшибке	= Ложь;
	ДопПараметры.ЕстьРезультат		= Истина;
	ДопПараметры.ИдСессии			= "";
	ДопПараметры.АдресРесурса		= "/auth/service/";

	ДопПараметры	= Новый Структура("СообщатьПриОшибке, ЕстьРезультат, ИдСессии, АдресРесурса, ОчиститьПараметры", Ложь, Истина, "", "/auth/service/", Истина);
	ИмяМетода		= "СБИС.Аутентифицировать";
	
	Возврат сбисОтправитьИОбработатьКоманду(Кэш, ИмяМетода, СтруктураПараметровЗапроса, ДопПараметры, Отказ);

КонецФункции

