
// функция получает поля адреса из json, лежащего в поле Значение в табличной части КонтактнаяИнформация
&НаКлиенте
Процедура ЗаполнитьДанныеАдресаИзJSON(АдресЗаписьЗначение, ПараметрыАдрес)
		
	Попытка
		
		АдресСтруктура = МестныйКэш.РаботаСJSON.СбисПрочитатьJSON(АдресЗаписьЗначение);
		
	Исключение
		
		// Адрес не JSON, пока пропустить.
		Возврат;
		
	КонецПопытки;

	Попытка
		
		ЗаполнитьДанныеАдресаИзJSON_Основное(АдресСтруктура, ПараметрыАдрес);
		ЗаполнитьДанныеАдресаИзJSON_Дом(АдресСтруктура, ПараметрыАдрес);
		ЗаполнитьДанныеАдресаИзJSON_Корпус(АдресСтруктура, ПараметрыАдрес);
		ЗаполнитьДанныеАдресаИзJSON_Квартира(АдресСтруктура, ПараметрыАдрес);
		
	Исключение
		
		ОшибкаЗаполненияАдреса = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "РаботаСДокументами1С.ЗаполнитьДанныеАдресаИзJSON");
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Представление(ОшибкаЗаполненияАдреса);
		
	КонецПопытки;

	ПараметрыАдрес.ЗаполненоЗначениеАдреса = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеАдресаИзJSON_Основное(АдресСтруктура, ПараметрыАдрес)
	
	// Страна
	Если АдресСтруктура.Свойство("countryCode") Тогда
		
		ПараметрыАдрес.КодСтраны = АдресСтруктура.countryCode;
		
	КонецЕсли;
	
	Если АдресСтруктура.Свойство("country") Тогда
		
		ПараметрыАдрес.НаимСтран = АдресСтруктура.country;
		
	КонецЕсли;
	
	// Индекс
	Если АдресСтруктура.Свойство("ZIPcode") Тогда
		
		ПараметрыАдрес.Индекс = АдресСтруктура.ZIPcode	
		
	КонецЕсли;  
	
	// Регион
	Если АдресСтруктура.Свойство("area") и АдресСтруктура.Свойство("areaType") Тогда
		
		ПараметрыАдрес.Регион = АдресСтруктура.area + " " + АдресСтруктура.areaType;
		
	КонецЕсли;
	
	// Район
	Если АдресСтруктура.Свойство("addressType") и Нрег(АдресСтруктура.addressType)="муниципальный" и АдресСтруктура.Свойство("munDistrict") и АдресСтруктура.Свойство("munDistrictType") Тогда
		
		ПараметрыАдрес.Район = АдресСтруктура.munDistrict + " " + АдресСтруктура.munDistrictType;
		
	ИначеЕсли АдресСтруктура.Свойство("District") и АдресСтруктура.Свойство("DistrictType") Тогда
		
		ПараметрыАдрес.Район = АдресСтруктура.District + " " + АдресСтруктура.DistrictType;
		
	КонецЕсли; 
	
	// Город/населенный пункт
	Если АдресСтруктура.Свойство("city") Тогда
		
		ПараметрыАдрес.Город = АдресСтруктура.city;	 
		Если АдресСтруктура.Свойство("cityType") и ЗначениеЗаполнено(АдресСтруктура.cityType) Тогда
			
			ПараметрыАдрес.Город = ПараметрыАдрес.Город + " " + АдресСтруктура.cityType;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если АдресСтруктура.Свойство("locality") и АдресСтруктура.Свойство("localityType") Тогда
		
		ПараметрыАдрес.НаселПункт = АдресСтруктура.locality + " " + АдресСтруктура.localityType;
		
	КонецЕсли; 
	
	// Улица
	Если АдресСтруктура.Свойство("street") Тогда
		
		ПараметрыАдрес.Улица = АдресСтруктура.street;
		Если АдресСтруктура.Свойство("streetType") и ЗначениеЗаполнено(АдресСтруктура.streetType) Тогда
			
			ПараметрыАдрес.Улица = ПараметрыАдрес.Улица + " " + АдресСтруктура.streetType;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если АдресСтруктура.Свойство("territory") и АдресСтруктура.Свойство("territoryType") Тогда
		
		ПараметрыАдрес.УлицаДопИнфо = АдресСтруктура.territory + " " + АдресСтруктура.territoryType;
		
		Если	Не ПустаяСтрока(ПараметрыАдрес.Улица)
			И	Не ПустаяСтрока(ПараметрыАдрес.УлицаДопИнфо) Тогда
			
			ПараметрыАдрес.Улица = ПараметрыАдрес.Улица + ", " + ПараметрыАдрес.УлицаДопИнфо;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	// ФИАС ИД
	Если АдресСтруктура.Свойство("houseId") Тогда
		
		ПараметрыАдрес.ФиасИд = АдресСтруктура.houseId;
		
	КонецЕсли;

КонецПроцедуры
	
&НаКлиенте
Процедура ЗаполнитьДанныеАдресаИзJSON_Дом(АдресСтруктура, ПараметрыАдрес)
	Перем ТипДомаПоJSON, НомерДомаПоJSON;
	
	Если	АдресСтруктура.Свойство("houseType",	ТипДомаПоJSON)
		И	АдресСтруктура.Свойство("houseNumber",	НомерДомаПоJSON) Тогда
		
		ТипДомаПоJSON = НРег(ТипДомаПоJSON);
		
		Если	ТипДомаПоJSON = "владение" Тогда		// владение
			
			ТипДомПодставить = "влд.";
			
		ИначеЕсли	ТипДомаПоJSON = "домовладение" Тогда	// домовладение
			
			ТипДомПодставить = "дмвлд.";
			
		ИначеЕсли	ТипДомаПоJSON = "гараж" Тогда			// гараж
			
			ТипДомПодставить = "гар.";
			
		ИначеЕсли	ТипДомаПоJSON = "здание" Тогда			// здание
			
			ТипДомПодставить = "зд.";
			
		ИначеЕсли	ТипДомаПоJSON = "шахта" Тогда			// шахта
			
			ТипДомПодставить = "шах."; 
			
		ИначеЕсли	ТипДомаПоJSON = "строение" Тогда		// строение
			
			ТипДомПодставить = "стр."; 

		ИначеЕсли	ТипДомаПоJSON = "подвал" Тогда			// подвал
			
			ТипДомПодставить = "подв."; 			
			
		ИначеЕсли	ТипДомаПоJSON = "котельная" Тогда		// котельная
			
			ТипДомПодставить = "кот."; 			

		ИначеЕсли	ТипДомаПоJSON = "погреб" Тогда			// погреб

			ТипДомПодставить = "п-б"; 			
			
		Иначе												// все остальное
			
			ТипДомПодставить = "";
			
		КонецЕсли;
		
		ЗаполнитьДанныеАдреса_Дом(ПараметрыАдрес, НомерДомаПоJSON, ТипДомПодставить)
		
	ИначеЕсли АдресСтруктура.Свойство("stead") И ЗначениеЗаполнено(АдресСтруктура.stead) Тогда
		
		ЗаполнитьДанныеАдреса_Дом(ПараметрыАдрес, АдресСтруктура.stead, "з/у")
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеАдресаИзJSON_Корпус(АдресСтруктура, ПараметрыАдрес)
	Перем ТипКорпусаПоJSON;

	Если	Не	АдресСтруктура.Свойство("buildings", ТипКорпусаПоJSON)
		Или	Не	ТипЗнч(ТипКорпусаПоJSON) = Тип("Массив") Тогда
		
		Возврат;
		
	КонецЕсли;
		
	Для Каждого КорпусСтруктура Из ТипКорпусаПоJSON Цикл
		
		ПараметрыАдрес.ТипКорпуса	= Нрег(КорпусСтруктура.type);
		КорпусСокращение			= "";
		
		Если		ПараметрыАдрес.ТипКорпуса = "корпус" Тогда
			
			КорпусСокращение = "корп.";
			
		ИначеЕсли	ПараметрыАдрес.ТипКорпуса = "участок" Тогда
			
			КорпусСокращение = "уч.";
			
		ИначеЕсли	ПараметрыАдрес.ТипКорпуса = "строение" Тогда
			
			КорпусСокращение = "стр.";
			
		ИначеЕсли	ПараметрыАдрес.ТипКорпуса = "сооружение" Тогда
			
			КорпусСокращение = "соор.";
			
		ИначеЕсли	ПараметрыАдрес.ТипКорпуса = "литера"
				Или	ПараметрыАдрес.ТипКорпуса = "литер" Тогда   // литера или литер
				
			КорпусСокращение = "лит.";
				
		ИначеЕсли	ПараметрыАдрес.ТипКорпуса = "подвал" Тогда
			
			КорпусСокращение = "подв.";
			
		ИначеЕсли	ПараметрыАдрес.ТипКорпуса = "котельная" Тогда
			
			КорпусСокращение = "кот.";

		ИначеЕсли	ПараметрыАдрес.ТипКорпуса = "погреб" Тогда
			
			КорпусСокращение = "п-б";
			
		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
		ЗаполнитьДанныеАдреса_Корпус(ПараметрыАдрес, КорпусСтруктура.number, КорпусСокращение);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеАдресаИзJSON_Квартира(АдресСтруктура, ПараметрыАдрес)
	Перем ТипКвартирыПоJSON;
	
	Если	Не АдресСтруктура.Свойство("apartments", ТипКвартирыПоJSON)
		Или	Не ТипЗнч(ТипКвартирыПоJSON) = Тип("Массив") Тогда
		
		Возврат;
		
	КонецЕсли;
		
	Для Каждого КвартираСтруктура Из ТипКвартирыПоJSON Цикл
		
		ПараметрыАдрес.ТипКвартиры = Нрег(КвартираСтруктура.type);
		
		Если ПараметрыАдрес.ТипКвартиры = "квартира" Тогда
			
			КвартираСокр = "кв.";
			
		ИначеЕсли ПараметрыАдрес.ТипКвартиры = "помещение" Тогда
			
			КвартираСокр = "пом.";
			
		ИначеЕсли ПараметрыАдрес.ТипКвартиры = "офис" Тогда
			
			КвартираСокр = "оф.";
			
		ИначеЕсли ПараметрыАдрес.ТипКвартиры = "бокс" Тогда
			
			КвартираСокр = "бокс.";
			
		ИначеЕсли ПараметрыАдрес.ТипКвартиры = "комната" Тогда
			
			КвартираСокр = "ком.";
			
		ИначеЕсли ПараметрыАдрес.ТипКвартиры = "этаж" Тогда
			
			КвартираСокр = "эт.";
			
		ИначеЕсли ПараметрыАдрес.ТипКвартиры = "а/я" Тогда
			
			КвартираСокр = "а/я";
			
		ИначеЕсли ПараметрыАдрес.ТипКвартиры = "в/ч" Тогда
			
			КвартираСокр = "в/ч";
			
		ИначеЕсли ПараметрыАдрес.ТипКвартиры = "п/о" Тогда
			
			КвартираСокр = "п/о";
			
		Иначе
			
			КвартираСокр = "";
			
		КонецЕсли;
		
		ЗаполнитьДанныеАдреса_Квартира(ПараметрыАдрес, КвартираСтруктура.number, КвартираСокр);
		
	КонецЦикла;

КонецПроцедуры

