
// функция получает поля адреса из json, лежащего в поле Значение в табличной части КонтактнаяИнформация
&НаКлиенте
Процедура ЗаполнитьДанныеАдресаИзXML(АдресЗаписьЗначение, ПараметрыАдрес)
		
	Попытка
		
		АдресСтруктура = ЗаполнитьСтруктуруФайла(АдресЗаписьЗначение);
		
	Исключение
		
		// Адрес не JSON, пока пропустить.
		Возврат;
		
	КонецПопытки;

	ЗначениеСостав = АдресСтруктура;
	Если	ЗначениеСостав.Свойство("КонтактнаяИнформация",	ЗначениеСостав) 
		И	ЗначениеСостав.Свойство("Состав",				ЗначениеСостав)
		И	ЗначениеСостав.Свойство("Состав",				ЗначениеСостав) // Да, два раза.
		И	ТипЗнч(ЗначениеСостав) = Тип("Структура") Тогда
		
		Если ЗначениеСостав.Свойство("ДопАдрЭл") Тогда
			
			Для Каждого АдрЭл Из ЗначениеСостав.ДопАдрЭл Цикл
				
				Если АдрЭл.Свойство("ТипАдрЭл") и АдрЭл.Свойство("Значение") Тогда
					
					Если АдрЭл.ТипАдрЭл = "10100000" Тогда
						
						ПараметрыАдрес.Индекс = АдрЭл.Значение;
						
					ИначеЕсли	АдрЭл.ТипАдрЭл	= "10200000" // Адресная точка
							Или	АдрЭл.ТипАдрЭл	= "10300000" // Садовое товарищество
							Или	АдрЭл.ТипАдрЭл	= "10400000" // Элемент улично-дорожной сети, планировочной структуры дополнительного адресного элемента
							Или	АдрЭл.ТипАдрЭл	= "10500000" // Промышленная зона
							Или	АдрЭл.ТипАдрЭл	= "10600000" // Гаражно-строительный кооператив
							Или	АдрЭл.ТипАдрЭл	= "10700000" // Территория
							Тогда							

							//Уже должно быть обработанное поле с сокращенным названием типа.
						ПараметрыАдрес.УлицаДопИнфо = ПараметрыАдрес.УлицаДопИнфо + ?(ПустаяСтрока(ПараметрыАдрес.УлицаДопИнфо), "", ",") + АдрЭл.Значение;
						
					КонецЕсли;
					
				Иначе
					
					ЗаполнитьДанныеАдресаИзXML_ДомКорпусКвартира(АдрЭл, ПараметрыАдрес)
					
				КонецЕсли;
					
			КонецЦикла;
		КонецЕсли;
		
		ПараметрыАдрес.Город		= ПолучитьПараметрАдресаУП(ЗначениеСостав, "Город");
		ПараметрыАдрес.Регион		= ПолучитьПараметрАдресаУП(ЗначениеСостав, "СубъектРФ");
		ПараметрыАдрес.НаселПункт	= ПолучитьПараметрАдресаУП(ЗначениеСостав, "НаселПункт");
		ПараметрыАдрес.Улица		= ПолучитьПараметрАдресаУП(ЗначениеСостав, "Улица");			
		
		Если ЗначениеСостав.Свойство("СвРайМО") Тогда
			
			Район = ПолучитьПараметрАдресаУП(ЗначениеСостав.СвРайМО, "Район");
			
		КонецЕсли;
		
		Если	Не ПустаяСтрока(ПараметрыАдрес.Улица)
			И	Не ПустаяСтрока(ПараметрыАдрес.УлицаДопИнфо) Тогда
			
			ПараметрыАдрес.Улица = ПараметрыАдрес.Улица + ", " + ПараметрыАдрес.УлицаДопИнфо;
			
		КонецЕсли;	
		
	ИначеЕсли ТипЗнч(ЗначениеСостав) = Тип("Строка") Тогда	 // иностранный адрес
		
		Попытка
			
			КодСтраны = ПолучитьКодСтраныПоНазванию(АдресСтруктура.КонтактнаяИнформация.Состав.Страна);
			НаимСтран = АдресСтруктура.КонтактнаяИнформация.Состав.Страна;
			
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
	ПараметрыАдрес.ЗаполненоЗначениеАдреса = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеАдресаИзXML_ДомКорпусКвартира(АдресСтруктура, ПараметрыАдрес)
	Перем ДомТипПоXML, ДомКорпусКвартираЗначениеXML;
	
	Если	Не	АдресСтруктура.Свойство("Номер")
		Или	Не	АдресСтруктура.Номер.Свойство("Тип",		ДомТипПоXML)
		Или	Не	АдресСтруктура.Номер.Свойство("Значение",	ДомКорпусКвартираЗначениеXML) Тогда
		
		Возврат
		
	КонецЕсли;
	
	Если		ДомТипПоXML = "1010" Тогда
		
		ЗаполнитьДанныеАдреса_Дом(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML);
		
	ИначеЕсли	ДомТипПоXML = "1015" Тогда	// Подвал
		
		ЗаполнитьДанныеАдреса_Корпус(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "подв.");
		
	ИначеЕсли	ДомТипПоXML = "1016" Тогда	// Котельная
		
		ЗаполнитьДанныеАдреса_Корпус(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "кот.");
		
	ИначеЕсли	ДомТипПоXML = "1017" Тогда	// Погреб

		ЗаполнитьДанныеАдреса_Корпус(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "п-б");

	ИначеЕсли	ДомТипПоXML = "1020" Тогда	// владение
		
		ЗаполнитьДанныеАдреса_Дом(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "влд.");
		
	ИначеЕсли	ДомТипПоXML = "1030" Тогда	// домовладение
		
		ЗаполнитьДанныеАдреса_Дом(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "дмвлд.");
		
	ИначеЕсли	ДомТипПоXML = "1034" Тогда	// гараж
		
		ЗаполнитьДанныеАдреса_Дом(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "гар.");
		
	ИначеЕсли	ДомТипПоXML = "1036" Тогда	// здание
		
		ЗаполнитьДанныеАдреса_Дом(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "зд.");
		
	ИначеЕсли	ДомТипПоXML = "1038" Тогда	// шахта
		
		ЗаполнитьДанныеАдреса_Дом(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "шах.");
		
	ИначеЕсли	ДомТипПоXML = "1050"
			Или	ДомТипПоXML = "1014" Тогда	// корпус
		
		ЗаполнитьДанныеАдреса_Корпус(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "корп.");
		
	ИначеЕсли	ДомТипПоXML = "1040" Тогда	// участок
		
		ЗаполнитьДанныеАдреса_Корпус(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "уч.");
		
	ИначеЕсли	ДомТипПоXML = "1060"
			Или	ДомТипПоXML = "1011" Тогда	// Строение
			
		ЗаполнитьДанныеАдреса_Корпус(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "стр.");
		
	ИначеЕсли	ДомТипПоXML = "1070"
			Или	ДомТипПоXML = "1012" Тогда	// Сооружение
		
		ЗаполнитьДанныеАдреса_Корпус(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "соор.");

	ИначеЕсли	ДомТипПоXML = "1080"
			Или	ДомТипПоXML = "1090"
			Или	ДомТипПоXML = "1013" Тогда 	// литера или литер  
		
		ЗаполнитьДанныеАдреса_Корпус(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "лит.");
		
	ИначеЕсли	ДомТипПоXML = "2010" Тогда
		
		ЗаполнитьДанныеАдреса_Квартира(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "кв.");
		
	ИначеЕсли	ДомТипПоXML = "2020" Тогда
		
		ЗаполнитьДанныеАдреса_Квартира(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "пом.");
		
	ИначеЕсли	ДомТипПоXML = "2030" Тогда
		
		ЗаполнитьДанныеАдреса_Квартира(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "оф.");
		
	ИначеЕсли	ДомТипПоXML = "2040" Тогда
		
		ЗаполнитьДанныеАдреса_Квартира(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "бокс.");
		
	ИначеЕсли	ДомТипПоXML = "2050" Тогда
		
		ЗаполнитьДанныеАдреса_Квартира(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "ком.");
		
	ИначеЕсли	ДомТипПоXML = "2060" Тогда
		
		ЗаполнитьДанныеАдреса_Квартира(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "эт.");
		
	ИначеЕсли	ДомТипПоXML = "2070" Тогда
		
		ЗаполнитьДанныеАдреса_Квартира(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "а/я");
		
	ИначеЕсли	ДомТипПоXML = "2080" Тогда
		
		ЗаполнитьДанныеАдреса_Квартира(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "в/ч");
		
	ИначеЕсли	ДомТипПоXML = "2090" Тогда
		
		ЗаполнитьДанныеАдреса_Квартира(ПараметрыАдрес, ДомКорпусКвартираЗначениеXML, "п/о");
		
	КонецЕсли;

КонецПроцедуры

