
// функция получает поля адреса из json, лежащего в поле Значение в табличной части КонтактнаяИнформация
&НаКлиенте
Процедура ЗаполнитьДанныеАдресаИзСтроки(АдресЗаписьЗначение, ПараметрыАдрес)
		
	сч = 1;
	Пока сч <= СтрЧислоСтрок(АдресЗаписьЗначение) Цикл
		
		ЭлементАдреса = СтрПолучитьСтроку(АдресЗаписьЗначение, сч);
		сч = сч+1;
		
		Если Найти(нрег(ЭлементАдреса), "индекс=") Тогда
			
			ПараметрыАдрес.Индекс = Сред(ЭлементАдреса, 8);
			
		ИначеЕсли Найти(нрег(ЭлементАдреса), "кодрегиона=") Тогда
			
			ПараметрыАдрес.КодРегион = Сред(ЭлементАдреса, 12);
			
		ИначеЕсли Найти(нрег(ЭлементАдреса), "регион=") Тогда
			
			ПараметрыАдрес.Регион = Сред(ЭлементАдреса, 8);
			
		ИначеЕсли Найти(нрег(ЭлементАдреса), "район=") Тогда
			
			ПараметрыАдрес.Район = Сред(ЭлементАдреса, 7);
			
		ИначеЕсли Найти(нрег(ЭлементАдреса), "город=") Тогда
			
			ПараметрыАдрес.Город = Сред(ЭлементАдреса, 7);
			
		ИначеЕсли Найти(нрег(ЭлементАдреса), "населенныйпункт=") Тогда
			
			ПараметрыАдрес.НаселПункт = Сред(ЭлементАдреса, 17);
			
		ИначеЕсли Найти(нрег(ЭлементАдреса), "улица=") Тогда
			
			ПараметрыАдрес.Улица = Сред(ЭлементАдреса, 7);
			
		ИначеЕсли Найти(нрег(ЭлементАдреса), "дом=") Тогда
			
			ПараметрыАдрес.Дом = Сред(ЭлементАдреса, 5);
			
		ИначеЕсли Найти(нрег(ЭлементАдреса), "корпус=") Тогда
			
			ПараметрыАдрес.Корпус = Сред(ЭлементАдреса, 8);
			
		ИначеЕсли Найти(нрег(ЭлементАдреса), "квартира=") Тогда
			
			ПараметрыАдрес.Квартира = Сред(ЭлементАдреса, 10);
			
		ИначеЕсли Найти(нрег(ЭлементАдреса), "кодстраны=") Тогда
			
			ПараметрыАдрес.КодСтраны = Сред(ЭлементАдреса, 11);
			
		ИначеЕсли Найти(нрег(ЭлементАдреса), "страна=") Тогда
			
			ПараметрыАдрес.НаимСтран = Сред(ЭлементАдреса, 8);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры
		
