
&НаКлиенте
Функция сбисСтруктураАдрИно(КодСтраны, Представление, НаимСтран = "") Экспорт
	
	АдрИно = Новый Структура;
	АдрИно.Вставить("КодСтр",?(ЗначениеЗаполнено(КодСтраны), КодСтраны, "643"));
	АдрИно.Вставить("НаимСтран",?(ЗначениеЗаполнено(НаимСтран), НаимСтран, "Российская Федерация"));
	АдрИно.Вставить("АдрТекст", Представление);
	Возврат АдрИно;
	
КонецФункции

&НаКлиенте
Функция сбисСтруктураАдрРФ(ПараметрыАдрес)

	АдрСтрук = Новый Структура;
	
	сбисПроверитьПолеАдреса(АдрСтрук, "Индекс",		ПараметрыАдрес.Индекс,		6);
	сбисПроверитьПолеАдреса(АдрСтрук, "КодРегион",	ПараметрыАдрес.КодРегион,	2);
	сбисПроверитьПолеАдреса(АдрСтрук, "НаимРегион",	ПараметрыАдрес.Регион,		50);
	сбисПроверитьПолеАдреса(АдрСтрук, "Район",		ПараметрыАдрес.Район,		50);
	сбисПроверитьПолеАдреса(АдрСтрук, "Город",		ПараметрыАдрес.Город,		50);
	сбисПроверитьПолеАдреса(АдрСтрук, "НаселПункт",	ПараметрыАдрес.НаселПункт,	50);
	сбисПроверитьПолеАдреса(АдрСтрук, "Улица",		ПараметрыАдрес.Улица,		50);
	сбисПроверитьПолеАдреса(АдрСтрук, "Дом",		ПараметрыАдрес.Дом,			20);
	сбисПроверитьПолеАдреса(АдрСтрук, "Корпус",		ПараметрыАдрес.Корпус,		20);
	сбисПроверитьПолеАдреса(АдрСтрук, "Кварт",		ПараметрыАдрес.Квартира,	20);
	
	Возврат АдрСтрук;
	
КонецФункции

// функция получает поля адреса из json, лежащего в поле Значение в табличной части КонтактнаяИнформация
&НаКлиенте
Процедура ЗаполнитьДанныеАдреса_Корпус(ПараметрыАдрес, КорпусЗаписьЗначение, КорпусЗаписьСокр)
	
	ПараметрыАдрес.Корпус = ПараметрыАдрес.Корпус + КорпусЗаписьСокр + " " + Строка(КорпусЗаписьЗначение) + ",";	

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеАдреса_Дом(ПараметрыАдрес, ДомЗаписьЗначение, ДомЗаписьСокр = "")
	
	ШаблонДом			= "{СтрШаблон}" + Строка(ДомЗаписьЗначение);
	ДомЗаписьВШаблон	= ДомЗаписьСокр;
	Если Не ДомЗаписьВШаблон = "" Тогда
		
		ДомЗаписьВШаблон = ДомЗаписьВШаблон + " ";
		
	КонецЕсли;
	
	ПараметрыАдрес.Дом = МодульОбъектаКлиент().ПрименитьФорматКСтроке(ШаблонДом, ДомЗаписьВШаблон);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеАдреса_Квартира(ПараметрыАдрес, КвартираЗаписьЗначение, КвартираЗаписьСокр = "")
	
	КвартираЗаписьШаблон	= СокрЛП(КвартираЗаписьСокр);
	Если ЗначениеЗаполнено(КвартираЗаписьШаблон) Тогда
		
		Если Не	Прав(КвартираЗаписьШаблон, 1) = "." Тогда
		 
			// Если не заканчивается на ".", то добавить пробел для отображения 
			КвартираЗаписьШаблон = КвартираЗаписьШаблон + " "
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ПараметрыАдрес.Квартира) Тогда
		
		// В квартире уже что-то есть, пробел понадобится для разделения
		КвартираЗаписьШаблон = " ";
		
	КонецЕсли;
	
	ПараметрыАдрес.Квартира = ПараметрыАдрес.Квартира + КвартираЗаписьШаблон + Строка(КвартираЗаписьЗначение) + ",";
	
КонецПроцедуры

