
&НаКлиенте
Процедура WriteDocumentEx_Before_Call(РезультатВызова, ПараметрыВызова) Экспорт
	
	ИдентификаторОтправки	= МодульОбъектаКлиент().АсинхроннаяСбискоманда_Получить(ПараметрыВызова.Команда, "Идентификатор");
	ВремяНачала				= МодульОбъектаКлиент().ПолучитьДатуВМиллисекундах();
	ДетализацияВызова		= Новый Структура("ДатНач, ВремяНачала, ВремяВыполнения", ВремяНачала, ТекущаяДата());
	ПараметрыВызова.Кэш.РезультатОтправки.ДетализацияОтправки.Вставить(ИдентификаторОтправки, ДетализацияВызова);
	
КонецПроцедуры	
	
&НаКлиенте
Процедура WriteDocumentEx_After_Call(РезультатВызова, ПараметрыВызова) Экспорт

	Кэш						= ПараметрыВызова.Кэш;
	ИдентификаторОтправки	= МодульОбъектаКлиент().АсинхронноеСбисСобытие_Получить(РезультатВызова, "Идентификатор");
	Отправка_ДобавитьСтатусВРезультатПоПакету(Кэш, ИдентификаторОтправки,		ПараметрыВызова.СоставПакета);
	// складываем сюда пакеты, чтобы можно было переотправить. После получения ответов - чистим, чтобы не переполнилась память
	Кэш.РезультатОтправки.СформированныеПакеты.Вставить(ИдентификаторОтправки,	ПараметрыВызова.СоставПакета); 
	
КонецПроцедуры

//Обработка события успешной отправки пакета
&НаКлиенте
Процедура WriteDocumentEx_Message(РезультатВызова, ПараметрыОбработки) Экспорт
	Кэш = ПараметрыОбработки.Кэш;
	КомандаВызова = ПараметрыОбработки.Команда;
	ИдентификаторОтправки	= МодульОбъектаКлиент().АсинхроннаяСбискоманда_Получить(КомандаВызова, "Идентификатор");
	
	Если Кэш.РезультатОтправки.Свойство("НефатальныеОшибкиПодряд") Тогда
		Кэш.РезультатОтправки.НефатальныеОшибкиПодряд = 0;
	КонецЕсли;
	
	Кэш.РезультатОтправки.НаЗаписьСтатусов.Ответы.Вставить(ИдентификаторОтправки, РезультатВызова);
	Кэш.РезультатОтправки.СформированныеПакеты.Удалить(ИдентификаторОтправки);
	
	Отправка_ВремяОтправки(Кэш, ИдентификаторОтправки);
КонецПроцедуры

//Обработка события ошибки отправки когда все сломалось
&НаКлиенте
Процедура WriteDocumentEx_FatalError(РезультатВызова, ПараметрыОбработки) Экспорт
	
	Попытка
		WriteDocumentEx_Error(РезультатВызова, ПараметрыОбработки);
	Исключение
		МодульОбъектаКлиент().СбисСообщить(ИнформацияОбОшибке(), "ExtSDK.WriteDocumentEx_FatalError");
	КонецПопытки;
	
	ИдентификаторОтправки	= МодульОбъектаКлиент().АсинхроннаяСбискоманда_Получить(ПараметрыОбработки.Команда, "Идентификатор");
	
	ПараметрыОбработки.Кэш.РезультатОтправки.ДетализацияОтправки.Удалить(ИдентификаторОтправки);
	ПараметрыОбработки.Кэш.РезультатОтправки.ПолученоОтветов = ПараметрыОбработки.Кэш.РезультатОтправки.ПолученоОтветов + 1;
	
КонецПроцедуры

//Обработка события ошибки отправки
&НаКлиенте
Процедура WriteDocumentEx_Error(РезультатВызова, ПараметрыОбработки) Экспорт
	Кэш						= ПараметрыОбработки.Кэш;
	КомандаВызова			= ПараметрыОбработки.Команда;
	ИдентификаторОтправки	= МодульОбъектаКлиент().АсинхроннаяСбискоманда_Получить(КомандаВызова, "Идентификатор");
	
	Отправка_ОбработатьОшибкуОтправки(Кэш, КомандаВызова, Кэш.ОбщиеФункции.СбисИсключение(РезультатВызова,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".WriteDocumentEx2_Error"));
	Отправка_ВремяОтправки(Кэш, ИдентификаторОтправки);
КонецПроцедуры

//Обработка события разрыва соединения с плагином
&НаКлиенте
Процедура Disconnected(РезультатВызова, ПараметрыОбработки) Экспорт
	Кэш = ПараметрыОбработки.Основные.Кэш;
	Кэш.СБИС.ОбменВключен = Ложь;
	Если Кэш.Свойство("РезультатОтправки") Тогда
		Кэш.РезультатОтправки.Вставить("ПрерватьОтправку", РезультатВызова.Данные.details);
	КонецЕсли;
	Кэш.ГлавноеОкно.СбисСообщитьОбОшибке(Кэш, РезультатВызова.Данные);
	//Сообщить("Disconnect");
КонецПроцедуры

//Обработка события разрыва соединения с плагином
&НаКлиенте
Процедура UnValidToken(РезультатВызова, ПараметрыОбработки) Экспорт
    
	Кэш				= ПараметрыОбработки.Основные.Кэш;
	ПотокиЗапущены	= Новый Массив;
	Для Каждого Сбис3КомандОжидается Из Кэш.СБИС.ДанныеИнтеграции.Потоки Цикл
		ПотокиЗапущены.Добавить(Сбис3КомандОжидается.Ключ);
	КонецЦикла;
	Для Каждого ПотокЗапущенИд ИЗ ПотокиЗапущены Цикл
		СБИСПлагин_ОсвободитьПоток(Кэш, Новый Структура("Идентификатор,Тип,Ответ",ПотокЗапущенИд, РезультатВызова.Тип, РезультатВызова.Данные));
	КонецЦикла;
	
КонецПроцедуры

