
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

&НаКлиенте
Процедура ПропатчитьСтруктуруВложения(ВложениеСБИС, ДопПараметры) Экспорт
	
	УдаляемыеУзлы = Новый Массив;
	УдаляемыеУзлы.Добавить("Файл.Документ.Покупатель.Адрес.АдрРФ.НаимРегион");
	УдаляемыеУзлы.Добавить("Файл.Документ.Поставщик.Адрес.АдрРФ.НаимРегион");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузоотправитель.Адрес.АдрРФ.НаимРегион");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузополучатель.Адрес.АдрРФ.НаимРегион");

	УдаляемыеУзлы.Добавить("Файл.Документ.Покупатель.Адрес.АдрИно.НаимСтран");
	УдаляемыеУзлы.Добавить("Файл.Документ.Поставщик.Адрес.АдрИно.НаимСтран");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузоотправитель.Адрес.АдрИно.НаимСтран");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузополучатель.Адрес.АдрИно.НаимСтран");
	
	УдаляемыеУзлы.Добавить("Файл.Документ.Покупатель.Адрес.ФиасИд");
	УдаляемыеУзлы.Добавить("Файл.Документ.Поставщик.Адрес.ФиасИд");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузоотправитель.Адрес.ФиасИд");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузополучатель.Адрес.ФиасИд");

	МодульОбъектаКлиент().ВложениеСБИС_УдалитьУзлыИзСтруктурыДанных(ВложениеСБИС, УдаляемыеУзлы);

КонецПроцедуры

&НаКлиенте
Функция ИсточникДанных_ПолучитьДанныеСтороныПоИмени(Кэш, Вложение, ИмяСтороны) Экспорт
	
	КлючСтороны = ИмяСтороны;
	Если		ИмяСтороны = "Получатель" Тогда
		КлючСтороны = "Поставщик";
	ИначеЕсли	ИмяСтороны = "Отправитель" Тогда
		КлючСтороны = "Покупатель";
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
	
	Возврат Вложение.СтруктураДокумента.Файл.Документ[КлючСтороны];	
	
КонецФункции                            

&НаКлиенте
Процедура СформироватьОснование(Док, Кэш) Экспорт

	МодульФайл_Шаблон = МодульОбъектаКлиент().ПолучитьФормуОбработки("Файл_Шаблон");
	Док.Файл.Документ.Вставить("Основание", МодульФайл_Шаблон.СформироватьОснование_Общее(Док));
	
КонецПроцедуры  

// Функция - формирует структура табличной части файла
//
// Параметры:
//  Кэш		 - Структура - Кэш обработки
//  Контекст - Структура - Структура рассчета
// 
// Возвращаемое значение:
//  Структура - результат работы функции
//
&НаКлиенте
Функция ПолучитьТабличнуюЧастьДокумента1С(Кэш, Контекст) Экспорт  
	
	Контекст.Вставить("СохранятьСсылки", Ложь);
	Возврат МодульОбъектаКлиент().ПолучитьФормуОбработки("Файл_Шаблон").ПолучитьТабличнуюЧастьДокумента1С(Кэш, Контекст);
	
КонецФункции
