
&НаКлиенте
Перем Файл_Шаблон;

#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти  

&НаКлиенте
Процедура СформироватьДокументДляГенератора(ПараметрыФормированияВходящие, Кэш) Экспорт 
	
	фрм = МодульОбъектаКлиент().ПолучитьФормуОбработки("Файл_УпдСчфДоп_3_01"); 
	фрм.СформироватьДокументДляГенератора(ПараметрыФормированияВходящие, Кэш);
	
	ТекДокумент = ПараметрыФормированияВходящие.Документ.Файл.Документ; 
	
	ТекДокумент.Вставить("Тип", "ДОП");

КонецПроцедуры 
	
// Процедура заполняет данные документа по его параметрам
//
// Параметры:
//  Док	 - Структура - Контекст рассчитываемого документа
//  Кэш	 - Структура - Кэш обработки
//
&НаКлиенте
Процедура ЗаполнитьПоДокументПараметр(Док, Кэш) Экспорт  
	
	Файл_Шаблон = Кэш.ГлавноеОкно.сбисПолучитьФорму("Файл_Шаблон");
	Файл_Шаблон.ЗаполнитьПоДокументПараметр(Док, Кэш);
	
	ТекДокумент = Док.Файл.Документ; 

	Если НЕ ТекДокумент.Свойство("Параметр") Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого ТекСтрока ИЗ ТекДокумент.Параметр Цикл

		Если ТекСтрока.Имя = "СвПерВещ" Тогда
			
			ТекДокумент.Вставить(ТекСтрока.Имя, ТекСтрока.Значение);
			
		КонецЕсли;  
		
		Если ТекСтрока.Имя = "ОбстФормСЧФ" Тогда
			
			ТекДокумент.Вставить("СпОбстФДОП", ТекСтрока.Значение); 
				
		КонецЕсли;
		
		Если ТекСтрока.Имя = "РабОргПрод_Должность" Тогда
			
			ЗаполнитьРаботникОрганизацииПродавца(ТекДокумент, "Должность", ТекСтрока.Значение); 
				
		КонецЕсли;   
		
		Если ТекСтрока.Имя = "РабОргПрод_ФИО" Тогда
			
			ЗаполнитьРаботникОрганизацииПродавца(ТекДокумент, "ФИО", ТекСтрока.Значение); 
				
		КонецЕсли;   
		
		Если Найти("СодОпер#НаимЭконСубСост", ТекСтрока.Имя) Тогда
	
			ТекДокумент.Вставить(ТекСтрока.Имя, ТекСтрока.Значение);
			
		КонецЕсли;
	
    КонецЦикла;
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьРаботникОрганизацииПродавца(ТекДокумент, КлючПараметра, ЗначениеПараметра) 
	
	фрм = МодульОбъектаКлиент().ПолучитьФормуОбработки("Файл_УпдСчфДоп_3_01"); 
	фрм.ЗаполнитьРаботникОрганизацииПродавца(ТекДокумент, КлючПараметра, ЗначениеПараметра);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДокументОснование(Док, Кэш) Экспорт
	
	Файл_Шаблон = Кэш.ГлавноеОкно.сбисПолучитьФорму("Файл_Шаблон");
	Файл_Шаблон.ЗаполнитьПоДокументОснование(Док, Кэш);
	
	ТекДокумент = Док.Файл.Документ;
		
	НаимДокОтгр = "Передаточный документ";
	Для каждого Основание Из ТекДокумент.Основание Цикл
		Если Основание.Свойство("НаимДокОтгр")
			И ЗначениеЗаполнено(Основание.НаимДокОтгр) Тогда
			
			НаимДокОтгр = Основание.НаимДокОтгр;
			Прервать;
			
		КонецЕсли;
	КонецЦикла;

	Если Не ТекДокумент.Свойство("ДокПодтвОтгр") Тогда
		
		ТекДокумент.Вставить("ДокПодтвОтгр", Новый Структура());
		ТекДокумент.ДокПодтвОтгр.Вставить("ДатаДокОтгр", ТекДокумент.Дата);
		ТекДокумент.ДокПодтвОтгр.Вставить("НомДокОтгр",  ТекДокумент.Номер);
		ТекДокумент.ДокПодтвОтгр.Вставить("НаимДокОтгр", НаимДокОтгр);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОснование(Док, Кэш) Экспорт
	
	ТекДокумент = Док.Файл.Документ;
	Если НЕ ТекДокумент.Свойство("Основание") Тогда
		Возврат;	
	КонецЕсли;
	
	Исключения = ПолучитьИсключенияОснование();
	ОснованиеМассив = Новый Массив;
	
	Для Каждого ТекСтрока ИЗ ТекДокумент.Основание Цикл
		
		Если ТекСтрока.Свойство("Тип") Тогда
			Ключ = "Тип";	
		Иначе
			Ключ = "Название";	
		КонецЕсли;
		
		Если Исключения.Получить(ТекСтрока[Ключ]) = Истина Тогда
			Продолжить;	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Название) Тогда
			Продолжить;	
		КонецЕсли;
		
		Если НЕ ТекСтрока.Свойство("Дата") Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Дата) И ТекСтрока.Название <> "-" Тогда
			Продолжить;	
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Номер) Тогда
			ТекСтрока.Номер = "Без номера";
		КонецЕсли;
		
		Основание = Новый Структура("Номер, Название, Дата");
		Основание.Название 	= ТекСтрока.Название;
		Основание.Номер 	= ТекСтрока.Номер;
		Основание.Дата 		= ТекСтрока.Дата;
		
		ОснованиеМассив.Добавить(Основание);
		
	КонецЦикла;
	
	ЕстьОснование = ОснованиеМассив.Количество();
	
	Если НЕ ЕстьОснование Тогда
		
		ТекДокумент.Вставить("БезДокОснПер", "1");
		
	КонецЕсли;
	
	ТекДокумент.Вставить("Основание", ОснованиеМассив);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИсключенияОснование()
	
	ИсключенияИнфПол = Новый Соответствие;
	ИсключенияИнфПол.Вставить("ПРД", Истина);
	ИсключенияИнфПол.Вставить("СчФ", Истина);
	ИсключенияИнфПол.Вставить("КСчФ", Истина);
	ИсключенияИнфПол.Вставить("ИспрСчФ", Истина);
	ИсключенияИнфПол.Вставить("ИсхСчФ", Истина);
	ИсключенияИнфПол.Вставить("ИспрИсхСчФ", Истина);
	ИсключенияИнфПол.Вставить("ДокПодтвОтгр", Истина);
	
	Возврат ИсключенияИнфПол;
	
КонецФункции

//Штатный обработчик строки подстановки
&НаКлиенте
Процедура ОбработчикДанных_ЗаполнитьСтрокуТабличнойЧастиДокумента(Аргумент, ДопПараметры) Экспорт
	
	Файл_Шаблон = ДопПараметры.Кэш.ГлавноеОкно.сбисПолучитьФорму("Файл_Шаблон");
	
	Файл_Шаблон.ОбработчикДанных_ЗаполнитьСтрокуТабличнойЧастиДокумента	(Аргумент, ДопПараметры);
	Файл_Шаблон.УстановитьПризнакДобавленияСтроки						(Аргумент, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНоменклатуруВложения(Кэш, Контекст) Экспорт
	
	ФормаФайл = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ОбновитьНоменклатуруВложения", "Файл_СчФктр_3_01");
	ФормаФайл.ОбновитьНоменклатуруВложения(Кэш, Контекст);
	
КонецПроцедуры 

&НаКлиенте
Процедура СформироватьПараметры(Док, Кэш) Экспорт
	
	фрм = МодульОбъектаКлиент().ПолучитьФормуОбработки("Файл_УпдСчфДоп_3_01"); 
	фрм.СформироватьПараметры(Док, Кэш);
	
КонецПроцедуры

&НаКлиенте
Процедура ПропатчитьИмяФайлаВложения(ВложениеСБИС, ДопПараметры) Экспорт 
	
	фрм = МодульОбъектаКлиент().ПолучитьФормуОбработки("Файл_УпдСчфДоп_3_01"); 
	фрм.ПропатчитьИмяФайлаВложения(ВложениеСБИС, ДопПараметры);

КонецПроцедуры    

// Функция - патчит сторону документа для ее заполнения в генераторе ФЭД
//
// Параметры:
//  Кэш			 - Структура	- Кэш обработки
//  Вложение	 - Структура	- Структура вложения из состава пакета
//  ИмяСтороны	 - Строка		- Ключ стороны
// 
// Возвращаемое значение:
//  Структура - Данные стороны, результат работы функции
//
&НаКлиенте
Функция ИсточникДанных_ПолучитьДанныеСтороныПоИмени(Кэш, Вложение, ИмяСтороны) Экспорт
	
	фрм = МодульОбъектаКлиент().ПолучитьФормуОбработки("Файл_СчФктр_3_01"); 
	Возврат фрм.ИсточникДанных_ПолучитьДанныеСтороныПоИмени(Кэш, Вложение, ИмяСтороны);
	
КонецФункции