
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

&НаКлиенте
Функция ПолучитьДанныеИзДокумента1С(Кэш,Контекст) Экспорт
	Перем Стороны;
	
	// Функция формирует структуру выгружаемого файла И добавляет его в состав пакета
	Попытка	
		Контекст.Вставить("ТаблДок",Новый Структура());
		Контекст.ТаблДок.Вставить("ИтогТабл",Новый Массив);
		Контекст.ТаблДок.Вставить("СтрТабл",Новый Массив);
		Контекст.Вставить("ИтогСумма",0);
		Контекст.Вставить("ИтогСуммаБезНалога",0);
		Контекст.Вставить("ИтогБрутто",0);
		Контекст.Вставить("ИтогНетто",0);
				
		НоменклатураКодКонтрагента = Кэш.ОбщиеФункции.РассчитатьЗначение("НоменклатураКодКонтрагента", Контекст.ФайлДанные,Кэш);  // надо сопоставить номенклатуру перед отправкой
		Если ЗначениеЗаполнено(НоменклатураКодКонтрагента) Тогда
			Контекст.Вставить("НоменклатураКодКонтрагента",НоменклатураКодКонтрагента);	
		КонецЕсли;
		
		ПолучитьТабличнуюЧастьДокумента1С(Кэш,Контекст);
		Если Контекст.ТаблДок.СтрТабл.Количество() = 0 Тогда//нет такого документа
			Возврат Истина;
		КонецЕсли;
		
		ИтогТабл=Новый Структура;
		ИтогТабл.Вставить("Сумма", Формат(Контекст.ИтогСумма, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));	
		ИтогТабл.Вставить("СуммаБезНДС", Формат(Контекст.ИтогСуммаБезНалога, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));
		
		Если Контекст.ФайлДанные.Свойство("ЕдиницаИзмеренияВеса") Тогда
			ЕдиницаИзмеренияВеса = Контекст.ФайлДанные.ЕдиницаИзмеренияВеса;
			Если Контекст.ИтогБрутто > 0 Тогда
				ИтогТаблБрутто = Новый Структура;
				ИтогТаблБрутто.Вставить("Кол_во", Формат(Контекст.ИтогБрутто, "ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.00"));
				Если Контекст.ФайлДанные.Свойство("МассаИтогПрописью") Тогда
					Контекст.ФайлДанные.Вставить("МассаИтог", Контекст.ИтогБрутто);
					ИтогТаблБрутто.Вставить("Прописью", Кэш.ОбщиеФункции.РассчитатьЗначение("МассаИтогПрописью", Контекст.ФайлДанные,Кэш));
				Иначе	
					ИтогТаблБрутто.Вставить("Прописью", ЧислоПрописью(Контекст.ИтогБрутто, ,",,,,,,,,0")+ " " + СокрЛП(ЕдиницаИзмеренияВеса) + ".");
				КонецЕсли;	
				ИтогТабл.Вставить("Брутто", ИтогТаблБрутто);
			КонецЕсли;
			
			Если Контекст.ИтогНетто > 0 Тогда
				ИтогТаблНетто = Новый Структура;
				ИтогТаблНетто.Вставить("Кол_во", Формат(Контекст.ИтогНетто, "ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.00"));
				Если Контекст.ФайлДанные.Свойство("МассаИтогПрописью") Тогда
					Контекст.ФайлДанные.Вставить("МассаИтог", Контекст.ИтогНетто);
					ИтогТаблНетто.Вставить("Прописью", Кэш.ОбщиеФункции.РассчитатьЗначение("МассаИтогПрописью", Контекст.ФайлДанные,Кэш));
				Иначе	
					ИтогТаблНетто.Вставить("Прописью", ЧислоПрописью(Контекст.ИтогНетто, ,",,,,,,,,0")+ " " + СокрЛП(ЕдиницаИзмеренияВеса) + ".");
				КонецЕсли;	
				ИтогТабл.Вставить("Нетто", ИтогТаблНетто);
			КонецЕсли;
		КонецЕсли;
		
		Контекст.ТаблДок.ИтогТабл.Добавить(ИтогТабл);
		
		Док  = Новый Структура;
		Док.Вставить("Файл",Новый Структура);
		Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Файл",Контекст.ФайлДанные,Док.Файл);
		Док.Файл.Вставить("Документ",Новый Структура);
		Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Документ",Контекст.ФайлДанные,Док.Файл.Документ);
		
		Валюта =  Кэш.ОбщиеФункции.РассчитатьЗначение("Валюта_КодОКВ", Контекст.ФайлДанные, Кэш);
		Если ЗначениеЗаполнено(Валюта) Тогда
			Док.Файл.Документ.Вставить("Валюта",Новый Структура);
			Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Валюта",Контекст.ФайлДанные,Док.Файл.Документ.Валюта);
		КонецЕсли;
		
		Если Контекст.ФайлДанные.Свойство("мПараметр") Тогда
			СписокПараметр=Новый Массив;
			Для Каждого Элемент Из Контекст.ФайлДанные.мПараметр Цикл
				Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Контекст.ФайлДанные,Элемент.Значение);
				Параметр = Новый Структура();
				Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Параметр",Контекст.ФайлДанные,Параметр);
				СписокПараметр.Добавить(Параметр);
			КонецЦикла;
			Док.Файл.Документ.Вставить("СписокПараметр",Новый структура("Параметр",СписокПараметр));
		КонецЕсли;
		
		Если Контекст.ФайлДанные.Свойство("мОснование") Тогда
			ПолучитьДанныеИзДокумента1С_мОснование(Кэш, Док, Контекст);
		КонецЕсли;
		
		Отправитель = "";
		Получатель = "";  
		ЗапретРедакций = Ложь;
		ОтправительРоль=Кэш.ОбщиеФункции.РассчитатьЗначение("Отправитель_Роль", Контекст.ФайлДанные, Кэш);
		ПолучательРоль=Кэш.ОбщиеФункции.РассчитатьЗначение("Получатель_Роль", Контекст.ФайлДанные, Кэш);
		Если Не ЗначениеЗаполнено(ОтправительРоль) Тогда
			ОтправительРоль = "Отправитель";
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ПолучательРоль) Тогда
			ПолучательРоль = "Получатель";
		КонецЕсли;
		Если Контекст.ФайлДанные.Свойство("мСторона") Тогда
			
			Стороны = Новый структура;
			Для Каждого Параметр Из Контекст.ФайлДанные.мСторона Цикл
				Если Параметр.Значение.Свойство("Роль") Тогда
					Роль = Кэш.ОбщиеФункции.РассчитатьЗначение("Роль",Параметр.Значение,Кэш);
				Иначе
					Роль = Кэш.ОбщиеФункции.РассчитатьЗначение("Сторона_Роль",Параметр.Значение,Кэш);
				КонецЕсли;
				
				Сторона = Кэш.ОбщиеФункции.ПолучитьСторону(Кэш,Параметр.Значение);
				
				Если Сторона<>Неопределено Тогда
					Если Сторона.свойство("Адрес") Тогда
						КопияСторонаАдрес = Кэш.ОбщиеФункции.сбисСкопироватьОбъектНаКлиенте(Сторона.Адрес);// alo копия чтобы не порушить кэшируемые значения 
						Для Каждого адресТип из КопияСторонаАдрес Цикл 
							Если адресТип.свойство("Тип") И ЗначениеЗаполнено(адресТип.Тип) Тогда
								тип= адресТип.Тип;
								адресТип.Удалить("Тип");
							Иначе
								тип= "Юридический";
							КонецЕсли;
							Если Не адресТип.свойство(тип) Тогда
								адресТип.Вставить(тип,Новый структура());
								Если адресТип.свойство("АдрТекст") Тогда
									Если Не адресТип.свойство("АдрИно") И Не адресТип.свойство("АдрРФ") Тогда
										адресТип[тип].вставить("АдрТекст",адресТип.АдрТекст);
									КонецЕсли;
									адресТип.Удалить("АдрТекст");
								КонецЕсли;
								Если адресТип.свойство("АдрИно") Тогда
									адресТип[тип].вставить("АдрИно",адресТип.АдрИно);
									адресТип.Удалить("АдрИно");
								КонецЕсли;
								Если адресТип.свойство("АдрРФ") Тогда
									адресТип[тип].вставить("АдрРФ",адресТип.АдрРФ);
									адресТип.Удалить("АдрРФ");
								КонецЕсли;
							КонецЕсли;
						Конеццикла;
						Сторона.Вставить("Адрес",КопияСторонаАдрес);
					КонецЕсли;
					Если Сторона.свойство("Представители") Тогда
						Сторона.Удалить("Представители");
					КонецЕсли;
					Стороны.Вставить(Роль,Сторона);
				КонецЕсли;
			КонецЦикла;
			Если Не Стороны.Свойство(ПолучательРоль) Тогда
				МодульОбъектаКлиент().ВызватьСбисИсключение(721, "Файл_Шаблон_3_03.ПолучитьШапкуИзДокумента1С",,,"Не удалось определить ИНН получателя документа " + Строка(Контекст.Документ));
			КонецЕсли;
			Если Не Стороны.Свойство(ОтправительРоль) Тогда
				МодульОбъектаКлиент().ВызватьСбисИсключение(721, "Файл_Шаблон_3_03.ПолучитьШапкуИзДокумента1С",,,"Не удалось определить ИНН отправителя документа " + Строка(Контекст.Документ));
			КонецЕсли;
			// Если Грузоотправитель И грузополучатель нужны, но они Не попали в файл, то берем их с отправителя И получателя
			Если Не Контекст.Свойство("ЗаполнятьГрузотпрГрузполуч") Или (Контекст.Свойство("ЗаполнятьГрузотпрГрузполуч") И Контекст.ЗаполнятьГрузотпрГрузполуч = Истина) Тогда
				Если Контекст.ФайлДанные.мСторона.Свойство("Грузоотправитель") И Не Стороны.Свойство("Грузоотправитель") И Стороны.Свойство(ОтправительРоль) Тогда
					Стороны.Вставить("Грузоотправитель",Новый Структура);		
					Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Стороны.Грузоотправитель,Стороны[ОтправительРоль]);
				КонецЕсли;
				Если Контекст.ФайлДанные.мСторона.Свойство("Грузополучатель") И Не Стороны.Свойство("Грузополучатель") И Стороны.Свойство(ПолучательРоль) Тогда
					Стороны.Вставить("Грузополучатель",Новый Структура);		
					Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Стороны.Грузополучатель,Стороны[ПолучательРоль]);
				КонецЕсли;
			КонецЕсли;
			
			Док.Файл.Документ.Вставить("Стороны", Стороны);
			
		КонецЕсли;  
		
		КонтекстДляКонтура = МодульОбъектаКлиент().СоздатьКопиюОбъекта(Контекст);
		КонтекстДляКонтура.Вставить("Ини", Контекст.ФайлДанные);
		РезультатПоКонтуру = Кэш.ОбщиеФункции.РассчитатьЗначение("сбисПолучитьДанныеПоКонтуру", КонтекстДляКонтура, Кэш);
		Если Не РезультатПоКонтуру = Неопределено Тогда
			РазложитьДанныеПоКонтуру(РезультатПоКонтуру, Док.Файл.Документ, Контекст.ТаблДок.СтрТабл);
		КонецЕсли;
		
		Док.Файл.Документ.Вставить("СписокСтрТабл", Контекст.ТаблДок);
		
		КонтекстДляСопоставления = Новый Структура("ИдОснования, НеИскатьПоДокументу");
		Если Контекст.Свойство("ИдОснования") Тогда
			КонтекстДляСопоставления.Вставить("ИдОснования", Контекст.ИдОснования);
		КонецЕсли;
		Если Контекст.Свойство("НеИскатьПоДокументу") Тогда
			КонтекстДляСопоставления.Вставить("НеИскатьПоДокументу", Контекст.НеИскатьПоДокументу);
		КонецЕсли;
		КонтекстДляСопоставления.Вставить("ПересчетПоДокументуОснованию", Истина);
		КонтекстДляСопоставления.Вставить("НаправлениеПересчета", "Выгрузка");
		
		ПараметрыКонструктора = Новый Структура("ГрязныйИни, ДокументФайл, ДокументСсылка", Контекст.ФайлДанные, Док, Контекст.Документ);
		ПараметрыКонструктора.Вставить("ОтправительРоль",				ОтправительРоль);
		ПараметрыКонструктора.Вставить("ПолучательРоль",				ПолучательРоль);
		ПараметрыКонструктора.Вставить("ДанныеСторон",					Стороны);
		ПараметрыКонструктора.Вставить("СуммаВложения",					Контекст.ИтогСумма);
		ПараметрыКонструктора.Вставить("КонтекстДляСопоставления", КонтекстДляСопоставления);
		
		Вложение = МодульОбъектаКлиент().НовыйВложениеСБИС(ПараметрыКонструктора);
			
		Контекст.СоставПакета.Вложение.Добавить(Вложение);
		
		фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("сбисПослеФормированияДокумента","Файл_"+Контекст.ФайлДанные.Файл_Формат+"_"+СтрЗаменить(СтрЗаменить(Контекст.ФайлДанные.Файл_ВерсияФормата, ".", "_"), " ", ""),"Файл_Шаблон", Кэш);
		Если фрм<>Ложь Тогда
			
			фрм.сбисПослеФормированияДокумента(Док, Кэш, Контекст);	
			Вложение.СтруктураДокумента = Док; // на случай, Если Док поменялся в функции сбисПослеФормированияДокумента
			
		КонецЕсли;
		Возврат Истина;
		
	Исключение
		ИсключениеФормирования = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "Файл_Шаблон_3_03.ПолучитьШапкуИзДокумента1С");
		Контекст.СоставПакета.Вставить("Ошибка", ИсключениеФормирования);
		Возврат Ложь;
	КонецПопытки;
КонецФункции

&НаКлиенте
Функция РазложитьДанныеПоКонтуру(РезультатПоКонтуру, Документ, ТаблДок)
	
	//Обработка Номенклатуры
	// 1. Индексируем контур
	ФункцииМодуляОбъекта = МодульОбъектаКлиент();
	КонтурGTIN = Новый Соответствие;
	
	Для Каждого Элемент Из РезультатПоКонтуру.НоменклатураКонтура Цикл
		Если НЕ ЗначениеЗаполнено(Элемент.GTIN) Тогда
			Продолжить;
		КонецЕсли;
		
		Ном = Строка(ФункцииМодуляОбъекта.ПолучитьСвойствоОбъекта(Элемент, "Номенклатура"));
		Хар = Строка(ФункцииМодуляОбъекта.ПолучитьСвойствоОбъекта(Элемент, "Характеристика")); // может быть "Неопределено"
		Ед  = Строка(ФункцииМодуляОбъекта.ПолучитьСвойствоОбъекта(Элемент, "Единица"));
		
		Ключ = Ном + "~" + Хар + "~" + Ед;
		КонтурGTIN[Ключ] = Элемент.GTIN;
	КонецЦикла;
	
	// 2. Обрабатываем ТаблДок
	Для Каждого Позиция Из ТаблДок Цикл  
		
		Если НЕ Позиция.Свойство("GTIN") 
			Или ЗначениеЗаполнено(Позиция.GTIN) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Ном = Строка(ФункцииМодуляОбъекта.ПолучитьСвойствоОбъекта(Позиция, "Номенклатура"));
		Хар = Строка(ФункцииМодуляОбъекта.ПолучитьСвойствоОбъекта(Позиция, "Характеристика"));
		Ед  = Строка(ФункцииМодуляОбъекта.ПолучитьСвойствоОбъекта(Позиция, "ЕдИзм1С"));
		
		Ключ = Ном + "~" + Хар + "~" + Ед;
		
		GTINИзКонтура = КонтурGTIN[Ключ];
		
		Если GTINИзКонтура = Неопределено Тогда 
			
			Продолжить; 
			
		Иначе
			
			Позиция.GTIN = GTINИзКонтура;	
			
		КонецЕсли;
				
	КонецЦикла;
	
	//ОбработкаGLN
	Документ.Стороны.Поставщик.GLN			= РезультатПоКонтуру.ДанныеGLN.GLN_Отправитель;
	Документ.Стороны.Покупатель.GLN			= РезультатПоКонтуру.ДанныеGLN.GLN_Получатель;
	Документ.Стороны.Грузоотправитель.GLN	= РезультатПоКонтуру.ДанныеGLN.GLN_Грузоотправитель;
	Документ.Стороны.Грузополучатель.GLN	= РезультатПоКонтуру.ДанныеGLN.GLN_Грузополучатель;
	
	// Обработка оснований
	Если РезультатПоКонтуру.ОснованияКонтура.Количество() Тогда
		
		Основание = РезультатПоКонтуру.ОснованияКонтура[0];
		
		ПодготовкаОснования = Новый Структура();
		ПодготовкаОснования.Вставить("Тип", "Заказ");
		ПодготовкаОснования.Вставить("Номер", Основание.НомерЗаказа);
		ПодготовкаОснования.Вставить("Дата", Формат(Основание.ДатаЗаказа,"ДЛФ=Д"));		
		Документ.СписокОснование.Основание.Добавить(ПодготовкаОснования);                            
		
		Если Документ.Свойство("Срок") И Не ЗначениеЗаполнено(Документ.Срок) Тогда
				
			Документ.Срок = Формат(Основание.ДатаПоставки, "ДЛФ=Д");	
		
		КонецЕсли;
			
	КонецЕсли;
 
	
КонецФункции


&НаКлиенте
Функция НайтиОснованиеПоТипу(СтруктураДокумента, ТипОснования) Экспорт
	
	Если СтруктураДокумента.Файл.Документ.Свойство("Основание") Тогда
		Основания = СтруктураДокумента.Файл.Документ.Основание;
	ИначеЕсли СтруктураДокумента.Файл.Документ.Свойство("СписокОснование") Тогда
		Основания = СтруктураДокумента.Файл.Документ.СписокОснование.Основание;  
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Для Каждого Основание ИЗ Основания Цикл
		Если Основание.Свойство("Тип") 
			И Основание.Тип = ТипОснования Тогда
			Возврат Основание;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция ПолучитьТабличнуюЧастьДокумента1С(Кэш,Контекст) Экспорт
	// Функция формирует структуру табличной части файла	
	СуммаВключаетНДС=Кэш.ОбщиеФункции.РассчитатьЗначение("СуммаВключаетНДС", Контекст.ФайлДанные,Кэш);
	КолТоваров = 0;
	// проверяем надо ли пересчитывать суммы в валюту учета
	Валюта = Кэш.ОбщиеФункции.РассчитатьЗначение("Валюта", Контекст.ФайлДанные,Кэш);
	ВалютаУчета = Кэш.ОбщиеФункции.РассчитатьЗначение("ВалютаУчета", Контекст.ФайлДанные,Кэш);
	
	Для Каждого Параметр Из Контекст.ФайлДанные.мТаблДок Цикл
		// Чтобы одна И та же табличная часть Не попадала 2 раза в документ (в СФ, Если по документу-основанию формируются дополнительные файлы)
		Если Контекст.Свойство("СписокТЧ") Тогда  
			Если Контекст.СписокТЧ.НайтиПоЗначению(Параметр.Ключ)<>Неопределено Тогда
				Продолжить;
			Иначе
				Контекст.СписокТЧ.Добавить(Параметр.Ключ);
			КонецЕсли;
		КонецЕсли;		
		
		Если ТипЗнч(Параметр.Значение) = Тип("Массив") Тогда    // стандартная табличная часть
			ТабЧастьДокумента = Параметр.Значение;
		ИначеЕсли ТипЗнч(Параметр.Значение) = Тип("Структура") И Лев(Параметр.Значение.ТаблДок,1)<>"{" Тогда  // табличная часть из одной строки, которая заполняется прямо из реквизитов документа
			ТабЧастьДокумента = Новый Массив;
			ТабЧастьДокумента.Добавить(Параметр.Значение);
		Иначе   // табличная часть вычисляется с помощью функции
			Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Контекст.ФайлДанные, Параметр.Значение);
			ТабЧастьДокумента = Кэш.ОбщиеФункции.РассчитатьЗначение("ТаблДок", Контекст.ФайлДанные, Кэш);
		КонецЕсли;
		
		Если ТипЗнч(ТабЧастьДокумента) = Тип("Массив") Тогда
			сч=0;
			Для Каждого Стр Из ТабЧастьДокумента Цикл
				Если Кэш.Парам.ОтправлятьНоменклатуруСДокументами = Истина И Кэш.Ини.Свойство("Номенклатура") Тогда
					Номенклатура = Кэш.ОбщиеФункции.РассчитатьЗначение("Номенклатура", Стр, Кэш);
					Если Кэш.СписокНоменклатуры.НайтиПоЗначению(Номенклатура) = Неопределено Тогда
						Кэш.СписокНоменклатуры.Добавить(Номенклатура);
					КонецЕсли;
				КонецЕсли;
				ДобавлятьСтроку = ?(Стр.Свойство("ДобавлятьСтроку"),Стр.ДобавлятьСтроку,Истина);
				сч=сч+1;
				Стр.Вставить("РеквизитСопоставленияНоменклатуры", Кэш.Парам.РеквизитСопоставленияНоменклатуры);
				Стр.Вставить("СуммаВключаетНДС",СуммаВключаетНДС);
				НоваяСтрока = Новый Структура;
				Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"ТаблДок",Стр,НоваяСтрока);
				НоваяСтрока.Вставить("ПорНомер",Формат(сч, "ЧГ=0")); 
				СуммаНДС = Кэш.ОбщиеФункции.РассчитатьЗначение("СуммаНДС", Стр, Кэш);
				Попытка
					СуммаНДС = Число(СуммаНДС);
				Исключение
					СуммаНДС = 0;
				КонецПопытки;
				Попытка
					НоваяСтрока.Сумма = Число(НоваяСтрока.Сумма);
				Исключение
					НоваяСтрока.Сумма = 0;
				КонецПопытки;
				НоваяСтрока.Вставить("СуммаБезНал",формат(НоваяСтрока.Сумма - ?(СуммаВключаетНДС, СуммаНДС, 0), "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));
				НоваяСтрока.Сумма = формат(Число(НоваяСтрока.Сумма) + ?(СуммаВключаетНДС, 0, СуммаНДС), "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00");
				
				СтруктураПроизводитель = Новый Структура;
				Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Производитель",Стр,СтруктураПроизводитель);
				Если СтруктураПроизводитель.Количество()>0 Тогда
					НоваяСтрока.Вставить("Производитель",СтруктураПроизводитель);
				КонецЕсли;
				НоваяСтрока.Вставить("НДС",Новый Структура);
				НоваяСтрока.НДС.Вставить( "Сумма", формат(СуммаНДС, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));	
				Если значениеЗаполнено(Стр.СтавкаНДС) И Строка(Стр.СтавкаНДС) <> "Без НДС" Тогда
					фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ЗначениеИТипСтавки","РаботаСДокументами1С","",Кэш);
					СтрСтавка = фрм.ЗначениеИТипСтавки(Стр.СтавкаНДС);
					НоваяСтрока.НДС.Вставить( "Ставка", СтрСтавка.Ставка);	
				КонецЕсли;
				
				Если Стр.Свойство("мПараметр") Тогда
					СписокПараметр=Новый Массив;
					Для Каждого Элемент Из Стр.мПараметр Цикл
						Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Стр,Элемент.Значение);
						Параметр = Новый Структура();
						Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Параметр",Стр,Параметр);
						СписокПараметр.Добавить(Параметр);
					КонецЦикла;
					НоваяСтрока.Вставить("СписокПараметр",Новый структура("Параметр",СписокПараметр));
				КонецЕсли;
				
				СтруктураУпаковка = Новый Структура;
				Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Упаковка",Стр,СтруктураУпаковка);
				Если СтруктураУпаковка.Количество()>0 Тогда
					НоваяСтрока.Вставить("Упаковка",СтруктураУпаковка);
				КонецЕсли;
				
				СтруктураБрутто = Новый Структура;
				Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Брутто",Стр,СтруктураБрутто);
				Если СтруктураБрутто.Количество()>0 Тогда
					НоваяСтрока.Вставить("Брутто",СтруктураБрутто);
				КонецЕсли;
				
				фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("сбисПослеФормированияСтроки","Файл_"+Контекст.ФайлДанные.Файл_Формат+"_"+СтрЗаменить(СтрЗаменить(Контекст.ФайлДанные.Файл_ВерсияФормата, ".", "_"), " ", ""),"Файл_Шаблон", Кэш);
				Если фрм<>Ложь Тогда
					ДобавлятьСтроку = фрм.сбисПослеФормированияСтроки(НоваяСтрока, Кэш, Контекст, Стр);	
				КонецЕсли;
				// При необходимости проверяем, вся ли номенклатура сопоставлена
				Если Контекст.Свойство("НоменклатураКодКонтрагента") И (Не НоваяСтрока.Свойство(Контекст.НоменклатураКодКонтрагента) Или Не ЗначениеЗаполнено(НоваяСтрока[Контекст.НоменклатураКодКонтрагента]))  Тогда
					Контекст.СоставПакета.Вставить("Ошибка","Не вся номенклатура сопоставлена");	
				КонецЕсли;
				
				Если ДобавлятьСтроку = Ложь Тогда      // <>Ложь написано для совместимости со старыми функциями сбисПослеФормированияСтроки, которые могли ничего Не возвращать
					Продолжить;
				КонецЕсли;
				Контекст.ИтогСумма       	= Контекст.ИтогСумма + НоваяСтрока.Сумма;
				Контекст.ИтогСуммаБезНалога = Контекст.ИтогСуммаБезНалога + НоваяСтрока.СуммаБезНал;
				
				КонтекстИтог = Неопределено;
				КонтекстКолВо = НоваяСтрока;
				Если	Контекст.Свойство("ИтогБрутто", КонтекстИтог)
					И	КонтекстКолВо.Свойство("Брутто", КонтекстКолВо)
					И	КонтекстКолВо.Свойство("Кол_во", КонтекстКолВо) Тогда
					Контекст.ИтогБрутто = КонтекстИтог + КонтекстКолВо;
				КонецЕсли;
				КонтекстКолВо = НоваяСтрока;
				Если	Контекст.Свойство("ИтогНетто", КонтекстИтог)
					И	КонтекстКолВо.Свойство("Нетто", КонтекстКолВо)
					И	КонтекстКолВо.Свойство("Кол_во", КонтекстКолВо) Тогда
					Контекст.ИтогНетто = КонтекстИтог + КонтекстКолВо;
				КонецЕсли;
				
				ПолучитьТабличнуюЧастьДокумента1С_НовоеСопоставлениеНоменклатуры(Контекст, Стр, НоваяСтрока);
				
				Контекст.ТаблДок.СтрТабл.Добавить(НоваяСтрока);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецФункции

// Процедура - патчит добавляемую строку для использования нового сопоставления номенклатуры
//
// Параметры:
//  Контекст	 - Структура	- Контекст расчета документа
//  Стр			 - Структура	- Рассчитанная строка
//  НоваяСтрока	 - Структура	- Обрабатываемая строка
//
&НаКлиенте
Процедура ПолучитьТабличнуюЧастьДокумента1С_НовоеСопоставлениеНоменклатуры(Контекст, Стр, НоваяСтрока) Экспорт 
	
	МодульФункций = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
		
	ИспользоватьОбратноеСопоставление = МодульФункций.РассчитатьЗначение("ИспользоватьСопоставлениеНоменклатуры", Контекст.ФайлДанные);
	ИспользоватьОбратноеСопоставление = ИспользоватьОбратноеСопоставление = Истина
										И	МодульОбъектаКлиент().ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры_ОбратноеСопоставление")
										И	МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ИспользоватьОбратноеСопоставление");
	Контекст.Вставить("ИспользоватьСопоставлениеНоменклатуры", ИспользоватьОбратноеСопоставление);
			
	НоваяСтрока.Вставить("Номенклатура", Стр.Номенклатура);
	НоваяСтрока.Вставить("ЕдИзм1С", Стр.ЕдИзм);
	Если Стр.Свойство("Характеристика") Тогда
		НоваяСтрока.Вставить("Характеристика", Стр.Характеристика);
		НоваяСтрока.Вставить("Характеристика1C", Стр.Характеристика);
	Иначе
		НоваяСтрока.Вставить("Характеристика", Неопределено);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеИзДокумента1С_мОснование(Кэш, Док, Контекст) Экспорт
	СписокОснование=Новый Массив;
	Для Каждого Параметр Из Контекст.ФайлДанные.мОснование Цикл
		Если ТипЗнч(Параметр.Значение) = Тип("Массив") Тогда
			Для Каждого Элемент Из Параметр.Значение Цикл
				ВременныйКонтекстФайлДанные = Кэш.ОбщиеФункции.СкопироватьОбъектСПараметрамиКлиент(Контекст.ФайлДанные,,Ложь);
				Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(ВременныйКонтекстФайлДанные,Элемент);
				Основание = Новый Структура();
				Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Основание",ВременныйКонтекстФайлДанные,Основание);
				СписокОснование.Добавить(Основание);	
			КонецЦикла;
		Иначе
			ВременныйКонтекстФайлДанные = Кэш.ОбщиеФункции.СкопироватьОбъектСПараметрамиКлиент(Контекст.ФайлДанные,,Ложь);
			Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(ВременныйКонтекстФайлДанные,Параметр.Значение);
			Основание = Новый Структура();
			Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Основание",ВременныйКонтекстФайлДанные,Основание);
			СписокОснование.Добавить(Основание);
		КонецЕсли;
	КонецЦикла;
	Док.Файл.Документ.Вставить("СписокОснование",Новый структура("Основание",СписокОснование));
КонецПроцедуры

//Генератор ФЭД для формирования вложений {
&НаКлиенте
Функция ИсточникДанных_ПолучитьДанныеСтороныПоИмени(Кэш, Вложение, ИмяСтороны) Экспорт
	
	Попытка
		Возврат Вложение.СтруктураДокумента.Файл.Документ.Стороны[ИмяСтороны];	
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Функция ИсточникДанных_ПолучитьТабличнуюЧастьДокумента(Кэш, Вложение, ИмяТабличнойЧасти) Экспорт
	
	Попытка
		Возврат Вложение.СтруктураДокумента.Файл.Документ.СписокСтрТабл[ИмяТабличнойЧасти];
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Функция ИсточникДанных_ПолучитьСтранаПроизводства(Кэш, Источник) Экспорт
	
	Попытка
		Возврат Новый Структура("КодСтраныПроизводства, СтранаПроизводства", Источник.Производитель.Код, Источник.Производитель.Страна);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Функция ИсточникДанных_ИтогТабл(Кэш, Вложение) Экспорт
	
	Попытка
		ИтогТабл = Вложение.СтруктураДокумента.Файл.Документ.СписокСтрТабл.ИтогТабл;
		Возврат Новый Структура("СтруктураИтоги, ИмяТабл", ИтогТабл[0], "ИтогТабл");
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Функция СформироватьДокументДляГенератора(ПараметрыФормированияВходящие, Кэш) Экспорт
	
	Док		= ПараметрыФормированияВходящие.Документ;
	Вложение= ПараметрыФормированияВходящие.Вложение;
	
	ТекДокумент = Док.Файл.Документ;
	
	Если НЕ ТекДокумент.Стороны.Свойство("Получатель") Тогда
		ТекДокумент.Стороны.Вставить("Получатель", Новый Структура());
		Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(ТекДокумент.Стороны.Получатель, Вложение.Получатель);
	КонецЕсли;
	Если НЕ ТекДокумент.Стороны.Свойство("Отправитель") Тогда
		ТекДокумент.Стороны.Вставить("Отправитель", Новый Структура());
		Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(ТекДокумент.Стороны.Отправитель, Вложение.Отправитель);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекДокумент.Стороны.Получатель.GLN) Тогда
		ТекДокумент.Стороны.Получатель.GLN = Вложение.Получатель.GLN;	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекДокумент.Стороны.Отправитель.GLN) Тогда
		ТекДокумент.Стороны.Отправитель.GLN = Вложение.Отправитель.GLN;	
	КонецЕсли;
	
	Для Каждого ТекСтрока ИЗ ТекДокумент.СписокСтрТабл.СтрТабл Цикл
		ЗаполнитьПоСтрТаблПараметр(Кэш, ТекСтрока);
		СформироватьИнфПол(Кэш, ТекСтрока);
		РасчитатьЦенуСНДС(Кэш, ТекСтрока);
		
	КонецЦикла;
	
	СформироватьОснование(Док, Кэш);
	СформироватьПараметры(Док, Кэш);
	
	Возврат Док;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоСтрТаблПараметр(Кэш, ТекСтрока)
	
	Если НЕ (ТекСтрока.Свойство("СписокПараметр") И ТекСтрока.СписокПараметр.Свойство("Параметр")) Тогда
		Возврат;		
	КонецЕсли;
	
	Для Каждого ТекПараметр ИЗ ТекСтрока.СписокПараметр.Параметр Цикл
		
		Если ТекПараметр.Имя = "НомерГТД" Тогда
			ТекСтрока.Вставить("ГТД", СокрЛП(ТекПараметр.Значение));
			Прервать;
		КонецЕсли;
		
	КонецЦикла

КонецПроцедуры

&НаКлиенте
Процедура СформироватьИнфПол(Кэш, ТекСтрока)
	
	ИнфПол = Новый Массив;
	
	Для Каждого Текущий ИЗ ТекСтрока Цикл
		Если Текущий.Ключ = "GTIN" Тогда
			ИнфПол.Добавить(Новый Структура("Имя, Значение", "GTIN", Текущий.Значение));
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ТекСтрока.Свойство("СписокПараметр") И ТекСтрока.СписокПараметр.Свойство("Параметр") Тогда
		Исключения = ПолучитьИсключенияИнфПол();
		Для Каждого ТекПараметр ИЗ ТекСтрока.СписокПараметр.Параметр Цикл
			
			Если Исключения.Получить(ТекПараметр.Имя) = Истина Тогда
				Продолжить;	
			КонецЕсли;
			
			ИнфПол.Добавить(Новый Структура("Имя, Значение", ТекПараметр.Имя, ТекПараметр.Значение));
			
		КонецЦикла;
	КонецЕсли;
	
	ИнфПол = ПолучитьПараметрыБезПустыхЗаписей(Кэш, ИнфПол);
	
	Если ИнфПол.Количество() <> 0 Тогда
		ТекСтрока.Вставить("ИнфПол", ИнфПол);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИсключенияИнфПол()
	
	ИсключенияИнфПол = Новый Соответствие;
	ИсключенияИнфПол.Вставить("ИдГосКон", Истина);
	ИсключенияИнфПол.Вставить("СвТранГруз", Истина);
	ИсключенияИнфПол.Вставить("ДатаПер", Истина);
	ИсключенияИнфПол.Вставить("РабОргПрод_Должность", Истина);
	ИсключенияИнфПол.Вставить("РабОргПрод_ФИО", Истина);
	ИсключенияИнфПол.Вставить("ИнЛицо_Должность", Истина);
	ИсключенияИнфПол.Вставить("ИнЛицо_ФИО", Истина);
	ИсключенияИнфПол.Вставить("ИнЛицо_НаимОргПер", Истина);
	ИсключенияИнфПол.Вставить("СвПерВещ", Истина);
	ИсключенияИнфПол.Вставить("НомерГТД", Истина);
	
	Возврат ИсключенияИнфПол;
	
КонецФункции

&НаКлиенте
Процедура РасчитатьЦенуСНДС(Кэш, ТекСтрока)
	
	Попытка
		СуммаСНДС = Число(ТекСтрока.Сумма);
	Исключение
		Возврат;
	КонецПопытки;
	
	Попытка
		Количество = Число(ТекСтрока.Кол_во);
	Исключение
		Возврат;
	КонецПопытки;
	
	Попытка
		ЦенаСНДС = СуммаСНДС / Количество;	
	Исключение
		Возврат;
	КонецПопытки;
	
	ТекСтрока.Вставить("ЦенаСНДС", Формат(ЦенаСНДС, "ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ="));
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОснование(Док, Кэш) Экспорт

	ТекДокумент = Док.Файл.Документ;
	
	Если НЕ (ТекДокумент.Свойство("СписокОснование") И ТекДокумент.СписокОснование.Свойство("Основание")) Тогда
		Возврат;
	КонецЕсли;
	
	Исключения = ПолучитьИсключенияОснование();
	
	ОснованиеМассив = Новый Массив;
	
	Для Каждого ТекСтрока ИЗ ТекДокумент.СписокОснование.Основание Цикл
		
		Если ТекСтрока.Свойство("Тип") Тогда
			Ключ = "Тип";	
		Иначе
			Ключ = "Название";	
		КонецЕсли;
		
		Если Исключения.Получить(ТекСтрока[Ключ]) = Истина Тогда
			Продолжить;	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока[Ключ]) Тогда
			Продолжить;	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Дата) Тогда
			Продолжить;	
		КонецЕсли; 
		
		Основание = Новый Структура("Номер, Название, Дата");
		Основание.Название 	= ТекСтрока[Ключ];
		Основание.Номер 	= ТекСтрока.Номер;
		Основание.Дата 		= ТекСтрока.Дата;
		
		ОснованиеМассив.Добавить(Основание);
		
	КонецЦикла;
	
	Если ОснованиеМассив.Количество() <> 0 Тогда
		ТекДокумент.Вставить("Основание", ОснованиеМассив);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИсключенияОснование()
	
	ИсключенияИнфПол = Новый Соответствие;
	ИсключенияИнфПол.Вставить("ПРД", Истина);
	ИсключенияИнфПол.Вставить("СчФ", Истина);
	ИсключенияИнфПол.Вставить("КСчФ", Истина);
	ИсключенияИнфПол.Вставить("ИспрСчФ", Истина);
	ИсключенияИнфПол.Вставить("ИсхСчФ", Истина);
	ИсключенияИнфПол.Вставить("ИспрИсхСчФ", Истина);
	ИсключенияИнфПол.Вставить("ДокПодтвОтгр", Истина);
	
	Возврат ИсключенияИнфПол;
	
КонецФункции

&НаКлиенте
Процедура СформироватьПараметры(Док, Кэш) Экспорт
	
	ТекДокумент = Док.Файл.Документ;
	
	Если НЕ (ТекДокумент.Свойство("СписокПараметр") И ТекДокумент.СписокПараметр.Свойство("Параметр")) Тогда
		Возврат;
	КонецЕсли;
	
	мПараметры = ТекДокумент.СписокПараметр.Параметр;
	
	ДобавитьСведенияGLNПоИмениСтороны(Кэш, ТекДокумент, "Получатель", мПараметры, "GLNПокуп");
	ДобавитьСведенияGLNПоИмениСтороны(Кэш, ТекДокумент, "Грузополучатель", мПараметры, "GLNГрузПолуч");
	ДобавитьСведенияGLNПоИмениСтороны(Кэш, ТекДокумент, "Отправитель", мПараметры, "GLNПост");
	ДобавитьСведенияGLNПоИмениСтороны(Кэш, ТекДокумент, "Грузоотправитель", мПараметры, "GLNГрузОтпр");
	
	мПараметры = ПолучитьПараметрыБезПустыхЗаписей(Кэш, мПараметры);
	
	Если мПараметры.Количество() <> 0 Тогда
		ТекДокумент.Вставить("Параметры", мПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСведенияGLNПоИмениСтороны(Кэш, ТекДокумент, ИмяСтороны, МассивПараметров, Ключ)
	
	Если НЕ ТекДокумент.Стороны.Свойство(ИмяСтороны) Тогда
		Возврат;	
	КонецЕсли;
	
	Данные = ТекДокумент.Стороны[ИмяСтороны];
	Если НЕ Данные.Свойство("GLN") Тогда
		Возврат;	
	КонецЕсли;
	
	МассивПараметров.Добавить(Новый Структура("Имя, Значение", Ключ, Данные.GLN));
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыБезПустыхЗаписей(Кэш, МассивПараметров)
	
	МассивПараметровИсходящий = Новый Массив;
	
	Для Каждого ТекСтрока ИЗ МассивПараметров Цикл
		
		Если НЕ ТекСтрока.Свойство("Имя") ИЛИ НЕ ТекСтрока.Свойство("Значение") Тогда
			Продолжить;	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Значение) Тогда
			Продолжить;	
		КонецЕсли;
		
		МассивПараметровИсходящий.Добавить(Новый Структура("Имя, Значение", ТекСтрока.Имя, ТекСтрока.Значение));
		
	КонецЦикла;
	
	Возврат МассивПараметровИсходящий;
	
КонецФункции
//}

// Функция - Данные строки вложения на просмотр
//
// Параметры:
//  Кэш		 - Структура - Объект класса ЛокальныйКэш
//  СтрТабл	 - Структура - Строка ТаблДок
// 
// Возвращаемое значение:
//  Структура - Представление строки для просмотра
//
&НаКлиенте
Функция ДанныеСтрокиВложенияНаПросмотр(Кэш, СтрТабл) Экспорт 
	Перем СтрПоФакту;
	
	ТипЧисло = Новый ОписаниеТипов("Число");

	Поля = "Название,
		|Характеристика,
		|Код,
		|ЕдИзм,
		|ОКЕИ,
		|Количество,
		|Цена,
		|СуммаБезНал,
		|СуммаНДС,
		|СтавкаНДС,
		|СуммаБезНал,
		|Сумма,
		|Идентификатор,
		|КодПокупателя,
		|GTIN,
		|ЕдИзмОрг,
		|Коэффициент,
		|ХарактеристикаПоставщика,
		|Номенклатура,
		|Отмечен";
	
	Результат = Новый Структура(Поля);
	
	Если НЕ СтрТабл.Свойство("ПоФакту", СтрПоФакту) Тогда
		СтрПоФакту = СтрТабл;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Результат, СтрТабл);
	ЗаполнитьЗначенияСвойств(Результат, СтрПоФакту);

	Сумма		= 0;
	Количество	= 0;
	
	Если (СтрПоФакту.Свойство("СуммаБезНал", Сумма)
			Или	СтрПоФакту.Свойство("Сумма", Сумма))
		И СтрПоФакту.Свойство("Кол_во", Количество)Тогда
		
		Количество	= ТипЧисло.ПривестиЗначение(Количество);
		Сумма		= ТипЧисло.ПривестиЗначение(Сумма);
		
		Цена = 0;
		Коэф = 0;
		
		Если	СтрПоФакту.Свойство("Цена", Цена)
			И	СтрПоФакту.Свойство("Коэффициент", Коэф) Тогда
			
			Коэф = ТипЧисло.ПривестиЗначение(Коэф);
			Цена = ?(Количество, Сумма / Количество, Сумма);
				
		КонецЕсли;
		
	Иначе
		
		Количество	= ТипЧисло.ПривестиЗначение(Количество);
		Цена		= ТипЧисло.ПривестиЗначение(Цена);
		
	КонецЕсли;
		
	Результат.Количество	= Формат(Количество,	"ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.000");
	Результат.Цена			= Формат(Цена,			"ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00");
	
	Если СтрПоФакту.Свойство("НДС") Тогда
		
		СтрПоФакту.НДС.Свойство("Сумма",	Результат.СуммаНДС);
		СтрПоФакту.НДС.Свойство("Ставка",	Результат.СтавкаНДС);
		
	КонецЕсли;
	
	СтрТабл.Свойство("ХарактеристикаНоменклатуры",	Результат.Характеристика);
	СтрТабл.Свойство("Номенклатура",				Результат.Номенклатура);
	
	Если СтрТабл.Свойство("Характеристика") Тогда
		Если ТипЗнч(СтрТабл.Характеристика) = Тип("Структура") Тогда
			СтрТабл.Характеристика.Свойство("Значение", Результат.ХарактеристикаПоставщика);
		ИначеЕсли ТипЗнч(СтрТабл.Характеристика) = Тип("Массив") Тогда
			Для Каждого Элемент Из СтрТабл.Характеристика Цикл
				Элемент.Свойство("Значение", Результат.ХарактеристикаПоставщика);
				Прервать;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Результат.Отмечен = НЕ СтрТабл.Свойство("НеЗагружать");
	
	Возврат Результат;

КонецФункции

#Область include_core2_vo2_Файл_Шаблон_ОбработатьТабличнуюЧастьДокументаСБИС
#КонецОбласти