
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

&НаКлиенте
Функция ПолучитьДанныеИзДокумента1С(Кэш, Контекст, ДопПараметры = Неопределено) Экспорт
// Функция формирует структуру выгружаемого файла и добавляет его в состав пакета
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	Попытка	
				
		Док						= Новый Структура;
		МассивСтатусРегламент	= Новый Массив;
		ЗапретРедакций			= Ложь;
		
		ОтправительРоль	= "";
		ПолучательРоль	= "";
		Если Контекст.ФайлДанные.Свойство("мСторона") Тогда
			
			Для Каждого Параметр Из Контекст.ФайлДанные.мСторона Цикл
				
				Роль	= Кэш.ОбщиеФункции.РассчитатьЗначение("Роль",Параметр.Значение,Кэш);
				Сторона	= Кэш.ОбщиеФункции.ПолучитьСторону(Кэш, Параметр.Значение);
				
				Если Роль = "Отправитель" Тогда
					
					ОтправительРоль = Роль;
					
				КонецЕсли;
				
				Если Роль = "Получатель" Тогда
					
					ПолучательРоль = Роль;
					
				КонецЕсли;
				
				Если Сторона = Неопределено Тогда
					
					Продолжить;
										
				КонецЕсли;
				
				Если	Сторона.Свойство("Подразделение")
					И	Сторона.Подразделение.Свойство("Идентификатор") Тогда
					
					Если		Сторона.Свойство("СвЮЛ") Тогда
						
						Сторона.СвЮЛ.Вставить("КодФилиала", Сторона.Подразделение.Идентификатор);
						
					ИначеЕсли	Сторона.Свойство("СвФЛ") Тогда
						
						Сторона.СвФЛ.Вставить("КодФилиала", Сторона.Подразделение.Идентификатор);
						
					КонецЕсли;
					
				КонецЕсли;
				
				Док.Вставить(Роль, Сторона);
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Если грузополучатель является филиалом получателя, то получаетелем пакета ставим грузополучателя
		Если Док.Свойство("Грузополучатель") Тогда
			
			Если	Док.Грузополучатель.Свойство("СвЮЛ")
				И	Док.Получатель.Свойство("СвЮЛ")
				И	Док.Грузополучатель.СвЮЛ.ИНН = Док.Получатель.СвЮЛ.ИНН
				И	Док.Грузополучатель.СвЮЛ.КПП <> Док.Получатель.СвЮЛ.КПП Тогда
				
				//Попытка
				//	оГрузополучатель = Кэш.Интеграция.ПолучитьИнформациюОКонтрагенте(Кэш, Док.Грузополучатель);
				//	оПолучатель = Кэш.Интеграция.ПолучитьИнформациюОКонтрагенте(Кэш, Док.Получатель);
				//	Если оПолучатель.Идентификатор = оГрузополучатель.Идентификатор Тогда
						Док.Получатель = Док.Грузополучатель;
				//	КонецЕсли;
				//Исключение
				//КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
		МодульОбъектаКлиент = МодульОбъектаКлиент();
		ПараметрыКонструктора = Новый Структура("ГрязныйИни, ДокументФайл, ДокументСсылка", Контекст.ФайлДанные, Док, Контекст.Документ);
		ПараметрыКонструктора.Вставить("ОтправительРоль",	ОтправительРоль);
		ПараметрыКонструктора.Вставить("ПолучательРоль",	ПолучательРоль);
		
		ДопПараметры.Вставить("Контекст", Контекст);
		
		КонвертСБИС = МодульОбъектаКлиент.НовыйКонвертСБИС(ПараметрыКонструктора, ДопПараметры);
		
		Контекст.СоставПакета.Вставить("Конверт", КонвертСБИС);

		фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("сбисПослеФормированияДокумента","Файл_"+Контекст.ФайлДанные.Файл_Формат+"_"+СтрЗаменить(СтрЗаменить(Контекст.ФайлДанные.Файл_ВерсияФормата, ".", "_"), " ", ""),"Файл_Шаблон", Кэш);
		Если фрм<>Ложь Тогда
			
			фрм.сбисПослеФормированияДокумента(Док, Кэш, Контекст);
			
		КонецЕсли;
		
		Возврат Истина;
		
	Исключение
		
		Если Кэш.Свойство("РезультатОтправки") Тогда
			
			Кэш.РезультатОтправки.НеСформировано = Кэш.РезультатОтправки.НеСформировано+1;
			Кэш.РезультатОтправки.ОшибкиДоОтправки = Кэш.РезультатОтправки.ОшибкиДоОтправки + 1;
			Кэш.ОбщиеФункции.ДобавитьОшибкуВРезультатОтправки(Кэш, "Документ не сформирован", ОписаниеОшибки(), Контекст.Документ, 726)
			
		КонецЕсли;
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
КонецФункции