
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

&НаКлиенте
Функция ПолучитьДанныеИзДокумента1С(Кэш, Контекст, ДопПараметры = Неопределено) Экспорт
// Функция формирует структуру выгружаемого файла и добавляет его в состав пакета
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	Попытка	
				
		Док = Новый Структура;
		Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш, "Файл", Контекст.ФайлДанные, Док);
		
		МодульОбъектаКлиент = МодульОбъектаКлиент();
		ПараметрыКонструктора = Новый Структура("ГрязныйИни, ДокументФайл, ДокументСсылка", Контекст.ФайлДанные, Док, Контекст.Документ);
		
		Файл_Шаблон_Модуль = МодульОбъектаКлиент.ПолучитьФормуОбработки("Файл_Шаблон");
		Файл_Шаблон_Модуль.ПолучитьДанныеИзДокумента1С_мСторона(Кэш, ПараметрыКонструктора, Контекст);
		
		КонвертСБИС = МодульОбъектаКлиент.НовыйКонвертСБИС(ПараметрыКонструктора, ДопПараметры);
		
		ПолучитьДанныеИзДокумента1С_ПослеФормированияКонверта(Кэш, Контекст, КонвертСБИС);
		Возврат Истина;
		
	Исключение
		
		ОшибкаФормированияКонверта = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), ИмяФормы + ".ПолучитьДанныеИзДокумента1С", 623201);
		Контекст.СоставПакета.Вставить("Ошибка", ОшибкаФормированияКонверта);
		
		Возврат Ложь;
		
	КонецПопытки;
КонецФункции

&НаКлиенте
Процедура ПолучитьДанныеИзДокумента1С_ПослеФормированияКонверта(Кэш, Контекст, КонвертСБИС, ДопПараметры = Неопределено) Экспорт
	
	Док					= МодульОбъектаКлиент().КонвертСБИС_Получить(КонвертСБИС, "СтруктураДокумента");
	АргументыТочкиВхода = Новый Структура("Док, Кэш, Контекст", Док, Кэш, Контекст);
		
	Контекст.СоставПакета.Вставить("Конверт", КонвертСБИС);
	МодульОбъектаКлиент().ВложениеСБИС_ПослеФормированияДокумента(КонвертСБИС, АргументыТочкиВхода);
	
	// После вызова проверить косяки с передачей переменных на сервер.
	КонвертСБИСДляОбновить = КонвертСБИС;
	Если Не Контекст = АргументыТочкиВхода.Контекст Тогда
		
		// Контекст передавали на сервер.
		Контекст = АргументыТочкиВхода.Контекст;
		КонвертСБИСДляОбновить = Контекст.СоставПакета.Конверт;
		
	КонецЕсли;
	
	Если Не АргументыТочкиВхода.Док = Док Тогда
		
		// Док передавался на сервер в функции сбисПослеФормированияДокумента.
		МодульОбъектаКлиент().КонвертСБИС_Обновить(КонвертСБИСДляОбновить, АргументыТочкиВхода.Док, "СтруктураФайла");
		
	КонецЕсли;
	
КонецПроцедуры
