&НаКлиенте
Перем Файл_Шаблон_Модуль; 

// Процедура заполняет данные документа по его параметрам
//
// Параметры:
//  Док	 - Структура - Контекст рассчитываемого документа
//  Кэш	 - Структура - Кэш обработки
//
&НаКлиенте
Процедура ЗаполнитьПоДокументПараметр(Док, Кэш) Экспорт  
	
	Файл_Шаблон_Модуль = Кэш.ГлавноеОкно.сбисПолучитьФорму("Файл_Шаблон");
	Файл_Шаблон_Модуль.ЗаполнитьПоДокументПараметр(Док, Кэш);
	
	ТекДокумент = Док.Файл.Документ;

	Если НЕ ТекДокумент.Свойство("Параметр") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока ИЗ ТекДокумент.Параметр Цикл

		Если ТекСтрока.Имя = "СвПерВещ" Тогда
			ТекДокумент.Вставить(ТекСтрока.Имя, ТекСтрока.Значение);
		КонецЕсли;  
		
		Если ТекСтрока.Имя = "ОбстФормСЧФ" Тогда
			ТекДокумент.Вставить(ТекСтрока.Имя, ТекСтрока.Значение);
		КонецЕсли;  
		
    КонецЦикла;
	
КонецПроцедуры

//Штатный обработчик строки подстановки
&НаКлиенте
Процедура ОбработчикДанных_ЗаполнитьСтрокуТабличнойЧастиДокумента(Аргумент, ДопПараметры) Экспорт
	
	Файл_Шаблон_Модуль = ДопПараметры.Кэш.ГлавноеОкно.сбисПолучитьФорму("Файл_Шаблон");
	
	Файл_Шаблон_Модуль.ОбработчикДанных_ЗаполнитьСтрокуТабличнойЧастиДокумента	(Аргумент, ДопПараметры);
	Файл_Шаблон_Модуль.УстановитьПризнакДобавленияСтроки						(Аргумент, ДопПараметры);
	
КонецПроцедуры
