
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

&НаКлиенте
Процедура ПропатчитьСтруктуруВложения(ВложениеСБИС, ДопПараметры) Экспорт
	
	УдаляемыеУзлы = Новый Массив;
	УдаляемыеУзлы.Добавить("Файл.Документ.Покупатель.Адрес.АдрРФ.НаимРегион");
	УдаляемыеУзлы.Добавить("Файл.Документ.Поставщик.Адрес.АдрРФ.НаимРегион");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузоотправитель.Адрес.АдрРФ.НаимРегион");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузополучатель.Адрес.АдрРФ.НаимРегион");

	УдаляемыеУзлы.Добавить("Файл.Документ.Покупатель.Адрес.АдрИно.НаимСтран");
	УдаляемыеУзлы.Добавить("Файл.Документ.Поставщик.Адрес.АдрИно.НаимСтран");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузоотправитель.Адрес.АдрИно.НаимСтран");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузополучатель.Адрес.АдрИно.НаимСтран");

	МодульОбъектаКлиент().ВложениеСБИС_УдалитьУзлыИзСтруктурыДанных(ВложениеСБИС, УдаляемыеУзлы);

КонецПроцедуры

// Функция - Данные строки вложения на просмотр
//
// Параметры:
//  Кэш		 - Структура - Объект класса ЛокальныйКэш
//  СтрТабл	 - Структура - Строка ТаблДок
// 
// Возвращаемое значение:
//  Структура - Представление строки для просмотра
//
&НаКлиенте
Функция ДанныеСтрокиВложенияНаПросмотр(Кэш, СтрТабл) Экспорт 
	
	ТипЧисло = Новый ОписаниеТипов("Число");

	Поля = "Название,
		|Характеристика,
		|Код,
		|ЕдИзм,
		|ОКЕИ,
		|Количество,
		|Цена,
		|СуммаБезНал,
		|СуммаНДС,
		|СтавкаНДС,
		|СуммаБезНал,
		|Сумма,
		|Идентификатор,
		|КодПокупателя,
		|GTIN,
		|ЕдИзмОрг,
		|Коэффициент,
		|Характеристика,
		|Номенклатура,
		|Отмечен";
	
	Результат = Новый Структура(Поля);
	
	ЗаполнитьЗначенияСвойств(Результат, СтрТабл);
	
	Если СтрТабл.Свойство("Характеристика")
		И ТипЗнч(СтрТабл.Характеристика) = Тип("Массив")
		И СтрТабл.Характеристика.Количество() Тогда
	
		Результат.Характеристика = СтрТабл.Характеристика[0].Значение;
	
	КонецЕсли;

	Сумма		= 0;
	Количество	= 0;
	
	Если (СтрТабл.Свойство("СуммаБезНал", Сумма)
			Или	СтрТабл.Свойство("Сумма", Сумма))
		И СтрТабл.Свойство("Кол_во", Количество)Тогда
		
		Количество	= ТипЧисло.ПривестиЗначение(Количество);
		Сумма		= ТипЧисло.ПривестиЗначение(Сумма);
		
		Цена = 0;
		Коэф = 0;
		
		Если	СтрТабл.Свойство("Цена", Цена)
			И	СтрТабл.Свойство("Коэффициент", Коэф) Тогда
			
			Коэф = ТипЧисло.ПривестиЗначение(Коэф);
			Цена = ?(НЕ Количество, Сумма / Количество, Сумма);
				
		КонецЕсли;
		
	Иначе
		
		Количество	= ТипЧисло.ПривестиЗначение(Количество);
		Цена		= ТипЧисло.ПривестиЗначение(Цена);
		
	КонецЕсли;
		
	Результат.Количество	= Формат(Количество,	"ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.000");
	Результат.Цена			= Формат(Цена,			"ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00");
	
	Если СтрТабл.Свойство("НДС") Тогда
		
		СтрТабл.НДС.Свойство("Сумма",	Результат.СуммаНДС);
		СтрТабл.НДС.Свойство("Ставка",	Результат.СтавкаНДС);
		
	КонецЕсли;
	
	СтрТабл.Свойство("ХарактеристикаНоменклатуры",	Результат.Характеристика);
	СтрТабл.Свойство("Номенклатура",				Результат.Номенклатура);
	
	Результат.Отмечен = НЕ СтрТабл.Свойство("НеЗагружать");
	
	Возврат Результат;

КонецФункции
