
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

&НаКлиенте
Функция ПолучитьТабличнуюЧастьДокумента1С(Кэш,Контекст) Экспорт 

	МодульФункций = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");

	ИмяДокумента = МодульФункций.ПолучитьРеквизитМетаданныхОбъекта(Контекст.Документ, "Имя");
	
	МассивМодулей = Новый Массив;
	МассивМодулей.Добавить("Документ_" + ИмяДокумента);
	МассивМодулей.Добавить("Файл_Шаблон");

	МодульДанныхСтроки = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ПолучитьТабличнуюЧастьДокумента1С", МассивМодулей);  
	
	Контекст.Вставить("СохранятьСсылки", Ложь);
	
	Возврат МодульДанныхСтроки.ПолучитьТабличнуюЧастьДокумента1С(Кэш, Контекст);
	
КонецФункции

&НаКлиенте
Процедура СформироватьОснование(Док, Кэш) Экспорт

	ТекДокумент = Док.Файл.Документ;
	Если НЕ ТекДокумент.Свойство("Основание") Тогда
		Возврат;	
	КонецЕсли;
	
	Исключения = ПолучитьИсключенияОснование();
	ОснованиеМассив = Новый Массив;
	
	Для Каждого ТекСтрока ИЗ ТекДокумент.Основание Цикл
		
		Если ТекСтрока.Свойство("Тип") Тогда
			Ключ = "Тип";	
		Иначе
			Ключ = "Название";	
		КонецЕсли;
		
		Если Исключения.Получить(ТекСтрока[Ключ]) = Истина Тогда
			Продолжить;	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Название) Тогда
			Продолжить;	
		КонецЕсли;
		
		Если НЕ ТекСтрока.Свойство("Дата") Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Дата) И ТекСтрока.Название <> "-" Тогда
			Продолжить;	
		КонецЕсли; 
		
		Основание = Новый Структура("Номер, Название, Дата, ДопСвед");
		Основание.Название 	= ТекСтрока.Название;
		Основание.Номер 	= ТекСтрока.Номер;
		Основание.Дата 		= ТекСтрока.Дата;
		
		ТекСтрока.Свойство("ДопСвед", Основание.ДопСвед);
		
		ОснованиеМассив.Добавить(Основание);
		
	КонецЦикла;
	
	Если НЕ ОснованиеМассив.Количество() Тогда
		ОснованиеМассив.Добавить(Новый Структура("Название", "-"));
	КонецЕсли;
	
	ТекДокумент.Вставить("Основание", ОснованиеМассив);
	
КонецПроцедуры   

&НаКлиенте
Функция ПолучитьИсключенияОснование()
	
	ИсключенияИнфПол = Новый Соответствие;
	ИсключенияИнфПол.Вставить("ПРД", Истина);
	ИсключенияИнфПол.Вставить("СчФ", Истина);
	ИсключенияИнфПол.Вставить("КСчФ", Истина);
	ИсключенияИнфПол.Вставить("ИспрСчФ", Истина);
	ИсключенияИнфПол.Вставить("ИсхСчФ", Истина);
	ИсключенияИнфПол.Вставить("ИспрИсхСчФ", Истина);
	ИсключенияИнфПол.Вставить("ДокПодтвОтгр", Истина);
	
	Возврат ИсключенияИнфПол;
	
КонецФункции
