
&НаКлиенте
Перем Файл_Шаблон_Модуль; 

#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

&НаКлиенте
Функция СформироватьДокументДляГенератора(ПараметрыФормированияВходящие, Кэш) Экспорт  
	
	УПД24 = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("УПД24");
	
   	Файл_Шаблон_Модуль = Кэш.ГлавноеОкно.сбисПолучитьФорму("Файл_Шаблон");
	Файл_Шаблон_Модуль.СформироватьДокументДляГенератора(ПараметрыФормированияВходящие, Кэш);
		
	ТекДокумент = ПараметрыФормированияВходящие.Документ.Файл.Документ;  
	
	Если УПД24 Тогда
		ТекДокумент.ПоФактХЖ = "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
	КонецЕсли;

	Для каждого Основание Из ТекДокумент.Основание Цикл
	
		Если Основание.Название = "ДокПодтвОтгр" Тогда 
			ТекДокумент.Вставить("НаимДокОпр", Основание.НаимДокОтгр);
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
КонецФункции

// Процедура заполняет данные документа по его параметрам
//
// Параметры:
//  Док	 - Структура - Контекст рассчитываемого документа
//  Кэш	 - Структура - Кэш обработки
//
&НаКлиенте
Процедура ЗаполнитьПоДокументПараметр(Док, Кэш) Экспорт  
	
	Файл_Шаблон_Модуль = Кэш.ГлавноеОкно.сбисПолучитьФорму("Файл_Шаблон");
	Файл_Шаблон_Модуль.ЗаполнитьПоДокументПараметр(Док, Кэш);
	
	ТекДокумент = Док.Файл.Документ;

	Если НЕ ТекДокумент.Свойство("Параметр") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока ИЗ ТекДокумент.Параметр Цикл

		Если ТекСтрока.Имя = "СвПерВещ" Тогда
			ТекДокумент.Вставить(ТекСтрока.Имя, ТекСтрока.Значение);
		КонецЕсли;  
		
		Если ТекСтрока.Имя = "ОбстФормСЧФ" Тогда
			ТекДокумент.Вставить(ТекСтрока.Имя, ТекСтрока.Значение);
		КонецЕсли;  
		
    КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДокументОснование(Док, Кэш) Экспорт
	
	Файл_Шаблон_Модуль = Кэш.ГлавноеОкно.сбисПолучитьФорму("Файл_Шаблон");
	Файл_Шаблон_Модуль.ЗаполнитьПоДокументОснование(Док, Кэш);
	
	ТекДокумент = Док.Файл.Документ;
		
	НаимДокОтгр = "Универсальный передаточный документ";
	Для каждого Основание Из ТекДокумент.Основание Цикл
		Если Основание.Свойство("НаимДокОтгр")
			И ЗначениеЗаполнено(Основание.НаимДокОтгр) Тогда
			
			НаимДокОтгр = Основание.НаимДокОтгр;
			Прервать;
			
		КонецЕсли;
	КонецЦикла;

	Если Не ТекДокумент.Свойство("ДокПодтвОтгр") Тогда
		
		ТекДокумент.Вставить("ДокПодтвОтгр", Новый Структура());
		ТекДокумент.ДокПодтвОтгр.Вставить("ДатаДокОтгр", ТекДокумент.Дата);
		ТекДокумент.ДокПодтвОтгр.Вставить("НомДокОтгр",  ТекДокумент.Номер);
		ТекДокумент.ДокПодтвОтгр.Вставить("НаимДокОтгр", НаимДокОтгр);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОснование(Док, Кэш) Экспорт 
	
	УПД24 = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("УПД24");

	ТекДокумент = Док.Файл.Документ;
	Если НЕ ТекДокумент.Свойство("Основание") Тогда
		Возврат;	
	КонецЕсли;
	
	Исключения = ПолучитьИсключенияОснование();
	ОснованиеМассив = Новый Массив;
	
	Для Каждого ТекСтрока ИЗ ТекДокумент.Основание Цикл
		
		Если ТекСтрока.Свойство("Тип") Тогда
			Ключ = "Тип";	
		Иначе
			Ключ = "Название";	
		КонецЕсли;
		
		Если Исключения.Получить(ТекСтрока[Ключ]) = Истина Тогда
			Продолжить;	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Название) Тогда
			Продолжить;	
		КонецЕсли;
		
		Если НЕ ТекСтрока.Свойство("Дата") Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Дата) И ТекСтрока.Название <> "-" Тогда
			Продолжить;	
		КонецЕсли;  
		
		Если УПД24
			И НЕ ЗначениеЗаполнено(ТекСтрока.Номер) Тогда
			ТекСтрока.Номер = "Без номера";
		КонецЕсли;
		
		Основание = Новый Структура("Номер, Название, Дата");
		Основание.Название 	= ТекСтрока.Название;
		Основание.Номер 	= ТекСтрока.Номер;
		Основание.Дата 		= ТекСтрока.Дата;
		
		ОснованиеМассив.Добавить(Основание);
		
	КонецЦикла;
	
	ЕстьОснование = ОснованиеМассив.Количество();
		
	Если НЕ ЕстьОснование Тогда
		
		Если УПД24 Тогда
			ТекДокумент.Вставить("БезДокОснПер", "1");	
		Иначе  
			ОснованиеМассив.Добавить(Новый Структура("Название", "Без документа-основания"));
		КонецЕсли; 
		
	КонецЕсли;
	
	ТекДокумент.Вставить("Основание", ОснованиеМассив);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИсключенияОснование()
	
	ИсключенияИнфПол = Новый Соответствие;
	ИсключенияИнфПол.Вставить("ПРД", Истина);
	ИсключенияИнфПол.Вставить("СчФ", Истина);
	ИсключенияИнфПол.Вставить("КСчФ", Истина);
	ИсключенияИнфПол.Вставить("ИспрСчФ", Истина);
	ИсключенияИнфПол.Вставить("ИсхСчФ", Истина);
	ИсключенияИнфПол.Вставить("ИспрИсхСчФ", Истина);
	ИсключенияИнфПол.Вставить("ДокПодтвОтгр", Истина);
	
	Возврат ИсключенияИнфПол;
	
КонецФункции

//Штатный обработчик строки подстановки
&НаКлиенте
Процедура ОбработчикДанных_ЗаполнитьСтрокуТабличнойЧастиДокумента(Аргумент, ДопПараметры) Экспорт
	
	Файл_Шаблон_Модуль = ДопПараметры.Кэш.ГлавноеОкно.сбисПолучитьФорму("Файл_Шаблон");
	
	Файл_Шаблон_Модуль.ОбработчикДанных_ЗаполнитьСтрокуТабличнойЧастиДокумента	(Аргумент, ДопПараметры);
	Файл_Шаблон_Модуль.УстановитьПризнакДобавленияСтроки						(Аргумент, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНоменклатуруВложения(Кэш, Контекст) Экспорт
	
	ФормаФайл = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ОбновитьНоменклатуруВложения", "Файл_СчФктр_3_01");
	ФормаФайл.ОбновитьНоменклатуруВложения(Кэш, Контекст);
	
КонецПроцедуры   

&НаКлиенте
Процедура СформироватьПараметры(Док, Кэш) Экспорт
	
	ТекФайл		= Док.Файл;
	ТекДокумент = ТекФайл.Документ;
	Файл_Шаблон = МодульОбъектаКлиент().ПолучитьФормуОбработки("Файл_Шаблон");

	Если НЕ ТекДокумент.Свойство("Параметр") Тогда
		Возврат;
	КонецЕсли;
	
	мПараметры = ТекДокумент.Параметр;

	Файл_Шаблон.ДобавитьПараметрДокументаПоПути(ТекДокумент, мПараметры, "Получатель.GLN",			"GLNПокуп",			Кэш);
	Файл_Шаблон.ДобавитьПараметрДокументаПоПути(ТекДокумент, мПараметры, "Грузополучатель.GLN",		"GLNГрузПолуч",		Кэш);
	Файл_Шаблон.ДобавитьПараметрДокументаПоПути(ТекДокумент, мПараметры, "Отправитель.GLN",			"GLNПост",			Кэш);
	Файл_Шаблон.ДобавитьПараметрДокументаПоПути(ТекДокумент, мПараметры, "Грузоотправитель.GLN",	"GLNГрузОтпр",		Кэш);

	Если НЕ МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("УПД24") Тогда
		//Выгрузка наименований для физ.лиц
		Файл_Шаблон.ДобавитьПолноеИмяФизЛицаПоПути(ТекДокумент, мПараметры, "Отправитель",		"НаимПост",			Кэш);
		Файл_Шаблон.ДобавитьПолноеИмяФизЛицаПоПути(ТекДокумент, мПараметры, "Получатель",		"НаимПокуп",		Кэш);
		Файл_Шаблон.ДобавитьПолноеИмяФизЛицаПоПути(ТекДокумент, мПараметры, "Грузоотправитель",	"НаимГрузОтпр",		Кэш);
		Файл_Шаблон.ДобавитьПолноеИмяФизЛицаПоПути(ТекДокумент, мПараметры, "Грузополучатель",	"НаимГрузПолуч",	Кэш);
	КонецЕсли;

	Файл_Шаблон.ДобавитьПараметрДокументаПоПути(ТекФайл,	мПараметры,	"КодФормы",	"ИдВизуализации",	Кэш);
		
	мПараметры = Файл_Шаблон.ПолучитьПараметрыБезПустыхЗаписей(Кэш, мПараметры);
	
	Если мПараметры.Количество() <> 0 Тогда
		ТекДокумент.Вставить("Параметры", мПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПропатчитьИмяФайлаВложения(ВложениеСБИС, ДопПараметры) Экспорт 
	
	Перем ПолучательИд, ОтправительИд, ФайлИмяПропатчить, лДанныеСторон;
	
	СтруктураФайла      = МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
	ФайлПропатчить		= МодульОбъектаКлиент().ВложениеСБИС_Получить(СтруктураФайла, "Файл");
	УПД24 = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("УПД24");
	
	ДатаВремяСоздания	= ТекущаяДата();     
	
	Если ДопПараметры.Свойство("ПутьКСторонам") Тогда
		лДанныеСторон = МодульОбъектаКлиент().ПолучитьДанныеПоПути(Новый Структура("Данные, Путь", ФайлПропатчить, ДопПараметры.ПутьКСторонам));
	Иначе
		лДанныеСторон = ФайлПропатчить.Документ;
	КонецЕсли;    
	
	ИдФайлаДляИмениФайла = МодульОбъектаКлиент().СтруктураИдФайлаПередаточногоДокумента();  
	
	МодульОбъектаКлиент().ПропатчитьИдФайлаДляИмениФайла(ИдФайлаДляИмениФайла, ФайлПропатчить);	
	
	Если НЕ ФайлПропатчить.Свойство("Имя") Тогда    
		
		Возврат;
		
	КонецЕсли;
		
	Если УПД24 Тогда
		ФайлИмяПропатчить = "ON_NSCHFDOPPR_"
	ИначеЕсли ИдФайлаДляИмениФайла.N3 = "1" Тогда
		ФайлИмяПропатчить = "ON_NSCHFDOPPRMARK_";
	ИначеЕсли ИдФайлаДляИмениФайла.N2 = "1" Тогда
		ФайлИмяПропатчить = "ON_NSCHFDOPPRPROS_";  
	Иначе
		ФайлИмяПропатчить = ФайлПропатчить.Имя;
	КонецЕсли;		 
	
	Если	ДопПараметры.ГрязныйИни.Свойство("мСторона") 
		И	лДанныеСторон[ДопПараметры.ПолучательРоль].Свойство("Идентификатор",	ПолучательИД) 
		И	лДанныеСторон[ДопПараметры.ОтправительРоль].Свойство("Идентификатор",	ОтправительИД) Тогда
		ФайлИмяПропатчить = ФайлИмяПропатчить + ПолучательИД + "_" + ОтправительИД;
	Иначе
		ФайлИмяПропатчить = ФайлИмяПропатчить + "_";
	КонецЕсли; 
	
	Если УПД24 Тогда
		ФайлПропатчить.Имя = ФайлИмяПропатчить + "_" + Формат(ДатаВремяСоздания, "ДФ=ггггММдд") + "_" + Строка(Новый УникальныйИдентификатор())
			+ "_" + ИдФайлаДляИмениФайла.N2 + "_" + ИдФайлаДляИмениФайла.N3 + "_" + ИдФайлаДляИмениФайла.N4 + "_" + ИдФайлаДляИмениФайла.N5 + "_0_00";
	Иначе
		ФайлПропатчить.Имя = ФайлИмяПропатчить + "_" + Формат(ДатаВремяСоздания, "ДФ=ггггММдд") + "_" + Строка(Новый УникальныйИдентификатор());
	КонецЕсли;

КонецПроцедуры