
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

&НаКлиенте
Функция ПолучитьДанныеИзДокумента1С(Кэш, Контекст, ДопПараметры = Неопределено) Экспорт
	Перем Файл_Формат, Файл_ВерсияФормата, ВходящийКонтекстРасчета, ДокПодтвПоИни;
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	Контекст.ФайлДанные.Свойство("Файл_Формат", Файл_Формат);
	Контекст.ФайлДанные.Свойство("Файл_ВерсияФормата", Файл_ВерсияФормата);
	Файл_Формат = Кэш.ОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(Файл_Формат);
	Файл_ВерсияФормата = Кэш.ОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(Файл_ВерсияФормата);
	
	// Подготовка для ВФК
	ИмяФормыПоФормату = "Файл_" + Кэш.ОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(Контекст.ФайлДанные.Файл_Формат)
						+ "_" + Кэш.ОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(Контекст.ФайлДанные.Файл_ВерсияФормата);
	ОсновныеФормыВФК = Новый Массив;
	ОсновныеФормыВФК.Добавить(ИмяФормыПоФормату);
	ОсновныеФормыВФК.Добавить("Файл_Шаблон");
	ДопПараметры.Вставить("ОсновныеФормыВФК", ОсновныеФормыВФК);
	
	МассивВозможныхФорм = Новый Массив;
	Если Контекст.ФайлДанные.Свойство("ФормаФормирования") Тогда
		МассивВозможныхФорм.Добавить(Контекст.ФайлДанные.ФормаФормирования);
	КонецЕсли;
	МассивВозможныхФорм.Добавить("Файл_" + Файл_Формат + "_" + Файл_ВерсияФормата);
	МассивВозможныхФорм.Добавить("Файл_Шаблон" + ?(Файл_ВерсияФормата = "3_01", "", "_" + Файл_ВерсияФормата));
	
	// Функция формирует структуру табличной части файла СФ по документам-основаниям
	Попытка	
		// проверяем надо ли пересчитывать суммы в валюту учета
		Валюта = Кэш.ОбщиеФункции.РассчитатьЗначение("Валюта", Контекст.ФайлДанные,Кэш);
		ВалютаУчета = Кэш.ОбщиеФункции.РассчитатьЗначение("ВалютаУчета", Контекст.ФайлДанные,Кэш);
		Если ЗначениеЗаполнено(Валюта) И ЗначениеЗаполнено(ВалютаУчета) И Валюта <> ВалютаУчета Тогда
			ПересчитатьВВалютеУчета = Кэш.ОбщиеФункции.РассчитатьЗначение("ПересчитатьВВалютеУчета", Контекст.ФайлДанные,Кэш);
		Иначе
			ПересчитатьВВалютеУчета = Ложь;
		КонецЕсли;
		Если ПересчитатьВВалютеУчета=Истина Тогда
			Если Контекст.ФайлДанные.Свойство("Валюта_КодОКВ") И Контекст.ФайлДанные.Свойство("ВалютаУчета_КодОКВ") Тогда
				Контекст.ФайлДанные.Валюта_КодОКВ = Контекст.ФайлДанные.ВалютаУчета_КодОКВ;
			КонецЕсли;
			Если Контекст.ФайлДанные.Свойство("Валюта_Название") И Контекст.ФайлДанные.Свойство("ВалютаУчета_Название") Тогда
				Контекст.ФайлДанные.Валюта_Название = Контекст.ФайлДанные.ВалютаУчета_Название;
			КонецЕсли;
		КонецЕсли;
	
		Контекст.Вставить("ТаблДок",Новый Структура());
		Контекст.ТаблДок.Вставить("ИтогТабл",Новый Массив);
		Контекст.ТаблДок.Вставить("СтрТабл",Новый Массив);
		Контекст.Вставить("ИтогСумма",0);
		Контекст.Вставить("ИтогСуммаБезНалога",0);
		Контекст.Вставить("ИтогСуммаНДС",0);
		Контекст.Вставить("ИтогКоличество",0);
		Контекст.Вставить("ИтогБрутто",0);
		Контекст.Вставить("ИтогНетто",0);
		Контекст.Вставить("ИтогКолМест",0);
		
		Контекст.Вставить("ПредИтогСумма",0);
		Контекст.Вставить("ПредИтогСуммаБезНалога",0);
		Контекст.Вставить("ПредИтогСуммаНДС",0);

		Контекст.Вставить("НДСИсчисляетсяАгентом", Кэш.ОбщиеФункции.РассчитатьЗначение("НДСИсчисляетсяАгентом", Контекст.ФайлДанные) = Истина);
		Документ = Контекст.Документ;
		ини = Контекст.ФайлДанные;
		
		УказанТипНоменклатуры = Ложь;
		КолТоваров = 0;
		сч = 1;
		счСвернутых = 1;
    		
		Для Каждого Параметр Из Контекст.ФайлДанные.мТаблДок Цикл
			
			ТабЧасть = Новый Массив;
			Если ТипЗнч(Параметр.Значение)=Тип("Массив") Тогда
				ТабЧасть = Параметр.Значение	
			Иначе
				ТабЧасть.Добавить(Параметр.Значение); // если у СФ только 1 основание
			КонецЕсли;
			МассивИд = Новый Массив;
			
			// Условие перезаполнения ДокПодтвОтгр для СФ
			Перезаполнить5А =		Контекст.ФайлДанные.Свойство("мОснование")
							И		Контекст.ФайлДанные.Свойство("Вложение_Тип") 
							И НРег(	Контекст.ФайлДанные.Вложение_Тип) = "счфктр";
			Если Перезаполнить5А Тогда
				Если НЕ Контекст.ФайлДанные.мОснование.Свойство("ДокПодтвОтгр", ДокПодтвПоИни) Тогда
					ДокПодтвПоИни = Новый Массив;
				КонецЕсли;
				Контекст.ФайлДанные.мОснование.Вставить("ДокПодтвОтгр", Новый Массив);
			КонецЕсли;
			
			// Перебираем документы-основания, из каждого добавляем табличную часть в СФ
			Если НЕ Контекст.ДокументДанные.Свойство("ВходящийКонтекст", ВходящийКонтекстРасчета) Тогда
				
				ВходящийКонтекстРасчета = Новый Структура;
				
			КонецЕсли;
			
			Для Каждого ДокОсн Из ТабЧасть Цикл
				ДокОснование = ДокОсн.ТаблДок_ДокументОснование;
				ИмяДокумента = Кэш.ОбщиеФункции.ПолучитьРеквизитМетаданныхОбъекта(ДокОснование, "Имя");
				ИниДокумента = ИмяДокумента;
				Попытка
					Если Кэш.ФормаНастроек.Ини(Кэш, Кэш.Текущий.ТипДок).Свойство(ИниДокумента) Тогда
						ИниДокумента = Кэш.ОбщиеФункции.РассчитатьЗначение(ИмяДокумента,Кэш.ФормаНастроек.Ини(Кэш, Кэш.Текущий.ТипДок),Кэш);
					КонецЕсли;
				Исключение
				КонецПопытки;
				Если Контекст.ДокументДанные.Свойство(ИмяДокумента) Тогда
					ИниДокумента = Кэш.ОбщиеФункции.РассчитатьЗначение(ИмяДокумента,Контекст.ДокументДанные,Кэш);
				КонецЕсли;
				Если Не Кэш.ини.Свойство(ИниДокумента) Тогда
					Сообщить("Основанием документа "+строка(Контекст.Документ)+" является "+строка(ДокОснование)+". Отсутствует настройка для формирования электронных документов данного типа.");
					Возврат Ложь;
				КонецЕсли;
				ДокументДанные = Неопределено;
				// Проверяем, есть ли в кэше по пакету данные по документу-основанию
				Если Кэш.КэшЗначенийИни.ТекущийПакет.Свойство("СоответствиеДокументДанные") Тогда
					КэшПоОснованию = Кэш.КэшЗначенийИни.ТекущийПакет.СоответствиеДокументДанные.Получить(ДокОснование);
					Если КэшПоОснованию <> Неопределено и КэшПоОснованию.ИмяИни = ИниДокумента Тогда
						ДокументДанные = КэшПоОснованию.ДокументДанные;
					КонецЕсли;
				КонецЕсли;
				Если ДокументДанные = Неопределено Тогда
					
					ЗначениеИни = Кэш.ФормаНастроек.Ини(Кэш, ИниДокумента);
					ЗначениеИни.Вставить("Формат2016", Новый Структура("Значение,РассчитанноеЗначение", Истина, Истина));
					ЗначениеИни.Вставить("Формат2019", Новый Структура("Значение,РассчитанноеЗначение", Истина, Истина));
					ЗначениеИни.Вставить("ФорматУКД2020", Новый Структура("Значение,РассчитанноеЗначение", Истина, Истина));
					ЗначениеИни.Вставить("ВходящийКонтекст", Новый Структура("Значение,РассчитанноеЗначение", "", ВходящийКонтекстРасчета));
					ЗначениеИни.Вставить("ИспользоватьШтрихкодыНоменклатурыКонтрагентов",	Новый Структура("Значение,РассчитанноеЗначение", Кэш.Парам.ИспользоватьШтрихкодыНоменклатурыКонтрагентов, Кэш.Парам.ИспользоватьШтрихкодыНоменклатурыКонтрагентов));
					ДокументДанные = Кэш.ОбщиеФункции.ПолучитьДанныеДокумента1С(ЗначениеИни, ДокОснование, Кэш.КэшЗначенийИни, Кэш.Парам);  // alo Меркурий
					
				КонецЕсли;
				ВременныйКонтекст = Новый Структура();
				ВременныйКонтекст.Вставить("СФ",Контекст.ФайлДанные.Документ);
				ВременныйКонтекст.Вставить("Документ",ДокОснование);
				ВременныйКонтекст.Вставить("ДокументДанные", ДокументДанные);
				ВременныйКонтекст.Вставить("ФайлДанные", Новый Структура);
				ВременныйКонтекст.Вставить("ИтогСумма",0);
				ВременныйКонтекст.Вставить("ИтогСуммаБезНалога",0);
				ВременныйКонтекст.Вставить("ИтогСуммаНДС",0);
				ВременныйКонтекст.Вставить("ИтогКоличество",0);
				ВременныйКонтекст.Вставить("ИтогБрутто",0);
				ВременныйКонтекст.Вставить("ИтогНетто",0);
				ВременныйКонтекст.Вставить("ИтогКолМест",0);
				ВременныйКонтекст.Вставить("ПредИтогСумма",0);
				ВременныйКонтекст.Вставить("ПредИтогСуммаБезНалога",0);
				ВременныйКонтекст.Вставить("ПредИтогСуммаНДС",0);
				ВременныйКонтекст.Вставить("ТаблДок",Новый Структура());
				ВременныйКонтекст.ТаблДок.Вставить("СтрТабл",Новый Массив);
				
				//Подменяем во временном контексте признак необходимости пересчета в валюту, т.к. для фактуры и накладной он может отличаться
				Для Каждого Файл Из ВременныйКонтекст.ДокументДанные.мФайл Цикл
					Файл = Файл.Значение;
					Если Файл.Свойство("ПересчитатьВВалютеУчета") Тогда
						Файл.ПересчитатьВВалютеУчета = ПересчитатьВВалютеУчета;
					КонецЕсли;
					
				КонецЦикла;
				
				фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПрочитатьТабличнуюЧасть","Документ_"+ИмяДокумента,"Документ_Шаблон",Кэш);
				Если не фрм.ПрочитатьТабличнуюЧасть(Кэш,ВременныйКонтекст) Тогда
					Возврат Ложь;
				КонецЕсли;
				
				Для Каждого Строка Из ВременныйКонтекст.ТаблДок.СтрТабл Цикл
					Если Строка.Свойство("Тип") Тогда
						УказанТипНоменклатуры = Истина;
						Если Строка.Тип = "1" Тогда
							КолТоваров = КолТоваров+1;
						КонецЕсли;
					КонецЕсли;
					
					Если Контекст.ФайлДанные.Свойство("СвернутьКолонкиГруппировок") и Контекст.ФайлДанные.Свойство("СвернутьКолонкиСуммирования") Тогда
						//Если есть задача свернуть колонки, то сформируем ключ поиска
						МассивКолонок = Кэш.ОбщиеФункции.РазбитьСтрокуВМассивНаКлиенте(Контекст.ФайлДанные.СвернутьКолонкиГруппировок, ",");
						ИдСтроки = "";
						Для каждого ИмяКолонки из МассивКолонок Цикл
							ПозТочки = Найти(ИмяКолонки, ".");
							Если ПозТочки > 0 Тогда
								ИдСтроки = ИдСтроки + Строка[Лев(ИмяКолонки, ПозТочки - 1)][Сред(ИмяКолонки, ПозТочки + 1)];
							Иначе	
								ИдСтроки = ИдСтроки + СокрЛП(Строка[ИмяКолонки]);
							КонецЕсли;	
						КонецЦикла;
						ИндексМассива = МассивИд.Найти(ИдСтроки);
						Если ИндексМассива = Неопределено  Тогда //Если не нашли по индексу добавляем всю стр целиком							
							Строка.Вставить("ПорНомер",Формат(счСвернутых, "ЧГ=0"));
							Контекст.ТаблДок.СтрТабл.Добавить(Строка);
							МассивИд.Добавить(ИдСтроки);  
							счСвернутых = счСвернутых + 1;
						Иначе
							НайденаяСтрока = Контекст.ТаблДок.СтрТабл[ИндексМассива];
							//иначе суммируем необходимые значения
							МассивКолонок = Кэш.ОбщиеФункции.РазбитьСтрокуВМассивНаКлиенте(Контекст.ФайлДанные.СвернутьКолонкиСуммирования, ",");
							Для каждого ИмяКолонки из МассивКолонок Цикл
								ПозТочки = Найти(ИмяКолонки, ".");
								Если ПозТочки > 0 Тогда
									НайденаяСтрока[Лев(ИмяКолонки, ПозТочки - 1)][Сред(ИмяКолонки, ПозТочки + 1)] = Число(НайденаяСтрока[Лев(ИмяКолонки, ПозТочки - 1)][Сред(ИмяКолонки, ПозТочки + 1)]) + Число(Строка[Лев(ИмяКолонки, ПозТочки - 1)][Сред(ИмяКолонки, ПозТочки + 1)]);
								Иначе	
									НайденаяСтрока[ИмяКолонки] = Число(НайденаяСтрока[ИмяКолонки]) + Число(Строка[ИмяКолонки]);
								КонецЕсли;	
								// alo
								Если ИмяКолонки = "Сумма" 
									Или ИмяКолонки = "Цена" 
									Или ИмяКолонки = "СуммаБезНал" Тогда
									НайденаяСтрока[ИмяКолонки] = Формат(НайденаяСтрока[ИмяКолонки], "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00");
								КонецЕсли;
								Если ИмяКолонки = "НДС.Сумма" Тогда
									НайденаяСтрока["НДС"]["Сумма"] = Формат(НайденаяСтрока["НДС"]["Сумма"], "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"); 
								КонецЕсли;  
							КонецЦикла;	
						КонецЕсли;	
					Иначе
						Строка.Вставить("ПорНомер",Формат(сч, "ЧГ=0"));
						Контекст.ТаблДок.СтрТабл.Добавить(Строка);
					КонецЕсли;
					сч = сч + 1;
				КонецЦикла;
				Контекст.ИтогСумма = Контекст.ИтогСумма+ВременныйКонтекст.ИтогСумма;
				Контекст.ИтогСуммаБезНалога = Контекст.ИтогСуммаБезНалога+ВременныйКонтекст.ИтогСуммаБезНалога;
				Контекст.ИтогСуммаНДС = Контекст.ИтогСуммаНДС+ВременныйКонтекст.ИтогСуммаНДС;
				Попытка
					Контекст.ИтогБрутто = Контекст.ИтогБрутто + ВременныйКонтекст.ИтогБрутто;
				Исключение
				КонецПопытки; 
				Попытка
					Контекст.ИтогКоличество = Контекст.ИтогКоличество + ВременныйКонтекст.ИтогКоличество;
				Исключение
				КонецПопытки;
				Попытка
					Контекст.ИтогНетто = Контекст.ИтогНетто + ВременныйКонтекст.ИтогНетто;
				Исключение
				КонецПопытки;
				Попытка
					Контекст.ИтогКолМест = Контекст.ИтогКолМест + ВременныйКонтекст.ИтогКолМест;
				Исключение
				КонецПопытки;
				Если ВременныйКонтекст.Свойство("ЕстьПредыдущиеДанные") Тогда
					Если Не Контекст.Свойство("ЕстьПредыдущиеДанные") Тогда
						Контекст.Вставить("ЕстьПредыдущиеДанные", Истина);
					КонецЕсли;
					Контекст.ПредИтогСумма = Контекст.ПредИтогСумма+ВременныйКонтекст.ПредИтогСумма;
					Контекст.ПредИтогСуммаБезНалога = Контекст.ПредИтогСуммаБезНалога+ВременныйКонтекст.ПредИтогСуммаБезНалога;
					Контекст.ПредИтогСуммаНДС = Контекст.ПредИтогСуммаНДС+ВременныйКонтекст.ПредИтогСуммаНДС;
				КонецЕсли;

				Если	Не Контекст.ФайлДанные.мСторона.Свойство("Грузоотправитель") // берем грузоотправителя с основания СФ
					Или	Не ЗначениеЗаполнено(Контекст.ФайлДанные.мСторона.Грузоотправитель.Сторона) Тогда
					
					Если ВременныйКонтекст.ДокументДанные.Свойство("мФайл")	Тогда
						НайденоОснованиеСоСтороной = Ложь;
						Для Каждого Элемент Из ВременныйКонтекст.ДокументДанные.мФайл Цикл
							Если Элемент.Значение.Свойство("мТаблДок") Тогда
								Если (Элемент.Значение.мТаблДок.Свойство("Товары") и Элемент.Значение.мТаблДок.Товары.Количество()>0) или (УказанТипНоменклатуры и КолТоваров>0) Тогда
									Если Элемент.Значение.Свойство("мСторона") и Элемент.Значение.мСторона.Свойство("Грузоотправитель") Тогда
										Контекст.ФайлДанные.мСторона.Вставить("Грузоотправитель", Новый Структура);
										Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Контекст.ФайлДанные.мСторона.Грузоотправитель,Элемент.Значение.мСторона.Грузоотправитель);
										НайденоОснованиеСоСтороной = Истина;
									КонецЕсли;
									Если НайденоОснованиеСоСтороной Тогда    // прерываем, когда заполнили данные с какого-либо основания
										Прервать;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
				КонецЕсли;
				
				Если	Не Контекст.ФайлДанные.мСторона.Свойство("Грузополучатель") // берем грузополучателя с основания СФ
					Или	Не ЗначениеЗаполнено(Контекст.ФайлДанные.мСторона.Грузополучатель.Сторона) Тогда
					
					Если ВременныйКонтекст.ДокументДанные.Свойство("мФайл")	Тогда
						НайденоОснованиеСоСтороной = Ложь;
						Для Каждого Элемент Из ВременныйКонтекст.ДокументДанные.мФайл Цикл
							Если Элемент.Значение.Свойство("мТаблДок") Тогда
								Если (Элемент.Значение.мТаблДок.Свойство("Товары") и Элемент.Значение.мТаблДок.Товары.Количество()>0) или (УказанТипНоменклатуры и КолТоваров>0) Тогда
									Если Элемент.Значение.Свойство("мСторона") и Элемент.Значение.мСторона.Свойство("Грузополучатель") Тогда
										Контекст.ФайлДанные.мСторона.Вставить("Грузополучатель", Новый Структура);
										Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Контекст.ФайлДанные.мСторона.Грузополучатель,Элемент.Значение.мСторона.Грузополучатель);
										НайденоОснованиеСоСтороной = Истина;
									КонецЕсли;
									Если НайденоОснованиеСоСтороной Тогда    // прерываем, когда заполнили данные с какого-либо основания
										Прервать;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
				КонецЕсли;
				
				Если Перезаполнить5А Тогда
					ДопПараметрыДокПодтвОтгр = Новый Структура("ДокПодтвПоИни, Перезаполнить5А", ДокПодтвПоИни, Перезаполнить5А);
					ДополнитьДаннымиДокПодтвОтгр(Кэш, Контекст, ВременныйКонтекст, ДопПараметрыДокПодтвОтгр);
					Перезаполнить5А = ДопПараметрыДокПодтвОтгр.Перезаполнить5А;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
		Если Контекст.ФайлДанные.Свойство("СвернутьКолонкиСуммирования") И НЕ Контекст.ФайлДанные.Свойство("СвернутьКолонкиГруппировок") Тогда
			Контекст.ТаблДок.СтрТабл = Кэш.ОбщиеФункции.СвернутьМассивСтрокДокумента(Кэш, Контекст.ТаблДок.СтрТабл, Контекст.ФайлДанные.СвернутьКолонкиСуммирования);
		КонецЕсли;
		// Добавим номера строк исх. сч. ф.
		Если Контекст.ДокументДанные.Свойство("ВходящийКонтекст")  Тогда
			МассивИсходныхНомеровСтрок = Контекст.ДокументДанные.ВходящийКонтекст.МассивИсходныхНомеровСтрок;
			Если	МассивИсходныхНомеровСтрок.Количество() > 0
				И	Контекст.ТаблДок.СтрТабл.Количество() > 0 Тогда
				
				Для ИндСтр = 0 По Контекст.ТаблДок.СтрТабл.ВГраница() Цикл
					Если ИндСтр > МассивИсходныхНомеровСтрок.ВГраница() Тогда
						Контекст.ТаблДок.СтрТабл[ИндСтр].Вставить("ПорНомТовВСЧФ","");
					Иначе
						Контекст.ТаблДок.СтрТабл[ИндСтр].Вставить("ПорНомТовВСЧФ",Формат(МассивИсходныхНомеровСтрок[ИндСтр], "ЧГ=0"));
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если УказанТипНоменклатуры = Ложь или (УказанТипНоменклатуры и КолТоваров>0) Тогда
			Контекст.Вставить("ЗаполнятьГрузотпрГрузполуч", Истина);
		Иначе
			Контекст.Вставить("ЗаполнятьГрузотпрГрузполуч", Ложь);
		КонецЕсли;

		
		ИтогТабл=Новый Структура;
		ИтогТабл.Вставить("Сумма", Формат(Контекст.ИтогСумма, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));
		ИтогТабл.Вставить("Кол_во", Формат(Контекст.ИтогКоличество, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));
		ИтогТабл.Вставить("СуммаБезНал", Формат(Контекст.ИтогСуммаБезНалога, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));
		ИтогТабл.Вставить("НДС",Новый Структура);
		ИтогТабл.НДС.Вставить("Сумма",Формат(Контекст.ИтогСуммаНДС, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));
		Если Контекст.ИтогКолМест>0 Тогда
			ИтогТабл.Вставить("Упаковка",Новый Структура);
			ИтогТабл.Упаковка.Вставить("КолМест",Формат(Контекст.ИтогКолМест, "ЧЦ=17; ЧДЦ=0; ЧРД=.; ЧГ=0; ЧН=0"));	
		КонецЕсли;
		
		Если Контекст.ФайлДанные.Свойство("ЕдиницаИзмеренияВеса") Тогда
			ЕдиницаИзмеренияВеса = Контекст.ФайлДанные.ЕдиницаИзмеренияВеса;
			ИтогТаблБрутто = Новый Структура;
			Если Контекст.ФайлДанные.Свойство("МассаБруттоИтогПрописью") Тогда
				ИтогТаблБрутто.Вставить("Прописью", Кэш.ОбщиеФункции.РассчитатьЗначение("МассаБруттоИтогПрописью", Контекст.ФайлДанные,Кэш));  
				ИтогТабл.Вставить("Брутто", ИтогТаблБрутто);
			ИначеЕсли Контекст.ИтогБрутто > 0 Тогда
				ИтогТаблБрутто.Вставить("Кол_во", Формат(Контекст.ИтогБрутто, "ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.00"));
				Если Контекст.ФайлДанные.Свойство("МассаИтогПрописью") Тогда
					Контекст.ФайлДанные.Вставить("МассаИтог", Контекст.ИтогБрутто);
					ИтогТаблБрутто.Вставить("Прописью", Кэш.ОбщиеФункции.РассчитатьЗначение("МассаИтогПрописью", Контекст.ФайлДанные,Кэш));
				Иначе	
					ИтогТаблБрутто.Вставить("Прописью", ЧислоПрописью(Контекст.ИтогБрутто, ,",,,,,,,,0")+ " " + СокрЛП(ЕдиницаИзмеренияВеса) + ".");
				КонецЕсли;	
				ИтогТабл.Вставить("Брутто", ИтогТаблБрутто);
			КонецЕсли;
			
			Если Контекст.ИтогНетто > 0 Тогда
				ИтогТаблНетто = Новый Структура;
				ИтогТаблНетто.Вставить("Кол_во", Формат(Контекст.ИтогНетто, "ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.00"));
				Если Контекст.ФайлДанные.Свойство("МассаНеттоИтогПрописью") Тогда
					ИтогТаблНетто.Вставить("Прописью", Кэш.ОбщиеФункции.РассчитатьЗначение("МассаНеттоИтогПрописью", Контекст.ФайлДанные,Кэш));
				ИначеЕсли Контекст.ФайлДанные.Свойство("МассаИтогПрописью") Тогда
					Контекст.ФайлДанные.Вставить("МассаИтог", Контекст.ИтогНетто);
					ИтогТаблНетто.Вставить("Прописью", Кэш.ОбщиеФункции.РассчитатьЗначение("МассаИтогПрописью", Контекст.ФайлДанные,Кэш));
				Иначе	
					ИтогТаблНетто.Вставить("Прописью", ЧислоПрописью(Контекст.ИтогНетто, ,",,,,,,,,0")+ " " + СокрЛП(ЕдиницаИзмеренияВеса) + ".");
				КонецЕсли;	
				ИтогТабл.Вставить("Нетто", ИтогТаблНетто);
			КонецЕсли;
		КонецЕсли;
		Если Контекст.Свойство("ЕстьПредыдущиеДанные") Тогда
			ПредИтогТабл=Новый Структура;
			ПредИтогТабл.Вставить("Сумма", Формат(Контекст.ПредИтогСумма, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));	
			ПредИтогТабл.Вставить("СуммаБезНал", Формат(Контекст.ПредИтогСуммаБезНалога, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));
			ПредИтогТабл.Вставить("НДС",Новый Структура);
			ПредИтогТабл.НДС.Вставить("Сумма",Формат(Контекст.ПредИтогСуммаНДС, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));	
			ИтогТабл.Вставить("ПредИтогТабл",ПредИтогТабл);
			Контекст.Удалить("ЕстьПредыдущиеДанные");
		КонецЕсли;
		//Контекст.ТаблДок.Вставить("ИтогТабл",Новый Массив);
		Контекст.ТаблДок.ИтогТабл.Добавить(ИтогТабл);
		Если Контекст.ТаблДок.СтрТабл.Количество() = 0 Тогда//нет такого документа
			Возврат Истина;
		КонецЕсли;
		Возврат ПолучитьШапкуИзДокумента1С(Кэш,Контекст, ДопПараметры);		
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
КонецФункции

&НаКлиенте
Функция ПолучитьШапкуИзДокумента1С(Кэш, Контекст, ДопПараметры = Неопределено) Экспорт
	Перем СбисНДСИсчисляетсяАгентом;
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	// Функция формирует структуру выгружаемого файла и добавляет его в состав пакета
	Попытка	
		Док  = Новый Структура;
		Док.Вставить("Файл",Новый Структура);
		Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Файл",Контекст.ФайлДанные,Док.Файл);
		Док.Файл.Вставить("Документ",Новый Структура);
		Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Документ",Контекст.ФайлДанные,Док.Файл.Документ);
		Док.Файл.Документ.Вставить("Основание",Новый Массив);
		
		Валюта =  Кэш.ОбщиеФункции.РассчитатьЗначение("Валюта_КодОКВ", Контекст.ФайлДанные, Кэш);
		Если ЗначениеЗаполнено(Валюта) Тогда
			Док.Файл.Документ.Вставить("Валюта",Новый Структура);
			Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Валюта",Контекст.ФайлДанные,Док.Файл.Документ.Валюта);
		КонецЕсли;
		Если Не Контекст.Свойство("НДСИсчисляетсяАгентом", СбисНДСИсчисляетсяАгентом) Тогда
			СбисНДСИсчисляетсяАгентом = Кэш.ОбщиеФункции.РассчитатьЗначение("НДСИсчисляетсяАгентом", Контекст.ФайлДанные) = Истина;
		КонецЕсли;

		Отправитель = "";
		Получатель = "";
		ЗапретРедакций = Ложь;
		ОтправительРоль=Кэш.ОбщиеФункции.РассчитатьЗначение("Отправитель_Роль", Контекст.ФайлДанные, Кэш);
		ПолучательРоль=Кэш.ОбщиеФункции.РассчитатьЗначение("Получатель_Роль", Контекст.ФайлДанные, Кэш);
		Если Не ЗначениеЗаполнено(ОтправительРоль) Тогда
			ОтправительРоль = "Отправитель";
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ПолучательРоль) Тогда
			ПолучательРоль = "Получатель";
		КонецЕсли;
		Для Каждого Параметр Из Контекст.ФайлДанные.мСторона Цикл
			Если Параметр.Значение.Свойство("Роль") Тогда
				Роль = Кэш.ОбщиеФункции.РассчитатьЗначение("Роль",Параметр.Значение,Кэш);
			Иначе
				Роль = Кэш.ОбщиеФункции.РассчитатьЗначение("Сторона_Роль",Параметр.Значение,Кэш);
			КонецЕсли;

			Сторона = Кэш.ОбщиеФункции.ПолучитьСторону(Кэш,Параметр.Значение);
			Если Не Сторона = Неопределено Тогда
				Док.Файл.Документ.Вставить(Роль,Сторона);
			КонецЕсли;
		КонецЦикла;
		Если Не Док.Файл.Документ.Свойство(ПолучательРоль) Тогда
			МодульОбъектаКлиент().ВызватьСбисИсключение(721, "Файл_СчФктр_3_01.ПолучитьШапкуИзДокумента1С",,,"Не удалось определить ИНН получателя документа " + Строка(Контекст.Документ));
		КонецЕсли;
		Если Не Док.Файл.Документ.Свойство(ОтправительРоль) Тогда
			МодульОбъектаКлиент().ВызватьСбисИсключение(721, "Файл_СчФктр_3_01.ПолучитьШапкуИзДокумента1С",,,"Не удалось определить ИНН отправителя документа " + Строка(Контекст.Документ));
		КонецЕсли;
		КлючФормыПоиска = "Файл_" + Контекст.ФайлДанные.Файл_Формат + "_" + СтрЗаменить(СтрЗаменить(Контекст.ФайлДанные.Файл_ВерсияФормата, ".", "_"), " ", "");
		
		// Если Грузоотправитель и грузополучатель нужны, но они не попали в файл, то берем их с отправителя и получателя
		Если Не Контекст.Свойство("ЗаполнятьГрузотпрГрузполуч") или (Контекст.Свойство("ЗаполнятьГрузотпрГрузполуч") и Контекст.ЗаполнятьГрузотпрГрузполуч = Истина) Тогда
			Если Контекст.ФайлДанные.мСторона.Свойство("Грузоотправитель") и Не Док.Файл.Документ.Свойство("Грузоотправитель") и Док.Файл.Документ.Свойство(ОтправительРоль) Тогда
				Док.Файл.Документ.Вставить("Грузоотправитель",Новый Структура);		
				Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Док.Файл.Документ.Грузоотправитель,Док.Файл.Документ[ОтправительРоль]);
			КонецЕсли;
			Если Контекст.ФайлДанные.мСторона.Свойство("Грузополучатель") и Не Док.Файл.Документ.Свойство("Грузополучатель") и Док.Файл.Документ.Свойство(ПолучательРоль) Тогда
				Док.Файл.Документ.Вставить("Грузополучатель",Новый Структура);		
				Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Док.Файл.Документ.Грузополучатель,Док.Файл.Документ[ПолучательРоль]);
			КонецЕсли;
		КонецЕсли;
		
		Если Контекст.ФайлДанные.Свойство("АдресДоставки") И Контекст.ФайлДанные.АдресДоставки <> Неопределено Тогда
			Док.Файл.Документ.Вставить("АдресДоставки", Кэш.ОбщиеФункции.РассчитатьЗначение("АдресДоставки", Контекст.ФайлДанные, Кэш));
		КонецЕсли;
		Если Контекст.ФайлДанные.Свойство("АдресПогрузки") И Контекст.ФайлДанные.АдресПогрузки <> Неопределено Тогда
			Док.Файл.Документ.Вставить("АдресПогрузки", Кэш.ОбщиеФункции.РассчитатьЗначение("АдресПогрузки", Контекст.ФайлДанные, Кэш));
		КонецЕсли;
		
		Если Контекст.ФайлДанные.Свойство("мОснование") Тогда
			фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПолучитьДанныеИзДокумента1С_мОснование", КлючФормыПоиска, "Файл_Шаблон", Кэш);
			фрм.ПолучитьДанныеИзДокумента1С_мОснование(Кэш, Док, Контекст);
		КонецЕсли;
		
		Если Контекст.ФайлДанные.Свойство("мПараметр") Тогда
			Док.Файл.Документ.Вставить("Параметр",Новый Массив);
			Для Каждого Элемент Из Контекст.ФайлДанные.мПараметр Цикл
				Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Контекст.ФайлДанные,Элемент.Значение);
				Параметр = Новый Структура();
				Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Параметр",Контекст.ФайлДанные,Параметр);
				Док.Файл.Документ.Параметр.Добавить(Параметр);
			КонецЦикла;
		КонецЕсли;
		
		Если Контекст.ФайлДанные.Свойство("мТранспортноеСредство") Тогда
			Док.Файл.Документ.Вставить("ТранспортноеСредство",Новый Массив);
			Для Каждого Элемент Из Контекст.ФайлДанные.мТранспортноеСредство Цикл
				Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Контекст.ФайлДанные,Элемент.Значение);
				ТранспортноеСредство = Новый Структура();
				Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"ТранспортноеСредство",Контекст.ФайлДанные,ТранспортноеСредство);
				Док.Файл.Документ.ТранспортноеСредство.Добавить(ТранспортноеСредство);
			КонецЦикла;
		КонецЕсли;

		Если СбисНДСИсчисляетсяАгентом Тогда
			СуммаВложения = Формат(Контекст.ИтогСуммаБезНалога, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00");
		Иначе
			СуммаВложения = Формат(Контекст.ИтогСумма, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00");
		КонецЕсли;
 		Док.Файл.Документ.Вставить("ТаблДок",Контекст.ТаблДок);

		ПараметрыКонструктора = Новый Структура("ГрязныйИни, ДокументФайл, ДокументСсылка", Контекст.ФайлДанные, Док, Контекст.Документ);
		ПараметрыКонструктора.Вставить("ОтправительРоль",	ОтправительРоль);
		ПараметрыКонструктора.Вставить("ПолучательРоль",	ПолучательРоль);
		ПараметрыКонструктора.Вставить("СуммаВложения",		СуммаВложения);
		
		Вложение = МодульОбъектаКлиент().НовыйВложениеСБИС(ПараметрыКонструктора);
		
		// Взять таблдок и сформировать классы сопоставления, вставить последнее во Вложение 
		Если МодульОбъектаКлиент().ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры") Тогда    
			
			ТипОснования = "Заказ";                            
            Основание = СчФктрНайтиОснованиеПоТипу(Док, ТипОснования);
            
            Если ЗначениеЗаполнено(Основание) Тогда
                ДанныеОснования = Новый Структура("Название, Дата, Номер, Идентификатор, Тип");
                ЗаполнитьЗначенияСвойств(ДанныеОснования, Основание);    
                ДанныеОснования.Тип = "ЗаказВх";
                МодульОбъектаКлиент().ВложениеСБИС_Заполнить(Вложение, ДанныеОснования, "ДокументДляСопоставления");
            КонецЕсли;
			
			ДопПараметрыСопоставления = Новый Структура;
			Если Контекст.Свойство("ИдОснования") Тогда
				ДопПараметрыСопоставления.Вставить("ИдОснования", Контекст.ИдОснования);
			КонецЕсли;
			Если Контекст.Свойство("НеИскатьПоДокументу") Тогда
				ДопПараметрыСопоставления.Вставить("НеИскатьПоДокументу", Контекст.НеИскатьПоДокументу);
			КонецЕсли;
			
			ДопПараметрыСопоставления.Вставить("ПересчетПоДокументуОснованию", Истина);
			ДопПараметрыСопоставления.Вставить("НаправлениеПересчета", "Выгрузка");
            МодульОбъектаКлиент().ВложениеСБИС_ПропатчитьНовымСопоставлением(Вложение, ДопПараметрыСопоставления);
            
        КонецЕсли;
        
		Контекст.СоставПакета.Вложение.Добавить(Вложение);
		
		Если 	Контекст.ФайлДанные.Свойство("мСвязанноеВложение") И ЗначениеЗаполнено(Контекст.ФайлДанные.мСвязанноеВложение)
				И Не (ДопПараметры.Свойство("ОбработкаСвязанногоВложения") И ДопПараметры.ОбработкаСвязанногоВложения) Тогда
			фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПолучитьДанныеИзДокумента1С_мСвязанноеВложение", КлючФормыПоиска,"Файл_Шаблон", Кэш);
			фрм.ПолучитьДанныеИзДокумента1С_мСвязанноеВложение(Кэш, Контекст, ДопПараметры);
		КонецЕсли;

		фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("сбисПослеФормированияДокумента","Файл_"+Контекст.ФайлДанные.Файл_Формат+"_"+СтрЗаменить(СтрЗаменить(Контекст.ФайлДанные.Файл_ВерсияФормата, ".", "_"), " ", ""),"Файл_Шаблон", Кэш);
		Если фрм<>Ложь Тогда
			фрм.сбисПослеФормированияДокумента(Док, Кэш, Контекст);	
			Вложение.СтруктураДокумента = Док; // на случай, если Док поменялся в функции сбисПослеФормированияДокумента
		КонецЕсли;
		Возврат Истина;
		
	Исключение
		ИсключениеФормирования = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "Файл_СчФктр_3_01.ПолучитьШапкуИзДокумента1С");
		Контекст.СоставПакета.Вставить("Ошибка", ИсключениеФормирования);
		Возврат Ложь;
	КонецПопытки;
КонецФункции

&НаКлиенте
Функция СчФктрНайтиОснованиеПоТипу(СтруктураДокумента, ТипОснования) Экспорт
	
	Для Каждого Основание ИЗ СтруктураДокумента.Файл.Документ.Основание Цикл
		Если Основание.Свойство("Название") 
			И Основание.Название = ТипОснования Тогда
			Возврат Основание;
		ИначеЕсли Основание.Свойство("Тип")
			И Основание.Тип = ТипОснования Тогда
			Возврат Основание;
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьНоменклатуруВложения(Кэш, Контекст) Экспорт

	Файл = Контекст.ФайлДанные.Файл;
	Изменения = Контекст.Изменения;

	ИмяФормыПоФормату = "Файл_" + Файл.Формат + "_" + Файл.ВерсияФормата;
	
	ИмяФормыПоФормату = Кэш.ОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(ИмяФормыПоФормату);
	
	МассивФормФайл = Новый Массив;
	МассивФормФайл.Добавить("Файл_Шаблон");
	МассивФормФайл.Добавить(ИмяФормыПоФормату);
	
	ФормаФайл = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ДобавитьМПараметр", МассивФормФайл);
	
	Для каждого СтрТабл Из Файл.Документ.ТаблДок.СтрТабл Цикл
		
		Ключ = СтрТабл.ПорНомер;
		
		Если Изменения.Получить(Ключ) = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		ЛокальныйКонтекст = Новый Структура("мПараметр", Новый Структура);
		
		Для каждого Изменение Из Изменения.Получить(Ключ) Цикл
			ЛокальныйКонтекст.мПараметр.Вставить(Изменение.Ключ, Новый Структура("Параметр_Имя, Параметр_Значение", Изменение.Ключ, Изменение.Значение));
		КонецЦикла;
		
		ФормаФайл.ДобавитьМПараметр(Кэш, ЛокальныйКонтекст, СтрТабл);
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьДаннымиДокПодтвОтгр(Кэш, Контекст, ВременныйКонтекст, ДопПараметры) Экспорт
	
	Если НЕ ВременныйКонтекст.ДокументДанные.Свойство("мФайл")	Тогда
		Контекст.ФайлДанные.мОснование.Вставить("ДокПодтвОтгр", ДопПараметры.ДокПодтвПоИни);
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из ВременныйКонтекст.ДокументДанные.мФайл Цикл
		Если Элемент.Значение.Свойство("мТаблДок")
			И ПроверитьТаблДок(Кэш, Элемент.Значение.мТаблДок) Тогда
			
			Вложение_Тип	= 			Кэш.ОбщиеФункции.РассчитатьЗначение("Вложение_Тип",				Элемент.Значение);
			Документ_Дата	=			Кэш.ОбщиеФункции.РассчитатьЗначение("Документ_Дата",			Элемент.Значение);
			Документ_Номер	=			Кэш.ОбщиеФункции.РассчитатьЗначение("Документ_Номер",			Элемент.Значение);
			НаимДокОтгр		=			Кэш.ОбщиеФункции.РассчитатьЗначение("НаимДокОтгр",				Элемент.Значение); 
			
			ИсходныйДокумент_Номер	=	Кэш.ОбщиеФункции.РассчитатьЗначение("ИсходныйДокумент_Номер",	Элемент.Значение);
			ИсходныйДокумент_Дата	=	Кэш.ОбщиеФункции.РассчитатьЗначение("ИсходныйДокумент_Дата",	Элемент.Значение);
			
			Если Вложение_Тип = "ОтчКмт" Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НаимДокОтгр) Тогда
				Продолжить; 
			КонецЕсли;  
			
			Если ЗначениеЗаполнено(ИсходныйДокумент_Номер) 
				И ЗначениеЗаполнено(ИсходныйДокумент_Дата) Тогда   
				
				ОснованиеНомер	=	ИсходныйДокумент_Номер;
				ОснованиеДата	=	ИсходныйДокумент_Дата; 
				
			Иначе     
				
				ОснованиеНомер	=	Документ_Номер;
				ОснованиеДата	=	Документ_Дата;     
				
			КонецЕсли;	
			
			Основание = Новый Структура;
			Основание.Вставить("Основание_Название",	"ДокПодтвОтгр");
			Основание.Вставить("Основание_Дата",		ОснованиеДата);
			Основание.Вставить("Основание_Номер",		ОснованиеНомер);
			Основание.Вставить("Основание_НаимДокОтгр", НаимДокОтгр);
			
			Контекст.ФайлДанные.мОснование.ДокПодтвОтгр.Добавить(Основание);
			
		КонецЕсли;
	КонецЦикла; 
	
	Основание5АЗаполнено = Контекст.ФайлДанные.мОснование.Свойство("ДокПодтвОтгр")
							И ЗначениеЗаполнено(Контекст.ФайлДанные.мОснование.ДокПодтвОтгр);
			
	Если НЕ Основание5АЗаполнено Тогда
		Контекст.ФайлДанные.мОснование.Вставить("ДокПодтвОтгр", ДопПараметры.ДокПодтвПоИни);
	КонецЕсли;    
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьТаблДок(Кэш, ТаблДок)
	
	Результат = Ложь;
	
	Для каждого МассивТаблицы Из ТаблДок Цикл
	
		Для каждого СтрокаТаблДока Из МассивТаблицы.Значение Цикл
		
			Результат = Кэш.ОбщиеФункции.РассчитатьЗначение("ДобавлятьСтроку", СтрокаТаблДока) <> Ложь;
			
			Если Результат Тогда 
				Прервать;
			КонецЕсли;
		
		КонецЦикла;
		
		Если Результат Тогда 
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции     

// Процедура - Переадресует на обработчик и патчит полученный результат
//
// Параметры:
//  ПараметрыФормированияВходящие	 - Структура - Набор параметров для формирования документа
//  Кэш								 - Структура - Кэш обработки
//  
&НаКлиенте
Процедура СформироватьДокументДляГенератора(ПараметрыФормированияВходящие, Кэш) Экспорт  
		
   	Файл_Шаблон_Модуль = МодульОбъектаКлиент().ПолучитьФормуОбработки("Файл_Шаблон"); 

	Файл_Шаблон_Модуль.СформироватьДокументДляГенератора(ПараметрыФормированияВходящие, Кэш);
		
	ТекДокумент = ПараметрыФормированияВходящие.Документ.Файл.Документ;  
	
	ТекДокумент.Удалить("ПоФактХЖ");
	ТекДокумент.Удалить("НаимДокОпр");	 
	
КонецПроцедуры   

// Процедура заполняет данные по основаниям документа
//
// Параметры:
//  Док	 - Структура - Контекст рассчитываемого документа
//  Кэш	 - Структура - Кэш обработки
//
&НаКлиенте
Процедура СформироватьОснование(Док, Кэш) Экспорт
	
	Файл_Шаблон_Модуль = МодульОбъектаКлиент().ПолучитьФормуОбработки("Файл_Шаблон"); 
	
	ТекДокумент = Док.Файл.Документ;    
	
	Если НЕ ТекДокумент.Свойство("Основание") Тогда
		Возврат;	
	КонецЕсли;
	
	Исключения = Файл_Шаблон_Модуль.ПолучитьИсключенияОснование();
	ОснованиеМассив = Новый Массив;
	
	Для Каждого ТекСтрока ИЗ ТекДокумент.Основание Цикл
		
		Если ТекСтрока.Свойство("Тип") Тогда
			Ключ = "Тип";	
		Иначе
			Ключ = "Название";	
		КонецЕсли;
		
		Если Исключения.Получить(ТекСтрока[Ключ]) = Истина Тогда
			Продолжить;	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Название) Тогда
			Продолжить;	
		КонецЕсли;
		
		Если НЕ ТекСтрока.Свойство("Дата") Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Дата) И ТекСтрока.Название <> "-" Тогда
			Продолжить;	
		КонецЕсли; 
		
		Основание = Новый Структура("Номер, Название, Дата, ДопСвед");
		Основание.Название 	= ТекСтрока.Название;
		Основание.Номер 	= ТекСтрока.Номер;
		Основание.Дата 		= ТекСтрока.Дата;
		
		ТекСтрока.Свойство("ДопСвед", Основание.ДопСвед);
		
		ОснованиеМассив.Добавить(Основание);
		
	КонецЦикла;  
	
	ЕстьОснование = ОснованиеМассив.Количество();
		
	Если НЕ ЕстьОснование Тогда
		
		ТекДокумент.Вставить("БезДокОснПер", "1");
		
	КонецЕсли;
	
	ТекДокумент.Вставить("Основание", ОснованиеМассив);
	
КонецПроцедуры     

// Функция - патчит сторону документа для ее заполнения в генераторе ФЭД
//
// Параметры:
//  Кэш			 - Структура	- Кэш обработки
//  Вложение	 - Структура	- Структура вложения из состава пакета
//  ИмяСтороны	 - Строка		- Ключ стороны
// 
// Возвращаемое значение:
//  Структура - Данные стороны, результат работы функции
//
&НаКлиенте
Функция ИсточникДанных_ПолучитьДанныеСтороныПоИмени(Кэш, Вложение, ИмяСтороны) Экспорт
	
	Перем СвФлЮл, лОГРНИП, лДатаОГРН;
	
	МодульКлиент = МодульОбъектаКлиент();
	СтруктураФайла = МодульКлиент.ВложениеСБИС_Получить(Вложение, "СтруктураФайла");
	Документ = СтруктураФайла.Файл.Документ;
	
	Если НЕ Документ.Свойство(ИмяСтороны) Тогда 
		
		Возврат Неопределено;  
		
	КонецЕсли;
	
	ДанныеСтороны = Документ[ИмяСтороны];  
	
	Если НЕ ДанныеСтороны.Свойство("СвФЛ", СвФлЮл)
		Или НЕ СвФлЮл.Свойство("ОГРН", лОГРНИП)
		Или НЕ ЗначениеЗаполнено(лОГРНИП) Тогда 
		
		Возврат ДанныеСтороны; 
		
	КонецЕсли;  
	
	СвФлЮл.Вставить("ОГРНИП", лОГРНИП);
	
	Если СвФлЮл.Свойство("СвГосРегИП") Тогда
		
		 СвФлЮл.ОГРН = СвФлЮл.СвГосРегИП; 		 
		 СвФлЮл.Удалить("СвГосРегИП");
		 
	ИначеЕсли СвФлЮл.Свойство("ДатаОГРН", лДатаОГРН)
		И ЗначениеЗаполнено(лДатаОГРН) Тогда
		 
		СвФлЮл.ОГРН = СвФлЮл.ОГРН + " " + лДатаОГРН;
		 
	Иначе
		
		// Заглушка
		 
	КонецЕсли;
	
	Возврат ДанныеСтороны;
	
КонецФункции
