
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

&НаКлиенте
Процедура ПропатчитьСтруктуруВложения(ВложениеСБИС, ДопПараметры) Экспорт
	
	УдаляемыеУзлы = Новый Массив;
	УдаляемыеУзлы.Добавить("Файл.Документ.Покупатель.Адрес.АдрРФ.НаимРегион");
	УдаляемыеУзлы.Добавить("Файл.Документ.Поставщик.Адрес.АдрРФ.НаимРегион");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузоотправитель.Адрес.АдрРФ.НаимРегион");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузополучатель.Адрес.АдрРФ.НаимРегион");

	УдаляемыеУзлы.Добавить("Файл.Документ.Покупатель.Адрес.АдрИно.НаимСтран");
	УдаляемыеУзлы.Добавить("Файл.Документ.Поставщик.Адрес.АдрИно.НаимСтран");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузоотправитель.Адрес.АдрИно.НаимСтран");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузополучатель.Адрес.АдрИно.НаимСтран");
	
	УдаляемыеУзлы.Добавить("Файл.Документ.Покупатель.Адрес.ФиасИд");
	УдаляемыеУзлы.Добавить("Файл.Документ.Поставщик.Адрес.ФиасИд");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузоотправитель.Адрес.ФиасИд");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузополучатель.Адрес.ФиасИд");

	МодульОбъектаКлиент().ВложениеСБИС_УдалитьУзлыИзСтруктурыДанных(ВложениеСБИС, УдаляемыеУзлы);

КонецПроцедуры

&НаКлиенте
Функция ИсточникДанных_ПолучитьДанныеСтороныПоИмени(Кэш, Вложение, ИмяСтороны) Экспорт
	
	КлючСтороны = ИмяСтороны;
	Если		ИмяСтороны = "Получатель" Тогда
		КлючСтороны = "Покупатель";
	ИначеЕсли	ИмяСтороны = "Отправитель" Тогда
		КлючСтороны = "Поставщик";
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
	
	Возврат Вложение.СтруктураДокумента.Файл.Документ[КлючСтороны];	
	
КонецФункции                            

&НаКлиенте
Процедура СформироватьОснование(Док, Кэш) Экспорт
	
	ТекДокумент = Док.Файл.Документ;  
	
	МодульФайл_Шаблон = МодульОбъектаКлиент().ПолучитьФормуОбработки("Файл_Шаблон");
	
	ОснованиеМассив = МодульФайл_Шаблон.СформироватьОснование_Общее(Док);
	
	ТекДокумент.Вставить("Основание", ОснованиеМассив);
	
	Если НЕ ТекДокумент.Свойство("Параметр") Тогда  
		
		Возврат; 
		
	КонецЕсли;
	
	Основание = Новый Структура("Номер, Название, Дата");
	Основание.Название 	= "Договор";
	
	Для Каждого ТекСтрока ИЗ ТекДокумент.Параметр Цикл   
		
		Если ТекСтрока.Имя = "ДоговорДата" Тогда
			
			Если НЕ ЗначениеЗаполнено(ТекСтрока.Значение) Тогда
				
				Возврат;
				
			КонецЕсли;
	
			Основание.Дата = ТекСтрока.Значение;	
			
		КонецЕсли;   
		
		Если ТекСтрока.Имя = "ДоговорНомер" Тогда
			
			Если НЕ ЗначениеЗаполнено(ТекСтрока.Значение) Тогда
				
				ТекСтрока.Значение = "Без номера";
				
			КонецЕсли;		
			
			Основание.Номер = ТекСтрока.Значение;	
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ОснованиеМассив.Добавить(Основание); 
	
КонецПроцедуры  

// Функция - формирует структура табличной части файла
//
// Параметры:
//  Кэш		 - Структура - Кэш обработки
//  Контекст - Структура - Структура рассчета
// 
// Возвращаемое значение:
//  Структура - результат работы функции
//
&НаКлиенте
Функция ПолучитьТабличнуюЧастьДокумента1С(Кэш, Контекст) Экспорт  
	
	Контекст.Вставить("СохранятьСсылки", Ложь);
	Возврат МодульОбъектаКлиент().ПолучитьФормуОбработки("Файл_Шаблон").ПолучитьТабличнуюЧастьДокумента1С(Кэш, Контекст);
	
КонецФункции
