
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

&НаКлиенте
Функция ПолучитьДанныеИзДокумента1С(Кэш, Контекст, ДопПараметры = Неопределено) Экспорт
	// Функция формирует структуру выгружаемого файла и добавляет его в состав пакета

	Файл_Шаблон = МодульОбъектаКлиент().ПолучитьФормуОбработки("Файл_Шаблон");
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	Попытка	
		Контекст.Вставить("ТаблДок",Новый Структура());
		Контекст.ТаблДок.Вставить("ИтогТабл",Новый Массив);
		Контекст.ТаблДок.Вставить("СтрТабл",Новый Массив);
		Контекст.Вставить("ИтогСумма",0);
		Контекст.Вставить("ИтогСуммаБезНалога",0);
		Контекст.Вставить("ИтогСуммаНДС",0);
		Контекст.Вставить("ИтогКоличество",0);
		Контекст.Вставить("ИтогБрутто",0);
		Контекст.Вставить("ИтогНетто",0);
		Контекст.Вставить("ИтогКолМест",0);
		
		Контекст.Вставить("ПредИтогСумма",0);
		Контекст.Вставить("ПредИтогСуммаБезНалога",0);
		Контекст.Вставить("ПредИтогСуммаНДС",0);
		Контекст.Вставить("НДСИсчисляетсяАгентом", Кэш.ОбщиеФункции.РассчитатьЗначение("НДСИсчисляетсяАгентом", Контекст.ФайлДанные) = Истина);
		НоменклатураКодКонтрагента = Кэш.ОбщиеФункции.РассчитатьЗначение("НоменклатураКодКонтрагента", Контекст.ФайлДанные,Кэш);  // надо сопоставить номенклатуру перед отправкой
		Если ЗначениеЗаполнено(НоменклатураКодКонтрагента) Тогда
			Контекст.Вставить("НоменклатураКодКонтрагента",НоменклатураКодКонтрагента);	
		КонецЕсли;
		
		//1182697110 {
		//ПолучитьТабличнуюЧастьДокумента1С(Кэш,Контекст);
		фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПолучитьТабличнуюЧастьДокумента1С","Файл_Шаблон","", Кэш);
		фрм.ПолучитьТабличнуюЧастьДокумента1С(Кэш,Контекст);
		//}
		
		Если Контекст.ТаблДок.СтрТабл.Количество() = 0 Тогда//нет такого документа
			Возврат Истина;
		КонецЕсли;
		
		Если Контекст.ФайлДанные.Свойство("мТаблДетал") Тогда
			Контекст.Вставить("ТаблДетал",Новый Структура());                 
			Контекст.ТаблДетал.Вставить("СтрТабл",Новый Массив);
			
			//1182697110 {
			//ПолучитьДетализациюТабЧастиДокумента1С(Кэш,Контекст);
			фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПолучитьДетализациюТабЧастиДокумента1С","Файл_Шаблон","", Кэш);
			фрм.ПолучитьДетализациюТабЧастиДокумента1С(Кэш,Контекст);
			//}

		КонецЕсли;
		
		ИтогТабл=Новый Структура;
		ИтогТабл.Вставить("Кол_во", Формат(Контекст.ИтогКоличество, "ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.000"));
		ИтогТабл.Вставить("Сумма", Формат(Контекст.ИтогСумма, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));	
		ИтогТабл.Вставить("СуммаБезНал", Формат(Контекст.ИтогСуммаБезНалога, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));
		ИтогТабл.Вставить("НДС",Новый Структура);
		ИтогТабл.НДС.Вставить("Сумма",Формат(Контекст.ИтогСуммаНДС, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));	
		Если Контекст.ИтогКолМест>0 Тогда
			ИтогТабл.Вставить("Упаковка",Новый Структура);
			ИтогТабл.Упаковка.Вставить("КолМест",Формат(Контекст.ИтогКолМест, "ЧЦ=17; ЧДЦ=0; ЧРД=.; ЧГ=0; ЧН=0"));	
		КонецЕсли;
		
		Если Контекст.ФайлДанные.Свойство("ЕдиницаИзмеренияВеса") Тогда
			ЕдиницаИзмеренияВеса = Контекст.ФайлДанные.ЕдиницаИзмеренияВеса;
			Если Контекст.ИтогБрутто > 0 Тогда
				ИтогТаблБрутто = Новый Структура;
				ИтогТаблБрутто.Вставить("Кол_во", Формат(Контекст.ИтогБрутто, "ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.00"));
				Если Контекст.ФайлДанные.Свойство("МассаИтогПрописью") Тогда
					Контекст.ФайлДанные.Вставить("МассаИтог", Контекст.ИтогБрутто);
					ИтогТаблБрутто.Вставить("Прописью", Кэш.ОбщиеФункции.РассчитатьЗначение("МассаИтогПрописью", Контекст.ФайлДанные,Кэш));
				Иначе	
					ИтогТаблБрутто.Вставить("Прописью", ЧислоПрописью(Контекст.ИтогБрутто, ,",,,,,,,,0")+ " " + СокрЛП(ЕдиницаИзмеренияВеса) + ".");
				КонецЕсли;	
				ИтогТабл.Вставить("Брутто", ИтогТаблБрутто);
			КонецЕсли;
			
			Если Контекст.ИтогНетто > 0 Тогда
				ИтогТаблНетто = Новый Структура;
				ИтогТаблНетто.Вставить("Кол_во", Формат(Контекст.ИтогНетто, "ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.00"));
				Если Контекст.ФайлДанные.Свойство("МассаИтогПрописью") Тогда
					Контекст.ФайлДанные.Вставить("МассаИтог", Контекст.ИтогНетто);
					ИтогТаблНетто.Вставить("Прописью", Кэш.ОбщиеФункции.РассчитатьЗначение("МассаИтогПрописью", Контекст.ФайлДанные,Кэш));
				Иначе	
					ИтогТаблНетто.Вставить("Прописью", ЧислоПрописью(Контекст.ИтогНетто, ,",,,,,,,,0")+ " " + СокрЛП(ЕдиницаИзмеренияВеса) + ".");
				КонецЕсли;	
				ИтогТабл.Вставить("Нетто", ИтогТаблНетто);
			КонецЕсли;
		КонецЕсли;
		
		Если Контекст.Свойство("ЕстьПредыдущиеДанные") Тогда
			ПредИтогТабл=Новый Структура;
			ПредИтогТабл.Вставить("Сумма", Формат(Контекст.ПредИтогСумма, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));	
			ПредИтогТабл.Вставить("СуммаБезНал", Формат(Контекст.ПредИтогСуммаБезНалога, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));
			ПредИтогТабл.Вставить("НДС",Новый Структура);
			ПредИтогТабл.НДС.Вставить("Сумма",Формат(Контекст.ПредИтогСуммаНДС, "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"));	
			ИтогТабл.Вставить("ПредИтогТабл",ПредИтогТабл);
		КонецЕсли;
		
		//Контекст.ТаблДок.Вставить("ИтогТабл",Новый Массив);
		Контекст.ТаблДок.ИтогТабл.Добавить(ИтогТабл);
		
		
		Док  = Новый Структура;
		Док.Вставить("Файл",Новый Структура);
		Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Файл",Контекст.ФайлДанные,Док.Файл);
		Док.Файл.Вставить("Документ",Новый Структура);
		Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Документ",Контекст.ФайлДанные,Док.Файл.Документ);
		Док.Файл.Документ.Вставить("Основание",Новый Массив);
		
		//!!!
		//Валюта =  Кэш.ОбщиеФункции.РассчитатьЗначение("Валюта_КодОКВ", Контекст.ФайлДанные, Кэш);
		//Если ЗначениеЗаполнено(Валюта) Тогда
		//	Док.Файл.Документ.Вставить("Валюта",Новый Структура);
		//	Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Валюта",Контекст.ФайлДанные,Док.Файл.Документ.Валюта);
		//КонецЕсли;
		//}	
		
		Контекст.Вставить("ЗаполнятьГрузотпрГрузполуч",		Ложь);
		Контекст.Вставить("ПолучательМожетОтсутствовать",	Истина);
		
		ПараметрыКонструктора = Новый Структура("ГрязныйИни, ДокументФайл, ДокументСсылка", Контекст.ФайлДанные, Док, Контекст.Документ);

		Файл_Шаблон.ПолучитьДанныеИзДокумента1С_мСторона	(Кэш, ПараметрыКонструктора, Контекст);
		Файл_Шаблон.ПолучитьДанныеИзДокумента1С_мОснование(Кэш, ПараметрыКонструктора, Контекст);
		
		Если Контекст.ФайлДанные.Свойство("мПараметр") Тогда
			Док.Файл.Документ.Вставить("Параметр",Новый Массив);
			Для Каждого Элемент Из Контекст.ФайлДанные.мПараметр Цикл
				Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Контекст.ФайлДанные,Элемент.Значение);
				Параметр = Новый Структура();
				Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Параметр",Контекст.ФайлДанные,Параметр);
				Док.Файл.Документ.Параметр.Добавить(Параметр);
			КонецЦикла;
		КонецЕсли;
		
		Если ПараметрыКонструктора.ДанныеСторон[ПараметрыКонструктора.ПолучательРоль] = Неопределено Тогда
			
			СторонаДляЗамены = ПараметрыКонструктора.ДанныеСторон[ПараметрыКонструктора.ОтправительРоль];
			ПараметрыКонструктора.ДанныеСторон[ПараметрыКонструктора.ПолучательРоль] = МодульОбъектаКлиент().СторонаSABY_Скопировать(СторонаДляЗамены);

		КонецЕсли;
		
		ПривестиФЛК(Контекст.ФайлДанные.Вложение_Тип, Контекст.ФайлДанные.Вложение_ВерсияФормата, Док);
		
		Вложение = МодульОбъектаКлиент().НовыйВложениеСБИС(ПараметрыКонструктора);
		
		Файл_Шаблон.ПолучитьДанныеИзДокумента1С_ПослеФормированияВложения(Кэш, Контекст, Вложение, ДопПараметры);
		Возврат Истина;
		
	Исключение
		Если Кэш.Свойство("РезультатОтправки") Тогда
			Кэш.РезультатОтправки.НеСформировано = Кэш.РезультатОтправки.НеСформировано+1;
			Кэш.РезультатОтправки.ОшибкиДоОтправки = Кэш.РезультатОтправки.ОшибкиДоОтправки + 1;
			Кэш.ОбщиеФункции.ДобавитьОшибкуВРезультатОтправки(Кэш, "Документ не сформирован", ОписаниеОшибки(), Контекст.Документ, 726)
		КонецЕсли;
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
КонецФункции


//1182697110 {
&НаКлиенте
Процедура ПривестиФЛК(Тип, ВерсияФормата, Док)
	
	Если Тип = "АктСписания" И ВерсияФормата = "3.01" Тогда
		ФЛК_АктСписания_3_01(Док);	
	КонецЕсли;
	
	Если Тип = "АктВыпуска" И ВерсияФормата = "3.01" Тогда
		ФЛК_АктВып_3_01(Док);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФЛК_АктСписания_3_01(Док)
	
	Док.Файл.Документ.Удалить("Получатель");
	
	Если Док.Файл.Документ.ТаблДок.Свойство("ИтогТабл") Тогда
		
		СтрокаРеквизитов = "Сумма";
		СоответствиеФормату = ПолучитьСоответсвиеФормату(СтрокаРеквизитов);
		
		Для Каждого ТекСтрока ИЗ Док.Файл.Документ.ТаблДок.ИтогТабл Цикл
			
			МассивКлючей = МассивКлючейДляУдаления(ТекСтрока, СоответствиеФормату);
			УдалитьКлючиПоМассиву(ТекСтрока, МассивКлючей);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Док.Файл.Документ.ТаблДок.Свойство("СтрТабл") Тогда
		
		СтрокаРеквизитов = "ПорНомер, Название, ЕдИзм, Примечание, ОКЕИ, Идентификатор, Кол_во, Цена, Сумма, НомСредИдентТов, Параметр";
		СоответствиеФормату = ПолучитьСоответсвиеФормату(СтрокаРеквизитов);
		
		Для Каждого ТекСтрока ИЗ Док.Файл.Документ.ТаблДок.СтрТабл Цикл
			
			МассивКлючей = МассивКлючейДляУдаления(ТекСтрока, СоответствиеФормату);
			УдалитьКлючиПоМассиву(ТекСтрока, МассивКлючей);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФЛК_АктВып_3_01(Док)
	
	Док.Файл.Документ.ТаблДок.Удалить("ИтогТабл");
	
	Если Док.Файл.Документ.ТаблДок.Свойство("СтрТабл") Тогда
		
		СтрокаРеквизитов = "ОКЕИ, Идентификатор, Примечание, ПорНомер, Название, ЕдИзм, Вместимость, Кол_во, Сумма, Цена, GTIN, НомСредИдентТов, Упаковка, СоставСтрТабл, Параметр";
		СоответствиеФормату = ПолучитьСоответсвиеФормату(СтрокаРеквизитов);
		
		Для Каждого ТекСтрока ИЗ Док.Файл.Документ.ТаблДок.СтрТабл Цикл
			
			МассивКлючей = МассивКлючейДляУдаления(ТекСтрока, СоответствиеФормату);
			УдалитьКлючиПоМассиву(ТекСтрока, МассивКлючей);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСоответсвиеФормату(СтрокаРеквизитов)
	
	СтруктураРеквизитов = Новый Структура(СтрокаРеквизитов);
	Результат = Новый Соответствие;
	
	Для Каждого ТекРеквизит ИЗ СтруктураРеквизитов Цикл
		Результат.Вставить(ТекРеквизит.Ключ, Истина);	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МассивКлючейДляУдаления(СтруктураДанных, СоответствиеФормату)
	
	Результат = Новый Массив;
	
	Для Каждого ТекРеквизит ИЗ СтруктураДанных Цикл
		
		Если СоответствиеФормату.Получить(ТекРеквизит.Ключ) <> Неопределено Тогда
			Продолжить;		
		КонецЕсли;
		
		Результат.Добавить(ТекРеквизит.Ключ);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УдалитьКлючиПоМассиву(СтруктураДанных, МассивКлючей)
	
	Для Каждого ТекКлюч ИЗ МассивКлючей Цикл
		СтруктураДанных.Удалить(ТекКлюч);	
	КонецЦикла;
	
КонецПроцедуры
//}

