
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

&НаКлиенте
Функция ПолучитьДанныеИзДокумента1С(Кэш,Контекст) Экспорт
// Функция формирует структуру выгружаемого файла и добавляет его в состав пакета
	Попытка	
				
		Док						= Новый Структура;
		МассивСтатусРегламент	= Новый Массив;
		ЗапретРедакций			= Ложь;
		
		ОтправительРоль	= "";
		ПолучательРоль	= "";
		Если Контекст.ФайлДанные.Свойство("мСторона") Тогда
			Для Каждого Параметр Из Контекст.ФайлДанные.мСторона Цикл
				Роль	= Кэш.ОбщиеФункции.РассчитатьЗначение("Роль",Параметр.Значение,Кэш);
				Сторона	= Кэш.ОбщиеФункции.ПолучитьСторону(Кэш, Параметр.Значение);  
				Если Роль = "Отправитель" Тогда
					
					ОтправительРоль = Роль;
					
				КонецЕсли;
				
				Если Роль = "Получатель" Тогда
					
					ПолучательРоль = Роль;
					
				КонецЕсли;
				
				Если Сторона<>Неопределено Тогда
					Если Сторона.Свойство("Подразделение") и Сторона.Подразделение.Свойство("Идентификатор") Тогда
						Если Сторона.Свойство("СвЮЛ") Тогда
							Сторона.СвЮЛ.Вставить("КодФилиала", Сторона.Подразделение.Идентификатор);
						ИначеЕсли Сторона.Свойство("СвФЛ") Тогда
							Сторона.СвФЛ.Вставить("КодФилиала", Сторона.Подразделение.Идентификатор);
						КонецЕсли;
					КонецЕсли;
					Док.Вставить(Роль, Сторона);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// Если грузополучатель является филиалом получателя, то получаетелем пакета ставим грузополучателя
		Если Док.Свойство("Грузополучатель") Тогда
			Если Док.Грузополучатель.Свойство("СвЮЛ") и Док.Получатель.Свойство("СвЮЛ") и Док.Грузополучатель.СвЮЛ.ИНН = Док.Получатель.СвЮЛ.ИНН и Док.Грузополучатель.СвЮЛ.КПП <> Док.Получатель.СвЮЛ.КПП Тогда
				//Попытка
				//	оГрузополучатель = Кэш.Интеграция.ПолучитьИнформациюОКонтрагенте(Кэш, Док.Грузополучатель);
				//	оПолучатель = Кэш.Интеграция.ПолучитьИнформациюОКонтрагенте(Кэш, Док.Получатель);
				//	Если оПолучатель.Идентификатор = оГрузополучатель.Идентификатор Тогда
						Док.Получатель = Док.Грузополучатель;
				//	КонецЕсли;
				//Исключение
				//КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
		МодульОбъектаКлиент = МодульОбъектаКлиент();
		ПараметрыКонструктора = Новый Структура("ГрязныйИни, ДокументФайл, ДокументСсылка", Контекст.ФайлДанные, Док, Контекст.Документ);
		ПараметрыКонструктора.Вставить("ОтправительРоль",	ОтправительРоль);
		ПараметрыКонструктора.Вставить("ПолучательРоль",	ПолучательРоль);

		ПараметрыКонструктора.Вставить("Тип",		Кэш.ОбщиеФункции.РассчитатьЗначение("Тип",		Контекст.ФайлДанные));
		ПараметрыКонструктора.Вставить("ПодТип",	Кэш.ОбщиеФункции.РассчитатьЗначение("ПодТип",	Контекст.ФайлДанные));
		
		Вложение = МодульОбъектаКлиент.НовыйВложениеСБИС(ПараметрыКонструктора);
					
		фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("сбисПослеФормированияДокумента","Файл_"+Контекст.ФайлДанные.Файл_Формат+"_"+СтрЗаменить(СтрЗаменить(Контекст.ФайлДанные.Файл_ВерсияФормата, ".", "_"), " ", ""),"Файл_Шаблон", Кэш);
		Если фрм<>Ложь Тогда
			фрм.сбисПослеФормированияДокумента(Док, Кэш, Контекст);	
		КонецЕсли;
		
		// Переделать получившееся вложение под конверт
		
		ИмяДокумента				= Кэш.ОбщиеФункции.ПолучитьРеквизитМетаданныхОбъекта(Контекст.Документ, "Имя");
		НеЗапускатьВДокументооборот	= Кэш.ОбщиеФункции.РассчитатьЗначение("НеЗапускатьВДокументооборот", Контекст.ФайлДанные);		
		
		// Получить пользовательский идентификатор
		МассивСтатусРегламент	= МодульОбъектаКлиент.ПолучитьЗначениеПараметраСбис("МассивСтатусРегламент");
		РегламентСтруктура		= МодульОбъектаКлиент.ВложениеСБИС_Получить(Вложение, "Регламент");
		
		//KES 050751151 Статусы в разрезе регламентов (ОТПРАВКА ПАКЕТА ДОКУМЕНТОВ) --> 40 +
		Если		ЗначениеЗаполнено(РегламентСтруктура) 
			И		РегламентСтруктура.Свойство("Название") 
			И НЕ	МассивСтатусРегламент.Найти(РегламентСтруктура.Название) = Неопределено Тогда
			
			// Хранение статуса идёт по регламенту - Пользовательский ИД генерируется
			фрм		= Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПрочитатьПараметрыДокументаСБИС", Кэш.ФормаРаботыСоСтатусами,"",Кэш);
			ИдДок	= фрм.ПрочитатьПараметрыДокументаСБИС(	Контекст.Документ,
															Кэш.ГлавноеОкно.Кэш.Парам.КаталогНастроек,
															РегламентСтруктура.Название+"ДокументСБИС_Ид",Кэш.Ини);
			ПользовательскийИдентификатор = ИмяДокумента + ":" + ?( ЗначениеЗаполнено(ИдДок), ИдДок, Строка(Новый УникальныйИдентификатор));
			
		Иначе
			
			ПользовательскийИдентификатор = Кэш.ОбщиеФункции.РассчитатьЗначение("Документ_ПользовательскийИдентификатор", Контекст.ФайлДанные, Кэш);
			Если НЕ ЗначениеЗаполнено(ПользовательскийИдентификатор) Тогда
				
				ПользовательскийИдентификатор = ИмяДокумента + ":" + Строка(Контекст.Документ.УникальныйИдентификатор());
				
			КонецЕсли;
			
		КонецЕсли;
					
		Вложение.Вставить("НашаОрганизация",	МодульОбъектаКлиент.ВложениеСБИС_Получить(Вложение, "Отправитель"));
		Вложение.Вставить("_класс",				"СоставПакета");
		
		ПолучательКонверт = МодульОбъектаКлиент.ВложениеСБИС_Получить(Вложение, "Получатель");
		Если Не ПолучательКонверт = Неопределено Тогда
		 
			Вложение.Вставить("Контрагент", ПолучательКонверт);
			
		КонецЕсли;
		Вложение.Удалить("Отправитель");
		Вложение.Удалить("Получатель");
		
		Вложение.Вставить("НеЗапускатьВДокументооборот",	НеЗапускатьВДокументооборот);
		Вложение.Вставить("ПользовательскийИдентификатор",	ПользовательскийИдентификатор);
		
		Контекст.СоставПакета.Вставить("Конверт",Вложение);
		
		Возврат Истина;
		
	Исключение
		Если Кэш.Свойство("РезультатОтправки") Тогда
			Кэш.РезультатОтправки.НеСформировано = Кэш.РезультатОтправки.НеСформировано+1;
			Кэш.РезультатОтправки.ОшибкиДоОтправки = Кэш.РезультатОтправки.ОшибкиДоОтправки + 1;
			Кэш.ОбщиеФункции.ДобавитьОшибкуВРезультатОтправки(Кэш, "Документ не сформирован", ОписаниеОшибки(), Контекст.Документ, 726)
		КонецЕсли;
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
КонецФункции