
&НаКлиенте
Перем Файл_Шаблон_Модуль; 

#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

&НаКлиенте
Функция СформироватьДокументДляГенератора(ПараметрыФормированияВходящие, Кэш) Экспорт
	
   	Файл_Шаблон_Модуль = Кэш.ГлавноеОкно.сбисПолучитьФорму("Файл_Шаблон");
	Файл_Шаблон_Модуль.СформироватьДокументДляГенератора(ПараметрыФормированияВходящие, Кэш);
		
	ТекДокумент = ПараметрыФормированияВходящие.Документ.Файл.Документ;  
	
	ТекДокумент.ПоФактХЖ = "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";

	Для каждого Основание Из ТекДокумент.Основание Цикл
	
		Если Основание.Название = "ДокПодтвОтгр" Тогда 
			ТекДокумент.Вставить("НаимДокОпр", Основание.НаимДокОтгр);
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
КонецФункции

// Процедура заполняет данные документа по его параметрам
//
// Параметры:
//  Док	 - Структура - Контекст рассчитываемого документа
//  Кэш	 - Структура - Кэш обработки
//
&НаКлиенте
Процедура ЗаполнитьПоДокументПараметр(Док, Кэш) Экспорт  
	
	Файл_Шаблон_Модуль = Кэш.ГлавноеОкно.сбисПолучитьФорму("Файл_Шаблон");
	Файл_Шаблон_Модуль.ЗаполнитьПоДокументПараметр(Док, Кэш);
	
	ТекДокумент = Док.Файл.Документ;

	Если НЕ ТекДокумент.Свойство("Параметр") Тогда  
		
		Возврат; 
		
	КонецЕсли;
	
	Для Каждого ТекСтрока ИЗ ТекДокумент.Параметр Цикл

		Если ТекСтрока.Имя = "СвПерВещ" Тогда
	
			ТекДокумент.Вставить(ТекСтрока.Имя, ТекСтрока.Значение);
			
		КонецЕсли;  
		
		Если ТекСтрока.Имя = "ОбстФормСЧФ" Тогда
			
			ТекДокумент.Вставить("СпОбстФСЧФДОП", ТекСтрока.Значение);
				
		КонецЕсли;     
		
		Если ТекСтрока.Имя = "РабОргПрод_Должность" Тогда
			
			ЗаполнитьРаботникОрганизацииПродавца(ТекДокумент, "Должность", ТекСтрока.Значение); 
				
		КонецЕсли;   
		
		Если ТекСтрока.Имя = "РабОргПрод_ФИО" Тогда
			
			ЗаполнитьРаботникОрганизацииПродавца(ТекДокумент, "ФИО", ТекСтрока.Значение); 
				
		КонецЕсли; 
	
    КонецЦикла;
	
КонецПроцедуры 

// Процедура - патчит данные файла по его параметрам
//
// Параметры:
//  ТекДокумент			 - Структура - Документ для обогащения
//  КлючПараметра		 - Строка	 - Ключ структуры для обогащения
//  ЗначениеПараметра	 - Строка	 - Зачение структуры для обогащения
//
&НаКлиенте
Процедура ЗаполнитьРаботникОрганизацииПродавца(ТекДокумент, КлючПараметра, ЗначениеПараметра) Экспорт 
	
	Если Не ТекДокумент.Свойство("РабОргПрод") Тогда    
		
		ТекДокумент.Вставить("РабОргПрод", Новый Структура());  
		
	КонецЕсли;
	
	Если КлючПараметра = "ФИО" Тогда    
		
		МодульФункций = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
		
		СоставПолногоИмени = МодульФункций.сбисПолучитьФИО(ЗначениеПараметра); 
		
		Для Каждого ЭлементСостава Из СоставПолногоИмени Цикл
			
			 ЗаполнитьРаботникОрганизацииПродавца(ТекДокумент, ЭлементСостава.Ключ, ЭлементСостава.Значение);
			
		КонецЦикла;
		
	Иначе
		
		ТекДокумент.РабОргПрод.Вставить(КлючПараметра, ЗначениеПараметра);	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДокументОснование(Док, Кэш) Экспорт
	
	Файл_Шаблон_Модуль = Кэш.ГлавноеОкно.сбисПолучитьФорму("Файл_Шаблон");
	Файл_Шаблон_Модуль.ЗаполнитьПоДокументОснование(Док, Кэш);
	
	ТекДокумент = Док.Файл.Документ;
		
	НаимДокОтгр = "Универсальный передаточный документ";
	Для каждого Основание Из ТекДокумент.Основание Цикл
		Если Основание.Свойство("НаимДокОтгр")
			И ЗначениеЗаполнено(Основание.НаимДокОтгр) Тогда
			
			НаимДокОтгр = Основание.НаимДокОтгр;
			Прервать;
			
		КонецЕсли;
	КонецЦикла;

	Если Не ТекДокумент.Свойство("ДокПодтвОтгр") Тогда
		
		ТекДокумент.Вставить("ДокПодтвОтгр", Новый Структура());
		ТекДокумент.ДокПодтвОтгр.Вставить("ДатаДокОтгр", ТекДокумент.Дата);
		ТекДокумент.ДокПодтвОтгр.Вставить("НомДокОтгр",  ТекДокумент.Номер);
		ТекДокумент.ДокПодтвОтгр.Вставить("НаимДокОтгр", НаимДокОтгр);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОснование(Док, Кэш) Экспорт 

	ТекДокумент = Док.Файл.Документ;
	Если НЕ ТекДокумент.Свойство("Основание") Тогда
		Возврат;	
	КонецЕсли;
	
	Исключения = ПолучитьИсключенияОснование();
	ОснованиеМассив = Новый Массив;
	
	Для Каждого ТекСтрока ИЗ ТекДокумент.Основание Цикл
		
		Если ТекСтрока.Свойство("Тип") Тогда
			Ключ = "Тип";	
		Иначе
			Ключ = "Название";	
		КонецЕсли;
		
		Если Исключения.Получить(ТекСтрока[Ключ]) = Истина Тогда
			Продолжить;	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Название) Тогда
			Продолжить;	
		КонецЕсли;
		
		Если НЕ ТекСтрока.Свойство("Дата") Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Дата) И ТекСтрока.Название <> "-" Тогда
			Продолжить;	
		КонецЕсли;  
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Номер) Тогда
			ТекСтрока.Номер = "Без номера";
		КонецЕсли;
		
		Основание = Новый Структура("Номер, Название, Дата");
		Основание.Название 	= ТекСтрока.Название;
		Основание.Номер 	= ТекСтрока.Номер;
		Основание.Дата 		= ТекСтрока.Дата;
		
		Если ТекСтрока.Свойство("ДопСвед") Тогда
			Основание.Вставить("ДопСвОсн", ТекСтрока.ДопСвед);
		КонецЕсли;
		
		ОснованиеМассив.Добавить(Основание);
		
	КонецЦикла;
	
	ЕстьОснование = ОснованиеМассив.Количество();
		
	Если НЕ ЕстьОснование Тогда
		
		ТекДокумент.Вставить("БезДокОснПер", "1");
		
	КонецЕсли;
	
	ТекДокумент.Вставить("Основание", ОснованиеМассив);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИсключенияОснование()
	
	ИсключенияИнфПол = Новый Соответствие;
	ИсключенияИнфПол.Вставить("ПРД", Истина);
	ИсключенияИнфПол.Вставить("СчФ", Истина);
	ИсключенияИнфПол.Вставить("КСчФ", Истина);
	ИсключенияИнфПол.Вставить("ИспрСчФ", Истина);
	ИсключенияИнфПол.Вставить("ИсхСчФ", Истина);
	ИсключенияИнфПол.Вставить("ИспрИсхСчФ", Истина);
	ИсключенияИнфПол.Вставить("ДокПодтвОтгр", Истина);
	
	Возврат ИсключенияИнфПол;
	
КонецФункции

//Штатный обработчик строки подстановки
&НаКлиенте
Процедура ОбработчикДанных_ЗаполнитьСтрокуТабличнойЧастиДокумента(Аргумент, ДопПараметры) Экспорт
	
	Файл_Шаблон_Модуль = ДопПараметры.Кэш.ГлавноеОкно.сбисПолучитьФорму("Файл_Шаблон");
	
	Файл_Шаблон_Модуль.ОбработчикДанных_ЗаполнитьСтрокуТабличнойЧастиДокумента	(Аргумент, ДопПараметры);
	Файл_Шаблон_Модуль.УстановитьПризнакДобавленияСтроки						(Аргумент, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНоменклатуруВложения(Кэш, Контекст) Экспорт
	
	ФормаФайл = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ОбновитьНоменклатуруВложения", "Файл_СчФктр_3_01");
	ФормаФайл.ОбновитьНоменклатуруВложения(Кэш, Контекст);
	
КонецПроцедуры   

&НаКлиенте
Процедура СформироватьПараметры(Док, Кэш) Экспорт
	
	ТекФайл		= Док.Файл;
	ТекДокумент = ТекФайл.Документ;
	Файл_Шаблон = МодульОбъектаКлиент().ПолучитьФормуОбработки("Файл_Шаблон");

	Если НЕ ТекДокумент.Свойство("Параметр") Тогда
		Возврат;
	КонецЕсли;
	
	мПараметры = ТекДокумент.Параметр;

	Файл_Шаблон.ДобавитьПараметрДокументаПоПути(ТекДокумент, мПараметры, "Получатель.GLN",			"GLNПокуп",			Кэш);
	Файл_Шаблон.ДобавитьПараметрДокументаПоПути(ТекДокумент, мПараметры, "Грузополучатель.GLN",		"GLNГрузПолуч",		Кэш);
	Файл_Шаблон.ДобавитьПараметрДокументаПоПути(ТекДокумент, мПараметры, "Отправитель.GLN",			"GLNПост",			Кэш);
	Файл_Шаблон.ДобавитьПараметрДокументаПоПути(ТекДокумент, мПараметры, "Грузоотправитель.GLN",	"GLNГрузОтпр",		Кэш);

	Файл_Шаблон.ДобавитьПараметрДокументаПоПути(ТекФайл,	мПараметры,	"КодФормы",	"ИдВизуализации",	Кэш);
		
	мПараметры = Файл_Шаблон.ПолучитьПараметрыБезПустыхЗаписей(Кэш, мПараметры);
	
	Если мПараметры.Количество() <> 0 Тогда
		ТекДокумент.Вставить("Параметры", мПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПропатчитьИмяФайлаВложения(ВложениеСБИС, ДопПараметры) Экспорт 
	
	Перем ПолучательИд, ОтправительИд, ФайлИмяПропатчить, лДанныеСторон;
	
	СтруктураФайла      = МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "СтруктураФайла");
	ФайлПропатчить		= МодульОбъектаКлиент().ВложениеСБИС_Получить(СтруктураФайла, "Файл");
	
	ДатаВремяСоздания	= ТекущаяДата();     
	
	Если ДопПараметры.Свойство("ПутьКСторонам") Тогда
		лДанныеСторон = МодульОбъектаКлиент().ПолучитьДанныеПоПути(Новый Структура("Данные, Путь", ФайлПропатчить, ДопПараметры.ПутьКСторонам));
	Иначе
		лДанныеСторон = ФайлПропатчить.Документ;
	КонецЕсли;    
	
	ИдФайлаДляИмениФайла = МодульОбъектаКлиент().СтруктураИдФайлаПередаточногоДокумента();  
	
	МодульОбъектаКлиент().ПропатчитьИдФайлаДляИмениФайла(ИдФайлаДляИмениФайла, ФайлПропатчить);	
	
	Если НЕ ФайлПропатчить.Свойство("Имя") Тогда    
		
		Возврат;
		
	КонецЕсли;
		
	ФайлИмяПропатчить = "ON_NSCHFDOPPR_";		 
	
	Если	ДопПараметры.ГрязныйИни.Свойство("мСторона") 
		И	лДанныеСторон[ДопПараметры.ПолучательРоль].Свойство("Идентификатор",	ПолучательИД) 
		И	лДанныеСторон[ДопПараметры.ОтправительРоль].Свойство("Идентификатор",	ОтправительИД) Тогда
		ФайлИмяПропатчить = ФайлИмяПропатчить + ПолучательИД + "_" + ОтправительИД;
	Иначе
		ФайлИмяПропатчить = ФайлИмяПропатчить + "_";
	КонецЕсли; 
	
	ФайлПропатчить.Имя = ФайлИмяПропатчить + "_" + Формат(ДатаВремяСоздания, "ДФ=ггггММдд") + "_" + Строка(Новый УникальныйИдентификатор())
		+ "_" + ИдФайлаДляИмениФайла.N2 + "_" + ИдФайлаДляИмениФайла.N3 + "_" + ИдФайлаДляИмениФайла.N4 
		+ "_" + ИдФайлаДляИмениФайла.N5 + "_" + ИдФайлаДляИмениФайла.N6 + "_00";

КонецПроцедуры       
	
// Функция - патчит сторону документа для ее заполнения в генераторе ФЭД
//
// Параметры:
//  Кэш			 - Структура	- Кэш обработки
//  Вложение	 - Структура	- Структура вложения из состава пакета
//  ИмяСтороны	 - Строка		- Ключ стороны
// 
// Возвращаемое значение:
//  Структура - Данные стороны, результат работы функции
//
&НаКлиенте
Функция ИсточникДанных_ПолучитьДанныеСтороныПоИмени(Кэш, Вложение, ИмяСтороны) Экспорт
	
	фрм = МодульОбъектаКлиент().ПолучитьФормуОбработки("Файл_СчФктр_3_01"); 
	Возврат фрм.ИсточникДанных_ПолучитьДанныеСтороныПоИмени(Кэш, Вложение, ИмяСтороны);
	
КонецФункции
	