
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

&НаКлиенте
Процедура ПропатчитьСтруктуруВложения(ВложениеСБИС, ДопПараметры) Экспорт
	
	УдаляемыеУзлы = Новый Массив;
	УдаляемыеУзлы.Добавить("Файл.Документ.Покупатель.Адрес.АдрРФ.НаимРегион");
	УдаляемыеУзлы.Добавить("Файл.Документ.Поставщик.Адрес.АдрРФ.НаимРегион");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузоотправитель.Адрес.АдрРФ.НаимРегион");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузополучатель.Адрес.АдрРФ.НаимРегион");

	УдаляемыеУзлы.Добавить("Файл.Документ.Покупатель.Адрес.АдрИно.НаимСтран");
	УдаляемыеУзлы.Добавить("Файл.Документ.Поставщик.Адрес.АдрИно.НаимСтран");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузоотправитель.Адрес.АдрИно.НаимСтран");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузополучатель.Адрес.АдрИно.НаимСтран");
	
	УдаляемыеУзлы.Добавить("Файл.Документ.Покупатель.Адрес.ФиасИд");
	УдаляемыеУзлы.Добавить("Файл.Документ.Поставщик.Адрес.ФиасИд");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузоотправитель.Адрес.ФиасИд");
	УдаляемыеУзлы.Добавить("Файл.Документ.Грузополучатель.Адрес.ФиасИд");

	МодульОбъектаКлиент().ВложениеСБИС_УдалитьУзлыИзСтруктурыДанных(ВложениеСБИС, УдаляемыеУзлы);

КонецПроцедуры
