// функции для совместимости кода 
&НаКлиенте
Функция сбисПолучитьФорму(СбисИмяФормы)
	Возврат ВладелецФормы.сбисПолучитьФорму(СбисИмяФормы);
КонецФункции
&НаКлиенте
Функция сбисЭлементФормы(Форма,ИмяЭлемента)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Форма.Элементы.Найти(ИмяЭлемента);
	КонецЕсли;
	Возврат Форма.ЭлементыФормы.Найти(ИмяЭлемента);
КонецФункции
&НаКлиенте
Процедура сбисПоказатьСостояние(ТекстСостояния, Форма = Неопределено, Индикатор = Неопределено, Пояснение = "")
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Состояние(ТекстСостояния,Индикатор,Пояснение);
	Иначе
		Форма.ЭлементыФормы.ПанельОжидания.Видимость = Истина;
		Форма.НадписьОжидания = Символы.ПС + ТекстСостояния;
		Форма.НадписьПояснение = Пояснение;
		Если Индикатор<>Неопределено Тогда
			Форма.ЭлементыФормы.Индикатор.Видимость = Истина;
			Форма.ЭлементыФормы.Индикатор.Значение = Индикатор;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
&НаКлиенте
Процедура сбисСпрятатьСостояние(Форма = Неопределено)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
	Иначе
		Форма.ЭлементыФормы.ПанельОжидания.Видимость = Ложь;
		Форма.ЭлементыФормы.Индикатор.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция СформироватьНастройкиПодключения(Кэш, ИдентификаторСессии = "") Экспорт
	
	// в апи ничего не делает		
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура сбисУстановитьВремяОжидания(Кэш, ВремяОжидания) Экспорт
	Кэш.СБИС.ПараметрыИнтеграции.Вставить("ВремяОжиданияОтвета", ВремяОжидания);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокСертификатов(Кэш, filter=Неопределено) Экспорт
	// Получает список доступных сертификатов	
	Отказ = Ложь;
	ДопПараметры = Новый Структура("ЕстьРезультат", Истина);
	МестныйКэш = Кэш;
	СписокСертификатов = Новый СписокЗначений();
	
	Если filter=Неопределено Тогда
		filter = Новый Структура("Фильтр", Новый Структура);
	КонецЕсли;
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.СписокСертификатов", filter, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат СписокСертификатов;
	КонецЕсли;
	
	Object = Результат;
	ObjectList = Неопределено;
	Object.Свойство("Сертификат",ObjectList);
	Если ObjectList<>Неопределено Тогда
		Размер = ObjectList.Количество();
		Для сч=0 По Размер-1 Цикл
			Сертификат = ObjectList[сч];
			Если ТипЗнч(Сертификат.ДействителенПо)=Тип("Дата") Тогда
				ДействителенПо = Дата(Год(Сертификат.ДействителенПо), Месяц(Сертификат.ДействителенПо), День(Сертификат.ДействителенПо));
			Иначе
				ДействителенПо = Дата(Сред(Сертификат.ДействителенПо,7,4), Сред(Сертификат.ДействителенПо,4,2), Лев(Сертификат.ДействителенПо, 2));
			КонецЕсли;
			Если ДействителенПо>=ТекущаяДата() Тогда
				СписокСертификатов.Добавить(Сертификат);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокСертификатов;
КонецФункции
&НаКлиенте
Функция ПолучитьСписокЛокальныхСертификатов(Кэш, filter=Неопределено) Экспорт
	
	СертификатыЛокальные = Новый СписокЗначений();
	ТекстОшибки = "";
	Попытка
		
		СертификатыЛокальные =  Кэш.ФормаЭП.сбисСписокЛокальныхСертификатов(Кэш, ТекстОшибки);
		
	Исключение
		ТекстОшибки = ИнформацияОбОшибке();
		МодульОбъектаКлиент().ВызватьСбисИсключение(ТекстОшибки, "API.ПолучитьСписокЛокальныхСертификатов");
		Возврат СертификатыЛокальные;
	КонецПопытки;              

	Возврат СертификатыЛокальные;
	
КонецФункции
&НаКлиенте
Функция ПолучитьСертификатыДляАктивации(Кэш, СписокИНН) Экспорт
	// Функция активирует серверные сертификаты для определенного списка ИНН	
	СписокСертификатовДляАктивации = Новый СписокЗначений;;
	СписокСертификатов = ПолучитьСписокСертификатов(Кэш);
	Для Каждого ИНН Из СписокИНН Цикл
		Для Каждого Элемент Из СписокСертификатов Цикл
			Сертификат = Элемент.Значение;
			Если Сертификат.ИНН = ИНН.Значение Тогда
				Если Сертификат.Ключ.Тип = "Серверный" и Сертификат.Ключ.Активирован = "Нет" Тогда
					СписокСертификатовДляАктивации.Добавить(Сертификат);
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат СписокСертификатовДляАктивации;
КонецФункции
&НаКлиенте
Функция ПолучитьКодАктивацииСертификата(Кэш, Сертификат) Экспорт
	Отказ = Ложь;
	ДопПараметры = Новый Структура("ЕстьРезультат", Истина);
	certificate = Новый Структура;
	certificate.Вставить("Отпечаток", Сертификат.Отпечаток);
	
	СтруктураПараметровЗапроса = Новый Структура("Сертификат", certificate);
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ПолучитьКодАктивацииСертификата", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	Если Отказ Тогда 
		Возврат Ложь;
	КонецЕсли;
	Возврат Результат;
КонецФункции
&НаКлиенте
Функция АктивироватьСерверныеСертификаты(Кэш, СписокСертификатов) Экспорт
	// Функция активирует серверные сертификаты для определенного списка ИНН	
	Отказ = Ложь;
	ДопПараметры = Новый Структура("ЕстьРезультат", Истина);
	Для Каждого Элемент Из СписокСертификатов Цикл
		Сертификат = Элемент.Значение;
		certificate = Новый Структура;
		certificate.Вставить("Отпечаток", Сертификат.Отпечаток);
		certificate.Вставить("КодАктивации", Сертификат.КодАктивации);
		СтруктураПараметровЗапроса = Новый Структура("Сертификат", certificate);
		
		СтруктураРезультата = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.АктивироватьСертификат", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
		Если Отказ Тогда 
			Если СтруктураРезультата.code = 775 Тогда
				ТекстОшибки = "Не удалось активировать сертификат.";
			Иначе
				ТекстОшибки = СтруктураРезультата.message +?(СтруктураРезультата.details = СтруктураРезультата.message, "", (" "+ СтруктураРезультата.details)); 
			КонецЕсли;
			Сообщить(ТекстОшибки);
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции
&НаКлиенте
Функция ПолучитьТикетДляТекущегоПользователя(Кэш) Экспорт
	// Функция получает токен по текущему сиду	
	
	Отказ = Ложь;
	ДопПараметры = Новый Структура("ЕстьРезультат", Истина);
	
	МестныйКэш = Кэш;
	СтруктураРезультата = сбисОтправитьИОбработатьКоманду(Кэш, "САП.GetTicketForCurrentSid", Новый Структура, ДопПараметры, Отказ);
	Если Отказ Тогда 
		ТекстОшибки = СтруктураРезультата.message +?(СтруктураРезультата.details = СтруктураРезультата.message, "", (" "+ СтруктураРезультата.details)); 
		Сообщить(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	Возврат СтруктураРезультата
КонецФункции
&НаКлиенте
Функция ПолучитьИдТекущегоАккаунта(Кэш) Экспорт
	Перем СбисИдАккаунта;
	Если Кэш.СБИС.ПараметрыИнтеграции.Свойство("ИдАккаунта", СбисИдАккаунта) Тогда
		Возврат СбисИдАккаунта;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции
&НаКлиенте
Функция ПолучитьТокенДляТекущегоПользователя(Кэш,Отказ=Ложь) Экспорт
	// Функция активирует серверные сертификаты для определенного списка ИНН	
	
	КэшПарам = Новый Структура("ПолнаяВерсияПродукта,ТипПрокси,ПроксиСервер,ПроксиПорт,ПроксиЛогин,ПроксиПароль,UserAgent");
	ЗаполнитьЗначенияСвойств(КэшПарам, Кэш.Парам);//Отправляем только те параметры, что нужны для вызова команды, чтобы не перегружать вызов сервера.
	КэшПарам.Вставить("АдресСервера",Кэш.СБИС.АдресСервера);
	КэшПарам.Вставить("СовместимостьМетодов",Кэш.СовместимостьМетодов);
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("сбисСформироватьДанныеТекущегоПользователя","РаботаСДокументами1С","",Кэш);
	ДанныеСотрудника = фрм.сбисСформироватьДанныеТекущегоПользователя(Кэш);
	
	ИдСотрИС = ДанныеСотрудника.Сотрудник.ИдентификаторИС;
	Если ИдСотрИС = "00000000-0000-0000-0000-000000000000" Тогда
		Отказ = Истина;
		ТекстОшибки = "Не удалось получить идентификатор сотрудника. Возможно текущий пользователь 1С не связан с физическим лицом.";
		Ошибка = Кэш.ОбщиеФункции.сбисИсключение(Новый Структура("message,details,code",ТекстОшибки,ТекстОшибки,100), "ПолучитьТокенДляТекущегоПользователя");
		Возврат Ошибка;
	КонецЕсли;

	Результат = ПолучитьТокенДляТекущегоПользователяНаСервере(КэшПарам, ДанныеСотрудника, Отказ);
	Если Отказ Тогда 
		Ошибка = Кэш.ОбщиеФункции.сбисИсключение(Новый Структура("message,details,code",Результат,Результат,100), "ПолучитьТокенДляТекущегоПользователя");
		Возврат Ошибка;
	КонецЕсли;
	Возврат Результат
КонецФункции

&НаСервере
Функция ПолучитьНастройкиАвторизацииДляТекущегоПользователяНаСервере(Отказ = Ложь) Экспорт
 	// Функция активирует серверные сертификаты для определенного списка ИНН	
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		Настройки = ХранилищеОбщихНастроек.Загрузить("СБИС", "Авторизация",,"ПользовательСБИС");
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		Отказ = Истина;
		ЗаписьВСтэк = "SabyHttpsClient.ПолучитьНастройкиАвторизацииДляТекущегоПользователяНаСервере";
		Возврат МодульОбъектаСервер().НовыйСбисИсключение(ИнформацияОбОшибке(), ЗаписьВСтэк);
	КонецПопытки;
	
	Возврат Настройки;
КонецФункции	

&НаКлиенте
Функция ПолучитьТокенДляТекущегоПользователяНаСервере(КэшПарам, ДанныеСотрудника,Отказ=Ложь) Экспорт
	
	Настройки = ПолучитьНастройкиАвторизацииДляТекущегоПользователяНаСервере(Отказ); 	
	
	Если Настройки = Неопределено Тогда
		Отказ = Истина;
		Возврат "Не заполнены данные администратора системы для авторизации по токену.";
	КонецЕсли; 
	
	Если Настройки.Свойство("ИДПриложения") И ЗначениеЗаполнено(Настройки.ИДПриложения) Тогда
		СтруктураРезультата = АвторизоватьсяПриложением(КэшПарам,Настройки.ИДПриложения, Настройки.КлючПриложения, Настройки.КлючАутентификации, Отказ);
	Иначе
	СтруктураРезультата = АвторизоватьсяПоЛогинуПаролю(КэшПарам,Настройки.Логин, Настройки.Пароль, Отказ);
	КонецЕсли;
	Если Отказ Тогда 
		СтруктураРезультата = СтруктураРезультата.Результат;
		ТекстОшибки = СтруктураРезультата.message +?(СтруктураРезультата.details = СтруктураРезультата.message, "", (" "+ СтруктураРезультата.details)); 
		Возврат ТекстОшибки;
	КонецЕсли;
	
	ДопПараметры = Новый Структура("ЕстьРезультат, ИдСессии", Истина, СтруктураРезультата.Результат);
	
	СтруктураПараметровЗапроса = Новый Структура("ExternalId", ДанныеСотрудника.Сотрудник.ИдентификаторИС);
	
	СтруктураРезультата = сбисОтправитьИОбработатьКоманду(КэшПарам, "User.GetTokenByExternalId", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	Если Отказ Тогда 
		ТекстОшибки = СтруктураРезультата.message +?(СтруктураРезультата.details = СтруктураРезультата.message, "", (" "+ СтруктураРезультата.details)); 
		Возврат ТекстОшибки;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СтруктураРезультата) Тогда
		СтруктураРезультата = сбисПрочитатьСотрудника(КэшПарам, ДанныеСотрудника.Сотрудник.ИдентификаторИС, ДопПараметры, Отказ);
		Если Отказ Тогда 
			Если Лев(СтруктураРезультата.message, 27) = "Не удалось найти сотрудника" Тогда
				СоздаватьСотрудника = Ложь;
				Попытка
					Для Каждого Стр Из Настройки.Профили Цикл
						Для Каждого Элемент Из ДанныеСотрудника.Права.Роль Цикл
							Если Стр.Наименование = Элемент.Название Тогда
								СоздаватьСотрудника = Истина;
								Прервать;
							КонецЕсли;
						КонецЦикла;						
					КонецЦикла;
					Если СоздаватьСотрудника Тогда
						ДанныеСотрудников = Новый Соответствие;
						ДанныеСотрудников.Вставить(ТекущийПользовательНаСервере(), ДанныеСотрудника);
						Отказ = Ложь;
						РезультатОтправки = сбисЗаписатьСотрудниковНаСервере(КэшПарам, ДанныеСотрудников, ДопПараметры, Отказ);
						Если Отказ Тогда
							Для Каждого Ошибка Из РезультатОтправки.ДетализацияОшибок Цикл
								
								Возврат МодульОбъектаКлиент().СбисИсключение_Представление(Ошибка.Значение[0].СтруктураОшибки, "Сообщение");

							КонецЦикла;
						КонецЕсли;
						ИдСотрудникаСБИС = РезультатОтправки.Успешные[0].Сотрудник.Идентификатор;
						
					Иначе
						
						Возврат МодульОбъектаКлиент().СбисИсключение_Представление(СтруктураРезультата, "Сообщение");

					КонецЕсли;
				Исключение
					
					Ошибка = ОписаниеОшибки();
					Возврат МодульОбъектаКлиент().СбисИсключение_Представление(СтруктураРезультата, "Сообщение");
					
				КонецПопытки;
			Иначе
				
				Возврат МодульОбъектаКлиент().СбисИсключение_Представление(СтруктураРезультата, "Сообщение");
				
			КонецЕсли;
		Иначе
			ИдСотрудникаСБИС = СтруктураРезультата.Сотрудник.Идентификатор;
		КонецЕсли;
		СтруктураРезультата = УстановитьСвязиЛиц(КэшПарам, ДанныеСотрудника.Сотрудник.ИдентификаторИС, ИдСотрудникаСБИС, ДопПараметры, Отказ);
	    Если Отказ Тогда 
			ТекстОшибки = СтруктураРезультата.message +?(СтруктураРезультата.details = СтруктураРезультата.message, "", (" "+ СтруктураРезультата.details)); 
			Возврат ТекстОшибки;
		КонецЕсли;
		СтруктураРезультата = сбисОтправитьИОбработатьКоманду(КэшПарам, "User.GetTokenByExternalId", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
		Если Отказ Тогда
			
			Возврат МодульОбъектаКлиент().СбисИсключение_Представление(СтруктураРезультата, "Сообщение");

		КонецЕсли;
		Возврат СтруктураРезультата;
	КонецЕсли;
	Возврат СтруктураРезультата;
КонецФункции

&НаСервере
Функция ТекущийПользовательНаСервере() 
	Возврат ПараметрыСеанса.ТекущийПользователь;	
КонецФункции

&НаКлиенте
Функция УстановитьСвязиЛиц(КэшПарам, ИдСотрИС, ИдСотрСБИС, ДопПараметры = Неопределено, Отказ=Ложь) Экспорт
	// Функция активирует серверные сертификаты для определенного списка ИНН	
	Отказ = Ложь;
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура("ЕстьРезультат", Истина);
	КонецЕсли;
	//ИдСотрИС = ПолучитьИдентификаторТекущегоПользователя();
	СтруктураПараметровЗапроса = Новый Структура("ExternalId, FaceId", ИдСотрИС, ИдСотрСБИС);
	
	СтруктураРезультата = сбисОтправитьИОбработатьКоманду(КэшПарам, "User.LinkExternalUser", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	Если Отказ Тогда 
		Возврат СтруктураРезультата;
	КонецЕсли;
	Возврат Истина;
КонецФункции
&НаКлиенте
Функция сбисПрочитатьСотрудника(КэшПарам, ИдСотрИС, ДопПараметры = Неопределено, Отказ=Ложь) Экспорт
	// Функция активирует серверные сертификаты для определенного списка ИНН	
	Отказ = Ложь;
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура("ЕстьРезультат", Истина);
	КонецЕсли;
	СтруктураПараметровЗапроса = Новый Структура("Параметр", Новый Структура("Сотрудник", Новый Структура("ИдентификаторИС", ИдСотрИС)));
	
	СтруктураРезультата = сбисОтправитьИОбработатьКоманду(КэшПарам, "СБИС.ПрочитатьСотрудника", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	Возврат СтруктураРезультата;
КонецФункции
&НаКлиенте
Функция сбисЗаписатьСотрудников(Кэш, ДанныеСотрудников, Отказ) Экспорт
	// Функция активирует серверные сертификаты для определенного списка ИНН	
	КэшПарам = Новый Структура("ПолнаяВерсияПродукта,ТипПрокси,ПроксиСервер,ПроксиПорт,ПроксиЛогин,ПроксиПароль,ИдентификаторСессии,UserAgent");
	ЗаполнитьЗначенияСвойств(КэшПарам, Кэш.Парам);//Отправляем только те параметры, что нужны для вызова команды, чтобы не перегружать вызов сервера.
	КэшПарам.Вставить("АдресСервера",Кэш.СБИС.АдресСервера);
	КэшПарам.Вставить("СовместимостьМетодов",Кэш.СовместимостьМетодов);
	Возврат сбисЗаписатьСотрудниковНаСервере(КэшПарам, ДанныеСотрудников)
КонецФункции

// Функция - активирует серверные сертификаты для определенного списка ИНН
//
// Параметры:
//  КэшПарам			 - 	 - 
//  ДанныеСотрудников	 - 	 - 
//  ДопПараметры		 - 	 - 
//  Отказ				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Функция сбисЗаписатьСотрудниковНаСервере(КэшПарам, ДанныеСотрудников, ДопПараметры = Неопределено, Отказ = Ложь) Экспорт

	РезультатОтправки = Новый Структура;
	РезультатОтправки.Вставить("ТипыОшибок",		Новый СписокЗначений);
	РезультатОтправки.Вставить("Отправлено",		0);
	РезультатОтправки.Вставить("НеОтправлено",		0);
	РезультатОтправки.Вставить("НеСформировано",	0);
	РезультатОтправки.Вставить("Ошибок",	 		0);
	РезультатОтправки.Вставить("ДетализацияОшибок",	Новый Соответствие);
	РезультатОтправки.Вставить("ВсегоПакетов",		ДанныеСотрудников.Количество());
	РезультатОтправки.Вставить("Успешные",	 		Новый Массив);
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура("ЕстьРезультат", Истина);
	КонецЕсли;
	Для Каждого Элемент Из ДанныеСотрудников Цикл 
		Отказ = Ложь;
		СтруктураПараметровЗапроса = Новый Структура("Параметр", Элемент.Значение);
		
		РезультатЗапроса = сбисОтправитьИОбработатьКоманду(КэшПарам, "СБИС.ЗаписатьСотрудника", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
		Если Отказ Тогда 
			РезультатОтправки.Ошибок = РезультатОтправки.Ошибок + 1;
			// TODO убрать после обертки ошибки в плагине
			Если РезультатЗапроса.message = "Неизвестная ошибка БЛ" и Лев(РезультатЗапроса.details, 30) = "В справочнике ролей не найдены" Тогда
				РезультатЗапроса.message = "В справочнике ролей не найдены роли";
			КонецЕсли;
			ТекстОшибки = РезультатЗапроса.message;
			ЭлементСписка = РезультатОтправки.ТипыОшибок.НайтиПоЗначению(ТекстОшибки);
			Если ЭлементСписка=Неопределено Тогда
				РезультатОтправки.ТипыОшибок.Добавить(ТекстОшибки, 1);
			Иначе
				ЭлементСписка.Представление = Число(ЭлементСписка.Представление)+1;
			КонецЕсли;
			ЭлементСоответствия = РезультатОтправки.ДетализацияОшибок.Получить(ТекстОшибки);
			Если ЭлементСоответствия=Неопределено Тогда
				ЭлементСоответствия = Новый Массив;
				РезультатОтправки.ДетализацияОшибок.Вставить(ТекстОшибки, ЭлементСоответствия);
			КонецЕсли;
			
			СтрокаВСоответствие = Новый Структура("ОбработанДокумент1С,Сообщение,СтруктураОшибки");
			СтрокаВСоответствие.ОбработанДокумент1С	= Элемент.Ключ;
			СтрокаВСоответствие.Сообщение			= РезультатЗапроса.details;
			СтрокаВСоответствие.СтруктураОшибки		= МодульОбъектаКлиент().НовыйСбисИсключение(РезультатЗапроса.code,
																	"SabyHttpsClient.сбисЗаписатьСотрудниковНаСервере",
																	,
																	ТекстОшибки,
																	РезультатЗапроса.details);
			ЭлементСоответствия.Добавить(СтрокаВСоответствие);
		Иначе			
			РезультатОтправки.Отправлено = РезультатОтправки.Отправлено + 1;
			РезультатОтправки.Успешные.Добавить(РезультатЗапроса);
		КонецЕсли;
	КонецЦикла;
	Возврат РезультатОтправки;
КонецФункции

//Метод устарел, вместо него использовать Кэш.СБИС.МодульОбъектаКлиент.СбисПолучитьИнформациюОТекущемПользователе
&НаКлиенте
Функция ИнформацияОТекущемПользователе(Кэш) Экспорт
	// Получает информацию о текущем пользователе	
	Отказ = Ложь;
	ДопПараметры = Новый Структура("ЕстьРезультат", Истина);
	СтруктураПараметровЗапроса = Новый Структура("Параметр", Новый Структура);
	СтруктураРезультата = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ИнформацияОТекущемПользователе", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат "";
	КонецЕсли;
	
	Фамилия	= Неопределено;
	Имя		= Неопределено;
	Отчество= Неопределено;
	
	Если Не СтруктураРезультата.Пользователь.Свойство("Фамилия", Фамилия) Тогда
		Фамилия = "";
	КонецЕсли;
	Если Не СтруктураРезультата.Пользователь.Свойство("Имя", Имя) Тогда
		Имя = "";
	КонецЕсли;
	Если Не СтруктураРезультата.Пользователь.Свойство("Отчество",	Отчество) Тогда
		Отчество = "";
	КонецЕсли;
	Возврат Фамилия + " " + Имя + " " + Отчество;
КонецФункции
&НаСервереБезКонтекста
Функция ПолучитьРеквизитОбъекта(Объект1С, ИмяРеквизита)
	// Получает значение реквизита объекта 1С	
	Возврат Объект1С[ИмяРеквизита];	
КонецФункции
&НаКлиенте
Функция ПолучитьФильтр(ГлавноеОкно,ДопПараметры) Экспорт
	Возврат ГлавноеОкно.Кэш.ОбщиеФункции.ПолучитьФильтрСобытий(ГлавноеОкно.Кэш, ДопПараметры);
КонецФункции	

&НаКлиенте
Функция ПолучитьHTMLПоXML(Кэш, Вложение) экспорт
	Перем СбисКодировка;
	// Получает html по xml	
	// Используется при просмотре документов из реестров продаж (1С)
	Отказ = Ложь;
	ДопПараметры = Новый Структура("ЕстьРезультат", Истина);
	МестныйКэш = Кэш;
	
	param = Новый Структура; 
	Если ТипЗнч(Вложение) = Тип("Структура") Тогда
		param.Вставить("XML", Вложение.XMLДокумента);
	Иначе   // для совместимости с внешними Функциями (СформироватьРасхождение)
		param.Вставить("XML", Вложение);
	КонецЕсли;
	param.XML = СтрЗаменить(param.XML, "UTF-8", "windows-1251");
	param.XML = СериализоватьИзСтроки_ВBase64(Кэш, param.XML,, Отказ);
	Если Отказ Тогда 
		Кэш.ГлавноеОкно.СбисСообщитьОбОшибке(Кэш, param.XML);
		Возврат Ложь;
	КонецЕсли;

	СтруктураПараметровЗапроса = Новый Структура("Параметр", param);
	СтруктураРезультата = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.СформироватьHTMLИзXML", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	Если Отказ Тогда 
		Если СтруктураРезультата.code = 775 Тогда
			ТекстОшибки = "Не удалось получить печатную форму документа.";
		Иначе
			ТекстОшибки = СтруктураРезультата.message +?(СтруктураРезультата.details = СтруктураРезультата.message, "", (" "+ СтруктураРезультата.details)); 
		КонецЕсли;
		Сообщить(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
//	Если Не Кэш.КэшЗначенийИни.КодировкиЧтенияФайлов.ПоУмолчанию.Свойство("API_HTMLпоXML_Чтение", СбисКодировка) Тогда
		СбисКодировка = "windows-1251";
//	КонецЕсли;
	ТекстXMLBase64 = СтруктураРезультата.HTML;
	html_text = СериализоватьИзBase64_ВСтроку(Кэш, ТекстXMLBase64, СбисКодировка, Отказ);
	Если Отказ Тогда 
		Кэш.ГлавноеОкно.СбисСообщитьОбОшибке(Кэш, html_text);
		Возврат Ложь;
	КонецЕсли;
	Возврат html_text;
КонецФункции

// Устарел. Использовать МодульОбъектаКлиент().ПолучитьСписокДокументовОтгрузкиСБИС()
&НаКлиенте
Функция ПолучитьСписокДокументовОтгрузки(Кэш) Экспорт
	
	Возврат МодульОбъектаКлиент().ПолучитьСписокДокументовОтгрузкиСБИС();
	
КонецФункции

// Устарел. Использовать МодульОбъектаКлиент().ПолучитьСписокДокументовПоСобытиямСБИС()
&НаКлиенте
Функция ПолучитьСписокСобытий(Кэш, ТипРеестра) Экспорт
	
	Возврат МодульОбъектаКлиент().ПолучитьСписокДокументовПоСобытиямСБИС(Новый Структура("ТипРеестра", ТипРеестра));
	
КонецФункции

// Устарел. Использовать МодульОбъектаКлиент().ПолучитьСписокДокументовПоСобытиямСБИС()
&НаКлиенте
Функция ПолучитьСписокСобытийПоФильтру(Кэш, filter, ГлавноеОкно) Экспорт
	
	ПараметрыСписка = Новый Структура;
	Если ЗначениеЗаполнено(filter) Тогда
		ПараметрыСписка.Вставить("Фильтр", filter);
	КонецЕсли;
	
	Возврат МодульОбъектаКлиент().ПолучитьСписокДокументовПоСобытиямСБИС(ПараметрыСписка);
	
КонецФункции

// Устарел. Использовать МодульОбъектаКлиент().ПолучитьСписокДокументовСБИС()
&НаКлиенте
Функция сбисПолучитьСписокДокументов(Кэш) Экспорт
	
	Возврат МодульОбъектаКлиент().ПолучитьСписокДокументовСБИС();
	
КонецФункции

&НаКлиенте
Функция сбисВыполнитьКоманду(Кэш, Идентификатор,ИмяКоманды, ПредставлениеПакета) Экспорт
	// Выполняет указанную команду по документу СБИС (утверждение/отклонение)	
	МестныйКэш = Кэш;
	ГлавноеОкно = Кэш.ГлавноеОкно;
	
	// Прочитаем пакет   
	СоставПакета = ПрочитатьДокумент(Кэш,Идентификатор);
	
	
	Если СоставПакета.Свойство("Этап") и (СоставПакета.Этап[0].Название  = "Утверждение" или СоставПакета.Этап[0].Название  = "Утвердить") Тогда
		Комментарий="";
		Если ИмяКоманды = "Отклонить" Тогда
			
			ПараметрыОтклонить	= Новый Структура;
			ПараметрыОтклонить.Вставить("Кэш",					Кэш);
			ПараметрыОтклонить.Вставить("СоставПакета",			СоставПакета);
			ПараметрыОтклонить.Вставить("ИмяКоманды",			ИмяКоманды);
			ПараметрыОтклонить.Вставить("ПредставлениеПакета",	ПредставлениеПакета);
			ПараметрыОтклонить.Вставить("ГлавноеОкно",			ГлавноеОкно);

			ВвестиСтроку(Комментарий,"Причина отклонения",,Истина);
			сбисВыполнитьКомандуОтклонить(Комментарий, ПараметрыОтклонить);
			
		Иначе	
		
			//Ищем действие соответсвующее команде
			Для Каждого Действие из СоставПакета.Этап[0].Действие Цикл
				Если Действие.Название = ИмяКоманды Тогда
					Возврат сбисВыполнитьДействие(Кэш, СоставПакета, СоставПакета.Этап[0], Действие, Комментарий, ПредставлениеПакета);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция сбисВыполнитьКомандуОтклонить(Комментарий, ДополнительныеПараметры) Экспорт
	Перем ДействиеВыполнено;
	// Выполняет указанную команду по документу СБИС (утверждение/отклонение)	
	
	Кэш = ДополнительныеПараметры.Кэш;
	Если НЕ ЗначениеЗаполнено(Комментарий) Тогда
		
		ИмяВСтэк			= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".сбисВыполнитьКомандуОтклонить";
		ПарамтерыСообщить	= МодульОбъектаКлиент().НовыйСбисИсключение(780,
																		ИмяВСтэк,
																		,
																		"Для выполнения операции, необходимо указать комментарий!");
		МодульОбъектаКлиент().СбисСообщить(ПарамтерыСообщить);
		Возврат Ложь;
		
	КонецЕсли;
	
	СоставПакета = ДополнительныеПараметры.СоставПакета;
	ПредставлениеПакета = ДополнительныеПараметры.ПредставлениеПакета;
	ИмяКоманды = ДополнительныеПараметры.ИмяКоманды;
	ГлавноеОкно = ДополнительныеПараметры.ГлавноеОкно;
	
	//Ищем действие соответсвующее команде
	Для Каждого Действие из СоставПакета.Этап[0].Действие Цикл
		Если Действие.Название = ИмяКоманды Тогда
			ДействиеВыполнено = сбисВыполнитьДействие(Кэш, СоставПакета, СоставПакета.Этап[0], Действие, Комментарий, ПредставлениеПакета);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДействиеВыполнено;
	
КонецФункции
&НаКлиенте
Функция сбисВыполнитьДействие(Кэш, СоставПакета, Этап, Действие, Комментарий, ПредставлениеПакета) Экспорт
	// Выполняет указанное действие по документу СБИС
	Перем Сертификат,Алгоритм;
	
	МестныйКэш = Кэш;
	Отказ = Ложь; 
	
	ПараметрыВыполнить = Новый Структура;
	ПараметрыВыполнить.Вставить("СоставПакета",			СоставПакета);
	ПараметрыВыполнить.Вставить("Этап",					Этап);
	ПараметрыВыполнить.Вставить("Действие",				Действие);
	ПараметрыВыполнить.Вставить("Комментарий",			Комментарий);
	ПараметрыВыполнить.Вставить("ПредставлениеПакета",	ПредставлениеПакета);
	ПараметрыВыполнить.Вставить("Сертификат",			Сертификат);

	Если Действие.ТребуетПодписания="Да" Тогда
		Сертификат = МодульОбъектаКлиент().ПодобратьСертификатДляДействияСДокументомСБИС(ПараметрыВыполнить);
		
		Если Сертификат = Неопределено Тогда 
			
			ИмяВСтэк		= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".сбисВыполнитьДействие";
			ТекстОшибки		= "Отсутствует сертификат ЭЦП для утверждения/отклонения пакета документов " + ПредставлениеПакета;
			ОшибкаДействия	= МодульОбъектаКлиент().НовыйСбисИсключение(755, ИмяВСтэк,,,ТекстОшибки);
			МодульОбъектаКлиент().СбисСообщить(ОшибкаДействия);
			Возврат Ложь;
			
		КонецЕсли;
		
		ПараметрыВыполнить.Вставить("Сертификат", Сертификат);
		
		Если Не Сертификат.Ключ.Тип = "Отложенный" И Не Сертификат.Ключ.Тип = "Серверный"  И не Сертификат.Ключ.Тип = "ОтложенныйСПодтверждением" Тогда
			
			Попытка
				СертификатДД = Кэш.ФормаЭП.сбисДвоичныеДанныеСертификатаПоОтпечатку(Кэш, Сертификат.Отпечаток); 
			Исключение
				Ошибка = ОписаниеОшибки();	
			КонецПопытки;
					
			ПараметрыВыполнить.Вставить("СертификатДляПодписания", СертификатДД);
			ПараметрыВыполнить.Вставить("Алгоритм", Кэш.ФормаЭП.сбисВыбратьНаборАлгоритмовДляСозданияПодписи(Сертификат.Алгоритм));
		КонецЕсли;
		
	КонецЕсли;
	
	ОбработатьСлужебныеДокументыПоПакету(Кэш, СоставПакета);
	//Шифрование только ExtSDK
	Если СоставПакета.Свойство("Вложение") Тогда
		Для Каждого Вложение Из СоставПакета.Вложение Цикл
			
			Если Вложение.Свойство("Зашифрован") И Вложение.Зашифрован = "Да" Тогда
				
				ИмяВСтэк			= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".сбисВыполнитьДействие";
				СообщениеОбОшибке	= "Для корректной обработки зашифрованных документов выберите способ обмена ""extSDK"" на вкладке Настройки.";
				ОшибкаДействия		= МодульОбъектаКлиент().НовыйСбисИсключение(601, ИмяВСтэк,,СообщениеОбОшибке);
				МодульОбъектаКлиент().СбисСообщить(ОшибкаДействия);
				Возврат Ложь;
				
			КонецЕсли;
			Прервать;
			
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		МодульОбъектаКлиент().ВыполнитьДействиеСДокументомСБИС(ПараметрыВыполнить);
	Исключение
		Отказ = Истина;
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), Новый Структура("ИмяКоманды", "API.СбисВыполнитьДействие"));
	КонецПопытки;

	Возврат Не Отказ;
КонецФункции
// Подписывает вложения
&НаКлиенте
Функция сбисПодписатьВложения(Кэш, attachmentList, ПараметрыДействия, Отказ = Неопределено) Экспорт
	СертификатДляПодписания = ПараметрыДействия.ПараметрыПодписанияВложения.СертификатДляПодписания;
	Алгоритм = ПараметрыДействия.ПараметрыПодписанияВложения.Алгоритм;
	
	ТекстОшибки = "";
	сч = 0;
	Для Каждого Вложение Из attachmentList Цикл
		Если Вложение.Файл.Свойство("Ссылка") Тогда    // файл с онлайна
			ПолноеИмяФайла = МестныйКэш.ОбщиеФункции.СбисПолучитьИмяВременногоФайлаКлиент();   
			МестныйКэш.ТекущийСеанс.Модули.Интеграция.СохранитьВложениеПоСсылкеВФайл(МестныйКэш,Вложение.Файл.Ссылка,ПолноеИмяФайла);
			Подпись = МестныйКэш.ФормаЭП.сбисПодписатьФайл(МестныйКэш, ПолноеИмяФайла, СертификатДляПодписания, Алгоритм, ТекстОшибки);
		Иначе
			Подпись = МестныйКэш.ФормаЭП.сбисПодписатьДвоичныеДанные(МестныйКэш, Вложение.Файл.ДвоичныеДанные, СертификатДляПодписания, Алгоритм, ТекстОшибки);
		КонецЕсли;
		Если ТекстОшибки<>"" Тогда
			Прервать;	
		КонецЕсли;
		ЭЦП = Новый Массив;	
		ЗаписьЭЦП = Новый Структура;
		ФайлЭЦП = Новый Структура; 
		
		ИмяФайлаПодписи = Лев(Вложение.Файл.Имя, Найти(Вложение.Файл.Имя,"."))+"sgn";
		ФайлЭЦП.Вставить( "Имя", ИмяФайлаПодписи ); 
		ФайлЭЦП.Вставить( "ДвоичныеДанные", Подпись); 
		ЗаписьЭЦП.Вставить("Файл",ФайлЭЦП);
		Если ПараметрыДействия.Сертификат.Свойство("Доверенность") Тогда  
	        СертификатЭЦП = Новый Структура;
			СертификатЭЦП.Вставить("Доверенность", ПараметрыДействия.Сертификат.Доверенность);
			ЗаписьЭЦП.Вставить("Сертификат",СертификатЭЦП);			
		КонецЕсли;
		ЭЦП.Добавить(ЗаписьЭЦП);
		attachmentList[сч].Вставить( "Подпись", ЭЦП );
		сч = сч+1;
	КонецЦикла;	
	Если ТекстОшибки<>"" Тогда 
		Отказ = Истина;
		Возврат ТекстОшибки;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции
// Переводит документ повторно на ранее выполненный этап
&НаКлиенте
Функция сбисПовторитьЭтап(Кэш, ИдДок, ЭтапНазвание, Отказ=Ложь) Экспорт
	Отказ				= Ложь;
	МестныйКэш			= Кэш;
	
	ДокументВЭтап		= Новый Структура("Идентификатор, Этап", ИдДок);
	ДокументВЭтап.Этап	= Новый Структура("Название", ЭтапНазвание); 	
	ПараметрыКоманды	= Новый Структура("Документ", ДокументВЭтап);
	ДопПараметрыЗапроса = Новый Структура("ЕстьРезультат, СообщатьПриОшибке", Истина, Истина);
	
	оДокумент = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ПовторитьЭтап", ПараметрыКоманды, ДопПараметрыЗапроса,Отказ);
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат оДокумент;
КонецФункции
&НаКлиенте
Функция ОбработатьСлужебныеДокументыПоПакету(Кэш, СоставПакета) Экспорт
	Перем Сертификат;
	// Обрабатывает служебные по одному пакету
	Отказ = Ложь;
	ДопПараметры = Новый Структура("ЕстьРезультат", Истина);
	param = Новый Структура("ИдентификаторДокумента,ДопПоля",СоставПакета.Идентификатор, "ЭтапВернутьВсеСертификаты");
	
	СтруктураПараметровЗапроса = Новый Структура("Фильтр", param);
	СтруктураРезультата = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ИнформацияОСлужебныхЭтапах", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;

	// Получаем количество необработанных служебных документов
	РезультатНеобрДок = Неопределено;
	Если Не	СтруктураРезультата.Свойство("ЧислоНеобработанныхЭтапов", РезультатНеобрДок)
		Или	РезультатНеобрДок = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;
	Всего = Число(РезультатНеобрДок);
	
	Если Всего <= 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.СписокСлужебныхЭтапов", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	Если Отказ Тогда 
		Если Результат.code = 775 Тогда
			ТекстОшибки = "Не удалось получить список служебных этапов.";
		Иначе
			ТекстОшибки = Результат.message +?(Результат.details = Результат.message, "", (" "+ Результат.details)); 
		КонецЕсли;
		Сообщить(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	Для Каждого Док Из Результат.Документ Цикл
		Действие = Док.Этап[0].Действие[0];
		СертификатДляПодписания = Неопределено;
		Алгоритм = Неопределено;	
		Если Действие.ТребуетПодписания="Да" Тогда
			Если Действие.Свойство("Сертификат") и Действие.Сертификат.Количество() Тогда
				СертификатВыбран = Ложь;
				ТекстОшибки = "";
				ДанныеСертификат = Кэш.ФормаЭП.сбисВыбратьПодходящийСертификат(Кэш, Действие.Сертификат, ТекстОшибки);
				Если ДанныеСертификат<>Ложь Тогда
					Сертификат = ДанныеСертификат.СертификатДок;
					СертификатДляПодписания = ДанныеСертификат.СертификатДляПодписания;
					Алгоритм = ДанныеСертификат.Алгоритм;
					СертификатВыбран = Истина;
				КонецЕсли;
				Если Не СертификатВыбран и ТекстОшибки<>"" Тогда
					Продолжить;
				КонецЕсли;
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
	    ПараметрыВыполнить = Новый Структура;
		ПараметрыВыполнить.Вставить("СоставПакета",				Док);
		ПараметрыВыполнить.Вставить("Этап",						Док.Этап[0]);
		ПараметрыВыполнить.Вставить("Действие",					Действие);
		ПараметрыВыполнить.Вставить("Комментарий",				"");
		ПараметрыВыполнить.Вставить("Сертификат",				Сертификат);
		ПараметрыВыполнить.Вставить("СертификатДляПодписания",	СертификатДляПодписания);
		ПараметрыВыполнить.Вставить("Алгоритм",					Алгоритм);
		
		Попытка
			
			МодульОбъектаКлиент().ВыполнитьДействиеСДокументомСБИС(ПараметрыВыполнить);
			
		Исключение
			
			ИмяВСтэк = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".ОбработатьСлужебныеДокументыПоПакету";
			МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), Новый Структура("ИмяКоманды, СтатусСообщения", ИмяВСтэк, "message"));
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Функция - Получает Информацию о подписанте документа. Заглушка
//
// Параметры:
//  Кэш	 - ЛокальнывйКэш	 - Структура параметров обработки
//  ИНН	 - Строка			 - фильтр ИНН
// 
// Возвращаемое значение:
//  Структура - описание подписанта
//
&НаКлиенте
Функция сбисПодписант(Кэш, ИНН) Экспорт
	
	Возврат Новый Структура("Должность,ФИО,ИНН");
	
КонецФункции

// Функция - Получает Информацию о контрагенте с онлайна. Заглушка
//
// Параметры:
//  Кэш		 - 	 - 
//  ИНН		 - 	 - 
//  КПП		 - 	 - 
//  Название - 	 - 
// 
// Возвращаемое значение:
//  Строка - Ид участника
//
&НаКлиенте
Функция сбисИдентификаторУчастника(Кэш, ИНН, КПП, Название) Экспорт
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Функция ПолучитьИнформациюОКонтрагенте(Кэш, СтруктураКонтрагента) Экспорт
	// Получает Информацию о контрагенте с онлайна
	Отказ = Ложь;
	ДопПараметры = Новый Структура("ЕстьРезультат", Истина);
	kontr = Новый Структура; 
	Если СтруктураКонтрагента.Свойство("СвФЛ") Тогда
		СвФЛ = Новый Структура;
		СвФЛ.Вставить( "ИНН", СтруктураКонтрагента.СвФЛ.ИНН ); 
		kontr.Вставить( "СвФЛ", СвФЛ );	
	Иначе
		СвЮЛ = Новый Структура;
		СвЮЛ.Вставить( "ИНН", СтруктураКонтрагента.СвЮЛ.ИНН ); 
		СвЮЛ.Вставить( "КПП", СтруктураКонтрагента.СвЮЛ.КПП );
		Если СтруктураКонтрагента.СвЮЛ.Свойство("КодФилиала") Тогда
			СвЮЛ.Вставить( "КодФилиала", СтруктураКонтрагента.СвЮЛ.КодФилиала );
		КонецЕсли;
		kontr.Вставить( "СвЮЛ", СвЮЛ );
	КонецЕсли;
	СтруктураРезультата = СБИС_ИнформацияОКонтрагенте(Кэш, kontr, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат СтруктураРезультата;
КонецФункции
&НаКлиенте
Функция ПолучитьСписокНашихОрганизаций(Кэш, СписокИНН) Экспорт
	// Получает список организаций, присутствующих одновременно в кабинете СБИС и в базе 1С, у которых есть необработанные служебные документы
	Отказ = Ложь;
	ДопПараметры = Новый Структура("ЕстьРезультат", Истина);
	МестныйКэш = Кэш;

	ЕстьЕще = Истина;
	ТекущаяСтраница = 0;
	МассивОрганизаций = Новый Массив;
	Пока ЕстьЕще Цикл
		filter  = Новый Структура;
		navigation = Новый Структура;
		navigation.Вставить( "Страница", ТекущаяСтраница);
		filter.Вставить( "Навигация", navigation );
		СтруктураПараметровЗапроса = Новый Структура;
		СтруктураПараметровЗапроса.Вставить("Фильтр", filter);
		Результат = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.СписокНашихОрганизаций", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
		Если Отказ Тогда
			Если Результат.code = 775 Тогда
				ТекстОшибки = "Не удалось получить список наших организаций.";
			Иначе
				ТекстОшибки = Результат.message +?(Результат.details = Результат.message, "", (" "+ Результат.details)); 
			КонецЕсли;
			Сообщить(ТекстОшибки);
			Возврат МассивОрганизаций;
		КонецЕсли;
		
		Выборка = Результат.НашаОрганизация;
		Размер = Выборка.Количество();
		СтруктураОрганизаций = Новый Структура;
		Для сч=0 По Размер-1 Цикл
			Запись = Выборка[сч];
			оОрганизация = Выборка[сч];	
			Организация1С = Ложь;
			Организация1С = МестныйКэш.ОбщиеФункции.НайтиОрганизациюИзДокументаСБИС(МестныйКэш.Ини.Конфигурация, оОрганизация);
			Если Организация1С <> Неопределено И Организация1С <> Ложь Тогда
				оОрганизация.Вставить("Название", строка(Организация1С));
				
				param  = Новый Структура;
				param.Вставить( "НашаОрганизация", Запись );
				СтруктураПараметровЗапроса = Новый Структура;
				СтруктураПараметровЗапроса.Вставить("Фильтр", param);
				СтруктураРезультата = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ИнформацияОСлужебныхЭтапах", СтруктураПараметровЗапроса, Новый Структура, Отказ);
				Если НЕ СтруктураРезультата.Свойство("result") Тогда
					Продолжить;
				КонецЕсли;
			
				РезультатНеобрДок = Неопределено;
				СтруктураРезультата.Свойство("ЧислоНеобработанныхЭтапов",РезультатНеобрДок); // Получаем количество необработанных служебных документов
				Если РезультатНеобрДок = Неопределено Тогда 
					Продолжить;
				КонецЕсли;
				оОрганизация.Вставить("ЧислоНеобработанныхЭтапов", Число(РезультатНеобрДок));
				Если оОрганизация.ЧислоНеобработанныхЭтапов <> 0 Тогда
					МассивОрганизаций.Добавить(оОрганизация);	
					// добавляем ИНН в список для активации серверных ключей
					Если оОрганизация.Свойство("СвФЛ") Тогда
						Если СписокИНН.НайтиПоЗначению(оОрганизация.СвФЛ.ИНН)=Неопределено Тогда 
							СписокИНН.Добавить(оОрганизация.СвФЛ.ИНН);
						КонецЕсли;
					Иначе
						Если СписокИНН.НайтиПоЗначению(оОрганизация.СвЮЛ.ИНН)=Неопределено Тогда
							СписокИНН.Добавить(оОрганизация.СвЮЛ.ИНН);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ТекущаяСтраница = ТекущаяСтраница + 1;
		ЕстьЕще = Результат.Навигация.ЕстьЕще="Да";
	КонецЦикла;
	Возврат МассивОрганизаций;
КонецФункции
&НаКлиенте
Функция ОбработкаСлужебныхДокументов(Кэш) Экспорт
	// Получает список организаций с необработанными этапами и запускает для них обработку служебных документов
	МестныйКэш = Кэш;
	ГлавноеОкно = Кэш.ГлавноеОкно;
	сбисПоказатьСостояние("Обработка служебных документов",ГлавноеОкно);
	СписокИНН = Новый СписокЗначений;
	МассивОрганизаций = ПолучитьСписокНашихОрганизаций(Кэш, СписокИНН);	
	СписокСертификатов = Кэш.Интеграция.ПолучитьСертификатыДляАктивации(Кэш, СписокИНН);
	Если СписокСертификатов.Количество()>0 Тогда
		Для Каждого Элемент Из СписокСертификатов Цикл
			Сертификат = Элемент.Значение;
			Если Сертификат.Ключ.СпособАктивации<>"СтатическийКод" Тогда
				ПолучитьКодАктивацииСертификата(Кэш, Сертификат);				
			КонецЕсли;
			ФормаВводаПинкода = сбисПолучитьФорму("ФормаВводаПинкода");
			ПараметрыВвода = Новый Структура("СертификатИмя", Кэш.ОбщиеФункции.СформироватьЗаголовокСертификатаДляФормыВвода(Кэш, Сертификат));
			КодАктивации = ФормаВводаПинкода.Показать(ПараметрыВвода);
			Если	Не	ЗначениеЗаполнено(КодАктивации)
				Или		КодАктивации.ПинКод = "" Тогда
				Сообщить("Не активирован сертификат для подписания документов.");
				Возврат Ложь;	
			КонецЕсли;
			Сертификат.Вставить("КодАктивации", КодАктивации.ПинКод);
		КонецЦикла;
		Если Кэш.Интеграция.АктивироватьСерверныеСертификаты(Кэш, СписокСертификатов) = Ложь Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	Для Каждого оОрганизация из МассивОрганизаций Цикл
		ИзвещенияОбработаны = ОбработатьСлужебныеДокументыОрганизации(оОрганизация);
	КонецЦикла;
	сбисСпрятатьСостояние(ГлавноеОкно);
	Возврат Истина;
КонецФункции
&НаКлиенте
Функция ОбработатьСлужебныеДокументыОрганизации(оОрганизация)
	// Обрабатывает служебные документы организации
	Отказ = Ложь;
	ДопПараметры = Новый Структура("ЕстьРезультат", Истина);
	ГлавноеОкно = сбисПолучитьФорму("ФормаГлавноеОкно");
	param   = Новый Структура;
	Орг = оОрганизация;
	org = Новый Структура; 
	Если Орг.Свойство("СвФЛ") Тогда
		СвФЛ = Новый Структура;
		СвФЛ.Вставить( "ИНН", Орг.СвФЛ.ИНН); 
		org.Вставить( "СвФЛ", СвФЛ );	
	Иначе
		СвЮЛ = Новый Структура;
		СвЮЛ.Вставить( "ИНН", Орг.СвЮЛ.ИНН ); 
		СвЮЛ.Вставить( "КПП", Орг.СвЮЛ.КПП );
		Если Орг.СвЮЛ.Свойство("КодФилиала") и ЗначениеЗаполнено(Орг.СвЮЛ.КодФилиала) Тогда
			СвЮЛ.Вставить( "КодФилиала", Орг.СвЮЛ.КодФилиала );	
		КонецЕсли;
		org.Вставить( "СвЮЛ", СвЮЛ );
	КонецЕсли;
	param.Вставить("НашаОрганизация,ДопПоля",org,"ЭтапВернутьВсеСертификаты");
	сбисПоказатьСостояние("Обработка служебных документов "+оОрганизация.Название,ГлавноеОкно);
	Всего = оОрганизация.ЧислоНеобработанныхЭтапов;	
	Если Всего>0 Тогда
		ЕстьНеобработанныеИзвещения = "Да";
		Обработано = 0;
		ПодключитьОбработчикОжидания("сбисПрерываниеПользователем",0.1,Истина);
		Пока ЕстьНеобработанныеИзвещения = "Да" Цикл
			СтруктураПараметровЗапроса = Новый Структура("Фильтр", param);
			Результат = сбисОтправитьИОбработатьКоманду(МестныйКэш, "СБИС.СписокСлужебныхЭтапов", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
			Если Отказ Тогда
				Если Результат.code = 775 Тогда
					ТекстОшибки = "Не удалось получить список служебных этапов."
				Иначе
					ТекстОшибки = Результат.message +?(Результат.details = Результат.message, "", (" "+ Результат.details)); 
				КонецЕсли;
				сбисСпрятатьСостояние(ГлавноеОкно);
				Сообщить(ТекстОшибки);
				Возврат Ложь;
			КонецЕсли;
			Для Каждого СоставПакета Из Результат.Документ Цикл
				Выполнено = сбисВыполнитьДействие(МестныйКэш, СоставПакета, СоставПакета.Этап[0], СоставПакета.Этап[0].Действие[0], "", "");
				Если Выполнено Тогда
					Обработано = Обработано + 1;
				КонецЕсли;
			КонецЦикла;
			
			ЕстьНеобработанныеИзвещения = Результат.Навигация.ЕстьЕще;
			сбисПоказатьСостояние("Обработка служебных документов "+оОрганизация.Название,ГлавноеОкно,Мин(100,Окр(Обработано*100/Всего)), "(прервать -  Ctrl+Break)");
			
			Если (Обработано=0 и ЕстьНеобработанныеИзвещения = "Да") или Результат.Документ.Количество() = 0  Тогда     // Необработанные есть, но обработать по какой-то причине не можем
				Прервать;
			КонецЕсли;
			ОбработкаПрерыванияПользователя();
		КонецЦикла;
		ОтключитьОбработчикОжидания("сбисПрерываниеПользователем");
		сбисСпрятатьСостояние(ГлавноеОкно);
	КонецЕсли;
	Возврат Истина;
КонецФункции
&НаКлиенте
Процедура сбисПрерываниеПользователем()
	// Прячет состояние при прерывании отправки, обработки служебных, обработки статусов	
	ГлавноеОкно = сбисПолучитьФорму("ФормаГлавноеОкно");
	сбисСпрятатьСостояние(ГлавноеОкно);	
КонецПроцедуры

// Функция - Отправить каталог товаров
//
// Параметры:
//  Кэш					 - ЛокальныйКэш	 - Структура параметров обработки
//  КаталогТоваров		 - Строка		 - Сериализованный каталог товаров в XML
// 
// Возвращаемое значение:
//  Число - Результат метода СБИС.ИмпортНоменклатурыИзCML
//
&НаКлиенте
Функция ОтправитьКаталогТоваров(Кэш,КаталогТоваров) экспорт

	Отказ			= Ложь;
	ДопПараметры	= Новый Структура("ЕстьРезультат", Истина);
	Base64СТркоа	= сбисСтрокаВBASE64(КаталогТоваров, "UTF-16");
	
	СтруктураПараметровЗапроса = Новый Структура("Параметр", Новый Структура("Файл", Base64СТркоа));
	РезультатЗапроса = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ИмпортНоменклатурыИзCML", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	Если Отказ Тогда
		Если РезультатЗапроса.code = 775 Тогда
			ТекстОшибки = "Не удалось загрузить каталог товаров в личный кабинет.";
		Иначе
			ТекстОшибки = РезультатЗапроса.message +?(РезультатЗапроса.details=РезультатЗапроса.message, "", (" "+ РезультатЗапроса.details)); 
		КонецЕсли;
		Сообщить(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	Возврат РезультатЗапроса;
	
КонецФункции

&НаКлиенте
Функция сбисЭмитироватьКМ(Кэш, ИдДок, ДополнительныеПараметры=Неопределено, Отказ=Ложь) Экспорт
	Отказ				= Ложь;
	МестныйКэш			= Кэш;
	
	param = Новый Структура("Документ", Новый Структура("Идентификатор",ИдДок));
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	ДополнительныеПараметры.Вставить("ЕстьРезультат", Истина);
	
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ЭмитироватьКМ", param, ДополнительныеПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".сбисЭмитироватьКМ");
	КонецЕсли;
	Возврат Результат
	
КонецФункции

&НаКлиенте
Функция сбисЗарегистрироватьВГоссистеме(Кэш, ИдДок, ДополнительныеПараметры=Неопределено, Отказ=Ложь) Экспорт
	Отказ				= Ложь;
	МестныйКэш			= Кэш;
	
	param = Новый Структура("Документ", Новый Структура("Идентификатор",ИдДок));
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	ДополнительныеПараметры.Вставить("ЕстьРезультат", Истина);
	
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ЗарегистрироватьВГоссистеме", param, ДополнительныеПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".сбисЗарегистрироватьВГоссистеме");
	КонецЕсли;
	Возврат Результат
	
КонецФункции

&НаКлиенте
Функция ПолучитьНастройкиКлиента(Кэш,Префикс) экспорт
	// Получает настройки клиента	
	Отказ		= Ложь;
	ДопПараметры= Новый Структура("ЕстьРезультат", Истина);
	
	СтруктураПараметровЗапроса = Новый Структура("Маска", Префикс+"*.json");
	РезультатЗапроса = сбисОтправитьИОбработатьКоманду(Кэш, "Интеграция.ПолучитьНастройкиКлиента", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	Если Отказ Тогда
		Если РезультатЗапроса.code = 775 Тогда
			ТекстОшибки = "Не удалось получить файлы настроек.";
		Иначе
			ТекстОшибки = РезультатЗапроса.message +?(РезультатЗапроса.details=РезультатЗапроса.message, "", (" "+ РезультатЗапроса.details)); 
		КонецЕсли;
		Сообщить(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	Возврат РезультатЗапроса;
КонецФункции
&НаКлиенте
Функция ПолучитьСписокФайлов(Кэш,Маска) экспорт
	// Получает настройки клиента	
	Отказ		= Ложь;
	ДопПараметры= Новый Структура("ЕстьРезультат", Истина);
	
	СтруктураПараметровЗапроса = Новый Структура("Маска",Маска);
	РезультатЗапроса = сбисОтправитьИОбработатьКоманду(Кэш, "Интеграция.ПолучитьСписокФайлов", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	
	Если Отказ Тогда
		Если РезультатЗапроса.code = 775 Тогда
			ТекстОшибки = "Не удалось получить файлы настроек.";
		Иначе
			ТекстОшибки = РезультатЗапроса.message +?(РезультатЗапроса.details=РезультатЗапроса.message, "", (" "+ РезультатЗапроса.details)); 
		КонецЕсли;
		Сообщить(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	Возврат РезультатЗапроса;
КонецФункции
&НаКлиенте
Функция ПолучитьПараметрыКлиента(Кэш,ИмяПараметра) экспорт
	// Получает параметры клиента	
	Отказ		= Ложь;
	ДопПараметры= Новый Структура("ЕстьРезультат", Истина);
	
	СтруктураПараметровЗапроса = Новый Структура("Путь",ИмяПараметра);
	РезультатЗапроса = сбисОтправитьИОбработатьКоманду(Кэш, "ПользовательскиеПараметры.ПолучитьЗначение", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	
	Если Отказ Тогда
		Если РезультатЗапроса.code = 775 Тогда
			ТекстОшибки = "Не удалось получить параметры клиента.";
		Иначе
			ТекстОшибки = РезультатЗапроса.message +?(РезультатЗапроса.details=РезультатЗапроса.message, "", (" "+ РезультатЗапроса.details)); 
		КонецЕсли;
		Сообщить(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	Возврат РезультатЗапроса;
КонецФункции
// Заглушка (SDK)
&НаКлиенте
Функция ВключитьОтладку(Кэш, КаталогОтладки) Экспорт
КонецФункции
// Заглушка (SDK)
&НаКлиенте
Функция ОтключитьОтладку(Кэш) Экспорт
КонецФункции
// Изменяет каталог отладки с соответствующими проверками
&НаКлиенте
Функция УстановитьКаталогОтладки(Кэш) Экспорт
	ГлавноеОкно = Кэш.ГлавноеОкно;
	КаталогДоИзменения = Кэш.Парам.КаталогОтладки;
	
	// Если никакой каталог не задан и мы поставили галку, то открывать выбор каталога
	Если	ГлавноеОкно.РежимОтладки 
		И	ГлавноеОкно.РежимОтладки <> Кэш.Парам.РежимОтладки
		И	ГлавноеОкно.КаталогОтладки = "" Тогда
		РежимВыбора = Истина;
	Иначе
		РежимВыбора = Ложь;
	КонецЕсли;
	
	Попытка
		КаталогИзменен = УстановитьКаталогОтладкиРекурсивно(ГлавноеОкно, КаталогДоИзменения, РежимВыбора);	
	Исключение
		СбисИсключение = Кэш.ОбщиеФункции.СбисИсключение(, "API.УстановитьКаталогОтладкиРекурсивно", 772, "Ошибка работы с файловой системой", ОписаниеОшибки());
		ГлавноеОкно.СбисСообщитьОбОшибке(Кэш, СбисИсключение);
		ГлавноеОкно.КаталогОтладки = КаталогДоИзменения;
		Возврат Ложь;
	КонецПопытки;
	
	Возврат КаталогИзменен;
КонецФункции
&НаКлиенте
Функция УстановитьКаталогОтладкиРекурсивно(ГлавноеОкно, КаталогДоИзменения, РежимВыбора, КаталогТест = "")
	Если ГлавноеОкно.КаталогОтладки = "" Тогда
		Если РежимВыбора Тогда
			ОтказОтВыбора = Ложь;
			л_КаталогОтладки = ГлавноеОкно.сбисВыбратьКаталог(КаталогТест, ОтказОтВыбора);
			Если ОтказОтВыбора Тогда
				ГлавноеОкно.РежимОтладки = Ложь;
				Возврат Истина;
			КонецЕсли;
			ГлавноеОкно.КаталогОтладки = л_КаталогОтладки;
			УстановитьКаталогОтладкиРекурсивно(ГлавноеОкно, КаталогДоИзменения, РежимВыбора, КаталогТест);
		Иначе
			ГлавноеОкно.РежимОтладки = Ложь;
		КонецЕсли;
		Возврат ГлавноеОкно.КаталогОтладки <> КаталогДоИзменения;
		//Каталог менялся руками, проверить что такой есть
	Иначе
		л_КаталогОтладки = ГлавноеОкно.сбисФорматКаталога(ГлавноеОкно.КаталогОтладки);
		Файл = Новый Файл(ГлавноеОкно.КаталогОтладки);
		Если Не Файл.Существует() Или Не Файл.ЭтоКаталог() Тогда
			КаталогТест	= ГлавноеОкно.КаталогОтладки;
			РежимВыбора	= Истина;
			ГлавноеОкно.КаталогОтладки = "";
			УстановитьКаталогОтладкиРекурсивно(ГлавноеОкно, КаталогДоИзменения, РежимВыбора, КаталогТест);
			Возврат ГлавноеОкно.КаталогОтладки <> КаталогДоИзменения;
		КонецЕсли;
		ГлавноеОкно.КаталогОтладки = л_КаталогОтладки;
		Возврат ГлавноеОкно.КаталогОтладки <> КаталогДоИзменения;
	КонецЕсли;
КонецФункции
&НаКлиенте
Функция сбисТекущаяДата(Кэш) Экспорт
	// получает текущую дату-время на сервере СБИС	
	Отказ		= Ложь;
	ДопПараметры= Новый Структура("СообщатьПриОшибке, ВернутьОшибку", Ложь, Истина);
	
	СтруктураПараметровЗапроса = Новый Структура("Параметр", Новый Структура);
	РезультатЗапроса = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ИнформацияОВерсии", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат ТекущаяДата();
	КонецЕсли;
	Возврат МодульОбъектаКлиент().ДатаИзСтроки(РезультатЗапроса.ВнешнийИнтерфейс.ДатаВремяЗапроса);
КонецФункции
&НаКлиенте
Процедура УстановитьВидимостьОбновитьСтатусы(Кэш) Экспорт
	// Если более часа не проверяли статусы, то выводим красное предупреждение
	ГлавноеОкно = Кэш.ГлавноеОкно;
	ОбновитьСтатусы	= Ложь;
	Если Не ЗначениеЗаполнено(ГлавноеОкно.ДатКнцЧтенияСтатусов) или сбисТекущаяДата(Кэш)-ГлавноеОкно.ДатКнцЧтенияСтатусов > 3600 Тогда
		ОбновитьСтатусы = Истина;
	КонецЕсли;
	сбисЭлементФормы(ГлавноеОкно, "ОбновитьСтатусы").Видимость = ОбновитьСтатусы;
КонецПроцедуры
&НаКлиенте
Функция Аккордеон_ОтключенныеРазделы() Экспорт
	ОтключенныеРазделы = Новый Структура();
	Возврат ОтключенныеРазделы;
КонецФункции

// Функция для переопределения видимости настроек для способа интеграции
// 
// Возвращаемое значение: Структура
//   - 
//
&НаКлиенте
Функция ВидимостьНастроек() Экспорт
	
	Настройки = МодульОбъектаКлиент().ВидимостьНастроекПоУмолчанию();	
	Настройки.ИспользоватьГенератор 	= Истина;
	Настройки.ВремяОжиданияОтвета		= Ложь;
	Настройки.ИспользоватьНовуюОтправку = Ложь;
	Настройки.НастройкаЭП				= Истина;
	
	Возврат Настройки;
	
КонецФункции

&НаКлиенте
Функция СбисПолучитьПараметрыАктуальнойВерсии(Кэш, ПараметрыОбновления, Отказ) Экспорт
	Возврат сбисСохранитьВФайлПоСсылке(Кэш, ПараметрыОбновления, Отказ);
КонецФункции

//Функция сохраняет вложение по ссылке на клиенте.
&НаКлиенте
Функция сбисСохранитьВФайлПоСсылке(Кэш, СбисПараметрыФайла, Отказ) Экспорт
	ПараметрыЗаголовки = Новый Структура("ИдСессии, ТаймАут", Кэш.Парам.ИдентификаторСессии, 5);
    ДопПараметрыКоманды = Новый Структура("X_Timeout, Timeout", 5, 60);
	
	ПараметрыЗапроса = Новый Структура("АдресСервера, Протокол, АдресРесурсаВЗапрос", СбисПараметрыФайла.Сервер, СбисПараметрыФайла.Протокол);
	ПараметрыЗапроса.Вставить("Прокси",					СбисСформироватьПроксиНаКлиенте(Кэш.Парам, сбисПараметрыФайла.Протокол));
	ПараметрыЗапроса.Вставить("Заголовки",				СбисСформироватьЗаголовкиНаКлиенте(Кэш.Парам, ПараметрыЗаголовки));
	Если		СбисПараметрыФайла.Свойство("URL",	ПараметрыЗапроса.АдресРесурсаВЗапрос) Тогда
		//Есть полный адрес ресурса
		Если сбисПараметрыФайла.Свойство("URL") И Лев(сбисПараметрыФайла.URL, 8) = "https://" Тогда   //передан полный url
			СтрокаЗамена = СтрЗаменить(СтрЗаменить(СтрЗаменить(СбисПараметрыФайла.URL,	":", ""), 
			"//", "/"), 
			"/", Символы.ПС);
			ПараметрыЗапроса.Протокол			= СтрПолучитьСтроку(СтрокаЗамена, 1);
			ПараметрыЗапроса.АдресСервера		= СтрПолучитьСтроку(СтрокаЗамена, 2);
			ПараметрыЗапроса.АдресРесурсаВЗапрос= СтрПолучитьСтроку(СтрЗаменить(СбисПараметрыФайла.URL, ПараметрыЗапроса.АдресСервера, Символы.ПС), 2);
		КонецЕсли;
	ИначеЕсли	СбисПараметрыФайла.Свойство("URLПолный") Тогда
		//Адрес ресурса может отличаться, выделим протокол, адрес сервера и УРЛ ресурса
		СтрокаЗамена = СтрЗаменить(СтрЗаменить(СтрЗаменить(СбисПараметрыФайла.URLПолный,	":", ""), 
																							"//", "/"), 
																							"/", Символы.ПС);
		ПараметрыЗапроса.Протокол			= СтрПолучитьСтроку(СтрокаЗамена, 1);
		ПараметрыЗапроса.АдресСервера		= СтрПолучитьСтроку(СтрокаЗамена, 2);
		ПараметрыЗапроса.АдресРесурсаВЗапрос= СтрПолучитьСтроку(СтрЗаменить(СбисПараметрыФайла.URLПолный, ПараметрыЗапроса.АдресСервера, Символы.ПС), 2);
	Иначе
		Отказ = Истина;
		Возврат Кэш.ОбщиеФункции.сбисИсключение(100, "API.сбисСохранитьВФайлПоСсылке",,,"Отсутствует URL для скачивания файла.");
		//Тут может придти сервер, отличающийся от установленного
	КонецЕсли;
	ПараметрыЗапроса.Вставить("ПутьКФайлу",				сбисПараметрыФайла.ИмяФайла);
	ПараметрыЗапроса.Вставить("Таймаут", ?(сбисПараметрыФайла.Свойство("Таймаут"), сбисПараметрыФайла.Таймаут, 0));
	
	СбисРезультатЧтения = HTTPСоединение_Получить_Клиент(Кэш, ПараметрыЗапроса, ДопПараметрыКоманды, Отказ);
	Если Отказ Тогда
		Если сбисРезультатЧтения.code = 784 Тогда
			Возврат Кэш.ОбщиеФункции.сбисИсключение(сбисРезультатЧтения, "API.сбисСохранитьВФайлПоСсылке");
		Иначе
			Возврат Кэш.ОбщиеФункции.сбисИсключение(сбисРезультатЧтения, "API.сбисСохранитьВФайлПоСсылке", 700, "Неизвестная ошибка подключения", сбисРезультатЧтения.details);
		КонецЕсли;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция HTTPСоединение_Получить_Клиент(Кэш, ПараметрыЗапроса, ДопПараметры, Отказ)
	Перем HTTPСоединение;
	ВремяНачалаЗапроса = ТекущаяДата();
	AnswerType = "message";
	Если Не ПараметрыЗапроса.Свойство("ВремяНачала") Тогда
		ПараметрыЗапроса.Вставить("ВремяНачала", ВремяНачалаЗапроса);
	ИначеЕсли ПараметрыЗапроса.ВремяНачала + ДопПараметры.Timeout < ВремяНачалаЗапроса Тогда
		Отказ = Истина;//Для избежания зацикливания при формировании файлов, рекурсивно вызываем определенное время.
		Возврат Новый Структура("code, message,details", 100, "Ошибка получения файла", "Превышено время ожидания");
	КонецЕсли;
	СбисАдресСервера = ПараметрыЗапроса.АдресСервера;
	Если ПараметрыЗапроса.Свойство("Таймаут") Тогда
		Таймаут = ПараметрыЗапроса.Таймаут;
	Иначе
		Таймаут = 0;
	КонецЕсли;
	СтрокаСоединения = "Новый HTTPСоединение(СбисАдресСервера,,,,ПараметрыЗапроса.Прокси,Таймаут";
	//Параметры защищенного соединения
	Если ПараметрыЗапроса.Протокол = "https" Тогда
		Если Кэш.СовместимостьМетодов.HTTPСоединение.OpenSSL Тогда
			СтрокаСоединения = СтрокаСоединения + ",Новый ЗащищенноеСоединениеOpenSSL())";
		Иначе
			СтрокаСоединения = СтрокаСоединения + "Истина)";
		КонецЕсли;
	Иначе
		СтрокаСоединения = СтрокаСоединения + ")"
	КонецЕсли;
	//В случае переадресации, или ожидания запроса может придти готовое подключение
	Если Не ДопПараметры.Свойство("Соединение", HTTPСоединение) Тогда
		Если Кэш.СБИС.ПараметрыИнтеграции.РезервныйДомен Тогда
			СбисАдресСервера = СтрЗаменить(СбисАдресСервера, ".sbis.ru", ".saby.ru");
		КонецЕсли;
		HTTPСоединение = Вычислить(СтрокаСоединения);
	КонецЕсли;
	//Для старых платформ механизм читеения ответа с проверкой переадресацией отличается
	Если Кэш.СовместимостьМетодов.HTTPСоединение.ФункцияПолучить Тогда 
		HTTPЗапрос		= Вычислить("Новый HTTPЗапрос(ПараметрыЗапроса.АдресРесурсаВЗапрос)");
		HTTPЗапрос.Заголовки = ПараметрыЗапроса.Заголовки;
		Попытка
			HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос, ПараметрыЗапроса.ПутьКФайлу);
		Исключение
			СбисОшибка = ИнформацияОбОшибке();
			Отказ = Истина;
			Возврат Новый Структура("code, message,details", 100, "Ошибка получения файла", ОписаниеОшибки());
		КонецПопытки;
		AnswerType = HTTPОтвет.Заголовки.Получить("X-ExceptionType");
		Если	HTTPОтвет.КодСостояния = 500
			Или	AnswerType = "error"
			Или AnswerType = "warning" Тогда
			Отказ = Истина;
		КонецЕсли;
	Иначе
		Попытка
			HTTPСоединение.Получить(ПараметрыЗапроса.АдресРесурсаВЗапрос, ПараметрыЗапроса.ПутьКФайлу, ПараметрыЗапроса.Заголовки);
		Исключение
			СбисОшибка = ИнформацияОбОшибке();
			Отказ = Истина;
		КонецПопытки;
		Если Отказ Тогда
			HTTPОтвет = СбисОшибка;
			Пока Не HTTPОтвет.Причина = Неопределено Цикл
				HTTPОтвет = HTTPОтвет.Причина;
			КонецЦикла;
			ПричинаОшибки = HTTPОтвет.Описание;
			КодОшибки = СтрЗаменить(СтрЗаменить(ПричинаОшибки,"(",Символы.ПС), ")", Символы.ПС);
			Попытка
				КодОшибки = Число(СтрПолучитьСтроку(КодОшибки, СтрЧислоСтрок(КодОшибки)));
			Исключение
				Возврат Новый Структура("code,message,details", 100, "Ошибка получения файла", ПричинаОшибки);
			КонецПопытки;
			HTTPОтвет = Новый Структура("КодСостояния", КодОшибки);			
		Иначе	
			//Проверим переадресацию
			СбисПереадресация = Новый ЧтениеТекста(ПараметрыЗапроса.ПутьКФайлу);
			СбисПереадресация = СбисПереадресация.ПрочитатьСтроку();
			Если Найти(СбисПереадресация, "Found. Redirecting to") Тогда
				HTTPОтвет = Новый Структура("КодСостояния, Заголовки", 302, Новый Соответствие);
				HTTPОтвет.Заголовки.Вставить("Location", СокрЛП(СтрПолучитьСтроку(СтрЗаменить(СбисПереадресация, "Redirecting to", Символы.ПС),2)));
			Иначе
				HTTPОтвет = Новый Структура("КодСостояния", 200);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	ДопПараметры.Вставить("Соединение", HTTPСоединение);
	Если Отказ Тогда
		//Смотрим ответ, если пришла ошибка
		ЧтениеТекст = Новый ЧтениеТекста(ПараметрыЗапроса.ПутьКФайлу, "utf-8");
		Попытка
			ТекстАнализОшибки = ЧтениеТекст.Прочитать();
		Исключение
			ТекстАнализОшибки = "Не удалось прочитать ответ: " + ОписаниеОшибки();
		КонецПопытки;
		ЧтениеТекст = Неопределено;
		//Читаем файл, чтоб понять что за ошибка нам пришла.
		Если		Найти(ТекстАнализОшибки, "{00000000-0000-0000-0000-1aa0000f1002}") Тогда
			Отказ = Ложь;
			Пока ВремяНачалаЗапроса + ДопПараметры.X_Timeout > ТекущаяДата() Цикл
				//Ожидание по задержке, после чего повторяем запрос.
			КонецЦикла;
			СбисРезультат = HTTPСоединение_Получить_Клиент(Кэш, ПараметрыЗапроса, ДопПараметры, Отказ);
		ИначеЕсли	Найти(ТекстАнализОшибки, "{00000000-0000-0000-0000-1fa0000a0001}") Тогда
			СбисРезультат = Новый Структура("code,message,details", 786, "Ошибка генерации PDF", "Файл невозможно преобразовать в PDF");
		Иначе
			СбисРезультат = Новый Структура("code,message,details", 100, "Ошибка получения файла", ТекстАнализОшибки);
		КонецЕсли;
	ИначеЕсли HTTPОтвет.КодСостояния = 302 Тогда
		//Делаем переадресацию
		СбисАдресСервера = СтрЗаменить(СтрЗаменить(СтрЗаменить(HTTPОтвет.Заголовки.Получить("Location")	, ПараметрыЗапроса.АдресРесурсаВЗапрос,		"")
																										, ПараметрыЗапроса.Протокол,	"")
																										, "://",		"");
		ДопПараметры.Вставить("Соединение", Вычислить(СтрокаСоединения));
		СбисРезультат = HTTPСоединение_Получить_Клиент(Кэш, ПараметрыЗапроса, ДопПараметры, Отказ);
	ИначеЕсли HTTPОтвет.КодСостояния = 404 Тогда	
		Отказ = Истина; 
		ИмяВСтэк			= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".HTTPСоединение_Получить_Клиент";
		СообщениеОбОшибке	= "URL """ + ПараметрыЗапроса.АдресСервера + ПараметрыЗапроса.АдресРесурсаВЗапрос + """ не найден.";
		СбисРезультат		= МодульОбъектаКлиент().НовыйСбисИсключение(735, ИмяВСтэк,,СообщениеОбОшибке);
	Иначе
		HTTPСоединение = Неопределено;
		СбисРезультат = ПараметрыЗапроса.ПутьКФайлу;
	КонецЕсли;
	Возврат СбисРезультат;
КонецФункции

//Формирует Прокси по параметрам
&НаКлиенте
Функция СбисСформироватьПроксиНаКлиенте(МестныйКэшПарам, Протокол) Экспорт
	Если МестныйКэшПарам.ТипПрокси = "Вручную" Тогда
		ТипЧисло  = Новый ОписаниеТипов("Число");
		ПроксиПорт = ТипЧисло.ПривестиЗначение(МестныйКэшПарам.ПроксиПорт);
		
		// Ручные настройки прокси-сервера.
		Прокси = Новый ИнтернетПрокси;
		Прокси.Установить(Протокол, МестныйКэшПарам.ПроксиСервер, ПроксиПорт);
		Прокси.НеИспользоватьПроксиДляЛокальныхАдресов = Истина;
		Прокси.Пользователь = МестныйКэшПарам.ПроксиЛогин;
		Прокси.Пароль       = МестныйКэшПарам.ПроксиПароль;
	ИначеЕсли МестныйКэшПарам.ТипПрокси = "Автоматически" Тогда
		// Системные настройки прокси-сервера.
		Прокси = Новый ИнтернетПрокси(Истина);
	Иначе
		// Не использовать прокси-сервер.
		Прокси = Новый ИнтернетПрокси(Ложь);
	КонецЕсли;
	Возврат Прокси;
КонецФункции

//Функция формирует заголовки для выполнения запроса, аналогично старой, но с измененной структурой
//КэшПарам:
//	Аналогичные параметры из Кэш.
//ДополнительныеПараметры: 
//	ИдСессии	- (Необязательный) ид активной сессии
//	ТаймАут		- (Необязательный) таймаут для заголовка в секундах.
&НаКлиенте
Функция СбисСформироватьЗаголовкиНаКлиенте(КэшПарам, ДополнительныеПараметры)
	Заголовки = Новый Соответствие;
	Если	ДополнительныеПараметры.Свойство("ИдСессии")
		И	ЗначениеЗаполнено(ДополнительныеПараметры.ИдСессии) Тогда
		Заголовки.Вставить("X-SBISSessionID", ДополнительныеПараметры.ИдСессии);
	КонецЕсли;
	Если ДополнительныеПараметры.Свойство("ТаймАут") Тогда
		Заголовки.Вставить("X-Timeout", Формат(ДополнительныеПараметры.ТаймАут * 1000, "ЧН=0; ЧГ=0"));
	КонецЕсли;
	Заголовки.Вставить("Content-Type",	"application/json; charset=utf-8");
	Если КэшПарам.Свойство("UserAgent") Тогда
		Заголовки.Вставить("User-Agent",	КэшПарам.UserAgent);
	Иначе
		Заголовки.Вставить("User-Agent",	КэшПарам.ПолнаяВерсияПродукта);  
	КонецЕсли;	Возврат Заголовки;
КонецФункции

//Получает html по идентификаторам пакета и вложения
//Используется при просмотре документов из реестров СБИС
&НаКлиенте
Функция ПолучитьHTMLВложенияНаКлиенте(Кэш, Вложение)
	Если Не ЗначениеЗаполнено(Вложение.СсылкаНаHTML) Тогда
		Возврат "";
	КонецЕсли;
	Отказ = Ложь;
	ПараметрыФайла = Новый Структура("АдресРесурса", Вложение.СсылкаНаHTML);
	Результат = СбисОтправитьИОбработатьКомандуGETНаКлиенте(Кэш, ПараметрыФайла, Отказ);
	Если Отказ Тогда
		Возврат "";
	КонецЕсли;
	Текст = Новый ЧтениеТекста(Результат);
	СбисСтрокаКодировка = Кэш.КэшЗначенийИни.КодировкиЧтенияФайлов.ПоУмолчанию.ДляВсех;
	//Проверим первые 3 строки на предмет наличия там строки с описанием кодировки файла
	Для СчетчикСтрок = 1 По 3 Цикл
		СтрокаРезультат = СокрЛП(Текст.ПрочитатьСтроку());
		Если Не Лев(СтрокаРезультат, 5) = "<META" Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого КодировкаДляЧтения Из Кэш.КэшЗначенийИни.КодировкиЧтенияФайлов.Определять Цикл
			Если Найти(СтрокаРезультат, "charset=" + КодировкаДляЧтения) Тогда
				СбисСтрокаКодировка = КодировкаДляЧтения;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Прервать;
	КонецЦикла;
	
	Текст = Новый ЧтениеТекста(Результат, СбисСтрокаКодировка);
	Результат = Текст.Прочитать();
	Если Лев(Результат, 9) = "<!DOCTYPE" Тогда  // для PDF, JPEG
		Возврат "";
	КонецЕсли;
	Возврат Результат;
КонецФункции

//Новая версия сбисОтправитьИОбработатьКомандуGET Выполяет чтение файла по ссылке и запись во временный файл.
//ПараметрыПолучения:
//	СБИС, парам - аналогичные параметры из Кэш.
//ПараметрыЗапроса: 
//	АдресРесурса	- (Обязательный)ссылка на данные
//	ПутьКФайлу		- (Обязательный)ссылка на выбранный адрес для записи.
&НаКлиенте
Функция СбисОтправитьИОбработатьКомандуGETНаКлиенте(Кэш, ПараметрыЗапроса, Отказ) Экспорт
		
	Перем ПутьКФайлу, Заголовки, ПараметрПроверить, АдресРесурсаВЗапрос, ТекстАнализОшибки;	
    ДопПараметрыКоманды = Новый Структура("X_Timeout, Timeout", 10, 60);
	
	Если НРег(Лев(ПараметрыЗапроса.АдресРесурса, 4)) = "http" Тогда
		ПолныйАдресСервера = Лев(ПараметрыЗапроса.АдресРесурса, Найти(нрег(ПараметрыЗапроса.АдресРесурса), ".sbis.ru/")+8);
	Иначе
		ПолныйАдресСервера = Кэш.СБИС.АдресСервера;
	КонецЕсли;
	Если Не ПараметрыЗапроса.Свойство("АдресСервера") Тогда
		АдресСервераСтр	= СтрЗаменить(ПолныйАдресСервера, ":", Символы.ПС);
		ПараметрыЗапроса.Вставить("Протокол", СтрПолучитьСтроку(АдресСервераСтр, 1));
		ПараметрыЗапроса.Вставить("АдресСервера",	СтрЗаменить(СтрПолучитьСтроку(АдресСервераСтр, 2), "/", ""));
	КонецЕсли;
	Если Не ПараметрыЗапроса.Свойство("Прокси") Тогда
		ПараметрыЗапроса.Вставить("Прокси", СбисСформироватьПроксиНаКлиенте(Кэш.Парам, ПараметрыЗапроса.Протокол));
	КонецЕсли;
	Если Не ПараметрыЗапроса.Свойство("АдресРесурсаВЗапрос") Тогда
		ПараметрыЗапроса.Вставить("АдресРесурсаВЗапрос", СтрЗаменить(ПараметрыЗапроса.АдресРесурса, ПолныйАдресСервера,""));
	КонецЕсли;
	
	Если 	Не ПараметрыЗапроса.Свойство("ПутьКФайлу", ПутьКФайлу)
		Или	Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ПараметрыЗапроса.Вставить("ПутьКФайлу", Кэш.ОбщиеФункции.СбисПолучитьИмяВременногоФайлаКлиент("tmp"));
	КонецЕсли;
	
	Если Не ПараметрыЗапроса.Свойство("Заголовки", Заголовки) Тогда
		Session_ID = "";
		Если	Не	ПараметрыЗапроса.Свойство("УстановитьSID", ПараметрПроверить)
			Или		ПараметрПроверить Тогда
			Session_ID	= Кэш.Парам.ИдентификаторСессии;
		КонецЕсли;
		ПараметрыЗаголовки = Новый Структура("ИдСессии, ТаймАут", Session_ID, ДопПараметрыКоманды.X_Timeout);
		Заголовки	= СбисСформироватьЗаголовкиНаКлиенте(Кэш.Парам, ПараметрыЗаголовки);
		ПараметрыЗапроса.Вставить("Заголовки", Заголовки);
	КонецЕсли;

	Возврат HTTPСоединение_Получить_Клиент(Кэш, ПараметрыЗапроса, ДопПараметрыКоманды, Отказ);
	
КонецФункции

//Отправляет собщение о статистике на online
//СообщениеСтатистики: генерируется функцией сбисСтатистика_СформироватьДанныеСообщений
&НаКлиенте
Функция сбисОтправитьСообщениеСтатистики(Кэш, СообщениеСтатистики, Отказ) Экспорт 
	сбисДополнительныеПараметрыОшибки = Новый Структура("АдресРесурса, ВернутьОшибку", "integration_config/service/", Истина);
	Возврат сбисОтправитьИОбработатьКоманду(Кэш, "IntegrationStat.RegisterActions2", СообщениеСтатистики, сбисДополнительныеПараметрыОшибки, Отказ);
КонецФункции

&НаКлиенте
Функция сбисПроверкаОбновления(Кэш, ИнформацияОТекущейВерсии, Отказ) Экспорт
	ДопПараметры = Новый Структура("АдресРесурса, СообщатьПриОшибке, ВернутьОшибку", "/integration-config/service/", Ложь, Истина); 
	Возврат сбисОтправитьИОбработатьКоманду(Кэш, "IntegrationStat.RegisterErrors2", ИнформацияОТекущейВерсии, ДопПараметры, Отказ);
КонецФункции

//Метод устарел, вместо него использовать МодульОбъектаКлиент.ПрочитатьДокументСБИС
&НаКлиенте
Функция ПрочитатьДокумент(Кэш, ИдДок, ДопПараметры=Неопределено, Отказ=Ложь) Экспорт
	
	ОписаниеДокумент = Новый ФиксированнаяСтруктура("Идентификатор", ИдДок);

	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;

	Попытка
		
		оДокумент = МодульОбъектаКлиент().ПрочитатьДокументСБИС(ОписаниеДокумент, ДопПараметры);
		
	Исключение
		
		ИмяИнтерации	= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ИнтеграцияИмя");
		МодульОбъектаКлиент().СбисСообщить(ИнформацияОбОшибке(), ИмяИнтерации + ".ПрочитатьДокумент");
		Отказ = Истина;
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат оДокумент;
	
КонецФункции

// Функция - Получает данные файла вложения. Заглушка	
//
// Параметры:
//  Кэш		 - ЛокальныйКэш	 - Структура параметров обработки
//  Ссылка	 - Строка	 	 - Ссылка на файл
// 
// Возвращаемое значение:
//  Строка - пустая строка для данного способа обмена
//
&НаКлиенте
Функция ПолучитьДанныеЗашифрованногоФайла(Кэш,Ссылка) Экспорт
	Сообщить("Для работы с зашифрованными документами выберите способ обмена ""extSDK2"" на вкладке Настройки.");
	Возврат "";
КонецФункции

// Функция - Расшифровывает данные файла вложения. Заглушка.
//
// Параметры:
//  Кэш					 - ЛокальныйКэш	 - Структура параметров обработки
//  Вложение			 - ВложениеСБИС	 - Струкутра вложения в документ
// 
// Возвращаемое значение:
//  Булево - Истина
//
&НаКлиенте
Функция ПроверитьПодписиВложения(Кэш,Вложение) Экспорт
	
	Возврат Истина;
	
КонецФункции   

////////////////////////////////////////////////////
////////////////////base64//////////////////////////
////////////////////////////////////////////////////

&НаКлиенте
Функция СериализоватьИзСтроки_ВBase64(Кэш, ИсходнаяСтрока, Кодировка="windows-1251", Отказ)
	#Если ВебКлиент Тогда
		Попытка
			РезультатОтвет = сбисСтрокаВBASE64(ИсходнаяСтрока, Кодировка);
		Исключение
			Отказ = Истина;
			РезультатОтвет = Кэш.ОбщиеФункции.сбисИсключение(ОписаниеОшибки(), "API.сбисСтрокаВBASE64");
		КонецПопытки;
	#ИначеЕсли ТолстыйКлиентОбычноеПриложение Тогда
		РезультатОтвет = СбисСтрокаВBASE64Клиент(Кэш, ИсходнаяСтрока, Кодировка, Отказ);
	#Иначе
		Если Кэш.Парам.ИнтеграцияAPIВызовыНаКлиенте Тогда
			РезультатОтвет = СбисСтрокаВBASE64Клиент(Кэш, ИсходнаяСтрока, Кодировка, Отказ);
		Иначе
			Попытка
				РезультатОтвет = сбисСтрокаВBASE64(ИсходнаяСтрока, Кодировка);
			Исключение
				Отказ = Истина;
				РезультатОтвет = Кэш.ОбщиеФункции.сбисИсключение(ОписаниеОшибки(), "API.сбисСтрокаВBASE64");
			КонецПопытки;
		КонецЕсли;
	#КонецЕсли
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(РезультатОтвет, "API.СериализоватьИзСтроки_ВBase64");
	КонецЕсли;
	Возврат РезультатОтвет;
КонецФункции

&НаКлиенте
Функция СериализоватьИзBase64_ВСтроку(Кэш, СтрокаBase64, Кодировка="windows-1251", Отказ)
	#Если ВебКлиент Тогда
		Попытка
			РезультатОтвет = сбисBASE64ВСтроку(СтрокаBase64, Кодировка);
		Исключение
			Отказ = Истина;
			РезультатОтвет = Кэш.ОбщиеФункции.сбисИсключение(ОписаниеОшибки(), "API.сбисBASE64ВСтроку");
		КонецПопытки;
	#ИначеЕсли ТолстыйКлиентОбычноеПриложение Тогда
		РезультатОтвет = сбисBASE64ВСтрокуКлиент(Кэш, СтрокаBase64, Кодировка, Отказ);
	#Иначе
		Если Кэш.Парам.ИнтеграцияAPIВызовыНаКлиенте Тогда
			РезультатОтвет = сбисBASE64ВСтрокуКлиент(Кэш, СтрокаBase64, Кодировка, Отказ);
		Иначе
			Попытка
				РезультатОтвет = сбисBASE64ВСтроку(СтрокаBase64, Кодировка);
			Исключение
				Отказ = Истина;
				РезультатОтвет = Кэш.ОбщиеФункции.сбисИсключение(ОписаниеОшибки(), "API.сбисBASE64ВСтроку");
			КонецПопытки;
		КонецЕсли;
	#КонецЕсли
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(РезультатОтвет, "API.СериализоватьИзBase64_ВСтроку");
	КонецЕсли;
	Возврат РезультатОтвет;
КонецФункции

&НаСервереБезКонтекста
Функция СбисФайлВBASE64(ПолноеИмяФайла) Экспорт
	ДвоичныеДанныеXML = Новый ДвоичныеДанные(ПолноеИмяФайла);
	ТекстXMLBase64 = СтрЗаменить(СтрЗаменить(Base64Строка(ДвоичныеДанныеXML),Символы.ПС,""),Символы.ВК,"");  
	Возврат ТекстXMLBase64;
КонецФункции

&НаСервереБезКонтекста
Функция СбисСтрокаВBASE64(Знач строка, кодировка = "windows-1251") Экспорт
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.УстановитьТекст(строка);
	ИмяВрФ = КаталогВременныхФайлов()+"sbisTemp.xml";
	ТекстДок.Записать(ИмяВрФ, кодировка);
	ТекстXMLBase64 = сбисФайлВBASE64(ИмяВрФ);  
	Попытка 
		УдалитьФайлы(ИмяВрФ); 
	Исключение 
	КонецПопытки;	
	Возврат ТекстXMLBase64;
КонецФункции

&НаКлиенте
Функция СбисСтрокаВBASE64Клиент(Кэш, ИсходнаяСтрока, КодировкаСтроки="windows-1251", Отказ)
	ДвоичныеДанныеXML = СбисСтрокаВДвоичныеДанныеКлиент(Кэш, ИсходнаяСтрока, КодировкаСтроки, Отказ);
	Если Отказ = Истина Тогда
		Возврат ДвоичныеДанныеXML;		
	КонецЕсли;
	ТекстXMLBase64 = СтрЗаменить(СтрЗаменить(Base64Строка(ДвоичныеДанныеXML),Символы.ПС,""),Символы.ВК,"");
	Возврат ТекстXMLBase64;
КонецФункции 

&НаКлиенте
Функция СбисСтрокаВДвоичныеДанныеКлиент(Кэш, ИсходнаяСтрока, КодировкаСтроки="windows-1251", Отказ)
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.УстановитьТекст(ИсходнаяСтрока);
	ИмяВрФ = Кэш.ОбщиеФункции.СбисПолучитьИмяВременногоФайлаКлиент("xml");
	Попытка 
		ТекстДок.Записать(ИмяВрФ, КодировкаСтроки);
	Исключение
		Отказ = Истина;
		Возврат Кэш.ОбщиеФункции.СбисИсключение(772, "API.СбисСтрокаВBASE64Клиент",,,ОписаниеОшибки());
	КонецПопытки;
	ДвоичныеДанныеXML = Новый ДвоичныеДанные(ИмяВрФ);
	Кэш.ОбщиеФункции.СбисОчиститьВременныйФайлКлиент(ИмяВрФ);
	Возврат ДвоичныеДанныеXML;
КонецФункции

&НаСервереБезКонтекста
Функция сбисBASE64ВСтроку(Знач ТекстXMLBase64, Кодировка) Экспорт
	ДвоичныеДанныеXML = Base64Значение(ТекстXMLBase64);
	ИмяВрФ = КаталогВременныхФайлов()+"sbisTemp.xml";
	ДвоичныеДанныеXML.Записать(ИмяВрФ);
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ИмяВрФ, Кодировка);
	html_text = ТекстДок.ПолучитьТекст();
	Попытка 
		УдалитьФайлы(ИмяВрФ); 
	Исключение 
	КонецПопытки;
	Возврат html_text;
КонецФункции

&НаКлиенте
Функция сбисBASE64ВСтрокуКлиент(Кэш, Строка_Base64, Кодировка, Отказ) Экспорт
	ИмяВрФ = Кэш.ОбщиеФункции.СбисПолучитьИмяВременногоФайлаКлиент("xml");
	Попытка
		ДвоичныеДанныеXML = Base64Значение(Строка_Base64);
		ДвоичныеДанныеXML.Записать(ИмяВрФ);
		ТекстДок = Новый ТекстовыйДокумент;
		ТекстДок.Прочитать(ИмяВрФ, Кодировка);
		СбисРезультат = ТекстДок.ПолучитьТекст();
	Исключение
		Отказ = Истина;
		Возврат Кэш.ОбщиеФункции.СбисИсключение(772, "API.сбисBASE64ВСтрокуКлиент",,,ОписаниеОшибки());
	КонецПопытки;
	Кэш.ОбщиеФункции.СбисОчиститьВременныйФайлКлиент(ИмяВрФ);
	Возврат СбисРезультат;
КонецФункции

