 //Есть В ГО, но они серверные. переделать(?)
 //Проверить на 8.2
&НаКлиенте
Функция DecodeXmlXdto(СтрокаXML) Экспорт
	//Проверить на 8.2	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(СтрокаXML);
	// Создать сериализатор XDTO для глобальной фабрики XDTO
	НовыйСериализаторXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	// Десериализовать объект из XML
	Возврат НовыйСериализаторXDTO.ПрочитатьXML(Чтение);
	
КонецФункции // DecodeXmlXdto(СтрокаXML)

&НаКлиенте
Функция EncodeXdtoXml(ОбъектДляСериализации)

	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.Отступ = Ложь;
	ЗаписьXML.УстановитьСтроку();
	// Создать сериализатор XDTO для глобальной фабрики XDTO
	НовыйСериализаторXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	// Cериализовать объект в XML
	НовыйСериализаторXDTO.ЗаписатьXML(ЗаписьXML, ОбъектДляСериализации);
	
	Возврат ЗаписьXML.Закрыть();

КонецФункции // EncodeXdtoXml(ОбъектДляСериализации)

Функция СтруктураВСоответствие(Структура)
	
	Результат = Новый Соответствие;
	Для Каждого ЭлементСтруктуры Из Структура Цикл
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("Структура") Тогда
			Результат.Вставить(ЭлементСтруктуры.Ключ,СтруктураВСоответствие(ЭлементСтруктуры.Значение));	
		Иначе
			Результат.Вставить(ЭлементСтруктуры.Ключ,ЭлементСтруктуры.Значение);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;
КонецФункции
