
//Получает html по идентификаторам пакета и вложения
//Используется при просмотре документов из реестров СБИС
&НаКлиенте
Функция ПолучитьHTMLВложения(Кэш, ИдДок, Вложение) Экспорт
	Если Вложение.Свойство("Зашифрован") И Вложение.Зашифрован = "Да" тогда
		Возврат "<HTML><BODY scroll=no>Документ зашифрован.</br>Для работы с зашифрованными документами выберите способ обмена ""extSDK2"" на вкладке Настройки.</BODY></HTML>";
	КонецЕсли;
	//#Если ВебКлиент Тогда
	//	Возврат ПолучитьHTMLВложенияНаСервере(КэшДляЗапросаНаСервере(Кэш), Вложение);
	//#ИначеЕсли ТолстыйКлиентОбычноеПриложение Тогда
	//	Возврат ПолучитьHTMLВложенияНаКлиенте(Кэш, Вложение);
	//#Иначе
	//	Если Кэш.Парам.ИнтеграцияAPIВызовыНаКлиенте Тогда
	//		Возврат ПолучитьHTMLВложенияНаКлиенте(Кэш, Вложение);
	//	Иначе
	//		Возврат ПолучитьHTMLВложенияНаСервере(КэшДляЗапросаНаСервере(Кэш), Вложение);
	//	КонецЕсли;
	//#КонецЕсли
	Возврат ПолучитьHTMLВложенияНаКлиенте(Кэш, Вложение);
КонецФункции

//Получает данные файла вложения
&НаКлиенте
Функция ПолучитьДанныеФайлаНаКлиенте(ПараметрыПолучения, ПараметрыФайла, Отказ)
	РезультатЗапроса = СбисОтправитьИОбработатьКомандуGETНаКлиенте(ПараметрыПолучения, ПараметрыФайла, Отказ);
	Если Отказ Тогда
		Возврат РезультатЗапроса;
	КонецЕсли;
	ИмяФайла = РезультатЗапроса;
	
	ТекстДок = Новый ЧтениеТекста(ИмяФайла);
	СтрокаТекст = СтрЗаменить(НРег(ТекстДок.ПрочитатьСтроку()),"'","""");
	СтрокаКодировка = ПараметрыПолучения.КэшЗначенийИни.КодировкиЧтенияФайлов.ПоУмолчанию.ДляВсех;
	//Проверим кодировки для принудительного чтения.	
	Для Каждого КодировкаДляЧтения Из ПараметрыПолучения.КэшЗначенийИни.КодировкиЧтенияФайлов.Определять Цикл
		ПозицияКодировки = Найти(СтрокаТекст, "encoding");
		Если ПозицияКодировки И Найти(Сред(СтрокаТекст, ПозицияКодировки), КодировкаДляЧтения) Тогда
			СтрокаКодировка = КодировкаДляЧтения;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	//Переоткрываем файл в найденной кодировке
	ТекстДок.Открыть(ИмяФайла,СтрокаКодировка);
	РезультатТекст = ТекстДок.Прочитать();
	
	Если РезультатТекст = Неопределено Тогда
	//	Или	Лев(РезультатТекст,2) <> "<?" Тогда// для PDF, JPEG файлjd иногда возвращается крокозябра, которая потом вызывает ошибку передачи данных между клиентом и сервером, несмотря на то, что это строка
		РезультатТекст = "";
	КонецЕсли;
	Возврат РезультатТекст;
КонецФункции


//Получает данные файла вложения	
&НаКлиенте
Функция ПолучитьДанныеФайла(Кэш,Ссылка,Отказ=Ложь) Экспорт
	ПараметрыФайла = Новый Структура("АдресРесурса", Ссылка);
	//#Если ВебКлиент Тогда
	//	Результат = ПолучитьДанныеФайлаНаСервере(КэшДляЗапросаНаСервере(Кэш), ПараметрыФайла, Отказ);
	//#ИначеЕсли ТолстыйКлиентОбычноеПриложение Тогда
	//	Результат = ПолучитьДанныеФайлаНаКлиенте(Кэш, ПараметрыФайла, Отказ);
	//#Иначе
	//	Если Кэш.Парам.ИнтеграцияAPIВызовыНаКлиенте Тогда
			Результат = ПолучитьДанныеФайлаНаКлиенте(Кэш, ПараметрыФайла, Отказ);
	//	Иначе
	//		Результат = ПолучитьДанныеФайлаНаСервере(КэшДляЗапросаНаСервере(Кэш), ПараметрыФайла, Отказ);
	//	КонецЕсли;
	//#КонецЕсли	
	Если Отказ Тогда
		Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, Результат);
		Возврат "";
	КонецЕсли;
	Возврат Результат;
КонецФункции

//Получает указанный по ссылке файл и сохраняет его по выбранному пути
&НаКлиенте
Функция СохранитьВложениеПоСсылкеВФайл(Кэш,Ссылка,ИмяФайла="",Отказ=Ложь) Экспорт	
	Результат = СБИС_СохранитьПоСсылкеВФайл(Кэш, Новый Структура("Ссылка, ИмяФайла", Ссылка, ИмяФайла), Новый Структура, Отказ);
	Если Отказ Тогда
		Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, Результат);
		Возврат Ложь;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СбисПолучитьФайлНаКлиент(Кэш, ИмяФайлаНаКлиенте, ХранениеНаСервере, Отказ)
	Попытка
		ПолучаемыйФайл	= Новый ОписаниеПередаваемогоФайла(ИмяФайлаНаКлиенте, ХранениеНаСервере);
		ПолучаемыеФайлы	= Новый Массив;
		ПолученныеФайлы = Новый Массив;
		
		ПолучаемыеФайлы.Добавить(ПолучаемыйФайл);
		Возврат ПолучитьФайлы(ПолучаемыеФайлы, ПолученныеФайлы,,Ложь);
	Исключение
		Отказ = Истина;
		Возврат Кэш.ОбщиеФункции.СбисИсключение(, "API.СбисПолучитьФайлНаКлиент", 100, "Неизвестная ошибка передачи файла", ОписаниеОшибки());
	КонецПопытки;
КонецФункции

&НаКлиенте
Функция СБИСЗаписатьВложения(Кэш,СоставПакета, Вложение) Экспорт
	Попытка
		Кэш.СБИС.МодульОбъектаКлиент.ЗаписатьВложенияСБИС(СоставПакета, Вложение, Новый Структура, Новый Структура("Кэш", Кэш));
	Исключение  
		
		Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, ИнформацияОбОшибке());
		Возврат Ложь;  
		
	КонецПопытки;   
	
	Возврат Истина;
КонецФункции		// alo Меркурий >>   


