
//Настраивает форму дял работы
&НаКлиенте
Функция УстановитьПараметрыМодуля(ПараметрыУстановки=Неопределено, Кэш=Неопределено)				Экспорт
	Если Кэш = Неопределено Тогда
		ЛокальныйКэш = ВладелецФормы.Кэш;
	Иначе
		ЛокальныйКэш = Кэш;
	КонецЕсли;
	УстановитьПараметрыРегистры(ЛокальныйКэш);	
    Попытка
		ДобавитьЗаписиВПланВидовХарактеристик();
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		СбисИсключение = МодульОбъектаКлиент().НовыйСбисИсключение(ИнфоОбОшибке,"Статусы_Регистры.УстановитьПараметрыМодуля");
		МодульОбъектаКлиент().СбисСообщить(СбисИсключение);
	КонецПопытки;
КонецФункции

#Область include_core2_vo2_Статусы_Регистры_ВнешнийВызов_Актуальные
#КонецОбласти

#Область include_core2_vo2_Статусы_Регистры_ВнешнийВызов_Устаревшие
#КонецОбласти

