
&НаКлиенте
Процедура УстановитьРазделДляДействия(ПараметрыДействия, Кэш)	
	Перем ТекущийРаздел, КлючДляРаздела, ИмяИниУстановить, ПараметрыУстановитьРаздел, ИдДействияОбработки;
	
	УстановитьРаздел = Ложь;
	Если 	ПараметрыДействия.Свойство("ИмяИни", ИмяИниУстановить) Тогда
		
		УстановитьРаздел = Истина;
		ПараметрыУстановитьРаздел = Новый Структура("ИмяИни", ИмяИниУстановить);
		
	ИначеЕсли ПараметрыДействия.Свойство("Действие", ИдДействияОбработки) Тогда
		
		Если ИдДействияОбработки = "Отправка" Тогда
			
			УстановитьРаздел =	Не	Кэш.Свойство("Текущий", ТекущийРаздел)
							Или		МодульОбъектаКлиент().РазделГО_Пустой(ТекущийРаздел)
							// Отправка возможна только с разделов Продажа и Покупка
							Или	(	Не	ТекущийРаздел.ОписаниеРаздела.Имя = "Продажа"
								И	Не	ТекущийРаздел.ОписаниеРаздела.Имя = "Покупка");
								
			// Не указана ини для раздела. Дефолтное значение - первая кнопка Продажа
			КлючДляРаздела = "АккордеонПродажаДок033";
			
		КонецЕсли;
			
	Иначе
		
		ВызватьИсключение "Для установки раздела должно быть указано действие, либо имя ини!";
		
	КонецЕсли;
					
	Если УстановитьРаздел Тогда
		
		//Установить раздел в Продажа по-дефолту, если ничего не передано. Ини определяется по представлению, либо метаданным документа 1С
		Кэш.Текущий = МодульОбъектаКлиент().НовыйРазделГО(КлючДляРаздела, ПараметрыУстановитьРаздел);

	КонецЕсли;
	
КонецПроцедуры


