
&НаКлиенте
Функция УстановитьФормуВладельца(КлючУникальностиВладельца)

	УстановитьГлавноеОкно = Истина;
	
	Если Не ВладелецФормы = Неопределено Тогда
				
		Если ВладелецФормы.КлючУникальности = КлючУникальностиВладельца Тогда
			
			Попытка
				
				ГлавноеОкно 			= ВладелецФормы;
				Кэш						= ГлавноеОкно.Кэш;
				УстановитьГлавноеОкно	= Ложь;
				
			Исключение
				
				Сообщить("Установленный владелец формы не является формой ""Главное окно""");
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если УстановитьГлавноеОкно Тогда
		
		ИмяОбработкиПолучить = "ФормаГлавноеОкно";
		Если Не ИмяФормы = Неопределено Тогда
			
			ИмяОбработкиПолучить = Сред(ИмяФормы, 1, СтрДлина(ИмяФормы) - 16) + ИмяОбработкиПолучить;
			
		КонецЕсли;
		
		ГлавноеОкно		= ПолучитьФорму(ИмяОбработкиПолучить, , КлючУникальности);
		Кэш				= ГлавноеОкно.Кэш;
		ВладелецФормы	= ГлавноеОкно;
		
	КонецЕсли;
	
	Возврат ГлавноеОкно;
	
КонецФункции

// Функция выполняет инициализацию структуры Кэш обработки, получает настройки.
//Параметры
//	ДополнительныеПараметры:	необязательная структура. Может содержать поля, аналогичные Кэш.Парам При наличии, заменяет одноименные поля при запуске обработки.
//
//Возвращает
//	структура Кэш, в которой содержаться параметры для работы обработки.
//	строка ошибки запуска оработки
&НаКлиенте
Функция сбисИнициализировать(ДополнительныеПараметры=Неопределено, Отказ=Ложь) Экспорт 
	
	//функция сокращающая количество строк кода для клиента, чтобы не пришлось делать это по отдельности
	Кэш = сбисПодготовитьКэш(ДополнительныеПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш;
	КонецЕсли;
	сбисПрочитатьНастройки(Кэш);
	//Записываем версию в данные реквизитов формы
	Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("НоваяВерсия") Тогда
		
		МодульОбъектаКлиент().ИзменитьПараметрСбис("ПредВерсия", Кэш.ПараметрыСистемы.Обработка.Версия);
		ПараметрыЗаписи = Новый Структура("ВыполнитьВручную, Парам", Истина, Кэш.Парам);
		Кэш.ГлавноеОкно.сбисСохранитьЗначения(ПараметрыЗаписи);
		
	КонецЕсли;
	
	Возврат Кэш;
	
КонецФункции

// Функция читает настройки пользователя, выполняет обновление настроек при изменении версии и проверку при изменении настроек
//Параметры
//	Кэш:						структура, кэш обработки Sbis1C
//	ДополнительныеПараметры:	резерв
//
//Возвращает
//	Истина, если ини прошли проверку и успешно установлены.
&НаКлиенте
Функция сбисПрочитатьНастройки(Кэш, ДополнительныеПараметры=Неопределено) Экспорт	

	//Чтение подготовленных настроек 
	Кэш.ГлавноеОкно.сбисПолучитьУстановитьНастройки(Кэш, Ложь);
	Кэш.Вставить("ИниВПорядке", Кэш.КэшНастроек.ИниВПорядке);//Обратная совместимость роботов и ВФК
	Возврат Кэш.КэшНастроек.ИниВПорядке;
	
КонецФункции

// Функция формирует структуру кэша обработки, включает обмен со СБИС.
//ДополнительныеПараметры:		необязательная структура, может содержать поля, аналогичные Кэш.Парам (функция ВосстановитьПараметрыПользователя) При наличии заменяет одноименные поля в кэш.парам.
//                              пример изменения способа обмена: Новый Структура("СпособОбмена", 0); (sdk:0, каталог:1, API:3, extSDK:4, extSDK с шифрованием:5 extSDK2:6, extSDK2 с шифрованием: 7)
//Возвращает
//	Структуру кэш в случае успешного заполнения параметров и активации обмена. 
//	Строку ошибки включения обмена при неудаче
&НаКлиенте
Функция сбисПодготовитьКэш(ДопПараметры=Неопределено, Отказ=Ложь) Экспорт	
	
	Перем КлючУникальности;
	
	Если НЕ	(	ЗначениеЗаполнено(ДопПараметры) 
			И	ДопПараметры.Свойство("КлючУникальности", КлючУникальности)) Тогда
		КлючУникальности = Неопределено;
	КонецЕсли; 
	
	ГлавноеОкно = УстановитьФормуВладельца(КлючУникальности);
	
	Если НЕ ЗначениеЗаполнено(ДопПараметры) Тогда  
		ДопПараметры = Новый Структура;
	КонецЕсли;  
	
	ДопПараметры.Вставить("КлючУникальности", КлючУникальности);

	ПараметрыПередать = Новый Структура("ТихийРежим", Истина);
	ПараметрыПередать.Вставить("Парам",						ДопПараметры);
	ПараметрыПередать.Вставить("РежимЗапускаГлавногоОкна",	"ВнешнийИнтерфейс");
	РезультатПодготовки = ГлавноеОкно.ПослеОткрытияЗаполнитьКэш(ПараметрыПередать, Отказ);
	Если Отказ Тогда
		Возврат РезультатПодготовки.message + "(" + РезультатПодготовки.details + ")";
	КонецЕсли;
	Кэш			= РезультатПодготовки;
	ОбменВключен= Кэш.Интеграция.Включить(Кэш, ДопПараметры, Отказ);
	Если Не ОбменВключен = Истина Тогда   // если не удалось включить SDK или Плагин
		Отказ = Истина;
		Возврат ОбменВключен;
	КонецЕсли;

	Возврат Кэш;
КонецФункции

