
// Процедура выполняет инициализацию структуры Кэш обработки, авторизацию, получает настройки.
//Параметры
//	ПараметрыПользователяSABY	 - Структура	 - сохраненные параметры, идентичные Кэш.Парам, которые настроят запуск с определенными аргументами. Если не указано, то будет восстановлено по текущему пользователю 1С
//	ДопПараметры				 - Структра		 - расширение
//		ОбработчикРезультата:	 ОписаниеОповещения/Структура с полями "ИмяПроцедуры, ДополнительныеПараметры, Модуль" обработчик, который будет вызван после успешного/неудачного запуска
//		ПоказатьИнтерфейс:		 Булево (Необязательный, Истина)	если не удалось авторизоваться, то будет открыто окно авторизации
//		ОбновитьКэш:			 Булево (Необязательный, Истина)	если указано явно, то кэш будет обновлен
//		УстановитьНастройки:	 Булево (Необязательный, Истина)	будут получены и установлены настройки
//		ПолнаяОшибка: 			 Булево (Необязательный, Ложь)		если включено, в случае ошибки, будет получен исходный класс ошибки, а не приведенный текст.
//
&НаКлиенте
Процедура ВИ_Инициализировать(ПараметрыПользователяSABY = Неопределено, ДопПараметры) Экспорт 
	Перем ОбработчикРезультата, ОбновитьКэш;

	Если	Не	ДопПараметры.Свойство("ОбработчикРезультата", ОбработчикРезультата)
		Или		ОбработчикРезультата = Неопределено Тогда
		
		ВызватьИсключение "Ошибка запуска инициализации модуля: Не указан обработчик для продолжения!";
		
	КонецЕсли;
	
	ТекущийКэш	= МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	
	Если ТекущийКэш = Неопределено Тогда
		
		ОбновитьКэш = Истина;
		
	ИначеЕсли Не ДопПараметры.Свойство("ОбновитьКэш", ОбновитьКэш) Тогда
		
		ОбновитьКэш = Ложь;
			
	КонецЕсли;

	Если ОбновитьКэш Тогда
		
		ОшибкаПодготовки = Ложь;
		Кэш = сбисПодготовитьКэш(ПараметрыПользователяSABY, ОшибкаПодготовки);
		Если ОшибкаПодготовки Тогда
			
			ОшибкаИницизацияКэш = МодульОбъектаКлиент().НовыйСбисИсключение(Кэш, "ВИ.Инициализировать");
			Если	ДопПараметры.Свойство("ПолнаяОшибка")
				И	ДопПараметры.ПолнаяОшибка Тогда
				
				ОшибкаДляВыдачи = ОшибкаИницизацияКэш;
				
			Иначе
				
				ОшибкаДляВыдачи = МодульОбъектаКлиент().СбисИсключение_Представление(ОшибкаИницизацияКэш, "Сообщение");
				
			КонецЕсли;
			
			МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(ОшибкаДляВыдачи, ОбработчикРезультата);
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		Кэш = ТекущийКэш;
		
	КонецЕсли;
	
	Если Не ДопПараметры.Свойство("УстановитьНастройки") Тогда
		
		ДопПараметры.Вставить("УстановитьНастройки", Истина);
		
	КонецЕсли;
	
	ВИ_АвторизоватьсяВSABY(Кэш.Парам, ДопПараметры);
	
КонецПроцедуры

#Область include_core2_vo2_ВнешнийИнтерфейс_ЗапускИУстановка_Дополнительное
#КонецОбласти

