
// Процедура выполняет инициализацию структуры Кэш обработки, авторизацию, получает настройки.
//Параметры
//	ПараметрыПользователяSABY	 - Структура	 - сохраненные параметры, идентичные Кэш.Парам, которые настроят запуск с определенными аргументами. Если не указано, то будет восстановлено по текущему пользователю 1С
//	ДопПараметры				 - Структра		 - расширение
//		ОбработчикРезультата:	 ОписаниеОповещения/Структура с полями "ИмяПроцедуры, ДополнительныеПараметры, Модуль" обработчик, который будет вызван после успешного/неудачного запуска
//		ПоказатьИнтерфейс:		 Булево (Необязательный, Истина)	если не удалось авторизоваться, то будет открыто окно авторизации
//		ОбновитьКэш:			 Булево (Необязательный, Истина)	если указано явно, то кэш будет обновлен
//		УстановитьНастройки:	 Булево (Необязательный, Истина)	будут получены и установлены настройки
//		ПолнаяОшибка: 			 Булево (Необязательный, Ложь)		если включено, в случае ошибки, будет получен исходный класс ошибки, а не приведенный текст.
//
&НаКлиенте
Процедура ВИ_Инициализировать(ПараметрыПользователяSABY = Неопределено, ДопПараметры) Экспорт 
	Перем ОбработчикРезультата, ОбновитьКэш, ОшибкаДляВыдачи;

	Если	Не	ДопПараметры.Свойство("ОбработчикРезультата", ОбработчикРезультата)
		Или		ОбработчикРезультата = Неопределено Тогда
		
		ВызватьИсключение "Ошибка запуска инициализации модуля: Не указан обработчик для продолжения!";
		
	КонецЕсли;

	// Проверка наличия Владельца и установленного Кэш
	ЗапросТекущийКэш = Новый Структура("Кэш");
	Если Не ВладелецФормы = Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(ЗапросТекущийКэш, ВладелецФормы);
		
	КонецЕсли;
	
	ТекущийКэш	= ЗапросТекущийКэш.Кэш;
	
	Если ТекущийКэш = Неопределено Тогда
		
		ОбновитьКэш = Истина;
		
	ИначеЕсли Не ДопПараметры.Свойство("ОбновитьКэш", ОбновитьКэш) Тогда
		
		ОбновитьКэш = Ложь;
			
	КонецЕсли;

	Если ОбновитьКэш Тогда
		
		ОшибкаПодготовки = Ложь;
		
		ПараметрыПодготовить = Новый Структура("ТихийРежим, ПолнаяОшибка", Истина, Истина);
		Если Не ПараметрыПользователяSABY = Неопределено Тогда
			
			ПараметрыПодготовить.Вставить("Парам", ПараметрыПользователяSABY);
			
		КонецЕсли;
		
		Если ДопПараметры.Свойство("КлючУникальности") Тогда
			
			ПараметрыПодготовить.Вставить("КлючУникальности", ДопПараметры.КлючУникальности);
			
		КонецЕсли;	
			
		Кэш = ВИ_ПодготовитьРаботу(ПараметрыПодготовить, ОшибкаПодготовки);
		Если ОшибкаПодготовки Тогда
			
			ОшибкаДляВыдачи = Кэш;
			
		Иначе
			
			ВключитьОбмен = ВИ_Запустить(ПараметрыПодготовить, ОшибкаПодготовки);

			Если ОшибкаПодготовки Тогда
				
				ОшибкаДляВыдачи = ВключитьОбмен;

			КонецЕсли;
			
		КонецЕсли;
		
		Если ОшибкаПодготовки Тогда
			
			ОшибкаДляВыдачи = МодульОбъектаКлиент().НовыйСбисИсключение(ОшибкаДляВыдачи, "ВИ.Инициализировать");

			Если	Не	(	ДопПараметры.Свойство("ПолнаяОшибка")
						И	ДопПараметры.ПолнаяОшибка) Тогда
				
				ОшибкаДляВыдачи = МодульОбъектаКлиент().СбисИсключение_Выгрузить(ОшибкаДляВыдачи, "Сообщение");
				
			КонецЕсли;
			
			МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(ОшибкаДляВыдачи, ОбработчикРезультата);
			
			Возврат;
			
		КонецЕсли;
		
		
	Иначе
		
		Кэш = ТекущийКэш;
		
	КонецЕсли;
	
	Если Не ДопПараметры.Свойство("УстановитьНастройки") Тогда
		
		ДопПараметры.Вставить("УстановитьНастройки", Истина);
		
	КонецЕсли;
	
	ВИ_АвторизоватьсяВSABY(Кэш.Парам, ДопПараметры);
	
КонецПроцедуры

// Функция - формирует структуру кэша обработки, восстанавливает параметры пользователя
//
// Параметры:
//  ДопПараметры - Структура	 - Расширение метода
//		ПолнаяОшибка(Н)(Ложь)	 : В зависимости от признака определяет форму исключения при ошибке - Ложь = Строка, Истина = Структура СбисИсключение.
//		КлючУникальности (Н)	 : Неопределено/УИД - ключ для запуска нескольких экземпляров обработки.
//		ТихийРежим (Н)(Истина)	 : Признак отключения интерфейса.
//		Парам (Н)				 : Структура с полями, аналогичными Кэш.Парам. При наличии заменяет одноименные параметры пользователя
//								   пример изменения способа обмена: Новый Структура("СпособОбмена", 3); (каталог:1, API:3, extSDK2:6, extSDK2 с шифрованием: 7)
//		
//  Отказ		 - Булево	 - Флаг результата. В случае изменения в Истина, произошла ошибка, которая прийдёт как итог.
// 
// Возвращаемое значение:
//  Результат подготовки - экземпляр ЛокальныйКэш при успехе. экземпляр СбисИсключение при неудаче
//
&НаКлиенте
Функция ВИ_ПодготовитьРаботу(ДопПараметры, Отказ) Экспорт	
	Перем КлючУникальности, УстановитьТихийРежим;
	
	ДопПараметры.Свойство("КлючУникальности", КлючУникальности);
	
	Если Не ДопПараметры.Свойство("ТихийРежим", УстановитьТихийРежим) Тогда
		
		УстановитьТихийРежим = Истина;
		
	КонецЕсли;
	
	ГлавноеОкно	= УстановитьФормуВладельца(КлючУникальности);
	Если УстановитьТихийРежим Тогда
		
		ГлавноеОкно.ПараметрыФормы.ТихийРежим = Истина;
		
	КонецЕсли;
	
	Кэш = ГлавноеОкно.КэшПодготовить(ДопПараметры, Отказ);
	
	Если Отказ Тогда
		
		Возврат Кэш;
		
	КонецЕсли;

	МодульОбъектаКлиент().ИзменитьПараметрСБИС("ТихийРежим", УстановитьТихийРежим);
	Возврат Кэш;

КонецФункции

// Функция -  включает обмен со СБИС по заранее настроенному кэшу
//
// Параметры:
//  ДопПараметры - Структура	 - Расширение метода
//		ПолнаяОшибка(Н)(Ложь)				 : В зависимости от признака определяет форму исключения при ошибке - Ложь = Строка, Истина = Структура СбисИсключение.
//  Отказ		 - Булево	 - Флаг результата. В случае изменения в Истина, произошла ошибка, которая прийдёт как итог.
// 
// Возвращаемое значение:
//  Результат запуска - экземпляр ЛокальныйКэш при успехе с запущенным транспортом. Экземпляр СбисИсключение при неудаче
//
&НаКлиенте
Функция ВИ_Запустить(ДопПараметры, Отказ) Экспорт	
	
	МодульОбъектаКлиент	= МодульОбъектаКлиент();
	Кэш					= МодульОбъектаКлиент.ПолучитьТекущийЛокальныйКэш();
	ВключенОбменСSABY	= ВладелецФормы.ОпределитьИнтеграциюРабочиеФормы(Кэш, Кэш.Парам, ДопПараметры);
	
	Если ВключенОбменСSABY = Истина Тогда
		
		Возврат Кэш;
		
	КонецЕсли;
	
	Отказ = Истина;
	Возврат МодульОбъектаКлиент.НовыйСбисИсключение(ВключенОбменСSABY, "ВИ.ПодготовитьРаботу");
	
КонецФункции

#Область include_core2_vo2_ВнешнийИнтерфейс_ЗапускИУстановка_Дополнительное
#КонецОбласти

