
// НЕ ИСПОЛЬЗОВАТЬ МЕТОДЫ ИЗ ОБЛАСТИ УСТАРЕВШИХ!

//Использовать ВИ_Инициализировать
// Функция выполняет инициализацию структуры Кэш обработки, получает настройки.
//Параметры
//	ДополнительныеПараметры:	необязательная структура. Может содержать поля, аналогичные Кэш.Парам При наличии, заменяет одноименные поля при запуске обработки.
//
//Возвращает
//	структура Кэш, в которой содержаться параметры для работы обработки.
//	строка ошибки запуска оработки
&НаКлиенте
Функция сбисИнициализировать(ДополнительныеПараметры=Неопределено, Отказ=Ложь) Экспорт 
	
	//функция сокращающая количество строк кода для клиента, чтобы не пришлось делать это по отдельности
	Кэш = сбисПодготовитьКэш(ДополнительныеПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш;
	КонецЕсли;
	сбисПрочитатьНастройки(Кэш);
	//Записываем версию в данные реквизитов формы
	Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("НоваяВерсия") Тогда
		
		МодульОбъектаКлиент().ИзменитьПараметрСбис("ПредВерсия", Кэш.ПараметрыСистемы.Обработка.Версия);
		ПараметрыЗаписи = Новый Структура("ВыполнитьВручную, Парам", Истина, Кэш.Парам);
		Кэш.ГлавноеОкно.сбисСохранитьЗначения(ПараметрыЗаписи);
		
	КонецЕсли;
	
	Возврат Кэш;
	
КонецФункции

//Использовать ВИ_АвторизоватьсяВSABY
// Функция выполняет авторизацию на онлайне по сертификату, по логину/паролю, либо по сохраненному ранее идентификатору сессии.	
//Параметры
//	Кэш:						структура, кэш обработки Sbis1C
//	ПараметрыАвторизации:		структура с параметрами авторизации в сбис, аналогично Кэш.Парам. Дополнительный ключ ОписаниеОповещенияОЗакрытииФормыАвторизации для открытия формы авторизации на УФ. 		
//	ЗапускРоботом:				булево, означает необходимость вызова формы авторизации в случае, если по указанным параметрам не удалось авторизоваться. Если Истина, то форма не будет показываться.
//
//Возвращает
//	Истина			- если удалось авторизоваться.
//	Ложь			- если указанных параметров недостаточно для выполнения авторизации, либо авторизация была отменена. 
//					  так же ложь возвращается в случае авторизации по просроченному ИД сессии, без указания логина и сертификата или способа авторизации для получения нового ИД.
//	Строка			- текст ошибки авторизации получаемых при выполнении запроса к серверу.
//  Неопределено	- если не на толстом клиенте была показана форма авторизации и дальнейшее управление будет передано в функцию, указанную в переданном описании оповещения. Может быть только если в параметрах авторизации указали ключ "ОписаниеОповещенияОЗакрытииФормыАвторизации"
&НаКлиенте
Функция сбисАвторизация(Кэш, ПараметрыАвторизации, ЗапускРоботом = Истина) Экспорт
	
	ТекстОшибки			= "";
	УспешнаяАвторизация	= Ложь;
	//Если указан ИД сессии, то сперва проверим его свежесть.
	Если	ПараметрыАвторизации.Свойство("ИдентификаторСессии")
		И	ЗначениеЗаполнено(ПараметрыАвторизации.ИдентификаторСессии) Тогда
		Кэш.Интеграция.СформироватьНастройкиПодключения(Кэш, ПараметрыАвторизации.ИдентификаторСессии);
		Кэш.Парам.ИдентификаторСессии = ПараметрыАвторизации.ИдентификаторСессии;
		УспешнаяАвторизация = Кэш.Интеграция.сбисСессияДействительна(Кэш) = 1;
		Если УспешнаяАвторизация Тогда
			Попытка
				Кэш.СБИС.МодульОбъектаКлиент.ЗаполнитьСведенияОПользователеИАккаунте(Новый Структура, Кэш);
			Исключение
				ИнфОбОшибке = ИнформацияОбОшибке();
				Возврат("Не удалось установить ИД аккаунта пользователя.");
			КонецПопытки;
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
		
	//Если запускает робот, то авторизуемся, предварительно проверив что правильно переданы параметры.
	Если ЗапускРоботом Тогда
		Отказ = Ложь;
		Если Не ПараметрыАвторизации.Свойство("ВходПоСертификату") Тогда
			Возврат Ложь;
		ИначеЕсли ПараметрыАвторизации.ВходПоСертификату Тогда
			Если	Не ПараметрыАвторизации.Свойство("Сертификат")
				Или	Не ЗначениеЗаполнено(ПараметрыАвторизации.Сертификат) Тогда
				Возврат Ложь;
			КонецЕсли;
			Результат = Кэш.Интеграция.АвторизоватьсяПоСертификату(Кэш,ПараметрыАвторизации.Сертификат,Отказ);
		Иначе
			Если	Не ПараметрыАвторизации.Свойство("Логин")
				Или Не ПараметрыАвторизации.Свойство("Пароль")
				Или	Не ЗначениеЗаполнено(ПараметрыАвторизации.Логин) Тогда
				Возврат Ложь;
			КонецЕсли;
			Результат = Кэш.Интеграция.АвторизоватьсяПоЛогинуПаролю(Кэш,ПараметрыАвторизации.Логин,ПараметрыАвторизации.Пароль,Отказ);
		КонецЕсли;
		Если Отказ Тогда
			ТекстОшибки	= Результат.message;
			Результат	= Ложь;
		КонецЕсли;
	Иначе//Иначе пробуем авторизоваться по имеющимся данным с использованием стандартных механизмов. 
		Если	(	Кэш.Парам.ВходПоСертификату И Кэш.Парам.ЗапомнитьСертификат)
			Или	(НЕ	Кэш.Парам.ВходПоСертификату И Кэш.Парам.ЗапомнитьПароль) Тогда
			Попытка
		    	МодульОбъектаКлиент().АвторизоватьсяВSABY(Кэш.Парам);
				УспешнаяАвторизация = Истина;
			Исключение
				УспешнаяАвторизация =  Ложь;
			КонецПопытки;;
		КонецЕсли;
		Если УспешнаяАвторизация = Истина Тогда
			Результат = Кэш.Парам.ИдентификаторСессии;//с учетом, что в функции авторизоваться в кэш записывается текущий идентификатор, можем взять его оттуда
		Иначе	
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Результат = Ложь Тогда
		Кэш.Парам.ИдентификаторСессии = "";
		Возврат ТекстОшибки;
	КонецЕсли;
	Кэш.Парам.ИдентификаторСессии = Результат;
	Попытка
		Кэш.СБИС.МодульОбъектаКлиент.ЗаполнитьСведенияОПользователеИАккаунте(Новый Структура, Кэш);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		Возврат("Не удалось установить ИД аккаунта пользователя.");
	КонецПопытки;	
	Возврат Истина;
КонецФункции

//Использовать сбисЗапуститьОтправку
// Функция выполняет отправку документов
//Параметры
//	Кэш:						структура, кэш обработки Sbis1C
//	МассивСтрок:				список значений, содержащий структуры СоставПакета в качестве значения.
//								где СоставПакета - список значений, содержащий ссылки на документы 1С в качестве значения и наименование файла настройки для расчета документа в качестве представления для возможности точечной корректировки (если не указано, то определяется по типу документа).
//	ДополнительныеПараметры:	необязательная структура, может содержать поле ИниРеестра с имененем ТипДок для изменения настройки формирования для всех документов
//
//Возвращает
//	Истина, если ини прошли проверку и успешно установлены.
&НаКлиенте
Функция сбисОтправка(Кэш, МассивСтрок, ДопПараметры = Неопределено) Экспорт	
	Перем ИмяИниУстановить;
	
	ПараметрыУстановки = Новый Структура("Действие", "Отправка");
	Если 	Не	ЗначениеЗаполнено(ДопПараметры)
		Или	Не	ДопПараметры.Свойство("ИниРеестра", ИмяИниУстановить) Тогда
		
		// Пустое имя ини для автоопределния реестра по типу документа.
		ИмяИниУстановить = "";
		
	КонецЕсли;
	
	ПараметрыУстановки.Вставить("ИмяИни", ИмяИниУстановить);
	УстановитьРазделДляДействия(ПараметрыУстановки, Кэш);
	
	фрм = МодульОбъектаКлиент().ПолучитьФормуОбработки("Документ_Шаблон");
	фрм.ОтправитьДокументы(Кэш, МассивСтрок);
	Возврат Кэш.РезультатОтправки;
	
КонецФункции

// Использовать сбисПолучитьРеестрДокументовОнлайна.
//Функция получает список документов/событий для построения реестра.
//Параметры
//	Кэш 					- Структура - кэш обработки Sbis1C
//	ФильтрВходящий			- Структура - Может содержать поля, одноименные полям фильтра на главном окне. По заданному фильтру будут отбираться документы для сопоставления.
//	ДопПараметры			- Структура - 
//		Раздел - Строка - Представление кнопки раздела, по которому будет "построен" раздел. Посмотреть соответствие раздела с его названием можно в макете "СтруктураАккордеона"
//
//Возвращает
//	Структура с полем "Таблица_РеестрДокументов/Таблица_РеестрСобытий" с массивом документов
//	Вызывает исключение в формате: сообщение об ошибке (детализация ошибки) при ошибке
//
&НаКлиенте
Функция сбисПолучитьСписокДокументов(Кэш, Фильтр, ДополнительныеПараметры = Неопределено) Экспорт
	
	Раздел = Неопределено;
	Если	Не ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		Или	Не ДополнительныеПараметры.Свойство("Раздел",Раздел) Тогда
		Раздел = "АккордеонПолученные11";
	КонецЕсли;
	Кэш.Текущий = Кэш.ГлавноеОкно.сбисСтруктураВыбранногоРаздела(Кэш, Раздел);
	
	Возврат МодульОбъектаКлиент().ПолучитьСписокДокументовСБИС();
	
КонецФункции

// Использовать сбисПолучитьРеестрДокументовОнлайна.
//Функция получает список документов/событий для построения реестра.
//Параметры
//	Кэш 					- Структура - кэш обработки Sbis1C
//	ФильтрВходящий			- Структура - Может содержать поля, одноименные полям фильтра на главном окне. По заданному фильтру будут отбираться документы для сопоставления.
//	ДопПараметры			- Структура - 
//		Раздел - Строка - Представление кнопки раздела, по которому будет "построен" раздел. Посмотреть соответствие раздела с его названием можно в макете "СтруктураАккордеона"
//
//Возвращает
//	Структура с полем "Таблица_РеестрДокументов/Таблица_РеестрСобытий" с массивом документов
//	Вызывает исключение в формате: сообщение об ошибке (детализация ошибки) при ошибке
//
&НаКлиенте
Функция ПолучитьСписокСобытийПоФильтру(Кэш, Фильтр, ДополнительныеПараметры = Неопределено) Экспорт
	
	Раздел = Неопределено;
	Если	Не ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		Или	Не ДополнительныеПараметры.Свойство("Раздел",Раздел) Тогда
		Раздел = "АккордеонПолученные11";
	КонецЕсли;
	Кэш.Текущий = Кэш.ГлавноеОкно.сбисСтруктураВыбранногоРаздела(Кэш, Раздел);
	
	ПараметрыСписка = Новый Структура;
	Если ЗначениеЗаполнено(Фильтр) Тогда
		ПараметрыСписка.Вставить("Фильтр", Фильтр);
	КонецЕсли;
	
	Возврат МодульОбъектаКлиент().ПолучитьСписокДокументовПоСобытиямСБИС(ПараметрыСписка);
	
КонецФункции

