
// НЕ ИСПОЛЬЗОВАТЬ МЕТОДЫ ИЗ ОБЛАСТИ УСТАРЕВШИХ!

//Использовать сбисЗапуститьОтправку
// Функция выполняет отправку документов
//Параметры
//	Кэш:						структура, кэш обработки Sbis1C
//	МассивСтрок:				список значений, содержащий структуры СоставПакета в качестве значения.
//								где СоставПакета - список значений, содержащий ссылки на документы 1С в качестве значения и наименование файла настройки для расчета документа в качестве представления для возможности точечной корректировки (если не указано, то определяется по типу документа).
//	ДополнительныеПараметры:	необязательная структура, может содержать поле ИниРеестра с имененем ТипДок для изменения настройки формирования для всех документов
//
//Возвращает
//	Истина, если ини прошли проверку и успешно установлены.
&НаКлиенте
Функция сбисОтправка(Кэш, МассивСтрок, ДопПараметры = Неопределено) Экспорт	
	Перем ТекущийРаздел, ИниРеестра;
	
	// Указана ини для раздела, или раздел не заполнялся.
	УстановитьРаздел =  (	ЗначениеЗаполнено(ДопПараметры)
						И	ДопПараметры.Свойство("ИниРеестра", ИниРеестра))
					Или	Не	Кэш.Свойство("Текущий", ТекущийРаздел)
					Или	Не	ЗначениеЗаполнено(ТекущийРаздел.Раздел);
	Если УстановитьРаздел Тогда
		
		//Установить раздел в Продажа по-дефолту, если ничего не передано. Ини определяется по представлению, либо метаданным документа 1С
		Кэш.Текущий = МодульОбъектаКлиент().НовыйСтруктураРазделаГО("АккордеонПродажаДок033", ДопПараметры);
		МодульОбъектаКлиент().СтруктураРазделаГО_Вставить(Кэш.Текущий, "ТипДок", ИниРеестра);

	КонецЕсли;
	
	фрм = МодульОбъектаКлиент().ПолучитьФормуОбработки("Документ_Шаблон");
	фрм.ОтправитьДокументы(Кэш, МассивСтрок);
	Возврат Кэш.РезультатОтправки;
	
КонецФункции

// Использовать сбисПолучитьРеестрДокументовОнлайна.
//Функция получает список документов/событий для построения реестра.
//Параметры
//	Кэш 					- Структура - кэш обработки Sbis1C
//	ФильтрВходящий			- Структура - Может содержать поля, одноименные полям фильтра на главном окне. По заданному фильтру будут отбираться документы для сопоставления.
//	ДопПараметры			- Структура - 
//		Раздел - Строка - Представление кнопки раздела, по которому будет "построен" раздел. Посмотреть соответствие раздела с его названием можно в макете "СтруктураАккордеона"
//
//Возвращает
//	Структура с полем "Таблица_РеестрДокументов/Таблица_РеестрСобытий" с массивом документов
//	Вызывает исключение в формате: сообщение об ошибке (детализация ошибки) при ошибке
//
&НаКлиенте
Функция сбисПолучитьСписокДокументов(Кэш, Фильтр, ДополнительныеПараметры = Неопределено) Экспорт
	Раздел = Неопределено;
	Если	Не ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		Или	Не ДополнительныеПараметры.Свойство("Раздел",Раздел) Тогда
		Раздел = "АккордеонПолученные11";
	КонецЕсли;
	Кэш.Текущий = Кэш.ГлавноеОкно.сбисСтруктураВыбранногоРаздела(Кэш, Раздел);
	
	Если Фильтр = Неопределено Тогда
		Фильтр = Кэш.ОбщиеФункции.ПолучитьФильтрСобытий(Кэш, Новый Структура("Тип", Кэш.Текущий.ТипДок));
	КонецЕсли;
	
	СписокДокументов = Кэш.Интеграция.сбисПолучитьСписокДокументовПоФильтру(Кэш, Фильтр, Кэш.ГлавноеОкно);
	Возврат СписокДокументов;
КонецФункции

