
&НаКлиенте
Процедура ПередЗакрытиемОбработчик(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если	ПараметрыФормы.РежимЗакрытия = "ОК"
		И	ОписаниеОповещенияОЗакрытии = Неопределено Тогда
		
		// Для старой обработки, если форму настроек получали без указания что делать дальше
		ОбработкаЗавершения		= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("СбисПрименитьНастройки_Завершение", ЭтаФорма);
		ПараметрыЗавершить		= Новый Структура("ОписаниеОповещения, Аргумент", ОбработкаЗавершения, ПараметрыФормы.Результат.РезультатОбработки);
		ОтложенноеЗавершение	= МодульОбъектаКлиент().НовыйОтложенноеДействие(ПараметрыЗавершить);
		МодульОбъектаКлиент().ПодключитьОтложенноеДействие(ОтложенноеЗавершение);
		
	ИначеЕсли ПараметрыФормы.РежимЗакрытия = "Отмена" Тогда
		
		ФормаЗакрытьУстановитьСтатусЗавершить();
		
	ИначеЕсли ПараметрыФормы.РежимЗакрытия = "Завершить" Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПроверитьИПрименитьПараметрыПередЗакрытием(ПараметрыНовые, Отказ)
	
	МодульОбъектаКлиент			= МодульОбъектаКлиент();
	ФормаГлавноеОкно			= Кэш.ГлавноеОкно;
	ИзмененныеПараметрыСписок	= Новый Массив();
	
	СвойстваИзменены = Новый Структура;
	Для Каждого КлючИЗначениеПараметр Из ПараметрыНовые Цикл
		
		Если КлючИЗначениеПараметр.Значение = НастройкиПодключения_Было[КлючИЗначениеПараметр.Ключ] Тогда
			
			Продолжить;
			
		Иначе
			
			ИзмененныйПараметр = Новый Структура("ИмяПараметра, ЗначениеПараметра, ДопПараметры", КлючИЗначениеПараметр.Ключ, КлючИЗначениеПараметр.Значение);
			ИзмененныеПараметрыСписок.Добавить(ИзмененныйПараметр);
			
			СвойстваИзменены.Вставить(КлючИЗначениеПараметр.Ключ, КлючИЗначениеПараметр.Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	МодульОбъектаКлиент.ИзменитьПараметрыСбисМассово(ИзмененныеПараметрыСписок);
	
	БылАвторизован		= МодульОбъектаКлиент.ПолучитьЗначениеПараметраСБИС("Авторизован");
	ОбменВключен		= МодульОбъектаКлиент.ПолучитьЗначениеПараметраСБИС("ОбменВключен");
	ПарамерыИзменено	= Новый Структура;
	ПарамерыИзменено.Вставить("БылАвторизован",			БылАвторизован);
	ПарамерыИзменено.Вставить("ТребуетсяАвторизация",	Не БылАвторизован Или СвойстваИзменены.Свойство("АдресСервера"));

	Если ПараметрыНовые.СпособХраненияНастроек = 0 Тогда
		
		ПарамерыИзменено.Вставить("ТребуетсяПеречитатьНастройки",	СвойстваИзменены.Свойство("СпособХраненияНастроек")
																Или	СвойстваИзменены.Свойство("КаталогНастроек"));
																
	Иначе
		
		// Если меняется авторизация, но при этом не зависит от способа обмена
		ПарамерыИзменено.Вставить("ТребуетсяПеречитатьНастройки",	ПарамерыИзменено.ТребуетсяАвторизация);
		
	КонецЕсли;

	ВсеУспешлоИзменено = Истина;

	Если	Не	ОбменВключен
		Или		СвойстваИзменены.Свойство("СпособОбмена") Тогда
		
		// При изменении способа обмена (SDK, API, каталог)	"перезапускаем" обработку
		Если	Не	(	(ПараметрыНовые.СпособОбмена = 7			Или ПараметрыНовые.СпособОбмена = 6)
					И	(НастройкиПодключения_Было.СпособОбмена = 7	Или НастройкиПодключения_Было.СпособОбмена = 6)) Тогда
					
			//Идентичные модули, либо интеграция через каталог, переавторизация не требуется
			ПарамерыИзменено.ТребуетсяАвторизация = Истина;
			
		КонецЕсли;
		
		СбисДополнительныеПараметры = Новый Структура("ВызыватьРекурсивно, ИзменениеПользователя", Ложь, Ложь);
		Попытка
			
			ОбменВключен = ФормаГлавноеОкно.ОпределитьИнтеграциюРабочиеФормы(ФормаГлавноеОкно.Кэш, ПараметрыНовые, СбисДополнительныеПараметры);
			
		Исключение
			
			ОбменВключен = Ложь;
			
		КонецПопытки;
		
		Если НЕ	МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ОтложенныйЗапуск")
			И	ОбменВключен = Ложь Тогда
			
			Если СвойстваИзменены.Свойство("СпособОбмена") Тогда
				
				// Восстановим способ обмена обратно
				ПараметрыНовые.СпособОбмена = НастройкиПодключения_Было.СпособОбмена;
				ОбменВключен = ФормаГлавноеОкно.ОпределитьИнтеграциюРабочиеФормы(ФормаГлавноеОкно.Кэш, ПараметрыНовые, СбисДополнительныеПараметры);
				
			Иначе
				
				ВсеУспешлоИзменено = Ложь;
						
			КонецЕсли;

		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого КлючИЗначениеДанные Из ПараметрыНовые Цикл    
		
		Если КлючИЗначениеДанные.Значение = НастройкиПодключения_Завершение[КлючИЗначениеДанные.Ключ] Тогда
			
			Продолжить;
			
		КонецЕсли;
		ВсеУспешлоИзменено = Ложь;
		ТекстОшибкиДляПользователя = "Ошибка при сохранении новых значений настроек. Несохранённому параметру " + КлючИЗначениеДанные.Ключ + " возвращено предыдущее значение.";
		МодульОбъектаКлиент().ИзменитьПараметрСбис(КлючИЗначениеДанные.Ключ, КлючИЗначениеДанные.Значение);
		МодульОбъектаКлиент().СбисСообщить(Новый Структура("Текст, ФормаВладелец", ТекстОшибкиДляПользователя, ЭтаФорма));
		
	КонецЦикла;
	
	Если Не ВсеУспешлоИзменено Тогда
		
		//отмена закрытия формы, откат не изменных значений
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ПараметрыНовые, , "ПорядокАвтоматическогоСопоставления");
		НастройкиПодключения_Было = ПараметрыНовые;
		Отказ = Истина;
		ФормаЗакрытьУстановитьСтатусОтмена();
		
	Иначе
		
		Отказ = Ложь;
		
	КонецЕсли;
	
	Возврат ПарамерыИзменено;
	
КонецФункции

