
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

&НаКлиенте
Функция ПрочитатьДокумент(Кэш,Контекст) Экспорт
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПрочитатьДокумент","Документ_Шаблон", "",Кэш);
	ВсеВыгрузилось = фрм.ПрочитатьДокумент(Кэш,Контекст);
		
	// Формируем пакеты со счетами-фактурами поставщикам
	Если Кэш.ини.Свойство("СчетФактураВыданныйПоставщику") Тогда
		ТаблДокПоставщики = Контекст.ДокументДанные.мФайл.ОтчКмт.мТаблДок.Поставщики;
		НаимДокОтгр_ЭдоНакл	= Кэш.ОбщиеФункции.РассчитатьЗначение("НаимДокОтгр_ЭдоНакл",	Контекст.ДокументДанные.мФайл.ОтчКмт, Кэш);
		НаимДокОтгр_АктВР	= Кэш.ОбщиеФункции.РассчитатьЗначение("НаимДокОтгр_АктВР",		Контекст.ДокументДанные.мФайл.ОтчКмт, Кэш);
		Если НЕ ЗначениеЗаполнено(НаимДокОтгр_ЭдоНакл) Тогда 
			НаимДокОтгр_ЭдоНакл = "Товарная накладная";
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НаимДокОтгр_АктВР) Тогда 
			НаимДокОтгр_АктВР = "Акт";
		КонецЕсли;
		СписокСФ = Новый СписокЗначений();
		Для Каждого Стр Из ТаблДокПоставщики Цикл
			Если ЗначениеЗаполнено(Стр.ИсхСФ) Тогда
				Если СписокСФ.НайтиПоЗначению(Стр.ИсхСФ) <> Неопределено Тогда
					Продолжить;	
				КонецЕсли;
				СписокИдентификаторов = Новый СписокЗначений();
				Для Каждого Строка Из ТаблДокПоставщики Цикл
					Если Строка.ИсхСФ = Стр.ИсхСФ Тогда
						СписокИдентификаторов.Добавить(Строка.ТаблДок_Идентификатор);	
					КонецЕсли;
				КонецЦикла;
				ВходящийКонтекстРасчета = Новый Структура;
				ВходящийКонтекстРасчета.Вставить("УПД24", МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("УПД24"));
				ВходящийКонтекстРасчета.Вставить("РеквизитКодаНоменклатуры", МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("РеквизитКодаНоменклатуры"));
				ЗначениеИниСчетФактуры = Кэш.ФормаНастроек.Ини(Кэш, "СчетФактураВыданныйПоставщику");
				ЗначениеИниСчетФактуры.Вставить("Формат2016", Новый Структура("Значение,РассчитанноеЗначение", Истина, Истина));
				ЗначениеИниСчетФактуры.Вставить("Формат2019", Новый Структура("Значение,РассчитанноеЗначение", Истина, Истина));
				ЗначениеИниСчетФактуры.Вставить("ИспользоватьШтрихкодыНоменклатурыКонтрагентов",	Новый Структура("Значение,РассчитанноеЗначение", Кэш.Парам.ИспользоватьШтрихкодыНоменклатурыКонтрагентов, Кэш.Парам.ИспользоватьШтрихкодыНоменклатурыКонтрагентов));
				ЗначениеИниСчетФактуры.Вставить("ВходящийКонтекст", Новый Структура("Значение,РассчитанноеЗначение", "", ВходящийКонтекстРасчета));
				Контекст.Вставить("ДокументДанные", Кэш.ОбщиеФункции.ПолучитьДанныеДокумента1С(ЗначениеИниСчетФактуры, Стр.ИсхСФ, Кэш.КэшЗначенийИни, Кэш.Парам));  // alo Меркурий
				
				// Нужно выбрать только строки с товарами, у которых ключ строки совпадает с ключом текущей строки таб части Поставщики
				Товары = Новый Массив;
				КолТоваров = 0;
				УказанТипНоменклатуры = Ложь;
				Для Каждого Элемент Из Контекст.ДокументДанные.мФайл.СчФктр.мТаблДок.Товары Цикл
					Если СписокИдентификаторов.НайтиПоЗначению(Элемент.КлючСтроки)<>Неопределено Тогда	
						Товары.Добавить(Элемент);
						Если Элемент.Свойство("ТаблДок_Тип") Тогда
							УказанТипНоменклатуры = Истина;
							Если Элемент.ТаблДок_Тип = "1" Тогда
								КолТоваров = КолТоваров+1;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Если УказанТипНоменклатуры и КолТоваров=0 Тогда
					Если Контекст.ДокументДанные.мФайл.СчФктр.мСторона.Свойство("Грузополучатель") 
						и Контекст.ДокументДанные.мФайл.СчФктр.мСторона.Грузополучатель.Свойство("Роль") 
						и Контекст.ДокументДанные.мФайл.СчФктр.мСторона.Грузополучатель.Роль = "Грузополучатель" Тогда
						Контекст.ДокументДанные.мФайл.СчФктр.мСторона.Грузополучатель.Роль = "Организация";
						Если Контекст.ДокументДанные.мФайл.СчФктр.Отправитель_Роль = "Грузополучатель" Тогда
							Контекст.ДокументДанные.мФайл.СчФктр.Отправитель_Роль = "Организация";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				// >>> 5А
				ДокПодтвОтгр = Новый Массив;
				ДатаПоступления		= Кэш.ОбщиеФункции.РассчитатьЗначение("Основание_Дата",		Стр.мОснование.ПоступлениеПоставщика, Кэш);
				НомерПоступления	= Кэш.ОбщиеФункции.РассчитатьЗначение("Основание_Номер",	Стр.мОснование.ПоступлениеПоставщика, Кэш);
				Если НЕ УказанТипНоменклатуры					// Нет типа - ставим Товарную накладную
					ИЛИ КолТоваров = Товары.Количество() Тогда	// Только товары - Товарная накладная
					Основание = Новый Структура;
					Основание.Вставить("Основание_Дата",		ДатаПоступления);
					Основание.Вставить("Основание_Номер",		НомерПоступления);
					Основание.Вставить("Основание_Название",	"ДокПодтвОтгр");
					Основание.Вставить("Основание_НаимДокОтгр",	НаимДокОтгр_ЭдоНакл);
					ДокПодтвОтгр.Добавить(Основание);	
				ИначеЕсли НЕ КолТоваров Тогда					// Только Услуги - Акт
					Основание = Новый Структура;
					Основание.Вставить("Основание_Дата",		ДатаПоступления);
					Основание.Вставить("Основание_Номер",		НомерПоступления);
					Основание.Вставить("Основание_Название",	"ДокПодтвОтгр");
					Основание.Вставить("Основание_НаимДокОтгр",	НаимДокОтгр_АктВР);
					ДокПодтвОтгр.Добавить(Основание);
				Иначе 											// И товары и услуги - Акт и Товарная накладная
					ОснованиеЭдо = Новый Структура;
					ОснованиеАкт = Новый Структура;
					ОснованиеЭдо.Вставить("Основание_Дата",			ДатаПоступления);
					ОснованиеЭдо.Вставить("Основание_Номер",		НомерПоступления);
					ОснованиеЭдо.Вставить("Основание_Название",		"ДокПодтвОтгр");
					ОснованиеЭдо.Вставить("Основание_НаимДокОтгр",	НаимДокОтгр_ЭдоНакл);
					ОснованиеАкт.Вставить("Основание_Дата",			ДатаПоступления);
					ОснованиеАкт.Вставить("Основание_Номер",		НомерПоступления);
					ОснованиеАкт.Вставить("Основание_Название",		"ДокПодтвОтгр");
					ОснованиеАкт.Вставить("Основание_НаимДокОтгр",	НаимДокОтгр_АктВР);
					ДокПодтвОтгр.Добавить(ОснованиеЭдо);
					ДокПодтвОтгр.Добавить(ОснованиеАкт);
				КонецЕсли;
				Контекст.ДокументДанные.мФайл.СчФктр.мОснование.Вставить("ДокПодтвОтгр", ДокПодтвОтгр);
				// <<< 5А
				Кэш.КэшЗначенийИни.ТекущийПакет.Очистить();
				Контекст.ДокументДанные.мФайл.СчФктр.мТаблДок.Товары = Товары;
				Контекст.Вставить("СоставПакета",Новый Структура);
				Контекст.СоставПакета.Вставить("Вложение",Новый Массив);
				Контекст.Вставить("ФайлДанные", Новый Структура);
				Контекст.Вставить("Документ",  Стр.ИсхСФ);


				Для Каждого Файл Из Контекст.ДокументДанные.мФайл Цикл
					Файл = Файл.Значение;
					Контекст.ФайлДанные = Файл;
					Файл.Файл_Формат = Кэш.ОбщиеФункции.РассчитатьЗначение("Файл_Формат", Файл, Кэш);
					Файл_Формат = Файл.Файл_Формат;
					Файл_ВерсияФормата = СтрЗаменить(Файл.Файл_ВерсияФормата,".","_");
					фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПолучитьДанныеИзДокумента1С","Файл_Шаблон","Файл_Шаблон",Кэш);			
					Если Не фрм.ПолучитьДанныеИзДокумента1С(Кэш,Контекст) Тогда //если хотябы что-то не выгрузилось - отбой
						ВсеВыгрузилось = Ложь;
					КонецЕсли;
				КонецЦикла;
				ИмяДокумента = Кэш.ОбщиеФункции.ПолучитьРеквизитМетаданныхОбъекта(Контекст.Документ, "Имя");
				Контекст.СоставПакета.Вставить("ПользовательскийИдентификатор", ИмяДокумента+":"+строка(Контекст.Документ.УникальныйИдентификатор()));
				Контекст.МассивПакетов.Добавить(Контекст.СоставПакета);
				СписокСФ.Добавить(Стр.ИсхСФ); 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат ВсеВыгрузилось;
КонецФункции
&НаКлиенте
Функция ПрочитатьТабличнуюЧасть(Кэш,Контекст) Экспорт
	ВсеВыгрузилось = Истина;
	//Для Каждого Файл Из Контекст.ДокументДанные.мФайл Цикл
		Файл = Контекст.ДокументДанные.мФайл.АктВР;   // В СФ должна идти только табличная часть акта
		Контекст.ФайлДанные = Файл;
		Файл.Файл_Формат = Кэш.ОбщиеФункции.РассчитатьЗначение("Файл_Формат", Файл, Кэш);
		Файл_Формат = Файл.Файл_Формат;
		Файл_ВерсияФормата = СтрЗаменить(Файл.Файл_ВерсияФормата,".","_");
		фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПолучитьТабличнуюЧастьДокумента1С","Файл_"+Файл_Формат+"_"+Файл_ВерсияФормата,"Файл_Шаблон",Кэш);			
		фрм.ПолучитьТабличнуюЧастьДокумента1С(Кэш,Контекст);
	//КонецЦикла;
	Возврат ВсеВыгрузилось;
КонецФункции
