
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

&НаКлиенте
Процедура ОтправитьДокументы(Кэш,МассивСтрок) Экспорт
	
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ОтправитьДокументы","Документ_ОказаниеУслуг","Документ_Шаблон", Кэш);
	фрм.ОтправитьДокументы(Кэш,МассивСтрок);
	
КонецПроцедуры

&НаКлиенте
Функция ПрочитатьДокумент(Кэш,Контекст) Экспорт
	
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПрочитатьДокумент","Документ_ОказаниеУслуг","Документ_Шаблон", Кэш);
	Возврат фрм.ПрочитатьДокумент(Кэш,Контекст);
	
КонецФункции
&НаКлиенте
Функция ПолучитьТабличнуюЧастьДокумента1С(Кэш,Контекст) Экспорт 
	
	МассивМодулей = Новый Массив;
	МассивМодулей.Добавить("Документ_ОказаниеУслуг");
	МассивМодулей.Добавить("Документ_Шаблон");

	МодульДанныхСтроки = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ПолучитьТабличнуюЧастьДокумента1С", МассивМодулей);  
	
	Контекст.Вставить("СохранятьСсылки", Ложь);
	
	Возврат МодульДанныхСтроки.ПолучитьТабличнуюЧастьДокумента1С(Кэш, Контекст);
	
КонецФункции
&НаКлиенте
Функция ПрочитатьТабличнуюЧасть(Кэш,Контекст) Экспорт
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПрочитатьТабличнуюЧасть","Документ_ОказаниеУслуг","Документ_Шаблон",Кэш);
	Возврат фрм.ПрочитатьТабличнуюЧасть(Кэш,Контекст);
КонецФункции