
//DynamicDirective

// Функция - Проверка типа в упрощенном виде.
//
// Параметры:
//  ПрикладнойОбъектSABY	 - ПрикладнойОбъектSABY	 - Структура, с преопределенными полями
//  ТипПроверить		 - Строка				 - Имя типа SABY
// 
// Возвращаемое значение:
//  Произвольный - уданенное свойство класса
//
Функция ПрикладнойОбъектSABY_Выгрузить(ПрикладнойОбъектSABY, ФорматВыгрузкиОбъекта) Экспорт 

	Если Не ПрикладнойОбъектSABY_ЭтоТип(ПрикладнойОбъектSABY, "ПрикладнойОбъектSABY") Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	ФорматВыгрузкиТест = НРег(ФорматВыгрузкиОбъекта);
	
	Если ФорматВыгрузкиТест = "json" Тогда
		
		ПреобразоватьЗначениеВJSON(ПрикладнойОбъектSABY);
		
	КонецЕсли;
	
КонецФункции
	
//DynamicDirective

// Процедура - Базовый set-метод
//
// Параметры:
//  ПрикладнойОбъектSABY	 - ПрикладнойОбъектSABY	 - 
//  КлючДобавить		 - Строка				 - 
//  ЗначениеДобавить	 - Произвольный			 - 
//  ТипДобавить			 - Строка				 - Данные/Параметр/Тип
//
Процедура ПрикладнойОбъектSABY_Установить(ПрикладнойОбъектSABY, КлючДобавить = Неопределено, ЗначениеДобавить = Неопределено, ТипДобавить = Неопределено) Экспорт 

	Если Не ПрикладнойОбъектSABY_ЭтоТип(ПрикладнойОбъектSABY, "ПрикладнойОбъектSABY") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	КлючДляПроверки		= КлючДобавить;
	ИсточникПараметры	= Ложь;
	Если ТипЗнч(КлючДляПроверки) = Тип("Строка") Тогда
		
		КлючДляПроверки		= НРег(КлючДляПроверки);
		ИсточникПараметры	= Истина;
		
	КонецЕсли;
		
	ТипПроверить = НРег(ТипДобавить);
	Если		ТипПроверить = "параметр" Тогда
		
		ИсточникПараметры = Истина;
		
	ИначеЕсли	ТипПроверить = "тип" Тогда
		
		ПрикладнойОбъектSABY._тип = ЗначениеДобавить + Символы.ПС + ПрикладнойОбъектSABY._тип;
		Если ПрикладнойОбъектSABY.Свойство("_данные") Тогда
			
			ПрикладнойОбъектSABY._данные.Вставить(ЗначениеДобавить, НРег(ЗначениеДобавить));
			
		КонецЕсли;
		Возврат;
		
	ИначеЕсли	ТипПроверить = "ид" Тогда
		
		Если ЗначениеДобавить = "" Тогда
			
			ПрикладнойОбъектSABY._ид = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
			
		Иначе
			
			// Произвольный ИД. Пока без проверок.
			ПрикладнойОбъектSABY._ид = Новый УникальныйИдентификатор(ЗначениеДобавить);
			
		КонецЕсли;
		
		Возврат;

	КонецЕсли;
	
	Если ИсточникПараметры Тогда
	
		ПриемникЗначения = ПрикладнойОбъектSABY._параметры;
		
	Иначе
		
		ПриемникЗначения = ПрикладнойОбъектSABY._данные;
		
	КонецЕсли;
	
	ПриемникЗначения.Вставить(КлючДляПроверки, ЗначениеДобавить);
	
КонецПроцедуры

//DynamicDirective

// Функция - Базовый get-метод
//
// Параметры:
//  ПрикладнойОбъектSABY	 - ПрикладнойОбъектSABY	 - Структура, с преопределенными полями
//  КлючПолучить		 - Строка				 - Ключ свойства
//  ТипПолучить			 - Строка/Неопределено	 - Данные/Параметр/Тип/Ид
// 
// Возвращаемое значение:
//  Произвольный - свойство класса
//
Функция ПрикладнойОбъектSABY_Получить(ПрикладнойОбъектSABY, КлючПолучить = Неопределено, ТипПолучить = Неопределено) Экспорт 
    Перем РезультатПОлучить;
	
	Если Не ПрикладнойОбъектSABY_ЭтоТип(ПрикладнойОбъектSABY, "ПрикладнойОбъектSABY") Тогда
		
		ВызватьИсключение "Переданный объект не является типом SABY!";
		
	КонецЕсли;
	
	КлючДляПроверки		= КлючПолучить;
	ИсточникПараметры	= Ложь;
	Если ТипЗнч(КлючПолучить) = Тип("Строка") Тогда
		
		КлючДляПроверки		= НРег(КлючДляПроверки);
		ИсточникПараметры	= Истина;
		
	КонецЕсли;
	
	ТипПроверить = НРег(ТипПолучить);
	Если ТипПроверить = "параметр" Тогда
		
		ИсточникПараметры = Истина;
		
	ИначеЕсли ТипПроверить = "тип" Тогда
		
		Возврат ПрикладнойОбъектSABY._данные.Получить(СтрПолучитьСтроку(ПрикладнойОбъектSABY._тип, 1));
		
	ИначеЕсли ТипПроверить = "ид" Тогда
		
		Возврат ПрикладнойОбъектSABY._ид;

	КонецЕсли;
	
	Если ИсточникПараметры Тогда
		
		ПрикладнойОбъектSABY._параметры.Свойство(КлючПолучить, РезультатПОлучить);
		Возврат РезультатПОлучить;
		
	КонецЕсли;
	
	Возврат ПрикладнойОбъектSABY._данные.Получить(КлючПолучить);

КонецФункции	

//DynamicDirective

// Функция - Базовый pop-метод.
//
// Параметры:
//  ПрикладнойОбъектSABY	 - ПрикладнойОбъектSABY	 - Структура, с преопределенными полями
//  КлючУдалить			 - Строка				 - Ключ свойства
//  ТипУдалить			 - Строка/Неопределено	 - Данные/Параметр
// 
// Возвращаемое значение:
//  Произвольный - уданенное свойство класса
//
Функция ПрикладнойОбъектSABY_Очистить(ПрикладнойОбъектSABY, КлючУдалить, ТипУдалить = Неопределено) Экспорт 
	Перем РезультатПолучить;
	
	Если Не ПрикладнойОбъектSABY_ЭтоТип(ПрикладнойОбъектSABY, "ПрикладнойОбъектSABY") Тогда
		
		ВызватьИсключение "Переданный объект не является типом SABY!";
		
	КонецЕсли;
	
	КлючДляПроверки		= КлючУдалить;
	ИсточникПараметры	= Ложь;
	Если ТипЗнч(КлючДляПроверки) = Тип("Строка") Тогда
		
		КлючДляПроверки		= НРег(КлючДляПроверки);
		ИсточникПараметры	= Истина;
		
	КонецЕсли;
		
	Если НРег(ТипУдалить) = "параметр" Тогда
		
		ИсточникПараметры = Истина;
		
	КонецЕсли;
	
	Если ИсточникПараметры Тогда
		
		ПрикладнойОбъектSABY._параметры.Свойство(КлючДляПроверки, РезультатПОлучить);
		ПрикладнойОбъектSABY._параметры.Удалить(КлючУдалить);
		
		Возврат РезультатПОлучить;
		
	КонецЕсли;
	
	РезультатПолучить = ПрикладнойОбъектSABY._данные.Получить(КлючДляПроверки);
	ПрикладнойОбъектSABY._данные.Удалить(КлючДляПроверки);
	Возврат РезультатПолучить;

КонецФункции

//DynamicDirective

// Функция - Проверка типа в упрощенном виде.
//
// Параметры:
//  ПрикладнойОбъектSABY	 - ПрикладнойОбъектSABY	 - Структура, с преопределенными полями
//  ТипПроверить		 - Строка				 - Имя типа SABY
// 
// Возвращаемое значение:
//  Произвольный - уданенное свойство класса
//
Функция ПрикладнойОбъектSABY_ЭтоТип(ПрикладнойОбъектSABY, ТипПроверитьВх) Экспорт 
	Перем ТипОбъектаПроверка;
	
	Если	Не ТипЗнч(ПрикладнойОбъектSABY) = Тип("Структура")
		Или	Не ПрикладнойОбъектSABY.Свойство("_тип", ТипОбъектаПроверка) Тогда
		
		// Это не тип "объект"
		Возврат Ложь;
		
	КонецЕсли;

	// В случае наследования, тип класса будет многострочным от наследника к родителю
	Для НомерЧислоСтрок = 1 По СтрЧислоСтрок(ТипОбъектаПроверка) Цикл
		
		ЗначениеПроверка = СтрПолучитьСтроку(ТипОбъектаПроверка, НомерЧислоСтрок);
		Если	ЗначениеПроверка = ТипПроверитьВх
			Или	(	ПрикладнойОбъектSABY.Свойство("_данные")
				И	ПрикладнойОбъектSABY._данные.Получить(ЗначениеПроверка) = НРег(ТипПроверитьВх)) Тогда 
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

