&НаСервере
Процедура РасширенныйФункционалСопоставления_АвтоматическоеСопоставлениеНоменклатур(ПодготовленныеДанныеНоменклатур, ПараметрыПоиска, ДопПараметры) Экспорт
	
	ПараметрыСопоставленияПоРеквизитам = РасширенныйФункционалСопоставления_СопоставитьРеквизитыПоискаСМетаданными(ПараметрыПоиска);
	
	Если Не ПараметрыПоиска.ПорядокАвтоматическогоСопоставления.Найти("GTIN") = Неопределено Тогда
		РасширенныйФункционалСопоставления_ПоискНоменклатурыПоШтрихкодам(ПодготовленныеДанныеНоменклатур, ПараметрыПоиска, ДопПараметры);	
	КонецЕсли;
	Если ПараметрыСопоставленияПоРеквизитам.Количество() Тогда
		ПараметрыПоиска.Вставить("РеквизитыСправочника", ПараметрыСопоставленияПоРеквизитам);
		РасширенныйФункционалСопоставления_ПоискСопоставленийПоРеквизитамСправочника(ПодготовленныеДанныеНоменклатур, ПараметрыПоиска, ДопПараметры);
	КонецЕсли;
	
	РасширенныйФункционалСопоставления_ПоискСопоставленийПоДополнительнымСведениям(ПодготовленныеДанныеНоменклатур, ПараметрыПоиска, ДопПараметры);
	
КонецПроцедуры

&НаСервере
Функция РасширенныйФункционалСопоставления_СопоставитьРеквизитыПоискаСМетаданными(ПараметрыПоиска)
	
	ПорядокАвтоматическогоСопоставления = ПараметрыПоиска.ПорядокАвтоматическогоСопоставления;
	ИмяСправочникаНоменклатуры = ПараметрыПоиска.ИмяСправочникаНоменклатуры;
	
	ПустаяСсылкаОбъектаМетаданных = ПредопределенноеЗначение("Справочник." + ИмяСправочникаНоменклатуры + ".ПустаяСсылка");
	МетаданныеНоменклатуры = ПустаяСсылкаОбъектаМетаданных.Метаданные();
	
	ПараметрыСопоставленияПоРеквизитам = Новый Массив;
	
	Для Каждого ПараметрПоиска Из ПорядокАвтоматическогоСопоставления Цикл
		
		Если ПараметрыСопоставленияПоРеквизитам.Найти("Код") = Неопределено
			И (ПараметрПоиска = "КодПокупателя" ИЛИ ПараметрПоиска = "КодПоставщика" ИЛИ ПараметрПоиска = "Идентификатор"
				ИЛИ ПараметрПоиска = "Код") Тогда
			ПараметрыСопоставленияПоРеквизитам.Добавить("Код");
		КонецЕсли;
		
		Если НЕ МетаданныеНоменклатуры.Реквизиты.Найти(ПараметрПоиска) = Неопределено Тогда
			ПараметрыСопоставленияПоРеквизитам.Добавить(ПараметрПоиска);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПараметрыСопоставленияПоРеквизитам;
	
КонецФункции

&НаСервере
Процедура РасширенныйФункционалСопоставления_ПоискСопоставленийПоРеквизитамСправочника(ПодготовленныеДанныеНоменклатур, ПараметрыПоиска, ДопПараметры)
		
	РеквизитыСправочника = ПараметрыПоиска.РеквизитыСправочника;
	ИмяСправочникаНоменклатуры = ПараметрыПоиска.ИмяСправочникаНоменклатуры;
	ИмяРеквизитаЕдиницИзмерения = ПараметрыПоиска.ИмяРеквизитаЕдиницыИзмерения;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.%СПРНоменклатура% КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления
		|	И НЕ Номенклатура.ЭтоГруппа
		|	И Номенклатура.%ПараметрПоиска% = &ЗначениеПараметраПоиска
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка УБЫВ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%СПРНоменклатура%", ИмяСправочникаНоменклатуры);
	
	Для Каждого СтрокаНоменклатуры Из ПодготовленныеДанныеНоменклатур Цикл
		
		Если НЕ СтрокаНоменклатуры.НеобходимоАвтоматическоеСопоставление Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ПараметрПоиска Из РеквизитыСправочника Цикл
			
			ЗначениеПараметраПоиска = Неопределено;
			
			Если НЕ СтрокаНоменклатуры.НоменклатураСБИС.Свойство(ПараметрПоиска)
				ИЛИ (СтрокаНоменклатуры.НоменклатураСБИС.Свойство(ПараметрПоиска) И НЕ ЗначениеЗаполнено(СтрокаНоменклатуры.НоменклатураСБИС[ПараметрПоиска])) Тогда
				Продолжить;
			КонецЕсли;
			
			ЗначениеПараметраПоиска = СтрокаНоменклатуры.НоменклатураСБИС[ПараметрПоиска];
			Запрос.УстановитьПараметр("ЗначениеПараметраПоиска", ЗначениеПараметраПоиска);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ПараметрПоиска%", ПараметрПоиска);
			РезультатПоиска = Запрос.Выполнить();
			
			Если РезультатПоиска.Пустой() Тогда
				Продолжить;
			КонецЕсли;
			
			НайденнаяНоменклатура = РезультатПоиска.Выгрузить();
			
			СтрокаСопоставленияСБИССервер_Вставить(СтрокаНоменклатуры, "НеобходимоАвтоматическоеСопоставление", Ложь);
			СтрокаСопоставленияСБИССервер_Вставить(СтрокаНоменклатуры, "НеобходимоСопоставление", Истина);
			ОсновнаяНоменклатураНайдена = Ложь;
			
			Для Каждого Номенклатура1С Из НайденнаяНоменклатура Цикл
				ОписаниеНоменклатуры1С = НовыйОписаниеНоменклатуры1ССервер();
				
				ВходящиеДанные = Новый Структура("Источник", Номенклатура1С.Ссылка[ИмяРеквизитаЕдиницИзмерения]);
				ДопПараметры = Новый Структура("ТипИсточника", "Ссылка");
				СтруктураЕдиницы = НовыйСопоставлениеДляЕдиницыСервер(ВходящиеДанные, ДопПараметры);
				СопоставлениеДляЕдиницыСервер_Вставить(СтруктураЕдиницы, "Владелец", Номенклатура1С.Ссылка);
				ОписаниеНоменклатуры1ССервер_Вставить(ОписаниеНоменклатуры1С, "Единица", СтруктураЕдиницы);
				
				Если НЕ ОсновнаяНоменклатураНайдена Тогда
					ОписаниеНоменклатуры1ССервер_Вставить(ОписаниеНоменклатуры1С, "Основное", Истина);
					ОсновнаяНоменклатураНайдена = Истина;
				КонецЕсли;
				
				СтрокаНоменклатуры.Номенклатура1С.Вставить(Номенклатура1С.Ссылка, ОписаниеНоменклатуры1С);
				СтрокаНоменклатуры.НоменклатураСБИС.Вставить("СопоставленоАвтоматически", Истина);
				
				РасширенныйФункционалСопоставления_ВалидацияАвтоматическогоСопоставления(СтрокаНоменклатуры, ПараметрыПоиска);
				
			КонецЦикла;
			
			Прервать;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РасширенныйФункционалСопоставления_ПоискСопоставленийПоДополнительнымСведениям(ПодготовленныеДанныеНоменклатур, ПараметрыПоиска, ДопПараметры)
	
	ПорядокАвтоматическогоСопоставления = ПараметрыПоиска.ПорядокАвтоматическогоСопоставления;
	ИмяСправочникаНоменклатуры = ПараметрыПоиска.ИмяСправочникаНоменклатуры;
	ИмяРегистраДопСведений = ПараметрыПоиска.ИмяРегистраДополнительныхСведений;
	ИмяРеквизитаЕдиницИзмерения = ПараметрыПоиска.ИмяРеквизитаЕдиницыИзмерения;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.%ИмяРегистраДопСведений% КАК ДополнительныеСведения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.%СПРНоменклатура% КАК Номенклатура
		|		ПО (ДополнительныеСведения.Объект = Номенклатура.Ссылка)
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления
		|	И ДополнительныеСведения.Свойство.Наименование = &ПараметрПоиска
		|	И ДополнительныеСведения.Значение = &ЗначениеПараметраПоиска
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка УБЫВ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%СПРНоменклатура%", ИмяСправочникаНоменклатуры);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяРегистраДопСведений%", ИмяРегистраДопСведений);
	
	Для Каждого СтрокаНоменклатуры Из ПодготовленныеДанныеНоменклатур Цикл
		
		Если НЕ СтрокаНоменклатуры.НеобходимоАвтоматическоеСопоставление Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ПараметрПоиска Из ПорядокАвтоматическогоСопоставления Цикл
			
			Если ПараметрПоиска = "GTIN" Тогда 
				Продолжить;
			КонецЕсли;
			
			ЗначениеПараметраПоиска = Неопределено;
			
			Если НЕ СтрокаНоменклатуры.НоменклатураСБИС.Свойство(ПараметрПоиска)
				ИЛИ (СтрокаНоменклатуры.НоменклатураСБИС.Свойство(ПараметрПоиска) И НЕ ЗначениеЗаполнено(СтрокаНоменклатуры.НоменклатураСБИС[ПараметрПоиска])) Тогда
				Продолжить;
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ПараметрПоиска", ПараметрПоиска);
			
			ЗначениеПараметраПоиска = СтрокаНоменклатуры.НоменклатураСБИС[ПараметрПоиска];
			Запрос.УстановитьПараметр("ЗначениеПараметраПоиска", ЗначениеПараметраПоиска);
			РезультатПоиска = Запрос.Выполнить();
			
			Если РезультатПоиска.Пустой() Тогда
				Продолжить;
			КонецЕсли;
			
			НайденнаяНоменклатура = РезультатПоиска.Выгрузить();
			
			СтрокаСопоставленияСБИССервер_Вставить(СтрокаНоменклатуры, "НеобходимоАвтоматическоеСопоставление", Ложь);
			СтрокаСопоставленияСБИССервер_Вставить(СтрокаНоменклатуры, "НеобходимоСопоставление", Истина);
			ОсновнаяНоменклатураНайдена = Ложь;
			
			Для Каждого Номенклатура1С Из НайденнаяНоменклатура Цикл
				ОписаниеНоменклатуры1С = НовыйОписаниеНоменклатуры1ССервер();
				
				ВходящиеДанные = Новый Структура("Источник", Номенклатура1С.Ссылка[ИмяРеквизитаЕдиницИзмерения]);
				ДопПараметры = Новый Структура("ТипИсточника", "Ссылка");
				СтруктураЕдиницы = НовыйСопоставлениеДляЕдиницыСервер(ВходящиеДанные, ДопПараметры);
				СопоставлениеДляЕдиницыСервер_Вставить(СтруктураЕдиницы, "Владелец", Номенклатура1С.Ссылка);
				ОписаниеНоменклатуры1ССервер_Вставить(ОписаниеНоменклатуры1С, "Единица", СтруктураЕдиницы);
				
				Если НЕ ОсновнаяНоменклатураНайдена Тогда
					ОписаниеНоменклатуры1ССервер_Вставить(ОписаниеНоменклатуры1С, "Основное", Истина);
					ОсновнаяНоменклатураНайдена = Истина;
				КонецЕсли;
				
				СтрокаНоменклатуры.Номенклатура1С.Вставить(Номенклатура1С.Ссылка, ОписаниеНоменклатуры1С);
				СтрокаНоменклатуры.НоменклатураСБИС.Вставить("СопоставленоАвтоматически", Истина);
				
				РасширенныйФункционалСопоставления_ВалидацияАвтоматическогоСопоставления(СтрокаНоменклатуры, ПараметрыПоиска);
				
			КонецЦикла;
			
			Прервать;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РасширенныйФункционалСопоставления_ПоискНоменклатурыПоШтрихкодам(ПодготовленныеДанныеНоменклатур, ПараметрыПоиска, ДопПараметры)
	
	ОписаниеМетаданныхШтрихкодов = ДопПараметры.ОписаниеМетаданныхШтрихкодов;
	
	Если ОписаниеМетаданныхШтрихкодов = Неопределено 
		ИЛИ НЕ ОписаниеМетаданныхШтрихкодов.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ТипМетаданныхШтрихкодов = ОписаниеМетаданныхШтрихкодов.ТипМетаданныхШтрихкоды;
	ИмяМетаданныхШтрихкодов = ОписаниеМетаданныхШтрихкодов.ИмяМетаданныхШтрихкоды;
	ИмяМетаданныхРеквизитШтрихкод = ОписаниеМетаданныхШтрихкодов.ИмяМетаданныхРеквизитШтрихкод;
	ИмяМетаданныхРеквизитНоменклатура = ОписаниеМетаданныхШтрихкодов.ИмяМетаданныхРеквизитНоменклатура;
	
	ИмяРеквизитаЕдиницИзмерения = ПараметрыПоиска.ИмяРеквизитаЕдиницыИзмерения;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыНоменклатуры.%ИмяМетаданныхРеквизитНоменклатура% КАК Ссылка
	|ИЗ
	|	%ТипМетаданныхШтрихкодов%.%ИмяМетаданныхШтрихкодов% КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.%ИмяМетаданныхРеквизитШтрихкод% = &ЗначениеШтрихкода
	|
	|УПОРЯДОЧИТЬ ПО
	|	%ИмяМетаданныхРеквизитНоменклатура% УБЫВ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТипМетаданныхШтрихкодов%", ТипМетаданныхШтрихкодов);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяМетаданныхШтрихкодов%", ИмяМетаданныхШтрихкодов);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяМетаданныхРеквизитШтрихкод%", ИмяМетаданныхРеквизитШтрихкод);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяМетаданныхРеквизитНоменклатура%", ИмяМетаданныхРеквизитНоменклатура);
	
	Для Каждого СтрокаНоменклатуры Из ПодготовленныеДанныеНоменклатур Цикл
		
		Если НЕ СтрокаНоменклатуры.НеобходимоАвтоматическоеСопоставление Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеШтрихкода = Неопределено;
		
		Если НЕ СтрокаНоменклатуры.НоменклатураСБИС.Свойство("GTIN")
			ИЛИ (СтрокаНоменклатуры.НоменклатураСБИС.Свойство("GTIN") И НЕ ЗначениеЗаполнено(СтрокаНоменклатуры.НоменклатураСБИС.GTIN)) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеШтрихкода = СтрокаНоменклатуры.НоменклатураСБИС.GTIN;
		Запрос.УстановитьПараметр("ЗначениеШтрихкода", ЗначениеШтрихкода);
		РезультатПоиска = Запрос.Выполнить();
		
		Если РезультатПоиска.Пустой() Тогда
			Продолжить;
		КонецЕсли;
		
		НайденнаяНоменклатура = РезультатПоиска.Выгрузить();
		
		СтрокаСопоставленияСБИССервер_Вставить(СтрокаНоменклатуры, "НеобходимоАвтоматическоеСопоставление", Ложь);
		СтрокаСопоставленияСБИССервер_Вставить(СтрокаНоменклатуры, "НеобходимоСопоставление", Истина);
		ОсновнаяНоменклатураНайдена = Ложь;
		
		Для Каждого Номенклатура1С Из НайденнаяНоменклатура Цикл
			ОписаниеНоменклатуры1С = НовыйОписаниеНоменклатуры1ССервер();
			
			ВходящиеДанные = Новый Структура("Источник", Номенклатура1С.Ссылка[ИмяРеквизитаЕдиницИзмерения]);
			ДопПараметры = Новый Структура("ТипИсточника", "Ссылка");
			СтруктураЕдиницы = НовыйСопоставлениеДляЕдиницыСервер(ВходящиеДанные, ДопПараметры);
			СопоставлениеДляЕдиницыСервер_Вставить(СтруктураЕдиницы, "Владелец", Номенклатура1С.Ссылка);
			ОписаниеНоменклатуры1ССервер_Вставить(ОписаниеНоменклатуры1С, "Единица", СтруктураЕдиницы);
			
			Если НЕ ОсновнаяНоменклатураНайдена Тогда
				ОписаниеНоменклатуры1ССервер_Вставить(ОписаниеНоменклатуры1С, "Основное", Истина);
				ОсновнаяНоменклатураНайдена = Истина;
			КонецЕсли;
			
			СтрокаНоменклатуры.Номенклатура1С.Вставить(Номенклатура1С.Ссылка, ОписаниеНоменклатуры1С);
			СтрокаНоменклатуры.НоменклатураСБИС.Вставить("СопоставленоАвтоматически", Истина);
			
			РасширенныйФункционалСопоставления_ВалидацияАвтоматическогоСопоставления(СтрокаНоменклатуры, ПараметрыПоиска);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РасширенныйФункционалСопоставления_ВалидацияАвтоматическогоСопоставления(КлассНоменклатуры, ПараметрыПоиска)
	
	Для Каждого Номенклатура1С Из КлассНоменклатуры.Номенклатура1С Цикл
		Единицы1С = ОписаниеНоменклатуры1ССервер_Получить(Номенклатура1С.Значение, "Единицы");
		ЕдиницаТекущейНоменклатуры = Единицы1С.Получить(Номенклатура1С.Ключ[ПараметрыПоиска.ИмяРеквизитаЕдиницыИзмерения]);
		ОКЕИЕдиницы1С = СопоставлениеДляЕдиницыСервер_Получить(ЕдиницаТекущейНоменклатуры, "ОКЕИ");
		Ссылка1С = Номенклатура1С.Ключ;
		Прервать;
	КонецЦикла;
	
	ЕдиницыСБИС = СтрокаСопоставленияСБИССервер_Получить(КлассНоменклатуры, "Единицы");
	Для Каждого Единица Из ЕдиницыСБИС Цикл
		ОКЕИЕдиницыСБИС = Единица.Значение.ОКЕИ;
		Прервать;
	КонецЦикла;
	
	ОКЕИЕдиницы1С = СтрЗаменить(ОКЕИЕдиницы1С, " ", "");
	ОКЕИЕдиницыСБИС = СтрЗаменить(ОКЕИЕдиницыСБИС, " ", "");
	
	Если НЕ ОКЕИЕдиницы1С = ОКЕИЕдиницыСБИС Тогда
		СтрокаСопоставленияСБИССервер_Вставить(КлассНоменклатуры, "АвтоматическоеСопоставлениеПровалено", Истина);
		КлассНоменклатуры.Номенклатура1С.Удалить(Ссылка1С);
	КонецЕсли;
	
КонецПроцедуры


