
// Формирует структуру установленных файлов настроек	
&НаСервере
Функция яДанныеИниПоПараметрам(Знач ПараметрыДляФормирования, ДопПараметры)
	
	Ини = Новый Структура;
	
	Для Каждого ИниФайл Из ПараметрыДляФормирования.ИниФайлы Цикл
		
		Если ТипЗнч(ИниФайл) = Тип("КлючИЗначение") Тогда
			
			ИниФайл = ИниФайл.Значение;
			
		КонецЕсли;
		
		Попытка
			
			Если	Не	ДопПараметры.ЧтениеПоТребованию
				Или		ИниФайл.Ини_ИмяИни = "Конфигурация" Тогда
				
				//Файл конфигурации в любом случае понадобится, поэтому всё равно читаем его, даже с отключенными данными.
				Ини.Вставить(ИмяИниИзИмениФайла(ИниФайл.ИмяФайла), яНовыйПрочитаннаяИниСДаннымиПоФайлу(ИниФайл, ДопПараметры));
				
			ИначеЕсли ЗначениеЗаполнено(ИниФайл.ИмяФайла) Тогда
				
				Ини.Вставить(ИмяИниИзИмениФайла(ИниФайл.ИмяФайла), Неопределено);
				
			ИначеЕсли ИниФайл.ЕстьИзменения Тогда//Целиком пользовательская инишка
				
				Ини.Вставить(ИмяИниИзИмениФайла(ИниФайл.ИмяФайлаКлиента), Неопределено);
				
			КонецЕсли;
			
		Исключение
			
			ИнфоОбОшибке = ИнформацияОбОшибке();
			СбисИсключение = МодульОбъектаСервер().НовыйСбисИсключение(ИнфоОбОшибке,
							"ФайлыНастроекКаталог.СбисОпределитьНеобходимостьПроверки", 747201,,
							"В каталоге настроек задано неправильное имя файла: """	+ ИниФайл.Имяфайла + """.
							|Возможные причины: лишние пробелы, недопустимые символы или некорректный формат." +
							"Исправьте имя файла и повторите попытку.");
			
			ВызватьИсключение МодульОбъектаСервер().СбисИсключение_ВСтроку(СбисИсключение);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Ини;
	
КонецФункции

// формирует структуру файла настроек и кладет ее в структуру ини под указанным именем 
//(имя ини отличается от имени файла в случае, если указана ссылка на базовый файл настроек)
&НаСервере
Процедура яЗаполнитьСтруктуруИниПоФайлу(СтруктураИниФайла, Путь, ИмяФайла)
	
	ТаблицаОшибок = Новый Массив();
	
	ПолноеИмяФайла = Путь + ИмяФайла;
	
	Попытка
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ПолноеИмяФайла);
		ПостроительDOM = Новый ПостроительDOM; 
		ДокументДОМ = ПостроительDOM.Прочитать(ЧтениеXML);
		ЗаписатьДОМВСтруктуру(ДокументДОМ.ПервыйДочерний.ПервыйДочерний, СтруктураИниФайла, ТаблицаОшибок);	
		ЧтениеXML.Закрыть();
		
	Исключение
		
		НоваяОшибка = Новый Структура();
		НоваяОшибка.Вставить("ИмяПараметра", "Файл настройки");
		НоваяОшибка.Вставить("ЗначениеПараметра", ИмяФайла);
		НоваяОшибка.Вставить("ТекстОшибки","Не удалось открыть файл, либо невалидный xml. "+ОписаниеОшибки());
		НоваяОшибка.Вставить("ИнформацияПоОбъекту","");
		НоваяОшибка.Вставить("ИмяОбъекта","");
		НоваяОшибка.Вставить("ПолныйПуть", ПолноеИмяФайла);
		ТаблицаОшибок.Добавить(НоваяОшибка);
		
	КонецПопытки;
	
	СтруктураИниФайла.Вставить("сбисОшибки",ТаблицаОшибок);
	СтруктураИниФайла.Вставить("сбисПолноеИмяФайла",ПолноеИмяФайла);
	СтруктураИниФайла.Вставить("сбисИмяФайла",ИмяФайла);
	
КонецПроцедуры

&НаСервере
Функция яНовыйПрочитаннаяИниСДаннымиПоФайлу(сбисОписаниеФайла, ДопПараметры)	
	
	РезультатИни = Новый Структура;
	
	яЗаполнитьСтруктуруИниПоФайлу(РезультатИни, сбисОписаниеФайла.ПутьДоИниФайла, сбисОписаниеФайла.ИмяФайла);  //получили структуру типового ини файла (.saby.ini)
	
	Если	ДопПараметры.ВключеныДоработки
		И	сбисОписаниеФайла.ЕстьИзменения Тогда
		
		яЗаполнитьСтруктуруИниПоФайлу(РезультатИни, сбисОписаниеФайла.ПутьДоИниФайла, сбисОписаниеФайла.ИмяФайлаКлиента); //получили структуру ини файла клиента и заменили его элементами
		
	КонецЕсли;
	
	Возврат РезультатИни
	
КонецФункции

