
// Формирует структуру установленных файлов настроек	
&НаСервере
Функция яДанныеИниПоПараметрам(Знач ПараметрыДляФормирования, ДопПараметры)
	
	Ини = Новый Структура;
	
	Для Каждого ИниФайл Из ПараметрыДляФормирования.ИниФайлы Цикл
		
		Если ТипЗнч(ИниФайл) = Тип("КлючИЗначение") Тогда
			
			ИниФайл = ИниФайл.Значение;
			
		КонецЕсли;
		
		Попытка
			
			Если	Не	ДопПараметры.ЧтениеПоТребованию
				Или	Не	ДопПараметры.ВключеныДоработки
				Или		ИниФайл.Ини_ИмяИни = "Конфигурация" Тогда
				
				//Файл конфигурации в любом случае понадобится, поэтому всё равно читаем его, даже с отключенными данными.
				Ини.Вставить(ИмяИниИзИмениФайла(ИниФайл.ИмяФайла), яНовыйПрочитаннаяИниСДаннымиПоФайлу(ИниФайл, ДопПараметры));
				
			ИначеЕсли ЗначениеЗаполнено(ИниФайл.ИмяФайла) Тогда
				
				Ини.Вставить(ИмяИниИзИмениФайла(ИниФайл.ИмяФайла), Неопределено);
				
			ИначеЕсли ИниФайл.ЕстьИзменения Тогда//Целиком пользовательская инишка
				
				Ини.Вставить(ИмяИниИзИмениФайла(ИниФайл.ИмяФайлаКлиента), Неопределено);
				
			КонецЕсли;
			
		Исключение
			
			ИнфоОбОшибке = ИнформацияОбОшибке();
			СбисИсключение = МодульОбъектаСервер().НовыйСбисИсключение(ИнфоОбОшибке,
							"ФайлыНастроекКаталог.СбисОпределитьНеобходимостьПроверки", 747201,,
							"В каталоге настроек задано неправильное имя файла: """	+ ИниФайл.Имяфайла + """.
							|Возможные причины: лишние пробелы, недопустимые символы или некорректный формат." +
							"Исправьте имя файла и повторите попытку.");
			
			ВызватьИсключение МодульОбъектаСервер().СбисИсключение_ВСтроку(СбисИсключение);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Ини;
	
КонецФункции

// формирует структуру файла настроек и кладет ее в структуру ини под указанным именем 
//(имя ини отличается от имени файла в случае, если указана ссылка на базовый файл настроек)
&НаСервере
Процедура яЗаполнитьСтруктуруИниПоФайлу(СтруктураИниФайла, Путь, ИмяФайла)
	
	ТаблицаОшибок = Новый Массив();
	
	ПолноеИмяФайла = Путь + ИмяФайла;
	
	Попытка
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ПолноеИмяФайла);
		ПостроительDOM = Новый ПостроительDOM; 
		ДокументДОМ = ПостроительDOM.Прочитать(ЧтениеXML);
		ЗаписатьДОМВСтруктуру(ДокументДОМ.ПервыйДочерний.ПервыйДочерний, СтруктураИниФайла, ТаблицаОшибок);	
		ЧтениеXML.Закрыть();
		
	Исключение
		
		НоваяОшибка = Новый Структура();
		НоваяОшибка.Вставить("ИмяПараметра", "Файл настройки");
		НоваяОшибка.Вставить("ЗначениеПараметра", ИмяФайла);
		НоваяОшибка.Вставить("ТекстОшибки","Не удалось открыть файл, либо невалидный xml. "+ОписаниеОшибки());
		НоваяОшибка.Вставить("ИнформацияПоОбъекту","");
		НоваяОшибка.Вставить("ИмяОбъекта","");
		НоваяОшибка.Вставить("ПолныйПуть", ПолноеИмяФайла);
		ТаблицаОшибок.Добавить(НоваяОшибка);
		
	КонецПопытки;
	
	СтруктураИниФайла.Вставить("сбисОшибки",ТаблицаОшибок);
	СтруктураИниФайла.Вставить("сбисПолноеИмяФайла",ПолноеИмяФайла);
	СтруктураИниФайла.Вставить("сбисИмяФайла",ИмяФайла);
	
КонецПроцедуры

&НаСервере
Функция яНовыйПрочитаннаяИниСДаннымиПоФайлу(сбисОписаниеФайла, ДопПараметры)	
	
	РезультатИни = Новый Структура;
	
	яЗаполнитьСтруктуруИниПоФайлу(РезультатИни, сбисОписаниеФайла.ПутьДоИниФайла, сбисОписаниеФайла.ИмяФайла);  //получили структуру типового ини файла (.saby.ini)
	
	Если	ДопПараметры.ВключеныДоработки
		И	сбисОписаниеФайла.ЕстьИзменения Тогда
		
		яЗаполнитьСтруктуруИниПоФайлу(РезультатИни, сбисОписаниеФайла.ПутьДоИниФайла, сбисОписаниеФайла.ИмяФайлаКлиента); //получили структуру ини файла клиента и заменили его элементами
		
	КонецЕсли;
	
	Возврат РезультатИни
	
КонецФункции

&НаСервере
Процедура яПараметрыSaby_ЗаписатьСервер(Знач СтруктураПараметровЗаписать, Знач ПараметрыДляЗаписать)
	Перем СтруктураПользовательскихПараметров, ПараметрыТекущегоПользователя;
	
	КаталогНастроек					= ПараметрыДляЗаписать.КаталогПараметров;
	КлючПользовательскихПараметров	= ПараметрыДляЗаписать.КлючПользовательскихПараметров;
	ПараметрыДляПользователя		= яНаборПараметровТолькоПользователя();
	ОбщаяСтруктура					= ПолучитьПараметрыСБИСНаСервере(КаталогНастроек);
	
	Если Не ОбщаяСтруктура.Свойство("ПараметрыПользователей", СтруктураПользовательскихПараметров) Тогда
		
		СтруктураПользовательскихПараметров = Новый Структура;
		ОбщаяСтруктура.Вставить("ПараметрыПользователей", СтруктураПользовательскихПараметров);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючПользовательскихПараметров) Тогда
		
		Если Не СтруктураПользовательскихПараметров.Свойство(КлючПользовательскихПараметров, ПараметрыТекущегоПользователя) Тогда
			
			ПараметрыТекущегоПользователя = Новый Структура;
			СтруктураПользовательскихПараметров.Вставить(КлючПользовательскихПараметров, ПараметрыТекущегоПользователя)
				
		КонецЕсли;
		
	Иначе
		
		// Ключа нет, заполнение идет в общий котел
		ПараметрыТекущегоПользователя = СтруктураПользовательскихПараметров;
		
	КонецЕсли;
	
	Для Каждого Элемент Из СтруктураПараметровЗаписать Цикл
		
		Если Найти(ПараметрыДляПользователя, "," + Элемент.Ключ + ",") Тогда
			
			ПараметрыТекущегоПользователя.Вставить(Элемент.Ключ, Элемент.Значение);
			
		Иначе
			
			ОбщаяСтруктура.Вставить(Элемент.Ключ, Элемент.Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ШаблонXML = ПолучитьXMLСПростымиЭлементами(Новый Структура("Параметры", ОбщаяСтруктура));
	ИсхФайл = Новый ТекстовыйДокумент;
	ИсхФайл.УстановитьТекст(ШаблонXML);
	ИсхФайл.Записать(КаталогНастроек+"сбисПараметры.xml", "windows-1251");		
	
КонецПроцедуры

&НаСервере
Функция яПараметрыSaby_ПрочитатьСервер(Знач ПараметрыДляПрочитать)
	Перем СтруктураПользовательскихПараметров, ПараметрыТекущегоПользователя, СтруктураПараметровОбогатить;

	КаталогНастроек					= ПараметрыДляПрочитать.КаталогПараметров;
	КлючПользовательскихПараметров	= ПараметрыДляПрочитать.КлючПользовательскихПараметров;
	ПараметрыДляПользователя		= яНаборПараметровТолькоПользователя();
	
	СтруктураПараметров = ПолучитьПараметрыСБИСНаСервере(КаталогНастроек);
	
	Если СтруктураПараметров.Свойство("ПараметрыПользователей", СтруктураПользовательскихПараметров) Тогда
		
		СтруктураПараметров.Удалить("ПараметрыПользователей");
		Если ЗначениеЗаполнено(КлючПользовательскихПараметров) Тогда
			
			СтруктураПользовательскихПараметров.Свойство(КлючПользовательскихПараметров, ПараметрыТекущегоПользователя);
			
		Иначе
			
			ПараметрыТекущегоПользователя = СтруктураПользовательскихПараметров;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПараметрыТекущегоПользователя) Тогда
			
			Для Каждого КлючИЗначение Из ПараметрыТекущегоПользователя Цикл
				
				Если Найти(ПараметрыДляПользователя, "," + КлючИЗначение.Ключ + ",") Тогда
					
					СтруктураПараметров.Вставить(КлючИЗначение.Ключ,  КлючИЗначение.Значение);
					
				КонецЕсли;	
					
			КонецЦикла;
				
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция яНаборПараметровТолькоПользователя()
	
	Возврат ",DisableCustomAlgorithms,";
	
КонецФункции
	
