
&НаКлиенте
Функция яНаборПакетов_СгенерироватьИсходящиеДокументы(НаборПакетов, ДопПараметры = Неопределено) Экспорт
	Перем ОснованиеДляПакета;
	
	ПрочитанныеПакеты		= НаборПакетов_Получить(НаборПакетов, "ПрочитанныеПакеты");
	ОснованиеСсылка			= НаборПакетов_Получить(НаборПакетов, "ОснованиеСсылка");
	ИмяИниПакетов			= НаборПакетов_Получить(НаборПакетов, "ИмяИни");
	
	РезультатГенерации		= Новый Массив;
	
	ПараметрыДляГенерацииСоставПакета = НаборПакетов_Выгрузить(НаборПакетов, "ПараметрыСоставПакета");
	Для Каждого Пакет Из ПрочитанныеПакеты Цикл
		
		Если Пакет.Свойство("Ошибка", ОснованиеДляПакета) Тогда
			
			Пакет.Вставить("Документ1С", ОснованиеСсылка);
			РезультатГенерации.Добавить(Пакет);
			Продолжить;
			
		КонецЕсли;
		
		Попытка
			
			// Получаем документ, наполненный сырыми вложениями.
			ПолныйСоставПакета = НовыйСоставПакета(Пакет, ПараметрыДляГенерацииСоставПакета);
			
			// Настроить документ и перегенерировать вложения (объединить, сделать вызов генератора)
			СоставПакета_Обновить(ПолныйСоставПакета, "ПерегенерироватьВложения","1С");
			
		Исключение
			
			ОшибкаФормирования = НовыйСбисИсключение(	ИнформацияОбОшибке(),
														МодульОбъектаКлиентСервер_Представление() + "НаборПакетов.СгенерироватьИсходящиеДокументы");
			ПолныйСоставПакета = Новый Структура("Документ1С, Ошибка", ОснованиеСсылка, ОшибкаФормирования);
			
		КонецПопытки;
		
		СписокФорм = Новый Массив;
		СписокФорм.Добавить("Документ_" + ИмяИниПакетов);
		СписокФорм.Добавить("Документ_Шаблон");
		ТочкаВходаВФК = ПользовательскаяТочкаВхода("СбисПослеФормированияПакетаДокументов", СписокФорм, ПолучитьТекущийЛокальныйКэш());
		Если Не ТочкаВходаВФК = Неопределено Тогда
			
			ПолныйСоставПакета = ВызватьПользовательскуюТочкуВхода(ТочкаВходаВФК, ПолныйСоставПакета);
			
		КонецЕсли;
			
		РезультатГенерации.Добавить(ПолныйСоставПакета);

	КонецЦикла;
	
	Возврат РезультатГенерации;
	
КонецФункции

