
&НаКлиенте
Функция НаборПакетов_СоответствиеДанных(НаборПакетов) Экспорт
	
	СоответствиеДокументДанные = Новый Соответствие;
	
	ФормаНастройки = ПараметрSABY("МодульУправленияНастройками", "Сеанс");
	Для Каждого Элемент Из НаборПакетов.Данные.ФорматныеФайлы Цикл		
		
		Документ				= Элемент.Значение;
		ИниДокумента			= Элемент.Представление;
		ЗначениеИниДокумента	= НаборПакетов.Данные.ПодготовленРасчет.Получить(Документ);
		
		Если ЗначениеИниДокумента = Неопределено Тогда
			
			ИниДокумента			= Элемент.Представление;
			ЗначениеИниДокумента	= ИниПоПараметрам(ИниДокумента);
			
			Если ЗначениеИниДокумента = Неопределено Тогда
				
				ОшибкаЧтениеПакета = НовыйСбисИсключение(, "МодульОбъектаКлиент.НаборПакетов.СоответствиеДанных", 747,,
					"Отсутствует ини файл: " + ИниДокумента,
					Новый Структура("Ини", ИниДокумента));
				ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаЧтениеПакета);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ФормаНастройки.Ини_ЗаполнитьПараметрыПередРасчетом(ЗначениеИниДокумента);

		ИдентификаторДокумента = СбисИдентификаторДокумента1С(Документ, ИниДокумента);
		
		СоответствиеДокументДанные.Вставить(ИдентификаторДокумента, Новый Структура("ИмяИни, ДокументДанные",ИниДокумента, ЗначениеИниДокумента));
		
	КонецЦикла;
	
	Возврат СоответствиеДокументДанные;
	
КонецФункции

