
&НаКлиенте
Процедура НаборПакетов_Вставить(НаборПакетов, ЗначениеВставить, КлючВставить) Экспорт
	
	Кэш = ПолучитьТекущийЛокальныйКэш();
	
	Если КлючВставить = "СоставПакета1С" Тогда
		
		Если НаборПакетов.Данные.СоставПакета1С = Неопределено Тогда
			
			НаборПакетов.Данные.СоставПакета1С = Новый СписокЗначений;
			
		КонецЕсли;
		
		Для Каждого Элемент Из ЗначениеВставить Цикл		
			
			Документ = Элемент.Значение;
			
			Если НЕ ЗначениеЗаполнено(Документ) Тогда
				
				Продолжить;
				
			ИначеЕсли ТипЗнч(Документ) = Тип("Строка") Тогда
				
				//Ссылка на внешний файл
				НаборПакетов.Данные.ВнешниеФайлы.Добавить(Документ);
				НаборПакетов.Данные.СоставПакета1С.Добавить(Документ);
				Продолжить;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Элемент.Представление) Тогда
				
				// Указано явно на СоставПакета
				ИмяИниДокумента = Элемент.Представление
				
			Иначе
				
				// Проверить над реестром - если есть.
				ИмяИниНабора	= НаборПакетов.Параметры.ИмяИни;
				ТипДляПроверки	= СсылочныйТипСтрокой(ТипЗнч(Документ), "Кратко");
				Если ИмяИниНабора = ТипДляПроверки Тогда
					
					ИмяИниДокумента = ИмяИниНабора;
					
				Иначе
					
					ИмяИниДокумента = ТипДляПроверки;
					
					ИниНабора = ИниПоПараметрам(ИмяИниНабора);
					Если ИниНабора.Свойство(ТипДляПроверки) Тогда
						
						ИмяИниДокумента = Кэш.ОбщиеФункции.РассчитатьЗначение(ТипДляПроверки, ИниНабора);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ЗначениеДляВставить = Новый ФиксированнаяСтруктура("Объект, Ини", Документ, ИмяИниДокумента);
			Попытка
				
				НаборПакетов_Вставить(НаборПакетов, ЗначениеДляВставить, "ОбъектРассчитать");
				
			Исключение
				
				ОшибкаЗаполнения = НовыйСбисИсключение(ИнформацияОбОшибке(), "НаборПакетов.Вставить.СоставПакета1С");
				НаборПакетов.Данные.Ошибки.Добавить(Новый Структура("Основание, Ошибка", Документ, ОшибкаЗаполнения));
				
			КонецПопытки;
			
		КонецЦикла;
		
	ИначеЕсли КлючВставить = "ОбъектРассчитать" Тогда

		Документ		= ЗначениеВставить.Объект; 
		
		Если ТипЗнч(ЗначениеВставить.Ини) = Тип("Строка") Тогда
			
			ИмяИниДокумента	= ЗначениеВставить.Ини;
			ИниДокумента	= ИниПоПараметрам(ИмяИниДокумента);
			
		Иначе
			
			ИмяИниДокумента	= Неопределено;
			ИниДокумента	= ЗначениеВставить.Ини;

		КонецЕсли;
		
		Если ИниДокумента = Неопределено Тогда
			
			// Если нет инишки для одного из документов пакета, то весь пакет не формируем
			СтруктураОшибки	= НовыйСбисИсключение(, "РаботаСДокументами1С.ПодготовитьСтруктуруДокумента1С",
													610,
													,
													"Отсутствует настройка " + ИниДокумента + " для формирования документа " + Документ);
													
			ВызватьИсключение СбисИсключение_ВСтроку(СтруктураОшибки);

		Иначе
			
			// Заполнить отдельно форматные файлы, в болванку как представление пойдет подобранная ини
			НаборПакетов.Данные.ФорматныеФайлы.Добавить		(Документ, ИмяИниДокумента);
			НаборПакетов.Данные.СоставПакета1С.Добавить		(Документ, ИмяИниДокумента);
			НаборПакетов.Данные.ПодготовленРасчет.Вставить	(Документ, ИниДокумента);
			
			Если НаборПакетов.Параметры.ОснованиеСсылка = Неопределено Тогда
				
				Если НаборПакетов.Параметры.ИмяИни = Неопределено Тогда
					
					НаборПакетов.Параметры.ИмяИни = ИмяИниДокумента;
					
				КонецЕсли;
				НаборПакетов.Параметры.ОснованиеСсылка	= Документ;
				НаборПакетов.Параметры.ОснованиеКлюч	= СбисИдентификаторДокумента1С(Документ, ИмяИниДокумента);
				
			КонецЕсли;
			
		КонецЕсли;
						
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборПакетов_Прочитать(НаборПакетов) Экспорт
	Перем СтруктураОшибки;
	
	Кэш					= ПолучитьТекущийЛокальныйКэш(); 
	МодульФункций		= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	лОтладкаВключена	= ПолучитьЗначениеПараметраСбис("РежимОтладки");

	Попытка

		НаборПакетов.Статистика.Вставить("ВремяНачало",	ПолучитьДатуВМиллисекундах());
		
		СоответствиеДанные = НаборПакетов_СоответствиеДанных(НаборПакетов);
	
		// получаем на сервере все данные по документам пакета по файлам настроек
		Кэш.КэшЗначенийИни.ТекущийПакет.Очистить();
		МодульФункций.ПолучитьДанныеДокументов1С(	СоответствиеДанные,
													Кэш.КэшЗначенийИни,
													НаборПакетов.Данные.ФорматныеФайлы,
													Кэш.Парам);
													
		Если лОтладкаВключена Тогда												
			
			ДанныеВЛог = Новый Массив;
			
			лОтладочныеДанные = Новый Структура("Время, Тип, Вызов, Сообщение, Идентификатор, Модуль", ТекущаяДата());
			лОтладочныеДанные.Тип		= "DIRTY_DATA";
			лОтладочныеДанные.Вызов		= "ПолучитьДанныеДокументов1С";
			лОтладочныеДанные.Модуль	= "НаборПакетов";

			лОтладочныеДанные.Идентификатор	= НаборПакетов.Параметры.ОснованиеКлюч;
			лОтладочныеДанные.Сообщение		= СоответствиеДанные;
			
			ДанныеВЛог.Добавить(лОтладочныеДанные);
				
			СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ДанныеВЛог));
			
		КонецЕсли;
		
		Кэш.КэшЗначенийИни.ТекущийПакет.Вставить("СоответствиеДокументДанные", СоответствиеДанные);
		
		НаборПакетов.Статистика.ВремяЧтенияИни = ПолучитьДатуВМиллисекундах() - НаборПакетов.Статистика.ВремяНачало;

		Контекст = Новый Структура("МассивПакетов", Новый Массив);
		
		РезультатОбработкиКодом	= МодульФункций.ОбработатьДанныеДокументов1С(	Кэш,
																				Контекст,
																				НаборПакетов.Данные.СоставПакета1С,
																				СоответствиеДанные);
																				
		Если РезультатОбработкиКодом Тогда
																					
			// Добавляем в первый пакет внешние файлы
			Если Контекст.МассивПакетов.Количество() Тогда
				
				Для Каждого ВнешнийФайлПуть Из НаборПакетов.Данные.ВнешниеФайлы Цикл
					
					ВнешнийФайл = Новый Файл(ВнешнийФайлПуть);
					
					Если ВнешнийФайл.Существует() Тогда
						
						Вложение = НовыйВложениеСБИС(Новый Структура("Файл", ВнешнийФайл));
						Контекст.МассивПакетов[0].Вложение.Добавить(Вложение);
						
					КонецЕсли;
					
				КонецЦикла;

				Для Каждого Пакет Из Контекст.МассивПакетов Цикл
					
					НаборПакетов.Данные.ПрочитанныеПакеты.Добавить(Пакет);
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			Если Не Контекст.СоставПакета.Свойство("Ошибка", СтруктураОшибки) Тогда 
				
				ТекстОшибки		= "Возникла неизвестная ошибка при постобработке. Документ {ОснованиеСсылка}не был сформирован.";
				ПараметрыФормат = Новый Структура("ОснованиеСсылка");
				ЗаполнитьЗначенияСвойств(ПараметрыФормат, НаборПакетов.Параметры);
				Если ПараметрыФормат.ОснованиеСсылка = Неопределено Тогда
					
					ПараметрыФормат.ОснованиеСсылка = "";
					
				Иначе
					
					ПараметрыФормат.ОснованиеСсылка = Строка(ПараметрыФормат.ОснованиеСсылка) + " ";
					
				КонецЕсли;
				ТекстОшибки		= ПрименитьФорматКСтроке(ТекстОшибки, ПараметрыФормат);
				СтруктураОшибки = НовыйСбисИсключение(,	"РаботаСДокументами1С.ПодготовитьСтруктуруДокумента1С",
														604,
														,
														ТекстОшибки);
														
			КонецЕсли;
													
			ВызватьИсключение СбисИсключение_ВСтроку(СтруктураОшибки);

		КонецЕсли;
		
		НаборПакетов.Статистика.ВремяКонец			= ПолучитьДатуВМиллисекундах();
		НаборПакетов.Статистика.ВремяОбработкиКодом	= НаборПакетов.Статистика.ВремяКонец
													- НаборПакетов.Статистика.ВремяНачало
													- НаборПакетов.Статистика.ВремяЧтенияИни;
		
		Если лОтладкаВключена Тогда
			
			лОтладочныеДанные = Новый Структура("Время, Тип, Вызов, Сообщение, Идентификатор, Модуль", ТекущаяДата());
			лОтладочныеДанные.Тип		= "CLEAN_DATA";
			лОтладочныеДанные.Вызов		= "ОбработатьДанныеДокументов1С";
			лОтладочныеДанные.Модуль	= "НаборПакетов";

			лОтладочныеДанные.Идентификатор	= НаборПакетов.Параметры.ОснованиеКлюч;
			лОтладочныеДанные.Сообщение		= НаборПакетов;
			
			ДанныеВЛог = Новый Массив;
			ДанныеВЛог.Добавить(лОтладочныеДанные);
			
			СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ДанныеВЛог));
			
		КонецЕсли;
		
	Исключение
		
		СтруктураОшибки	= НовыйСбисИсключение(ИнформацияОбОшибке(), "РаботаСДокументами1С.ПодготовитьСтруктуруДокумента1С",
												,
												,
												,
												НаборПакетов.Параметры);
												
		Если лОтладкаВключена Тогда
			
			лОтладочныеДанные = Новый Структура("Время, Тип, Вызов, Сообщение, Идентификатор, Модуль", ТекущаяДата());
			лОтладочныеДанные.Тип		= "ERROR_DATA";
			лОтладочныеДанные.Вызов		= "ОбработатьДанныеДокументов1С";
			лОтладочныеДанные.Модуль	= "НаборПакетов";

			лОтладочныеДанные.Идентификатор	= НаборПакетов.Параметры.ОснованиеКлюч;
			лОтладочныеДанные.Сообщение		= СтруктураОшибки;
			
			ДанныеВЛог = Новый Массив;
			ДанныеВЛог.Добавить(лОтладочныеДанные);
			
			СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ДанныеВЛог));
			
		КонецЕсли;
		
		// Неизвестная ошибка кидается напрямую
		ВызватьИсключение СбисИсключение_ВСтроку(СтруктураОшибки);										
		
	КонецПопытки;
				
КонецПроцедуры

