
&НаКлиенте
Процедура НаборПакетов_Вставить(НаборПакетов, КлючВставить, ЗначениеВставить, ДопПараметры = Неопределено) Экспорт
	
	Кэш = ПолучитьТекущийЛокальныйКэш();
	ВнешниеФайлыДополнить	= НаборПакетов_Получить(НаборПакетов, "ВнешниеФайлы");
	СоставПакета1СДополнить	= НаборПакетов_Получить(НаборПакетов, "СоставПакета1С");
	
	КлючУстановить = КлючВставить;
	Если КлючВставить = "СоставПакета1С" Тогда
		
		Для Каждого Элемент Из ЗначениеВставить Цикл		
			
			Документ = Элемент.Значение;
			
			Если НЕ ЗначениеЗаполнено(Документ) Тогда
				
				Продолжить;
				
			ИначеЕсли ТипЗнч(Документ) = Тип("Строка") Тогда
				
				//Ссылка на внешний файл
				ВнешниеФайлыДополнить.Добавить(Документ);
				СоставПакета1СДополнить.Добавить(Документ);

				Продолжить;
				
			ИначеЕсли ЗначениеЗаполнено(Элемент.Представление) Тогда
				
				// Указано явно на СоставПакета
				ИмяИниДокумента = Элемент.Представление
				
			Иначе
				
				// Проверить над реестром - если есть.
				ИмяИниНабора	= НаборПакетов_Получить(НаборПакетов, "ИмяИни");
				ТипДляПроверки	= СсылочныйТипСтрокой(ТипЗнч(Документ), "Кратко");
				Если ИмяИниНабора = ТипДляПроверки Тогда
					
					ИмяИниДокумента = ИмяИниНабора;
					
				Иначе
					
					ИмяИниДокумента = ТипДляПроверки;
					
					ИниНабора = ИниПоПараметрам(ИмяИниНабора);
					Если ИниНабора.Свойство(ТипДляПроверки) Тогда
						
						ИмяИниДокумента = Кэш.ОбщиеФункции.РассчитатьЗначение(ТипДляПроверки, ИниНабора);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ЗначениеДляВставить = Новый ФиксированнаяСтруктура("Объект, Ини", Документ, ИмяИниДокумента);
			
			Попытка
				
				НаборПакетов_Вставить(НаборПакетов, "ОбъектРассчитать", ЗначениеДляВставить);
				
			Исключение
				
				ОшибкаЗаполнения = НовыйСбисИсключение(ИнформацияОбОшибке(), "НаборПакетов.Вставить.СоставПакета1С");
				НаборПакетов_Вставить(НаборПакетов, "Ошибка", ОшибкаЗаполнения, Документ);
				
			КонецПопытки;
			
		КонецЦикла;
		
	ИначеЕсли КлючВставить = "ОбъектРассчитать" Тогда
		
		ЧтениеИниПоДанным1С_Вставить(НаборПакетов, КлючУстановить, ЗначениеВставить, ДопПараметры);
		
		// После добавления в рассчет, установить на полный список приложений
		СоставПакета1СДополнить.Добавить(ЗначениеВставить.Объект, ЗначениеВставить.Ини);
		Если НаборПакетов_Получить(НаборПакетов, "ОснованиеСсылка") = Неопределено Тогда
			
			Если НаборПакетов_Получить(НаборПакетов, "ИмяИни") = Неопределено Тогда
				
				НаборПакетов_Вставить(НаборПакетов, "ИмяИни", ЗначениеВставить.Ини)
				
			КонецЕсли;
			НаборПакетов_Вставить(НаборПакетов, "ОснованиеСсылка",	ЗначениеВставить.Объект);
			НаборПакетов_Вставить(НаборПакетов, "ОснованиеКлюч",	СбисИдентификаторДокумента1С(ЗначениеВставить.Объект, ЗначениеВставить.Ини));
			
		КонецЕсли;
		
	ИначеЕсли КлючВставить = "ОснованиеКлюч" Тогда
		
		ПрикладнойОбъектSABY_Установить(НаборПакетов, "Идентификатор", ЗначениеВставить);
		ЧтениеИниПоДанным1С_Вставить(НаборПакетов, КлючУстановить, ЗначениеВставить, ДопПараметры);

	Иначе
		
		ЧтениеИниПоДанным1С_Вставить(НаборПакетов, КлючУстановить, ЗначениеВставить, ДопПараметры);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура НаборПакетов_Прочитать(НаборПакетов) Экспорт
	Перем СтруктураОшибки;
	
	Кэш					= ПолучитьТекущийЛокальныйКэш(); 
	МодульФункций		= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	лОтладкаВключена	= ПолучитьЗначениеПараметраСбис("РежимОтладки");

	Кэш.КэшЗначенийИни.ТекущийПакет.Очистить();
	СоответствиеДанные = ЧтениеИниПоДанным1С_Прочитать(НаборПакетов, Кэш.КэшЗначенийИни);
	Попытка

		Кэш.КэшЗначенийИни.ТекущийПакет.Вставить("СоответствиеДокументДанные", СоответствиеДанные);
		
		Контекст = Новый Структура("МассивПакетов", Новый Массив);
		
		РезультатОбработкиКодом	= МодульФункций.ОбработатьДанныеДокументов1С(	Кэш,
																				Контекст,
																				НаборПакетов_Получить(НаборПакетов, "СоставПакета1С"),
																				СоответствиеДанные);
																				
		Если РезультатОбработкиКодом Тогда
			
			// Добавляем в первый пакет внешние файлы
			Если Контекст.МассивПакетов.Количество() Тогда
				
				Для Каждого ВнешнийФайлПуть Из НаборПакетов_Получить(НаборПакетов, "ВнешниеФайлы") Цикл
					
					ВнешнийФайл = Новый Файл(ВнешнийФайлПуть);
					
					Если ВнешнийФайл.Существует() Тогда
						
						Вложение = НовыйВложениеСБИС(Новый Структура("Файл", ВнешнийФайл));
						Контекст.МассивПакетов[0].Вложение.Добавить(Вложение);
						
					КонецЕсли;
					
				КонецЦикла;
				
				ПрочитанныеПакетыДобавить = НаборПакетов_Получить(НаборПакетов, "ПрочитанныеПакеты");
				Для Каждого Пакет Из Контекст.МассивПакетов Цикл
					
					ПрочитанныеПакетыДобавить.Добавить(Пакет);
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			Если Не Контекст.СоставПакета.Свойство("Ошибка", СтруктураОшибки) Тогда 
				
				ТекстОшибки		= "Возникла неизвестная ошибка при постобработке. Документ {ОснованиеСсылка}не был сформирован.";
				ПараметрыФормат = Новый Структура("ОснованиеСсылка");
				ЗаполнитьЗначенияСвойств(ПараметрыФормат, НаборПакетов.Параметры);
				Если ПараметрыФормат.ОснованиеСсылка = Неопределено Тогда
					
					ПараметрыФормат.ОснованиеСсылка = "";
					
				Иначе
					
					ПараметрыФормат.ОснованиеСсылка = Строка(ПараметрыФормат.ОснованиеСсылка) + " ";
					
				КонецЕсли;
				ТекстОшибки		= ПрименитьФорматКСтроке(ТекстОшибки, ПараметрыФормат);
				СтруктураОшибки = НовыйСбисИсключение(,	"РаботаСДокументами1С.ПодготовитьСтруктуруДокумента1С",
														604,
														,
														ТекстОшибки);
														
			КонецЕсли;
													
			ВызватьИсключение СбисИсключение_ВСтроку(СтруктураОшибки);

		КонецЕсли;
		
		НаборПакетов.Статистика.ВремяКонец			= ПолучитьДатуВМиллисекундах();
		НаборПакетов.Статистика.ВремяОбработкиКодом	= НаборПакетов.Статистика.ВремяКонец
													- НаборПакетов.Статистика.ВремяНачало
													- НаборПакетов.Статистика.ВремяЧтенияИни;
		
		Если лОтладкаВключена Тогда
			
			лОтладочныеДанные = Новый Структура("Время, Тип, Вызов, Сообщение, Идентификатор, Модуль", ТекущаяДата());
			лОтладочныеДанные.Тип		= "CLEAN_DATA";
			лОтладочныеДанные.Вызов		= "ОбработатьДанныеДокументов1С";
			лОтладочныеДанные.Модуль	= "НаборПакетов";

			лОтладочныеДанные.Идентификатор	= НаборПакетов_Получить(НаборПакетов, "ОснованиеКлюч");
			лОтладочныеДанные.Сообщение		= НаборПакетов;
			
			ДанныеВЛог = Новый Массив;
			ДанныеВЛог.Добавить(лОтладочныеДанные);
			
			СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ДанныеВЛог));
			
		КонецЕсли;
		
	Исключение
		
		СтруктураОшибки	= НовыйСбисИсключение(ИнформацияОбОшибке(), "РаботаСДокументами1С.ПодготовитьСтруктуруДокумента1С");
												
		Если лОтладкаВключена Тогда
			
			лОтладочныеДанные = Новый Структура("Время, Тип, Вызов, Сообщение, Идентификатор, Модуль", ТекущаяДата());
			лОтладочныеДанные.Тип		= "ERROR_DATA";
			лОтладочныеДанные.Вызов		= "ОбработатьДанныеДокументов1С";
			лОтладочныеДанные.Модуль	= "НаборПакетов";

			лОтладочныеДанные.Идентификатор	= НаборПакетов_Получить(НаборПакетов, "ОснованиеКлюч");
			лОтладочныеДанные.Сообщение		= СтруктураОшибки;
			
			ДанныеВЛог = Новый Массив;
			ДанныеВЛог.Добавить(лОтладочныеДанные);
			
			СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ДанныеВЛог));
			
		КонецЕсли;
		
		// Неизвестная ошибка кидается напрямую
		ВызватьИсключение СбисИсключение_ВСтроку(СтруктураОшибки);										
		
	КонецПопытки;
				
КонецПроцедуры

&НаКлиенте
Функция НаборПакетов_Получить(НаборПакетов, КлючПолучить) Экспорт

	Возврат ЧтениеИниПоДанным1С_Получить(НаборПакетов, КлючПолучить);
	
КонецФункции

&НаКлиенте
Функция НаборПакетов_Выгрузить(НаборПакетов, ДопПараметры = Неопределено) Экспорт
    Перем ФорматВыгрузки;
	
	Если ТипЗнч(ДопПараметры) = Тип("Строка") Тогда
	
		ФорматВыгрузки = ДопПараметры;
		
	ИначеЕсли НЕ ДопПараметры = Неопределено Тогда
		
		ДопПараметры.Свойство("ФорматВыгрузки", ФорматВыгрузки);
		
	КонецЕсли;
	
	Если ФорматВыгрузки = Неопределено Тогда
		
		ФорматВыгрузки = "документы";
		
	Иначе
		
		ФорматВыгрузки = НРег(ФорматВыгрузки);

	КонецЕсли;
	
	Если ФорматВыгрузки = "документы" Тогда
		
		Возврат яНаборПакетов_СгенерироватьИсходящиеДокументы(НаборПакетов, ДопПараметры);
		
	ИначеЕсли ФорматВыгрузки = "параметрысоставпакета" Тогда
		
		НаборПараметров = Новый Структура;
		НаборПараметров.Вставить("Тип", 						НаборПакетов_Получить(НаборПакетов, "Тип"));
		НаборПараметров.Вставить("Подтип", 						НаборПакетов_Получить(НаборПакетов, "Подтип"));
		НаборПараметров.Вставить("ОснованиеПакета",				НаборПакетов_Получить(НаборПакетов, "ОснованиеСсылка"));
		НаборПараметров.Вставить("НеЗапускатьВДокументооборот",	НаборПакетов_Получить(НаборПакетов, "НеЗапускатьВДокументооборот"));
		
		Возврат НаборПараметров;
		
	КонецЕсли;

КонецФункции

