
// Требуется реализация отложенных действий

Функция НовыйВременныйФайл(ИмяВременногоФайлаСоздать = Неопределено, РасширениеФайлаСоздать = Неопределено, ВремяЖизниСек = 600, СоздатьНовый = Ложь) Экспорт
	
	Если ИмяВременногоФайлаСоздать = Неопределено Тогда
		
		Возврат ПолучитьИмяВременногоФайла(РасширениеФайлаСоздать);
		
	КонецЕсли;
	
	РасширениеЗаполнить = РасширениеФайлаСоздать;
	Если РасширениеФайлаСоздать = Неопределено Тогда
		
		РасширениеЗаполнить = "tmp";
		
	КонецЕсли;
	
	Возврат КаталогВременныхФайлов() + ИмяВременногоФайлаСоздать + "." + РасширениеЗаполнить;
	
КонецФункции

Процедура ОсвободитьВременныйФайл(ИмяФайла, ОчиститьСразу = Ложь) Экспорт
	
	УдалитьФайлы(ИмяФайла);
	
КонецПроцедуры

