
// Функция - сериализует объект для возврата на клиент
//
// Параметры:
//  ОбъектСериализации	 - Произвольный	 - объект, который содержит свойство "Колонки", у каждой из которых есть "Имя". 
// 
// Возвращаемое значение:
//  Произвольный - приведенный к сериализуемому типу объект, который может быть получен на клиенте
//
Функция СериализоватьОбъектДляВозвратаНаКлиент(ОбъектСериализации) Экспорт 

	ПростыеТипы = Новый Массив;
	ПростыеТипы.Добавить(Тип("Число"));
	ПростыеТипы.Добавить(Тип("Строка"));
	ПростыеТипы.Добавить(Тип("Дата"));
	ПростыеТипы.Добавить(Тип("Булево"));	
	
	ОписаниеТипаДляПроверкиПростыеТипы = Новый ОписаниеТипов(ПростыеТипы);
	
	КонтекстСериализовать = Новый Структура("КэшТипов", Новый Соответствие);
	КонтекстСериализовать.Вставить("ПростыеТипы",			ОписаниеТипаДляПроверкиПростыеТипы);
	
	Возврат яСериализоватьОбъектДляВозвратаНаКлиент_Объект(ОбъектСериализации, КонтекстСериализовать);
	
КонецФункции

Функция яСериализоватьОбъектДляВозвратаНаКлиент_Объект(ОбъектСериализации, КонтекстСериализовать) 
	
	ТипПроверка = ТипЗнч(ОбъектСериализации); 
	Если КонтекстСериализовать.ПростыеТипы.СодержитТип(ТипПроверка) Тогда

		Результат = ОбъектСериализации;

	ИначеЕсли ТипПроверка = Тип("РезультатЗапроса") Тогда
		
		Результат = яСериализоватьОбъектДляВозвратаНаКлиент_РезультатЗапроса(ОбъектСериализации, КонтекстСериализовать);
		
	ИначеЕсли ТипПроверка = Тип("ТаблицаЗначений") Тогда
		
		Результат = яСериализоватьОбъектДляВозвратаНаКлиент_ТаблицаЗначений(ОбъектСериализации, КонтекстСериализовать);

	ИначеЕсли ТипПроверка = Тип("ДеревоЗначений") Тогда

		Результат = яСериализоватьОбъектДляВозвратаНаКлиент_ДеревоЗначений(ОбъектСериализации, КонтекстСериализовать);
		
	ИначеЕсли ТипПроверка = Тип("Структура") Тогда
		
		Результат = Новый Структура;
		
		Для Каждого КлючИЗначение Из ОбъектСериализации Цикл
			
			Результат.Вставить(КлючИЗначение.Ключ, яСериализоватьОбъектДляВозвратаНаКлиент_Объект(КлючИЗначение.Значение, КонтекстСериализовать));
			
		КонецЦикла;

	ИначеЕсли ТипПроверка = Тип("Соответствие") Тогда
		
		Результат = Новый Соответствие;
		Для Каждого КлючИЗначение Из ОбъектСериализации Цикл
			
			Результат.Вставить(	яСериализоватьОбъектДляВозвратаНаКлиент_Объект(КлючИЗначение.Ключ, КонтекстСериализовать),
								яСериализоватьОбъектДляВозвратаНаКлиент_Объект(КлючИЗначение.Значение, КонтекстСериализовать));
			
		КонецЦикла;		

	ИначеЕсли ТипПроверка = Тип("ЭлементСпискаЗначений") Тогда
		
		ЭлементЗначение = яСериализоватьОбъектДляВозвратаНаКлиент_Объект(ОбъектСериализации.Значение, КонтекстСериализовать);
		Результат = Новый ФиксированнаяСтруктура("Значение, Представление", ЭлементЗначение, ОбъектСериализации.Представление);

	Иначе
		
		Результат = яСериализоватьОбъектДляВозвратаНаКлиент_НеизвестныйТип(ОбъектСериализации, КонтекстСериализовать);
	
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции

Функция яСериализоватьОбъектДляВозвратаНаКлиент_РезультатЗапроса(ОбъектСериализации, КонтекстСериализовать) 
	
	Результат	= Новый Массив;
	
	Если Не ОбъектСериализации.Пустой() Тогда
		
		Попытка
			
			ВыборкаЗапроса = ОбъектСериализации.Выбрать();
			
		Исключение
			
			ВызватьИсключение(СбисИсключение_ВСтроку(ИнформацияОбОшибке(), "МодульОбъектаСервер.СериализоватьОбъектДляВозвратаНаКлиент.Объект")); 
			
		КонецПопытки;

		НаборКлючей = яСериализоватьОбъектДляВозвратаНаКлиент_КлючиСтроки(ОбъектСериализации);
		
		Пока ВыборкаЗапроса.Следующий() Цикл
			
			НоваяСтр = Новый Структура(НаборКлючей);
			ЗаполнитьЗначенияСвойств(НоваяСтр, ВыборкаЗапроса);
			Результат.Добавить(НоваяСтр);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Функция яСериализоватьОбъектДляВозвратаНаКлиент_ТаблицаЗначений(ОбъектСериализации, КонтекстСериализовать) 
	
	Результат = Новый Массив;
	
	Если ОбъектСериализации.Количество() Тогда
		
		НаборКлючей = яСериализоватьОбъектДляВозвратаНаКлиент_КлючиСтроки(ОбъектСериализации);
		
		Для Каждого СтрокаТаблицы Из ОбъектСериализации Цикл
			
			НоваяСтр = Новый Структура(НаборКлючей);
			Для Каждого КлючИЗначение Из НоваяСтр Цикл
				
				НоваяСтр[КлючИЗначение.Ключ] = яСериализоватьОбъектДляВозвратаНаКлиент_Объект(СтрокаТаблицы[КлючИЗначение.Ключ], КонтекстСериализовать);
				
			КонецЦикла;
			Результат.Добавить(НоваяСтр);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция яСериализоватьОбъектДляВозвратаНаКлиент_ДеревоЗначений(ОбъектСериализации, КонтекстСериализовать) 
	
	// Написать реализацию для дерева
	Возврат яСериализоватьОбъектДляВозвратаНаКлиент_ТаблицаЗначений(ОбъектСериализации, КонтекстСериализовать);
	
КонецФункции

Функция яСериализоватьОбъектДляВозвратаНаКлиент_НеизвестныйТип(ОбъектСериализации, КонтекстСериализовать) 
	Перем Результат;
	
    ТипОбъектаСериализации = ТипЗнч(ОбъектСериализации);
	
	ТипОписание = КонтекстСериализовать.КэшТипов.Получить(ТипОбъектаСериализации);
	Если ТипОписание = Неопределено Тогда
		
		ТипОписание = Новый Структура("Итерируемый");
		КонтекстСериализовать.КэшТипов.Вставить(ТипОбъектаСериализации, ТипОписание);
		
	КонецЕсли;
	
	Если	ТипОписание.Итерируемый = Истина
		Или	ТипОписание.Итерируемый = Неопределено Тогда
		
		Результат = Новый Массив;
		Попытка
			
			Для Каждого ЭлементОбъекта Из ОбъектСериализации Цикл
				
				Результат.Добавить(яСериализоватьОбъектДляВозвратаНаКлиент_Объект(ЭлементОбъекта, КонтекстСериализовать));
				
			КонецЦикла;
			Возврат Результат;
			
		Исключение
			
			ТипОписание.Итерируемый = Ложь;
			
		КонецПопытки;
		
	КонецЕсли;	
	
	Возврат Новый ФиксированнаяСтруктура("Тип, Представление, Значение", Строка(ТипОбъектаСериализации), Строка(ОбъектСериализации), ЗначениеВСтрокуВнутр(ОбъектСериализации));
	
КонецФункции

Функция яСериализоватьОбъектДляВозвратаНаКлиент_КлючиСтроки(ОбъектСериализации) 
	
	НаборКлючей			= "";
	ТипНеСериализуется	= Тип("РезультатЗапроса");
	
	Для Каждого Колонка Из ОбъектСериализации.Колонки Цикл
		
		Если Колонка.ТипЗначения.СодержитТип(ТипНеСериализуется) Тогда
			
			Продолжить;
			
		КонецЕсли;	
			
		НаборКлючей = НаборКлючей + Колонка.Имя + ",";
		
	КонецЦикла;

	Возврат Лев(НаборКлючей, СтрДлина(НаборКлючей)-1);
	
КонецФункции

