
// Процедура открывает форму просмотра пакета документов	
&НаКлиенте
Процедура ПоказатьДокумент(ВходящийКэш, Пакет, ДопПараметры = Неопределено) Экспорт

	СоставПакета	= Пакет;
	Вложение		= Неопределено;
	
	ФормаПросмотрДокумента_ДополнитьДаннымиОнлайна(СоставПакета);
	ФормаПросмотрДокумента_УстановитьЗначенияПоУмолчанию(СоставПакета);
	ФормаПросмотрДокумента_УстановитьЗначенияПоРазделу(СоставПакета, Кэш.Текущий);
	
	ФормаПросмотрДокумента_УстановитьДополнительныеЗначения(ДопПараметры);
	
	Если	Не СоставПакета.Вложение.Количество()
		И	Не СоставПакета.Свойство("ДобавочныеСтроки")
		И	Не МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("Меркурий") Тогда
		
		Сообщить("В пакете отсутствуют вложения.");
		Возврат;
		
	КонецЕсли;
	
	ОбновитьПоляФормыПоДокументуСБИС(СоставПакета);
	
	ЭтаФорма.Открыть();
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
		
		ЭтаФорма.Элементы.ТаблицаДокументов.Обновить();
		Если ТаблицаДокументов.Количество() Тогда // alo Меркурий
			НомерСтроки = ТаблицаДокументов[0];
			Если Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
				НомерСтроки = НомерСтроки.ПолучитьИдентификатор();
			КонецЕсли;
			сбисЭлементФормы(ЭтаФорма,"ТаблицаДокументов").ТекущаяСтрока = НомерСтроки;
		КонецЕсли;									// alo Меркурий
		ТаблицаДокументовПриАктивизацииЯчейки(сбисЭлементФормы(ЭтаФорма, "ТаблицаДокументов"));
		
		ЭтаФорма.ОбновитьОтображениеДанных();
		
	#КонецЕсли
	
КонецПроцедуры 

&НаКлиенте
Процедура ФормаПросмотрДокумента_ДополнитьДаннымиОнлайна(ПолныйСоставПакета)
	
	Если Не МодульОбъектаКлиент().Saby_ОбъектSABY_ЭтоТип(ПолныйСоставПакета, "СоставПакета") Тогда
		
		// Считаем, что если это тип СоставПакета и нужен Ид в Сбис, то читаем от сопоставления с документом 1С.
		// Т.к. на момент 26.5100 СоставПакета формируется только по данным 1С
		Возврат;
		
	КонецЕсли;
	
	// Пока в формате костыля. Позже сделать тип документ Saby и сделать проверку на тип.
	ДанныеДокументаSaby =  МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "ДанныеДокументаSaby");
	Если ДанныеДокументаSaby = Неопределено Тогда
	
		ИдДокументаSABY = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "ИдентификаторСБИС");
		Если Не ЗначениеЗаполнено(ИдДокументаSABY) Тогда 
			
			Возврат;
			
		КонецЕсли;
		ДопПоля			= МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "ДопПоля");
		РеализацияЕИС	= ?(ТипЗнч(ДопПоля) = Тип("Массив"), ДопПоля.Найти("ЕИС") <> Неопределено, Ложь);
		ДопПараметры	= Новый Структура("СообщатьПриОшибке, ВернутьОшибку, РеализацияЕИС", Ложь, Истина, РеализацияЕИС);
		
		ДанныеДокументаSaby = МодульОбъектаКлиент().ПрочитатьДокументСБИС(ИдДокументаSABY, ДопПараметры);
		
	КонецЕсли;
		
	Если ТипЗнч(ДанныеДокументаSaby) <> Тип("Структура")
		// Патчим данными онлайна, только если совпадает тип, иначе сопоставлено что-то другое
		ИЛИ ПолныйСоставПакета.Свойство("Тип")
		И НЕ ПолныйСоставПакета.Тип = ДанныеДокументаSaby.Тип Тогда
		Возврат;
	КонецЕсли;
	
	ДопПоля = "Расширение,
		|РеализацияЕИС,
		|Идентификатор,
		|Состояние,
		|Этап";
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПоддержкаОбменаЕИС")
		И ДанныеДокументаSaby.Свойство("ДокументОснование") Тогда
		ДопПоля = ДопПоля + ",
			|ДокументОснование";
	КонецЕсли;
	
	Если ДанныеДокументаSaby.Свойство("Событие") Тогда
		ДопПоля = ДопПоля + ",
			|Событие";
	КонецЕсли;
	
	Изменения = Новый Структура(ДопПоля);
	ЗаполнитьЗначенияСвойств(Изменения, ДанныеДокументаSaby);
	
	МодульОбъектаКлиент().СоставПакета_Обновить(ПолныйСоставПакета, Новый Структура("ДопПоля", Изменения));
	
	ДопПоляВложений = Новый Массив;
	ДопПоляВложений.Добавить("Идентификатор");
	
	Для каждого СБИСВложение Из ДанныеДокументаSaby.Вложение Цикл
		
		ПараметрыПоиска = Новый Структура("Тип, Номер, ПодТип, ВерсияФормата");
		ЗаполнитьЗначенияСвойств(ПараметрыПоиска, СБИСВложение);
		ПараметрыПоиска.Вставить("Дата", Формат(СБИСВложение.Дата, "ДФ=dd.MM.yyyy"));
		ВложениеИз1С = МодульОбъектаКлиент().СоставПакета_Получить(ПолныйСоставПакета, "Вложение", ПараметрыПоиска);
		
		Если ВложениеИз1С = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого Поле Из ДопПоляВложений Цикл
			ВложениеИз1С.Вставить(Поле, СБИСВложение[Поле]);
		КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПросмотрДокумента_УстановитьЗначенияПоУмолчанию(СоставПакетаСбис)

	МодульТекущий	= МодульОбъектаКлиент();
	ИниКонфигурация	= МодульТекущий.ИниПоПараметрам("Конфигурация"); // Перенести все обращения к ини конфигурации В "УстановитьИниКонфигурации"

	ТаблицаДокументов.Очистить();
	
	ДокументРазобран		= Ложь;
	ДокументУчетаРазобран	= Ложь;
	ВложенияУчетаРазобраны	= Ложь;
	ОбновлятьГлавноеОкно	= Ложь;
	ЕстьВходящиеВложения	= Ложь;
	ОтметитьВсе				= Истина;
	ВыполнитьЗакрытиеФормы	= Ложь;
	
	ЗаголовокПакета			= "";
	ПакетОрганизация		= "";
	ПакетКонтрагент			= "";
	ПакетКомментарий		= "";
	АбонентскийЯщик			= "Определять автоматически"; 
	УчетОрганизация			= Неопределено;
	УчетКонтрагент			= Неопределено;
	УчетГрузополучатель		= Неопределено;

	ИмяРеквизитаВложений				= "Вложение";
	ИмяОтбораХарактеристики 			= "Номенклатура";
	ИмяРеквизитаКонтрагентаВДоговоре	= "Контрагент";
	
	ПараметрыРаботы = Новый Структура;
	ПараметрыРаботы.Вставить("МаркировкаЗаполнена",				Ложь); 
	ПараметрыРаботы.Вставить("ПрослеживаемостьЗаполнена",		Ложь);
	ПараметрыРаботы.Вставить("ТранспортныеУпаковкиЗаполнены",	Ложь);
	
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма,	"ТулБар").Видимость					= Истина;
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма,	"ПодготовитьКЗагрузке").Видимость	= Истина;
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма,	"ЗагрузитьНаВложении").Видимость	= Ложь;
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма,	"Записать").Видимость				= Ложь;
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма,	"НеНайденКонтрагент").Видимость		= Ложь;
	
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма,"ПереключитьТипВложений").Заголовок = "Показать вложения Saby";

	МодульТекущий.ИзменитьЭлементФормыОбработки(Новый ФиксированнаяСтруктура("Форма, Реквизит", ЭтаФорма, "ПолеHTMLДокумента"),
												Новый ФиксированнаяСтруктура("HTML", "<html></html>"));
												
	ЭлементКонтент = МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "Контент");
	ЭлементКонтент.ТекущаяСтраница = МодульТекущий.ПолучитьЭлементФормыОбработки(ЭлементКонтент, "Просмотр");
	
	Если СоставПакетаСбис.Свойство("Примечание") Тогда
		
		ПакетКомментарий = СоставПакета.Примечание;
		
	КонецЕсли;
	
	Если СоставПакетаСбис.Вложение.Количество() Тогда
				
		#Если Не ТолстыйКлиентОбычноеПриложение Тогда

			Если ИниКонфигурация.Свойство("ИмяОтбораХарактеристики") Тогда
				
				ИмяОтбораХарактеристики = СокрЛП(СтрЗаменить(ИниКонфигурация.ИмяОтбораХарактеристики.Значение, "'", ""));
				
			КонецЕсли;
			
			Если ИниКонфигурация.Свойство("Договоры_Контрагент") Тогда
				
				ИмяРеквизитаКонтрагентаВДоговоре = СокрЛП(Сред(	ИниКонфигурация.Договоры_Контрагент.Значение,
																Найти(ИниКонфигурация.Договоры_Контрагент.Значение, ".") + 1));	
				
			КонецЕсли;
															
			Договор1СУстановитьОтбор(ИмяРеквизитаКонтрагентаВДоговоре);
			
		#КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПросмотрДокумента_УстановитьЗначенияПоРазделу(СоставПакетаСбис, РазделГО)
	
	МодульТекущий = МодульОбъектаКлиент();
	
	// Хз, зачем оно нужно. Какой-то костыль. Пока сохраним.
 	Если Не Кэш.Разделы.Свойство("Текущий") Тогда
		Кэш.Разделы.Вставить("Текущий", Новый Структура);
	КонецЕсли;
	Кэш.Разделы.Текущий.Вставить("ФормаПросмотрДокумента", РазделГО);
	
	ТекущийРаздел = Кэш.Разделы["р"+Кэш.Текущий.Раздел];
	ТипДокумента = Кэш.Текущий.ТипДок;	

	// Дополнительная видимость элементов
	МассивФорм = Новый Массив;            
	МассивФорм.Добавить("Раздел_" + ТекущийРаздел + "_" + ТипДокумента);
	МассивФорм.Добавить("Раздел_" + ТекущийРаздел + "_Шаблон");

	фрм = МодульТекущий.НайтиФункциюСеансаОбработки("УстановитьВидимостьЭлементовВформеПросмотра", МассивФорм);	
	фрм.УстановитьВидимостьЭлементовВформеПросмотра(ЭтаФорма, СоставПакета, Кэш.Парам);
	// Дополнительные операци   
	фрм = МодульТекущий.НайтиФункциюСеансаОбработки("сбисСписокДополнительныхОпераций", МассивФорм);	
	СписокДопОпераций = фрм.сбисСписокДополнительныхОпераций(Кэш, ЭтаФорма);
	
	// Лента документа
	фрм = МодульТекущий.НайтиФункциюСеансаОбработки("ЗаполнитьПрохождение", МассивФорм);	
	Если Не фрм = Ложь Тогда
		СтруктураСобытий = фрм.ЗаполнитьПрохождение(СоставПакетаСбис);
		СБИССобытия.Очистить();
		Для Каждого Элемент Из СтруктураСобытий Цикл
			Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
				Продолжить;
			КонецЕсли;
			Если Элемент.Значение.Свойство("Название") Тогда
				Элемент.Значение.Название = Кэш.ОбщиеФункции.ИзвлечьТекстИзHTML(Элемент.Значение.Название);
			КонецЕсли;
			НоваяСтр = СБИССобытия.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтр, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПросмотрДокумента_УстановитьДополнительныеЗначения(Параметры)

	МодульТекущий	= МодульОбъектаКлиент();
	Если ЗначениеЗаполнено(Параметры) И Параметры.Свойство("ПакетнаяОтправка") И Параметры.ПакетнаяОтправка Тогда
		
		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма,	"Отправить").Видимость		= Ложь;
		
	Иначе
	
		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма,	"Отправить").Видимость		= Истина;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция МодульОбработки_Выгрузить(РежимВыгрузки, ДопПараметры) Экспорт
	
	Если РежимВыгрузки = "ТехническаяИнформация" Тогда
		
		яВыгрузить_ОтладочнуюИнформацию(ДопПараметры);
		
	Иначе
		
		ВызватьИсключение "Неизвестный формат выгрузки для модуля ""ФормаГлавноеОкно"": """ + РежимВыгрузки + """.";
		
	КонецЕсли;
	
КонецФункции

