
// Процедура открывает форму просмотра пакета документов	
&НаКлиенте
Процедура ПоказатьДокумент(ВходящийКэш, Пакет, ДопПараметры = Неопределено) Экспорт

	МестныйКэш		= ВходящийКэш;
	Кэш 			= ВходящийКэш;
	СоставПакета	= Пакет;
	Вложение		= Неопределено;
	
	ФормаПросмотрДокумента_УстановитьЗначенияПоУмолчанию(СоставПакета);
	ФормаПросмотрДокумента_УстановитьЗначенияПоРазделу(СоставПакета, Кэш.Текущий);

	Если	Не СоставПакета.Вложение.Количество()
		И	Не СоставПакета.Свойство("ДобавочныеСтроки")
		И	Не МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("Меркурий") Тогда
		
		Сообщить("В пакете отсутствуют вложения.");
		Возврат;
		
	КонецЕсли;
	
	ОбновитьПоляФормыПоДокументуСБИС(СоставПакета);
	
	ЭтаФорма.Открыть();
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
		
		ЭтаФорма.Элементы.ТаблицаДокументов.Обновить();
		Если ТаблицаДокументов.Количество() Тогда // alo Меркурий
			НомерСтроки = ТаблицаДокументов[0];
			Если МестныйКэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
				НомерСтроки = НомерСтроки.ПолучитьИдентификатор();
			КонецЕсли;
			сбисЭлементФормы(ЭтаФорма,"ТаблицаДокументов").ТекущаяСтрока = НомерСтроки;
		КонецЕсли;									// alo Меркурий
		ТаблицаДокументовПриАктивизацииЯчейки(сбисЭлементФормы(ЭтаФорма, "ТаблицаДокументов"));
		
		ЭтаФорма.ОбновитьОтображениеДанных();
		
	#КонецЕсли
	
КонецПроцедуры 

&НаКлиенте
Процедура ФормаПросмотрДокумента_УстановитьЗначенияПоУмолчанию(СоставПакетаСбис)

	МодульТекущий	= МодульОбъектаКлиент();
	ИниКонфигурация	= МодульТекущий.ИниПоПараметрам("Конфигурация"); // Перенести все обращения к ини конфигурации В "УстановитьИниКонфигурации"

	ТаблицаДокументов.Очистить();
	
	ДокументРазобран		= Ложь;
	ДокументУчетаРазобран	= Ложь;
	ВложенияУчетаРазобраны	= Ложь;
	ОбновлятьГлавноеОкно	= Ложь;
	ЕстьВходящиеВложения	= Ложь;
	ОтметитьВсе				= Истина;
	ВыполнитьЗакрытиеФормы	= Ложь;
	
	ЗаголовокПакета			= "";
	ПакетОрганизация		= "";
	ПакетКонтрагент			= "";
	ПакетКомментарий		= "";
	АбонентскийЯщик			= "Определять автоматически"; 
	УчетОрганизация			= Неопределено;
	УчетКонтрагент			= Неопределено;
	УчетГрузополучатель		= Неопределено;

	ИмяРеквизитаВложений				= "Вложение";
	ИмяОтбораХарактеристики 			= "Номенклатура";
	ИмяРеквизитаКонтрагентаВДоговоре	= "Контрагент";
	
	ПараметрыРаботы = Новый Структура;
	ПараметрыРаботы.Вставить("МаркировкаЗаполнена",				Ложь); 
	ПараметрыРаботы.Вставить("ПрослеживаемостьЗаполнена",		Ложь);
	ПараметрыРаботы.Вставить("ТранспортныеУпаковкиЗаполнены",	Ложь);
	
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма,	"ТулБар").Видимость					= Истина;
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма,	"ПодготовитьКЗагрузке").Видимость	= Истина;
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма,	"ЗагрузитьНаВложении").Видимость	= Ложь;
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма,	"Записать").Видимость				= Ложь;
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма,	"НеНайденКонтрагент").Видимость		= Ложь;
	
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма,"ПереключитьТипВложений").Заголовок = "Показать вложения Saby";

	МодульТекущий.ИзменитьЭлементФормыОбработки(Новый ФиксированнаяСтруктура("Форма, Реквизит", ЭтаФорма, "ПолеHTMLДокумента"),
												Новый ФиксированнаяСтруктура("HTML", "<html></html>"));
												
	ЭлементКонтент = МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "Контент");
	ЭлементКонтент.ТекущаяСтраница = МодульТекущий.ПолучитьЭлементФормыОбработки(ЭлементКонтент, "Просмотр");
	
	Если СоставПакетаСбис.Свойство("Примечание") Тогда
		
		ПакетКомментарий = СоставПакета.Примечание;
		
	КонецЕсли;
	
	Если СоставПакетаСбис.Вложение.Количество() Тогда
				
		#Если Не ТолстыйКлиентОбычноеПриложение Тогда

			Если ИниКонфигурация.Свойство("ИмяОтбораХарактеристики") Тогда
				
				ИмяОтбораХарактеристики = СокрЛП(СтрЗаменить(ИниКонфигурация.ИмяОтбораХарактеристики.Значение, "'", ""));
				
			КонецЕсли;
			
			Если ИниКонфигурация.Свойство("Договоры_Контрагент") Тогда
				
				ИмяРеквизитаКонтрагентаВДоговоре = СокрЛП(Сред(	ИниКонфигурация.Договоры_Контрагент.Значение,
																Найти(ИниКонфигурация.Договоры_Контрагент.Значение, ".") + 1));	
				
			КонецЕсли;
															
			Договор1СУстановитьОтбор(ИмяРеквизитаКонтрагентаВДоговоре);
			
		#КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПросмотрДокумента_УстановитьЗначенияПоРазделу(СоставПакетаСбис, РазделГО)
	
	МодульТекущий = МодульОбъектаКлиент();
	
	// Хз, зачем оно нужно. Какой-то костыль. Пока сохраним.
 	Если Не Кэш.Разделы.Свойство("Текущий") Тогда
		Кэш.Разделы.Вставить("Текущий", Новый Структура);
	КонецЕсли;
	Кэш.Разделы.Текущий.Вставить("ФормаПросмотрДокумента", РазделГО);
	
	ТекущийРаздел = Кэш.Разделы["р"+Кэш.Текущий.Раздел];
	ТипДокумента = Кэш.Текущий.ТипДок;	

	// Дополнительная видимость элементов
	МассивФорм = Новый Массив;            
	МассивФорм.Добавить("Раздел_" + ТекущийРаздел + "_" + ТипДокумента);
	МассивФорм.Добавить("Раздел_" + ТекущийРаздел + "_Шаблон");

	фрм = МодульТекущий.НайтиФункциюСеансаОбработки("УстановитьВидимостьЭлементовВформеПросмотра", МассивФорм);	
	фрм.УстановитьВидимостьЭлементовВформеПросмотра(ЭтаФорма, СоставПакета, Кэш.Парам);
	// Дополнительные операци   
	фрм = МодульТекущий.НайтиФункциюСеансаОбработки("сбисСписокДополнительныхОпераций", МассивФорм);	
	СписокДопОпераций = фрм.сбисСписокДополнительныхОпераций(Кэш, ЭтаФорма);
	
	// Лента документа
	фрм = МодульТекущий.НайтиФункциюСеансаОбработки("ЗаполнитьПрохождение", МассивФорм);	
	Если Не фрм = Ложь Тогда
		СтруктураСобытий = фрм.ЗаполнитьПрохождение(СоставПакетаСбис);
		СБИССобытия.Очистить();
		Для Каждого Элемент Из СтруктураСобытий Цикл
			Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
				Продолжить;
			КонецЕсли;
			Если Элемент.Значение.Свойство("Название") Тогда
				Элемент.Значение.Название = Кэш.ОбщиеФункции.ИзвлечьТекстИзHTML(Элемент.Значение.Название);
			КонецЕсли;
			НоваяСтр = СБИССобытия.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтр, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

