
&НаКлиенте
Процедура КонтактыТП(Команда)
	ЗапуститьПриложение("https://saby.ru/support");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВ1С(Команда) Экспорт

	ЗагрузкаВ1С_Начало();                                    
	
КонецПроцедуры

&НаКлиенте
Процедура ОбращениеТП(Команда)
	ЗапуститьПриложение("https://online.saby.ru/page/my-claims");
КонецПроцедуры

// Процедура отправляет текущий пакет документов 	
&НаКлиенте
Процедура ОтправитьНажатие(Команда)
	
	Перем СтатусЭД;
	
	СоставПакета.Вставить("Примечание", ПакетКомментарий);
	
	ОбновитьДанныеДокументаСБИС(СоставПакета);
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Записать").Видимость = Ложь;
	
	Если	СоставПакета.Вложение.Количество()
		И	СоставПакета.Вложение[0].Свойство("Документы1С") Тогда
		фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("СбисПрочитатьЗначениеСвойстваДокумента",Кэш.ФормаРаботыСоСтатусами,"",Кэш);
		ДокументСсылка = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "ОсновнойДокумент1С");   
		ПараметрыЧтенияСвойства    = Новый Структура("Имя, ДокументСсылка", "ДокументСБИС_Статус", ДокументСсылка);
	    ПредставлениеСтатуса = фрм.СбисПрочитатьЗначениеСвойстваДокумента(ПараметрыЧтенияСвойства,Кэш); 
		СтатусЭД = Кэш.ОбщиеФункции.СбисИндексКартинкиПоСтатусуЭД(ПредставлениеСтатуса); 
	КонецЕсли;
	
	Идентификатор = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "ИдентификаторСБИС"); 
	
	МассивПодготовленныхПакетов = Новый Массив;
	МассивПодготовленныхПакетов.Добавить(СоставПакета);
	СписокКОтправке = Новый Массив;
	СписокКОтправке.Добавить(Новый Структура("МассивПодготовленныхПакетов,ИдПакета,Статус", МассивПодготовленныхПакетов,Идентификатор,СтатусЭД));
	
	ПараметрыЗавершить			= Новый Структура("Кэш", Кэш);
	ОбработчикРезультатОтправки	= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ОтправитьДокументы_Завершение", ЭтаФорма, ПараметрыЗавершить);

	ДопПараметрыОтправки = Новый Структура("Реестра, ОбработчикРезультата", Кэш.Текущий, ОбработчикРезультатОтправки);
	
	МодульОбъектаКлиент().ЗапуститьМассовуюОтправкуДокументов(СписокКОтправке, ДопПараметрыОтправки)

КонецПроцедуры

// Вставить содержимое обработчика.
&НаКлиенте
Процедура ПодготовитьКЗагрузке(Команда)
	
	СбисВыполнитьРазбор();
	
	Если Вложение.Свойство("КлассыСопоставленияНоменклатур")
		И Вложение.КлассыСопоставленияНоменклатур.Количество() Тогда 
		ОперацииПодготовкиКЗагрузкеРасширенноеСопоставление(Вложение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РуководствоПользователя(Команда)
	ЗапуститьПриложение("https://saby.ru/help/integration/1C_set/modul/docs");
КонецПроцедуры

&НаКлиенте
Процедура АбонентскийЯщикНажатие(Команда, СтандартнаяОбработка=Истина)
	Элемент = сбисЭлементФормы(ЭтаФорма, "АбонентскийЯщик");
	СтандартнаяОбработка = Ложь;
	СбисВыбратьПочтовыйЯщик(МестныйКэш, Элемент, Новый Структура);
КонецПроцедуры

// Процедура - обработчик события ПриСменеСтраницы основной панели  
//
&НаКлиенте
Процедура ГлавнаяПанельПриСменеСтраницы(Элемент, ТекущаяСтраница) 
	
	РасширениеСостава = Неопределено; 
	лМаркировка = Неопределено;
	лПрослеживаемость = Неопределено;
	
	ИмяСтраницы = Элемент.ТекущаяСтраница.Имя;
	
	ВкладкаМаркировки = ИмяСтраницы = "Маркировка"
		И (СоставПакета.Свойство("Расширение", РасширениеСостава)
			И	РасширениеСостава.Свойство("Маркировка", лМаркировка)
			И	лМаркировка = "Да"
				ИЛИ МодульОбъектаКлиент().РаботаСГосКонтрактами(СоставПакета))
		И НЕ ПараметрыРаботы.МаркировкаЗаполнена;
	
	ВкладкаПрослеживаемости = ИмяСтраницы = "Прослеживаемость"
		И СоставПакета.Свойство("Расширение", РасширениеСостава)
		И	РасширениеСостава.Свойство("Прослеживаемость", лПрослеживаемость)
		И	лПрослеживаемость = "Да" 
		И НЕ ПараметрыРаботы.ПрослеживаемостьЗаполнена;
	
	Если ВкладкаМаркировки Тогда // Запретил повторное перечитываение
		ЗаполнитьМаркировку(СоставПакета); 
	ИначеЕсли ВкладкаПрослеживаемости Тогда // Запретил повторное перечитываение
		ЗаполнитьПрослеживаемость(СоставПакета);  
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

// Процедура - устанавливает выбранный параметр причины выбытия кодов маркировки
// 
&НаКлиенте
Процедура ПричинаВыводаПриИзменении()
	Перем КодПричиныВывода, лИностраннаяОрганизация, лКонтрагент;  
	
	ТекущийРаздел = МестныйКэш.Разделы["р"+МестныйКэш.Текущий.Раздел]; 
	
	СкладскиеПараметрыДокумента = МодульОбъектаКлиент().ПолучитьСкладскиеПараметрыДокумента(СоставПакета); 
	
	//ПричинаВывода = СкладскиеПараметрыДокумента.ПричинаВывода; 
	 
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПричинаВывода").СписокВыбора.ЗагрузитьЗначения(СкладскиеПараметрыДокумента.ПричиныВыводаИзОборота); 
	
	Если СоставПакета.Свойство("Контрагент", лКонтрагент) Тогда 
		лИностраннаяОрганизация = МодульОбъектаКлиент().ПрочитатьДополнительныйПараметрСтороны(лКонтрагент, "ИностраннаяОрганизация");
	КонецЕсли; 
	
	ДопПараметрыСтороны = Новый Структура; 
	ДопПараметрыСтороны.Вставить("ИностраннаяОрганизация",лИностраннаяОрганизация);
	
	МассивПричинВыводаИзОборота = МодульОбъектаКлиент().ПричиныВыводаИзОборота(СкладскиеПараметрыДокумента, ДопПараметрыСтороны);  
	
	Если СкладскиеПараметрыДокумента.ПричиныВыводаИзОборота.Найти(ПричинаВывода) = Неопределено Тогда 
		//Причина нам не подходит, т.к. не применима к текущему параметру участника оборота ГИС МТ 
		ПричинаВывода = МассивПричинВыводаИзОборота[0].Причина;
	КонецЕсли;
	
	Индекс = Кэш.ОбщиеФункции.ВыбратьДанныеСертификата(МассивПричинВыводаИзОборота,ПричинаВывода,"Причина");
	
	//Здесь, возможно, необходимо будет поменять на причину вывода по умолчанию.
	Если Индекс = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	КодПричиныВывода = МассивПричинВыводаИзОборота[Индекс].КодПричины;
	
	Если КодПричиныВывода = Неопределено Тогда
		Возврат; 
	ИначеЕсли (КодПричиныВывода = "1"
		Или КодПричиныВывода = "16"
		Или КодПричиныВывода = "17")
		И ТекущийРаздел = "Продажа" Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма,"ИдентификаторГосконтракта").Видимость = Истина;
		Если НЕ МестныйКэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
			МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма,"ИдентификаторГосконтракта.Надпись").Видимость = Истина;
		КонецЕсли;
	Иначе
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма,"ИдентификаторГосконтракта").Видимость = Ложь;
		Если НЕ МестныйКэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
			МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма,"ИдентификаторГосконтракта.Надпись").Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыДокумента = Новый Структура("КодПричины", КодПричиныВывода); 
	
	Попытка
		МодульОбъектаКлиент().ИзменитьСкладскойПараметрДокумента(СоставПакета, ПараметрыДокумента);
	Исключение
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ПричинаВыводаПриИзменении");
	КонецПопытки;
	
КонецПроцедуры

// Процедура - устанавливает выбранный параметр участника оборота маркируемой продукции 
//
&НаКлиенте
Процедура УчастникОборотаПриИзменении(Элемент)
	Перем КодУчастикаОборота;
	
	МассивУчастниковОборота = МодульОбъектаКлиент().ПараметрыУчастиковОборота();  
	Для Каждого ЭлМасс ИЗ МассивУчастниковОборота Цикл
		Если ЭлМасс.Причина = УчастникОборота Тогда 
			КодУчастикаОборота = ЭлМасс.КодПричины;
			Прервать; 
		КонецЕсли;
	КонецЦикла;
	
	Если КодУчастикаОборота = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыДокумента = Новый Структура("КодУчастикаОборота", КодУчастикаОборота); 
	
	Попытка
		МодульОбъектаКлиент().ИзменитьСкладскойПараметрДокумента(СоставПакета, ПараметрыДокумента);
	Исключение
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "УчастникОборотаПриИзменении");
	КонецПопытки;
	
	МестныйКэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма,"ОтправитьКодыМаркировки").Видимость = КодУчастикаОборота;  
	
	ПричинаВыводаПриИзменении();

КонецПроцедуры

// Процедура - запускает проверку наличия токена ГИС МТ и инициирует проверку кодов маркировки 
//
&НаКлиенте
Процедура ЗапуститьПроверкуКодовМаркировки(Элемент)  
	
	Перем РезультатПроверкиТокена;
	
	МодульОбъектаКлиент().СоставПакета_ПроверитьБлокировкуДействияВСБИС(СоставПакета);
		
	Попытка
		РезультатПроверкиТокена = МодульОбъектаКлиент().ПроверитьНаличиеТокена(СоставПакета);
	Исключение
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ЗапуститьПроверкуКодовМаркировки");
	КонецПопытки; 
	
	Если РезультатПроверкиТокена = Неопределено Тогда
		Возврат;
	КонецЕсли;
	  
	ОбработатьРезультатПроверкиТокена(РезультатПроверкиТокена); 
	
КонецПроцедуры 

// Процедура - инициирует проверку кодов маркировки или вызывает создание токена ГИС МТ 
//
// Параметры:
//  РезультатПроверкиТокена	 - Структура - результат проверки токена и описание ошибки
//
&НаКлиенте
Процедура ОбработатьРезультатПроверкиТокена(РезультатПроверкиТокена)  
	
	Перем РезультатНаличияТокена;
	
	Если РезультатПроверкиТокена.Свойство("Result",РезультатНаличияТокена)
		И НЕ РезультатНаличияТокена = Неопределено
		И ВРЕГ(РезультатНаличияТокена) = "OK" Тогда   	
		Попытка
			МодульОбъектаКлиент().ИнициироватьПроверкуКодовМаркировки(СоставПакета); 
		Исключение
			МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ОбработатьРезультатПроверкиТокена");
		КонецПопытки; 	
		ЗаполнитьМаркировку(СоставПакета); 
	Иначе
		ОбработчикДиалога = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("СоздатьТокенГИСМТ", ЭтаФорма);
		ТекстВопроса = "Токен, для проверки сведений ГИС МТ, не найден. Создать новый?";
		МодульОбъектаКлиент().СбисПоказатьВопрос(ОбработчикДиалога, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - получает список сертификатов и запускает окно выбора сертификата для создания токена 
//
&НаКлиенте
Процедура СоздатьТокенГИСМТ(РезультатДиалога,ДопПараметры = Неопределено) Экспорт  
	ТекстОшибки = "";
	
	Если Не РезультатДиалога = КодВозвратаДиалога.Да Тогда	
		Возврат;
	КонецЕсли;
	
	Если Не МестныйКэш.СБИС.ОбменВключен Тогда
		Ошибка = Новый Структура("code, message, details", 100, "Не включен обмен с Saby", "Сертификаты не найдены. Выберите способ обмена в настройках соединения.");
		МестныйКэш.ГлавноеОкно.сбисСообщитьОбОшибке(МестныйКэш, Ошибка, Новый Структура("ФормаВладелец, Отправлять", ЭтаФорма, Ложь));
		ТекстОшибки = Ошибка.message;
	КонецЕсли;
	
	//Получим список
	Если ТекстОшибки = "" Тогда
		СписокСертификатовСырой = МестныйКэш.Интеграция.ПолучитьСписокСертификатовДляАвторизации(МестныйКэш,ТекстОшибки);
	КонецЕсли;
	Если	ТекстОшибки = ""
		И	Не	ЗначениеЗаполнено(СписокСертификатовСырой) Тогда
		ТекстОшибки = "Сертификаты не найдены";
	КонецЕсли;  
	
	ОбработчикВыбора = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("РезультатВыбораСертификата", ЭтаФорма);
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаВыборИзСписка = сбисПолучитьФорму("Форма_ВыборИзСписка");
		ФормаВыборИзСписка.СписокДляВыбора = СписокСертификатовСырой;
		ФормаВыборИзСписка.Заголовок ="Выберите сертификат для создания токена ГИС МТ";
		Ответ = ФормаВыборИзСписка.ОткрытьМодально();
		РезультатВыбораСертификата(Ответ);
	#Иначе
		ОткрытьФорму(МестныйКэш.ГлавноеОкно.СбисПутьКФормамОбработки() + "Форма_ВыборИзСписка",Новый Структура("СписокДляВыбора, Заголовок",СписокСертификатовСырой, "Выберите сертификат для создания токена ГИС МТ"),,,,,ОбработчикВыбора);
    #КонецЕсли
КонецПроцедуры   

// Процедура - обрабатывает результат выбора сертификата для создания токена  
//
&НаКлиенте
Процедура РезультатВыбораСертификата(Результат, ДопПараметры = Неопределено) Экспорт 
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("Сертификат",Результат); 
	
	ФормаВводаПинкода = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаВводаПинкода"); 
	
	Если НЕ Результат = Неопределено Тогда
		
		ФормаВводаПинкода.ОписаниеОповещенияОЗакрытии = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("РезультатВводаПинКода",ЭтаФорма,ДопПараметры);
		ФормаВводаПинкода.Показать(Новый Структура("СертификатИмя", Результат.Название));
		
	КонецЕсли;   
	
КонецПроцедуры

// Функция - обрабатывает результат ввода пин кода сертификата для создания токена  
//  
&НаКлиенте
Функция РезультатВводаПинКода(Результат, ДопПараметры = Неопределено) Экспорт    
	
	МодульТекущий = МодульОбъектаКлиент();
	
	МодульФункций = МодульТекущий.ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	
	ПинКод		= Неопределено;
	Отпечаток	= Неопределено;
	
	Если Результат = Неопределено Тогда  
		МодульТекущий.СбисСообщить("Не активирован сертификат для подписания документов.");
		Возврат Ложь; 
	КонецЕсли;
		
	ЕстьДанныеСертификата = Результат.Свойство("ПинКод", ПинКод) 
		И НЕ ДопПараметры = Неопределено
		И ДопПараметры.Свойство("Сертификат")
		И ДопПараметры.Сертификат.Свойство("Отпечаток", Отпечаток); 
		
	Если НЕ ЕстьДанныеСертификата Тогда
		
		МодульТекущий.СбисСообщить("Не активирован сертификат для подписания документов.");
		Возврат Ложь;
		
	КонецЕсли;
		
	Попытка
		ДанныеСертификатаСбис = МодульТекущий.ПолучитьДанныеСертификатаСбис(Отпечаток); 
	Исключение
		МодульТекущий.СообщитьСбисИсключение(ИнформацияОбОшибке(), "РезультатВводаПинКода");
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ДанныеСертификатаСбис) Тогда
		
		МодульТекущий.СбисСообщить("Сертификат, по отпечатку, не найден в Saby");
		Возврат Ложь;
		
	КонецЕсли;  
	
	ИндексСтрокиХэшаАлгоритма	= МодульФункций.ВыбратьДанныеСертификата(ДанныеСертификатаСбис.s,"HashAlgOID","n"); 
	ИндексСтрокиДвоичныхДанных	= МодульФункций.ВыбратьДанныеСертификата(ДанныеСертификатаСбис.s,"Файл","n"); 
	ИндексСтрокиДействителенС	= МодульФункций.ВыбратьДанныеСертификата(ДанныеСертификатаСбис.s,"ДействителенС","n");  
	ИндексСтрокиДействителенПо	= МодульФункций.ВыбратьДанныеСертификата(ДанныеСертификатаСбис.s,"ДействителенПо","n");
	
	Если НЕ ИндексСтрокиХэшаАлгоритма = Неопределено Тогда
		ХэшАлгоритмаШифрования = ДанныеСертификатаСбис.d[ИндексСтрокиХэшаАлгоритма]; 
	Иначе
		ХэшАлгоритмаШифрования = ДанныеСертификатаСбис.d.HashAlgOID;
	КонецЕсли;
	
	Если НЕ ИндексСтрокиДействителенС = Неопределено Тогда
		ДвоичныеДанныеСертификата = ДанныеСертификатаСбис.d[ИндексСтрокиДвоичныхДанных];  
	Иначе
		ДвоичныеДанныеСертификата = ДанныеСертификатаСбис.d.Файл;
	КонецЕсли;	  
	
	Если НЕ ИндексСтрокиДвоичныхДанных = Неопределено Тогда
		ДействителенС = ДанныеСертификатаСбис.d[ИндексСтрокиДействителенС];  
	Иначе
		ДействителенС = ДанныеСертификатаСбис.d.ДействителенС;
	КонецЕсли;  
	
	Если НЕ ИндексСтрокиДвоичныхДанных = Неопределено Тогда
		ДействителенПо = ДанныеСертификатаСбис.d[ИндексСтрокиДействителенПо];  
	Иначе
		ДействителенПо = ДанныеСертификатаСбис.d.ДействителенПо;
	КонецЕсли;
	
	ПараметрыСертификата = Новый Структура();   
	ПараметрыСертификата.Вставить("thumbprint", ДопПараметры.Сертификат.Отпечаток);
	ПараметрыСертификата.Вставить("hashOID", ХэшАлгоритмаШифрования);
	ПараметрыСертификата.Вставить("pin", Результат.ПинКод);  
	ПараметрыСертификата.Вставить("validFrom", ДействителенС);
	ПараметрыСертификата.Вставить("validTo", ДействителенПо);  
	ПараметрыСертификата.Вставить("certData", ДвоичныеДанныеСертификата); 
	
	Попытка
		МодульТекущий.СоздатьТокенСбис(СоставПакета,ПараметрыСертификата);  
	Исключение
		МодульТекущий.СообщитьСбисИсключение(ИнформацияОбОшибке(), "РезультатВводаПинКода");
	КонецПопытки;   
	
	ОбработатьРезультатСозданияТокена();

КонецФункции 

// Процедура - обрабатывает результат создания токена в ГИС МТ  
//  
&НаКлиенте
Процедура ОбработатьРезультатСозданияТокена()
	
	Результат = Неопределено;
	ТокенСоздан = Ложь; 
	ВремяВызова = ТекущаяДата(); 
	
	Пока Истина Цикл
		
		Попытка
			Результат = МодульОбъектаКлиент().ПолучитьРезультатСозданияТокена(СоставПакета);   
		Исключение
			МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ОбработатьРезультатСозданияТокена");
		КонецПопытки;
		
		РезультатСозданияТокена = (Не Результат = Неопределено 
			И Результат.Свойство("Result")); 
		
		Если РезультатСозданияТокена 
			И ВРЕГ(Результат.Result) = "OK" Тогда 
			
			//Получен ответ на запрос, или делаем один проход на чтение	  
			ТокенСоздан = Истина;
			Прервать;   
			
		ИначеЕсли РезультатСозданияТокена 
			И Результат.Result = "Error" Тогда 
			
			МодульОбъектаКлиент().СбисСообщить(Результат.Description);	
			Прервать;

		ИначеЕсли ТекущаяДата() - ВремяВызова > 10 Тогда   
			
			//Установленный на команде таймаут
			Отказ = Истина;  
			СбисИсключение = МодульОбъектаКлиент().НовыйСбисИсключение("ExtSysMarking.CheckGisTask() не вернул ответ за разумное время", "ОбработатьРезультатСозданияТокена");
			МодульОбъектаКлиент().СообщитьСбисИсключение(СбисИсключение);
			Прервать;
			
		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
	КонецЦикла;  
	
	Если ТокенСоздан Тогда
		
    	ЗаполнитьМаркировку(СоставПакета);
		
	КонецЕсли;  
	
КонецПроцедуры   

// Функция - возвращает значение типа цвет, в зависимости результата кода состояния проверки документа 
//
&НаКлиенте
Функция ВернутьЦветСтатуса(КодСостоянияОперации) 
	МассивОшибок = Новый Массив; 
	МассивОшибок.Добавить("10");  
	МассивОшибок.Добавить("13");
	МассивОшибок.Добавить("20");
	МассивОшибок.Добавить("23");
	МассивОшибок.Добавить("30");
	
	МассивУспех = Новый Массив; 
	МассивУспех.Добавить("3"); 
	МассивУспех.Добавить("22");
	
	ИндексОшибок = МассивОшибок.Найти(КодСостоянияОперации);
	ИндексУспех = МассивУспех.Найти(КодСостоянияОперации);
	
	Если НЕ ИндексОшибок = Неопределено Тогда 
		Возврат Новый Цвет(255,0,0);   
	ИначеЕсли НЕ ИндексУспех = Неопределено Тогда
		Возврат Новый Цвет(0,128,0); 
	Иначе 
		Возврат Новый Цвет(0,0,0);;
	КонецЕсли;
	
КонецФункции

// Процедура - запускает проверку статуса документа в ГИС МТ. 
//
&НаКлиенте
Процедура СтатусДокументаГИСМТ(Элемент)  
	
	Попытка
		Результат = МодульОбъектаКлиент().ПроверитьСтатусПроверкиГИСМТ(СоставПакета);    
	Исключение
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "СтатусДокументаГИСМТ");
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыСообщения = Новый Структура;  
	ПараметрыСообщения.Вставить("АдресСсылка",);  
	ПараметрыСообщения.Вставить("ТекстСсылка",);
	Если Результат.Messages.Количество() Тогда
		ПараметрыСообщения.Вставить("Текст", Результат.Messages[0][0]);
		сбисПолучитьФорму("ФормаПредупреждения").ПоказатьПоверх(ПараметрыСообщения); 
	КонецЕсли;
		
КонецПроцедуры

// Процедура - запускает отправку кодов документа в ГИС МТ. 
//  
&НаКлиенте
Процедура ОтправитьКодыМаркировки(Элемент)  
	
	Идентификатор = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "ИдентификаторСБИС");  
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		
		Возврат;
		
	КонецЕсли; 
	    	
	Попытка  
		
		Результат = МодульОбъектаКлиент().ОтправитьКодыМаркировкиВГИС(СоставПакета); 
		
	Исключение  
		
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ОтправитьКодыМаркировки");   
		Возврат;    
		
	КонецПопытки;    
	
	Если Результат Тогда    
		
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "СтатусДокументаГИСМТ").ЦветТекста = Новый Цвет(28,85,174); 
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "СтатусДокументаГИСМТ").Заголовок = "Регистрация в ГИС МТ";
	
		ЗаполнитьМаркировку(СоставПакета); 
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура запускает проверку кодов РНПТ
// 
&НаКлиенте
Процедура ПроверитьРНПТ(Команда)
	
	Попытка
		Результат = МодульОбъектаКлиент().ПроверитьПрослеживаемыеПозиции(СоставПакета);
	Исключение
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ПроверитьРНПТ");
	КонецПопытки; 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	РасшифровкаСостояния = МестныйКэш.ОбщиеФункции.СостояниеПрослеживаемостиПоКоду(Строка(Результат));
	сбисЭлементФормы(ЭтаФорма,"СтатусДокументаГИСМТ").Заголовок = РасшифровкаСостояния;  
	ЦветСтатуса = ВернутьЦветСтатуса(Строка(Результат)); 
	сбисЭлементФормы(ЭтаФорма,"СтатусДокументаГИСМТ").ЦветТекста = ЦветСтатуса;  
	
	ЗаполнитьПрослеживаемость(СоставПакета);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ОбновитьДанныеДокументаСБИС(СоставПакета);
	ОбработчикРезультата = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("СоставПакета_Записать_Завершить", МодульОбъектаКлиент(), Новый Структура);
	
	ПараметрыЗаписать = Новый Структура("ЗапуститьВДокументооборот, ОбработчикРезультата", Ложь, ОбработчикРезультата);
	МодульОбъектаКлиент().СоставПакета_Записать(СоставПакета, ПараметрыЗаписать);
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Записать").Видимость = Ложь;
	
	ВложенияПакета = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "Вложение");
	Если ВложенияПакета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Вложение Из ВложенияПакета Цикл
		
		XMLДокумента = МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "XMLДокумента");
		ОбновитьВизуализацию = МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "ОбновитьВизуализацию");
		
		Если ЗначениеЗаполнено(XMLДокумента)
			И ОбновитьВизуализацию = Истина Тогда
			ТекстHTML = МестныйКэш.Интеграция.ПолучитьHTMLПоXML(МестныйКэш, Вложение);
			Вложение.Вставить("ТекстHTML",ТекстHTML);
			Вложение.Удалить("ОбновитьВизуализацию");
		КонецЕсли;
	
	КонецЦикла;
	
	Элемент = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаДокументов");
	
	Если ПараметрыРаботы.Свойство("ТекущийИдентификатор") Тогда
		ПараметрыРаботы.Удалить("ТекущийИдентификатор")
	КонецЕсли;
	
	ТаблицаДокументовПриАктивизацииЯчейки(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	ОтметитьВсе = Не ОтметитьВсе;
	НоменклатураОтметитьВсеОбработчик();
	
КонецПроцедуры

