
&НаКлиенте
Процедура Документ1СВыборВариантаСписокПослеДиалога(ПараметрыУстановитьВходящие, ДопПараметры = Неопределено) Экспорт

	Если ПараметрыУстановитьВходящие = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	ВложениеСБИС		= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма,"ТаблицаДокументов").ТекущиеДанные.Вложение[0].Значение;
	ПараметрыПросмотр	= МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "Просмотр", "ФормаПросмотрДокумента");

	ПараметрыПросмотр.Удалить("ВариантыОбработкиДокумента");

	РедактируемыеПоляВложения	= МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "Поля1С");
	ПараметрыПросмотр.Вставить("ПараметрыДокумент", ПараметрыУстановитьВходящие.Значение);
	
	Документ1СВыборВариантаУстановить(ВложениеСбис, ПараметрыУстановитьВходящие.Значение); 
	ОбновитьПоляФормыПоВложениюСБИС(ВложениеСбис);

КонецПроцедуры

&НаКлиенте
Процедура Документ1СВыборВариантаУстановить(ВложениеСбис, ПараметрыУстановитьВходящие) Экспорт

	МодульТекущий	= МодульОбъектаКлиент();
	ЭлементДокумент = МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "Документ1С");
	
	ЧтоИзменить = Новый ФиксированнаяСтруктура("УстановитьОграничениеТипа", ПараметрыУстановитьВходящие.Тип);
	МодульТекущий.ИзменитьЭлементФормыОбработки(ЭлементДокумент, ЧтоИзменить);
	Документ1С = ПараметрыУстановитьВходящие.Значение;
	
КонецПроцедуры

// Процедура осуществляет переход по вкладкам формы	
&НаКлиенте
Процедура КонтентВыборЗакладки(ИмяПанели)
	
	ПанельСтраницы = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Контент");
	ПанельСтраницы.ТекущаяСтраница = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ПанельСтраницы, ИмяПанели);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОтметитьВсеОбработчик()
	
	СтруктураФайлаВложения = МодульОбъектаКлиент().ВложениеСбис_Получить(Вложение, "УстановленныйПодразделИни");
	Если СтруктураФайлаВложения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПутьТаблДок	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаДокументов").ТекущиеДанные.ПутьТаблДок;
	ТаблДок		= МестныйКэш.ОбщиеФункции.РассчитатьЗначениеИзСтруктуры(ПутьТаблДок, Вложение.СтруктураФайла);
	Для Каждого Строка Из ЭтаФорма.ТабличнаяЧасть Цикл
		Строка.Отмечен = ОтметитьВсе;   
		Если ОтметитьВсе Тогда
			ТаблДок[Строка.НомерПП-1].Удалить("НеЗагружать");
		Иначе
			ТаблДок[Строка.НомерПП-1].Вставить("НеЗагружать");
		КонецЕсли;
	КонецЦикла;    
	ЗаполнитьТаблицуДокументов(СоставПакета);
	
КонецПроцедуры

// Процедура - обновляет данные состава пакета по заполненным параметрам формы
//
// Параметры:
//  СоставПакетаОбновить - СоставПакета	 - в который вносятся изменения формы
//
&НаКлиенте
Процедура ОбновитьДанныеДокументаСБИС(СоставПакетаОбновить)

	// Только после пользовательских манипуляций. Каждый раз не надо
	Если МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "ПерегенерироватьВложения") <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнение заполненных позиций ГК
	Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПоддержкаОбменаЕИС") Тогда
		
		Изменения = Новый Структура("Номенклатура", Новый Соответствие);
		
		Для Каждого СтрокаНоменклатуры Из МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ТаблицаМаркировка, "Строки") Цикл
		
			Ключ = Строка(СтрокаНоменклатуры.НомерПП);
			Изменения.Номенклатура.Вставить(Ключ, Новый Структура("ПозГК", СтрокаНоменклатуры.ПозГК));
		
		КонецЦикла;
	
		МодульОбъектаКлиент().СоставПакета_Обновить(СоставПакетаОбновить, Изменения);
		
	КонецЕсли;
	
	// Заполнение доп полей документа
	Если ДополнительныеПараметрыДокумента.Количество() Тогда

		Изменения = Новый Структура("ПараметрыДокумента", Новый Массив);
		
		Для каждого ПараметрДокумента Из ДополнительныеПараметрыДокумента Цикл
			ОписаниеПараметра = Новый Структура("Имя, Значение", ПараметрДокумента.ИмяПараметра, ПараметрДокумента.ЗначениеПараметра);
			Изменения.ПараметрыДокумента.Добавить(ОписаниеПараметра);
		КонецЦикла;
	
		МодульОбъектаКлиент().СоставПакета_Обновить(СоставПакетаОбновить, Изменения);
	КонецЕсли;

	// Перегенерация модифицированных вложений.
	ОснованиеПакета = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакетаОбновить, "ОсновнойДокумент1С");
	
	ПараметрыГенерацииПакетов = Новый Структура("Кэш", Кэш);
	ПараметрыГенерацииПакетов.Вставить("ОснованиеПакета", ОснованиеПакета);

	Для Каждого  Вложение Из МодульОбъектаКлиент().СоставПакета_Получить(СоставПакетаОбновить, ИмяРеквизитаВложений) Цикл
		
		// Если были изменения во вложении, необходимо записать черновик, иначе нет смысла
		Если Не МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "Перегенерировать") Тогда
			
			Продолжить;
			
		КонецЕсли;
			
		ПараметрыГенерацииПакетов = Новый Структура("Кэш", Кэш);
		ПараметрыГенерацииПакетов.Вставить("Вложение", Вложение);
		ПараметрыГенерацииПакетов.Вставить("СтруктураДокумента", МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "СтруктураФайла"));
		РезультатГенерации = МодульОбъектаКлиент().СгенерироватьНаборВложенийВПакет(ПараметрыГенерацииПакетов);
		
		МодульОбъектаКлиент().СоставПакета_Обновить(СоставПакетаОбновить, Новый Структура("Вложения", РезультатГенерации));
			
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоляФормыПоДокументуСБИС(СоставПакетаСБИС)  
	Перем СостояниеПакета;         
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "СтатусДокументаГИСМТ").Заголовок = "";

	УстановитьВидимостьЭлементовВкладкиМаркировка(СоставПакетаСБИС); 
	УстановитьВидимостьЭлементовВкладкиПрослеживаемость(СоставПакетаСБИС);
	УстановитьКонтрагентыСопоставление(СоставПакетаСБИС);
	УстановитьВидимостьЭлементовВкладкиТранспортныеУпаковки(СоставПакетаСБИС);
	ОбновитьДопПоляДокумента(СоставПакетаСБИС);
	
	МодульТекущий	= МодульОбъектаКлиент();
	
	ПараметрыПакета = МодульТекущий.СоставПакета_Получить(СоставПакетаСБИС, "Параметры");
	ЗагрузкаПоддерживается	= Не	ПараметрыПакета.Свойство("ЗагрузкаПоддерживается")
							Или		ПараметрыПакета.ЗагрузкаПоддерживается;
							
	ПакетРазобран			= 	(ДокументУчетаРазобран	И ИмяРеквизитаВложений = "ВложениеУчета")
							Или (ДокументРазобран		И ИмяРеквизитаВложений = "Вложение");
		
	ВыборочноеШифрование	=	ПараметрыПакета.Свойство("ВыборочноеШифрование")
							И	ПараметрыПакета.ВыборочноеШифрование
							И	МодульТекущий.ПолучитьЗначениеПараметраСБИС("Шифрование")
							И	МодульТекущий.ПолучитьЗначениеПараметраСБИС("ШифроватьВыборочно");
							
	ОтмечатьДокументы		=	Не	ПараметрыПакета.Свойство("ОтмечатьВложения")
							Или		ПараметрыПакета.ОтмечатьВложения;
							
	УдалятьДокументы		=	ПараметрыПакета.Свойство("УдалятьВложения")
							И	ПараметрыПакета.УдалятьВложения; 
							
	ЕстьАннулирование		=   ПараметрыПакета.Свойство("Аннулирование")
							И	ПараметрыПакета.Аннулирование
							И	Не	(	СоставПакетаСБИС.Свойство("Состояние",	СостояниеПакета)
									И	СоставПакетаСБИС.Свойство("Название",	СостояниеПакета)
									И	СостояниеПакета = "Отозван мной");
	
	ПараметрыРаботы.Вставить("ЗагрузкаПоддерживается", ЗагрузкаПоддерживается);
	
	Заголовок		= МодульТекущий.СоставПакета_Получить(СоставПакетаСБИС, "Название");
	ЗаголовокПакета = МодульТекущий.СоставПакета_Получить(СоставПакетаСБИС, "Название");

	Если	МодульТекущий.ПрименятьФункционалНовыеКонтрагенты(Новый Структура("СоставПакета", СоставПакетаСБИС)) Тогда
		
		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "УчетОрганизация").Доступность		= ПакетРазобран;
		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "УчетКонтрагент").Доступность			= ПакетРазобран;
		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "УчетГрузополучатель").Доступность	= ПакетРазобран;
		
		// Заполнить стороны по документу
		ДанныеСторон = МодульТекущий.СоставПакета_Получить(СоставПакета, "ДанныеСторон");
		Если Не ДанныеСторон = Неопределено Тогда
		
			Если		ДанныеСторон.Свойство("ДанныеОрганизации")
				И Не	ДанныеСторон.ДанныеОрганизации.Ссылка = Неопределено Тогда 
				
				УчетОрганизация = ДанныеСторон.ДанныеОрганизации.Ссылка;
				
			КонецЕсли;
			Если		ДанныеСторон.Свойство("ДанныеКонтрагента")
				И Не	ДанныеСторон.ДанныеКонтрагента.Ссылка = Неопределено Тогда
				
				УчетКонтрагент = ДанныеСторон.ДанныеКонтрагента.Ссылка;
				
			КонецЕсли;
			Если		ДанныеСторон.Свойство("ДанныеГрузополучателя")
				И Не	ДанныеСторон.ДанныеГрузополучателя.Ссылка = Неопределено Тогда
				
				УчетГрузополучатель = ДанныеСторон.ДанныеГрузополучателя.Ссылка;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПакетКомментарий").Доступность =	ПараметрыПакета.Свойство("УказыватьКомментарий");
	
	// Определение видимости вкладок																						
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "Контент.Загрузка").Видимость		= ЗагрузкаПоддерживается;
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "Контент.Прохождение").Видимость	= СоставПакетаСБИС.Свойство("Событие");
	
	ТекущийРаздел = МестныйКэш.Разделы["р"+МестныйКэш.Текущий.Раздел];
	Если МодульТекущий.ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры_ОбратноеСопоставление")
		И ТекущийРаздел = "Продажа" Тогда
		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаДокументов.Статус").Видимость			= Истина;
		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаДокументов.СтатусКартинка").Видимость	= Истина;
	Иначе
		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаДокументов.Статус").Видимость			= ПакетРазобран И ЗагрузкаПоддерживается;
		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаДокументов.СтатусКартинка").Видимость	= ПакетРазобран И ЗагрузкаПоддерживается;
	КонецЕсли;
	
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаДокументов.Шифрование").Видимость		= ВыборочноеШифрование;
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаДокументов.Отмечен").Видимость		= ОтмечатьДокументы;
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаДокументов.Удалить").Видимость		= УдалятьДокументы;
	
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПодготовитьКЗагрузке").Видимость	= Не ПакетРазобран;
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ЗагрузитьНаВложении").Видимость	= ПакетРазобран;

	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ГруппаАбонЯщик").Видимость	=	ПараметрыПакета.Свойство("АбонентскийЯщик")
																						И	ПараметрыПакета.АбонентскийЯщик;																					
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма,"ПереключитьТипВложений").Видимость =	СоставПакетаСБИС.Свойство("ВложениеУчета")
																							И	СоставПакетаСБИС.ВложениеУчета.Количество();
																	
	ЗаполнитьТаблицуДокументов(СоставПакетаСБИС);
																						
КонецПроцедуры

// Процедура обновляет информацию по вложению (просмотр, прохождение, сопоставление номенклатуры) при переключении между вложениями в таблице
&НаКлиенте
Процедура ОбновитьПоляФормыПоВложениюСБИС(ВложениеСБИС)
	
	УстановитьДанныеПоВложениюСБИС(ВложениеСБИС);
	УстановитьВидимостьПоВложениюСБИС(ВложениеСБИС);
	
	СтатусВложение = МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "Статус");
	Если СтатусВложение = "Ошибка" Тогда
		
		ОшибкаВложение = МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "СтатусыВложения").Ошибка;
		МодульОбъектаКлиент().СообщитьСбисИсключение(ОшибкаВложение, Новый Структура("ИмяКоманды", "ФормаПросмотрДокумента.ОбновитьПоляФормыПоВложениюСБИС"));
		Возврат;
		
	КонецЕсли;
	
	ОбновитьСтатусыСопоставления(ВложениеСБИС);
	
КонецПроцедуры

// Процедура - установить статус и картинку по вложению
//
// Параметры:
//  СтрокаТаблицыДокументов	 - 	 - 
//  ВложениеСБИС			 - 	 - 
//
&НаКлиенте
Процедура ОбновитьСтрокуТаблицыДокументов(СтрокаТаблицыДокументов)

	ВложениеСБИС		= СтрокаТаблицыДокументов.Вложение[0].Значение;
	ПараметрыПоВложению	= МодульОбъектаКлиент().ВложениеСБИС_МожемЗагрузитьВ1С(ВложениеСБИС);

	СтатусКартинка		= 0;
	МожемЗагрузитьВ1С	= Ложь;
	СтатусСтрока		= ПараметрыПоВложению.Статус;

	Если	Не	ПараметрыПоВложению.МожноЗагрузить Тогда
		
		МожемЗагрузитьВ1С		= Ложь;
		
	ИначеЕсли	ПараметрыПоВложению.Проблемы.Количество() Тогда
		
		// Проблемы по номенклатуре определяются диалогом
		ПараметрыПоВложению.Проблемы.Удалить("Номенклатура");
		МожемЗагрузитьВ1С		= Не ПараметрыПоВложению.Проблемы.Количество();
		СтатусКартинка			= 1;
		
	Иначе
	
		МожемЗагрузитьВ1С	= Истина;
		Документы1С			= МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "Документы1С");
		Если Документы1С.Количество() Тогда 
			
			СтатусСтрока	= СокрЛП(СтатусСтрока + " Возможно перезаполнение.");
			СтатусКартинка	= 3;
			
			Если ЗначениеЗаполнено(ВложениеСБИС.Документ1СПроведен) И ВложениеСБИС.Документ1СПроведен Тогда
				
				СтатусСтрока = СокрЛП(СтатусСтрока + " Необходимо отменить проведение документа.");
				
			КонецЕсли;
			
		Иначе
			
			СтатусСтрока	= СокрЛП(СтатусСтрока + " Загрузка возможна.");
			СтатусКартинка	= 2;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СтрокаТаблицыДокументов.Статус				= СтатусСтрока;
	СтрокаТаблицыДокументов.СтатусКартинка		= СтатусКартинка;
	СтрокаТаблицыДокументов.МожемЗагрузитьВ1С	= Число(МожемЗагрузитьВ1С);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	// Закрытие формы просмотра при закрытии обработки	
	Если ИмяСобытия = "ЗакрытьСБИС" Тогда
		
		Если ЭтаФорма.Открыта() Тогда
			
			ВыполнитьЗакрытиеФормы = Истина;
			ЭтаФорма.Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

//Обработка сопоставления
&НаКлиенте
Процедура СбисСтрокаТабличнаяЧастьПриИзменении(ВходящийКэш, ТабЧасть)
	
	Если Кэш = Неопределено Тогда
		Кэш = ВходящийКэш;
	КонецЕсли;
	
	МодульФункций = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	
	СтрокаТабЧасти	= ТабЧасть;
	Если СтрокаТабЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТабЧасти.КодПокупателя) И Не СтрокаТабЧасти.КодПокупателя = "-" Тогда
		ИмяПоиска = "КодПокупателя";
	ИначеЕсли ЗначениеЗаполнено(СтрокаТабЧасти.Идентификатор) И Не СтрокаТабЧасти.Идентификатор = "-" Тогда
		ИмяПоиска = "Идентификатор";
	ИначеЕсли ЗначениеЗаполнено(СтрокаТабЧасти.Код) И Не СтрокаТабЧасти.Код = "-" Тогда
		ИмяПоиска = "Код";
	ИначеЕсли ЗначениеЗаполнено(СтрокаТабЧасти.Название) И Не СтрокаТабЧасти.Название = "-" Тогда
		ИмяПоиска = "Название";
	Иначе
		ИмяПоиска = "НомерПП";
	КонецЕсли;
	ЗначениеПоиска = СтрокаТабЧасти[ИмяПоиска];
	
	ДанныеНоменклатуры = Новый Структура("НомерПП, Название, КодПокупателя, Идентификатор, Код, Номенклатура, Характеристика, ХарактеристикаПоставщика, GTIN, ЕдИзм, ЕдИзмОрг, Коэффициент");
    ЗаполнитьЗначенияСвойств(ДанныеНоменклатуры, СтрокаТабЧасти);
	
	КлючиПоискаТЧ = Новый Структура;
	КлючиПоискаТЧ.Вставить(ИмяПоиска,	ДанныеНоменклатуры[ИмяПоиска]);
	
	ИзмененыКлючиНоменклатура	= Новый Структура;
	УспешноЗаписаноИзменение	= Ложь;
	ЕстьИзмененияСтроки			= Ложь;
	ЕстьИзмененияНоменклатуры	= Ложь;
	Для Каждого КлючИЗначениеСтрДоИзм Из СтрокаТЧДоИзменения.Номенклатура Цикл
		Если СтрокаТабЧасти[КлючИЗначениеСтрДоИзм.Ключ] = КлючИЗначениеСтрДоИзм.Значение Тогда
			Продолжить;
		ИначеЕсли	КлючИЗначениеСтрДоИзм.Ключ = "Номенклатура"
					И Не ЗначениеЗаполнено(ДанныеНоменклатуры.Номенклатура) Тогда
			// Очищаем все позиции с такой же номенклатурой и характеристикой
			ИзмененыКлючиНоменклатура.Вставить("Номенклатура");
			ИзмененыКлючиНоменклатура.Вставить("ХарактеристикаНоменклатуры");
			ИзмененыКлючиНоменклатура.Вставить("ЕдИзмОрг");
			ИзмененыКлючиНоменклатура.Вставить("Коэффициент");
			
			КлючиПоискаТЧ.Вставить("Номенклатура",					СтрокаТЧДоИзменения.Номенклатура.Номенклатура);
			КлючиПоискаТЧ.Вставить("ХарактеристикаНоменклатуры",	СтрокаТЧДоИзменения.Номенклатура.Характеристика);
		ИначеЕсли КлючИЗначениеСтрДоИзм.Ключ = "Характеристика" Тогда
			// Изменяем только позиции с той же номенклатурой и идентификатором
			КлючиПоискаТЧ.Вставить("Номенклатура",					СтрокаТЧДоИзменения.Номенклатура.Номенклатура);
			ИзмененыКлючиНоменклатура.Вставить("ХарактеристикаНоменклатуры", СтрокаТабЧасти[КлючИЗначениеСтрДоИзм.Ключ]);
		Иначе
			ИзмененыКлючиНоменклатура.Вставить(КлючИЗначениеСтрДоИзм.Ключ, СтрокаТабЧасти[КлючИЗначениеСтрДоИзм.Ключ]);
		КонецЕсли;
		
		ЕстьИзмененияНоменклатуры = Истина;
		ЕстьИзмененияСтроки = Истина;
		Прервать;
	КонецЦикла;
	Если Не ЕстьИзмененияСтроки Тогда
		Для Каждого КлючИЗначениеСтрДоИзм Из СтрокаТЧДоИзменения.Прочее Цикл
			Если СтрокаТабЧасти[КлючИЗначениеСтрДоИзм.Ключ] = КлючИЗначениеСтрДоИзм.Значение Тогда
				Продолжить;
			КонецЕсли;
			ЕстьИзмененияСтроки = Истина;
			Прервать;
		КонецЦикла;
		Если Не ЕстьИзмененияСтроки Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		
		ДанныеСтруктурыФайла		= МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "ДанныеСтруктурыФайла");
		КонтрагентДляСопоставления	= МодульОбъектаКлиент().ВложениеСбис_Получить(Вложение, "СторонаПоРоли", "СопоставлениеНоменклатуры");
		
	Исключение
		
		МодульОбъектаКлиент().СбисСообщить(ИнформацияОбОшибке(), "ФормаПросмотрДокумента.СбисСтрокаТабличнаяЧастьПриИзменении");
		Возврат;
		
	КонецПопытки;
	
	ПутьТаблДок = ДанныеСтруктурыФайла.Синонимы.Получить("ТабличнаяЧасть_ПутьКДанным");
	Если Не ЗначениеЗаполнено(ПутьТаблДок)Тогда
		
		МодульОбъектаКлиент().СбисСообщить("Отсутствуют требуемые данные для записи сопоставления");
		Возврат;
		
	КонецЕсли; 
	
	//Если меняли номенлклатуру, то запишем.
	Если ЕстьИзмененияНоменклатуры Тогда
		фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("УстановитьСоответствиеНоменклатуры", Кэш.ФормаРаботыСНоменклатурой, "", Кэш);
		Попытка
			фрм.УстановитьСоответствиеНоменклатуры(КонтрагентДляСопоставления, ДанныеНоменклатуры, Кэш.Парам.КаталогНастроек, Кэш.Ини);
			УспешноЗаписаноИзменение = Истина;
		Исключение
			СбисИсключение = Кэш.ОбщиеФункции.СбисИсключение(ИнформацияОбОшибке(), "ФормаПросмотрДокумента.СбисЗаписатьСопоставление",,"Ошибка записи сопоставления");
			Кэш.ГлавноеОкно.СбисСообщитьОбОшибке(Кэш, СбисИсключение, Новый Структура("ФормаВладелец", ЭтаФорма));
		КонецПопытки;
	КонецЕсли;
	
	НомерПП = СтрокаТабЧасти.НомерПП-1;
	ТаблДок = Кэш.ОбщиеФункции.РассчитатьЗначениеИзСтруктуры(ПутьТаблДок, Вложение.СтруктураФайла);
	ТаблДок[НомерПП].Вставить("Номенклатура",				ДанныеНоменклатуры.Номенклатура);
	ТаблДок[НомерПП].Вставить("ХарактеристикаНоменклатуры",	ДанныеНоменклатуры.Характеристика);
	ТаблДок[НомерПП].Вставить("ЕдИзмОрг",					ДанныеНоменклатуры.ЕдИзмОрг);
	ТаблДок[НомерПП].Вставить("Коэффициент",				ДанныеНоменклатуры.Коэффициент);
	Если СтрокаТабЧасти.Отмечен Тогда
		ТаблДок[НомерПП].Удалить("НеЗагружать");
	Иначе
		ТаблДок[НомерПП].Вставить("НеЗагружать");
	КонецЕсли;
	
	Если	УспешноЗаписаноИзменение
		И	ИзмененыКлючиНоменклатура.Количество() Тогда
		
		ИмяФормыОбработки = "Файл_Шаблон";
		Если НЕ Вложение.ВерсияФорматаДляЗагрузки = "3_01" Тогда
			ИмяФормыОбработки = ИмяФормыОбработки + "_" + Вложение.ВерсияФорматаДляЗагрузки; 
		КонецЕсли;
		
		ПараметрыОбработать = Новый Структура("Ключи, Изменить, Таблица", КлючиПоискаТЧ, ИзмененыКлючиНоменклатура, ТаблДок);
		
		МодульОбработкиВложения = МодульОбъектаКлиент().ПолучитьФормуОбработки(ИмяФормыОбработки);
		МодульОбработкиВложения.ОбработатьТабличнуюЧастьДокумента(ПараметрыОбработать, Кэш);
		
	КонецЕсли;
	
	СтрокаТЧУстановить = Новый Структура("НомерПП", СтрокаТабЧасти.НомерПП);
	ЗаполнитьДокументДаннымиЭД(Вложение);
	ЗаполнитьТаблицуДокументов(СоставПакета);

	Если ЗначениеПоиска = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ПодключитьОбработчикОжидания("СбисСпозиционироватьСтроку", 0.1, Истина);
	
КонецПроцедуры

//Позиционирует строку в ТЧ после обновления
&НаКлиенте
Процедура СбисСпозиционироватьСтроку() Экспорт

	ПараметрыПросмотр = МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "Просмотр", "ФормаПросмотрДокумента");
	КлючТЧСопоставления = "ТабличнаяЧасть" + ПараметрыПросмотр.ПараметрыНоменклатуры.КлючСопоставления;

	ТабЧасть	= СбисЭлементФормы(ЭтаФорма, КлючТЧСопоставления);
	Строка		= СопоставлениеНоменклатуры.НайтиСтроки(СтрокаТЧУстановить);
	Если Строка.Количество() Тогда
		СтрокаУстановить = Строка[0];
		#Если Не ТолстыйКлиентОбычноеПриложение Тогда 
			СтрокаУстановить = СтрокаУстановить.ПолучитьИдентификатор();
		#КонецЕсли
	Иначе
		Возврат;
	КонецЕсли;
	ТабЧасть.ТекущаяСтрока = СтрокаУстановить;		
КонецПроцедуры

//Запись до изменений
&НаКлиенте
Процедура СбисСтрокаТабличнаяЧастьДоИзменения(ВходящийКэш, ТабЧасть) 
	
	Если Кэш = Неопределено Тогда
		Кэш = ВходящийКэш;
	КонецЕсли;

	НоменклатураОписание	= Новый Структура("Номенклатура, Характеристика, ЕдИзмОрг, Коэффициент");
	ПрочееОписание			= Новый Структура("Отмечен");
    ЗаполнитьЗначенияСвойств(НоменклатураОписание,	ТабЧасть);
    ЗаполнитьЗначенияСвойств(ПрочееОписание,		ТабЧасть);
	
	СтрокаТЧДоИзменения = Новый Структура("Номенклатура, Прочее", НоменклатураОписание, ПрочееОписание);
	
КонецПроцедуры

&НаКлиенте
Процедура СбисСтрокаТабличнаяЧастьНоменклатураНачалоВыбора(ВходящийКэш, Элемент, СтандартнаяОбработка)
	
	Если Кэш = Неопределено Тогда
		Кэш = ВходящийКэш;
	КонецЕсли;

	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("сбисТабличнаяЧастьНоменклатураНачалоВыбора","ФормаПросмотрДокумента","", Кэш);
	Если Не фрм = Ложь Тогда
		фрм.сбисТабличнаяЧастьНоменклатураНачалоВыбора(Кэш, ЭтаФорма, Элемент, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СбисСтрокаТабличнаяЧастьХарактеристикаНачалоВыбора(ВходящийКэш, Элемент, СтандартнаяОбработка) 
	
	Если Кэш = Неопределено Тогда
		Кэш = ВходящийКэш;
	КонецЕсли;

	СтандартнаяОбработка=Ложь;
	Если Не ЗначениеЗаполнено(сбисЭлементФормы(ЭтаФорма,"ТабличнаяЧастьСопоставлениеНоменклатуры").ТекущиеДанные.Номенклатура) Тогда
		Сообщить("Заполните номенклатуру");
	КонецЕсли;
	
	Если Кэш.Ини.Конфигурация.Свойство("ХарактеристикиНоменклатуры") Тогда
		ИмяСправочникаХарактеристикиНоменклатуры = СокрЛП(Сред(Кэш.Ини.Конфигурация.ХарактеристикиНоменклатуры.Значение, Найти(Кэш.Ини.Конфигурация.ХарактеристикиНоменклатуры.Значение, ".")+1));
	Иначе
		ИмяСправочникаХарактеристикиНоменклатуры="ХарактеристикиНоменклатуры";
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	
		Форма = Справочники[ИмяСправочникаХарактеристикиНоменклатуры].ПолучитьФормуВыбора(,Элемент);
		Форма.ПараметрВыборПоВладельцу = сбисЭлементФормы(ЭтаФорма,"ТабличнаяЧастьСопоставлениеНоменклатуры").ТекущиеДанные.Номенклатура;
    
	#Иначе
		
		ПараметрыФормыВыбора = Новый Структура();
		
		Если Лев(ИмяОтбораХарактеристики,6) = "Отбор." Тогда
			ИмяОтбора = Сред(ИмяОтбораХарактеристики, 7);
			ПараметрыФормыВыбора.Вставить("Отбор", Новый Структура(ИмяОтбора,Элементы.ТабличнаяЧастьСопоставлениеНоменклатуры.ТекущиеДанные.Номенклатура));
		Иначе
			ПараметрыФормыВыбора.Вставить(ИмяОтбораХарактеристики, Элементы.ТабличнаяЧастьСопоставлениеНоменклатуры.ТекущиеДанные.Номенклатура);
		КонецЕсли;
		
		ПараметрыФормыВыбора.Вставить("РежимВыбора", Истина);
		ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Ложь);
		
		Форма = ПолучитьФорму("Справочник." + ИмяСправочникаХарактеристикиНоменклатуры + ".ФормаВыбора", ПараметрыФормыВыбора, Элемент);
	
	#КонецЕсли
	
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СбисСтрокаТабличнаяЧастьЕдиницаНачалоВыбора(ВходящийКэш, Элемент, СтандартнаяОбработка) 
	
	Если Кэш = Неопределено Тогда
		Кэш = ВходящийКэш;
	КонецЕсли;

	СтандартнаяОбработка=Ложь;
	Если Не ЗначениеЗаполнено(сбисЭлементФормы(ЭтаФорма,"ТабличнаяЧастьСопоставлениеНоменклатуры").ТекущиеДанные.Номенклатура) Тогда
		Сообщить("Заполните номенклатуру");
	КонецЕсли;
	
	ИмяСправочникаЕдИзм = Кэш.ОбщиеФункции.РассчитатьЗначение("ЕдиницыИзмеренияНоменклатуры", Кэш.Ини.Конфигурация, Кэш);
	ИмяСправочникаКлассификаторЕдИзм = Кэш.ОбщиеФункции.РассчитатьЗначение("КлассификаторЕдиницИзмерения", Кэш.Ини.Конфигурация, Кэш);
	Если ЗначениеЗаполнено(ИмяСправочникаЕдИзм) Тогда
		ИмяСправочникаЕдиницыИзмеренияНоменклатуры = СокрЛП(Сред(ИмяСправочникаЕдИзм, Найти(ИмяСправочникаЕдИзм, ".")+1));
	ИначеЕсли ЗначениеЗаполнено(ИмяСправочникаКлассификаторЕдИзм) Тогда
		ИмяСправочникаЕдиницыИзмеренияНоменклатуры = СокрЛП(Сред(ИмяСправочникаКлассификаторЕдИзм, Найти(ИмяСправочникаКлассификаторЕдИзм, ".")+1));
	Иначе
		ИмяСправочникаЕдиницыИзмеренияНоменклатуры = Кэш.ОбщиеФункции.ТипСправочникаЕдиницПоМетаданным();
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Форма = Справочники[ИмяСправочникаЕдиницыИзмеренияНоменклатуры].ПолучитьФормуВыбора(,Элемент);
		Форма.ПараметрВыборПоВладельцу = сбисЭлементФормы(ЭтаФорма,"ТабличнаяЧастьСопоставлениеНоменклатуры").ТекущиеДанные.Номенклатура;
    #Иначе
		П = Новый Структура();
		Если Лев(ИмяОтбораХарактеристики,6) = "Отбор." Тогда
			ИмяОтбора = Сред(ИмяОтбораХарактеристики, 7);
			П.Вставить("Отбор", Новый Структура(ИмяОтбора,Элементы.ТабличнаяЧастьСопоставлениеНоменклатуры.ТекущиеДанные.Номенклатура));
		Иначе
			П.Вставить(ИмяОтбораХарактеристики, Элементы.ТабличнаяЧастьСопоставлениеНоменклатуры.ТекущиеДанные.Номенклатура);
		КонецЕсли;
		Форма = ПолучитьФорму("Справочник." + ИмяСправочникаЕдиницыИзмеренияНоменклатуры + ".ФормаВыбора", П, Элемент);
	#КонецЕсли
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СбисСтрокаТабличнаяЧастьЕдИзмОргНачалоВыбора(ВходящийКэш, Элемент, СтандартнаяОбработка)      
	
	Если Кэш = Неопределено Тогда
		Кэш = ВходящийКэш;
	КонецЕсли;
	
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("сбисТабличнаяЧастьЕдИзмОргНачалоВыбора","ФормаПросмотрДокумента","", Кэш);
	Если Не фрм = Ложь Тогда
		фрм.сбисТабличнаяЧастьЕдИзмОргНачалоВыбора(Кэш, ЭтаФорма, Элемент, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СбисСтрокаТабличнаяЧастьКоэффициентНачалоВыбора(ВходящийКэш, Элемент, СтандартнаяОбработка)  
	
	Если Кэш = Неопределено Тогда
		Кэш = ВходящийКэш;
	КонецЕсли;

	
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("сбисТабличнаяЧастьКоэффициентНачалоВыбора","ФормаПросмотрДокумента","", Кэш);
	Если Не фрм = Ложь Тогда
		фрм.сбисТабличнаяЧастьЕдИзмОргНачалоВыбора(Кэш, ЭтаФорма, Элемент, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СбисВыбратьПочтовыйЯщик(ВходящийКэш, Элемент, ДопПараметры)
	
	
	Перем СписокЯщиков, ЭлементВыбораДефолт;
	
	Если Кэш = Неопределено Тогда
		Кэш = ВходящийКэш;
	КонецЕсли;

	Отказ = Ложь;
	ИнформацияОКонтрагенте = Кэш.ОбщиеФункции.ПолучитьИнформациюОКонтрагенте(Кэш, СоставПакета.Контрагент, Новый Структура("ДопПоля", "СписокИдентификаторов"), Отказ);
	Если Отказ Тогда
		ОшибкаВыбораЯщика = МодульОбъектаКлиент().НовыйСбисИсключение(719103,"ФормаПросмотрДокумента.СбисВыбратьПочтовыйЯщик",
		,,"Указывать абонентский ящик не требуется. Вы можете отправить документ.");
		МодульОбъектаКлиент().СообщитьСбисИсключение(ОшибкаВыбораЯщика, Новый Структура("СтатусСообщения","warning"));
		Возврат;
	КонецЕсли;
	Если	Не	ИнформацияОКонтрагенте.Свойство("Идентификатор", СписокЯщиков)
		Или	Не	ТипЗнч(СписокЯщиков) = Тип("Массив")
		Или		СписокЯщиков.Количество() < 2 Тогда                                                                                                                                       
		ОшибкаВыбораЯщика = МодульОбъектаКлиент().НовыйСбисИсключение(719103,"ФормаПросмотрДокумента.СбисВыбратьПочтовыйЯщик",
		,,"Указывать абонентский ящик не требуется. Вы можете отправить документ.");
		МодульОбъектаКлиент().СообщитьСбисИсключение(ОшибкаВыбораЯщика, Новый Структура("СтатусСообщения","warning"));                 
		Возврат;
	КонецЕсли;
	СписокВыбора		= Новый СписокЗначений;
	ЭлементВыбораДефолт = Неопределено;
	Для Каждого ЭлементЯщика Из СписокЯщиков Цикл
		
		Если ЗначениеЗаполнено(ЭлементЯщика.Комментарий) Тогда
			ЭлементЯщика.Комментарий = ", " + ЭлементЯщика.Комментарий;				
		КонецЕсли;
		
		ПредставлениеЯщика =	СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить("{оператор} ({идентификатор}){комментарий} - {статус}", 
											"{оператор}", ЭлементЯщика.Оператор.Название), 
														"{идентификатор}", ЭлементЯщика.ИдентификаторУчастника),
																	"{комментарий}", ЭлементЯщика.Комментарий),
																				"{статус}", ЭлементЯщика.СостояниеПодключения.Описание);
		
		СписокВыбора.Добавить(ЭлементЯщика.ИдентификаторУчастника, ПредставлениеЯщика);
		Если НРег(ЭлементЯщика.Основной) = "да" Тогда
			ЭлементВыбораДефолт = СписокВыбора.НайтиПоЗначению(ЭлементЯщика.ИдентификаторУчастника);
		КонецЕсли;	
	КонецЦикла;
	СписокВыбора.Добавить("", "Определять автоматически");
	
	ПараметрыВыбораСписка = Новый Структура("Заголовок, Элемент, Обработчик", "Укажите абонентский ящик получателя", ЭлементВыбораДефолт, Кэш.ОбщиеФункции.СбисОписаниеОповещения(Кэш, "СбисВыбратьПочтовыйЯщик_Обработчик", ЭтаФорма, Новый Структура("Кэш", Кэш)));
	МодульОбъектаКлиент().СбисВыбратьИзСписка(СписокВыбора, ПараметрыВыбораСписка);
КонецПроцедуры

&НаКлиенте
Процедура СбисВыбратьПочтовыйЯщик_Обработчик(РезультатВыбора, ДопПараметры) Экспорт
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	АбонентскийЯщик = РезультатВыбора.Представление;
	СоставПакета.Контрагент.Вставить("Идентификатор", РезультатВыбора.Значение);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьРасхождениеНажатие_Результат(РезультатОбработки, ДопПараметры) Экспорт

	Если РезультатОбработки = Неопределено Тогда
		
		Возврат;
		
	ИначеЕсли РезультатОбработки.Свойство("code") Тогда
		
		МодульОбъектаКлиент().СообщитьСбисИсключение(РезультатОбработки);
		Возврат;
		
	КонецЕсли;
	
	Если РезультатОбработки.Свойство("ЕстьРасхождения") И РезультатОбработки.ЕстьРасхождения Тогда
		СоставПакета.Вставить("ЕстьРасхождения", Истина);
	КонецЕсли;
	
	СоставПакета.Вложение.Добавить(РезультатОбработки);
	ЗаполнитьТаблицуДокументов(СоставПакета);

КонецПроцедуры                              

&НаКлиенте
Процедура УчетСторонаПриИзменении(Элемент)
	
	Сторона1С = ЭтаФорма[Элемент.Имя];

	Если Не ЗначениеЗаполнено(ДанныеСторон) Тогда
		Возврат;
	КонецЕсли;

	Если Элемент.Имя = "УчетОрганизация" Тогда
		СторонаДляИзменения = ДанныеСторон.ДанныеОрганизации;
		Тип = "НашаОрганизация";
		СторонаСБИС = СоставПакета.НашаОрганизация;
		ТипДанныхСтороны = "ДанныеОрганизации";
		СторонаДляРучнойПравки = "Организация";
	ИначеЕсли Элемент.Имя = "УчетКонтрагент" Тогда
		СторонаДляИзменения = ДанныеСторон.ДанныеКонтрагента;
		Тип = "Контрагент";
		СторонаСБИС = СоставПакета.Контрагент;
		ТипДанныхСтороны = "ДанныеКонтрагента";
		СторонаДляРучнойПравки = "Контрагент";
	ИначеЕсли Элемент.Имя = "УчетГрузополучатель" Тогда
		СторонаДляИзменения = ДанныеСторон.ДанныеГрузополучателя;
		Тип = "Контрагент";
		СторонаСБИС = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "Грузополучатель");
		ТипДанныхСтороны = "ДанныеГрузополучателя";
		СторонаДляРучнойПравки = Неопределено;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если СторонаДляИзменения.Ссылка = Сторона1С Тогда 
		Возврат;
	КонецЕсли;
	
	СторонаДляИзменения.Ссылка = Сторона1С;
	ДанныеДляОбновления = Новый Структура;
	МестныйКэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(ДанныеДляОбновления, СторонаДляИзменения);
	ДанныеДляОбновления.Вставить("Тип", Тип); 
	ДанныеДляОбновления.Вставить("ТипДанныхСтороны", ТипДанныхСтороны);
	ДопПараметры = Новый Структура("СторонаСБИС", СторонаСБИС);
	МодульОбъектаКлиент().Маппинг_ОбновитьСторону1С(ДанныеДляОбновления, ДопПараметры);
	
	ДопПоля = Новый Структура("ПерезаполнятьВходящийКонтекст", Истина);
	МодульОбъектаКлиент().СоставПакета_Обновить(СоставПакета, Новый Структура("ДопПоля", ДопПоля));
	
	Вложения = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "Вложение");
	Если СторонаДляРучнойПравки = Неопределено
		ИЛИ НЕ ЗначениеЗаполнено(Вложения) Тогда
		Возврат;
	КонецЕсли;

	ДопПараметрыВложения = Новый ФиксированнаяСтруктура("СоставПакета", СоставПакета);
	
	Для каждого ВложениеСБИС Из Вложения Цикл

		Если НЕ МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "Статус") = "Разобран" Тогда
			Продолжить;
		КонецЕсли;
		
		РучныеПравки = МодульОбъектаКлиент().ВложениеСБИС_Получить(СоставПакета.Вложение[0], "СтруктураРучныхПравок");
		
		Если СторонаДляИзменения.Ссылка <> РучныеПравки[СторонаДляРучнойПравки] Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураОбновить = Новый Структура(СторонаДляРучнойПравки, Сторона1С);
		МодульОбъектаКлиент().ВложениеСБИС_Обновить(ВложениеСбис, Новый Структура("Поля1С", СтруктураОбновить), ДопПараметрыВложения);
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПоВложениюСБИС(ВложениеСБИС)
	
	МодульТекущий		= МодульОбъектаКлиент();

	СтатусВложение			= МодульТекущий.ВложениеСБИС_Получить(ВложениеСБИС, "Статус");
	ПредставлениеДокумента	= МодульТекущий.ВложениеСБИС_Получить(ВложениеСБИС,
																  "ВизуализацияДокумента",
																  Новый ФиксированнаяСтруктура("СоставПакета", СоставПакета));
	
	МодульТекущий.ИзменитьЭлементФормыОбработки(Новый ФиксированнаяСтруктура("Форма, Реквизит", ЭтаФорма, "ПолеHTMLДокумента"),
												Новый ФиксированнаяСтруктура("HTML", ПредставлениеДокумента));
												
	ДанныеВложенияРазобраны		= СтатусВложение = "Разобран";
	ЗагрузкаПоддерживается		= ПараметрыРаботы.ЗагрузкаПоддерживается;
	// Старое обратное сопоставление
	СопоставлениеПередОтправкой	= Не МодульТекущий.ВложениеСБИС_Получить(ВложениеСБИС, "НоменклатураКодКонтрагента") = Неопределено;
	
	ЭлементДокументПоле		= МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "Документ1С");
	ЭлементДокументНадпись	= МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "Документ1С.Надпись");
	ЭлементДатаПоле			= МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "Дата1С");
	
	ПараметрыПросмотр		= МодульТекущий.ВложениеСБИС_Получить(ВложениеСБИС, "Просмотр", "ФормаПросмотрДокумента");
	ПараметрыДокумент		= МодульТекущий.ВложениеСБИС_Получить(ВложениеСБИС, "Параметры"); 
	ПараметрыНоменклатуры	= МодульТекущий.ВложениеСБИС_Получить(ВложениеСБИС, "ПараметрыНоменклатуры");
	
	НовоеСопоставлениеНоменклатуры = МодульОбъектаКлиент().ИспользоватьНовоеСопоставлениеНоменклатуры();

	Если	ЗначениеЗаполнено(ПараметрыПросмотр) Тогда
								
		ВидимостьСоздатьКонтрагент	= ПараметрыПросмотр.Свойство("ПараметрыКонтрагент")
									И ПараметрыПросмотр.ПараметрыКонтрагент.ПоказатьСозданиеКарточки;
		ЭлементДатаПоле.Доступность = ПараметрыПросмотр.ПараметрыПрочихПолей.ДоступнаДата1С;
		
	Иначе
		
		ВидимостьСоздатьКонтрагент	= Ложь;
		ПараметрыПросмотр = Новый Структура;
		ЭлементДатаПоле.Доступность = Ложь;
									
	КонецЕсли;
	
	Если ПараметрыПросмотр.Свойство("ВариантыОбработкиДокумента") Тогда
		
		// Установить видимость выбора для варианта обработки документа
		ЭлементДекорация = МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "Документ1СВыборВариантаСписок");
		
		ЭлементДокументПоле.Видимость		= Ложь;
		ЭлементДокументНадпись.Видимость	= Ложь;
		ЭлементДатаПоле.Видимость			= Ложь;
		
		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "Дата1С.Надпись").Видимость		= Ложь;
		
		ЭлементДекорация.Видимость = Истина;
		ЭлементДекорация.Заголовок = "Не установлен документ";
		
	Иначе
		
		Если	ДанныеВложенияРазобраны
			И	ПараметрыПросмотр.Свойство("ПараметрыДокумент") Тогда
			
			ПараметрыДокумент = ПараметрыПросмотр.ПараметрыДокумент;
			ЭлементДокументНадпись.Заголовок	= ПараметрыДокумент.Заголовок;
			ЭлементДокументПоле.Доступность		= ПараметрыДокумент.Доступность;
			
		КонецЕсли;
		
		ЭлементДокументПоле.Видимость		= Истина;
		ЭлементДокументНадпись.Видимость	= Истина;
		
		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "Дата1С").Видимость							= Истина;
		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "Дата1С.Надпись").Видимость					= Истина;
		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "Документ1СВыборВариантаСписок").Видимость	= Ложь;
		
	КонецЕсли;

	ЭлементСоздатьСопоставить		 = МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧастьСопоставлениеНоменклатурыСоздатьСопоставитьНоменклатуруВ1С");
	ЭлементЗаписатьСопоставление	 = МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧастьСопоставлениеНоменклатурыЗаписатьСопоставлениеНоменклатуры");
	ЭлементОткрытьФормуСопоставления = МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧастьСопоставлениеНоменклатурыОткрытьФормуСопоставления");

	Если НовоеСопоставлениеНоменклатуры Тогда	

		ЭлементСоздатьСопоставить.Видимость			= Истина;
		ЭлементЗаписатьСопоставление.Видимость		= Истина;
		ЭлементОткрытьФормуСопоставления.Видимость	= Истина;

		ЭлементЗаписатьСопоставление.Доступность = Ложь;
		ЭлементОткрытьФормуСопоставления.Доступность = Ложь;
		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ОтметитьВсе").Доступность = Ложь; 
		
		ЭлементСоздатьСопоставить.Доступность = МодульОбъектаКлиент().ПараметрSABY("АвтоматическоеСозданиеНоменклатуры", "Сеанс");
		
	Иначе
		
		ЭлементСоздатьСопоставить.Видимость			= Ложь;
		ЭлементЗаписатьСопоставление.Видимость		= Ложь;
		ЭлементОткрытьФормуСопоставления.Видимость	= Ложь;
		
	КонецЕсли;
												
	ПанельСопоставленияНоменклатуры = МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "Контент.Загрузка.ПанельСопоставлениеНоменклатуры");
	Если	ДанныеВложенияРазобраны Тогда	
		
		ПараметрыСопоставленияНоменклатурыПросмотр = ПараметрыПросмотр.ПараметрыНоменклатуры;
		КлючВариантаСопоставления	= ПараметрыСопоставленияНоменклатурыПросмотр.КлючСопоставления;
		КлючТЧСопоставления			= "ТабличнаяЧасть" + КлючВариантаСопоставления;
		
		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".Характеристика").Видимость = Ложь;
		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПанельСопоставлениеНоменклатуры").Видимость = Истина;
		
		ПанельЗагрузка = МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "Контент.Загрузка.ПанельЗагрузка");
		ПанельСопоставленияНоменклатуры.Видимость = Истина;
		Если ЗагрузкаПоддерживается Тогда
			
			// Пакет разобран и загрузка поддерживается
			ПанельЗагрузка.Видимость	= Истина;
			
			МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "СинонимДокумента").Видимость        = Истина;
            МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ЗапомнитьВыборДокумента").Видимость = Истина;
			МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".Идентификатор").Видимость				= Ложь;
	 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".НоменклатураПоставщика").Видимость	= Истина;
	 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".ХарактеристикаПоставщика").Видимость	= Не НовоеСопоставлениеНоменклатуры;
			МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".Характеристика").Видимость			= Не НовоеСопоставлениеНоменклатуры
																																И ПараметрыСопоставленияНоменклатурыПросмотр.Видимость.Характеристика;	
	 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".ЕдИзмОрг").Видимость					= ПараметрыСопоставленияНоменклатурыПросмотр.Видимость.ЕдИзмОрг;
	 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".ЕдИзм").Видимость						= ПараметрыСопоставленияНоменклатурыПросмотр.Видимость.ЕдИзм;
			МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".Коэффициент"	).Видимость				= ПараметрыСопоставленияНоменклатурыПросмотр.Видимость.Коэффициент;
	 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".Количество").Видимость				= Истина;
	 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".Цена").Видимость						= Истина;
	 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".СуммаБезНал").Видимость				= Истина;
	 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".СтавкаНДС").Видимость					= Истина;
	 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".СуммаНДС").Видимость					= Истина;
	 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".Сумма").Видимость						= Истина;
			
		ИначеЕсли	СопоставлениеПередОтправкой Тогда	
			
			//МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть").Видимость = Истина;

			// Пакет разобран и требуется обратное сопоставление перед отправкой (старая логика)
			ПанельЗагрузка.Видимость	= Ложь;
			МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "СинонимДокумента").Видимость        = Ложь;
            МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ЗапомнитьВыборДокумента").Видимость = Ложь;
			МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".Идентификатор").Видимость				= Истина;
	 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".НоменклатураПоставщика").Видимость	= Ложь;
	 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".ХарактеристикаПоставщика").Видимость	= Ложь;
			МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".Характеристика").Видимость			= Ложь;	
	 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".ЕдИзмОрг").Видимость					= Ложь;
	 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".ЕдИзм").Видимость						= Ложь;
			МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".Коэффициент"	).Видимость				= Ложь;
	 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".Количество").Видимость				= Ложь;
	 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".Цена").Видимость						= Ложь;
	 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".СуммаБезНал").Видимость				= Ложь;
	 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".СтавкаНДС").Видимость					= Ложь;
	 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".СуммаНДС").Видимость					= Ложь;
	 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + ".Сумма").Видимость						= Ложь;
			
		Иначе
			
			ПанельЗагрузка.Видимость	= Ложь;
			
		КонецЕсли;
	
		ПанельСопоставленияНоменклатуры.ТекущаяСтраница = МодульТекущий.ПолучитьЭлементФормыОбработки(ПанельСопоставленияНоменклатуры, КлючВариантаСопоставления);		
	
		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПанельЗагрузкаЛево").Видимость = Истина;
 		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "НеНайденКонтрагент").Видимость = ВидимостьСоздатьКонтрагент;
		
		Если ПараметрыСопоставленияНоменклатурыПросмотр.КлючСопоставления = "НовоеСопоставление" Тогда
			
			 МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + "СоздатьСопоставитьНоменклатуруВ1С").Видимость = Ложь;
			 МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, КлючТЧСопоставления + "ЗаписатьСопоставлениеНоменклатуры").Доступность = Ложь;
			 
		КонецЕсли; 
		
		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ОтметитьВсе").Доступность = Ложь;
		
	Иначе
		
		// Нет загрузки 
		// МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть").Видимость = Ложь;
		ПанельСопоставленияНоменклатуры.Видимость = Ложь;
		МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПанельЗагрузкаЛево").Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПолеДокумент1С_СписокВыбора(ВложениеСБИС)
	
	ПараметрыПросмотр			= МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "Просмотр", "ФормаПросмотрДокумента");
	РедактируемыеПоляВложения	= МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "Поля1С");
	СписокВыбораОпераций	= Новый СписокЗначений;
	
	Если Не ЗначениеЗаполнено(ПараметрыПросмотр) Тогда
		Возврат;
	КонецЕсли;
		
	Если РедактируемыеПоляВложения.Документ = Неопределено Тогда
		
		// Для нередактируемых документов, нельзя изменить основной документ
		ОписаниеНоваяОперация	= Новый Структура("Доступность, Тип, Значение, Заголовок");
		ОписаниеНоваяОперация.Заголовок		= "Документ";
		ОписаниеНоваяОперация.Доступность	= Ложь;
		
		СписокВыбораОпераций.Добавить(ОписаниеНоваяОперация, ОписаниеНоваяОперация.Заголовок);

	Иначе
		
		ОписаниеНоваяОперация	= Новый Структура("Значение, Доступность, Тип, Заголовок");
		Если ЗначениеЗаполнено(РедактируемыеПоляВложения.Документ.Значение) Тогда
		
			ОписаниеНоваяОперация.Заголовок = "Документ";
			ЗаполнитьЗначенияСвойств(ОписаниеНоваяОперация, РедактируемыеПоляВложения.Документ);
			СписокВыбораОпераций.Добавить(ОписаниеНоваяОперация, "Указать существующий документ");
			ОписаниеНоваяОперация.Доступность = ВложениеСБИС.Параметры.ВозможноРедактироватьДокумент;

		Иначе
			
			Если ВложениеСБИС.Параметры.ВозможноРедактироватьДокумент Тогда
				
				Если РедактируемыеПоляВложения.Документ.Свойство("Ошибка") Тогда
					
					ИсключениеПодбораДокумента = МодульОбъектаКлиент().НовыйСбисИсключение
														(РедактируемыеПоляВложения.Документ.Ошибка,
														"ФормаПросмотрДокумента.УстановитьПолеДокумент1С_СписокВыбора",
														,
														"Ошибка поиска подходящего документа. Требуется установить документ вручную.");
					МодульОбъектаКлиент().СбисСообщить(ИсключениеПодбораДокумента);
					РедактируемыеПоляВложения.Документ.Удалить("Ошибка");
					
				КонецЕсли;
				ОписаниеНоваяОперация.Заголовок = "Новый документ";
				ЗаполнитьЗначенияСвойств(ОписаниеНоваяОперация, РедактируемыеПоляВложения.Номер);
				Если ОписаниеНоваяОперация.Доступность Тогда
					
					ОписаниеНоваяОперация.Заголовок = ОписаниеНоваяОперация.Заголовок + " №";
					
				КонецЕсли;
				СписокВыбораОпераций.Добавить(ОписаниеНоваяОперация, "Создать новый документ");
			
				ОписаниеНоваяОперация = Новый Структура("Тип, Доступность, Значение, Заголовок", РедактируемыеПоляВложения.Документ.Тип, Истина);
				ОписаниеНоваяОперация.Заголовок	= "Документ";
				ЗаполнитьЗначенияСвойств(ОписаниеНоваяОперация, РедактируемыеПоляВложения.Документ);
				
				ОписаниеНоваяОперация.Значение	= ОписаниеНоваяОперация.Тип.ПривестиЗначение();
				СписокВыбораОпераций.Добавить(ОписаниеНоваяОперация, "Указать существующий документ");
				
			Иначе
				
				ОписаниеНоваяОперация.Заголовок = "Новый документ";
				ЗаполнитьЗначенияСвойств(ОписаниеНоваяОперация, РедактируемыеПоляВложения.Документ);
				ОписаниеНоваяОперация.Доступность = Ложь;
				СписокВыбораОпераций.Добавить(ОписаниеНоваяОперация, "Создать новый документ");
				
			КонецЕсли;		

		КонецЕсли;
		
	КонецЕсли;
		
	Если СписокВыбораОпераций.Количество() > 1 Тогда
		
		ПараметрыПросмотр.Вставить("ВариантыОбработкиДокумента", СписокВыбораОпераций);
		
	Иначе
		
		ПараметрыПросмотр.Удалить("ВариантыОбработкиДокумента");
		Документ1СВыборВариантаСписокПослеДиалога(СписокВыбораОпераций[0]);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДанныеПоВложениюСБИС(ВложениеСБИС)
	
	МодульТекущий		= МодульОбъектаКлиент();
	СтатусВложение		= МодульТекущий.ВложениеСБИС_Получить(ВложениеСБИС, "Статус");
	
	СопоставлениеНоменклатуры.Очистить();
	
	ЭлементСпискаСинонимы = МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "СинонимДокумента");
	ЭлементСпискаСинонимы.СписокВыбора.Очистить();
	
	СинонимДокумента	= "";
	Договор1С			= "";
	Дата1С				= "";
	Контрагент1С		= "";	
	
	Если Не СтатусВложение = "Разобран" Тогда
		Возврат;
	КонецЕсли;
	
	НаправлениеВложение	= МодульТекущий.ВложениеСБИС_Получить(ВложениеСБИС, "Направление");
	УстановленныйРаздел	= МодульТекущий.ВложениеСБИС_Получить(ВложениеСБИС, "УстановленныйПодразделИни");
	
	Если УстановленныйРаздел = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	УстановитьОграничениеТипаРеквизитов(ВложениеСБИС);
		
	Ини = МодульТекущий.ВложениеСБИС_Получить(ВложениеСБИС, "ФайлИни");
	Если Ини.Свойство("мДокумент") Тогда
		
		НазваниеТекущее = МестныйКэш.ОбщиеФункции.РассчитатьЗначение("Название", УстановленныйРаздел);
		Для Каждого ТипДокумент Из Ини.мДокумент Цикл
			Название	= МестныйКэш.ОбщиеФункции.РассчитатьЗначение("Название", ТипДокумент.Значение);
			Если Не ЗначениеЗаполнено(Название) Тогда
				
				// Разделы без названия не добавляем
				Продолжить;
				
			КонецЕсли;
			Имя			= ТипДокумент.Ключ;
			
			СписокТиповДокументов.Добавить(Название, Имя);
			ЭлементСпискаСинонимы.СписокВыбора.Добавить(Название);
			
			Если Название = НазваниеТекущее Тогда
				
				СинонимДокумента = Название;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	ДанныеПросмотраДокумента	= МодульТекущий.ВложениеСБИС_Получить(ВложениеСБИС, "Просмотр", "ФормаПросмотрДокумента");
	ЗапомнитьВыборДокумента		= ДанныеПросмотраДокумента.ПараметрыПрочихПолей.РазделСохранен;
	
	// Данные промотра должна быть всегда, если установлена ини. Если нет - ошибка
	Если Не ДанныеПросмотраДокумента = Неопределено Тогда
		Если ДанныеПросмотраДокумента.Свойство("ПараметрыДокумент") Тогда
			
			Документ1СВыборВариантаУстановить(ВложениеСБИС, ДанныеПросмотраДокумента.ПараметрыДокумент);
			
		Иначе
			
			УстановитьПолеДокумент1С_СписокВыбора(ВложениеСБИС);
			
		КонецЕсли;
		
		РедактируемыеПоляВложения = МодульТекущий.ВложениеСБИС_Получить(ВложениеСБИС, "Поля1С");

		Если Не РедактируемыеПоляВложения = Неопределено Тогда 

			ПараметрыУстановить = РедактируемыеПоляВложения.Договор;
			Если Не ПараметрыУстановить = Неопределено Тогда
				Договор1С = ПараметрыУстановить.Значение;
				МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "Договор1С").Доступность = ПараметрыУстановить.Доступность;
			КонецЕсли;
			
			ПараметрыУстановить = РедактируемыеПоляВложения.Дата;
			Если Не ПараметрыУстановить = Неопределено Тогда
				Дата1С = ПараметрыУстановить.Значение;
				МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "Дата1С").Доступность = ПараметрыУстановить.Доступность;
			КонецЕсли;
			
			ПараметрыУстановить = РедактируемыеПоляВложения.Контрагент;
			Если Не ПараметрыУстановить = Неопределено Тогда
				Контрагент1С = РедактируемыеПоляВложения.Контрагент.Значение;
				МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "Контрагент1С").Доступность = ПараметрыУстановить.Доступность;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;		
	// переделать
	ЗаполнитьДокументДаннымиЭД(ВложениеСБИС);
	ЗаполнитьТаблицуНоменклатуры(ВложениеСБИС);
	
КонецПроцедуры

// Процедура проверяет введенный номер госконтракта и изменяет его в документе СБИС
//
// Параметры:
//  Элемент	 - 	 - 
//  Текст	 - Строка - Строка текста, введенная в поле ввода.
//
&НаКлиенте
Процедура ИдентификаторГосконтрактаОкончаниеВводаТекста(Элемент, Текст)   
	
	Если СтрДлина(СокрЛП(Текст)) < 20 Тогда
		МодульОбъектаКлиент().СбисСообщить("№ контракта должен содержать от 20 до 25 символов"); 
		Возврат;
	КонецЕсли;  
	
	ПараметрыДокумента = Новый Структура("ИдентификаторГосконтракта", СокрЛП(Текст));
	
	Попытка
		МодульОбъектаКлиент().ИзменитьСкладскойПараметрДокумента(СоставПакета, ПараметрыДокумента);
	Исключение
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ИдентификаторГосконтрактаОкончаниеВводаТекста");
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ПозГКНачалоВыбораНачало(ПолеТаблицыМаркировки, ДопПараметры = Неопределено)
	
	ГосКонтракт = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "Госконтракт");
	
	Если ГосКонтракт = Неопределено Тогда

		МодульОбъектаКлиент().ДополнитьСпецификациейПоГосКонтракту(СоставПакета);
		ГосКонтракт = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "Госконтракт");

	КонецЕсли;
	
	Спецификация = МодульОбъектаКлиент().СоставПакета_Получить(ГосКонтракт, "Спецификация");
	
	СписокНоменклатуры = Новый СписокЗначений;
	
	// VAAl Пока нет красивой формы, будет вот так вот кривова-то
	ШаблонПредставления = "{1}. {2}, {3} {4}. {5} руб.";
	Для каждого Номенклатура Из Спецификация Цикл
		
		ПредставлениеЭлемента = СтрЗаменить(ШаблонПредставления, "{1}", Номенклатура.pos_num);
		ПредставлениеЭлемента = СтрЗаменить(ПредставлениеЭлемента, "{2}", Номенклатура.name);
		ПредставлениеЭлемента = СтрЗаменить(ПредставлениеЭлемента, "{3}", Номенклатура.quantity); 
		ПредставлениеЭлемента = СтрЗаменить(ПредставлениеЭлемента, "{4}", Номенклатура.okei_name); 
		ПредставлениеЭлемента = СтрЗаменить(ПредставлениеЭлемента, "{5}", Номенклатура.price);
		
		СписокНоменклатуры.Добавить(Номенклатура, ПредставлениеЭлемента);
		
	КонецЦикла;
	
	ДопПараметрыВыбора = Новый Структура("ПолеТаблицыМаркировки", ПолеТаблицыМаркировки);
	Обработчик = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПозГКНачалоВыбораЗавершение", ЭтаФорма, ДопПараметрыВыбора);
	МодульОбъектаКлиент().СбисВыбратьИзСписка(СписокНоменклатуры, Новый Структура("Обработчик, Заголовок", Обработчик, "Спецификация"));

КонецПроцедуры

&НаКлиенте
Процедура ПозГКНачалоВыбораЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	Перем НомерПозиции;
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(РезультатВыбора.Значение) = Тип("Структура") Тогда
		
		РезультатВыбора.Значение.Свойство("pos_num", НомерПозиции);
		ТипЧисло = Новый ОписаниеТипов("Число");
		ДопПараметры.ПолеТаблицыМаркировки.ПозГК = ТипЧисло.ПривестиЗначение(НомерПозиции);
		
	КонецЕсли;
	
	ПозГКПриИзменении(МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПозГК"));
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаМаркировка").ЗакончитьРедактированиеСтроки(Ложь);

КонецПроцедуры

#Область include_core2_vo2_Формы_ФормаПросмотрДокумента_ОбработчикиСобытий_Загрузка
#КонецОбласти

