
// Процедура устанавливает строку таблицы документов по данным вложения СБИС
&НаКлиенте
Процедура ТаблицаДокументовУстановитьСтроку(СтрокаТаблицыДокументов, ВложениеСБИС)
	Перем ПараметрыДляТЧНоменклатуры;

	ДанныеДляЗагрузки = МестныйКэш.ОбщиеФункции.ЗаполнитьДанныеДляЗагрузкиПоУмолчанию(МестныйКэш, СоставПакета, ВложениеСБИС);

	СтрокаТаблицыДокументов.Название		= МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "Название");
	СтрокаТаблицыДокументов.Идентификатор	= МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "Идентификатор");
	СтрокаТаблицыДокументов.Шифрование		= МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "Зашировать");
	
	Если ВложениеСБИС.Свойство("Документы1С") Тогда
		
		СтрокаТаблицыДокументов.Документы1С			= ВложениеСБИС.Документы1С;
		СтрокаТаблицыДокументов.Документы1СНазвания = "";
		
		Для Каждого Документ1СВложения Из ВложениеСБИС.Документы1С Цикл
			
			СтрокаТаблицыДокументов.Документы1СНазвания = СтрокаТаблицыДокументов.Документы1СНазвания + Строка(Документ1СВложения.Значение) + Символы.ПС;
			
		КонецЦикла;
	Иначе
		
		СтрокаТаблицыДокументов.Документы1С			= Новый СписокЗначений;
		СтрокаТаблицыДокументов.Документы1СНазвания = "";
		
	КонецЕсли;
	
	Если ВложениеСБИС.Свойство("Подпись") Тогда
		
		СтрокаТаблицыДокументов.Подпись = "";
		Для Каждого Подпись Из ВложениеСБИС.Подпись Цикл
			
			СтрокаТаблицыДокументов.Подпись = СтрокаТаблицыДокументов.Подпись + МестныйКэш.ОбщиеФункции.ПолучитьПредставлениеСертификата(Подпись.Сертификат, "[ФИО]., [Должность]., [Название]") + Символы.ПС;
			
		КонецЦикла;
		
	Иначе
		
		СтрокаТаблицыДокументов.Подпись = "";
		
	КонецЕсли;
	
	СтрокаТаблицыДокументов.Вложение.Добавить(ВложениеСБИС);
	
	Если ВложениеСБИС.Свойство("Отмечен")  Тогда
		
		СтрокаТаблицыДокументов.Отмечен = ВложениеСБИС.Отмечен;
		
	Иначе
		
		СтрокаТаблицыДокументов.Отмечен = Истина;
		
	КонецЕсли;
	
	ДанныеДляЗагрузки.Свойство("ПутьТаблДок",		СтрокаТаблицыДокументов.ПутьТаблДок);
	ДанныеДляЗагрузки.Свойство("ПутьКонтрагента",	СтрокаТаблицыДокументов.ПутьКонтрагента);
	
	Если ДанныеДляЗагрузки.Свойство("ТекстОшибки") Тогда
		
		Сообщить(ДанныеДляЗагрузки.ТекстОшибки);
		
	КонецЕсли;
	
	ОбновитьСтрокуТаблицыДокументов(СтрокаТаблицыДокументов);
	
КонецПроцедуры

#Область include_core2_vo2_Формы_ФормаПросмотрДокумента_ТаблицаДокументов_События
#КонецОбласти

