
&НаКлиенте
Функция НовыйЗаписьЛогаSABY(ОснованиеДляЛога = "Unknown",	ИмяВызова = "Unknown",				ВремяЗаписи = Неопределено,
							СообщениеВызова	= Неопределено, ИдентификаторЗаписи = Неопределено,	МодульЗаписи = Неопределено) Экспорт
	
	Если ОбъектSABY_ЭтоТип(ОснованиеДляЛога, "ЗаписьЛогаSaby") Тогда
		
		Возврат ОснованиеДляЛога;
		
	КонецЕсли;
	
	ЗаписьВЛог = НовыйОбъектSABY("ЗаписьЛогаSABY");
	ЗаписьВЛог.Вставить("Модуль",		 МодульЗаписи);
	ЗаписьВЛог.Вставить("Тип");
	ЗаписьВЛог.Вставить("Вызов",		 ИмяВызова);	
	ЗаписьВЛог.Вставить("Время",		 ВремяЗаписи);
	ЗаписьВЛог.Вставить("Сообщение",	 СообщениеВызова);
	ЗаписьВЛог.Вставить("Идентификатор", ИдентификаторЗаписи);

	Если ТипЗнч(ОснованиеДляЛога) = Тип("Строка") Тогда
		
		ЗаписьВЛог.Тип = ОснованиеДляЛога;
		
	Иначе
		
		яЗаписьЛогаSABY_Заполнить(ЗаписьВЛог, ОснованиеДляЛога);
		
	КонецЕсли; 
	
	Если ЗаписьВЛог.Время = Неопределено Тогда
		
		ЗаписьВЛог.Время = ТекущаяДата();
		
	КонецЕсли;

	Возврат ЗаписьВЛог;
	
КонецФункции

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_ЗаписьЛогаSABY_АПИ
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_ЗаписьЛогаSABY_Приватные
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_ЗаписьЛогаSABY_МетодыКласса
#КонецОбласти

