
&НаКлиенте
Функция НовыйКэшНастроек(ПараметрыКонструктора = Неопределено) Экспорт 
	
	НовыйКэшНастроек = НовыйОбъектSABY("КэшНастроек");
    НовыйКэшНастроек.Вставить("Ини",			Новый Структура);
    НовыйКэшНастроек.Вставить("ИниВПорядке",	Ложь);

	Возврат НовыйКэшНастроек;
	
КонецФункции

// Функция - Кэш настроек очистить
//
// Параметры:
//  КэшНастроек		 - КэшНастроек	 - структура кэша
//  КлючПараметра	 - Строка		 - что очищаем
// 
// Возвращаемое значение:
//  Произвольный - Очищенное значение
//
&НаКлиенте
Функция КэшНастроек_Очистить(КэшНастроек, КлючПараметра) Экспорт 
	
	Если КлючПараметра = "ОчиститьСобранныеНастройки" Тогда
		
		// Глобальная очистка параметров. Для локальной - вызывается отдельно "ОчиститьСобранныеНастройки"
		МодульНастроек = ПараметрSABY("МодульУправленияНастройками");
		МодульНастроек.ОчиститьСобранныеНастройки(ПолучитьТекущийЛокальныйКэш());
		ИзменитьПараметрСбис("ИниВПорядке", Ложь);
		ИзменитьПараметрСбис("ИмяМодуляРаботыСоСтатусами");
		Возврат КэшНастроек;
		
	КонецЕсли;
	
КонецФункции


