
// Функция - Конструктор класса для асинхронной отправки
//
// Параметры:
//  ПараметрыКонструктора	- Структура	 - ПараметрыОтправки, ДанныеКОтправке, ОбработчикРезультата, ВерсияФормата
//		ДанныеКОтправке	- Струкутра
//			СписокПакетов		- массив	- из структур с полем "СоставПакета", где в качестве значения - список значений из элементов:
//							значение - ссылка на документ 1С, представление - имя настройки которой обрабатывается документ
//			МодульПодготовки	- форма		- которой осуществляется расчёт документа на выгрузку.
// 
//		ВерсияФормата		- Число 1/2 версия класса - старая/новая отправка
// Возвращаемое значение:
//  РезультатОтправки	 - РезультатОтправки (Структура)	 - класс для отправки
//
&НаКлиенте
Функция НовыйМассоваяОперация(ПараметрыКонструктора) Экспорт
	
	//Число потоков в отправке - сколько можно впихнуть в компонент, отвечающий за отправку за раз
	//Размер пачки - сколько пакетов пихаем за итерацию.
	ВерсияФорматаКласса = 2;
	Если ПараметрыКонструктора.Свойство("ВерсияОтправки") Тогда
		
		ВерсияФорматаКласса = ПараметрыКонструктора.ВерсияОтправки;
		
	КонецЕсли;
		
	РезультатОтправки = МассоваяОперация_Пустой(ВерсияФорматаКласса);
	Если ВерсияФорматаКласса = 1 Тогда
		ПараметрыКонструктора.Свойство("ОбработчикРезультата", РезультатОтправки.ОбработчикРезультата);

		Возврат РезультатОтправки;
		
	КонецЕсли;
	
	ПараметрыОтправки = МассоваяОперация_ПараметрыОтправки(РезультатОтправки, ПараметрыКонструктора);
	
	СчётчикиОтправки = Новый Структура("ВсегоСтрок", ПараметрыКонструктора.ДанныеКОтправке.СписокПакетов.Количество());
	СчётчикиОтправки.Вставить("СформированоПакетов",	0);//От одного документа 1С может нагенерированно несколько пакетов.
	СчётчикиОтправки.Вставить("ОтправленоПачек",		0);//Сколько было обработано пачек
	СчётчикиОтправки.Вставить("ИндексТекущегоПакета",	0);//Индекс обсчитываемых пакетов из СписокПакетов.
	СчётчикиОтправки.Вставить("ОшибокПодготовки",		0);//Число ошибок на стадии до отправки
	СчётчикиОтправки.Вставить("ОшибокОтправки",			0);//Число ошибок в моменте завершения подготовки и попытки отправить
	СчётчикиОтправки.Вставить("ПовторныхОтправок",		0);//Если теряли авторизацию, то сколько пакетов повторно было отправлено после переавторизации
	СчётчикиОтправки.Вставить("ПервичныхОтправок",		0);//Отправляли в поток после подготовки.
	
	МодульПодписок		= МодульОбъектаКлиент();
	ИмяФункцииОшибки	= "МассоваяОперация_Асинх_Ошибка";
	
	ПодпискиПоУмолчанию = Новый Структура;
	ПодпискиПоУмолчанию.Вставить("BeforeCall",	Новый Структура("Функция, Модуль",	"МассоваяОперация_Асинх_ПередОтправкой",	МодульПодписок));
	ПодпискиПоУмолчанию.Вставить("AfterCall",	Новый Структура("Функция, Модуль",	"МассоваяОперация_Асинх_ПослеОтправки",		МодульПодписок));
	ПодпискиПоУмолчанию.Вставить("Error",		Новый Структура("Функция, Модуль",	ИмяФункцииОшибки,							МодульПодписок));
	ПодпискиПоУмолчанию.Вставить("Message",		Новый Структура("Функция, Модуль",	"МассоваяОперация_Асинх_Ответ",				МодульПодписок));
	ПодпискиПоУмолчанию.Message.Вставить("ФункцияОшибки", ИмяФункцииОшибки);
	
	ПодпискиДляКоманд = Новый Соответствие;
	ПодпискиДляКоманд.Вставить("WriteDocumentEx",	ПодпискиПоУмолчанию);
	ПодпискиДляКоманд.Вставить("ExecuteActionEx",	ПодпискиПоУмолчанию);
	
	////ОтложенноеЗавершение	= НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения, Аргумент", ОбработкаЗавершения, "Прервано"));
	//ОчередьОтправки	= Новый Структура("Подготовлены, Сформированы, КомандыПодготовлены, ДействияОбрабатываются");
	//ОчередьОтправки.Подготовлены			= Новый Соответствие;
	//ОчередьОтправки.Сформированы			= Новый Соответствие;
	//ОчередьОтправки.КомандыПодготовлены		= Новый Соответствие; // АсинхронныеСбис3Команды, готовые к запуску
	//ОчередьОтправки.ДействияОбрабатываются	= Новый Соответствие; // ОтправкиДокумента, находящиеся в процессе
	
	РезультатОтправки.ВремяНачала			= ПолучитьДатуВМиллисекундах();
	РезультатОтправки.ОбработчикРезультата	= ПараметрыКонструктора.ОбработчикРезультата;
	РезультатОтправки.ДанныеКОтправке		= ПараметрыКонструктора.ДанныеКОтправке;//Структура - СписокПакетов, МодульПодготовки, СчетчикПакетов
	
	ДанныеСертификаты	= Новый Структура("ИННАктивированы, ИННАктивировать, ИННВОбработке, ИННОшибки, Список", 
		Новый СписокЗначений, 
		Новый СписокЗначений,
		Новый СписокЗначений,
		Новый Соответствие);
		
	ЗначенияОжиданияЦепочек = Новый Соответствие;
	ЗначенияОжиданияЦепочек.Вставить("МассоваяОперация_Асинх_Отправка",	ПараметрыОтправки.ОжиданиеОтвета * 2 + 10);
	
	// Для обработки пользовательких действий + кэширование результатов
	НаборПользовательскихДействий = Новый Структура("КэшЗапросов, ТекущийЗапрос, РезультатЗапроса", Новый Соответствие);
	
	ПрикладнойОбъектSABY_Установить(РезультатОтправки, "ОжиданияЦепочек",				ЗначенияОжиданияЦепочек);
	ПрикладнойОбъектSABY_Установить(РезультатОтправки, "КэшСертификатов",				ДанныеСертификаты);
	ПрикладнойОбъектSABY_Установить(РезультатОтправки, "АсинхронныеКоманды",			Новый Соответствие);
	ПрикладнойОбъектSABY_Установить(РезультатОтправки, "Очередь",						Новый Соответствие);
	ПрикладнойОбъектSABY_Установить(РезультатОтправки, "ПачкаНаОтправку",				Новый Соответствие);
	ПрикладнойОбъектSABY_Установить(РезультатОтправки, "Блокировка",					0);
	ПрикладнойОбъектSABY_Установить(РезультатОтправки, "ПодпискиДляКоманд",				ПодпискиДляКоманд);
	ПрикладнойОбъектSABY_Установить(РезультатОтправки, "КэшПользовательскихДействий",	НаборПользовательскихДействий);
	ПрикладнойОбъектSABY_Установить(РезультатОтправки, "БлокировкаОбъектов",			Новый Соответствие);
	
	РезультатОтправки.Вставить("Счетчики",				СчётчикиОтправки);
	РезультатОтправки.Вставить("ПараметрыОтправки",		ПараметрыОтправки);
	//РезультатОтправки.Вставить("Очередь",				ОчередьОтправки);	
	
	Возврат РезультатОтправки;

КонецФункции

&НаКлиенте
Функция МассоваяОперация_ПараметрыОтправки(РезультатОтправки, ПараметрыКонструктора)
	
	//Подключить обработку прерывания
	ОбработкаЗавершения		= НовыйСбисОписаниеОповещения("МассоваяОперация_МассоваяОтправка_Завершение", МодульОбъектаКлиент(), РезультатОтправки);
	ФормаИндикатор			= ПолучитьФормуОбработки("ФормаИндикатора", Новый Структура("ПолучитьНовую", Истина));
	ФормаИндикатор.ОбработкаПрерывания = ОбработкаЗавершения;

	ПараметрыИндикатора	= Новый Структура("Прерывать, БлокироватьИнтерфейс", Истина, Истина);
	ПараметрыОтправки	= Новый Структура(
	"КоличествоПотоков, НеЗапускатьВДокументооборот, 
	|МодульПодготовки, МодульИнтеграции, Владелец, ИмяРазделаОтправки, ИмяМодуляИнтеграции, ИмяОбработчикаФатальныхОшибок, 
	|ОжиданиеОтвета, ОжиданиеКоманды, ЕстьДоступКБЛ",
	10, Ложь);
	
	ЗаполнитьЗначенияСвойств(ПараметрыОтправки, ПараметрыКонструктора);
	
	СтандартнаяИнтеграцияИмя = ПолучитьЗначениеПараметраТекущегоСеанса("ИмяВнутреннегоМодуля");
	
	//Значения по-умолчанию
	Если Не ПараметрыКонструктора.Свойство("Владелец") Тогда
		
		ПараметрыОтправки.Владелец = ГлавноеОкно;
		
	КонецЕсли;
	
	Если 	Не	ПараметрыКонструктора.Свойство("МодульПодготовки")
		И		ГлавноеОкно.Кэш.Текущий.Свойство("Форма") Тогда
		
		ПараметрыОтправки.МодульПодготовки = ГлавноеОкно.Кэш.Текущий.Форма;
		
	КонецЕсли;
	
	Если	ПараметрыКонструктора.Свойство("Реестр")
		И	ЭтоТипСбис(ПараметрыКонструктора.Реестр, "РазделГО") Тогда
		
		ПараметрыОтправки.ИмяРазделаОтправки = ПараметрыКонструктора.Реестр.ОписаниеРаздела.Ини;
		Если ПараметрыКонструктора.Реестр.ОписаниеРаздела.Параметры.Свойство("НеЗапускатьВДокументооборот") Тогда
			
			ПараметрыОтправки.НеЗапускатьВДокументооборот = ПараметрыКонструктора.Реестр.ОписаниеРаздела.Параметры.НеЗапускатьВДокументооборот;
			
		КонецЕсли;
		
		Если ПараметрыКонструктора.Реестр.ОписаниеРаздела.Параметры.Свойство("ИмяМодуляИнтеграции") Тогда
			
			ПараметрыОтправки.ИмяМодуляИнтеграции = ПараметрыКонструктора.Реестр.ОписаниеРаздела.Параметры.ИмяМодуляИнтеграции;
			
		КонецЕсли;
		
		Если ПараметрыКонструктора.Реестр.ОписаниеРаздела.Параметры.Свойство("КаталогОбмена") Тогда
			
			ПараметрыОтправки.Вставить("КаталогОбмена", ПараметрыКонструктора.Реестр.ОписаниеРаздела.Параметры.КаталогОбмена);
			
		КонецЕсли;

	КонецЕсли;
	
	Если ПараметрыОтправки.ИмяМодуляИнтеграции = Неопределено Тогда
		
		ПараметрыОтправки.ИмяМодуляИнтеграции	= СтандартнаяИнтеграцияИмя;
		ПараметрыОтправки.МодульИнтеграции		= ПараметрSABY("Интеграция", "Сеанс"); 
		
	Иначе
		
		ПараметрыОтправки.МодульИнтеграции = ПолучитьФормуОбработки(ПараметрыОтправки.ИмяМодуляИнтеграции);
		
	КонецЕсли;
	
	// Интеграция изменена, установить параметры от другого модуля
	СведенияОбИнтеграции = ПараметрыОтправки.МодульИнтеграции.СведенияОбИнтеграции();
	
	Если ПараметрыОтправки.ИмяМодуляИнтеграции = СтандартнаяИнтеграцияИмя Тогда
		
		// Интеграция для операции не переключается
		Если ПараметрыОтправки.КоличествоПотоков = Неопределено Тогда
			
			ПараметрыОтправки.КоличествоПотоков = ПолучитьЗначениеПараметраСбис("Потоки_МаксимальноеКоличество");
			
		КонецЕсли;
		
		Если ПараметрыОтправки.ОжиданиеОтвета = Неопределено Тогда
			
			ПараметрыОтправки.ОжиданиеОтвета = ПолучитьЗначениеПараметраСбис("ВремяОжиданияОтвета_Отправка");
			Если ПараметрыОтправки.ОжиданиеОтвета = Неопределено Тогда
				
				ПараметрыОтправки.ОжиданиеОтвета = ПолучитьЗначениеПараметраСбис("ВремяОжиданияОтвета") * 2;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ПараметрыОтправки.ЕстьДоступКБЛ = ПолучитьЗначениеПараметраСбис("Авторизован");
		
	Иначе
		
		Если СведенияОбИнтеграции.Параметры.Свойство("ВремяОжиданияОтвета_Отправка") Тогда
			
			ПараметрыОтправки.ОжиданиеОтвета = СведенияОбИнтеграции.Параметры.ВремяОжиданияОтвета_Отправка;
			
		Иначе
			
			ПараметрыОтправки.ОжиданиеОтвета = СведенияОбИнтеграции.Параметры.ВремяОжиданияОтвета;
			
		КонецЕсли;
				
		// Пока сделано только для Каталог - поддержка узла "КаталогОбмена", установленном на реестре, 
		// т.к. иначе для отправки на другом способе обмена надо его включить, а затем авторизоваться.
		ПараметрыОтправки.ЕстьДоступКБЛ = Ложь; 
		ПараметрыОтправки.Вставить("КоличествоПотоков", СведенияОбИнтеграции.Параметры.КоличествоПотоков);
			
	КонецЕсли;
	ПараметрыОтправки.ИмяОбработчикаФатальныхОшибок = "МассоваяОперация_Асинх_ФатальнаяОшибка";

	ПараметрыОтправки.ОжиданиеКоманды = СведенияОбИнтеграции.Параметры.ВремяОжиданияОтвета * 2; // х2 чтобы успел освободится какой-либо поток
	
	ПараметрыОтправки.Вставить("Потоки",				Новый Соответствие);
	ПараметрыОтправки.Вставить("Индикатор",				ФормаИндикатор);
	ПараметрыОтправки.Вставить("ПараметрыИндикатора",	ПараметрыИндикатора);
	ПараметрыОтправки.Вставить("ОбработчикЗавершить",	ОбработкаЗавершения);
	
	Возврат ПараметрыОтправки;
	
КонецФункции

// Функция - Результат отправки пустой
//
// Параметры:
//  ВерсияЭкземпляра - Число	 - версия экземпляра
// 
// Возвращаемое значение:
//  РезультатОтправки - экземпляр класса
//
&НаКлиенте
Функция МассоваяОперация_Пустой(ВерсияЭкземпляра = 2) Экспорт
	
	//Тут нужен рефактор по структуре этой помойки
	РезультатОтправки = НовыйПрикладнойОбъектSABY("МассоваяОперация");
	
	РезультатОтправкиСтарый = Новый Структура(
	"ОбработчикРезультата, 
	|Отправлено, НеОтправлено, НеСформировано,Ошибок, КоличествоПереотправок, ВсегоПакетов, ОшибкиДоОтправки, ПорНомер, 
	|ОтправленоСообщений, ПолученоОтветов, ВремяНачала, ВремяФормирования, ВремяОтправки, ВремяЗаписиСтатусов, ВремяПолученияДанных, ВремяОжиданияОтвета", 
	,
	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
	Для Каждого КлючИЗначение Из РезультатОтправкиСтарый Цикл
		РезультатОтправки.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатОтправки.Вставить("ТипыОшибок", 						Новый СписокЗначений);
	РезультатОтправки.Вставить("ДанныеПоСтатусам",					Новый Массив);
	РезультатОтправки.Вставить("ДетализацияОшибок",					Новый Соответствие);
	РезультатОтправки.Вставить("ДетализацияОтправки",				Новый Соответствие);
	РезультатОтправки.Вставить("НаЗаписьСтатусов",					Новый Структура("Ошибки, Ответы", Новый Соответствие, Новый Соответствие));
	РезультатОтправки.Вставить("ВерсияЭкземпляра",					ВерсияЭкземпляра);
	РезультатОтправки.Вставить("ПрикладнаяСтатистика",				НовыйПрикладнаяСтатистика()); // ВААл. Для накопления параметров прикладной статистистики
	
	Если ВерсияЭкземпляра = 2 Тогда
		РезультатОтправки.Вставить("ДанныеКОтправке",	Новый Соответствие);
	Иначе
		РезультатОтправки.Вставить("Новый",						Истина);//Если стоит признак, то считаем отправку пустой. Если признака нет, либо ложь, то требуется пересоздать
		РезультатОтправки.Вставить("ТипыОшибок",				Новый СписокЗначений);
		РезультатОтправки.Вставить("КоличествоСвободныхПотоков",ГлавноеОкно.Кэш.КоличествоПотоковОтправки);
		РезультатОтправки.Вставить("ВремяНачала",				ПолучитьДатуВМиллисекундах());
		РезультатОтправки.Вставить("СформированныеПакеты",		Новый Соответствие);
		РезультатОтправки.Удалить("ДанныеКоманд");
	КонецЕсли;
		
	Возврат РезультатОтправки;
	
КонецФункции

// Функция - Результат отправки скопировать
//
// Параметры:
//  РезультатОтправки	 - РезультатОтправки	 - Структура отправки
//  ДляСервера			 - Булево				 - Удалить ли не сериализуемые параметры
// 
// Возвращаемое значение:
//  РезультатОтправки - копия структуры отправки
//
&НаКлиенте
Функция МассоваяОперация_Скопировать(РезультатОтправки, ДляСервера=Ложь) Экспорт
	
	РезультатНовый = МассоваяОперация_Пустой();
	ЗаполнитьЗначенияСвойств(РезультатНовый, РезультатОтправки);

	Если ДляСервера Тогда
		РезультатНовый.Удалить("ДанныеКОтправке");
		РезультатНовый.Удалить("ОбработчикРезультата");
		РезультатНовый.Удалить("ПараметрыОтправки");
		РезультатНовый.Удалить("ОтложенноеЗавершение");
		РезультатНовый.Удалить("ПодпискиДляКоманд");
	КонецЕсли;
	Возврат РезультатНовый;

КонецФункции

// Процедура - Базовый set-метод
//
// Параметры:
//  ПрикладнойОбъектSABY	 - ПрикладнойОбъектSABY	 - 
//  КлючДобавить		 - Строка				 - 
//  ЗначениеДобавить	 - Произвольный			 - 
//  ТипДобавить			 - Строка				 - Данные/Параметр/Тип
//
&НаКлиенте
Процедура МассоваяОперация_Установить(РезультатОтправки, КлючДобавить = Неопределено, ЗначениеДобавить = Неопределено) Экспорт 
	
	ПрикладнойОбъектSABY_Установить(РезультатОтправки, КлючДобавить, ЗначениеДобавить);

КонецПроцедуры

// Процедура - процедура запускает массовую отправку документов
//
// Параметры:
//  РезультатОтправки	 - класс РезльтатОтправки(Структура)
//  ДопПараметры		 - Структура, Необязательный	 - для расширения
//
&НаКлиенте
Процедура МассоваяОперация_МассоваяОтправка(РезультатОтправки, ДопПараметры=Неопределено) Экспорт
	
	ДанныеКОтправке = РезультатОтправки.ДанныеКОтправке;

	Попытка
		
		МассоваяОперация_ОбработкаПрерывания(РезультатОтправки);
		
	Исключение
		
		ОшибкаЗавершения = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.МассоваяОперация_МассоваяОтправка_Завершение");
		Если ОшибкаЗавершения.code = 790 Тогда
			
			//Тут просто прервать отправку, форма индикатора должна вызвать завершение.
			Возврат;
			
		КонецЕсли;
		
	КонецПопытки;

	Если		Не	ОшибкаЗавершения = Неопределено Тогда
		
		ОтложенноВыполнить		= НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения, Аргумент", РезультатОтправки.ПараметрыОтправки.ОбработчикЗавершить, ОшибкаЗавершения));
		
	ИначеЕсли		РезультатОтправки.Счетчики.ИндексТекущегоПакета < ДанныеКОтправке.СписокПакетов.Количество() Тогда //Отправляемые пакеты
		
		//Делаем отложенно отправку пакета для пропуска и возможности нажать на прерывание
		ОбработкаОтправкиПакета	= НовыйСбисОписаниеОповещения("МассоваяОперация_ПодготовитьСледующееДействие", МодульОбъектаКлиент());
		ПараметрыДляДействие	= Новый Структура(
										"ОписаниеОповещения, ИдентификаторДействия, Аргумент",
										ОбработкаОтправкиПакета, Новый УникальныйИдентификатор, РезультатОтправки);
		ОтложенноВыполнить		= НовыйОтложенноеДействие(ПараметрыДляДействие);
		
	Иначе
		
		//Всё отправлено, перейти к получению ответов.
		ОтложенноВыполнить		= НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения, Аргумент", РезультатОтправки.ПараметрыОтправки.ОбработчикЗавершить, "ОжиданиеОтветов"));
		
	КонецЕсли;
	
	РезультатОтправки.Вставить("ПоследнееОтложенноеДействие", ОтложенноВыполнить);
	
	ПодключитьОтложенноеДействие(ОтложенноВыполнить);
	
КонецПроцедуры

// Процедура - процедура запускает следующее действие из пула отправки документов
//
// Параметры:
//  РезультатОтправки		 - РезультатОтправки	 - Структура отправки
//  ПараметрыПодготовкиВходящие	 - Структура, Необязательный	 - для расширения
//
&НаКлиенте
Процедура МассоваяОперация_ПодготовитьСледующееДействие(РезультатОтправки, ПараметрыПодготовкиВходящие = Неопределено) Экспорт
	Перем МассивПодготовленныхПакетов;
	
	ДанныеКОтправке		= РезультатОтправки.ДанныеКОтправке;
	ВсегоСтрок			= ДанныеКОтправке.СписокПакетов.Количество();
	ВыбранаСтрока		= ДанныеКОтправке.СписокПакетов[РезультатОтправки.Счетчики.ИндексТекущегоПакета];
	ОчередьДействий		= МассоваяОперация_Получить(РезультатОтправки, "Очередь");
	ПараметрыБлокировки	= МассоваяОперация_Получить(РезультатОтправки, "Блокировка");
	ЧислоПотоков		= РезультатОтправки.ПараметрыОтправки.КоличествоПотоков;
	
	// При слишком большой очереди, или блокировке на низкоуровненые действия не формируем новые команды
	Если		ОчередьДействий.Количество() < ЧислоПотоков * 2
		И	Не	ПараметрыБлокировки > 0 Тогда 
		Попытка
			ВыбранаСтрока = ДанныеКОтправке.СписокПакетов[РезультатОтправки.Счетчики.ИндексТекущегоПакета];
			Если ТипЗнч(ДанныеКОтправке.СписокПакетов) = Тип("СписокЗначений") Тогда
				
				ВыбранаСтрока = ВыбранаСтрока.Значение;
				
			КонецЕсли;
			РезультатОтправки.Счетчики.ИндексТекущегоПакета	= РезультатОтправки.Счетчики.ИндексТекущегоПакета + 1;
			
			СтатусИндекс = РезультатОтправки.Счетчики.ИндексТекущегоПакета * 100 / РезультатОтправки.Счетчики.ВсегоСтрок;
			МассоваяОперация_ПоказатьСтатус(РезультатОтправки, "Подготовка электронных документов", СтатусИндекс, "(прервать -  Ctrl+Break)");
		
		    //Если нет подготовленных к отправке пакетов, то необходимо их сделать на основании имеющихся документов 1С
			Если ВыбранаСтрока.Свойство("МассивПодготовленныхПакетов", МассивПодготовленныхПакетов) Тогда
				
				// Есть уже подготовленные пакеты, надо проверить их статус и сгенерировать действия
				Для Каждого ПодготовленныйПакет Из МассивПодготовленныхПакетов Цикл
					
					ЦепочкаКомандОбработки	= НовыйЦепочкаКомандОбработки();
					МассоваяОперация_ПроверитьИПодготовитьКоманду(РезультатОтправки, ЦепочкаКомандОбработки, ПодготовленныйПакет);
					
				КонецЦикла;
				
			Иначе
				
				ЦепочкаКомандОбработки	= НовыйЦепочкаКомандОбработки();
				МассоваяОперация_ПроверитьИПодготовитьКоманду(РезультатОтправки, ЦепочкаКомандОбработки, ВыбранаСтрока);
				
			КонецЕсли;
			
		Исключение
			
			//Если прервано с ошибкой, то завершаем отправку и переходим к обработке завершения
			ФатальнаяОшибка = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.МассоваяОперация_МассоваяОтправка_Завершение");
			МассоваяОперация_ОбработатьФатальнуюОшибка(РезультатОтправки, ФатальнаяОшибка);
			
		КонецПопытки;
		
	КонецЕсли;
	
	МассоваяОперация_ПроверитьНакопленныеДействия(РезультатОтправки);

	//Продолжить итерацию
	МассоваяОперация_МассоваяОтправка(РезультатОтправки);

КонецПроцедуры

// Процедура - проверить и запустить накопленные цепочки действия.
//
// Параметры:
//  РезультатОтправкиё			 - РезультатОтправки	 - структура отправки
//  СчетчикОбработанныхДействий	 - Число				 - сколько действие обработано
//
&НаКлиенте
Процедура МассоваяОперация_ПроверитьНакопленныеДействия(РезультатОтправки) Экспорт
	
	Попытка
		
		ПараметрыКОтправке			= РезультатОтправки.ПараметрыОтправки;
		ДанныеКОтправке				= РезультатОтправки.ДанныеКОтправке;
		ОчередьДействий				= МассоваяОперация_Получить(РезультатОтправки, "Очередь");
		ИдентификаторыОбработаны	= Новый Массив;
		ВремяОжиданияДействия		= РезультатОтправки.ПараметрыОтправки.ОжиданиеОтвета;
		
		Для Каждого КлючИЗначениеДействие Из ОчередьДействий Цикл
			
			ЦепочкаКомандОбработки	= КлючИЗначениеДействие.Значение;
			СтатусДействия			= ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "Статус");
			ТекущаяБлокировка		= МассоваяОперация_Получить(РезультатОтправки, "Блокировка");
			
			Если	СтатусДействия = "Завершено" Тогда
				
				ИдентификаторыОбработаны.Добавить(КлючИЗначениеДействие.Ключ);
				Продолжить;
				
			КонецЕсли;
			
			Если ЦепочкаКомандОбработки.УровеньДействия < ТекущаяБлокировка Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Если		СтатусДействия = "ОжидаетОтвета" Тогда
				
				МеткаВремени	= ТекущаяДата() - ЦепочкаКомандОбработки.Время.Запуск;
				Если МеткаВремени < ЦепочкаКомандОбработки.Время.Ожидание Тогда
					
					Продолжить;
					
				КонецЕсли;
				ОшибкаДействия	= "Действие было запущено, но не обработано.";
				СтатусДействия	= "Ошибка";
				ОшибкаОбработки = НовыйСбисИсключение(, "МодульОбъектаКлиент.МассоваяОперация_ПроверитьНакопленныеДействия",,,ОшибкаДействия);
				ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, СтатусДействия, ОшибкаОбработки);
				
			ИначеЕсли	СтатусДействия = "ОжидаетПоПодписке" Тогда
				
				// Если действие ожидает по подписке, то проверить что оно активно и не было завершено по какой-либо причине
				ПараметрыПодписки	= ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "ПараметрыПодписки");
				АктивнаяОчередь		= МассоваяОперация_Получить(РезультатОтправки,		"Очередь");
				
				Если АктивнаяОчередь.Получить(ПараметрыПодписки.Идентификатор) = Неопределено Тогда 
					
					ОшибкаДействия	= "Действие было подписано на операцию """ + ПараметрыПодписки.Идентификатор + """, но не обработано.";
					СтатусДействия	= "Ошибка";
					ОшибкаОбработки = НовыйСбисИсключение(, "МодульОбъектаКлиент.МассоваяОперация_ПроверитьНакопленныеДействия",,,ОшибкаДействия);
					ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, СтатусДействия, ОшибкаОбработки);
						
				КонецЕсли;
				
			КонецЕсли;
			
			Если		СтатусДействия = "Ошибка" Тогда
				
				ВыполняемоеДействие	= ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "ТекущаяКоманда");
				ПараметрыОшибки		= ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "Ошибка");
				МассоваяОперация_ЦепочкаКомандОбработки_Ошибка(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыОшибки);
				
				ИдентификаторыОбработаны.Добавить(КлючИЗначениеДействие.Ключ);

			ИначеЕсли	СтатусДействия = "ГотовКЗапуску" Тогда
				
				МассоваяОперация_ЗапуститьЦепочкуКоманд(РезультатОтправки, ЦепочкаКомандОбработки);
				Продолжить;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого ИдентификаторОтработан Из ИдентификаторыОбработаны Цикл
			
			ОчередьДействий.Удалить(ИдентификаторОтработан);
			
		КонецЦикла;

		МассоваяОперация_ЗапуститьПрочиеКоманды(РезультатОтправки);
		МассоваяОперация_ОбработатьОтветы_Асинхронно(РезультатОтправки);
		
	Исключение
		
		//Если прервано с ошибкой, то завершаем отправку и переходим к обработке завершения
		ФатальнаяОшибка = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.МассоваяОперация_МассоваяОтправка_Завершение");
		МассоваяОперация_ОбработатьФатальнуюОшибка(РезультатОтправки, ФатальнаяОшибка);
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура МассоваяОперация_ЗапуститьЦепочкуКоманд(РезультатОтправки, ЦепочкаКомандОбработки) Экспорт
	
	ВремяОжиданияЦепочек	= МассоваяОперация_Получить(РезультатОтправки, "ОжиданияЦепочек");
	КомандаЗапуска			= ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "ЗапускаемаяКоманда");
	ВремяОжиданияЦепочки	= ВремяОжиданияЦепочек.Получить(КомандаЗапуска);
	
	Если ВремяОжиданияЦепочки = Неопределено Тогда
		
		ВремяОжиданияЦепочки = РезультатОтправки.ПараметрыОтправки.ОжиданиеКоманды;
		
	КонецЕсли;
	
	ПараметрыЗапуска = Новый ФиксированнаяСтруктура("ВремяОжидания", ВремяОжиданияЦепочки);
	ЦепочкаКомандОбработки_ЗапуститьКоманду(ЦепочкаКомандОбработки, РезультатОтправки, ПараметрыЗапуска);

КонецПроцедуры

// Процедура - операции для завершения отправки, после выполнения всех требуемых действий
//
// Параметры:
//  АргументЗавершения	 - Строка/СбисИсключение - с чем завершается отправка. Если Исключение, то заканчивается вообще. Иначе, может ожидать получения всех ответов
//  РезультатОтправки	 - РезультатОтправки	 - структура отправки
//
&НаКлиенте
Процедура МассоваяОперация_МассоваяОтправка_Завершение(АргументЗавершения="Завершено", РезультатОтправки) Экспорт 
	
	Отказ = Ложь;
	Если		АргументЗавершения = Неопределено Тогда
		
		//Ложное срабатывание. Возможно, закрыли форму индикатора.
		Возврат;
		
	ИначеЕсли	АргументЗавершения = "Завершено" Тогда
		
		//Всё ок, дошли до конца
		
	ИначеЕсли	АргументЗавершения = "Прервать" Тогда
		
		//Поступила команда прервать. Надо чтобы все прошлые обработчики закончили работу и уже потом позвать завершение 
		ОтложенноВыполнить = НовыйОтложенноеДействие(
			Новый Структура("ОписаниеОповещения, Аргумент, ИдентификаторДействия", 
			РезультатОтправки.ПараметрыОтправки.ОбработчикЗавершить, "Прервано", Новый УникальныйИдентификатор));
		ПодключитьОтложенноеДействие(ОтложенноВыполнить);
		Возврат		
	
	ИначеЕсли	АргументЗавершения = "Прервано" Тогда
		
		//Обработка прервалась
		Если РезультатОтправки.Свойство("ПоследнееОтложенноеДействие") Тогда
			ОтключитьОтложенноеДействие(РезультатОтправки.ПоследнееОтложенноеДействие);
			РезультатОтправки.Удалить("ПоследнееОтложенноеДействие");
		КонецЕсли;
		АргументЗавершения = НовыйСбисИсключение(790, "МодульОбъектаКлиент.МассоваяОперация_МассоваяОтправка_Завершение");
		Отказ = Истина;
		
	ИначеЕсли	АргументЗавершения = "ОжиданиеОтветов" Тогда
		
		ДанныеКОтправке = РезультатОтправки.ДанныеКОтправке;
		МассоваяОперация_СпрятатьСтатус(РезультатОтправки);
			
		МассоваяОперация_ПоказатьСтатус(РезультатОтправки, "Ожидание ответов", 0);
		
		ОтложенноОбновитьПрогрессБар = НовыйСбисОписаниеОповещения("МассоваяОперация_Асинх_СпрятатьСтатус", МодульОбъектаКлиент());
		ПодключитьОтложенноеДействие(ОтложенноОбновитьПрогрессБар, Новый ФиксированнаяСтруктура("Аргумент", РезультатОтправки));
		
		ПараметрыЗавершить = Новый Структура("ОжидатьСвободныеПотоки, ЧислоПачекОтправить, ОтправлятьЦелуюПачку", Ложь, 1, Ложь);
		
		ОтложеннаяИтерацияответов = НовыйСбисОписаниеОповещения("МассоваяОперация_МассоваяОтправка_ЧтениеОтветов", МодульОбъектаКлиент(), РезультатОтправки);
		РезультатОтправки.ПараметрыОтправки.Вставить("ОбработчикОжиданияОтветов", ОтложеннаяИтерацияответов);
		
		ОтложенноВыполнить = НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения, Аргумент", ОтложеннаяИтерацияответов, ПараметрыЗавершить));
		ПодключитьОтложенноеДействие(ОтложенноВыполнить);
		Возврат;
		
	Иначе
		
		//Отправка прервана из-за ошибки
		СообщитьСбисИсключение(АргументЗавершения, Новый Структура("Отложенно", Истина));
		Отказ = Истина;
		
	КонецЕсли;
	
	Если Отказ Тогда
		
		//Запишем что удалось получить.
		МассоваяОперация_СпрятатьСтатус(РезультатОтправки);
		МассоваяОперация_ПоказатьСтатус(РезультатОтправки, "Завершение отправки", Неопределено,,Новый Структура);
		АсинхронноеСбисСобытие = НовыйАсинхронноеСбисСобытие(, АргументЗавершения, "Error");
		
		Попытка

			ГлобальныйКэш_ЧтениеОтветовИВызовСобытий();
			МассоваяОперация_ОсвободитьПотоки(РезультатОтправки, АсинхронноеСбисСобытие);
			МассоваяОперация_ЗаписатьНакопленныеСтатусы(РезультатОтправки);
			
		Исключение
			
			СообщитьСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.МассоваяОперация_МассоваяОтправка_Завершение");
			
		КонецПопытки;
		
	КонецЕсли;
		
	ГлавноеОкно.Кэш.Вставить("РезультатОтправки", МассоваяОперация_Выгрузить(РезультатОтправки));
	
    МассоваяОперация_СпрятатьСтатус(РезультатОтправки, Истина);
	
	ОтложенноеДействие = НовыйСбисОписаниеОповещения("МассоваяОперация_ОтправитьЗаписиПрикладнойСтатистики", МодульОбъектаКлиент());
	ПодключитьОтложенноеДействие(ОтложенноеДействие, РезультатОтправки);
	
	МодульПользовательскойТочкиПослеОтправки = НайтиФункциюСеансаОбработки("сбисПослеОтправкиПакетов", "РаботаСДокументами1С");
	Если МодульПользовательскойТочкиПослеОтправки <> Ложь Тогда
		МодульПользовательскойТочкиПослеОтправки.сбисПослеОтправкиПакетов(ГлавноеОкно.Кэш);	
	КонецЕсли;

	ВыполнитьСбисОписаниеОповещения(РезультатОтправки, РезультатОтправки.ОбработчикРезультата);
	
КонецПроцедуры

// Процедура - Результат отправки массовая отправка чтение ответов
//
// Параметры:
//  ПараметрыЗавершить	 - Струкутра			 - получение и обработка ответов на запущенные потоки
//  РезультатОтправки	 - РезультатОтправки	 - структура отправки
//
&НаКлиенте
Процедура МассоваяОперация_МассоваяОтправка_ЧтениеОтветов(ПараметрыЗавершить, РезультатОтправки) Экспорт
	
	Попытка
		
		МассоваяОперация_ОбработкаПрерывания(РезультатОтправки);
		//МассоваяОперация_ОбработатьОтветы_Асинхронно(РезультатОтправки);
		МассоваяОперация_ПроверитьНакопленныеДействия(РезультатОтправки);
		//МассоваяОперация_ОтправитьНакопленные(РезультатОтправки, ПараметрыЗавершить);
		МассоваяОперация_ЗаписатьНакопленныеСтатусы(РезультатОтправки);

		ОбщееЧислоОжидания	= РезультатОтправки.Счетчики.СформированоПакетов + РезультатОтправки.Счетчики.ПовторныхОтправок;
		Если ОбщееЧислоОжидания = 0 Тогда
			ОбщееЧислоОжидания = 1;	
		КонецЕсли;
		МассоваяОперация_ПоказатьСтатус(РезультатОтправки, "Ожидание ответов", Окр(РезультатОтправки.ПолученоОтветов * 100 / ОбщееЧислоОжидания), "(прервать -  Ctrl+Break)");
		
		//Пока всё не прогрузилось, выполняем отправку остатков.
		ОчередьКоманд = МассоваяОперация_Получить(РезультатОтправки, "Очередь");
		
		ЕстьЕщеНеобработанныеДействия	=	ОчередьКоманд.Количество()
										Или	РезультатОтправки.ПараметрыОтправки.Потоки.Количество()
										Или	РезультатОтправки.НаЗаписьСтатусов.Ответы.Количество()
										Или	РезультатОтправки.НаЗаписьСтатусов.Ошибки.Количество();
										
		Если ЕстьЕщеНеобработанныеДействия Тогда
			
			ПараметрыОтложенногоДействия	= Новый Структура(
			"ОписаниеОповещения, ИдентификаторДействия, Аргумент", 
			РезультатОтправки.ПараметрыОтправки.ОбработчикОжиданияОтветов, Новый УникальныйИдентификатор, ПараметрыЗавершить);
			
			//Если	ЦепочекСформированоДо 	= РезультатОтправки.Счетчики.ЦепочекСформировано
			//	Или	ЦепочекЗакрытоДо		= РезультатОтправки.Счетчики.ЦепочекЗавершено Тогда 
			//	
			//	// Команды не менялись и не формировались, ставим паузу на чтение
			//	ПараметрыОтложенногоДействия.Вставить("Периодичность", 3);
			//	ПараметрыОтложенногоДействия.Вставить("ВызватьСразу", Ложь);
			//	
			//КонецЕсли;
			
			ОтложенноВыполнить = НовыйОтложенноеДействие(ПараметрыОтложенногоДействия);
				
		Иначе
				
			ОтложенноВыполнить = НовыйОтложенноеДействие(
				Новый Структура("ОписаниеОповещения, ИдентификаторДействия, Аргумент", 
				РезультатОтправки.ПараметрыОтправки.ОбработчикЗавершить, Новый УникальныйИдентификатор, "Завершено"));
				
		КонецЕсли;
			
	Исключение
		//Упала неизвестная ошибка, завершить обработку.
		ОшибкаЗавершения	= НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.МассоваяОперация_МассоваяОтправка_Завершение");
		Если ОшибкаЗавершения.code = 790 Тогда
			//Тут просто прервать отправку, форма индикатора должна вызвать завершение.
			Возврат;
		КонецЕсли;
		ОтложенноВыполнить	= НовыйОтложенноеДействие(
							Новый Структура("ОписаниеОповещения, Аргумент, ИдентификаторДействия", 
							РезультатОтправки.ПараметрыОтправки.ОбработчикЗавершить, ОшибкаЗавершения, Новый УникальныйИдентификатор));
	КонецПопытки;
	
	ПодключитьОтложенноеДействие(ОтложенноВыполнить);
	
КонецПроцедуры

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_МассоваяОперация_public
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_МассоваяОперация_private
#КонецОбласти

