
&НаКлиенте
Функция НовыйСписокMappingObject(ДопПараметры = Неопределено) Экспорт
	Перем Назначение;
	
	Отказ = Ложь;
	Интеграция = ПолучитьИдИнтеграции(Отказ);
	Если Отказ
		ИЛИ НЕ ЗначениеЗаполнено(Интеграция) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ДопПараметры = Неопределено
		ИЛИ ДопПараметры.Свойство("Назначение", Назначение) Тогда
		
		Назначение = "";
		
	КонецЕсли;

	Возврат Новый Структура("_тип, Список, Назначение",
							"СписокMappingObject",
							Новый Массив,
							Назначение);

КонецФункции // НовыйMappingObject()

&НаКлиенте
Процедура СписокMappingObject_Добавить(СписокMappingObject, ДопПараметры) Экспорт

	Если НЕ ЭтоТипСбис(СписокMappingObject, "СписокMappingObject") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопПараметры.Свойство("MappingObject") Тогда
	
		СписокMappingObject.Список.Добавить(ДопПараметры.MappingObject);
		
	ИначеЕсли НЕ ДопПараметры.Свойство("Назначение")
		ИЛИ (ЗначениеЗаполнено(СписокMappingObject.Назначение)
			И НЕ СписокMappingObject.Назначение = ДопПараметры.Назначение) Тогда
		
		ВызватьСбисИсключение(,
							"МодульОбъектаКлиент.СписокMappingObject_Добавить",
							,
							"Не передан обязательный параметр в ДопПараметры Назначение
							|или он не соответствует списку");
	Иначе
		
		MappingObject = НовыйMappingObject(ДопПараметры);
		СписокMappingObject.Список.Добавить(MappingObject);
		
		Если НЕ ЗначениеЗаполнено(СписокMappingObject.Назначение) Тогда
			СписокMappingObject.Назначение = ДопПараметры.Назначение;
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокMappingObject_Записать(СписокMappingObject, ДопПараметры = Неопределено) Экспорт

	Если НЕ ЭтоТипСбис(СписокMappingObject, "СписокMappingObject")
		ИЛИ НЕ СписокMappingObject.Список.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Интеграция = ПараметрSABY("Интеграция", "Сеанс");
	Данные = Новый Массив;
	Отказ = Ложь;
	
	Для каждого MappingObject Из СписокMappingObject.Список Цикл
	
		ПараметрыЗаписи = Новый Структура("Назначение, MappingObject",
										СписокMappingObject.Назначение,
										MappingObject);
		Данные.Добавить(_MappingObject_Структура(ПараметрыЗаписи));
	
	КонецЦикла;
	
	ПараметрыВызова = Новый Структура("Data", Данные);
	
	Если СписокMappingObject.Назначение = "Контрагенты" Тогда
		// Сначала надо обернуть на онлайне
	ИначеЕсли СписокMappingObject.Назначение = "Документы" Тогда
		Интеграция.ExtSysDocument_WriteMapping(ПараметрыВызова, Новый Структура, Отказ);
	Иначе
		ВызватьСбисИсключение(,
							"МодульОбъектаКлиент.СписокMappingObject_Записать",
							,
							"Неизвестное Назначение маппинга");
	КонецЕсли;
	
КонецПроцедуры

