
// Функция - выгружает данные стороны в определенном формате 
//
// Параметры:
//  ДанныеСтороны	 - экземпляр класса сторона	 - Структура СфЮл/СвФЛ
// 
// Возвращаемое значение:
//  Структура - формат с полями "ИНН, КПП, КодФилиала". Если чего-то не хватает, то ""
//
&НаКлиенте
Функция СторонаSABY_Выгрузить(ДанныеСтороны, КлючВыгрузки = "") Экспорт
	Перем СвЮлФлСтороны;
	
	Если КлючВыгрузки = "3.01" Тогда
		
		// Режим выгрузки стороны для добавления в структуру данных
		ДанныеСтороныВыгружены = СоздатьКопиюОбъекта(ДанныеСтороны);
		ДанныеСтороныВыгружены.Удалить("_класс");
		ДанныеСтороныВыгружены.Удалить("ДополнительныеДанные");
		ДанныеСтороныВыгружены.Удалить("Роль");
		
	ИначеЕсли КлючВыгрузки = "3.03" Тогда
		
		ДанныеСтороныВыгружены = СторонаSABY_Выгрузить(ДанныеСтороны, КлючВыгрузки = "3.01");
		Если ДанныеСтороныВыгружены.Свойство("Адрес") Тогда
			КопияСторонаАдрес = СоздатьКопиюОбъекта(ДанныеСтороныВыгружены.Адрес, Новый ФиксированнаяСтруктура("ГлубокаяКопия", Истина)); 
			Для Каждого адресТип из КопияСторонаАдрес Цикл 
				Если	адресТип.свойство("Тип")
					И	ЗначениеЗаполнено(адресТип.Тип) Тогда
					тип = адресТип.Тип;
					адресТип.Удалить("Тип");
				Иначе
					тип = "Юридический";
				КонецЕсли;
				Если Не адресТип.свойство(тип) Тогда
					адресТип.Вставить(тип, Новый структура());
					Если адресТип.свойство("АдрТекст") Тогда
						Если Не адресТип.свойство("АдрИно") И Не адресТип.свойство("АдрРФ") Тогда
							адресТип[тип].вставить("АдрТекст",адресТип.АдрТекст);
						КонецЕсли;
						адресТип.Удалить("АдрТекст");
					КонецЕсли;
					Если адресТип.свойство("АдрИно") Тогда
						адресТип[тип].вставить("АдрИно",адресТип.АдрИно);
						адресТип.Удалить("АдрИно");
					КонецЕсли;
					Если адресТип.свойство("АдрРФ") Тогда
						адресТип[тип].вставить("АдрРФ",адресТип.АдрРФ);
						адресТип.Удалить("АдрРФ");
					КонецЕсли;
				КонецЕсли;
			Конеццикла;
			ДанныеСтороныВыгружены.Вставить("Адрес", КопияСторонаАдрес);
		КонецЕсли;
		
		ДанныеСтороныВыгружены.Удалить("Представители");
		
	Иначе
		
		ДанныеСтороныВыгружены = Новый Структура("ИНН, КПП, КодФилиала, БИН, ИИН, ИдентификаторЛица, ИностраннаяОрганизация, Наименование", 
												"", "", "", "", "", "", Ложь);
		Если		ДанныеСтороны = Неопределено Тогда
			
			Возврат ДанныеСтороныВыгружены;
			
		ИначеЕсли	ДанныеСтороны.Свойство("СвЮЛ", СвЮлФлСтороны) Тогда
						
			Если СвЮлФлСтороны.Свойство("КПП") Тогда
				
				ДанныеСтороныВыгружены.КПП = СвЮлФлСтороны.КПП;
				
			КонецЕсли;
					
		ИначеЕсли 	ДанныеСтороны.Свойство("СвИн", СвЮлФлСтороны) Тогда
			
			ДанныеСтороныВыгружены.ИностраннаяОрганизация = Истина;
			
			Если СвЮлФлСтороны.Свойство("КПП") Тогда
				
				ДанныеСтороныВыгружены.КПП = СвЮлФлСтороны.КПП;
				
			КонецЕсли;   
			
		ИначеЕсли	ДанныеСтороны.Свойство("СвФЛ", СвЮлФлСтороны) Тогда 
			
			//Есть СвФЛ 
			
		ИначеЕсли	ДанныеСтороны.Свойство("СвИП", СвЮлФлСтороны) Тогда 
			
			//Есть СвИП
			
		Иначе
			
			//Нет данных стороны
			ОшибкаНетДанных = НовыйСбисИсключение(, "РаботаСДокументами1С.СгенерироватьПакет", 724, "Сторона не определена", "Отсутствует ИНН/КПП");
			ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаНетДанных);
			
		КонецЕсли;
		
		Если		СвЮлФлСтороны.Свойство("ИНН") Тогда 
			
			ДанныеСтороныВыгружены.ИНН				= СвЮлФлСтороны.ИНН;
			ДанныеСтороныВыгружены.ИдентификаторЛица	= СвЮлФлСтороны.ИНН;
			
		ИначеЕсли	СвЮлФлСтороны.Свойство("БИН") Тогда 
			
			ДанныеСтороныВыгружены.БИН				= СвЮлФлСтороны.БИН;
			ДанныеСтороныВыгружены.ИдентификаторЛица	= СвЮлФлСтороны.БИН;
			
		ИначеЕсли	СвЮлФлСтороны.Свойство("ИИН") Тогда 
			
			ДанныеСтороныВыгружены.ИИН				= СвЮлФлСтороны.ИИН;
			ДанныеСтороныВыгружены.ИдентификаторЛица	= СвЮлФлСтороны.ИИН;
			
		ИначеЕсли	СвЮлФлСтороны.Свойство("ИдентификационныйНомер") Тогда
			
			// СвИн
			ДанныеСтороныВыгружены.ИдентификаторЛица	= СвЮлФлСтороны.ИдентификационныйНомер;
			
		Иначе
			
			//Нет данных стороны
			ДанныеСтороныВыгружены.ИдентификаторЛица	= Неопределено
			//ВызватьСбисИсключение(724, "РаботаСДокументами1С.СгенерироватьПакет",, "Сторона не определена", "Отсутствует идентификатор лица");  
			
		КонецЕсли;
		
		Если Не СвЮлФлСтороны.Свойство("Название", ДанныеСтороныВыгружены.Наименование) Тогда
			
			НаименованиеСформировать = "";
			Если СвЮлФлСтороны.Свойство("Фамилия") Тогда
				
				НаименованиеСформировать = НаименованиеСформировать + СвЮлФлСтороны.Фамилия		+ " ";
				
			КонецЕсли;
				
			Если СвЮлФлСтороны.Свойство("Имя") Тогда
				
				НаименованиеСформировать = НаименованиеСформировать + СвЮлФлСтороны.Имя			+ " ";
				
			КонецЕсли;

			Если СвЮлФлСтороны.Свойство("Отчество") Тогда
				
				НаименованиеСформировать = НаименованиеСформировать + СвЮлФлСтороны.Отчество	+ " ";
				
			КонецЕсли;
			
			ДанныеСтороныВыгружены.Наименование = СокрЛП(НаименованиеСформировать);
			
		КонецЕсли;

		Если	СвЮлФлСтороны.Свойство("КодФилиала")
			И	ЗначениеЗаполнено(СвЮлФлСтороны.КодФилиала) Тогда
			
			ДанныеСтороныВыгружены.КодФилиала = СвЮлФлСтороны.КодФилиала;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеСтороныВыгружены;
	
КонецФункции

&НаКлиенте
Функция СторонаSABY_Скопировать(ДанныеСтороны) Экспорт
	
	Возврат СоздатьКопиюОбъекта(ДанныеСтороны, Новый ФиксированнаяСтруктура("ГлубокаяКопия", Истина));
	
КонецФункции

// Функция ищет элемент справочника в базе 1С по данным участника в универсальном формате
//
// Параметры:
//  оУчастник	 - Структура	 - класс стороны
//  ДопПараметры - Струкутра	 - расширение поиска
//		ЗначениеПоУмолчанию - Значение, возвращяемое, если не найдена карточка
//		УзелИниПоиска	- 
//		ТипСтороны		-
//		Тип1С			-
// 
// Возвращаемое значение:
//  СправочникСсылка, Неопределено - Найденная ссылока, неопределено или значение поумолчанию
//
&НаКлиенте
Функция Сторона_НайтиКарточку1С(оУчастник, ДопПараметры) Экспорт

	Карточки1С = Сторона_НайтиКарточки1С(оУчастник, ДопПараметры);
	
	Если Карточки1С.Количество() Тогда
		Возврат Карточки1С[0];
	ИначеЕсли ДопПараметры.Свойство("ЗначениеПоУмолчанию") Тогда
		Возврат ДопПараметры.ЗначениеПоумолчанию;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - ищет элемент справочника в базе 1С по данным участника в универсальном формате
//
// Параметры:
//  оУчастник	 - Структура	 - класс стороны
//  ДопПараметры - Струкутра	 - расширение поиска
//		УзелИниПоиска	- узел мДокумент стороны на случай, если там есть отдельное описание поиска стороны для документа
//		ТипСтороны		- тип справочника, который нужно получить
//		КлючСтороны		- Контрагент/Организация - описываемый тип, в случае если по ТипСтороны нет описания поиска
//		ВыполнятьПоиск	- Булево - принудительное выполнение поиска, даже если в опциях отключено
// 
// Возвращаемое значение:
//  Массив - Список найденныхссылок
//
&НаКлиенте
Функция Сторона_НайтиКарточки1С(оУчастник, ДопПараметры) Экспорт

	Возврат Сторона_НайтиКарточки1СЗапросом(оУчастник, ДопПараметры);
	
КонецФункции

&НаКлиенте
Функция Сторона_НайтиКарточки1СЗапросом(оУчастник, ДопПараметры)
	Перем СвФлЮл, УзелИниПоиска, ТекстЗапроса, ТолькоПоИНН;

	Результат = Новый Массив;
	
	Если	Не	ТипЗнч(оУчастник) = Тип("Структура")
		Или		оУчастник = Неопределено Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	ТипСтороны					= ДопПараметры.ТипСтороны;
	ПараметрыПоискаРеквизиты	= ПолучитьЗначениеПараметраТекущегоСеанса("РеквизитыСторонДляПоиска");
	КлючРеквизитовСтороны		= ПараметрыПоискаРеквизиты.Синонимы.Получить(ТипСтороны);
	Если КлючРеквизитовСтороны = Неопределено Тогда
		
		// По типу нет реквизитов, должен быть ключ стороны 
		КлючРеквизитовСтороны = ДопПараметры.КлючСтороны;
		
	КонецЕсли;
	
	Если Не ПараметрыПоискаРеквизиты.Свойство(КлючРеквизитовСтороны, ПараметрыПоискаРеквизиты) Тогда
		
		ВызватьСбисИсключение(760, "МодульОбъектаКлиент.Сторона_НайтиКарточки1С",,, "Отсутствует описание стороны " + ТипСтороны + " в ини Конфигурация для поиска.");
		
	КонецЕсли;
	
	Если	Не (	ДопПараметры.Свойство("ВыполнятьПоиск")
			   И	ДопПараметры.ВыполнятьПоиск)
		И	ПараметрыПоискаРеквизиты.ПоискОтключен Тогда
		
		// Поиск не проводим. Используется только сопоставление сторон через Маппинг
		Возврат Результат;
		
	КонецЕсли;
	
	КлючЗапроса = ПараметрыПоискаРеквизиты.КлючЗапроса;
	
	Если Не ДопПараметры.Свойство("ТолькоПоИНН", ТолькоПоИНН) Тогда
		
		ТолькоПоИНН = ПараметрыПоискаРеквизиты.ПоискТолькоПоИНН;
		
	КонецЕсли;
	
	ПараметрыПостроенияЗапроса	= Новый Структура;
	СторонаДанные = СторонаSABY_Выгрузить(оУчастник);
	
	Если оУчастник.Свойство("СвФЛ", СвФлЮл) Тогда
		ТолькоПоИНН = Истина;                  
	КонецЕсли;   
	ПараметрыПостроенияЗапроса.Вставить("ИНН",					СторонаДанные.ИНН);
	ПараметрыПостроенияЗапроса.Вставить("КПП",					СторонаДанные.КПП);
	ПараметрыПостроенияЗапроса.Вставить("ИдентификаторЛица",	СторонаДанные.ИдентификаторЛица);
	
	// Определить текст запроса
	СтрокаФильтрКПП = "Участник." + ПараметрыПоискаРеквизиты.КПП + "=&КПП"; 
	Если	ДопПараметры.Свойство("УзелИниПоиска", УзелИниПоиска)
		И	УзелИниПоиска.Свойство("Запрос" + КлючЗапроса) Тогда
		
		// В ини на поиск есть свой запрос для соответствующей стороны
		ТекстЗапроса = ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.РассчитатьЗначение("Запрос" + КлючЗапроса, УзелИниПоиска);
		
	Иначе
		
		// Предустановленный запрос в ини конфигурации
		ПараметрыПоискаРеквизиты.Свойство("Запрос", ТекстЗапроса);
		
	КонецЕсли;
	
	Если ТекстЗапроса = Неопределено Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Участник.Ссылка
		|ИЗ
		|	Справочник." + ПараметрыПоискаРеквизиты.Тип + " КАК Участник
		|ГДЕ
		|	НЕ Участник.ПометкаУдаления 
		|	И Участник." + ПараметрыПоискаРеквизиты.ИНН + "=&ИНН
		|	И " + СтрокаФильтрКПП;
		
	КонецЕсли;
	
	ДопПараметрыДляПоиска = Новый Структура;
	//Убрать из текста запроса у равенства пробелы для корректной замены условий.
	ТекстЗапроса = СтрЗаменить(СтрЗаменить(ТекстЗапроса,
								" =", "="),
								"= ", "=");
	
	Если ТолькоПоИНН Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрокаФильтрКПП, "ИСТИНА");
		
	КонецЕсли;
	
	//Подразделение, если есть
	Если	оУчастник.Свойство("Подразделение") 
		И	оУчастник.Подразделение.Свойство("Идентификатор") Тогда
		
		ПараметрыПостроенияЗапроса.Вставить("КодФилиала", оУчастник.Подразделение.Идентификатор);
		
	Иначе
		
		ПараметрыПостроенияЗапроса.Вставить("КодФилиала", "");
		
	КонецЕсли;
	
	//GLN, если есть
	Если	оУчастник.Свойство("GLN") Тогда
		
		ПараметрыПостроенияЗапроса.Вставить("GLN",	оУчастник.GLN);
		
		Если СведенияОбУстановленныхРасширениях("КонтурEDI") Тогда
			// Поиск по данным Контура проводить только если есть GLN стороны
			ТекстЗапроса = ТекстЗапроса + "
						|
						|ОБЪЕДИНИТЬ
						|
						|  ВЫБРАТЬ
						|	КонтурEDI_ДополнительныеРеквизиты.Объект КАК Ссылка
						|ИЗ
						|	РегистрСведений.КонтурEDI_ДополнительныеРеквизиты КАК КонтурEDI_ДополнительныеРеквизиты
						|ГДЕ
						|	(КонтурEDI_ДополнительныеРеквизиты.Свойство = ""GLN_" + КлючЗапроса + """)
						|	И КонтурEDI_ДополнительныеРеквизиты.Значение = &GLN";
						
		КонецЕсли;
		
	Иначе
		
		ПараметрыПостроенияЗапроса.Вставить("GLN",	"");
		
	КонецЕсли;
	
	//Пользовательские органичения
	Если оУчастник.Свойство("Ограничения") Тогда
		
		Для Каждого Параметр Из оУчастник.Ограничения Цикл
			
			ПараметрыПостроенияЗапроса.Вставить(Параметр.Ключ, Параметр.Значение);
			
		КонецЦикла;	
		
	КонецЕсли;
	
	РезультатПоиска = Сторона_НайтиКарточки1СЗапросомСервер(ТекстЗапроса, ПараметрыПостроенияЗапроса, ДопПараметрыДляПоиска);
	РезультатИтог	= Новый Массив;
	
	Для Каждого РезультатСтрока Из РезультатПоиска Цикл 
		Если ТипЗнч(РезультатСтрока) = Тип("Структура") Тогда
			РезультатИтог.Добавить(РезультатСтрока.Ссылка);
		Иначе
			РезультатИтог.Добавить(РезультатСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатИтог;
	
КонецФункции

&НаСервере
Функция Сторона_НайтиКарточки1СЗапросомСервер(ТекстЗапроса, ПараметрыЗапроса, ДопПараметры)
	
	Возврат МодульОбъектаСервер().ВыполнитьЗапросСПараметрами(ТекстЗапроса, ПараметрыЗапроса);
	
КонецФункции

// Функция получаяет значение по ключу от данных стороны
//
// Параметры:
//  ДанныеСтороны	- Структура	 - Экземпляр, от которого надо получить значение
//  КлючПолучить	- Строка	 - Что хотим получить из стороны
//  ДопПараметры	- Структура	 - Расширение
// 
// Возвращаемое значение:
//  Произвольный - Найденное значение или Неопределено
//
&НаКлиенте
Функция Сторона_Получить(ДанныеСтороны, КлючПолучить, ДопПараметры = Неопределено) Экспорт 
	Перем Результат; 
	
	Если КлючПолучить = "ИдентификаторЛица" Тогда 
	
		ПлоскиеДанныеСтороны = СторонаSABY_Выгрузить(ДанныеСтороны);
		Возврат ПлоскиеДанныеСтороны.ИдентификаторЛица;
		
	ИначеЕсли КлючПолучить = "КлючИдентификатора" Тогда 
		
		Результат = Сторона_КлючИдентификатора(ДанныеСтороны);  
		
	ИначеЕсли КлючПолучить = "Название" Тогда
		
		Результат = Сторона_НазваниеСтороны(ДанныеСтороны);
		
	ИначеЕсли КлючПолучить = "КлючСертификата" Тогда
		
		КлючИдентификатора	= Сторона_КлючИдентификатора(ДанныеСтороны);
		ПлоскиеДанные		= СторонаSABY_Выгрузить(ДанныеСтороны);
		Возврат ПлоскиеДанные[КлючИдентификатора];
		
	ИначеЕсли КлючПолучить = "ЗапретРедакций" Тогда
		
		Результат = ДанныеСтороны.Свойство("ЗапретРедакций")
				И	ДанныеСтороны.ЗапретРедакций = Истина;

	Иначе
		
		ДанныеСтороны.Свойство(КлючПолучить, Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Функция Сторона_НазваниеСтороны(ДанныеСтороны)
	
	Перем НазваниеСтороны;
	
	Если ДанныеСтороны.Свойство("СвЮЛ", НазваниеСтороны) Тогда
		
		НазваниеСтороны = НазваниеСтороны.Название;
		
	ИначеЕсли ДанныеСтороны.Свойство("СвФЛ") Тогда
		ДанныеФЛСтороны = ДанныеСтороны.СвФЛ;
		Если ДанныеФЛСтороны.Свойство("НазваниеПолное") Тогда 
			НазваниеСтороны = ДанныеФЛСтороны.НазваниеПолное;	
		ИначеЕсли ДанныеФЛСтороны.Свойство("Название") Тогда
			НазваниеСтороны = ДанныеФЛСтороны.Название;
		Иначе	
			НазваниеСтороны = ДанныеФЛСтороны.Фамилия;
			НазваниеСтороны = НазваниеСтороны + ?(ЗначениеЗаполнено(НазваниеСтороны), " ", "") + ДанныеФЛСтороны.Имя;
			НазваниеСтороны = НазваниеСтороны + ?(ЗначениеЗаполнено(НазваниеСтороны), " ", "") + ДанныеФЛСтороны.Отчество;
		КонецЕсли; 
		
	ИначеЕсли ДанныеСтороны.Свойство("Название") Тогда
		
		НазваниеСтороны = ДанныеСтороны.Название; 
		
	Иначе
		
		НазваниеСтороны = "";	
	
	КонецЕсли;

	Возврат НазваниеСтороны;	
	
КонецФункции

&НаКлиенте
Функция Сторона_КлючИдентификатора(ДанныеСтороны)  
	
	ДанныеСтороныПлоские = СторонаSABY_Выгрузить(ДанныеСтороны);
	
	Если ЗначениеЗаполнено(ДанныеСтороныПлоские.ИИН) Тогда
		
		Возврат "ИИН";
		
	ИначеЕсли ЗначениеЗаполнено(ДанныеСтороныПлоские.БИН) Тогда
		
		Возврат "БИН";
		
	Иначе  
		
		Возврат "ИНН";
		
	КонецЕсли;
	
КонецФункции

//Функция возвращает ключ стороны для получения доп. параметров в кэше
&НаКлиенте
Функция	 КлючСтороныДляДопПараметров(мСторона)
	
	Перем СвФлЮл; 
	
	КлючИдентификатора = МодульОбъектаКлиент().Сторона_Получить(мСторона, "КлючИдентификатора");
	
	Если		мСторона.Свойство("СвЮЛ", СвФлЮл) Тогда   
		
		Идентификатор = МодульОбъектаКлиент().ПрименитьФорматКСтроке(СвФлЮл[КлючИдентификатора], "ЧГ=0", "Формат");
		Результат = Идентификатор + ?(СвФлЮл.Свойство("КПП"), "_" + СвФлЮл.КПП, "") + "_" + Сторона_Получить(мСторона, "Название");   
		
	ИначеЕсли   мСторона.Свойство("СвФЛ", СвФлЮл) Тогда 

		Идентификатор = МодульОбъектаКлиент().ПрименитьФорматКСтроке(СвФлЮл[КлючИдентификатора], "ЧГ=0", "Формат");
		Результат = Идентификатор + "_" + Сторона_Получить(мСторона, "Название"); ;   
		
	ИначеЕсли   мСторона.Свойство("СвИП", СвФлЮл) Тогда 
		
		Идентификатор = МодульОбъектаКлиент().ПрименитьФорматКСтроке(СвФлЮл[КлючИдентификатора], "ЧГ=0", "Формат");
		Результат = Идентификатор + "_" + Сторона_Получить(мСторона, "Название");  
		
	ИначеЕсли   мСторона.Свойство("СвИн", СвФлЮл) Тогда
		
		Идентификатор = МодульОбъектаКлиент().ПрименитьФорматКСтроке(СвФлЮл[КлючИдентификатора], "ЧГ=0", "Формат");
		Результат = Идентификатор + "_" + Сторона_Получить(мСторона, "Название"); 
		
	Иначе 
		
		Возврат мСторона.Название; 
		
	КонецЕсли;

	Если СвФлЮл.Свойство("КодФилиала") Тогда 
		
		Результат = Результат + "_" + СвФлЮл.КодФилиала; 
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

// Процедура - Сохраняет посчитанные дополнительные параметры стороны
//
// Параметры:
//  ДанныеУчастник		 - Структура	 - содержит СвЮл/СвФЛ
//  ДопПараметрыСтороны	 - Соответствие	 - данные, которые надо сохранить
//
&НаКлиенте
Процедура СохранитьДополнительныйПараметрСтороны(ДанныеУчастник, ПараметрКлюч, ПараметрЗначение) Экспорт
    Перем Результат;
	
	// Свойства сохранены на классе.
	Если Не ДанныеУчастник.Свойство("ДополнительныеДанные", Результат) Тогда
		
		// Спилить хранение в расчитанных значениях
		КлючДляДопПараметров = КлючСтороныДляДопПараметров(ДанныеУчастник);
		Если	Не ГлобальныйКэш.ТекущийСеанс.РасчитанныеЗначения.Свойство("мСторона", Результат) Тогда
			Возврат;
		КонецЕсли;

		Результат = Результат.Получить(КлючДляДопПараметров);
			
	КонецЕсли;
	
	Результат.Вставить(ПараметрКлюч, ПараметрЗначение);

КонецПроцедуры
// Процедура - Сохраняет посчитанные дополнительные параметры стороны
//
// Параметры:
//  ДанныеУчастник		 - Структура	 - содержит СвЮл/СвФЛ
//  ДопПараметрыСтороны	 - Соответствие	 - данные, которые надо сохранить
//
&НаКлиенте
Процедура СохранитьДополнительныеПараметрыСтороны(ДанныеУчастник, ДопПараметрыСтороны) Экспорт

	Если Не ДопПараметрыСтороны.Количество() Тогда
		Возврат;
	КонецЕсли;                                      
	
	КлючДляПараметров = КлючСтороныДляДопПараметров(ДанныеУчастник);
	ГлобальныйКэш.ТекущийСеанс.РасчитанныеЗначения.мСторона.Вставить(КлючДляПараметров, ДопПараметрыСтороны);	

КонецПроцедуры

// Процедура - Сохраняет посчитанные дополнительные параметры стороны
//
// Параметры:
//  ДанныеУчастник		 - Структура	 - содержит СвЮл/СвФЛ
//  ДопПараметрыСтороны	 - Соответствие	 - данные, которые надо сохранить
//
&НаКлиенте
Функция ПрочитатьДополнительныйПараметрСтороны(ДанныеУчастник, КлючПараметры=Неопределено)  Экспорт
    Перем Результат;
	
	// Свойства сохранены на классе.
	Если Не ДанныеУчастник.Свойство("ДополнительныеДанные", Результат) Тогда
		
		// Спилить хранение в расчитанных значениях
		КлючДляДопПараметров = КлючСтороныДляДопПараметров(ДанныеУчастник);
		Если	Не ГлобальныйКэш.ТекущийСеанс.РасчитанныеЗначения.Свойство("мСторона", Результат) Тогда
			Возврат Неопределено;
		КонецЕсли;

		Результат = Результат.Получить(КлючДляДопПараметров);
			
	КонецЕсли;
	Если Результат = Неопределено Тогда 
		Возврат Неопределено
	КонецЕсли;
	
	Если КлючПараметры = Неопределено Тогда 
		Возврат Результат;
	КонецЕсли;
	Возврат Результат.Получить(КлючПараметры);
	
КонецФункции

