
&НаКлиенте
Функция НовыйСторонаSABY(ДанныеСтороны) Экспорт
	
	// Пока конструктор как прослойка новый функционал-старый
	ФункцииДокументов = ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции");
	ДанныеСтороны.Вставить("РежимФормированияСтороны", "Полный");
	
	Результат = ФункцииДокументов.ПолучитьСторону(ПолучитьТекущийЛокальныйКэш(), ДанныеСтороны);
	
	Возврат Результат;
	
КонецФункции
	
&НаКлиенте
Функция СторонаSABY_Скопировать(ДанныеСтороны) Экспорт
	
	Возврат СоздатьКопиюОбъекта(ДанныеСтороны, Новый ФиксированнаяСтруктура("ГлубокаяКопия", Истина));
	
КонецФункции

// Функция ищет элемент справочника в базе 1С по данным участника в универсальном формате
//
// Параметры:
//  оУчастник	 - Структура	 - класс стороны
//  ДопПараметры - Струкутра	 - расширение поиска
//		ЗначениеПоУмолчанию - Значение, возвращяемое, если не найдена карточка
//		УзелИниПоиска	- 
//		ТипСтороны		-
//		Тип1С			-
// 
// Возвращаемое значение:
//  СправочникСсылка, Неопределено - Найденная ссылока, неопределено или значение поумолчанию
//
&НаКлиенте
Функция Сторона_НайтиКарточку1С(оУчастник, ДопПараметры) Экспорт

	Карточки1С = Сторона_НайтиКарточки1С(оУчастник, ДопПараметры);
	
	Если Карточки1С.Количество() Тогда
		Возврат Карточки1С[0];
	ИначеЕсли ДопПараметры.Свойство("ЗначениеПоУмолчанию") Тогда
		Возврат ДопПараметры.ЗначениеПоумолчанию;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - ищет элемент справочника в базе 1С по данным участника в универсальном формате
//
// Параметры:
//  оУчастник	 - Структура	 - класс стороны
//  ДопПараметры - Струкутра	 - расширение поиска
//		УзелИниПоиска	- узел мДокумент стороны на случай, если там есть отдельное описание поиска стороны для документа
//		ТипСтороны		- тип справочника, который нужно получить
//		КлючСтороны		- Контрагент/Организация - описываемый тип, в случае если по ТипСтороны нет описания поиска
//		ВыполнятьПоиск	- Булево - принудительное выполнение поиска, даже если в опциях отключено
// 
// Возвращаемое значение:
//  Массив - Список найденныхссылок
//
&НаКлиенте
Функция Сторона_НайтиКарточки1С(оУчастник, ДопПараметры) Экспорт

	Возврат Сторона_НайтиКарточки1СЗапросом(оУчастник, ДопПараметры);
	
КонецФункции

&НаКлиенте
Функция Сторона_НайтиКарточки1СЗапросом(оУчастник, ДопПараметры)
	Перем СвФлЮл, УзелИниПоиска, ТекстЗапроса, ТолькоПоИНН;

	Результат = Новый Массив;
	
	Если	Не	ТипЗнч(оУчастник) = Тип("Структура")
		Или		оУчастник = Неопределено Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	ТипСтороны					= ДопПараметры.ТипСтороны;
	ПараметрыПоискаРеквизиты	= ПолучитьЗначениеПараметраТекущегоСеанса("РеквизитыСторонДляПоиска");
	КлючРеквизитовСтороны		= ПараметрыПоискаРеквизиты.Синонимы.Получить(ТипСтороны);
	Если КлючРеквизитовСтороны = Неопределено Тогда
		
		// По типу нет реквизитов, должен быть ключ стороны 
		КлючРеквизитовСтороны = ДопПараметры.КлючСтороны;
		
	КонецЕсли;
	
	Если Не ПараметрыПоискаРеквизиты.Свойство(КлючРеквизитовСтороны, ПараметрыПоискаРеквизиты) Тогда
		
		ВызватьСбисИсключение(760, "МодульОбъектаКлиент.Сторона_НайтиКарточки1С",,, "Отсутствует описание стороны " + ТипСтороны + " в ини Конфигурация для поиска.");
		
	КонецЕсли;
	
	Если	Не (	ДопПараметры.Свойство("ВыполнятьПоиск")
			   И	ДопПараметры.ВыполнятьПоиск)
		И	ПараметрыПоискаРеквизиты.ПоискОтключен Тогда
		
		// Поиск не проводим. Используется только сопоставление сторон через Маппинг
		Возврат Результат;
		
	КонецЕсли;
	
	КлючЗапроса = ПараметрыПоискаРеквизиты.КлючЗапроса;
	
	Если Не ДопПараметры.Свойство("ТолькоПоИНН", ТолькоПоИНН) Тогда
		
		ТолькоПоИНН = ПараметрыПоискаРеквизиты.ПоискТолькоПоИНН;
		
	КонецЕсли;
	
	ПараметрыПостроенияЗапроса	= Новый Структура;
	СторонаДанные = СторонаSABY_Выгрузить(оУчастник);
	
	Если оУчастник.Свойство("СвФЛ", СвФлЮл) Тогда
		ТолькоПоИНН = Истина;                  
	КонецЕсли;   
	ПараметрыПостроенияЗапроса.Вставить("ИНН",					СторонаДанные.ИНН);
	ПараметрыПостроенияЗапроса.Вставить("КПП",					СторонаДанные.КПП);
	ПараметрыПостроенияЗапроса.Вставить("ИдентификаторЛица",	СторонаДанные.ИдентификаторЛица);
	
	// Определить текст запроса
	СтрокаФильтрКПП = "Участник." + ПараметрыПоискаРеквизиты.КПП + "=&КПП"; 
	Если	ДопПараметры.Свойство("УзелИниПоиска", УзелИниПоиска)
		И	УзелИниПоиска.Свойство("Запрос" + КлючЗапроса) Тогда
		
		// В ини на поиск есть свой запрос для соответствующей стороны
		ТекстЗапроса = ГлобальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.РассчитатьЗначение("Запрос" + КлючЗапроса, УзелИниПоиска);
		
	Иначе
		
		// Предустановленный запрос в ини конфигурации
		ПараметрыПоискаРеквизиты.Свойство("Запрос", ТекстЗапроса);
		
	КонецЕсли;
	
	Если ТекстЗапроса = Неопределено Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Участник.Ссылка
		|ИЗ
		|	Справочник." + ПараметрыПоискаРеквизиты.Тип + " КАК Участник
		|ГДЕ
		|	НЕ Участник.ПометкаУдаления 
		|	И Участник." + ПараметрыПоискаРеквизиты.ИНН + "=&ИНН
		|	И " + СтрокаФильтрКПП;
		
	КонецЕсли;
	
	ДопПараметрыДляПоиска = Новый Структура;
	//Убрать из текста запроса у равенства пробелы для корректной замены условий.
	ТекстЗапроса = СтрЗаменить(СтрЗаменить(ТекстЗапроса,
								" =", "="),
								"= ", "=");
	
	Если ТолькоПоИНН Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрокаФильтрКПП, "ИСТИНА");
		
	КонецЕсли;
	
	//Подразделение, если есть
	Если	оУчастник.Свойство("Подразделение") 
		И	оУчастник.Подразделение.Свойство("Идентификатор") Тогда
		
		ПараметрыПостроенияЗапроса.Вставить("КодФилиала", оУчастник.Подразделение.Идентификатор);
		
	Иначе
		
		ПараметрыПостроенияЗапроса.Вставить("КодФилиала", "");
		
	КонецЕсли;
	
	//GLN, если есть
	Если	оУчастник.Свойство("GLN") Тогда
		
		ПараметрыПостроенияЗапроса.Вставить("GLN",	оУчастник.GLN);
		
		Если СведенияОбУстановленныхРасширениях("КонтурEDI") 
			И ПараметрSABY("ИскатьВДополнительныхИсточниках") Тогда
			// Поиск по данным Контура проводить только если есть GLN стороны
			ТекстЗапроса = ТекстЗапроса + "
						|
						|ОБЪЕДИНИТЬ
						|
						|  ВЫБРАТЬ
						|	КонтурEDI_ДополнительныеРеквизиты.Объект КАК Ссылка
						|ИЗ
						|	РегистрСведений.КонтурEDI_ДополнительныеРеквизиты КАК КонтурEDI_ДополнительныеРеквизиты
						|ГДЕ
						|	(КонтурEDI_ДополнительныеРеквизиты.Свойство = ""GLN_" + КлючЗапроса + """)
						|	И КонтурEDI_ДополнительныеРеквизиты.Значение = &GLN";
						
		КонецЕсли;
		
	Иначе
		
		ПараметрыПостроенияЗапроса.Вставить("GLN",	"");
		
	КонецЕсли;
	
	//Пользовательские органичения
	Если оУчастник.Свойство("Ограничения") Тогда
		
		Для Каждого Параметр Из оУчастник.Ограничения Цикл
			
			ПараметрыПостроенияЗапроса.Вставить(Параметр.Ключ, Параметр.Значение);
			
		КонецЦикла;	
		
	КонецЕсли;
	
	РезультатПоиска = Сторона_НайтиКарточки1СЗапросомСервер(ТекстЗапроса, ПараметрыПостроенияЗапроса, ДопПараметрыДляПоиска);
	РезультатИтог	= Новый Массив;
	
	Для Каждого РезультатСтрока Из РезультатПоиска Цикл 
		Если ТипЗнч(РезультатСтрока) = Тип("Структура") Тогда
			РезультатИтог.Добавить(РезультатСтрока.Ссылка);
		Иначе
			РезультатИтог.Добавить(РезультатСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатИтог;
	
КонецФункции

&НаСервере
Функция Сторона_НайтиКарточки1СЗапросомСервер(ТекстЗапроса, ПараметрыЗапроса, ДопПараметры)
	
	Возврат МодульОбъектаСервер().ВыполнитьЗапросСПараметрами(ТекстЗапроса, ПараметрыЗапроса);
	
КонецФункции

//Функция возвращает ключ стороны для получения доп. параметров в кэше
&НаКлиенте
Функция	 КлючСтороныДляДопПараметров(мСторона)
	
	Перем СвФлЮл; 
	
	КлючИдентификатора = МодульОбъектаКлиент().Сторона_Получить(мСторона, "КлючИдентификатора");
	
	Если		мСторона.Свойство("СвЮЛ", СвФлЮл) Тогда   
		
		Идентификатор = МодульОбъектаКлиент().ПрименитьФорматКСтроке(СвФлЮл[КлючИдентификатора], "ЧГ=0", "Формат");
		Результат = Идентификатор + ?(СвФлЮл.Свойство("КПП"), "_" + СвФлЮл.КПП, "") + "_" + Сторона_Получить(мСторона, "Название");   
		
	ИначеЕсли   мСторона.Свойство("СвФЛ", СвФлЮл) Тогда 

		Идентификатор = МодульОбъектаКлиент().ПрименитьФорматКСтроке(СвФлЮл[КлючИдентификатора], "ЧГ=0", "Формат");
		Результат = Идентификатор + "_" + Сторона_Получить(мСторона, "Название"); ;   
		
	ИначеЕсли   мСторона.Свойство("СвИП", СвФлЮл) Тогда 
		
		Идентификатор = МодульОбъектаКлиент().ПрименитьФорматКСтроке(СвФлЮл[КлючИдентификатора], "ЧГ=0", "Формат");
		Результат = Идентификатор + "_" + Сторона_Получить(мСторона, "Название");  
		
	ИначеЕсли   мСторона.Свойство("СвИн", СвФлЮл) Тогда
		
		Идентификатор = МодульОбъектаКлиент().ПрименитьФорматКСтроке(СвФлЮл[КлючИдентификатора], "ЧГ=0", "Формат");
		Результат = Идентификатор + "_" + Сторона_Получить(мСторона, "Название"); 
		
	Иначе 
		
		Возврат мСторона.Название; 
		
	КонецЕсли;

	Если СвФлЮл.Свойство("КодФилиала") Тогда 
		
		Результат = Результат + "_" + СвФлЮл.КодФилиала; 
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

// Процедура - Сохраняет посчитанные дополнительные параметры стороны
//
// Параметры:
//  ДанныеУчастник		 - Структура	 - содержит СвЮл/СвФЛ
//  ДопПараметрыСтороны	 - Соответствие	 - данные, которые надо сохранить
//
&НаКлиенте
Процедура СохранитьДополнительныйПараметрСтороны(ДанныеУчастник, ПараметрКлюч, ПараметрЗначение) Экспорт
    Перем Результат;
	
	Если ЭтоТипСбис(ДанныеУчастник, "СторонаSABY") Тогда
		
		СторонаSABY_Установить(ДанныеУчастник, ПараметрКлюч, ПараметрЗначение);
		Возврат;
		
	КонецЕсли;

	// TODO 3100 спилить хранение свойств в рассчитанных значениях.
	Если Не ДанныеУчастник.Свойство("ДополнительныеДанные", Результат) Тогда
		
		// Спилить хранение в расчитанных значениях
		ОписаниеКэшируемогоЗначения = Новый Структура("Тип, Ключ", "РассчитанныеЗначения.мСторона", КлючСтороныДляДопПараметров(ДанныеУчастник)); 
		Результат = ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции").СбисПолучитьЗначениеРассчитанногоОбъекта(ПолучитьТекущийЛокальныйКэш(), ОписаниеКэшируемогоЗначения);
		
		Если Результат = Неопределено Тогда
			
			Возврат;
			
		КонецЕсли;

	КонецЕсли;
	
	Если ПараметрКлюч = "ДополнительныеДанные" Тогда
		
		Для Каждого КлючИНачениеПараметр Из ПараметрЗначение Цикл
			
			Результат.Вставить(КлючИНачениеПараметр.Ключ, КлючИНачениеПараметр.Значение);
			
		КонецЦикла;
		
	Иначе
		
		Результат.Вставить(ПараметрКлюч, ПараметрЗначение);
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - Сохраняет посчитанные дополнительные параметры стороны
//
// Параметры:
//  ДанныеУчастник		 - Структура	 - содержит СвЮл/СвФЛ
//  ДопПараметрыСтороны	 - Соответствие	 - данные, которые надо сохранить
//
&НаКлиенте
Функция ПрочитатьДополнительныйПараметрСтороны(ДанныеУчастник, КлючПараметры=Неопределено)  Экспорт
    Перем Результат;
	
	Если ЭтоТипСбис(ДанныеУчастник, "СторонаSABY") Тогда
		
		Если КлючПараметры = Неопределено Тогда
		
			Возврат СторонаSABY_Получить(ДанныеУчастник, "ДополнительныеДанные");

		Иначе

			Возврат СторонаSABY_Получить(ДанныеУчастник, КлючПараметры);

		КонецЕсли;
		
	ИначеЕсли Не ДанныеУчастник.Свойство("ДополнительныеДанные", Результат) Тогда
		
		// TODO 3100. Спилить хранение в расчитанных значениях
		КлючДляДопПараметров = КлючСтороныДляДопПараметров(ДанныеУчастник);
		
		Результат = ГлобальныйКэш.ТекущийСеанс.РасчитанныеЗначения.Получить("мСторона");
		Если Результат = Неопределено Тогда
			
			Возврат Неопределено;
			
		КонецЕсли;

		Результат = Результат.Получить(КлючДляДопПараметров);
			
	КонецЕсли;
	
	Если	Результат		= Неопределено
		Или	КлючПараметры	= Неопределено Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Возврат Результат.Получить(КлючПараметры);
	
КонецФункции

