
// Функция - формирует объект для получения ГрязнойИни
//
// Параметры:
//  ПараметрыГенерации	 - Неопределено - Пока не используется. Расширение объекта
// 
// Возвращаемое значение:
//  ЧтениеИниПоДанным1С - Объект для настройки чтения ини на сервере.
//
&НаКлиенте
Функция НовыйЧтениеИниПоДанным1С(ПараметрыГенерации = Неопределено) Экспорт 
	
	Результат = НовыйПрикладнойОбъектSABY("ЧтениеИниПоДанным1С");
	Результат.Вставить("Статистика",		Новый Структура);
	
	Результат.Статистика.Вставить("ВремяСоздания",	ТекущаяДата());
	Результат.Статистика.Вставить("ВремяНачало");
	Результат.Статистика.Вставить("ВремяЧтенияИни");
	Результат.Статистика.Вставить("ВремяКонец");

	ПрикладнойОбъектSABY_Установить(Результат, "Ошибки",				Новый Массив,			"Данные");
	ПрикладнойОбъектSABY_Установить(Результат, "ПодготовленРасчет",		Новый Соответствие,		"Данные"); 
	// Список для сохранения очередности установки объектов для чтения
	ПрикладнойОбъектSABY_Установить(Результат, "СписокОбъектовЧтения",	Новый СписокЗначений,	"Данные");
	
	Возврат Результат;
	
КонецФункции

// Процедура - set
//
// Параметры:
//  ЧтениеИниПоДанным1С	 - ЧтениеИниПоДанным1С								 - текущий объект
//  КлючВставить		 - Строка											 - ключ того, что вставляем
//  ЗначениеВставить	 - Произвольный										 - что вставляем
//  ДопПараметры		 - Неопределено, ДокументСсылка, СправочникСсылка	 - расширение
// 
&НаКлиенте
Процедура ЧтениеИниПоДанным1С_Вставить(ЧтениеИниПоДанным1С, КлючВставить, ЗначениеВставить, ДопПараметры = Неопределено) Экспорт
	
	ПодготовленРасчет		= ЧтениеИниПоДанным1С_Получить(ЧтениеИниПоДанным1С, "ПодготовленРасчет");
	СписокОбъектовЧтения	= ЧтениеИниПоДанным1С_Получить(ЧтениеИниПоДанным1С, "СписокОбъектовЧтения");
		
	Если КлючВставить = "ОбъектРассчитать" Тогда

		Документ = ЗначениеВставить.Объект; 
		
		Если ТипЗнч(ЗначениеВставить.Ини) = Тип("Строка") Тогда
			
			ИмяИниДокумента	= ЗначениеВставить.Ини;
			ИниДокумента	= ИниПоПараметрам(ИмяИниДокумента);
			
		Иначе
			
			ИмяИниДокумента	= Неопределено;
			ИниДокумента	= ЗначениеВставить.Ини;

		КонецЕсли;
		
		Если ИниДокумента = Неопределено Тогда
			
			// Если нет инишки для одного из документов пакета, то весь пакет не формируем
			СтруктураОшибки	= НовыйСбисИсключение(, МодульОбъектаКлиентСервер_Представление() + "ЧтениеИниПоДанным1С.Вставить",
													610,
													,
													"Отсутствует настройка " + ИниДокумента + " для формирования документа " + Документ);
													
			ВызватьИсключение СбисИсключение_ВСтроку(СтруктураОшибки);

		Иначе
			
			// Заполнить отдельно форматные файлы, в болванку как представление пойдет подобранная ини
			СписокОбъектовЧтения.Добавить		(Документ, ИмяИниДокумента);
			ПодготовленРасчет.Вставить			(Документ, ИниДокумента);
			
		КонецЕсли;
		
	ИначеЕсли КлючВставить = "Ошибка" Тогда
		
		СписокОшибок	= ЧтениеИниПоДанным1С_Получить(ЧтениеИниПоДанным1С, "Ошибки");
		ОснованиеОшибки = ДопПараметры;
		СписокОшибок.Добавить(Новый Структура("Основание, Ошибка", ОснованиеОшибки, ЗначениеВставить))
		
	Иначе
		
		ПрикладнойОбъектSABY_Установить(ЧтениеИниПоДанным1С, КлючВставить, ЗначениеВставить);
		
	КонецЕсли;
	
КонецПроцедуры

// Функция - get
//
// Параметры:
//  ЧтениеИниПоДанным1С	 - ЧтениеИниПоДанным1С								 - текущий объект
//  КлючПолучить		 - Строка											 - ключ того, что получаем
// 
// Возвращаемое значение:
//  Произвольный - значение по ключу
//
&НаКлиенте
Функция ЧтениеИниПоДанным1С_Получить(ЧтениеИниПоДанным1С, КлючПолучить) Экспорт
	Перем Результат;
	
	КлючТестПолучить = НРег(КлючПолучить);
	Если КлючТестПолучить = "чтениенасервере" Тогда
		
		Возврат яЧтениеИниПоДанным1С_СоответствиеДанных(ЧтениеИниПоДанным1С);
		
	КонецЕсли;
	
	Результат = ПрикладнойОбъектSABY_Получить(ЧтениеИниПоДанным1С, КлючПолучить, "Данные");
	Если Результат = Неопределено Тогда
		
		Результат = ПрикладнойОбъектSABY_Получить(ЧтениеИниПоДанным1С, КлючПолучить);

	КонецЕсли;
	Возврат Результат;
	
КонецФункции

// Функция - read
//
// Параметры:
//  ЧтениеИниПоДанным1С	 - ЧтениеИниПоДанным1С		 - текущий объект
//  КэшЗначенийИни		 - Неопределено, Структура	 - свойство для кэширования расчета
// 
// Возвращаемое значение:
//  Соответствие - прочитанные данные, где ключ - ид объекта + ини, которым он читался, а значение - грязный ини.
//
&НаКлиенте
Функция ЧтениеИниПоДанным1С_Прочитать(ЧтениеИниПоДанным1С, КэшЗначенийИни = Неопределено) Экспорт
	Перем СтруктураОшибки;
	
	ПараметрыДляИни			= ГлобальныйКэш_Получить("ПараметрыПользователя");
	МодульФункций			= ПараметрSABY("ФункцииДокументов", "Сеанс");
	лОтладкаВключена		= ПараметрSABY("РежимОтладки");
	СписокОбъектовЧтения	= ЧтениеИниПоДанным1С_Получить(ЧтениеИниПоДанным1С, "СписокОбъектовЧтения");
	
	Если КэшЗначенийИни = Неопределено Тогда
		
		КэшЗначенийИни = Новый Структура;
		
	КонецЕсли;
	
	Если лОтладкаВключена Тогда												
		
		лОтладочныеДанные = Новый Структура("Время, Тип, Вызов, Сообщение, Идентификатор, Модуль", ТекущаяДата());
		лОтладочныеДанные.Тип			= "DIRTY_DATA";
		лОтладочныеДанные.Вызов			= "Прочитать";
		лОтладочныеДанные.Модуль		= МодульОбъектаКлиентСервер_Представление() + "ЧтениеИниПоДанным1С";
		лОтладочныеДанные.Идентификатор	= ЧтениеИниПоДанным1С_Получить(ЧтениеИниПоДанным1С, "Идентификатор");
		
	КонецЕсли;

	Попытка

		ЧтениеИниПоДанным1С.Статистика.Вставить("ВремяНачало",	ПолучитьДатуВМиллисекундах());
		
		СоответствиеДанные	= яЧтениеИниПоДанным1С_СоответствиеДанных(ЧтениеИниПоДанным1С);
	
		// получаем на сервере все данные по документам пакета по файлам настроек
		МодульФункций.ПолучитьДанныеДокументов1С(	СоответствиеДанные,
													КэшЗначенийИни,
													СписокОбъектовЧтения,
													ПараметрыДляИни);
													
		Если лОтладкаВключена Тогда												
			
			лОтладочныеДанные.Сообщение = СоответствиеДанные;
			
		КонецЕсли;
		
	Исключение
		
		
		СтруктураОшибки	= NewExtException(ИнформацияОбОшибке(), "РаботаСДокументами1С.ПодготовитьСтруктуруДокумента1С");
												
		Если лОтладкаВключена Тогда
			
			лОтладочныеДанные.Сообщение = СтруктураОшибки;
			лОтладочныеДанные.Тип		= "ERROR_DATA";

		КонецЕсли;
		
	КонецПопытки;
	
	ЧтениеИниПоДанным1С.Статистика.Вставить("ВремяКонец", ПолучитьДатуВМиллисекундах());
	ЧтениеИниПоДанным1С.Статистика.ВремяЧтенияИни = ЧтениеИниПоДанным1С.Статистика.ВремяКонец - ЧтениеИниПоДанным1С.Статистика.ВремяНачало;

	Если лОтладкаВключена Тогда
		
		ДанныеВЛог = Новый Массив;
		ДанныеВЛог.Добавить(лОтладочныеДанные);
		
		СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ДанныеВЛог));
		
	КонецЕсли;
		
	Если СтруктураОшибки = Неопределено Тогда
		
		Возврат СоответствиеДанные;
		
	Иначе
		
		ВызватьИсключение ExtException_Dump(СтруктураОшибки);										
		
	КонецЕсли;
				
КонецФункции

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_ЧтениеИниПоДанным1С_private
#КонецОбласти

