
&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыОткрытия)
	Перем ТипДействия, Заголовок;

	Если НЕ ПараметрыОткрытия.Свойство("ТипДействия", ТипДействия) Тогда
		ТипДействия = "ДействиеЭтапа";
	КонецЕсли;

	ПараметрыОткрытия.Свойство("Заголовок", Заголовок);
	ЭтаФорма.Заголовок = Заголовок;
	
	ЭлементыДействия = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ЭлементыДействия");
	ЭлементыДействия.ТекущаяСтраница = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭлементыДействия, ТипДействия);
	
	Если ТипДействия = "ДействиеЭтапа" Тогда
		СбисУстановитьФорму_ДействиеЭтапа(ПараметрыОткрытия);
	ИначеЕсли ТипДействия = "ДействиеИсключения" Тогда
		СбисУстановитьФорму_ДействиеИсключения(ПараметрыОткрытия);
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СбисУстановитьФорму_ДействиеЭтапа(ПараметрыОткрытия)

	
	
КонецПроцедуры

&НаКлиенте
Процедура СбисУстановитьФорму_ДействиеИсключения(ПараметрыОткрытия)
	Перем ОснованиеЗапроса, ПереченьДействий;
	
	Если ПараметрыОткрытия.Свойство("ОснованиеЗапроса", ОснованиеЗапроса)
		И МодульОбъектаКлиент().ЭтоТипСбис(ОснованиеЗапроса, "СбисИсключение") Тогда
		ОписаниеИсключения = МодульОбъектаКлиент().СбисИсключение_Представление(ОснованиеЗапроса, "Сообщение");
	КонецЕсли;
	
	Если НЕ ПараметрыОткрытия.Свойство("Действия", ПереченьДействий) Тогда
		ПереченьДействий = Новый Массив;
	КонецЕсли;
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДляВсехДокументов").Видимость = ПараметрыОткрытия.НесколькоПакетов;
	
	Переходы.Очистить();
	
	Для каждого ПользовательскоеДействие Из ПереченьДействий Цикл
		Переходы.Добавить(ПользовательскоеДействие, ПользовательскоеДействие.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРезультаПередЗакрытием(АргументЗакрытия)
	
	Если МодульОбъектаКлиент().ЭтоТипСбис(АргументЗакрытия, "ПользовательскоеДействие") Тогда
	
		АргументЗакрытия.Параметры.Вставить("ПрименитьДляВсехДокументов", ДляВсехДокументов);
	
	КонецЕсли;
	
КонецПроцедуры

