
&НаКлиенте
Функция СтруктураИни_СписокДокументовДляПечатныхФорм(СтруктураИни)

	ОбщиеФункции = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции");
	
	СписокДокументов = Новый СписокЗначений;
	Для Каждого Элемент Из СтруктураИни Цикл
		Если	Не (	Элемент.Значение.Свойство("ЗапросСпискаДокументов")
					И	Элемент.Значение.Свойство("Реестр1С_Тип")) Тогда
					
			Продолжить;
			
		КонецЕсли;
		
		Реестр1С_Тип	= ОбщиеФункции.РассчитатьЗначение("Реестр1С_Тип", Новый Структура("Ини", Элемент.Значение));
		МассивТипов		= МодульОбъектаКлиент().СбисРазложитьСтрокуВМассивПодстрок(Реестр1С_Тип);
		
		Для Каждого Тип Из МассивТипов Цикл
			
			Если СписокДокументов.НайтиПоЗначению(Тип) = Неопределено Тогда
				
				СписокДокументов.Добавить(Тип);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

	Возврат СписокДокументов;

КонецФункции

&НаСервере
Функция ДобавитьКомандыПечатиНаФормыНаСервере(КомандыПечатиДобавить) Экспорт
	
	МодульОбъектаСервер().ЗарегистрироватьПечатнуюФормуНаСервере(КомандыПечатиДобавить);
	
КонецФункции
	
