
&НаКлиенте                                  
Функция		УстановитьИниРазделов(Кэш, сбисСтруктураРазделов, сбисДополнительныеПараметры = Неопределено, Отказ) Экспорт
	
	//Формируем кэш сбис для сопоставления документов
	КэшСБИС = Неопределено;
	Если Не Кэш.Свойство("СБИС", КэшСБИС) Тогда
		Возврат Ложь;
	КонецЕсли;
	СтруктураРазделовАккордеона = УстановитьИниРазделов_СтрукутраАккордеона(Кэш);
	сбисСоответствиеНомеровНастраиваемыхРазделов = Новый Структура("Продажа, Покупка, Справочники, Отчетность", "3", "4", "6", "9");
	ДопПараметрыФильтра = Новый Структура("РасставитьЭлементы, ДобавитьНадписи, ОбновитьЭлементы", Ложь, Ложь, Ложь);
	Для Каждого Раздел Из сбисСтруктураРазделов Цикл
		сбисНомерРаздела = Неопределено;
		Если сбисСоответствиеНомеровНастраиваемыхРазделов.Свойство(Раздел.Ключ, сбисНомерРаздела) Тогда
			Если Не Раздел.Значение.Свойство("Параметры") Тогда
				Раздел.Значение.Вставить("Параметры", Новый Структура);
			КонецЕсли;
			Раздел.Значение.Параметры.Вставить("Номер", сбисНомерРаздела);
			СтруктураРазделаЗаготовка = ?(СтруктураРазделовАккордеона.Свойство(Раздел.Ключ), СтруктураРазделовАккордеона[Раздел.Ключ], Новый Структура());
			СтруктураРазделовАккордеона.Вставить(Раздел.Ключ, РазделЗаполнить(Кэш, Раздел.Ключ, Раздел.Значение, СтруктураРазделаЗаготовка));
		КонецЕсли;
		Для Каждого ПодРаздел Из Раздел.Значение.Список Цикл
			
			//Заполняем пользовательские фильтры
			Если	Не	ПодРаздел.Значение.Свойство("ЕстьЗапросРеестра")
				Или	Не	ПодРаздел.Значение.ЕстьЗапросРеестра Тогда
				
				Продолжить;
				
			КонецЕсли;
			ФормаДопФильтра = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("сбисСписокДопПараметровФильтра", 
																	"Фильтр_Раздел_" + Раздел.Ключ + "_" + ПодРаздел.Ключ, 
																	"Фильтр_Раздел_" + Раздел.Ключ + "_Шаблон");
			Если ФормаДопФильтра = Ложь Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				
				// Для прохождения протокола ошибок потребуется добавить элементы на ОФ, чтобы собрался фильтр.
				ДобавитьДополнительныеПараметрыФильтра(Кэш, ФормаДопФильтра, ДопПараметрыФильтра);
				
			#КонецЕсли
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Тут готовим только структуру аккордеона, т.к. надо ещё спозиционировать аккордеон на нужный раздел в момент открытия, либо обновления
	Кэш.ГлавноеОкно.Аккордеон = СтруктураРазделовАккордеона;
	
КонецФункции

&НаКлиенте                                  
Функция	УстановитьИниРазделов_СтрукутраАккордеона(Кэш)
	СтруктураРазделовxml = МодульОбъектаКлиент().ПолучитьМакетОбработки("СтруктураАккордеона", Новый Структура("Текст", Истина));
	СтруктураРазделов = Кэш.ГлавноеОкно.DecodeXmlXdto(СтруктураРазделовxml);                                   
	Возврат СтруктураРазделов;	
КонецФункции

