
&НаКлиенте
Функция УстановитьИниДопСведений(Кэш, ДополнительныеСведения, Отказ)
	
	Попытка            
		ДопПараметры = Новый Структура("ГлубокаяКопия", Истина);
		НаборСвойств = МодульОбъектаКлиент().СоздатьКопиюОбъекта(ДополнительныеСведения.НаборСвойств, ДопПараметры);
	Исключение
		Возврат Истина;
	КонецПопытки;
	
	РассчитанныйНаборСвойств = ПолучитьРассчитанныеДанные(НаборСвойств, Отказ);
	
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.СбисИсключение(РассчитанныйНаборСвойств, "ФормаНастроекОбщее.УстановитьИниДопСведений");
	КонецЕсли;
	
	МассивСоздаватьАвтоматически = ПолучитьМассивСоздаватьАвтоматически(Кэш, РассчитанныйНаборСвойств);
	
	Если МассивСоздаватьАвтоматически.Количество() = 0 Тогда
		Возврат Истина;	
	КонецЕсли;
	
	фрм = Кэш.ГлавноеОкно.СбисНайтиФормуФункции("СоздатьНаборСвойствПоМассиву", "Документ_Шаблон");
	Если фрм = Ложь Тогда
		Возврат Истина;
	КонецЕсли;
	
	ИниКонфигурация = ПолучитьИниКонфигурацияДляДополнительныхСведений(Кэш, Отказ);
	Результат = фрм.СоздатьНаборСвойствПоМассиву(РассчитанныйНаборСвойств, МассивСоздаватьАвтоматически, ИниКонфигурация, Отказ);
	
	Если Отказ Тогда
		Возврат Результат;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

&НаКлиенте
Функция ПолучитьИниКонфигурацияДляДополнительныхСведений(Кэш, Отказ) Экспорт
	
	ИниКонфигурация = МодульОбъектаКлиент().ИниПоПараметрам("Конфигурация");
	
	ИмяПланаВидовХарактеристикСвойствОбъектов = Неопределено;
	ИниКонфигурация.Свойство("ИмяПланаВидовХарактеристикСвойствОбъектов", ИмяПланаВидовХарактеристикСвойствОбъектов);
	
	ИмяНаборыДополнительныхРеквизитовИСведений = Неопределено;
	ИниКонфигурация.Свойство("ИмяНаборыДополнительныхРеквизитовИСведений", ИмяНаборыДополнительныхРеквизитовИСведений);
	
	ИмяЗначенияСвойствОбъектов = Неопределено;
	ИниКонфигурация.Свойство("ИмяЗначенияСвойствОбъектов", ИмяЗначенияСвойствОбъектов);
	
	ИниКонфигурация = Новый Структура();
	ИниКонфигурация.Вставить("ИмяПланаВидовХарактеристикСвойствОбъектов", 	ИмяПланаВидовХарактеристикСвойствОбъектов);
	ИниКонфигурация.Вставить("ИмяНаборыДополнительныхРеквизитовИСведений", 	ИмяНаборыДополнительныхРеквизитовИСведений);
	ИниКонфигурация.Вставить("ИмяЗначенияСвойствОбъектов", 					ИмяЗначенияСвойствОбъектов);
	
	Возврат ИниКонфигурация;
	
КонецФункции

&НаКлиенте
Функция ПолучитьМассивСоздаватьАвтоматически(Кэш, СтруктураРасчитанныйНабор)
	
	МассивДопСведений = Новый Массив;
	
	Для Каждого ТекСтрока ИЗ СтруктураРасчитанныйНабор Цикл
		
		Если НЕ ТекСтрока.Значение.Свойство("СоздаватьАвтоматически") 
			ИЛИ ТекСтрока.Значение.СоздаватьАвтоматически = Ложь Тогда
			Продолжить;	
		КонецЕсли;
		
		Для Каждого ТекСвойство ИЗ ТекСтрока.Значение.мФайл Цикл
			МассивДопСведений.Добавить(Новый Структура("ИмяНабора, ИмяСвойства", ТекСтрока.Ключ, ТекСвойство.Ключ));
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат МассивДопСведений;
	
КонецФункции

&НаСервере
Функция ПолучитьРассчитанныеДанные(Знач НаборСвойств, Отказ) Экспорт
	
	РассчитанныйНаборСвойств = Новый Структура();
	
	Попытка
		ПолучитьРассчитанныеДанныеНаСервере(НаборСвойств, РассчитанныйНаборСвойств, "", "", Истина);
	Исключение
		Отказ = Истина;
		Возврат ОписаниеОшибки();
	КонецПопытки;
	
	Возврат РассчитанныйНаборСвойств;
	
КонецФункции

&НаСервере
Процедура ПолучитьРассчитанныеДанныеНаСервере(Данные, РассчитанныеДанные, ТекУзел, Родитель, Добавить)
	
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		
		Если Данные.Свойство("Значение") Тогда
			
			Если Данные.Свойство("Тип") Тогда
				РассчитанныеДанные = ПолучитьРассчитанноеЗначениеПоТипу(Данные.Значение, Данные.Тип);
				
				Если РассчитанныеДанные <> Неопределено Тогда
					Данные.Вставить("РассчитанноеЗначение", РассчитанныеДанные);
					Добавить = Истина;
				КонецЕсли;
			ИначеЕсли Лев(Данные.Значение, 1) = "'"Тогда
				РассчитанныеДанные = ПолучитьРассчитанноеЗначениеПоТипу(Данные.Значение);
				
				Если РассчитанныеДанные <> Неопределено Тогда
					Данные.Вставить("РассчитанноеЗначение", РассчитанныеДанные);
					Добавить = Истина;
				КонецЕсли;
			ИначеЕсли Лев(Данные.Значение, 1) = "[" Тогда
				РассчитанныеДанные = ПолучитьРассчитанноеЗначениеПоРодителю(Данные, Родитель);
				
				Если РассчитанныеДанные <> Неопределено Тогда
					Данные.Вставить("РассчитанноеЗначение", РассчитанныеДанные);
					Добавить = Истина;
				КонецЕсли;
			ИначеЕсли Данные.Свойство("Отбор") Тогда     
				 РассчитанныеДанные = ПолучитьРассчитанноеЗначениеПоОтбору(Данные);
				
				Если РассчитанныеДанные <> Неопределено Тогда
					Данные.Вставить("РассчитанноеЗначение", РассчитанныеДанные);  	
				КонецЕсли;	
			Иначе				
				РассчитанныеДанные = ПолучитьРассчитанноеЗначениеПоМенеджеру(Данные, Добавить);
				
				Если РассчитанныеДанные <> Неопределено Тогда
					Данные.Вставить("РассчитанноеЗначение", РассчитанныеДанные);
				КонецЕсли;
				
			КонецЕсли;
			
			Возврат;
			
		КонецЕсли;
		
		Для Каждого ТекДанные ИЗ Данные Цикл
			ПолучитьРассчитанныеДанныеНаСервере(ТекДанные, РассчитанныеДанные, Данные[ТекДанные.Ключ], ТекУзел, Истина);
		КонецЦикла;
	
	ИначеЕсли ТипЗнч(Данные) = Тип("КлючИЗначение") Тогда
		Добавить = Истина;
		РассчитанныеДанные.Вставить(Данные.Ключ, Новый Структура());
    	ПолучитьРассчитанныеДанныеНаСервере(Данные.Значение, РассчитанныеДанные[Данные.Ключ], ТекУзел, Родитель, Добавить);
		
		Если НЕ Добавить Тогда
			РассчитанныеДанные.Удалить(Данные.Ключ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРассчитанноеЗначениеПоТипу(Знач Значение, Тип = "Строка")
	
	Значение = СтрЗаменить(Значение, "'", "");      
	Разделитель = "|";
	
	Попытка 
		Если Тип = "Строка" Тогда
			Возврат Строка(Значение);	
		КонецЕсли;
		
		Если Тип = "Булево" Тогда
			Возврат Булево(Значение);	
		КонецЕсли;
		
		Если Тип = "Число" Тогда
			Возврат Число(Значение);	
		КонецЕсли;
		
		Если Тип = "Дата" Тогда
			Возврат Дата(Значение);	
		КонецЕсли;
		
		Если Тип = "ОписаниеТипов" Тогда
			Возврат СбисПолучитьОписаниеТипов(Значение, Разделитель);
		КонецЕсли;
		
		Если Тип = "Массив" Тогда
			Возврат СбисПолучитьМассивИзСтроки(Значение, Разделитель);
		КонецЕсли;
		
		Возврат Неопределено;
		
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;	
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРассчитанноеЗначениеПоРодителю(ТекЗначение, Родитель)
	
	ЗакрывающаяСкобка = Найти(ТекЗначение.Значение, "]");
	Источник = Сред(ТекЗначение.Значение, 2, ЗакрывающаяСкобка - 2);
	Реквизит = Сред(ТекЗначение.Значение, ЗакрывающаяСкобка + 2);
	
	Попытка 
		Возврат Родитель[Источник]["РассчитанноеЗначение"][Реквизит];
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ПолучитьРассчитанноеЗначениеПоОтбору(ТекЗначение)    
	Попытка
		ЗнПер = ТекЗначение.Значение;
		
		ПозицияТочки = Найти(ЗнПер, ".");
		Если ПозицияТочки = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ПредставлениеТипа = МодульОбъектаСервер().ПолучитьПредставлениеТипа(ЗнПер);
		
		ТипКоллекцииВЗапросе = СтрЗаменить(ПредставлениеТипа, "Ссылка", "");
		
		Отбор = Новый Структура;
		Для Каждого Элемент Из ТекЗначение.Отбор Цикл
			Отбор.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
		
		Если Не Отбор.Количество() Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|ОбъектДанных.Ссылка
		|ИЗ
		|   " + ТипКоллекцииВЗапросе + " КАК ОбъектДанных
		|ГДЕ
		| ";
		Для Каждого Элемент Из Отбор Цикл
			ЗначениеЭлемента = Элемент.Значение;
			Если ТипЗнч(ЗначениеЭлемента) = Тип("Строка") Тогда
				ЗначениеЭлемента = СтрЗаменить(ЗначениеЭлемента, "'", "");	
			КонецЕсли;
			Запрос.УстановитьПараметр(Элемент.Ключ, ЗначениеЭлемента);
			Запрос.Текст = Запрос.Текст + "ОбъектДанных." + Элемент.Ключ + "=&" + Элемент.Ключ + " И ";
		КонецЦикла;
		Запрос.Текст = Запрос.Текст + "НЕ ОбъектДанных.ПометкаУдаления";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРассчитанноеЗначениеПоМенеджеру(ТекЗначение, Добавить)
	
	Значение = СтрЗаменить(ТекЗначение.Значение, "'", ""); 
	МассивЗначений = СбисПолучитьМассивИзСтроки(Значение, ".");
	
	Попытка
		
		Если МассивЗначений.Количество() = 1 Тогда
			Возврат Неопределено;	
		ИначеЕсли МассивЗначений.Количество() = 2 Тогда 
			Добавить = Ложь;
			Возврат  Новый (МассивЗначений[0] + "Менеджер." + МассивЗначений[1]);
		ИначеЕсли МассивЗначений.Количество() = 3 Тогда
			Добавить = Истина;
			Менеджер = Новый (МассивЗначений[0] + "Менеджер." + МассивЗначений[1]);
			Возврат Менеджер[МассивЗначений[2]]; 
		КонецЕсли;
		
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;	
	КонецПопытки;
	
	Возврат Неопределено;	
	
КонецФункции

&НаСервереБезКонтекста
Функция СбисПолучитьОписаниеТипов(Значение, Разделитель)
	
	МассивЗначений = СбисПолучитьМассивИзСтроки(Значение, Разделитель);
	
	Значение = МассивЗначений[0];
	
	Если МассивЗначений.Количество() = 1 Тогда
		Возврат Новый ОписаниеТипов(Значение);
	КонецЕсли;
	
	Если Значение = "Дата" Тогда
		
		Попытка
			ЧастьДаты = СокрЛП(МассивЗначений[1]); 
			КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты[ЧастьДаты]);
			
			Возврат Новый ОписаниеТипов(Значение,,,,,КвалификаторыДаты);
			
		Исключение
		КонецПопытки;
		
	ИначеЕсли Значение = "Строка" Тогда
		
		Попытка
			ДлинаСтроки = Число(МассивЗначений[1]); 
			КвалификаторыСтроки = Новый КвалификаторыСтроки(ДлинаСтроки);
			
			Возврат Новый ОписаниеТипов(Значение,,,,КвалификаторыСтроки);
			
		Исключение
		КонецПопытки;
		
	ИначеЕсли Значение = "Число" Тогда
		
		Попытка
			ЧислоРазрядов = Число(МассивЗначений[1]);
			ЧислоРазрядовДробнойЧасти = Число(МассивЗначений[2]); 
			ДопустимыйЗнакЧисла = ДопустимыйЗнак[МассивЗначений[3]]; 

			КвалификаторыЧисла = Новый КвалификаторыЧисла(ЧислоРазрядов, ЧислоРазрядовДробнойЧасти, ДопустимыйЗнакЧисла);
			
			Возврат Новый ОписаниеТипов(Значение,,,КвалификаторыЧисла);
			
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция СбисПолучитьМассивИзСтроки(Значение, Разделитель)
	
	МассивЗначений = Новый Массив();
	
	Значение = СтрЗаменить(Значение, Разделитель, Символы.ПС);
	
    Для Индекс = 1 ПО СтрЧислоСтрок(Значение) Цикл
		МассивЗначений.Добавить(СокрЛП(СтрПолучитьСтроку(Значение, Индекс)));
	КонецЦикла;
	
	Возврат МассивЗначений;
	
КонецФункции

