
//В функцию должны быть вынесены все параметры, определяемые из настройки Конфигурация.
&НаКлиенте                                  
Функция		УстановитьИниКонфигурации(Кэш, ИниКонфигурации, ДопПараметры=Неопределено, Отказ) Экспорт
	
	МодульФункций = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	
	Попытка
		
		УстановитьИниКонфигурации_ТипыПолей					(ИниКонфигурации, ДопПараметры);
		УстановитьИниКонфигурации_Общее						(ИниКонфигурации, ДопПараметры);
		УстановитьИниКонфигурации_СопоставлениеНоменклатуры	(ИниКонфигурации, ДопПараметры);
		УстановитьИниКонфигурации_СопоставлениеДокументов	(ИниКонфигурации, ДопПараметры);
		УстановитьИниКонфигурации_ПараметрыСторон			(ИниКонфигурации, ДопПараметры);
		
	Исключение
		
		Отказ = Истина;
		ОшибкаУстановки = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "ФайлыНастроекОбщее.УстановитьИниКонфигурации");
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_ВСтроку(ОшибкаУстановки);
		
	КонецПопытки;

	Если Не ЗначениеЗаполнено(Кэш.Парам.НастройкиКриптографии.ИмяПрограммы) Тогда
		ПодписьНаСервере = Кэш.ОбщиеФункции.РассчитатьЗначениеНаСервере("ПодписьНаСервере", Новый Структура("ини",ИниКонфигурации));
		Если ПодписьНаСервере = Истина Тогда
			Кэш.Вставить("ФормаЭП",Кэш.ГлавноеОкно.СбисПолучитьФорму("ЭлектроннаяПодписьНаСервере"));
		Иначе
			Кэш.Вставить("ФормаЭП",Кэш.ГлавноеОкно.СбисПолучитьФорму("ЭлектроннаяПодписьНаКлиенте"));
		КонецЕсли;
	КонецЕсли;
	
	// -----------------------------------------------------------
	
	Кэш.ИспользоватьОбработчикиСобытий = Кэш.ОбщиеФункции.РассчитатьЗначение("ИспользоватьОбработчикиСобытий", ИниКонфигурации, Кэш);	
	
	//Заполним кодировки, в которых нужно перечитывать файлы.
	СБИС_Кодировки = Кэш.ОбщиеФункции.РассчитатьЗначение("Кодировки", ИниКонфигурации);
	КодировкиЧтенияФайлов = Новый Структура("Определять, ПоУмолчанию", Новый Массив, Новый Структура("ДляВсех", "utf-8"));
	КодировкиЧтенияФайлов.Определять.Добавить("windows-1251");
	Если ЗначениеЗаполнено(СБИС_Кодировки) Тогда
		//Пример узла: <Кодировки Имя="ЧтениеФайлов"><windows1251>'нужная кодировка'</windows1251></Кодировки>
		Если СБИС_Кодировки.Свойство("ЧтениеФайлов") Тогда
			Для Каждого КлючИЗначение Из СБИС_Кодировки.ЧтениеФайлов Цикл
				СбисЗначениеКодировки = НРег(Кэш.ОбщиеФункции.РассчитатьЗначение(КлючИЗначение.Ключ, СБИС_Кодировки.ЧтениеФайлов));
				Если КодировкиЧтенияФайлов.Определять.Найти(СбисЗначениеКодировки) = Неопределено Тогда 
					КодировкиЧтенияФайлов.Определять.Добавить(СбисЗначениеКодировки);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//Пример узла: <Кодировки Имя="ЧтениеПоУмолчанию"><ДляВсех>'нужная кодировка'</ДляВсех></Кодировки>
		//Доступные варианты: ДляВсех, API_HTMLпоXML_Чтение (для интеграции через API)
		Если СБИС_Кодировки.Свойство("ЧтениеПоУмолчанию") Тогда
			Для Каждого КлючИЗначениеКодировки Из СБИС_Кодировки.ЧтениеПоУмолчанию Цикл
				КодировкиЧтенияФайлов.ПоУмолчанию.Вставить(КлючИЗначениеКодировки.Ключ, Кэш.ОбщиеФункции.РассчитатьЗначение(КлючИЗначениеКодировки.Ключ, СБИС_Кодировки.ЧтениеПоУмолчанию));
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	Кэш.КэшЗначенийИни.Вставить("КодировкиЧтенияФайлов", КодировкиЧтенияФайлов);
	////Возможность переопределить встроенный язык через ини конфигурации
	////Пример узла: <КодВстроенногоЯзыка>'utf-8'</КодВстроенногоЯзыка>
	//СбисКодВстроенногоЯзыка	= Кэш.ОбщиеФункции.РассчитатьЗначение("КодВстроенногоЯзыка", ИниКонфигурации);
	//Если ЗначениеЗаполнено(СбисКодВстроенногоЯзыка) Тогда
	//	Кэш.ПараметрыСистемы.Конфигурация.ВстроенныйЯзык = СбисКодВстроенногоЯзыка;		
	//КонецЕсли;
	
	ИспользоватьВходящийКонтекст = Кэш.ОбщиеФункции.РассчитатьЗначение("ИспользоватьВходящийКонтекст", ИниКонфигурации);
	МодульОбъектаКлиент().ИзменитьПараметрСбис("ИспользоватьВходящийКонтекст", ИспользоватьВходящийКонтекст = Истина);
	
	СбисСтатусРегламент		= Кэш.ОбщиеФункции.РассчитатьЗначение("СтатусРегламент", ИниКонфигурации);
	Если СбисСтатусРегламент = Неопределено Тогда
		МассивСтатусРегламент = Новый Массив;
	Иначе		
		МассивСтатусРегламент	= Кэш.ОбщиеФункции.РазбитьСтрокуВМассивНаКлиенте(СбисСтатусРегламент, ",");
	КонецЕсли;
	МодульОбъектаКлиент().ИзменитьПараметрСбис("МассивСтатусРегламент", МассивСтатусРегламент);
	
	ДокументыДляНовыхКонтрагентов = Кэш.ОбщиеФункции.РассчитатьЗначение("ДокументыДляНовыхКонтрагентов", ИниКонфигурации);
	ДокументыДляНовыхКонтрагентов = СтрЗаменить(ДокументыДляНовыхКонтрагентов, " ", "");
	ФорматыДокументов = РазбитьСтрокуВМассив(ДокументыДляНовыхКонтрагентов, ",");
	МодульОбъектаКлиент().ИзменитьПараметрСбис("ДокументыДляНовыхКонтрагентов", ФорматыДокументов);
		
	// Список выбора реквизитов номенклатуры для подстановки кода в УПД
	РеквизитыКодаНоменклатуры = Кэш.ОбщиеФункции.РассчитатьЗначение("РеквизитыКодаНоменклатуры", ИниКонфигурации);
	ФормаНастроек = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаНастройки");
	РеквизитКодаНоменклатуры = Новый Массив;

	Если ЗначениеЗаполнено(РеквизитыКодаНоменклатуры) Тогда
		
		РеквизитыВСтроках = СтрЗаменить(РеквизитыКодаНоменклатуры, ",", Символы.ПС);
		
		Для НомерРеквизита = 1 По СтрЧислоСтрок(РеквизитыВСтроках) Цикл
			РеквизитКодаНоменклатуры.Добавить(СтрПолучитьСтроку(РеквизитыВСтроках, НомерРеквизита));
		КонецЦикла;
		
	Иначе
		РеквизитКодаНоменклатуры.Добавить("Код");
	КонецЕсли;

	МодульОбъектаКлиент().ИзменитьПараметрТекущегоСеанса("РеквизитыКодаНоменклатуры", РеквизитКодаНоменклатуры);
	МодульОбъектаКлиент().ИзменитьПараметрТекущегоСеанса("СписокДокументовДляСчетаНаОплату", ПолучитьСписокДокументовДляСчетаНаОплату(ИниКонфигурации, Кэш));
	
	// ----------------------------------------------------------------------------------------------------------------------------   
	
	МодульОбъектаКлиент().ИзменитьПараметрТекущегоСеанса("ТипыСвязанныхДокументов", ОписаниеТиповОснованийСвязанныхДокументов(ИниКонфигурации));
	
	КритерииОтбораСвязанныхДокументов = МодульФункций.РассчитатьЗначение("КритерииОтбораСвязанныхДокументов", ИниКонфигурации);  
	МодульОбъектаКлиент().ИзменитьПараметрТекущегоСеанса("КритерииОтбораСвязанныхДокументов", КритерииОтбораСвязанныхДокументов);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте                                  
Процедура	УстановитьИниКонфигурации_Общее(ИниКонфигурации, ДопПараметры = Неопределено)
	
	МодульТекущий	= МодульОбъектаКлиент();
	Кэш				= МодульТекущий.ПолучитьТекущийЛокальныйКэш();

	КаталогПоУмолчаниюСервер = Кэш.ОбщиеФункции.РассчитатьЗначение("КаталогПоУмолчанию_Сервер",				ИниКонфигурации);
	Если КаталогПоУмолчаниюСервер = Неопределено Тогда
		КаталогПоУмолчаниюСервер = МодульТекущий.ПолучитьЗначениеПараметраСбис("КаталогНастроек");
	КонецЕсли;
	СтрокаПодключенияDBF	= Кэш.ОбщиеФункции.РассчитатьЗначение("СтрокаПодключенияДБФ",					ИниКонфигурации);

	АвтоматическоеСозданиеНоменклатуры	= Кэш.ОбщиеФункции.РассчитатьЗначение("АвтоматическоеСозданиеНоменклатуры", ИниКонфигурации);
	АвтоматическоеСозданиеНоменклатуры	= АвтоматическоеСозданиеНоменклатуры = Истина Или АвтоматическоеСозданиеНоменклатуры = Неопределено;
	ИмяРегистраСвойствОбъекта			= ИмяРегистраСвойствОбъектов(ИниКонфигурации);
	
	МодульТекущий.ИзменитьПараметрТекущегоСеанса("АвтоматическоеСозданиеНоменклатуры", АвтоматическоеСозданиеНоменклатуры);
	
	МодульТекущий.ИзменитьПараметрСбис("ИмяРегистраДополнительныхСведений",	ИмяРегистраСвойствОбъекта);
	МодульТекущий.ИзменитьПараметрСбис("СтрокаПодключенияDBF",				СтрокаПодключенияDBF);
	МодульТекущий.ИзменитьПараметрСбис("КаталогПоУмолчанию_Сервер",			КаталогПоУмолчаниюСервер);

КонецПроцедуры 	
	
&НаКлиенте                                  
Процедура	УстановитьИниКонфигурации_СопоставлениеНоменклатуры(ИниКонфигурации, ДопПараметры = Неопределено)

	Если ИниКонфигурации.Свойство("Номенклатура_ЕдиницаИзмерения") Тогда
		
		ПараметрыДляСтрУзла = Новый ФиксированнаяСтруктура("ИмяРеквизита", Истина);
		ИмяРеквизитаЕдиницИзмерения = МодульОбъектаКлиент().СтроковоеЗначениеУзлаИни(ИниКонфигурации.Номенклатура_ЕдиницаИзмерения, ПараметрыДляСтрУзла);
		
	КонецЕсли;
	
	Если ИмяРеквизитаЕдиницИзмерения = Неопределено Тогда
		
		ТипыПолей1С = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолей1С");
		ТипСправочникаНоменклатуры = ТипыПолей1С.Номенклатура.ТипыМассивСтрок[0];
		ИмяРеквизитаЕдиницИзмерения = ОпределитьИмяРеквизитаЕдиницИзмеренияНаСервере(ТипСправочникаНоменклатуры);
		
	КонецЕсли;
	МодульОбъектаКлиент().ИзменитьПараметрТекущегоСеанса("ИмяРеквизитаЕдиницыИзмерения", ИмяРеквизитаЕдиницИзмерения);  
	МодульОбщиеФункции = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции");

	// Для автоматического поиска номенклатуры по штрихкодам
	ТипМетаданныхШтрихкоды = МодульОбщиеФункции.РассчитатьЗначение("ТипМетаданныхШтрихкоды", ИниКонфигурации);;
	ИмяМетаданныхШтрихкоды = МодульОбщиеФункции.РассчитатьЗначение("ИмяМетаданныхШтрихкоды", ИниКонфигурации);;
	ИмяМетаданныхРеквизитШтрихкод = МодульОбщиеФункции.РассчитатьЗначение("ИмяМетаданныхРеквизитШтрихкод", ИниКонфигурации);;
	ИмяМетаданныхРеквизитНоменклатура = МодульОбщиеФункции.РассчитатьЗначение("ИмяМетаданныхРеквизитНоменклатура", ИниКонфигурации);;
	
	ОписаниеМетаданныхШтрихкодов = Новый Структура;
	Если ТипМетаданныхШтрихкоды = Неопределено Тогда
		ОпределитьМетаданныеШтрихкодов(ОписаниеМетаданныхШтрихкодов)
	Иначе
		ОписаниеМетаданныхШтрихкодов.Вставить("ТипМетаданныхШтрихкоды", ТипМетаданныхШтрихкоды);
		ОписаниеМетаданныхШтрихкодов.Вставить("ИмяМетаданныхШтрихкоды", ИмяМетаданныхШтрихкоды);
		ОписаниеМетаданныхШтрихкодов.Вставить("ИмяМетаданныхРеквизитШтрихкод", ИмяМетаданныхРеквизитШтрихкод);
		ОписаниеМетаданныхШтрихкодов.Вставить("ИмяМетаданныхРеквизитНоменклатура", ИмяМетаданныхРеквизитНоменклатура);
	КонецЕсли;
	
	МодульОбъектаКлиент().ИзменитьПараметрТекущегоСеанса("ОписаниеМетаданныхШтрихкодов", ОписаниеМетаданныхШтрихкодов);

	// Способ сопоставления номенклатуры
	ЛокСпособСопоставленияНоменклатуры	= МодульОбъектаКлиент().ПолучитьПараметрПользователя("СпособСопоставленияНоменклатуры");
	ДоступныеСпособыСопоставления		= МодульОбъектаКлиент().СписокДоступныхСпособовСопоставленияНоменклатуры("Интерфейс");
	ВсеСпособыХранения					= МодульОбъектаКлиент().СписокВсехСпособовСопоставленияНоменклатуры("Интерфейс");
	Если	ЛокСпособСопоставленияНоменклатуры = Неопределено 
		Или (ЛокСпособСопоставленияНоменклатуры = 0 
		И ДоступныеСпособыСопоставления.НайтиПоЗначению(ЛокСпособСопоставленияНоменклатуры) = Неопределено) Тогда
		
		ФормаСопоставленияБыла					= МодульОбщиеФункции.РассчитатьЗначение("ФормаРаботыСНоменклатуройПоставщика", ИниКонфигурации);
		ЛокСпособСопоставленияНоменклатурыНовый = ДоступныеСпособыСопоставления[ДоступныеСпособыСопоставления.Количество()-1].Значение;
			
		Для Каждого ЭлементСопоставления Из МодульОбъектаКлиент().СписокВсехСпособовСопоставленияНоменклатуры("Общий") Цикл
			
			Если Не НРег(ЭлементСопоставления.Представление) = НРег(ФормаСопоставленияБыла) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ЛокСпособСопоставленияНоменклатурыНовый = ЭлементСопоставления.Значение;
			
		КонецЦикла;
	
		Если	МодульОбъектаКлиент().ПолучитьПараметрПользователя("СпособХраненияНастроек") = 1
			И	ЛокСпособСопоставленияНоменклатурыНовый = 1 Тогда
			
			СБИС_НоменклатураПоставщиков = МодульОбщиеФункции.РассчитатьЗначение("НоменклатураПоставщиков", ИниКонфигурации);
			
			// если настройки хранятся на сервере, то номенклатуру сопоставляем не в каталоге
			Если	Лев(СБИС_НоменклатураПоставщиков,10) = "Справочник" Тогда
				
				ЛокСпособСопоставленияНоменклатурыНовый = 2;
				
			ИначеЕсли	Лев(СБИС_НоменклатураПоставщиков,7) = "Регистр" Тогда
				
				ЛокСпособСопоставленияНоменклатурыНовый = 3;
				
			КонецЕсли;
			
		КонецЕсли;
		МодульОбъектаКлиент().ИзменитьПараметрПользователя("СпособСопоставленияНоменклатуры", ЛокСпособСопоставленияНоменклатурыНовый);
		
		ТекстСообщения	= "Установлен способ сопоставления номенклатуры на """
						+ ВсеСпособыХранения.НайтиПоЗначению(ЛокСпособСопоставленияНоменклатурыНовый).Представление
						+ """.";
						
		СообщениеПользователю = Новый Структура("Текст", ТекстСообщения);
		
	ИначеЕсли 	ДоступныеСпособыСопоставления.НайтиПоЗначению(ЛокСпособСопоставленияНоменклатуры) = Неопределено Тогда
		
		Если ДоступныеСпособыСопоставления.Количество() Тогда
			
			ЛокСпособСопоставленияНоменклатурыНовый = ДоступныеСпособыСопоставления[ДоступныеСпособыСопоставления.Количество()-1].Значение;
	 		МодульОбъектаКлиент().ИзменитьПараметрПользователя("СпособСопоставленияНоменклатуры", ЛокСпособСопоставленияНоменклатурыНовый);
				
			ТекстСообщения	= "Изменился способ сопоставления номенклатуры с """
							+ ВсеСпособыХранения.НайтиПоЗначению(ЛокСпособСопоставленияНоменклатуры).Представление
							+ """ на """
							+ ВсеСпособыХранения.НайтиПоЗначению(ЛокСпособСопоставленияНоменклатурыНовый).Представление
							+ """.";
			
		Иначе
							
			ТекстСообщения	= "Нет доступных вариантов сопоставления номенклатуры. Часть функционала может быть недоступна и работать с ошибками.";
			МодульОбъектаКлиент().ИзменитьПараметрПользователя("СпособСопоставленияНоменклатуры", -1);
			
		КонецЕсли;					
			
		СообщениеПользователю = Новый Структура("Текст", ТекстСообщения);
		МодульОбъектаКлиент().СбисСообщить(СообщениеПользователю);
		
	Иначе
		
		МодульОбъектаКлиент().ИзменитьПараметрПользователя("СпособСопоставленияНоменклатуры", ЛокСпособСопоставленияНоменклатуры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте                                  
Процедура	УстановитьИниКонфигурации_СопоставлениеДокументов(ИниКонфигурации, ДопПараметры = Неопределено)
	
	МодульТекущий	= МодульОбъектаКлиент();
	Кэш				= МодульТекущий.ПолучитьТекущийЛокальныйКэш();

	ФормаРаботыСоСтатусами	= Кэш.ОбщиеФункции.РассчитатьЗначение("ФормаРаботыСоСтатусами",					ИниКонфигурации);
	КаталогСтатусыНаСервере = Кэш.ОбщиеФункции.РассчитатьЗначение("ФормаРаботыСоСтатусами_КаталогНаСервере",ИниКонфигурации);
		
	//Меняем форму работы со статусами
	Если	ФормаРаботыСоСтатусами= "Статусы_СостоянияЭД" 
		И	Кэш.Парам.СостояниеЭД = Ложь Тогда
		//ИниКонфигурации.ФормаРаботыСоСтатусами.Значение="'Статусы_Регистры'";
		ФормаРаботыСоСтатусами = "Статусы_Регистры";
		Кэш.ГлавноеОкно.СостояниеЭД	= Истина;
		Кэш.Парам.СостояниеЭД		= Истина;
	КонецЕсли;
	
	Отказ = Ложь;
	
	//Получим форму работы со статусами и пропишем туда кэш.
	ФормаРаботыСоСтатусамиЗначение = Кэш.ГлавноеОкно.СбисПолучитьФормуОбработки(Кэш, ФормаРаботыСоСтатусами, Новый Структура, Отказ);
	
	Если Отказ Тогда
		
		ОшибкаУстановки = МодульТекущий.НовыйСбисИсключение(ФормаРаботыСоСтатусамиЗначение,
							"ФайлыНастроекОбщее.УстановитьИниКонфигурации_СопоставлениеДокументов");
		
		ВызватьИсключение МодульТекущий.СбисИсключение_ВСтроку(ОшибкаУстановки);

	КонецЕсли;
	
	ФормаРаботыСоСтатусамиЗначение.УстановитьПараметрыМодуля(Новый Структура("Каталог", КаталогСтатусыНаСервере), Кэш);
			
	МодульТекущий.ИзменитьПараметрТекущегоСеанса("МодульХраненияСтатусов", ФормаРаботыСоСтатусамиЗначение);

	//Надо проверить что каталог настроек установлен. Если нет, то вернуть по-умолчанию.
	Если ФормаРаботыСоСтатусами = "Статусы_ДБФ" Тогда
		СбисУстановленКаталог = Кэш.Парам.ИдентификаторНастроек;
		Если Кэш.Парам.СпособХраненияНастроек = 1 Тогда
			//Если негде хранить статусы и они установлены на DBF, то не считаем за ошибку. 
			СбисУстановленКаталог = Кэш.Парам.КаталогНастроек;
			Если Не ЗначениеЗаполнено(СбисУстановленКаталог) Тогда
				ФормаНастроекКаталог = Кэш.ГлавноеОкно.СбисПолучитьФорму("ФайлыНастроекКаталог");
				СбисУстановленКаталог = ФормаНастроекКаталог.СформироватьКаталогНастроек(Кэш, "", Отказ);
				Если Отказ Тогда 
					
					ОшибкаУстановки = МодульТекущий.НовыйСбисИсключение(СбисУстановленКаталог,
																		"ФайлыНастроекОбщее.УстановитьИниКонфигурации_СопоставлениеДокументов");
					ВызватьИсключение МодульТекущий.СбисИсключение_ВСтроку(ОшибкаУстановки);
					
				КонецЕсли;
			КонецЕсли;
			Кэш.Парам.КаталогНастроек = СбисУстановленКаталог;
			Кэш.ГлавноеОкно.Кэш.Парам.КаталогНастроек = СбисУстановленКаталог;
		КонецЕсли;
	КонецЕсли;
	
	//Делаем инициализацию форм хранения статусов и сопоставления.
	фрм = Кэш.ГлавноеОкно.СбисНайтиФормуФункции("Инициализировать", ФормаРаботыСоСтатусами);
	Если фрм <> Ложь Тогда
		фрм.Инициализировать(Кэш);
	КонецЕсли;
	
	МодульТекущий.ИзменитьПараметрСбис("ИмяМодуляРаботыСоСтатусами",	ФормаРаботыСоСтатусами);
		
КонецПроцедуры

&НаКлиенте                                  
Процедура	УстановитьИниКонфигурации_ПараметрыСторон(ИниКонфигурации, ДопПараметры)

	МодульОбъектаКлиент = МодульОбъектаКлиент();
	ПараметраПолучитьРеквизиты  = Новый Структура("ИмяРеквизита", Истина);

	ПараметрыСторон = Новый Структура("Организация, Контрагент, Синонимы", Новый Структура, Новый Структура, Новый Соответствие);

	ТипКонтрагента	= МодульОбъектаКлиент.СтроковоеЗначениеУзлаИни(ИниКонфигурации.Контрагенты, Новый Структура);
	Пока Лев(ТипКонтрагента, 1) = "[" Цикл
		
		УзелПереадресация = Сред(ТипКонтрагента, 2, Найти(ТипКонтрагента, "]") - 2);
		Если ИниКонфигурации.Свойство(УзелПереадресация, УзелПереадресация) Тогда
			
			ТипКонтрагента = МодульОбъектаКлиент.СтроковоеЗначениеУзлаИни(УзелПереадресация, Новый Структура);
			
		Иначе
			
			ТипКонтрагента = Неопределено;
			
		КонецЕсли;
		
	КонецЦикла;
	ТипКонтрагента	= МодульОбъектаКлиент.СсылочныйТипСтрокой(ТипКонтрагента);
	ПараметрыСторон.Синонимы.Вставить(ТипКонтрагента,	"Контрагент");
	ПараметрыСторон.Контрагент.Вставить("Тип", МодульОбъектаКлиент.СтроковоеЗначениеУзлаИни(ТипКонтрагента, ПараметраПолучитьРеквизиты));
			
	ТипОрганизации	= МодульОбъектаКлиент.СтроковоеЗначениеУзлаИни(ИниКонфигурации.Организации, Новый Структура);
	ТипОрганизации	= МодульОбъектаКлиент.СсылочныйТипСтрокой(ТипОрганизации);
	ПараметрыСторон.Синонимы.Вставить(ТипОрганизации,	"Организация");
	ПараметрыСторон.Организация.Вставить("Тип", МодульОбъектаКлиент.СтроковоеЗначениеУзлаИни(ТипОрганизации, ПараметраПолучитьРеквизиты));
	
	ПараметрыСторон.Синонимы.Вставить("Организация",				"Организация");
	ПараметрыСторон.Синонимы.Вставить("СопоставлениеПоОрганизации",	"Организация");
	ПараметрыСторон.Синонимы.Вставить("Контрагент",					"Контрагент");
	ПараметрыСторон.Синонимы.Вставить("СопоставлениеПоКонтрагенту",	"Контрагент");
	
	ПараметрыСторон.Организация.Вставить("ИНН",					МодульОбъектаКлиент.СтроковоеЗначениеУзлаИни(ИниКонфигурации.Организации_ИНН,	ПараметраПолучитьРеквизиты));
	ПараметрыСторон.Организация.Вставить("КПП",					МодульОбъектаКлиент.СтроковоеЗначениеУзлаИни(ИниКонфигурации.Организации_КПП,	ПараметраПолучитьРеквизиты));
	ПараметрыСторон.Организация.Вставить("КлючЗапроса",			"Организации");
	ПараметрыСторон.Организация.Вставить("ПоискТолькоПоИНН",	МодульОбъектаКлиент.ПолучитьЗначениеПараметраСбис("СопоставлениеПоОрганизации") = "Только по ИНН");
	ПараметрыСторон.Организация.Вставить("ПоискОтключен",		Ложь);
	
	Если ИниКонфигурации.Свойство("ЗапросОрганизации") Тогда
		
		ЗапросПоиск = МодульОбъектаКлиент.СтроковоеЗначениеУзлаИни(ИниКонфигурации.ЗапросОрганизации, Новый Структура);
		ПараметрыСторон.Организация.Вставить("Запрос", ЗапросПоиск);
		
	КонецЕсли;

	ПараметрыСторон.Контрагент.Вставить("ИНН",					МодульОбъектаКлиент.СтроковоеЗначениеУзлаИни(ИниКонфигурации.Контрагенты_ИНН,	ПараметраПолучитьРеквизиты));
	ПараметрыСторон.Контрагент.Вставить("КПП",					МодульОбъектаКлиент.СтроковоеЗначениеУзлаИни(ИниКонфигурации.Контрагенты_КПП,	ПараметраПолучитьРеквизиты));
	ПараметрыСторон.Контрагент.Вставить("КлючЗапроса",			"Контрагента");
	ПараметрыСторон.Контрагент.Вставить("ПоискТолькоПоИНН",		МодульОбъектаКлиент.ПолучитьЗначениеПараметраСбис("СопоставлениеПоКонтрагенту") = "Только по ИНН");
	ПараметрыСторон.Контрагент.Вставить("ПоискОтключен",		Ложь);
	
	Если ИниКонфигурации.Свойство("ЗапросКонтрагента") Тогда
		
		ЗапросПоиск = МодульОбъектаКлиент.СтроковоеЗначениеУзлаИни(ИниКонфигурации.ЗапросКонтрагента, Новый Структура);
		ПараметрыСторон.Контрагент.Вставить("Запрос", ЗапросПоиск);
		
	КонецЕсли;

	МодульОбъектаКлиент.ИзменитьПараметрТекущегоСеанса("РеквизитыСторонДляПоиска",	ПараметрыСторон);
	
КонецПроцедуры

// Процедура устанавливает в Кэш возможные типы полей 1С в обработке
// положенную структуру можно получить с помощью МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолей1С")
//
// Параметры:
//  ИниКонфигурации	 - Структура 
//  ДопПараметры	 - Структура 
//
// Структура "ТипыПолей1С":	- Ключ - Название объекта одним словом в им. падеже ед. числе (Организация, Контрагент и т.д.)
//							- Значение - Струтрура:
//													- ТипыМассивСтрок - Массив типов в строковом представлении
//													- ОписаниеТипа - описание типа (одинарного или составного)
//
&НаКлиенте
Процедура УстановитьИниКонфигурации_ТипыПолей(ИниКонфигурации, ДопПараметры)
	
	ТипыПолейРезультат	= Новый Структура;
	МодульОбъектаКлиент	= МодульОбъектаКлиент();
	МодульРасчитать		= МодульОбъектаКлиент.ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции");
	
	// Организации
	ИмяОбъекта = МодульРасчитать.РассчитатьЗначение("Организации", ИниКонфигурации);
	Если Не ЗначениеЗаполнено(ИмяОбъекта) Тогда
		ИмяОбъекта = МодульРасчитать.ПолучитьИмяОбъектаПоМетаданным("Организации");
	КонецЕсли;
	
	ДопПараметры = Новый Структура("СообщениеПриОшибке");
	ДопПараметры.СообщениеПриОшибке = "Не определен тип для организаций. Некоторые элементы форм могут работать некорректно.";
	СтруктураТипыПоляСОписаниемТипов = ПолучитьТипыПоляСОписаниемТипов(ИмяОбъекта, ДопПараметры);
	
	ТипыПолейРезультат.Вставить("Организация", СтруктураТипыПоляСОписаниемТипов);
	
	// Контрагенты
	ИмяОбъекта = МодульРасчитать.РассчитатьЗначение("Контрагенты", ИниКонфигурации);
	Если Не ЗначениеЗаполнено(ИмяОбъекта) Тогда
		ИмяОбъекта = МодульОбъектаКлиент.ПолучитьИмяОбъектаПоМетаданным("Контрагенты");
	КонецЕсли;
	
	ДопПараметры = Новый Структура("СообщениеПриОшибке");
	ДопПараметры.СообщениеПриОшибке = "Не определен тип для контрагентов. Некоторые элементы форм могут работать некорректно.";
	СтруктураТипыПоляСОписаниемТипов = ПолучитьТипыПоляСОписаниемТипов(ИмяОбъекта, ДопПараметры);
	
	ТипыПолейРезультат.Вставить("Контрагент", СтруктураТипыПоляСОписаниемТипов);
	
	// Ответственные
	ИмяОбъекта = МодульРасчитать.РассчитатьЗначение("Ответственные", ИниКонфигурации);
	Если	Не ЗначениеЗаполнено(ИмяОбъекта) Тогда
		ИмяОбъекта = МодульОбъектаКлиент.ПолучитьИмяОбъектаПоМетаданным("Ответственные");
	КонецЕсли;

	ДопПараметры = Новый Структура("СообщениеПриОшибке");
	ДопПараметры.СообщениеПриОшибке = "Не определен тип для ответственных. Некоторые элементы форм могут работать некорректно.";
	СтруктураТипыПоляСОписаниемТипов = ПолучитьТипыПоляСОписаниемТипов(ИмяОбъекта, ДопПараметры);
	
	ТипыПолейРезультат.Вставить("Ответственный", СтруктураТипыПоляСОписаниемТипов);	
	
	// Исполнители
	СтруктураТипыПоляСОписаниемТипов = Неопределено;
	ИмяОбъекта = МодульРасчитать.РассчитатьЗначение("Исполнители", ИниКонфигурации);
	Если Не ЗначениеЗаполнено(ИмяОбъекта) Тогда
		
		ИмяОбъекта = МодульОбъектаКлиент.ПолучитьИмяОбъектаПоМетаданным("ФизическиеЛица");
		
		Если НЕ ЗначениеЗаполнено(ИмяОбъекта) Тогда
			
			СтруктураТипыПоляСОписаниемТипов = ТипыПолейРезультат.Ответственный;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	ДопПараметры = Новый Структура("СообщениеПриОшибке");
	ДопПараметры.СообщениеПриОшибке = "Не определен тип для указания исполнителей. Некоторые элементы форм могут работать некорректно.";
	СтруктураТипыПоляСОписаниемТипов = ПолучитьТипыПоляСОписаниемТипов(ИмяОбъекта, ДопПараметры);
	
	ТипыПолейРезультат.Вставить("Исполнитель", СтруктураТипыПоляСОписаниемТипов);	
	
	// Классификатор единиц 1С
	ИмяОбъекта = МодульРасчитать.РассчитатьЗначение("КлассификаторЕдиницИзмерения", ИниКонфигурации);
	Если НЕ ЗначениеЗаполнено(ИмяОбъекта) Тогда
		ИмяОбъекта = МодульОбъектаКлиент.ПолучитьИмяОбъектаПоМетаданным("КлассификаторЕдиницИзмерения");
	КонецЕсли;

	ДопПараметры = Новый Структура("СообщениеПриОшибке");
	ДопПараметры.СообщениеПриОшибке = "Не определен тип единиц измерения. Некоторые элементы форм могут работать некорректно.";
	СтруктураТипыПоляСОписаниемТипов = ПолучитьТипыПоляСОписаниемТипов(ИмяОбъекта, ДопПараметры);
	
	ТипыПолейРезультат.Вставить("КлассификаторЕдиницИзмерения", СтруктураТипыПоляСОписаниемТипов);

	// Договоры 1С
	ИмяОбъекта = МодульРасчитать.РассчитатьЗначение("Договоры", ИниКонфигурации);
	Если НЕ ЗначениеЗаполнено(ИмяОбъекта) Тогда
		ИмяОбъекта = МодульОбъектаКлиент.ПолучитьИмяОбъектаПоМетаданным("Договор");
	КонецЕсли;
	
	ДопПараметры = Новый Структура("СообщениеПриОшибке");
	ДопПараметры.СообщениеПриОшибке = "Не удалось определить тип для договора контрагентов. Некоторые элементы форм могут работать некорректно.";
	СтруктураТипыПоляСОписаниемТипов = ПолучитьТипыПоляСОписаниемТипов(ИмяОбъекта, ДопПараметры);
	
	ТипыПолейРезультат.Вставить("Договор", СтруктураТипыПоляСОписаниемТипов);

	// Номенклатура  1С
	ИмяОбъекта = МодульРасчитать.РассчитатьЗначение("Номенклатура", ИниКонфигурации);
	Если Не ЗначениеЗаполнено(ИмяОбъекта) Тогда
		ИмяОбъекта = МодульОбъектаКлиент.ПолучитьИмяОбъектаПоМетаданным("Номенклатура");
	КонецЕсли;
	
	ДопПараметры = Новый Структура("СообщениеПриОшибке");
	ДопПараметры.СообщениеПриОшибке = "Не определен тип для номенклатуры. Некоторые элементы форм могут работать некорректно.";
	СтруктураТипыПоляСОписаниемТипов = ПолучитьТипыПоляСОписаниемТипов(ИмяОбъекта, ДопПараметры);
		
	ТипыПолейРезультат.Вставить("Номенклатура", СтруктураТипыПоляСОписаниемТипов);
	
	// Харктеристики  1С
	ИмяОбъекта = МодульРасчитать.РассчитатьЗначение("Характеристика", ИниКонфигурации);
	Если Не ЗначениеЗаполнено(ИмяОбъекта) Тогда
		ИмяОбъекта = МодульОбъектаКлиент.ПолучитьИмяОбъектаПоМетаданным("Характеристика");
	КонецЕсли;
	Если ЗначениеЗаполнено(ИмяОбъекта) Тогда
		ДопПараметры = Новый Структура("СообщениеПриОшибке");
		ДопПараметры.СообщениеПриОшибке = "Не удалось определить тип для характеристик номенклатуры. Некоторые элементы форм могут работать некорректно.";
		СтруктураТипыПоляСОписаниемТипов = ПолучитьТипыПоляСОписаниемТипов(ИмяОбъекта, ДопПараметры);
		
		ТипыПолейРезультат.Вставить("Характеристика", СтруктураТипыПоляСОписаниемТипов);
	КонецЕсли;
	
	// Тип номенклатуры  1С
	ВидыСправочниковНоменклатуры = МодульРасчитать.РассчитатьЗначение("ВидыСправочниковНоменклатуры", ИниКонфигурации);
	
	Если ВидыСправочниковНоменклатуры = Неопределено Тогда
		
		МодульОбъектаКлиент.ИзменитьПараметрСбис("ВидыСправочниковНоменклатуры",	"СправочникСсылка.Номенклатура");
		
	Иначе
		
		МодульОбъектаКлиент.ИзменитьПараметрСбис("ВидыСправочниковНоменклатуры",	ВидыСправочниковНоменклатуры);
		
	КонецЕсли;
	
	ИмяОбъекта = МодульРасчитать.РассчитатьЗначение("ТипНоменклатуры", ИниКонфигурации);
	Если ЗначениеЗаполнено(ИмяОбъекта) Тогда
		ДопПараметры = Новый Структура("СообщениеПриОшибке");
		ДопПараметры.СообщениеПриОшибке = "Не удалось определить тип для цен. Некоторые элементы форм могут работать некорректно.";
		СтруктураТипыПоляСОписаниемТипов = ПолучитьТипыПоляСОписаниемТипов(ИмяОбъекта, ДопПараметры);
		
		ТипыПолейРезультат.Вставить("ТипНоменклатуры", СтруктураТипыПоляСОписаниемТипов);
	КонецЕсли;
	
	// Тип типа цен  1С
	ИмяОбъекта = МодульРасчитать.РассчитатьЗначение("ТипЦен", ИниКонфигурации);
	Если ЗначениеЗаполнено(ИмяОбъекта) Тогда
		ДопПараметры = Новый Структура("СообщениеПриОшибке");
		ДопПараметры.СообщениеПриОшибке = "Не удалось определить тип для типов номенклатуры. Некоторые элементы форм могут работать некорректно.";
		СтруктураТипыПоляСОписаниемТипов = ПолучитьТипыПоляСОписаниемТипов(ИмяОбъекта, ДопПараметры);
		
		ТипыПолейРезультат.Вставить("ТипЦен", СтруктураТипыПоляСОписаниемТипов);
	КонецЕсли;
	
	// Тип типа склад  1С
	ИмяОбъекта = МодульРасчитать.РассчитатьЗначение("СправочникСклады", ИниКонфигурации);
	Если ЗначениеЗаполнено(ИмяОбъекта) Тогда
		ДопПараметры = Новый Структура("СообщениеПриОшибке");
		ДопПараметры.СообщениеПриОшибке = "Не удалось определить тип для складов. Некоторые элементы форм могут работать некорректно.";
		СтруктураТипыПоляСОписаниемТипов = ПолучитьТипыПоляСОписаниемТипов(ИмяОбъекта, ДопПараметры);
		
		ТипыПолейРезультат.Вставить("Склады", СтруктураТипыПоляСОписаниемТипов);
	КонецЕсли;
	
	// Рассчетный счет
	ИмяОбъекта = МодульРасчитать.РассчитатьЗначение("СправочникРасСчет", ИниКонфигурации);
	Если ЗначениеЗаполнено(ИмяОбъекта) Тогда
		ДопПараметры = Новый Структура("СообщениеПриОшибке");
		ДопПараметры.СообщениеПриОшибке = "Не удалось определить тип рассчетного счета. Некоторые элементы форм могут работать некорректно.";
		СтруктураТипыПоляСОписаниемТипов = ПолучитьТипыПоляСОписаниемТипов(ИмяОбъекта, ДопПараметры);
		
		ТипыПолейРезультат.Вставить("РассчетныйСчет", СтруктураТипыПоляСОписаниемТипов);
	КонецЕсли;
	
	ТипыПолейФильтра = ТипыПолей1С_Фильтры(ТипыПолейРезультат);
	
	МодульОбъектаКлиент.ИзменитьПараметрТекущегоСеанса("ТипыПолей1С",		ТипыПолейРезультат);	
	МодульОбъектаКлиент.ИзменитьПараметрТекущегоСеанса("ТипыПолейФильтра",	ТипыПолейФильтра);
	
КонецПроцедуры

&НаКлиенте
Функция ТипыПолей1С_Фильтры(ТипыПолей1С)

	МассивТиповФильтров = Новый Массив;
	МассивТиповФильтров.Добавить("ФильтрОрганизация");
	МассивТиповФильтров.Добавить("ФильтрКонтрагент");
	МассивТиповФильтров.Добавить("ФильтрОтветственный");
	МассивТиповФильтров.Добавить("ФильтрНоменклатура");
	МассивТиповФильтров.Добавить("ФильтрТипНоменклатуры");
	
	ТипыПолейФильтра = Новый Структура;
	
	Для Каждого СтрокаТипа Из МассивТиповФильтров Цикл
		
		ТипСтрокой = СтрЗаменить(СтрокаТипа, "Фильтр", "");
		
		Если ТипыПолей1С.Свойство(ТипСтрокой) Тогда
			ОписаниеТипа = ТипыПолей1С[ТипСтрокой].ОписаниеТипа;
		Иначе
			ОписаниеТипа = Новый ОписаниеТипов;
		КонецЕсли;
		
		ТипыПолейФильтра.Вставить(СтрокаТипа, ОписаниеТипа);
		
	КонецЦикла;

	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		//Временный костыль для ОФ
		ТипыПолейФильтра_ПривестиПоле(ТипыПолейФильтра, "ФильтрОрганизация");
		ТипыПолейФильтра_ПривестиПоле(ТипыПолейФильтра, "ФильтрКонтрагент");
		ТипыПолейФильтра_ПривестиПоле(ТипыПолейФильтра, "ФильтрОтветственный");
		
	#КонецЕсли

	Возврат ТипыПолейФильтра;
	
КонецФункции

&НаКлиенте
Процедура ТипыПолейФильтра_ПривестиПоле(ОписаниеТиповФильтра, КлючФильтра)
	
	ФормаГлавноеОкно = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаГлавноеОкно");

	Попытка
		
		ОписаниеТипа = ОписаниеТиповФильтра[КлючФильтра];
		ОписаниеПараметраИзменить = Новый ФиксированнаяСтруктура("Форма, Реквизит", ФормаГлавноеОкно, КлючФильтра);
		ПараметрыИзменить = Новый ФиксированнаяСтруктура("УстановитьОграничениеТипа", ОписаниеТипа);

		МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеПараметраИзменить, ПараметрыИзменить);
		ФормаГлавноеОкно[КлючФильтра] = ОписаниеТипа.ПривестиЗначение();
		
	Исключение
		
		ОшибкаУстановкиФильтра = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "ФайлыНастроекОбщее.ФильтрУстановитьТипыПолей_ПривестиПоле");
		МодульОбъектаКлиент().СообщитьСбисИсключение(ОшибкаУстановкиФильтра, Новый Структура("СтатусСообщения", "message"));
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьМетаданныеШтрихкодов(ОписаниеМетаданныхШтрихкодов)

	Если НЕ Метаданные.РегистрыСведений.Найти("ШтрихкодыНоменклатуры") = Неопределено Тогда
		
		ОписаниеМетаданныхШтрихкодов.Вставить("ТипМетаданныхШтрихкоды", "РегистрСведений");
		ОписаниеМетаданныхШтрихкодов.Вставить("ИмяМетаданныхШтрихкоды", "ШтрихкодыНоменклатуры");
		
		Если НЕ Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры.Ресурсы.Найти("Номенклатура") = Неопределено Тогда
			ОписаниеМетаданныхШтрихкодов.Вставить("ИмяМетаданныхРеквизитНоменклатура", "Номенклатура");	
		ИначеЕсли НЕ Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры.Ресурсы.Найти("Владелец") = Неопределено Тогда
	        ОписаниеМетаданныхШтрихкодов.Вставить("ИмяМетаданныхРеквизитНоменклатура", "Владелец");
		ИначеЕсли НЕ Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры.Измерения.Найти("Номенклатура") = Неопределено Тогда	
			ОписаниеМетаданныхШтрихкодов.Вставить("ИмяМетаданныхРеквизитНоменклатура", "Номенклатура");	
		КонецЕсли;
		
		ОписаниеМетаданныхШтрихкодов.Вставить("ИмяМетаданныхРеквизитШтрихкод", "Штрихкод");
		
	ИначеЕсли НЕ Метаданные.РегистрыСведений.Найти("Штрихкоды") = Неопределено Тогда 
		
		ОписаниеМетаданныхШтрихкодов.Вставить("ТипМетаданныхШтрихкоды", "РегистрСведений");
		ОписаниеМетаданныхШтрихкодов.Вставить("ИмяМетаданныхШтрихкоды", "Штрихкоды");
		
		Если НЕ Метаданные.РегистрыСведений.Штрихкоды.Измерения.Найти("Номенклатура") = Неопределено Тогда
			ОписаниеМетаданныхШтрихкодов.Вставить("ИмяМетаданныхРеквизитНоменклатура", "Номенклатура");	
		ИначеЕсли НЕ Метаданные.РегистрыСведений.Штрихкоды.Измерения.Найти("Владелец") = Неопределено Тогда
	        ОписаниеМетаданныхШтрихкодов.Вставить("ИмяМетаданныхРеквизитНоменклатура", "Владелец");
		КонецЕсли; 
		
		ОписаниеМетаданныхШтрихкодов.Вставить("ИмяМетаданныхРеквизитШтрихкод", "Штрихкод");
		
	КонецЕсли; 
	
КонецПроцедуры

