
&НаКлиенте
Функция ExtSys_FeatureIsOn(ПараметрыФичи, ДопПараметрыВызова) Экспорт
	Если Не МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("Авторизован") Тогда
		//Если ещё не авторизовались, то за фичей не идём, считаем что неопределено.
		Возврат Неопределено;
	КонецЕсли;
	ДопПараметры = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь); 
	Возврат СбисОтправитьИОбработатьКоманду(ДопПараметрыВызова.Кэш, "ExtSys.FeatureIsOn", Новый Структура("name", ПараметрыФичи.НазваниеФичи), ДопПараметры, Ложь) = Истина;
КонецФункции

&НаКлиенте
Функция ExtSys_GetImageByLink(params,  ДопПараметры, Отказ = Ложь) Экспорт

	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();

	ПараметрыМетода = Новый Структура("link", params);
	
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSys.GetImageByLink", ПараметрыМетода, ДопПараметрыВызова, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSys_GetImageByLink"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ExtSysLicense_GetInfo(params,  ДопПараметры, Отказ = Ложь) Экспорт

	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();

	ПараметрыМетода = Новый Структура("parameters", params);
	
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysLicense.GetInfo", ПараметрыМетода, ДопПараметрыВызова, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysLicense_GetInfo"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ExtSysLicense_GetPaymentLink(params,  ДопПараметры, Отказ = Ложь) Экспорт

	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();

	ПараметрыМетода = Новый Структура("Params", params);
	
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysLicense.GetPaymentLink", ПараметрыМетода, ДопПараметрыВызова, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysLicense_GetPaymentLink"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ExtSysPerson_GetStaffPhoto(params,  ДопПараметры, Отказ = Ложь) Экспорт

	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();

	ПараметрыМетода = Новый Структура("id", params);
	
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysPerson.GetStaffPhoto", ПараметрыМетода, ДопПараметрыВызова, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysPerson_GetStaffPhoto"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

// Функция - Вызов метода БЛ ExSysNom.CustomDocNomUpdate
//
// Параметры:
//	Кэш						 - Структура - кэш обработки
//  ВходящийПараметрМетода	 - Структура - Параметры метода БЛ
//  ДопПараметры			 - Структура, Неопределено - Доп. параметры вызова
//  Отказ					 - Булево - Признак ошибки вызова метода
// 
// Возвращаемое значение:
//  Структура - Ответ БЛ
//
&НаКлиенте
Функция ExtSysNom_CustomDocNomUpdate(Кэш, ВходящийПараметрМетода,  ДопПараметры, Отказ = Ложь) Экспорт
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysNom.CustomDocNomUpdate", ВходящийПараметрМетода, ДопПараметры, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysNom.CustomDocNomUpdate"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

// Функция - Вызов метода БЛ ExtSysNom.MoveToPack
//
// Параметры:
//	Кэш						 - Структура - кэш обработки
//  ВходящийПараметрМетода	 - Структура - Параметры метода БЛ
//  ДопПараметры			 - Структура, Неопределено - Доп. параметры вызова
//  Отказ					 - Булево - Признак ошибки вызова метода
// 
// Возвращаемое значение:
//  Структура - Ответ БЛ
//
&НаКлиенте
Функция ExtSysNom_MoveToPack(Кэш, ВходящийПараметрМетода,  ДопПараметры, Отказ = Ложь) Экспорт
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysNom.MoveToPack", ВходящийПараметрМетода, ДопПараметры, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysNom.MoveToPack"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

// Функция - Вызов метода БЛ ExtSysNom.UnPack
//
// Параметры:
//	Кэш						 - Структура - кэш обработки
//  ВходящийПараметрМетода	 - Структура - Параметры метода БЛ
//  ДопПараметры			 - Структура, Неопределено - Доп. параметры вызова
//  Отказ					 - Булево - Признак ошибки вызова метода
// 
// Возвращаемое значение:
//  Структура - Ответ БЛ
//
&НаКлиенте
Функция ExtSysNom_UnPack(Кэш, ВходящийПараметрМетода,  ДопПараметры, Отказ = Ложь) Экспорт
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysNom.UnPack", ВходящийПараметрМетода, ДопПараметры, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysNom.UnPack"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

// Функция - Вызов метода БЛ ExtSysNom.DeleteDnBatchAndRecalcQty
//
// Параметры:
//	Кэш						 - Структура - кэш обработки
//  ВходящийПараметрМетода	 - Структура - Параметры метода БЛ
//  ДопПараметры			 - Структура, Неопределено - Доп. параметры вызова
//  Отказ					 - Булево - Признак ошибки вызова метода
// 
// Возвращаемое значение:
//  Структура - Ответ БЛ
//
&НаКлиенте
Функция ExtSysNom_DeleteDnBatchAndRecalcQty(Кэш, ВходящийПараметрМетода,  ДопПараметры, Отказ = Ложь) Экспорт
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysNom.DeleteDnBatchAndRecalcQty", ВходящийПараметрМетода, ДопПараметры, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysNom.DeleteDnBatchAndRecalcQty"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

// Функция - Вызов метода БЛ ExtSysNom.CustomCreate
//
// Параметры:
//	Кэш						 - Структура - кэш обработки
//  ВходящийПараметрМетода	 - Структура - Параметры метода БЛ
//  ДопПараметры			 - Структура, Неопределено - Доп. параметры вызова
//  Отказ					 - Булево - Признак ошибки вызова метода
// 
// Возвращаемое значение:
//  Структура - Ответ БЛ
//
&НаКлиенте
Функция ExtSysNom_CustomCreate(Кэш, ВходящийПараметрМетода,  ДопПараметры, Отказ = Ложь) Экспорт
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysNom.CustomCreate", ВходящийПараметрМетода, ДопПараметры, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysNom.CustomCreate"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

// Функция - Вызов метода БЛ ExtSysNom.GetGln
//
// Параметры:
//	Кэш						 - Структура - кэш обработки
//  ВходящийПараметрМетода	 - Структура - Параметры метода БЛ
//  ДопПараметры			 - Структура, Неопределено - Доп. параметры вызова
//  Отказ					 - Булево - Признак ошибки вызова метода
// 
// Возвращаемое значение:
//  Структура - Ответ БЛ
//
&НаКлиенте
Функция ExtSysNom_GetGln(Кэш, ВходящийПараметрМетода,  ДопПараметры, Отказ = Ложь) Экспорт
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysNom.GetGln", ВходящийПараметрМетода, ДопПараметры, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysNom.GetGln"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

// Функция - Вызов метода БЛ ExtSysNom.GeneratePackage
//
// Параметры:
//	Кэш						 - Структура - кэш обработки
//  ВходящийПараметрМетода	 - Структура - Параметры метода БЛ
//  ДопПараметры			 - Структура, Неопределено - Доп. параметры вызова
//  Отказ					 - Булево - Признак ошибки вызова метода
// 
// Возвращаемое значение:
//  Структура - Ответ БЛ
//
&НаКлиенте
Функция ExtSysNom_GeneratePackage(Кэш, ВходящийПараметрМетода,  ДопПараметры, Отказ = Ложь) Экспорт
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysNom.GeneratePackage", ВходящийПараметрМетода, ДопПараметры, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysNom.GeneratePackage"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

// Функция - Вызов метода БЛ ExtSysNom.GeneratePack
//
// Параметры:
//	Кэш						 - Структура - кэш обработки
//  ВходящийПараметрМетода	 - Структура - Параметры метода БЛ
//  ДопПараметры			 - Структура, Неопределено - Доп. параметры вызова
//  Отказ					 - Булево - Признак ошибки вызова метода
// 
// Возвращаемое значение:
//  Структура - Ответ БЛ
//
&НаКлиенте
Функция ExtSysNom_GeneratePack(Кэш, ВходящийПараметрМетода,  ДопПараметры, Отказ = Ложь) Экспорт
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysNom.GeneratePack", ВходящийПараметрМетода, ДопПараметры, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysNom.GeneratePack"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

#Область include_core2_vo2_СпособыОбмена_API_ВнешниеОбертки_СинхронныеОперации_ExtSysMarking
#КонецОбласти

#Область include_core2_vo2_СпособыОбмена_API_ВнешниеОбертки_СинхронныеОперации_ExtSysDocument
#КонецОбласти

