
// Функция управляет флагом документа ДокументРасширение.Изменен, 
// что позволяет вызывать перегенерацию документа при вызове метода СБИС.ПодготовитьДействие
//
// Параметры:
//  params			- Структура - Параметры метода.
//  ДопПараметры	- Структура - Набор полей, работа с которыми может расширить результат работы функции.
//  Отказ			- Булево	- Признак отказа.
//
// Возвращаемое значение:
//   Булево  - Результат вызова.
//
&НаКлиенте
Функция ExtSysDocument_Changed(params, ДопПараметры, Отказ = Ложь) Экспорт   
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();

	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	ПараметрыКоманды = Новый Структура();   
	ПараметрыКоманды.Вставить("docflow_id", params.ИдДок);    
	ПараметрыКоманды.Вставить("value", params.ФлагИзменен);
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysDocument.Changed", ПараметрыКоманды, ДопПараметрыВызова, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysDocument_Changed"); 
		
	КонецЕсли;  
	
	Возврат Результат;
	
КонецФункции    

// Функция управляет флагом документа ДокументРасширение.Состояние.ЕстьРасхождения.
//
// Параметры:
//  params			- Структура - Параметры метода.
//  ДопПараметры	- Структура - Набор полей, работа с которыми может расширить результат работы функции.
//  Отказ			- Булево	- Признак отказа.
//
// Возвращаемое значение:
//   Булево  - Результат вызова.
//
&НаКлиенте
Функция ExtSysDocument_SetDevStatus(params, ДопПараметры, Отказ = Ложь) Экспорт   
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();

	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	ПараметрыКоманды = Новый Структура();   
	ПараметрыКоманды.Вставить("docflow_id", params.ИдДок);    
	ПараметрыКоманды.Вставить("status_val", params.ФлагРасхождения);
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysDocument.SetDevStatus", ПараметрыКоманды, ДопПараметрыВызова, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysDocument_SetDevStatus"); 
		
	КонецЕсли;  
	
	Возврат Результат;
	
КонецФункции

// Функция записывает сопоставление документов в маппинг
//
// Параметры:
//  params			- Структура - Параметры метода.
//  ДопПараметры	- Структура - Набор полей, работа с которыми может расширить результат работы функции.
//  Отказ			- Булево	- Признак отказа.
//
// Возвращаемое значение:
//   Структура  - Результат вызова.
//
&НаКлиенте
Функция ExtSysDocument_WriteMapping(params, ДопПараметры, Отказ = Ложь) Экспорт   
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();

	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysDocument.WriteMapping", params, ДопПараметрыВызова, Отказ);   
	
	Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysDocument_WriteMapping"); 
		
	КонецЕсли;  
	
	Возврат Результат;
	
КонецФункции

