
// Функция получает список идентификаторов документов, доступных к аннулированию
//
// Параметры:
//  params  		- Структура - Параметры фильтрации метода
//  ДопПараметры  	- Структура - Набор полей, работа с которыми может расширить результат работы функции.
//  Отказ			- Булево	- Флаг ошибки при вызове метода
//
// Возвращаемое значение:
//   Структура   - Результат вызова. Список объектов или ошибка
//
&НаКлиенте
Функция ExtSysAction_CheckAnnul(params, ДопПараметры, Отказ = Ложь) Экспорт  
	
	Кэш = ДопПараметры.Кэш;
	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);  
	ПараметрыКоманды = Новый Структура("docflowIds", params.docflowIds); 
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysAction.CheckAnnul", ПараметрыКоманды, ДопПараметрыВызова, Отказ);    
	
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".ExtSysAction_CheckAnnul");
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции 

// Функция получает список заказов от покупателей
//
// Параметры:
//  params  - Структура - Параметры фильтрации метода
//  ДопПараметры  - Структура - Набор полей, работа с которыми может расширить результат работы функции 
//  Отказ - Булево - Признак отказа.
//
// Возвращаемое значение:
//   Структура   - Результат вызова. Список объектов или ошибка
//
&НаКлиенте
Функция ExtSysOrders_List(params, ДопПараметры, Отказ = Ложь) Экспорт  
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();   
	
	ДопПараметрыВызова = Новый Структура("ЕстьРезультат, ВернутьОшибку, СообщатьПриОшибке", Истина, Истина, Ложь);  
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Фильтр", params);	
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysOrders.List", ПараметрыКоманды, ДопПараметрыВызова, Отказ);    
	
	Если Отказ Тогда    
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysOrders_List");   
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции  

// Функция получает список этапов заказа, для построения дополнительного аккордеона
//
// Параметры:
//  params		 -  Структура - Параметры команды метода 
//  ДопПараметры - 	Структура - Набор полей, работа с которыми может расширить результат работы функции 
//  Отказ		 - 	Булево - Признак отказа 
// 
// Возвращаемое значение:
//  Структура   - Результат вызова. Список объектов или ошибка 
//
&НаКлиенте
Функция ExtSysOrders_MasterFilter(params, ДопПараметры, Отказ = Ложь) Экспорт 
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();

	ДопПараметрыВызова = Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);   
	
	ПараметрыКоманды = Новый Структура;  
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ExtSysOrders.MasterFilter", ПараметрыКоманды, ДопПараметрыВызова, Отказ);     
	
		Если Отказ Тогда 
		
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + ".ExtSysOrders_MasterFilter"); 
		
	КонецЕсли;  
	
	Возврат Результат;

КонецФункции

