
&НаКлиенте
Функция СБИС_Аутентифицировать(Кэш, СтруктураПараметровЗапроса, ДопПараметрыВходящие, Отказ) Экспорт

	Параметр = Новый Структура("Логин, Пароль");
	ЗаполнитьЗначенияСвойств(Параметр, СтруктураПараметровЗапроса);
	
	Если Не ЗначениеЗаполнено(Параметр.Логин) Тогда 
		
		ОшибкаАвторизации = МодульОбъектаКлиент().НовыйСбисИсключение(,
													МодульОбъектаКлиент().ПараметрSABY("ИнтеграцияИмя") + ".СБИС.Аутентифицировать",
													785,
													"Не указаны логин/пароль для авторизации");
		Отказ = Истина;
		Возврат ОшибкаАвторизации;
		
	КонецЕсли;
	
	Если СтруктураПараметровЗапроса.Свойство("Аккаунт") Тогда
		
		Параметр.Вставить("НомерАккаунта", СтруктураПараметровЗапроса.Аккаунт);
		
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура("Параметр", Параметр);
	
	Возврат API_СБИС_Аутентифицировать(Кэш, ПараметрыЗапроса, ДопПараметрыВходящие, Отказ);

КонецФункции

&НаКлиенте
Функция СБИС_ЗаписатьВложение(Кэш, param, ДопПараметры, Отказ) Экспорт
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ЗаписатьВложение", Новый Структура("Документ", param), ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_ЗаписатьВложение");
	КонецЕсли;
	Возврат Результат
КонецФункции

&НаКлиенте
Функция СБИС_ЗаписатьДокумент(Кэш, document_in, ДопПараметры=Неопределено, Отказ=Ложь)
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура("ПреобразовыватьДаты, СообщатьПриОшибке, ВернутьОшибку", Ложь, Ложь, Истина);
	КонецЕсли;
	
	СтруктураПараметровЗапроса	= Новый Структура("Документ", document_in);
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ЗаписатьДокумент", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  "API.СБИС_ЗаписатьДокумент");
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СБИС_ВыполнитьДействие(Кэш, document_in, ДопПараметры=Неопределено, Отказ=Ложь) Экспорт

	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура("ПреобразовыватьДаты, СообщатьПриОшибке, ВернутьОшибку", Ложь, Ложь, Истина);
	КонецЕсли;
	
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ВыполнитьДействие", Новый Структура("Документ",document_in), ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  "API.СБИС_ВыполнитьДействие");
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СБИС_СписокСертификатов(Кэш, param, ДопПараметры = Неопределено, Отказ=Ложь) Экспорт
	
	ДопПараметры= Новый Структура("ЕстьРезультат, ИдСессии, АдресРесурса", Истина, "", "/auth/service/");
	
	МестныйКэш = Кэш;
	СписокСертификатов = Новый СписокЗначений();
	
	СертификатыДляАвторизации = Кэш.ФормаЭП.сбисСписокСертификатовДляАвторизации(Кэш, "");
	Если ТипЗнч(СписокСертификатов) = Тип("СписокЗначений")
		И СписокСертификатов.Количество() Тогда
		Возврат СписокСертификатов;
	КонецЕсли;
		
	СтруктураПараметровЗапроса = Новый Структура("Параметр", Новый Структура("Сертификат", СертификатыДляАвторизации));
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.СписокСертификатовДляАутентификации", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	
	Возврат Результат;
	
КонецФункции

//Проверяет действительность текущей сессии
&НаКлиенте
Функция СБИС_ПроверитьСессию(ИдСессииПроверить) Экспорт
	
	Кэш			= МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	Отказ		= Ложь;
	ДопПараметры= Новый Структура("ЕстьРезультат, АдресРесурса, ИдСессии", Истина, "/auth/service/", ИдСессииПроверить);
	
	РезультатЗапроса = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ПроверитьСессию", Новый Структура, ДопПараметры, Отказ);
	Если Отказ Тогда
		
		ОшибкаПроверитьСессию = МодульОбъектаКлиент().НовыйСбисИсключение(РезультатЗапроса, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_ПроверитьСессию");
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_ВСтроку(ОшибкаПроверитьСессию);
		
	КонецЕсли;
	
	Возврат	РезультатЗапроса.СессияАктивна = "Да"

КонецФункции

&НаКлиенте
Функция СБИС_ПодготовитьДействие(Кэш, document_in, ДопПараметры=Неопределено, Отказ=Ложь) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура("ПреобразовыватьДаты, СообщатьПриОшибке, ВернутьОшибку", Ложь, Ложь, Истина);
	КонецЕсли;

	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ПодготовитьДействие", Новый Структура("Документ",document_in), ДопПараметры, Отказ);	
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  "API.СБИС_ПодготовитьДействие");
	КонецЕсли;
	Возврат Результат;
КонецФункции
	
&НаКлиенте
Функция СБИС_ПрочитатьДокумент(Кэш, param, ДопПараметры, Отказ) Экспорт
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ПрочитатьДокумент", Новый Структура("Документ", param), ДопПараметры, Отказ);
	Если Отказ Тогда
		
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_ПрочитатьДокумент");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СБИС_СписокДокументов(Кэш, filter, ДопПараметры, Отказ) Экспорт

	Возврат API_СБИС_СписокДокументов(Кэш, filter, ДопПараметры, Отказ);

КонецФункции

&НаКлиенте
Функция СБИС_СписокДокументовПоСобытиям(Кэш, filter, ДопПараметры, Отказ) Экспорт

	СтруктураПараметровЗапроса = Новый Структура("Фильтр", filter);
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.СписокДокументовПоСобытиям", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	Если Отказ Тогда
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_СписокДокументовПоСобытиям");
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СБИС_СписокИзменений(Кэш, filter, ДопПараметры, Отказ) Экспорт
	СтруктураПараметровЗапроса	= Новый Структура("Фильтр", filter);
	ДопПараметрыВызова			= Новый Структура("ВернутьОшибку, СообщатьПриОшибке", Истина, Ложь);
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "СБИС.СписокИзменений", СтруктураПараметровЗапроса, ДопПараметрыВызова, Отказ);
	Если Отказ Тогда
		Результат = Кэш.ОбщиеФункции.СбисИсключение(Результат, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_СписокИзменений");
	КонецЕсли;
	Возврат Результат;
КонецФункции

//Возвращает текущую дату/время. Для вызовов сервера - время на сервере.
&НаКлиенте
Функция СБИС_ТекущаяДата(Кэш, Отказ=Ложь) Экспорт
	
	Если Кэш.Парам.ИнтеграцияAPIВызовыНаКлиенте Тогда
		Возврат ТекущаяДата();
	КонецЕсли;		
	ДопПараметры				= Новый Структура("СообщатьПриОшибке, ВернутьОшибку", Ложь, Истина);
	СтруктураПараметровЗапроса	= Новый Структура("Параметр", Новый Структура);
	РезультатЗапроса = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ИнформацияОВерсии", СтруктураПараметровЗапроса, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат ТекущаяДата();
	КонецЕсли;
	Возврат РезультатЗапроса.ВнешнийИнтерфейс.ДатаВремяЗапроса;
	
КонецФункции

&НаКлиенте
Функция СБИС_ИнформацияОКонтрагенте(Кэш, СтруктураКонтрагента, ДопПараметры, Отказ) Экспорт
	СтруктураРезультата = сбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ИнформацияОКонтрагенте", Новый Структура("Участник", СтруктураКонтрагента), ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(СтруктураРезультата, "API.СБИС_ИнформацияОКонтрагенте");
	КонецЕсли;
	
	Возврат СтруктураРезультата;
КонецФункции

&НаКлиенте
Функция СБИС_ПолучитьИнформациюОТекущемПользователе(Кэш, param, ДопПараметры, Отказ) Экспорт
	param.Вставить("ДопПоля", "Аккаунт,ИдПрофиля");
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ИнформацияОТекущемПользователе", Новый Структура("Параметр", param), ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  "API.СБИС_ПолучитьИнформациюОТекущемПользователе");
	КонецЕсли;
	Возврат Результат;
КонецФункции   

&НаКлиенте
Функция СБИС_ПолучитьСписокАккаунтов(Кэш, param, ДопПараметры, Отказ) Экспорт
	ДопПараметры.Вставить("АдресРесурса", "auth/service/?srv=1"); 
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "СБИС.СписокАккаунтов", param, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  "API.СБИС_ПолучитьСписокАккаунтов");
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СБИС_ПереключитьАккаунт(Кэш, param, ДопПараметры, Отказ) Экспорт
	ДопПараметры.Вставить("АдресРесурса", "auth/service/?srv=1");
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "СБИС.ПереключитьАккаунт", Новый Структура("Параметр", param), ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  "API.СБИС_ПереключитьАккаунт");
	КонецЕсли;
	Возврат Результат;
КонецФункции

