
// Процедура обновляет информацию по вложению (просмотр, прохождение, сопоставление номенклатуры) при переключении между вложениями в таблице
&НаКлиенте
Процедура ТаблицаДокументовПриАктивизацииЯчейки(Элемент)

	//Если нет выбранного вложения, или оно уже установлено.
	Если	Элемент.ТекущиеДанные = Неопределено
		Или	(	ПараметрыРаботы.Свойство("ТекущийИдентификатор")
			И	ПараметрыРаботы.ТекущийИдентификатор = Элемент.ТекущиеДанные.Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРаботы.Вставить("ТекущийИдентификатор", Элемент.ТекущиеДанные.Идентификатор);
	
	Если Элемент.ТекущиеДанные.Вложение.Количество() Тогда
		
		Вложение = Элемент.ТекущиеДанные.Вложение[0].Значение;
		ОбновитьПоляФормыПоВложениюСБИС(Вложение);
		
	КонецЕсли;
	
	Если НЕ МодульОбъектаКлиент().ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры") Тогда	
		Возврат;
	ИначеЕсли НЕ (Вложение.Свойство("КлассыСопоставленияНоменклатур") 
				  И Вложение.КлассыСопоставленияНоменклатур.Количество()) Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧастьЗаписатьСопоставлениеНоменклатуры").Доступность = Ложь;
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧастьОткрытьФормуСопоставления").Доступность = Ложь;
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧастьСоздатьСопоставитьНоменклатуруВ1С").Доступность = Ложь;
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ОтметитьВсе").Доступность = Ложь;
		ОбновитьСтатусыСопоставления();
	Иначе
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧастьОткрытьФормуСопоставления").Доступность = Истина;
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧастьСоздатьСопоставитьНоменклатуруВ1С").Доступность = Истина;
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ОтметитьВсе").Доступность = Истина;
		ОбновитьСтатусыСопоставления();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если		Поле = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаДокументов.Документы1СНазвания") Тогда
		
		ПараметрыОткрыть = Новый ФиксированнаяСтруктура("СписокСсылок", Элемент.ТекущиеДанные.Документы1С);
		МодульОбъектаКлиент().СбисОткрытьДокументы(ПараметрыОткрыть);
		
	ИначеЕсли	Поле = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаДокументов.Удалить")  Тогда
		
		УдалитьВложение("");
		
	КонецЕсли;
	
КонецПроцедуры

