
// Процедура обновляет информацию по вложению (просмотр, прохождение, сопоставление номенклатуры) при переключении между вложениями в таблице
&НаКлиенте
Процедура ТаблицаДокументовПриАктивизацииЯчейки(Элемент)

	//Если нет выбранного вложения, или оно уже установлено.
	Если	Элемент.ТекущиеДанные = Неопределено
		Или	(	ПараметрыРаботы.Свойство("ТекущийИдентификатор")
			И	ПараметрыРаботы.ТекущийИдентификатор = Элемент.ТекущиеДанные.Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРаботы.Вставить("ТекущийИдентификатор", Элемент.ТекущиеДанные.Идентификатор);
	
	Если Элемент.ТекущиеДанные.Вложение.Количество() Тогда
		
		Вложение = Элемент.ТекущиеДанные.Вложение[0].Значение;
		ОбновитьПоляФормыПоВложениюСБИС(Вложение);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущийРаздел = МестныйКэш.Разделы["р"+МестныйКэш.Текущий.Раздел];
	Если		Поле = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаДокументов.Документы1СНазвания") Тогда
		
		ПараметрыОткрыть = Новый ФиксированнаяСтруктура("СписокСсылок", Элемент.ТекущиеДанные.Документы1С);
		МодульОбъектаКлиент().СбисОткрытьДокументы(ПараметрыОткрыть);
		
	ИначеЕсли	Поле = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаДокументов.Удалить")  Тогда
		
		УдалитьВложение("");
		
	ИначеЕсли Поле = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаДокументов.Статус")
		И МодульОбъектаКлиент().ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры_ОбратноеСопоставление")
		И ТекущийРаздел = "Продажа" Тогда
		ФормаОбратногоСопоставления = МодульОбъектаКлиент().ПолучитьФормуОбработки(Вложение.Параметры.ФормаСопоставленияНоменклатуры);
		ЗаголовокФормы = "Сопоставление номенклатуры по документу " + Вложение.Параметры.ДокументДляСопоставления.Название 
		+ " №" + Вложение.Параметры.ДокументДляСопоставления.Номер + " от " + Вложение.Параметры.ДокументДляСопоставления.Дата;
		
		ПараметрыСопоставления = Новый Структура();
		ПараметрыСопоставления.Вставить("ДокументДанные",			Неопределено);
		ПараметрыСопоставления.Вставить("ЗаголовокФормы",			ЗаголовокФормы);
		ПараметрыСопоставления.Вставить("ИдентификаторДокумента",	МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "Идентификатор"));
		ПараметрыСопоставления.Вставить("Вложение",					Вложение);
		ПараметрыСопоставления.Вставить("ТребуетсяЗаписьВРасхождение",   Ложь);
		ПараметрыСопоставления.Вставить("Контрагент", МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "Контрагент"));
		ПараметрыСопоставления.Вставить("ПараметрыРасхождения",     Неопределено);
		
		ДопПараметрыОповещения = Новый Структура("ПризнакОбновления, СоставПакета", "ПеречитатьВизуализацию", СоставПакета);
		ОбработчикПосле =  МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПослеОбратногоСопоставления", МодульОбъектаКлиент(), ДопПараметрыОповещения);;
		ФормаОбратногоСопоставления.ОписаниеОповещенияОЗакрытии = ОбработчикПосле;
		ФормаОбратногоСопоставления.Показать(ПараметрыСопоставления);
		
		ОбновитьПоляФормыПоВложениюСБИС(Вложение);
		
		Возврат;

	КонецЕсли;
	
КонецПроцедуры

