
&НаКлиенте
Функция СтруктураРазделаГО_ДополнительныеПоляФильтра(СтруктураРазделаГО, ИсточникДанных)
	
	Если СтруктураРазделаГО.ФормаПользовательскогоФильтра = Ложь Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
		
	Попытка
		
		// Есть ли пользовательские параметры фильтра, которые так же надо обновить
		// Берется от раздела, а переданная форма выступает исключительно как источик данных
		СписокДопПараметрыФильтра = СтруктураРазделаГО.ФормаПользовательскогоФильтра.сбисСписокДопПараметровФильтра();
		
	Исключение
		
		СписокДопПараметрыФильтра = Неопределено; 
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	ДопПараметрыФильтра = Новый Структура;
	Для Каждого ДопПараметрФильтра Из СписокДопПараметрыФильтра Цикл 
		
		//Если Не НРег(Лев(ДопПараметрФильтра.Значение, 6)) = "фильтр" Тогда
		//	
		//	Продолжить;
		//	
		//КонецЕсли;
		
		ЗначениеФильтра = "";
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			ЭлементФильтра = ПолучитьЭлементФормыОбработки(ИсточникДанных, ДопПараметрФильтра.Значение);
			Если ЭлементФильтра = Неопределено Тогда
				
				// Элемент не преносился и форма фильтра открывается как сама по себе, а не панель
				ЭлементФильтра = ПолучитьЭлементФормыОбработки(СтруктураРазделаГО.ФормаПользовательскогоФильтра, ДопПараметрФильтра.Значение);
				
			КонецЕсли;
			
			ЗначениеФильтра = ЭлементФильтра.Значение;
			
		#Иначе
			
			ЗначениеФильтра = ИсточникДанных[ДопПараметрФильтра.Значение];
			
		#КонецЕсли
		
		ДопПараметрыФильтра.Вставить(ДопПараметрФильтра.Значение, ЗначениеФильтра);
		
	КонецЦикла;
	
	Возврат ДопПараметрыФильтра;
	
КонецФункции
	
// Функция - восстанавливает текущий фильтр раздела, с учетом сохраненных параметров
//
// Параметры:
//  СтруктураРазделаГО	 - СтруктураРазделаГО	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Функция СтруктураРазделаГО_ТекущийФильтр(СтруктураРазделаГО, ДополнительныйФильтр = Неопределено)
	Перем ФильтрРезультат;
	
	Если Не ЗначениеЗаполнено(СтруктураРазделаГО.ОписаниеРаздела.Имя) Тогда 
		
		Возврат ФильтрРезультат;
		
	КонецЕсли;
	
	СохраненныеФильтры	= ПолучитьЗначениеПараметраСбис("ФильтрыПоРазделам");
	КлючФильтраРаздел	= СтруктураРазделаГО.ОписаниеРаздела.Имя;
	Если СтруктураРазделаГО.ОписаниеРаздела.Ини = Неопределено Тогда
		
		КлючФильтраПодраздел	= КлючФильтраРаздел + "_" + СтруктураРазделаГО.ТипДок;
		
	Иначе
		
		КлючФильтраПодраздел	= КлючФильтраРаздел + "_" + СтруктураРазделаГО.ОписаниеРаздела.Ини;
		
	КонецЕсли;	
	
	Если	Не	СохраненныеФильтры.Свойство(КлючФильтраПодраздел,	ФильтрРезультат)
		И	Не	СохраненныеФильтры.Свойство(КлючФильтраРаздел,		ФильтрРезультат)
		Или	Не	ЗначениеЗаполнено(ФильтрРезультат) Тогда
		
		ФильтрРезультат = СтруктураРазделаГО_Получить(СтруктураРазделаГО, "ПустойФильтр");
		
	Иначе
		
		// Обновить даты для фильтров за периоды.
		ФрмФильтр			= ПолучитьФормуОбработки("ФормаУстановкиФильтра");
		ПараметрыДляФильтра	= ФрмФильтр.ЗначенияДляФильтрПериод(ФильтрРезультат);
		ЗаполнитьЗначенияСвойств(ФильтрРезультат, ПараметрыДляФильтра);
			
	КонецЕсли;
	
	Возврат ФильтрРезультат;
	
КонецФункции

// Функция - формирует представление фильтра для панели
//
// Параметры:
//  СтруктураРазделаГО	 - СтруктураРазделаГО	 - Структура
//  ДополнительныйФильтр - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Функция СтруктураРазделаГО_ПредставлениеФильтра(СтруктураРазделаГО, ДопФПараметры = Неопределено)
	Перем ФильтрРезультат, ЗначениеПроверка;

	ФильтрДанные = СтруктураРазделаГО.Фильтр;
	
	Если ФильтрДанные = Неопределено Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Если Не ФильтрДанные.Свойство("ФильтрПериод", ЗначениеПроверка)
		Или	ЗначениеПроверка = Неопределено
		Или	ЗначениеПроверка = "За весь период" Тогда
		
		// Нет периода, или не указываем
		ФильтрРезультат	= "";
		
	ИначеЕсли ЗначениеПроверка = "За период" Тогда
		
		// Сюда код который делает строку как онлайне
		ФильтрРезультат = _СтруктураРазделаГО_ФильтрПериодПрописью(ФильтрДанные.ФильтрДатаНач, ФильтрДанные.ФильтрДатаКнц);
		
	Иначе
		
		ФильтрРезультат = ЗначениеПроверка;
		
	КонецЕсли;
	
	Если	ФильтрДанные.Свойство("ФильтрТипыДокументов", ЗначениеПроверка)
		И	ЗначениеЗаполнено(ЗначениеПроверка)
		И 	(	СтруктураРазделаГО.ТипДок = "Отправленные"
			Или СтруктураРазделаГО.ТипДок = "Полученные") тогда 
			
		// Фильтр заполнен и в этом разделе будет действовать
		СписокТипДок = "";
		Для Каждого ТипДок Из ЗначениеПроверка Цикл
			
			СписокТипДок = СписокТипДок + ТипДок.Представление + ",";
			
		КонецЦикла;
		ФильтрРезультат = ФильтрРезультат + ", " + Лев(СписокТипДок,СтрДлина(СписокТипДок) - 1);
		
	КонецЕсли; 
	
	НаборПроверки = 
	"ФильтрКонтрагент
	|ФильтрОрганизация
	|ФильтрОтветственный
	|ФильтрКонтрагентПодключен
	|ФильтрМаска";
	
	Для НомерСтроки = 1 По СтрЧислоСтрок(НаборПроверки) Цикл
		
		Если	ФильтрДанные.Свойство(СтрПолучитьСтроку(НаборПроверки, НомерСтроки), ЗначениеПроверка)
			И	ЗначениеЗаполнено(ЗначениеПроверка) Тогда
			
			ФильтрРезультат = ФильтрРезультат + ", " + ЗначениеПроверка;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если	ФильтрДанные.Свойство("ФильтрСостояние", ЗначениеПроверка)
		И	Не ЗначениеПроверка = "Все документы" Тогда
		
		ФильтрРезультат = ФильтрРезультат + ", " + ЗначениеПроверка;
		
	КонецЕсли;
	
	//Добавим дополнительные параметры фильтра для текущего раздела
	Если Не ЗначениеЗаполнено(СтруктураРазделаГО.ОписаниеРаздела.Номер) Тогда
		
		Возврат ФильтрРезультат;
		
	КонецЕсли;
	
	ФормаДопФильтра	= СтруктураРазделаГО.ФормаПользовательскогоФильтра;
    Кэш				= ПолучитьТекущийЛокальныйКэш();
	
	Если Не ФормаДопФильтра = Ложь
		И	ФильтрДанные.Свойство("ПараметрыФильтра", ЗначениеПроверка) Тогда
		
		СписокДопЭлементов = ФормаДопФильтра.сбисСписокДопПараметровФильтра();
		Для Каждого Элемент Из СписокДопЭлементов Цикл
			
			Если	ЗначениеПроверка.Свойство(Элемент.Значение)
				И	ЗначениеЗаполнено(ЗначениеПроверка[Элемент.Значение]) Тогда
				
				ФильтрРезультат = ФильтрРезультат + ", " + Строка(ЗначениеПроверка[Элемент.Значение]);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Лев(ФильтрРезультат, 2) = ", " Тогда
		
		ФильтрРезультат = Сред(ФильтрРезультат, 3);
		
	КонецЕсли;
	
	Возврат ФильтрРезультат;

КонецФункции

&НаКлиенте
Процедура СтруктураРазделаГО_УстановитьМодули(СтруктураРазделаГО) 

	Если ЗначениеЗаполнено(СтруктураРазделаГО.ОписаниеРаздела.Имя) Тогда
		
		СтруктураРазделаГО.ОписаниеРаздела.Вставить("ФормыРаздела", Новый Массив);
		СтруктураРазделаГО.ОписаниеРаздела.Вставить("ФормыФильтра", Новый Массив);
		
		Если ЗначениеЗаполнено(СтруктураРазделаГО.ОписаниеРаздела.Ини) Тогда
			
			ШаблонФормы	= СтруктураРазделаГО.ОписаниеРаздела.Имя + "_" + СтруктураРазделаГО.ОписаниеРаздела.Ини;
			СтруктураРазделаГО.ОписаниеРаздела.ФормыРаздела.Добавить("Раздел_"			+ ШаблонФормы);
			СтруктураРазделаГО.ОписаниеРаздела.ФормыФильтра.Добавить("Фильтр_Раздел_"	+ ШаблонФормы);
			
		Иначе
			
			ШаблонФормы	= СтруктураРазделаГО.ОписаниеРаздела.Имя + "_" + СтруктураРазделаГО.ТипДок;
			СтруктураРазделаГО.ОписаниеРаздела.ФормыРаздела.Добавить("Раздел_"			+ ШаблонФормы);
			СтруктураРазделаГО.ОписаниеРаздела.ФормыФильтра.Добавить("Фильтр_Раздел_"	+ ШаблонФормы);
			
		КонецЕсли;
		ШаблонФормы	= СтруктураРазделаГО.ОписаниеРаздела.Имя + "_Шаблон";
		СтруктураРазделаГО.ОписаниеРаздела.ФормыРаздела.Добавить("Раздел_"			+ ШаблонФормы);
		СтруктураРазделаГО.ОписаниеРаздела.ФормыФильтра.Добавить("Фильтр_Раздел_"	+ ШаблонФормы);
		
		// Костыль для совместимости на всякий случай. Спилить 25.2100
		СтруктураРазделаГО.Вставить("ФормыРаздела", СтруктураРазделаГО.ОписаниеРаздела.ФормыРаздела);
		
		Попытка
			
			фрм = НайтиФункциюСеансаОбработки("ОбновитьКонтент", СтруктураРазделаГО.ОписаниеРаздела.ФормыРаздела);
			
		Исключение
			
			СообщитьСбисИсключение(ИнформацияОбОшибке(), Новый Структура("ИмяКоманды", "МодульОбъектаКлиент.НовыйСтруктураРазделаГО_ПоДанным"));	
			
		КонецПопытки;
		
		Попытка
			
			ФормаДопФильтра	= НайтиФункциюСеансаОбработки("сбисСписокДопПараметровФильтра", СтруктураРазделаГО.ОписаниеРаздела.ФормыФильтра);
			
		Исключение
			
			СообщитьСбисИсключение(ИнформацияОбОшибке(), Новый Структура("ИмяКоманды", "МодульОбъектаКлиент.НовыйСтруктураРазделаГО_ПоДанным"));	
			
		КонецПопытки;

		СтруктураРазделаГО.Вставить("ФормаПользовательскогоФильтра",	ФормаДопФильтра);
		СтруктураРазделаГО.Вставить("Форма",							фрм);
		
	Иначе
		
		СтруктураРазделаГО.Вставить("Форма", Ложь);
		
	КонецЕсли;

КонецПроцедуры

//Функция формирует период прописью	
&НаКлиенте
Функция _СтруктураРазделаГО_ФильтрПериодПрописью(ДатНач, ДатКнц)
	
	Если Не Год(ДатНач) = Год(ДатКнц) Тогда
		
		Возврат Формат(ДатНач, "ДФ=""д ММММ гггг""") + " - " + Формат(ДатКнц, "ДФ=""д ММММ гггг""");
		
	КонецЕсли;
		
	Если Не Месяц(ДатНач) = Месяц(ДатКнц) Тогда
		
		Возврат Формат(ДатНач, "ДФ=""д ММММ""") + " - " + Формат(ДатКнц, "ДФ=""д ММММ""") + " " + Формат(Год(ДатКнц),"ЧГ=0");
		
	КонецЕсли;
		
	Если ДатНач = ДатКнц Тогда
		
		Возврат Формат(ДатКнц, "ДФ=""д ММММ гггг""");
		
	КонецЕсли;
		
	Возврат строка(День(ДатНач)) + " - " + Формат(ДатКнц, "ДФ=""д ММММ""") + " "+ Формат(Год(ДатКнц), "ЧГ=0");
	
КонецФункции

&НаКлиенте
Функция _СтруктураРазделаГО_ЗначениеПользовательскогоФильтраПоУмолчанию(ФормаДопФильтра, КлючДопФильтра)
	
	Попытка
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
		
			// Получить элемент формы и от него взять значение 
			ДопЭлемент_Элемент = ПолучитьЭлементФормыОбработки(ФормаДопФильтра, КлючДопФильтра);
			Если ДопЭлемент_Элемент = Неопределено Тогда
				
				// Если элемента нет на форме, то он должен быть на ГО, на панели фильтра
				ДопЭлемент_Элемент	= ПолучитьЭлементФормыОбработки(ГлавноеОкно, КлючДопФильтра);
				
			КонецЕсли;	
			
			ДопЭлемент_Тип = ТипЗнч(ДопЭлемент_Элемент);
								
			Если Не	(	ДопЭлемент_Тип = Тип("ПолеВвода")
					Или	ДопЭлемент_Тип = Тип("ПолеВыбора")
					Или	ДопЭлемент_Тип = Тип("Флажок")) Тогда
					
				// Это надпись, картинка или что-то, чего не знаем
				Возврат Неопределено;
				
			КонецЕсли;
				
			ДопЭлемент_Значение = ДопЭлемент_Элемент.Значение;
		
		#Иначе
			
			// Просто взять значение от потльзовательской формы
			ДопЭлемент_Значение = ФормаДопФильтра[КлючДопФильтра];
			
		#КонецЕсли
		
	Исключение
		
		ОшибкаПОдбораЭлемента = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент._СтруктураРазделаГО_ЗначениеПользовательскогоФильтраПоУмолчанию");
		ВызватьИсключение СбисИсключение_Представление(ОшибкаПОдбораЭлемента);

	КонецПопытки;
	
		
	ДопЭлемент_Значение_Тип	= ТипЗнч(ДопЭлемент_Значение);
	Если		ДопЭлемент_Значение_Тип = Тип("Дата") Тогда
		
		ПараметрФильтра = '0001.01.01';
		
	ИначеЕсли	ДопЭлемент_Значение_Тип = Тип("Число") Тогда
		
		ПараметрФильтра = 0;
		
	ИначеЕсли	ДопЭлемент_Значение_Тип = Тип("Булево") Тогда
		
		ПараметрФильтра = Ложь;
		
	ИначеЕсли	ДопЭлемент_Значение_Тип = Тип("СписокЗначений") Тогда
		
		ПараметрФильтра = Новый СписокЗначений;
		//Ограничение типа тоже перенести.
		ПараметрФильтра.ТипЗначения = ДопЭлемент_Значение.ТипЗначения;
		
	Иначе
		
		ОписаниеТиповСписок = Новый Массив;
		ОписаниеТиповСписок.Добавить(ДопЭлемент_Значение_Тип);
		ОписаниеТипаЭлемент	= Новый ОписаниеТипов(ОписаниеТиповСписок);
		ПараметрФильтра = ОписаниеТипаЭлемент.ПривестиЗначение();
		
	КонецЕсли;
	
	Возврат ПараметрФильтра;

КонецФункции

// Функция - возвращает Соответствие разделов главного окна
// 
// Возвращаемое значение:
//  Соответствие - номер раздела - его название
//
&НаКлиенте
Функция _СтруктураРазделаГО_СоответствиеРазделовГО()
	Перем РазделыГОСБИС;
	
	Если Не ГлобальныйКэш.ТекущийСеанс.Интерфейс.Свойство("РазделыАккордеона", РазделыГОСБИС) Тогда
		
		РазделыГОСБИС = Новый Соответствие;
		РазделыГОСБИС.Вставить("1",	"Полученные");
		РазделыГОСБИС.Вставить("2",	"Отправленные");
		РазделыГОСБИС.Вставить("3",	"Продажа");
		РазделыГОСБИС.Вставить("4",	"Покупка");
		РазделыГОСБИС.Вставить("5",	"Настройки");
		РазделыГОСБИС.Вставить("6",	"Справочники");
		РазделыГОСБИС.Вставить("7",	"Учет");
		РазделыГОСБИС.Вставить("8",	"Задачи");
		РазделыГОСБИС.Вставить("9",	"Отчетность");

		РазделыГОСБИС.Вставить("Полученные",	"1");
		РазделыГОСБИС.Вставить("Отправленные",	"2");
		РазделыГОСБИС.Вставить("Продажа",		"3");
		РазделыГОСБИС.Вставить("Покупка",		"4");
		РазделыГОСБИС.Вставить("Настройки",		"5");
		РазделыГОСБИС.Вставить("Справочники",	"6");
		РазделыГОСБИС.Вставить("Учет",			"7");
		РазделыГОСБИС.Вставить("Задачи",		"8");
		РазделыГОСБИС.Вставить("Отчетность",	"9");
		
		ГлобальныйКэш.ТекущийСеанс.Интерфейс.Вставить("РазделыАккордеона", РазделыГОСБИС);
	КонецЕсли;
	
	Возврат РазделыГОСБИС;
	
КонецФункции

// Функция - переводит номер раздела в название и наоборот
//
// Параметры:
//  НомерНазваниеВыбранногоРаздела	 - Строка	 - Номер, либо название раздела.
// 
// Возвращаемое значение:
//  Строка - Номер, или название раздела соответствующее аргументу.
//
&НаКлиенте
Функция _СтруктураРазделаГО_НазваниеНомерРазделаПоСоответствию(НомерНазваниеВыбранногоРаздела)

	Возврат _СтруктураРазделаГО_СоответствиеРазделовГО().Получить(Строка(НомерНазваниеВыбранногоРаздела));
	
КонецФункции

&НаКлиенте
Функция _СтруктураРазделаГО_Пустой()
	
	Возврат Новый Структура("_класс, ПредыдущийРаздел, ОписаниеРаздела, Имя, Раздел, ТекущийРаздел, ТипДок, Фильтр", "СтруктураРазделаГО");
	
КонецФункции

