
&НаКлиенте
Процедура СтруктураРазделаГО_Вставить(СтруктураРазделаГО, КлючЗначенияВставить, ЗначениеВставить) Экспорт 

	Если КлючЗначенияВставить = "ПредыдущийРаздел" Тогда
		
		Если Не ЭтоТипСбис(ЗначениеВставить, "СтруктураРазделаГО") Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ЗначениеВставить.ПредыдущийРаздел	= Неопределено;
		СтруктураРазделаГО.ПредыдущийРаздел = НовыйСтруктураРазделаГО_ПоДанным(ЗначениеВставить);
		СтруктураРазделаГО_УстановитьМодули(СтруктураРазделаГО.ПредыдущийРаздел);
		
	Иначе
		
		СтруктураРазделаГО[КлючЗначенияВставить] = ЗначениеВставить;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураРазделаГО_Получить(СтруктураРазделаГО, КлючЗначенияПолучить, ДопПараметры = Неопределено) Экспорт 
	Перем ПараметрПоиск;
	
	Если КлючЗначенияПолучить = "Название" Тогда
		
		Возврат СтруктураРазделаГО.ОписаниеРаздела.Имя;
		
	ИначеЕсли КлючЗначенияПолучить = "Тип" Тогда
		
		Возврат СтруктураРазделаГО.ТипДок;
		
	ИначеЕсли КлючЗначенияПолучить = "ИмяИни" Тогда
		
		Если		ЗначениеЗаполнено(СтруктураРазделаГО.ОписаниеРаздела.Ини)
			Или	Не	ЗначениеЗаполнено(СтруктураРазделаГО.Имя) Тогда
			
			Возврат СтруктураРазделаГО.ОписаниеРаздела.Ини;
			
		КонецЕсли;
		
		Для Каждого КлючИЗначение Из ПолучитьЗначениеПараметраТекущегоСеанса("СтруктураРазделов") Цикл
			
			Если	Не	(	КлючИЗначение.Ключ = "Покупка"
						Или	КлючИЗначение.Ключ = "Продажа"
						Или	КлючИЗначение.Ключ = "Справочники") Тогда
						
				Продолжить;
				
			КонецЕсли;
			
			Если КлючИЗначение.Значение.Свойство(СтруктураРазделаГО.Имя, ПараметрПоиск) Тогда
				
				Прервать;
				
			КонецЕсли;

		КонецЦикла;
		
		СтруктураРазделаГО.ОписаниеРаздела.Ини = ПараметрПоиск;

		Возврат СтруктураРазделаГО.ОписаниеРаздела.Ини;
		
	ИначеЕсли КлючЗначенияПолучить = "ТекущийФильтр" Тогда
		
		Возврат СтруктураРазделаГО_ТекущийФильтр(СтруктураРазделаГО, ДопПараметры);

	ИначеЕсли КлючЗначенияПолучить = "ПустойФильтр" Тогда
	
		// Сделать фильтр по-умолчанию.
		ФрмФильтр = НайтиФункциюСеансаОбработки("ЗначенияДляФильтрПоУмолчанию", СтруктураРазделаГО.ОписаниеРаздела.ФормыРаздела);
		
		Если ФрмФильтр = Ложь Тогда
			
			ФрмФильтр = ПолучитьФормуОбработки("ФормаУстановкиФильтра");
			
		КонецЕсли;
		
		ПустойФильтр = ФрмФильтр.ЗначенияДляФильтрПоУмолчанию(СтруктураРазделаГО);
		Возврат ПустойФильтр;

	ИначеЕсли КлючЗначенияПолучить = "ПредставлениеФильтра" Тогда
		
		Попытка
			
			Возврат СтруктураРазделаГО_ПредставлениеФильтра(СтруктураРазделаГО);
			
		Исключение
			
			Возврат ""
			
		КонецПопытки;
		
	Иначе	
		
		Возврат СтруктураРазделаГО[КлючЗначенияПолучить];
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СтруктураРазделаГО_Подготовить(СтруктураРазделаГО) Экспорт 

	Кэш = ПолучитьТекущийЛокальныйКэш();
	СтруктураРазделаГО.Форма.НаСменуРаздела(Кэш);
	СтруктураРазделаГО.Форма.НастроитьКолонки(Кэш);
	СтруктураРазделаГО.Форма.НавигацияУстановитьПанель(Кэш);

КонецПроцедуры

// Функция - проверка заполненности класса
//
// Параметры:
//  СтруктураРазделаГО	 - СтруктураРазделаГО	 - 
// 
// Возвращаемое значение:
//  Булево - пустой (есть возможность перехода) ли раздел, или нет
//
&НаКлиенте
Функция СтруктураРазделаГО_Пустой(СтруктураРазделаГО) Экспорт 
	
	Возврат Не	ЗначениеЗаполнено(СтруктураРазделаГО)
		Или	Не	ЗначениеЗаполнено(СтруктураРазделаГО.Имя)
		Или		СтруктураРазделаГО.Форма = Ложь;
	
КонецФункции

// Функция - сохраняет установленный на разделе фильтр
//
// Параметры:
//  СтруктураРазделаГО	 - СтруктураРазделаГО	 - Структура раздела главного окна
//  ДопПараметры		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Процедура СтруктураРазделаГО_СохранитьФильтр(СтруктураРазделаГО, ДопПараметры = Неопределено) Экспорт 
	Перем ЗначениеДляФильтрОбновить;
	
	Если СтруктураРазделаГО_Пустой(СтруктураРазделаГО) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СохраненныеФильтры	= ПолучитьЗначениеПараметраСбис("ФильтрыПоРазделам");
	КлючФильтраРаздел	= СтруктураРазделаГО.ОписаниеРаздела.Имя;
	Если СтруктураРазделаГО.ОписаниеРаздела.Ини = Неопределено Тогда
		
		КлючФильтраПодраздел	= КлючФильтраРаздел + "_" + СтруктураРазделаГО.ТипДок;
		
	Иначе
		
		КлючФильтраПодраздел	= КлючФильтраРаздел + "_" + СтруктураРазделаГО.ОписаниеРаздела.Ини;
		
	КонецЕсли;
	
	Если	Не СохраненныеФильтры.Свойство(КлючФильтраПодраздел,	ЗначениеДляФильтрОбновить)
		И	Не СохраненныеФильтры.Свойство(КлючФильтраРаздел,		ЗначениеДляФильтрОбновить) Тогда
		
		ЗначениеДляФильтрОбновить = Новый Структура;
		СохраненныеФильтры.Вставить(КлючФильтраРаздел, ЗначениеДляФильтрОбновить);
		
	КонецЕсли;
	
	// Объединить фильтры. Переделать на ОбъединитьОбъектыУниверсальныхКоллекций
	Для Каждого КлючИЗначениеФильтра Из СтруктураРазделаГО.Фильтр Цикл
		
		Если КлючИЗначениеФильтра.Ключ = "ПараметрыФильтра" Тогда
			
			Если Не ЗначениеДляФильтрОбновить.Свойство("ПараметрыФильтра") Тогда
				
				ЗначениеДляФильтрОбновить.Вставить("ПараметрыФильтра", Новый Структура);
				
			КонецЕсли;
			
			Для Каждого КлючИЗначениеФильтраДоп Из КлючИЗначениеФильтра.Значение Цикл
				
				ЗначениеДляФильтрОбновить.ПараметрыФильтра.Вставить(КлючИЗначениеФильтраДоп.Ключ, КлючИЗначениеФильтраДоп.Значение);
				
			КонецЦикла;	
			
		КонецЕсли;
		
		ЗначениеДляФильтрОбновить.Вставить(КлючИЗначениеФильтра.Ключ, КлючИЗначениеФильтра.Значение);
		
	КонецЦикла;
	
	ИзменитьПараметрСбис("ФильтрыПоРазделам", СохраненныеФильтры);
	
КонецПроцедуры

// Процедура - вызывает обработчики для фильтра
//
// Параметры:
//  СтруктураРазделаГО	 - СтрукутраРазделаГО	 - структура с описанием раздела
//  СтруктураФильтра	 - Структура			 - обрабатываемый фильтр. Не берётся от класса для возможности обработки и заполнения нового фильтра
//
&НаКлиенте
Процедура СтруктураРазделаГО_ОбработчикиФильтра(СтруктураРазделаГО, СтруктураФильтра) Экспорт

	Кэш				= ПолучитьТекущийЛокальныйКэш(); 
	МодульТекущий	= МодульОбъектаКлиент();
	ИниКонфигурация	= МодульТекущий.ИниПоПараметрам("Конфигурация");// Пока прямое обращение к ини конфигурации.
	
	Если Не СтруктураРазделаГО.ФормаПользовательскогоФильтра = Ложь Тогда
		
		ФормаДопФильтра		= СтруктураРазделаГО.ФормаПользовательскогоФильтра;
		ДопПоляФильтра		= Новый Структура;
		СписокДопФильтров	= ФормаДопФильтра.сбисСписокДопПараметровФильтра();
		Для Каждого ДопПоле Из СписокДопФильтров Цикл
			
			Попытка
				
				ДопПоле_Значение = _СтруктураРазделаГО_ЗначениеПользовательскогоФильтраПоУмолчанию(ФормаДопФильтра, ДопПоле.Значение);
				ДопПоляФильтра.Вставить(ДопПоле.Значение, ДопПоле_Значение);
				
			Исключение
					
				ОшибкаОбработкиФильтра = НовыйСбисИсключение(ИнформацияОбОшибке(), "ОбщиеФункции.СтруктураРазделаГО_ОбработчикиФильтра");
				СбисСообщить(ОшибкаОбработкиФильтра);
					
			КонецПопытки;
 			
		КонецЦикла;
		
		СтруктураФильтра.Вставить("ПараметрыФильтра", ДопПоляФильтра);
		
		СтруктураРазделаГО.ОписаниеРаздела.Вставить("ПользовательскиеПоляФильтра", СписокДопФильтров.ВыгрузитьЗначения())
		
	КонецЕсли;
	
	// Поддержка костылей с фильтрами по-умолчанию
	Если	ИниКонфигурация.Свойство("ФильтрПоУмолчанию")
		И	ИниКонфигурация.ФильтрПоУмолчанию.Свойство(СтруктураРазделаГО.ТипДок) Тогда 
				
		Попытка
			
			Ини = Кэш.ОбщиеФункции.ПолучитьДанныеДокумента1С(ИниКонфигурация[СтруктураРазделаГО.ТипДок], Неопределено, Кэш.КэшЗначенийИни, Кэш.Парам);
			Для Каждого Элем Из Ини Цикл 
				
				Если НРег(Лев(Элем.Ключ, 6)) = "фильтр" Тогда
					
					СтруктураФильтра.Вставить(Элем.Ключ, Элем.Значение);
					
				КонецЕсли;
				
			КонецЦикла;
			
		Исключение
			
			ОшибкаОбработкиФильтра = НовыйСбисИсключение(ИнформацияОбОшибке(), "ОбщиеФункции.ПолучитьДанныеДокумента1С");
			СбисСообщить(ОшибкаОбработкиФильтра);
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция - обновляет установленный на разделе фильтр по переданным данным
//
// Параметры:
//  СтруктураРазделаГО		 - СтруктураРазделаГО	 - Структура раздела главного окна
//	ЗначениеФильтраОбновить	 - Произвольный			 - Источник дял обновления фильтра
//  ДопПараметры			 - Неопределено			 - расширение
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Процедура СтруктураРазделаГО_ОбновитьФильтр(СтруктураРазделаГО, ЗначениеФильтраОбновить, ДопПараметры = Неопределено) Экспорт 
 	Перем ДопПараметрыФильтра;

	Если ЗначениеФильтраОбновить = Неопределено Тогда
		
		Возврат;
		
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	
	ИначеЕсли ТипЗнч(ЗначениеФильтраОбновить) = Тип("Форма") Тогда
		
		ДопПараметрыФильтра = СтруктураРазделаГО_ДополнительныеПоляФильтра(СтруктураРазделаГО, ЗначениеФильтраОбновить);
		
	#Иначе
		
	ИначеЕсли ТипЗнч(ЗначениеФильтраОбновить) = Тип("УправляемаяФорма") Тогда
		
		ДопПараметрыФильтра = СтруктураРазделаГО_ДополнительныеПоляФильтра(СтруктураРазделаГО, ЗначениеФильтраОбновить);
		
	#КонецЕсли

	КонецЕсли;

	Если ДопПараметрыФильтра = Неопределено Тогда
		
		СтруктураРазделаГО.Фильтр.Удалить("ПараметрыФильтра");
		
	Иначе
		
		СтруктураРазделаГО.Фильтр.Вставить("ПараметрыФильтра", ДопПараметрыФильтра); 
	
	КонецЕсли;

	// Заполнить поля фильтра по входящим данным
	ЗаполнитьЗначенияСвойств(СтруктураРазделаГО.Фильтр, ЗначениеФильтраОбновить);	
	
КонецПроцедуры

