
&НаКлиенте
Процедура РазделГО_Вставить(РазделГО, КлючЗначенияВставить, ЗначениеВставить) Экспорт 

	Если КлючЗначенияВставить = "ПредыдущийРаздел" Тогда
		
		Если Не ЭтоТипСбис(ЗначениеВставить, "РазделГО") Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ЗначениеВставить.ПредыдущийРаздел	= Неопределено;
		РазделГО.ПредыдущийРаздел = НовыйРазделГО_ПоДанным(ЗначениеВставить);
		// Сохранить некоторые параметры
		РазделГО.ПредыдущийРаздел.ПараметрыФильтра = ЗначениеВставить.ПараметрыФильтра;
		яРазделГО_УстановитьМодули(РазделГО.ПредыдущийРаздел);
		
	Иначе
		
		РазделГО[КлючЗначенияВставить] = ЗначениеВставить;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция РазделГО_Получить(РазделГО, КлючЗначенияПолучить, ДопПараметры = Неопределено) Экспорт 
	Перем ПараметрПоиск;
	
	Если КлючЗначенияПолучить = "Название" Тогда
		
		Возврат РазделГО.ОписаниеРаздела.Имя;
		
	ИначеЕсли КлючЗначенияПолучить = "Тип" Тогда
		
		Возврат РазделГО.ТипДок;
		
	ИначеЕсли КлючЗначенияПолучить = "ИмяИни" Тогда
		
		Если		ЗначениеЗаполнено(РазделГО.ОписаниеРаздела.Ини)
			Или	Не	ЗначениеЗаполнено(РазделГО.Имя) Тогда
			
			Возврат РазделГО.ОписаниеРаздела.Ини;
			
		КонецЕсли;
		
		Для Каждого КлючИЗначение Из ПолучитьЗначениеПараметраТекущегоСеанса("СтруктураРазделов") Цикл
			
			Если	Не	(	КлючИЗначение.Ключ = "Покупка"
						Или	КлючИЗначение.Ключ = "Продажа"
						Или	КлючИЗначение.Ключ = "Справочники") Тогда
						
				Продолжить;
				
			КонецЕсли;
			
			Если КлючИЗначение.Значение.Свойство(РазделГО.Имя, ПараметрПоиск) Тогда
				
				Прервать;
				
			КонецЕсли;

		КонецЦикла;
		
		РазделГО.ОписаниеРаздела.Ини = ПараметрПоиск;

		Возврат РазделГО.ОписаниеРаздела.Ини;
		
	ИначеЕсли КлючЗначенияПолучить = "ТекущийФильтр" Тогда
		
		Возврат яРазделГО_ТекущийФильтр(РазделГО, ДопПараметры);

	ИначеЕсли КлючЗначенияПолучить = "ПустойФильтр" Тогда
	
		// Сделать фильтр по-умолчанию.
		ФрмФильтр = НайтиФункциюСеансаОбработки("ЗначенияДляФильтрПоУмолчанию", РазделГО.ОписаниеРаздела.ФормыРаздела);
		
		Если ФрмФильтр = Ложь Тогда
			
			ФрмФильтр = ПолучитьФормуОбработки("ФормаУстановкиФильтра");
			
		КонецЕсли;
		
		ПустойФильтр = ФрмФильтр.ЗначенияДляФильтрПоУмолчанию(РазделГО, ДопПараметры);
		Возврат ПустойФильтр;

	ИначеЕсли КлючЗначенияПолучить = "ПредставлениеФильтра" Тогда
		
		Попытка
			
			Возврат яРазделГО_СтруктураФильтра_Представление(РазделГО, ДопПараметры);
			
		Исключение
			
			Возврат ""
			
		КонецПопытки;
		
	ИначеЕсли КлючЗначенияПолучить = "ПользовательскиеЗначенияФильтра" Тогда
		
		Возврат яРазделГО_СтруктураФильтра_ПользовательскиеФильтры(РазделГО);

	Иначе	
		
		Возврат РазделГО[КлючЗначенияПолучить];
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура РазделГО_Подготовить(РазделГО) Экспорт 

	Кэш = ПолучитьТекущийЛокальныйКэш();
	РазделГО.Форма.НаСменуРаздела(Кэш);
	РазделГО.Форма.НастроитьКолонки(Кэш);
	РазделГО.Форма.НавигацияУстановитьПанель(Кэш);

КонецПроцедуры

// Функция - проверка заполненности класса
//
// Параметры:
//  РазделГО	 - РазделГО	 - 
// 
// Возвращаемое значение:
//  Булево - пустой (есть возможность перехода) ли раздел, или нет
//
&НаКлиенте
Функция РазделГО_Пустой(РазделГО) Экспорт 
	
	Возврат Не	ЗначениеЗаполнено(РазделГО)
		Или	Не	ЗначениеЗаполнено(РазделГО.Имя)
		Или		РазделГО.Форма = Ложь;
	
КонецФункции

// Процедура - сохраняет установленный на разделе фильтр
//
// Параметры:
//  РазделГО	 - РазделГО	 - Структура раздела главного окна
//  ДопПараметры		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Процедура РазделГО_СохранитьФильтр(РазделГО, ДопПараметры = Неопределено) Экспорт 
	Перем ЗначениеДляФильтрОбновить;
	
	Если РазделГО_Пустой(РазделГО) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СохраненныеФильтры	= ПолучитьЗначениеПараметраСбис("ФильтрыПоРазделам");
	КлючФильтраРаздел	= РазделГО.ОписаниеРаздела.Имя;
	Если РазделГО.ОписаниеРаздела.Ини = Неопределено Тогда
		
		КлючФильтраПодраздел	= КлючФильтраРаздел + "_" + РазделГО.ТипДок;
		
	Иначе
		
		КлючФильтраПодраздел	= КлючФильтраРаздел + "_" + РазделГО.ОписаниеРаздела.Ини;
		
	КонецЕсли;
	
	Если	Не СохраненныеФильтры.Свойство(КлючФильтраПодраздел,	ЗначениеДляФильтрОбновить)
		И	Не СохраненныеФильтры.Свойство(КлючФильтраРаздел,		ЗначениеДляФильтрОбновить) Тогда
		
		ЗначениеДляФильтрОбновить = Новый Структура;
		СохраненныеФильтры.Вставить(КлючФильтраРаздел, ЗначениеДляФильтрОбновить);
		
	КонецЕсли;
	
	// Объединить фильтры. Переделать на ОбъединитьОбъектыУниверсальныхКоллекций
	Для Каждого КлючИЗначениеФильтра Из РазделГО.Фильтр Цикл
		
		Если КлючИЗначениеФильтра.Ключ = "ПараметрыФильтра" Тогда
			
			Если Не ЗначениеДляФильтрОбновить.Свойство("ПараметрыФильтра") Тогда
				
				ЗначениеДляФильтрОбновить.Вставить("ПараметрыФильтра", Новый Структура);
				
			КонецЕсли;
			
			Для Каждого КлючИЗначениеФильтраДоп Из КлючИЗначениеФильтра.Значение Цикл
				
				ЗначениеДляФильтрОбновить.ПараметрыФильтра.Вставить(КлючИЗначениеФильтраДоп.Ключ, КлючИЗначениеФильтраДоп.Значение);
				
			КонецЦикла;	
			
		Иначе
			
			ЗначениеДляФильтрОбновить.Вставить(КлючИЗначениеФильтра.Ключ, КлючИЗначениеФильтра.Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	яРазделГО_ПроверитьФильтр(РазделГО);
	
	ИзменитьПараметрСбис("ФильтрыПоРазделам", СохраненныеФильтры);
	
КонецПроцедуры

// Процедура - применяет установленный на разделе фильтр
//
// Параметры:
//  РазделГО	 - РазделГО	 - Структура раздела главного окна
//  ДопПараметры - Структура/Неопределено	 - расширение
// 
&НаКлиенте
Процедура РазделГО_ПрименитьФильтр(РазделГО, ДопПараметры = Неопределено) Экспорт 
	Перем ОбластьПрименения;
	
	СтруктураФильтра = РазделГО.Фильтр;
	Если СтруктураФильтра = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если		ДопПараметры = Неопределено
		Или	Не	ДопПараметры.Свойство("ОбъектПрименения", ОбластьПрименения) Тогда
		
		ОбластьПрименения = ГлавноеОкно;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ОбластьПрименения, СтруктураФильтра);
	
	//Заполним дополнительные параметры фильтра
	Если СтруктураФильтра.Свойство("ПараметрыФильтра") Тогда
		
		Кэш = ПолучитьТекущийЛокальныйКэш();
		Для Каждого Элемент Из СтруктураФильтра.ПараметрыФильтра Цикл
			
			Кэш.ПараметрыФильтра.Вставить(Элемент.Ключ, Элемент.Значение);
			
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				
				// Для ОФ заполнить добавленные элементы формы
				ЭлементПриемникаФильтра = ПолучитьЭлементФормыОбработки(ОбластьПрименения, Элемент.Ключ);
				Если		ЭлементПриемникаФильтра = Неопределено
					Или	Не	МодульОбъектаКлиент().ЭлементМеняетДанные(ЭлементПриемникаФильтра) Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				ЭлементПриемникаФильтра.Значение = Элемент.Значение; 
				
			#КонецЕсли
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	ИзменитьПараметрСбис("ПараметрыФильтра", СтруктураФильтра);
	
КонецПроцедуры

// Процедура - вызывает обработчики для фильтра
//
// Параметры:
//  РазделГО	 - СтрукутраРазделаГО	 - структура с описанием раздела
//  СтруктураФильтра	 - Структура			 - обрабатываемый фильтр. Не берётся от класса для возможности обработки и заполнения нового фильтра
//
&НаКлиенте
Процедура РазделГО_ОбработчикиФильтра(РазделГО, СтруктураФильтра) Экспорт

	Кэш				= ПолучитьТекущийЛокальныйКэш(); 
	МодульТекущий	= МодульОбъектаКлиент();
	ИниКонфигурация	= МодульТекущий.ИниПоПараметрам("Конфигурация");// Пока прямое обращение к ини конфигурации.
	
	ПользовательскиеФильтры = РазделГО_Получить(РазделГО, "ПользовательскиеЗначенияФильтра");
	Если Не ПользовательскиеФильтры = Неопределено Тогда
		
		СтруктураФильтра.Вставить("ПараметрыФильтра", ПользовательскиеФильтры);
		
	КонецЕсли;
	
	// Поддержка костылей с фильтрами по-умолчанию
	Если	ИниКонфигурация.Свойство("ФильтрПоУмолчанию")
		И	ИниКонфигурация.ФильтрПоУмолчанию.Свойство(РазделГО.ТипДок) Тогда 
				
		Попытка
			
			Ини = Кэш.ОбщиеФункции.ПолучитьДанныеДокумента1С(ИниКонфигурация[РазделГО.ТипДок], Неопределено, Кэш.КэшЗначенийИни, Кэш.Парам);
			Для Каждого Элем Из Ини Цикл 
				
				Если НРег(Лев(Элем.Ключ, 6)) = "фильтр" Тогда
					
					СтруктураФильтра.Вставить(Элем.Ключ, Элем.Значение);
					
				КонецЕсли;
				
			КонецЦикла;
			
		Исключение
			
			ОшибкаОбработкиФильтра = НовыйСбисИсключение(ИнформацияОбОшибке(), "ОбщиеФункции.ПолучитьДанныеДокумента1С");
			СбисСообщить(ОшибкаОбработкиФильтра);
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция - обновляет установленный на разделе фильтр по переданным данным
//
// Параметры:
//  РазделГО		 - РазделГО	 - Структура раздела главного окна
//	ЗначениеФильтраОбновить	 - Произвольный			 - Источник дял обновления фильтра
//  ДопПараметры			 - Неопределено			 - расширение
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Процедура РазделГО_ОбновитьФильтр(РазделГО, ЗначениеФильтраОбновить, ДопПараметры = Неопределено) Экспорт 
 	Перем ДопПараметрыФильтра;

	Если ЗначениеФильтраОбновить = Неопределено Тогда
		
		Возврат;
		
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	
	ИначеЕсли ТипЗнч(ЗначениеФильтраОбновить) = Тип("Форма") Тогда
		
		ДопПараметрыФильтра = _РазделГОДополнительныеПоляФильтра(РазделГО, ЗначениеФильтраОбновить);
		
	#Иначе
		
	ИначеЕсли ТипЗнч(ЗначениеФильтраОбновить) = Тип("УправляемаяФорма") Тогда
		
		ДопПараметрыФильтра = _РазделГОДополнительныеПоляФильтра(РазделГО, ЗначениеФильтраОбновить);
		
	#КонецЕсли

	КонецЕсли;

	Если ДопПараметрыФильтра = Неопределено Тогда
		
		РазделГО.Фильтр.Удалить("ПараметрыФильтра");
		
	Иначе
		
		РазделГО.Фильтр.Вставить("ПараметрыФильтра", ДопПараметрыФильтра); 
	
	КонецЕсли;

	// Заполнить поля фильтра по входящим данным
	ЗаполнитьЗначенияСвойств(РазделГО.Фильтр, ЗначениеФильтраОбновить);	
	
КонецПроцедуры

// Функция - Возвращает набор команд текущего раздела
//
// Параметры:
//  РазделГО	 - Структура	 - Объект класса РазделГО
//  ДопПараметры - Структура, Неопределено	 - На всякий случай
// 
// Возвращаемое значение:
//  Массив - Массив с Пользовательскими действиями
//
&НаКлиенте
Функция РазделГО_НаборКоманд(РазделГО, ДопПараметры = Неопределено) Экспорт

	ОписаниеРаздела = РазделГО_Получить(РазделГО, "ОписаниеРаздела");
	
	МодульСпискаДействий = НайтиФункциюСеансаОбработки("СписокПользовательскихДействийРаздела", ОписаниеРаздела.ФормыРаздела);
	СписокПользовательскихДействий = МодульСпискаДействий.СписокПользовательскихДействийРаздела(РазделГО);
	
	МассивПользовательскихДействий = Новый Массив;
	
	Для каждого ОписаниеДействия Из СписокПользовательскихДействий Цикл
	
		Действие = НовыйПользовательскоеДействие(РазделГО);
		Действие.Идентификатор = ОписаниеДействия.Значение;
		Действие.Представление = ОписаниеДействия.Представление;
		МассивПользовательскихДействий.Добавить(Действие);
	
	КонецЦикла;
	
	Возврат МассивПользовательскихДействий;

КонецФункции

