
&НаКлиенте
Процедура СтруктураРазделаГО_Вставить(СтруктураРазделаГО, КлючЗначенияВставить, ЗначениеВставить) Экспорт 

	Если КлючЗначенияВставить = "ПредыдущийРаздел" Тогда
		
		Если Не ЭтоТипСбис(ЗначениеВставить, "СтруктураРазделаГО") Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ЗначениеВставить.ПредыдущийРаздел	= Неопределено;
		СтруктураРазделаГО.ПредыдущийРаздел = НовыйСтруктураРазделаГО_ПоДанным(ЗначениеВставить);
		СтруктураРазделаГО_УстановитьМодули(СтруктураРазделаГО.ПредыдущийРаздел);
		
	Иначе
		
		СтруктураРазделаГО[КлючЗначенияВставить] = ЗначениеВставить;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураРазделаГО_Получить(СтруктураРазделаГО, КлючЗначенияПолучить, ДопПараметры = Неопределено) Экспорт 
	Перем ПараметрПоиск;
	
	Если КлючЗначенияПолучить = "Название" Тогда
		
		Возврат СтруктураРазделаГО.ОписаниеРаздела.Имя;
		
	ИначеЕсли КлючЗначенияПолучить = "Тип" Тогда
		
		Возврат СтруктураРазделаГО.ТипДок;
		
	ИначеЕсли КлючЗначенияПолучить = "ИмяИни" Тогда
		
		Если		ЗначениеЗаполнено(СтруктураРазделаГО.ОписаниеРаздела.Ини)
			Или	Не	ЗначениеЗаполнено(СтруктураРазделаГО.Имя) Тогда
			
			Возврат СтруктураРазделаГО.ОписаниеРаздела.Ини;
			
		КонецЕсли;
		
		Для Каждого КлючИЗначение Из ПолучитьЗначениеПараметраТекущегоСеанса("СтруктураРазделов") Цикл
			
			Если	Не	(	КлючИЗначение.Ключ = "Покупка"
						Или	КлючИЗначение.Ключ = "Продажа"
						Или	КлючИЗначение.Ключ = "Справочники") Тогда
						
				Продолжить;
				
			КонецЕсли;
			
			Если КлючИЗначение.Значение.Свойство(СтруктураРазделаГО.Имя, ПараметрПоиск) Тогда
				
				Прервать;
				
			КонецЕсли;

		КонецЦикла;
		
		СтруктураРазделаГО.ОписаниеРаздела.Ини = ПараметрПоиск;

		Возврат СтруктураРазделаГО.ОписаниеРаздела.Ини;
		
	ИначеЕсли КлючЗначенияПолучить = "ТекущийФильтр" Тогда
		
		Возврат СтруктураРазделаГО_ТекущийФильтр(СтруктураРазделаГО, ДопПараметры);

	ИначеЕсли КлючЗначенияПолучить = "ПустойФильтр" Тогда
	
		// Сделать фильтр по-умолчанию.
		ФрмФильтр = НайтиФункциюСеансаОбработки("ЗначенияДляФильтрПоУмолчанию", СтруктураРазделаГО.ОписаниеРаздела.ФормыРаздела);
		
		Если ФрмФильтр = Ложь Тогда
			
			ФрмФильтр = ПолучитьФормуОбработки("ФормаУстановкиФильтра");
			
		КонецЕсли;
		
		ПустойФильтр = ФрмФильтр.ЗначенияДляФильтрПоУмолчанию(СтруктураРазделаГО);
		СтруктураРазделаГО_ОбработчикиФильтра(СтруктураРазделаГО, ПустойФильтр);
		Возврат ПустойФильтр;

	ИначеЕсли КлючЗначенияПолучить = "ПредставлениеФильтра" Тогда
		
		Возврат СтруктураРазделаГО_ПредставлениеФильтра(СтруктураРазделаГО);
		
	Иначе	
		
		Возврат СтруктураРазделаГО[КлючЗначенияПолучить];
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СтруктураРазделаГО_Подготовить(СтруктураРазделаГО) Экспорт 

	Кэш = ПолучитьТекущийЛокальныйКэш();
	СтруктураРазделаГО.Форма.НаСменуРаздела(Кэш);
	СтруктураРазделаГО.Форма.НастроитьКолонки(Кэш);
	СтруктураРазделаГО.Форма.НавигацияУстановитьПанель(Кэш);

КонецПроцедуры

// Функция - проверка заполненности класса
//
// Параметры:
//  СтруктураРазделаГО	 - СтруктураРазделаГО	 - 
// 
// Возвращаемое значение:
//  Булево - пустой (есть возможность перехода) ли раздел, или нет
//
&НаКлиенте
Функция СтруктураРазделаГО_Пустой(СтруктураРазделаГО) Экспорт 
	
	Возврат Не ЗначениеЗаполнено(СтруктураРазделаГО.Имя) Или СтруктураРазделаГО.Форма = Ложь;
	
КонецФункции

// Функция - сохраняет установленный на разделе фильтр
//
// Параметры:
//  СтруктураРазделаГО	 - СтруктураРазделаГО	 - Структура раздела главного окна
//  ДопПараметры		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Процедура СтруктураРазделаГО_СохранитьФильтр(СтруктураРазделаГО, ДопПараметры = Неопределено) Экспорт 
	
	Если Не ЗначениеЗаполнено(СтруктураРазделаГО.ОписаниеРаздела.Имя) Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	СохраненныеФильтры	= ПолучитьЗначениеПараметраСбис("ФильтрыПоРазделам");
	КлючФильтраРаздел	= СтруктураРазделаГО.ОписаниеРаздела.Имя;
	Если СтруктураРазделаГО.ОписаниеРаздела.Ини = Неопределено Тогда
		
		КлючФильтраПодраздел	= КлючФильтраРаздел + "_" + СтруктураРазделаГО.ТипДок;
		
	Иначе
		
		КлючФильтраПодраздел	= КлючФильтраРаздел + "_" + СтруктураРазделаГО.ОписаниеРаздела.Ини;
		
	КонецЕсли;
	
	//Заполним дополнительные параметры пользовательских фильтров. Пока брать по-старинке, от Кэш, хотя это не правильно
	Кэш = ПолучитьТекущийЛокальныйКэш();
	Если Кэш.ПараметрыФильтра.Количество() Тогда
		
		СтруктураРазделаГО.Фильтр.Вставить("ПараметрыФильтра", Новый Структура);
		
		Для Каждого Элемент Из Кэш.ПараметрыФильтра Цикл
			
			СтруктураРазделаГО.Фильтр.ПараметрыФильтра.Вставить(Элемент.Ключ, Элемент.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если СохраненныеФильтры.Свойство(КлючФильтраПодраздел) Тогда
		
		СохраненныеФильтры[КлючФильтраПодраздел] = СтруктураРазделаГО.Фильтр;
		
	Иначе 
		
		СохраненныеФильтры.Вставить(КлючФильтраРаздел, СтруктураРазделаГО.Фильтр);
		
	КонецЕсли;
	
	ИзменитьПараметрСбис("ФильтрыПоРазделам", СохраненныеФильтры);
	
КонецПроцедуры

// Процедура - вызывает обработчики для фильтра
//
// Параметры:
//  СтруктураРазделаГО	 - СтрукутраРазделаГО	 - структура с описанием раздела
//  СтруктураФильтра	 - Структура			 - обрабатываемый фильтр. Не берётся от класса для возможности обработки и заполнения нового фильтра
//
&НаКлиенте
Процедура СтруктураРазделаГО_ОбработчикиФильтра(СтруктураРазделаГО, СтруктураФильтра) Экспорт

	Кэш				= ПолучитьТекущийЛокальныйКэш(); 
	МодульТекущий	= МодульОбъектаКлиент();
	ИниКонфигурация	= МодульТекущий.ИниПоПараметрам("Конфигурация");
	ФормаДопФильтра	= МодульТекущий.НайтиФункциюСеансаОбработки("сбисСписокДопПараметровФильтра", СтруктураРазделаГО.ОписаниеРаздела.ФормыФильтра);
	
	Если Не ФормаДопФильтра = Ложь Тогда
		
		ГлавноеОкно.ОчиститьДополнительныеПараметрыФильтра(ФормаДопФильтра);
		
	КонецЕсли;

	Если	ИниКонфигурация.Свойство("ФильтрПоУмолчанию")
		И	ИниКонфигурация.ФильтрПоУмолчанию.Свойство(СтруктураРазделаГО.ТипДок) Тогда 
				
		Попытка
			
			Ини = Кэш.ОбщиеФункции.ПолучитьДанныеДокумента1С(ИниКонфигурация[СтруктураРазделаГО.ТипДок], Неопределено, Кэш.КэшЗначенийИни, Кэш.Парам);
			Для Каждого Элем Из Ини Цикл 
				
				Если НРег(Лев(Элем.Ключ, 6)) = "фильтр" Тогда
					
					СтруктураФильтра.Вставить(Элем.Ключ, Элем.Значение);
					
				КонецЕсли;
				
			КонецЦикла;
			
		Исключение
			
			ОшибкаОбработкиФильтра = НовыйСбисИсключение(ИнформацияОбОшибке(), "ОбщиеФункции.ПолучитьДанныеДокумента1С");
			СбисСообщить(ОшибкаОбработкиФильтра);
			
		КонецПопытки;
	КонецЕсли;
	
	МодульФормированияФильтра = МодульТекущий.НайтиФункциюСеансаОбработки("СформироватьСтруктуруФильтра", СтруктураРазделаГО.ОписаниеРаздела.ФормыРаздела);

	Если Не МодульФормированияФильтра = Ложь Тогда

		МодульФормированияФильтра.СформироватьСтруктуруФильтра(Кэш, СтруктураФильтра);
		
	КонецЕсли;	
	
КонецПроцедуры

// Функция - обновляет установленный на разделе фильтр по переданным данным
//
// Параметры:
//  СтруктураРазделаГО		 - СтруктураРазделаГО	 - Структура раздела главного окна
//	ЗначениеФильтраОбновить	 - Произвольный			 - Источник дял обновления фильтра
//  ДопПараметры			 - Неопределено			 - расширение
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Процедура СтруктураРазделаГО_ОбновитьФильтр(СтруктураРазделаГО, ЗначениеФильтраОбновить, ДопПараметры = Неопределено) Экспорт 
	Перем ДопПараметрыФильтра;
	
	Если ЗначениеФильтраОбновить = Неопределено Тогда
		
		Возврат;
		
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	
	ИначеЕсли ТипЗнч(ЗначениеФильтраОбновить) = Тип("Форма") Тогда
		
		// Пока ничего тут. Возможно, понадобится дополнительная обработка пользовательских фильтров для ОФ
		
	#Иначе	
	ИначеЕсли ТипЗнч(ЗначениеФильтраОбновить) = Тип("УправляемаяФорма") Тогда
		
		Попытка
			
			// Есть ли пользовательские параметры фльтра, которые так же надо обновить
			СписокДопПараметрыФильтра = ЗначениеФильтраОбновить.сбисСписокДопПараметровФильтра();
			
		Исключение
			
			СписокДопПараметрыФильтра = Неопределено;
			
		КонецПопытки;
		
		Если ЗначениеЗаполнено(СписокДопПараметрыФильтра) Тогда
			
			// Сформировать структуру пользовательских параметров фильтра
			Если Не СтруктураРазделаГО.Фильтр.Свойство("ПараметрыФильтра", ДопПараметрыФильтра) Тогда
				
				ДопПараметрыФильтра = Новый Структура;
				Для Каждого ДопПараметрФильтра Из СписокДопПараметрыФильтра Цикл 
					
					ДопПараметрыФильтра.Вставить(ДопПараметрФильтра.Значение, "");
					
				КонецЦикла;
				СтруктураРазделаГО.Фильтр.Вставить("ПараметрыФильтра", ДопПараметрыФильтра);
				
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ДопПараметрыФильтра, ЗначениеФильтраОбновить);
			
		КонецЕсли;	
		
	#КонецЕсли

	КонецЕсли;
	
	// Заполнить поля фильтра по входящим данным
	ЗаполнитьЗначенияСвойств(СтруктураРазделаГО.Фильтр, ЗначениеФильтраОбновить);	
	
КонецПроцедуры

