
//Функция заполняет структуру с данными о текущем разделе
&НаКлиенте
Функция НовыйРазделГО(ИмяКнопкиРаздела = Неопределено, ДопПараметры = Неопределено) Экспорт
	Перем ИмяРеестра, СтруктураГО, ДопПараметрыРаздела, ПредыдущийРаздел, ТипАккордеона, РодительскийРаздел;
	
	СтруктураРазделов = ПолучитьЗначениеПараметраТекущегоСеанса("СтруктураРазделов");
	Если Не ДопПараметры = Неопределено Тогда
		
		ДопПараметры.Свойство("ПараметрыРаздела",	ДопПараметрыРаздела);
		ДопПараметры.Свойство("ТекущийРаздел",		ПредыдущийРаздел);
		ДопПараметры.Свойство("ТипАккордеона",		ТипАккордеона);
		ДопПараметры.Свойство("РодительскийРаздел",	РодительскийРаздел);
		
		Если ДопПараметры.Свойство("ИмяИни") Тогда
			
			СтруктураГО = НовыйРазделГО_ПоИмениИни(ИмяКнопкиРаздела, ДопПараметры.ИмяИни);
			
		КонецЕсли;	
			
	КонецЕсли;
		
	Если СтруктураГО = Неопределено Тогда;
		
		СтруктураГО = НовыйРазделГО_ПоДанным(ИмяКнопкиРаздела);
		
	КонецЕсли;
	ИмяИниРеестра = РазделГО_Получить(СтруктураГО, "ИмяИни");		
	
	Если ЗначениеЗаполнено(ИмяИниРеестра) Тогда
		
		// Заполнить параметры реестра по ини, если ини есть
		ЗначениеИниТекущегоРеестра	= ИниПоПараметрам(ИмяИниРеестра);
		МодульФункций				= ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
		НеЗапускатьВДокументооборот	= МодульФункций.РассчитатьЗначение("НеЗапускатьВДокументооборот",	ЗначениеИниТекущегоРеестра);
		КаталогОбмена				= МодульФункций.РассчитатьЗначение("КаталогОбмена",					ЗначениеИниТекущегоРеестра);
		
		Если Не КаталогОбмена = Неопределено Тогда
			
			// Если указан каталог обмена, то в отправке для поиска операций выставляем его
			КаталогОбмена = МодульФункций.СбисФорматКаталога(КаталогОбмена, ГлобальныйКэш.ПараметрыСистемы.Клиент);
			СтруктураГО.ОписаниеРаздела.Параметры.Вставить("ИмяМодуляИнтеграции",	"ИнтеграцияКаталог");
			СтруктураГО.ОписаниеРаздела.Параметры.Вставить("КаталогОбмена",			КаталогОбмена);
			
		КонецЕсли;
		
		Если Не НеЗапускатьВДокументооборот = Неопределено Тогда
			
			СтруктураГО.ОписаниеРаздела.Параметры.Вставить("НеЗапускатьВДокументооборот", НеЗапускатьВДокументооборот);
		
		КонецЕсли;
		
	КонецЕсли;
		
	Если Не ДопПараметрыРаздела = Неопределено Тогда
		
		Для Каждого  ПараметрРаздела Из ДопПараметрыРаздела Цикл
			
			СтруктураГО.ПараметрыРаздела.Вставить(ПараметрРаздела.Ключ, ПараметрРаздела.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
	
	РазделГО_Вставить(СтруктураГО, "ПредыдущийРаздел",		ПредыдущийРаздел);
	РазделГО_Вставить(СтруктураГО, "РодительскийРаздел",	РодительскийРаздел);
	
	ОписаниеРаздела = РазделГО_Получить(СтруктураГО, "ОписаниеРаздела");
	ОписаниеРаздела.ТипАккордеона = ?(ЗначениеЗаполнено(ТипАккордеона), ТипАккордеона, "Основной");
	
	РазделГО_УстановитьМодули(СтруктураГО);

	// Совместимость для ВФК. НЕ УДАЛЯТЬ!
	СтруктураГО.Раздел = СтруктураГО.ОписаниеРаздела.Номер;
	СтруктураГО.Фильтр = РазделГО_Получить(СтруктураГО, "ТекущийФильтр");
		
	Возврат СтруктураГО;
	
КонецФункции

&НаКлиенте
Функция НовыйРазделГО_ПоИмениИни(ИмяКнопкиРаздела, ИмяРеестра)
	Перем Раздел, ТекущийРаздел;
	
	//Если кнопка не передана, то может быть передана имя ини файла раздела. Попробуем найти по реестрам.
	Для Каждого КлючИЗначение Из ГлавноеОкно.Кэш.Разделы Цикл
		
		Если	Не	(	КлючИЗначение.Ключ = "Покупка"
					Или	КлючИЗначение.Ключ = "Продажа"
					Или	КлючИЗначение.Ключ = "Справочники") Тогда
					
			Продолжить;
			
		КонецЕсли;
		
		Для Каждого КлючИЗначениеПодРаздел Из КлючИЗначение.Значение Цикл
			
			Если ИмяРеестра = КлючИЗначениеПодРаздел.Значение Тогда
				
				ИмяКнопкиРаздела = КлючИЗначениеПодРаздел.Ключ;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ИмяКнопкиРаздела = Неопределено Тогда
			
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ИмяКнопкиРаздела = Неопределено Тогда
		
		Если ИмяРеестра = "" Тогда
			
			// Для автоопределения создадим вирутальный раздел, без указания ини
			ИмяНадРаздела = "Продажа";
			Раздел				= _РазделГО_НазваниеНомерРазделаПоСоответствию(ИмяНадРаздела);
			ТекущийРаздел		= Раздел;
			
		Иначе
			
			// Имя кнопки не найдено, это может быть ини без реестра.
			ОбщиеФункции		= ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции");
			ЗначениеИни			= ИниПоПараметрам(ИмяРеестра);
			ИмяНадРаздела		= ОбщиеФункции.РассчитатьЗначение("ДокументРаздел", ЗначениеИни);
			Раздел				= _РазделГО_НазваниеНомерРазделаПоСоответствию(ИмяНадРаздела);
			ТекущийРаздел		= Раздел;
			
		КонецЕсли;
		
		// Виртуальный, 99 раздел. Надеюсь, столько кнопок в аккордеоне никогда не будет
		ИмяКнопкиРаздела	= "Аккордеон" + ИмяНадРаздела + "Док99" + Раздел + ТекущийРаздел;
		
	КонецЕсли;
	
	Возврат НовыйРазделГО_ПоДанным(ИмяКнопкиРаздела, Раздел, ТекущийРаздел, ИмяРеестра);

КонецФункции

&НаКлиенте
Функция НовыйРазделГО_ПоДанным(КнопкаРаздела = Неопределено, ДанныеРаздел = Неопределено, НомерТекущегоРаздела = Неопределено, ИниРаздела = Неопределено)
	
	Если ЭтоТипСбис(КнопкаРаздела, "РазделГО") Тогда
		
		РазделГО = НовыйРазделГО_ПоДанным(КнопкаРаздела.Имя, КнопкаРаздела.Раздел, КнопкаРаздела.ТекущийРаздел, КнопкаРаздела.ТипДок);
		РазделГО.Фильтр = КнопкаРаздела.Фильтр;
		Возврат РазделГО;
		
	Иначе
		
		ИмяКнопкиРаздела = КнопкаРаздела;
		
	КонецЕсли;
	
	РазделГО = _РазделГО_Пустой();
	
	// ПредыдущийРаздел - РазделГО - для отслеживания вложенности разделов. При не удачном переходе, возвращаемся по пути обратно
	// Имя				- Имя кнопки, по которой попали сюда
	// Раздел			- номер раздела из структуры разделов
	// ТипДок			- Тип для реестров СБИС
	// ИниРаздела		- Имя ини для реестра, если есть
	
	РазделГО.Вставить("ОписаниеРаздела", Новый Структура("Параметры, Номер, Имя, Ини, ТипАккордеона", Новый Структура)); 
	
	РазделГО.Вставить("ПараметрыРаздела", Новый Структура);
	
	идРаздел = Прав(ИмяКнопкиРаздела, 2);

	// Имя кнопки
	Если ИмяКнопкиРаздела = Неопределено Тогда
	
		РазделГО.Имя = "";
		
	Иначе
		
		РазделГО.Имя = ИмяКнопкиРаздела;
		
	КонецЕсли;
	
	// Номер раздела из РазделГО
	Если ДанныеРаздел = Неопределено Тогда
	
		РазделГО.ОписаниеРаздела.Номер = Прав(идРаздел, 1);
		
	ИначеЕсли ТипЗнч(ДанныеРаздел) = Тип("Структура") Тогда
		
		РазделГО.ОписаниеРаздела = ДанныеРаздел;
		
	Иначе
		
		РазделГО.ОписаниеРаздела.Номер = ДанныеРаздел;
		
	КонецЕсли;
	
	// Номер текущего раздела
	Если НомерТекущегоРаздела = Неопределено Тогда
	
		РазделГО.ТекущийРаздел = Лев(идРаздел, 1);
		
	Иначе
		
		РазделГО.ТекущийРаздел = НомерТекущегоРаздела;
		
	КонецЕсли;
	
	// Имя ини
	Если ИниРаздела = Неопределено Тогда
	
		РазделГО.ОписаниеРаздела.Ини = "";
		
	Иначе
		
		РазделГО.ОписаниеРаздела.Ини = ИниРаздела;
		
	КонецЕсли;

	РазделГО.ОписаниеРаздела.Имя	= _РазделГО_НазваниеНомерРазделаПоСоответствию(РазделГО.ОписаниеРаздела.Номер);
	РазделГО.ТипДок				= Сред(ИмяКнопкиРаздела, 10, СтрДлина(ИмяКнопкиРаздела) - 11);

	Возврат РазделГО;
	
КонецФункции

