
//Функция заполняет структуру с данными о текущем разделе
&НаКлиенте
Функция НовыйСтруктураРазделаГО(ИмяКнопкиРаздела = Неопределено, ДопПараметры = Неопределено) Экспорт
	Перем ИмяРеестра, СтруктураГО, ДопПараметрыРаздела, ПредыдущийРаздел;
	
	СтруктураРазделов = ПолучитьЗначениеПараметраТекущегоСеанса("СтруктураРазделов");
	Если Не ДопПараметры = Неопределено Тогда
		
		ДопПараметры.Свойство("ПараметрыРаздела",	ДопПараметрыРаздела);
		ДопПараметры.Свойство("ТекущийРаздел",		ПредыдущийРаздел);
		
		Если ДопПараметры.Свойство("ИмяИни") Тогда
			
			СтруктураГО = НовыйСтруктураРазделаГО_ПоИмениИни(ИмяКнопкиРаздела, ДопПараметры.ИмяИни);
			
		КонецЕсли;	
			
	КонецЕсли;
		
	Если СтруктураГО = Неопределено Тогда;
		
		СтруктураГО = НовыйСтруктураРазделаГО_ПоДанным(ИмяКнопкиРаздела);
		СтруктураРазделаГО_Получить(СтруктураГО, "ИмяИни");		
		
	КонецЕсли;
	
	СтруктураРазделаГО_УстановитьМодули(СтруктураГО);
		
	Если Не ДопПараметрыРаздела = Неопределено Тогда
		
		Для Каждого  ПараметрРаздела Из ДопПараметрыРаздела Цикл
			
			СтруктураГО.ПараметрыРаздела.Вставить(ПараметрРаздела.Ключ, ПараметрРаздела.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураРазделаГО_Вставить(СтруктураГО, "ПредыдущийРаздел", ПредыдущийРаздел);	

	// Совместимость для ВФК. НЕ УДАЛЯТЬ!
	СтруктураГО.Раздел = СтруктураГО.ОписаниеРаздела.Номер;
	СтруктураГО.Фильтр = СтруктураРазделаГО_Получить(СтруктураГО, "ТекущийФильтр");
		
	Возврат СтруктураГО;
	
КонецФункции

&НаКлиенте
Функция НовыйСтруктураРазделаГО_ПоИмениИни(ИмяКнопкиРаздела, ИмяРеестра)
	Перем Раздел, ТекущийРаздел;
	
	//Если кнопка не передана, то может быть передана имя ини файла раздела. Попробуем найти по реестрам.
	Для Каждого КлючИЗначение Из ГлавноеОкно.Кэш.Разделы Цикл
		
		Если	Не	(	КлючИЗначение.Ключ = "Покупка"
					Или	КлючИЗначение.Ключ = "Продажа"
					Или	КлючИЗначение.Ключ = "Справочники") Тогда
					
			Продолжить;
			
		КонецЕсли;
		
		Для Каждого КлючИЗначениеПодРаздел Из КлючИЗначение.Значение Цикл
			
			Если ИмяРеестра = КлючИЗначениеПодРаздел.Значение Тогда
				
				ИмяКнопкиРаздела = КлючИЗначениеПодРаздел.Ключ;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ИмяКнопкиРаздела = Неопределено Тогда
			
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ИмяКнопкиРаздела = Неопределено Тогда
		
		Если ИмяРеестра = "" Тогда
			
			// Для автоопределения создадим вирутальный раздел, без указания ини
			ИмяНадРаздела = "Продажа";
			Раздел				= _СтруктураРазделаГО_НазваниеНомерРазделаПоСоответствию(ИмяНадРаздела);
			ТекущийРаздел		= Раздел;
			
		Иначе
			
			// Имя кнопки не найдено, это может быть ини без реестра.
			ОбщиеФункции		= ПолучитьЗначениеПараметраТекущегоСеанса("ОбщиеФункции");
			ЗначениеИни			= ИниПоПараметрам(ИмяРеестра);
			ИмяНадРаздела		= ОбщиеФункции.РассчитатьЗначение("ДокументРаздел", ЗначениеИни);
			Раздел				= _СтруктураРазделаГО_НазваниеНомерРазделаПоСоответствию(ИмяНадРаздела);
			ТекущийРаздел		= Раздел;
			
		КонецЕсли;
		
		// Виртуальный, 99 раздел. Надеюсь, столько кнопок в аккордеоне никогда не будет
		ИмяКнопкиРаздела	= "Аккордеон" + ИмяНадРаздела + "Док99" + Раздел + ТекущийРаздел;
		
	КонецЕсли;
	
	Возврат НовыйСтруктураРазделаГО_ПоДанным(ИмяКнопкиРаздела, Раздел, ТекущийРаздел, ИмяРеестра);

КонецФункции

&НаКлиенте
Функция НовыйСтруктураРазделаГО_ПоДанным(КнопкаРаздела = Неопределено, ДанныеРаздел = Неопределено, НомерТекущегоРаздела = Неопределено, ИниРаздела = Неопределено)
	
	Если ЭтоТипСбис(КнопкаРаздела, "СтруктураРазделаГО") Тогда
		
		СтруктураРазделаГО = НовыйСтруктураРазделаГО_ПоДанным(КнопкаРаздела.Имя, КнопкаРаздела.Раздел, КнопкаРаздела.ТекущийРаздел, КнопкаРаздела.ТипДок);
		СтруктураРазделаГО.Фильтр = КнопкаРаздела.Фильтр;
		Возврат СтруктураРазделаГО;
		
	Иначе
		
		ИмяКнопкиРаздела = КнопкаРаздела;
		
	КонецЕсли;
	
	СтруктураРазделаГО = _СтруктураРазделаГО_Пустой();
	
	// ПредыдущийРаздел - СтруктураРазделаГО - для отслеживания вложенности разделов. При не удачном переходе, возвращаемся по пути обратно
	// Имя				- Имя кнопки, по которой попали сюда
	// Раздел			- номер раздела из структуры разделов
	// ТипДок			- Тип для реестров СБИС
	// ИниРаздела		- Имя ини для реестра, если есть
	
	СтруктураРазделаГО.Вставить("ОписаниеРаздела", Новый Структура("Параметры, Номер, Имя, Ини", Новый Структура)); 
	
	СтруктураРазделаГО.Вставить("ПараметрыРаздела", Новый Структура);
	
	идРаздел = Прав(ИмяКнопкиРаздела, 2);

	// Имя кнопки
	Если ИмяКнопкиРаздела = Неопределено Тогда
	
		СтруктураРазделаГО.Имя = "";
		
	Иначе
		
		СтруктураРазделаГО.Имя = ИмяКнопкиРаздела;
		
	КонецЕсли;
	
	// Номер раздела из СтруктураРазделаГО
	Если ДанныеРаздел = Неопределено Тогда
	
		СтруктураРазделаГО.ОписаниеРаздела.Номер = Прав(идРаздел, 1);
		
	ИначеЕсли ТипЗнч(ДанныеРаздел) = Тип("Структура") Тогда
		
		СтруктураРазделаГО.ОписаниеРаздела = ДанныеРаздел;
		
	Иначе
		
		СтруктураРазделаГО.ОписаниеРаздела.Номер = ДанныеРаздел;
		
	КонецЕсли;
	
	// Номер текущего раздела
	Если НомерТекущегоРаздела = Неопределено Тогда
	
		СтруктураРазделаГО.ТекущийРаздел = Лев(идРаздел, 1);
		
	Иначе
		
		СтруктураРазделаГО.ТекущийРаздел = НомерТекущегоРаздела;
		
	КонецЕсли;
	
	// Имя ини
	Если ИниРаздела = Неопределено Тогда
	
		СтруктураРазделаГО.ОписаниеРаздела.Ини = "";
		
	Иначе
		
		СтруктураРазделаГО.ОписаниеРаздела.Ини = ИниРаздела;
		
	КонецЕсли;

	СтруктураРазделаГО.ОписаниеРаздела.Имя	= _СтруктураРазделаГО_НазваниеНомерРазделаПоСоответствию(СтруктураРазделаГО.ОписаниеРаздела.Номер);
	СтруктураРазделаГО.ТипДок				= Сред(ИмяКнопкиРаздела, 10, СтрДлина(ИмяКнопкиРаздела) - 11);

	Возврат СтруктураРазделаГО;
	
КонецФункции

