
//DynamicDirective

// Функция - Проверка типа в упрощенном виде. Если объект не SABY, то должен совпадать тип и ТипПроверитьВх.
//
// Параметры:
//  ПрикладнойОбъектSABY	 - ПрикладнойОбъектSABY	 - Структура, с преопределенными полями
//  ТипПроверить			 - Строка				 - Имя типа SABY для сравнения
// 
// Возвращаемое значение:
//  булево - Тип совпадает или нет
//
Функция яОбъектSABY_СравнитьТипСтрокой(ОбъектSABY, ТипПроверитьВх) 
	Перем ТипОбъектаПроверка;
	
	// В случае наследования, тип класса будет многострочным от наследника к родителю
	Для НомерЧислоСтрок = 1 По СтрЧислоСтрок(ОбъектSABY._тип) Цикл
		
		ЗначениеПроверка = СтрПолучитьСтроку(ОбъектSABY._тип, НомерЧислоСтрок);
		Если ЗначениеПроверка = ТипПроверитьВх Тогда 
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

//DynamicDirective

Функция яОбъектSABY_ЭтоОбъект(ОбъектSABY) 
	
	Возврат	ТипЗнч(ОбъектSABY) = Тип("Структура")
		И	ОбъектSABY.Свойство("_тип");
	
КонецФункции

//DynamicDirective

Функция яОбъектSABY_СтатичныйМетод_Свойства()
	
	Возврат "_тип,_ид";
	
КонецФункции

