
// Функция - создать новый, либо перезаполнить объект по нашим данным
//
// Параметры:
//  НашиДанныеВходящие	 - Произвольный	 - на основании чего заполняем
//  ДопПараметры		 - Структура	 - расширение
//		АлгоритмЗаполнить как заполнить объект.
//			vo2			 параметризуемый правилами обработчик заполнения. Подробнее в ЗаполнитьОбъект1СПроизвольнымиДанными
//			vo2_old		 обработчик заполнения старого формата.
//			все прочее	 стандартный Заполнить объекта 1С.
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - 
//		Ссылка - ссылка на созданный/перезаполненный объект
//		Новый - создавался ли новый объект
//		Записывался - записывался ли объект
//
Функция ОбновитьОбъектПоНашимДанным(Знач НашиДанныеВходящие, ДопПараметры = Неопределено) Экспорт
	Перем Объект1СЗначение, Объект1ССсылка, ОбъектТип, лРежимЗаписи, лРежимПроведения, лАлгоритмЗаполнить, ПараметрПроверить;
	
	ЭтоНовый = Ложь;
	
	Если ДопПараметры = Неопределено Тогда
		
		ДопПараметры = Новый ФиксированнаяСтруктура;
		
	КонецЕсли;
	
	Попытка
		
		Если		НашиДанныеВходящие.Свойство("Ссылка", Объект1ССсылка)
			И	Не	Объект1ССсылка = Неопределено Тогда
			
			Если Объект1ССсылка.Пустая() Тогда
				
				ЭтоНовый		 = Истина;
				ОбъектТип		 = ПолучитьПредставлениеТипа(Объект1ССсылка);
				Объект1СЗначение = НовыйОбъект1С(ОбъектТип);
				
				НашиДанныеВходящие.Вставить("Ссылка", Объект1СЗначение.Ссылка);
				
			Иначе
				
				ОбъектТип		 = ПолучитьПредставлениеТипа(Объект1ССсылка);
				Объект1СЗначение = Объект1ССсылка.ПолучитьОбъект();

			КонецЕсли;
			
		Иначе
			
			Если	Не ДопПараметры.Свойство("ТипОбъекта")
				Или	Не ДопПараметры.Свойство("ПодТипОбъекта") Тогда
				
				ВызватьИсключение "Для создания нового объекта должен быть указан его тип";
				
			КонецЕсли;
		
			// Новая запись
			ЭтоНовый		 = Истина;
			ОбъектПодТип	 = ДопПараметры.ПодТипОбъекта;
			ОбъектТип		 = ДопПараметры.ТипОбъекта;
			Объект1СЗначение = НовыйОбъект1С(ОбъектТип + "." + ОбъектПодТип);
			
			НашиДанныеВходящие.Вставить("Ссылка", Объект1СЗначение.Ссылка);
			
		КонецЕсли; 

	Исключение
		
		ВызватьИсключение СбисИсключение_Выгрузить(НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаСервер.НовыйОбъект1С", 767));

	КонецПопытки;
	
	ВыполнитьЗаписьОбъекта	= Ложь;
	ЭтоДокумент1С			= Лев(ОбъектТип, 8) = "документ";

	Если Не ДопПараметры.Свойство("АлгоритмЗаполнить", лАлгоритмЗаполнить) Тогда
		
		Если	ДопПараметры.Свойство("ЗаполнитьДаннымиДругогоОбъекта") 
			И	ДопПараметры.ЗаполнитьДаннымиДругогоОбъекта = Истина Тогда
		
	    	лАлгоритмЗаполнить = "";

		Иначе
			
			лАлгоритмЗаполнить = "vo2";
			
		КонецЕсли;
		
	КонецЕсли;

	Если лАлгоритмЗаполнить = "vo2_old" Тогда
		
		ЗаполнитьОбъект1СНашимиДанными(Объект1СЗначение, НашиДанныеВходящие, ДопПараметры);
		
	ИначеЕсли лАлгоритмЗаполнить = "vo2" Тогда
		
		РезультатЗаполнения = ЗаполнитьОбъект1СПроизвольнымиДанными(Объект1СЗначение, НашиДанныеВходящие, ДопПараметры);
		Если Не ЭтоДокумент1С Тогда
			
			// Считаем, что для документов номер присваивается всегда автоматом. Если не так, то расширить метод.
			// Для справочников и ПВХ это не всегда так, потому сделаем проверку и пропишем код.
			Объект1СЗначение_УстановитьНовыйКлюч(Объект1СЗначение);
			
		КонецЕсли;

		Если РезультатЗаполнения.Изменен Тогда
			
			ВыполнитьЗаписьОбъекта = Истина;
			
		КонецЕсли;
		
	Иначе
		
		ВыполнитьЗаписьОбъекта	= Истина;
		Объект1СЗначение.Заполнить(НашиДанныеВходящие);
		
	КонецЕсли;
	
	Если ЭтоДокумент1С Тогда
		
		Если НашиДанныеВходящие.Свойство("РежимЗаписи", ПараметрПроверить) Тогда
			
			Если ТипЗнч(ПараметрПроверить) = Тип("РежимЗаписиДокумента") Тогда
				
				лРежимЗаписи = ПараметрПроверить;
				
			ИначеЕсли НРег(ПараметрПроверить) = "проведение" Тогда
				
				лРежимЗаписи = РежимЗаписиДокумента.Проведение;
				
			ИначеЕсли НРег(ПараметрПроверить) = "отменапроведения" Тогда
			
				лРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
				
			Иначе
				
				лРежимЗаписи = РежимЗаписиДокумента.Запись;
				
			КонецЕсли; 
			
		КонецЕсли;
		
		Если	НашиДанныеВходящие.Свойство("РежимПроведения", ПараметрПроверить) Тогда
			
			Если ТипЗнч(ПараметрПроверить) = Тип("РежимПроведенияДокумента") Тогда
				
				лРежимПроведения = ПараметрПроверить;
				
			ИначеЕсли НРег(ПараметрПроверить) = "оперативный" Тогда
				
				лРежимПроведения = РежимПроведенияДокумента.Оперативный;
				
			Иначе
			
				лРежимПроведения = РежимПроведенияДокумента.Неоперативный;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВыполнитьЗаписьОбъекта Тогда
		
		Попытка
			
			Если ЭтоДокумент1С Тогда
				
				Объект1СЗначение.Записать(лРежимЗаписи, лРежимПроведения);
				
			Иначе
				
				Объект1СЗначение.Записать();
				
			КонецЕсли;
			
		Исключение
			
			ОшибкаЗаписиОбъекта = НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаСервер.ОбновитьОбъектПоНашимДанным", 502);			
			ВызватьИсключение СбисИсключение_Выгрузить(ОшибкаЗаписиОбъекта);
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура("Ссылка, Новый, Записывался", Объект1СЗначение.Ссылка, ЭтоНовый, ВыполнитьЗаписьОбъекта);
	
КонецФункции	

Процедура Объект1СЗначение_УстановитьНовыйКлюч(Объект1СЗначение, ИдентификаторКлюч = "Код", УстановитьДляНового = Истина, УстановитьДляПустого = Истина, ПрефиксЗначение = "Сб-")
	Перем ПрефиксКода;
	
	Если		УстановитьДляНового
		И	Не	Объект1СЗначение.ЭтоНовый() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если УстановитьДляПустого Тогда
		
		// Устанавливаем код только если есть свойство ключа, оно строковое и пустое.
		СтруктураПроверкиКода = Новый Структура(ИдентификаторКлюч);
		ЗаполнитьЗначенияСвойств(СтруктураПроверкиКода, Объект1СЗначение);
		
		УстановитьНовый = Не СтруктураПроверкиКода[ИдентификаторКлюч] = Неопределено
						И	ПустаяСтрока(СтруктураПроверкиКода[ИдентификаторКлюч]);
						
	Иначе
		
		УстановитьНовый = Истина;
		
	КонецЕсли;
	
	Если УстановитьНовый Тогда
		
		Объект1СЗначение.УстановитьНовыйКод(ПрефиксЗначение);
		
	КонецЕсли;

КонецПроцедуры

// Функция - проверяет что переданные данные содержат отличия с объектом 1С проверки.
//
// Параметры:
//  ОбъектПроверить		 - Произвольный	 - Что проверяем
//  ДанныеДляСравнения	 - Произвольный	 - Что сравниваем
// 
// Возвращаемое значение:
//  Истина - по пересекающимся ключам есть отличия
//
Функция ДанныеОбъектовОтличаются(Знач ОбъектПроверить, Знач ДанныеДляСравнения) Экспорт
	
	ДанныеДляСравненияКопия = СоздатьКопиюОбъекта(ДанныеДляСравнения);
	
	Попытка
		
		// добавить проверку типов вместо Исключений.
		ЗаполнитьЗначенияСвойств(ДанныеДляСравненияКопия, ОбъектПроверить);
		
	Исключение
		
		// Если не удалось проверить, то считаем что отличаются
		Возврат Истина;
		
	КонецПопытки;
	
	Для Каждого Элемент Из ДанныеДляСравненияКопия Цикл
		
		Если Элемент.Значение = ДанныеДляСравнения[Элемент.Ключ] Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Возврат Истина;
			
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#Область include_core2_vo2_МодульОбъекта_Сервер_СозданиеОбъектов_1С_private
#КонецОбласти

