
&НаКлиенте 
Процедура Показать(ПараметрыОткрытия) Экспорт

	// Откат задачи https://dev.saby.ru/opendoc.html?guid=d4d43cb9-369b-4e22-ba81-880595f076fc&client=3
	#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "КодНоменклатуры").Видимость = Ложь;
	#Иначе
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "КодНоменклатуры").Видимость					= Ложь;
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "РеквизитКодаНоменклатурыНадпись").Видимость	= Ложь;
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "РеквизитКодаНоменклатуры").Видимость			= Ложь;
	#КонецЕсли

	// Откат УПД24
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "УПД24").Видимость = Ложь;

	СбисУстановитьФорму(ПараметрыОткрытия);
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ОткрытьМодально();
		Возврат;
	#КонецЕсли
	Открыть();

КонецПроцедуры

