
 //Нажатие на кнопку обновления обработки
&НаКлиенте
Процедура ОбновитьОбработку(Команда)
	
	СбисПроверитьНаличиеОбновлений(Новый Структура("Режим", "Ручной"));	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПрименитьНажатие(Команда)

	Если СпособОбмена = 1 И Не ЗначениеЗаполнено(КаталогОбмена) Тогда
		
		ТекстСообщения = "Заполните каталог обмена документами";
		
		Если Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда 	
			Сообщить(ТекстСообщения);
		Иначе
			Предупреждение(ТекстСообщения);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	//Сообщение безопасности 1С при установке ВК прерывает выполнение кода, установим отказ заранее и изменим если проверки пройдут 
	Отказ					= Истина;
	НаборНовыхПараметров	= СобратьНастройки();
	ПарамерыИзменено		= ПроверитьИПрименитьПараметрыПередЗакрытием(НаборНовыхПараметров, Отказ);
	
	Если Отказ Тогда
		
		Возврат;
		
	КонецЕсли;
	
	РезультатИзменения = Новый Структура("ПараметрыБыли, ПараметрыНовые, РезультатОбработки", НастройкиПодключения_Было, НаборНовыхПараметров, ПарамерыИзменено);
	
	ФормаЗакрытьУстановитьСтатусОк(РезультатИзменения, Истина);
	
КонецПроцедуры

// Процедура - Вызывает сохранение способа сопоставления номенклатуры и начинает перенос
//
// Параметры:
//  Команда	 - 	Команда 
//
&НаКлиенте
Процедура ПереносСопоставлений(Команда)
	
	Если НастройкиПодключения_Было.ИспользоватьНовоеСопоставлениеНоменклатуры <> ИспользоватьНовоеСопоставлениеНоменклатуры Тогда
		МодульОбъектаКлиент().СбисСообщить("Перед тем как выполнить перенос, примените настройки.");
		Возврат;
	КонецЕсли;
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	ИниКонфигурация = МодульОбъектаКлиент().ИниПоПараметрам("Конфигурация");
	
	ФормаОткудаПереносить = Кэш.ОбщиеФункции.РассчитатьЗначение("ФормаРаботыСНоменклатуройПоставщика", ИниКонфигурация);
	Если Кэш.Парам.СпособХраненияНастроек = 1 Тогда
		СБИС_НоменклатураПоставщиков = Кэш.ОбщиеФункции.РассчитатьЗначение("НоменклатураПоставщиков", ИниКонфигурация);
		// если настройки хранятся на сервере, то номенклатуру сопоставляем не в каталоге
		Если Не ЗначениеЗаполнено(СБИС_НоменклатураПоставщиков) Тогда
			МодульОбъектаКлиент().СбисСообщить("Не определен способ хранения номенклатуры поставщика в файле настроек ""Конфигурация""" +
												" при хранении настроек на сервере.");
			Возврат;
		ИначеЕсли	Лев(СБИС_НоменклатураПоставщиков,10) = "Справочник" Тогда
			ФормаОткудаПереносить = "СопоставлениеНоменклатуры_Справочники"; 
		ИначеЕсли	Лев(СБИС_НоменклатураПоставщиков,7) = "Регистр" Тогда
			ФормаОткудаПереносить = "СопоставлениеНоменклатуры_Регистры"; 
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыИзменения = Новый Структура("ФормаСопоставленияНоменклатуры", ФормаОткудаПереносить);
	ФормаПереносаСопоставлений = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("МодульСопоставлениеНоменклатуры");
	
	Если НЕ ФормаПереносаСопоставлений = Неопределено Тогда
		
		Если ТекущийЭлемент.Заголовок = "Перенос выполнен (повторить)" Тогда
			ФормаПереносаСопоставлений.ПараметрыПереносаСопоставлений_Очистить();
		КонецЕсли;
		
		ФормаПереносаСопоставлений.ПереносСопоставлений(ПараметрыИзменения);
		
	КонецЕсли;
	
	ОбновитьДоступностьНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокАвтоматическогоСопоставленияТабл_ПереместитьВверх(Команда)
	
	ПорядокАвтоматическогоСопоставленияФрм_Переместить(1);
	ПорядокАвтоСопоставленияПриИзменении(Команда);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПорядокАвтоматическогоСопоставленияТабл_ПереместитьВниз(Команда)
	
	ПорядокАвтоматическогоСопоставленияФрм_Переместить(-2);
	ПорядокАвтоСопоставленияПриИзменении(Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокАвтоматическогоСопоставленияФрм_Переместить(Направление)
	
	ЭлементТаблица	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПорядокАвтоматическогоСопоставленияТабл");
	ТекущаяСтрока	= ЭлементТаблица.ТекущаяСтрока;

	ПорядковыйНомер			= ПорядокАвтоматическогоСопоставленияТабл.Индекс(ТекущаяСтрока);
	НоваяСтрокаПеренести	= ПорядокАвтоматическогоСопоставленияТабл.Вставить(ПорядковыйНомер - Направление);
	
	ЗаполнитьЗначенияСвойств(НоваяСтрокаПеренести, ТекущаяСтрока);
	
	ЭлементТаблица.ТекущаяСтрока = НоваяСтрокаПеренести;
	
	ПорядокАвтоматическогоСопоставленияТабл.Удалить(ПорядокАвтоматическогоСопоставленияТабл.Индекс(ТекущаяСтрока));
	
КонецПроцедуры  

