
 //Нажатие на кнопку обновления обработки
&НаКлиенте
Процедура ОбновитьОбработку(Команда)
	
	СбисПроверитьНаличиеОбновлений(Новый Структура("Режим", "Ручной"));	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПрименитьНажатие(Команда)

	СбисПрименитьНастройки();
	
КонецПроцедуры

// Процедура - Вызывает сохранение способа сопоставления номенклатуры и начинает перенос
//
// Параметры:
//  Команда	 - 	Команда 
//
&НаКлиенте
Процедура ПереносСопоставлений(Команда)
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	ИниКонфигурация = Кэш.Ини.Конфигурация;
	
	ФормаОткудаПереносить = Кэш.ОбщиеФункции.РассчитатьЗначение("ФормаРаботыСНоменклатуройПоставщика", ИниКонфигурация);
	Если Кэш.Парам.СпособХраненияНастроек = 1 Тогда
		СБИС_НоменклатураПоставщиков = Кэш.ОбщиеФункции.РассчитатьЗначение("НоменклатураПоставщиков", ИниКонфигурация);
		// если настройки хранятся на сервере, то номенклатуру сопоставляем не в каталоге
		Если Не ЗначениеЗаполнено(СБИС_НоменклатураПоставщиков) Тогда
			МодульОбъектаКлиент().СбисСообщить("Не определен способ хранения номенклатуры поставщика в файле настроек ""Конфигурация""" +
												" при хранении настроек на сервере.");
			Возврат;
		ИначеЕсли	Лев(СБИС_НоменклатураПоставщиков,10) = "Справочник" Тогда
			ФормаОткудаПереносить = "СопоставлениеНоменклатуры_Справочники"; 
		ИначеЕсли	Лев(СБИС_НоменклатураПоставщиков,7) = "Регистр" Тогда
			ФормаОткудаПереносить = "СопоставлениеНоменклатуры_Регистры"; 
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыИзменения = Новый Структура("ФормаСопоставленияНоменклатуры", ФормаОткудаПереносить);
	
	МодульОбъектаКлиент().ИзменитьПараметрСбис("СпособСопоставленияНоменклатуры", СпособСопоставленияНоменклатуры);	
	
	ФормаПереносаСопоставлений = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("МодульСопоставлениеНоменклатуры");
	
	Если НЕ ФормаПереносаСопоставлений = Неопределено Тогда
		
		Если ТекущийЭлемент.Заголовок = "Перенос выполнен (повторить)" Тогда
			ФормаПереносаСопоставлений.ПараметрыПереносаСопоставлений_Очистить();
		КонецЕсли;
		
		ФормаПереносаСопоставлений.ПереносСопоставлений(ПараметрыИзменения);
		
	КонецЕсли;
	
	ОбновитьДоступностьНастроек();
	
КонецПроцедуры

