
 //Нажатие на кнопку обновления обработки
&НаКлиенте
Процедура ОбновитьОбработку(Команда)
	
	СбисПроверитьНаличиеОбновлений(Новый Структура("Режим", "Ручной"));	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПрименитьНажатие(Команда)

	СбисПрименитьНастройки();
	
КонецПроцедуры

// Процедура - Вызывает сохранение способа сопоставления номенклатуры и начинает перенос
//
// Параметры:
//  Команда	 - 	Команда 
//
&НаКлиенте
Процедура ПереносСопоставлений(Команда)
		
	Фрм = ВладелецФормы.Кэш.ОбщиеФункции.РассчитатьЗначение("ФормаРаботыСНоменклатуройПоставщика",ВладелецФормы.Кэш.Ини.Конфигурация);
	ПараметрыИзменения = Новый Структура("ФормаСопоставленияНоменклатуры", Фрм);
	
	МодульОбъектаКлиент().ИзменитьПараметрСбис("СпособСопоставленияНоменклатуры", СпособСопоставленияНоменклатуры);	
	
	ФормаРаботыСНоменклатурой	= ВладелецФормы.Кэш.ФормаРаботыСНоменклатурой; 	
	ФормаПереносаСопоставлений	= МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ПереносСопоставлений", ФормаРаботыСНоменклатурой);
	
	Если НЕ ФормаПереносаСопоставлений = Ложь Тогда
		ФормаПереносаСопоставлений.ПереносСопоставлений(ПараметрыИзменения);
	КонецЕсли;
	
	ОбновитьДоступностьНастроек();
	
КонецПроцедуры

