
 //Нажатие на кнопку обновления обработки
&НаКлиенте
Процедура ОбновитьОбработку(Команда)
	
	СбисПроверитьНаличиеОбновлений(Новый Структура("Режим", "Ручной"));	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПрименитьНажатие(Команда)

	СбисПрименитьНастройки();
	
КонецПроцедуры

// Процедура - Вызывает сохранение способа сопоставления номенклатуры и начинает перенос
//
// Параметры:
//  Команда	 - 	Команда 
//
&НаКлиенте
Процедура ПереносСопоставлений(Команда)
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	
	ФормаОткудаПереносить = Кэш.ОбщиеФункции.РассчитатьЗначение("ФормаРаботыСНоменклатуройПоставщика",Кэш.Ини.Конфигурация);
	ПараметрыИзменения = Новый Структура("ФормаСопоставленияНоменклатуры", ФормаОткудаПереносить);
	
	МодульОбъектаКлиент().ИзменитьПараметрСбис("СпособСопоставленияНоменклатуры", СпособСопоставленияНоменклатуры);	
	
	ФормаПереносаСопоставлений = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("МодульСопоставлениеНоменклатуры");
	
	Если НЕ ФормаПереносаСопоставлений = Неопределено Тогда
		
		Если ТекущийЭлемент.Заголовок = "Перенос выполнен (повторить)" Тогда
			ФормаПереносаСопоставлений.ПараметрыПереносаСопоставлений_Очистить();
		КонецЕсли;
		
		ФормаПереносаСопоставлений.ПереносСопоставлений(ПараметрыИзменения);
		
	КонецЕсли;
	
	ОбновитьДоступностьНастроек();
	
КонецПроцедуры

