
// Процедура - Обновить настройки элементов формы
//
// Параметры:
//  СписокЭлементов		 - Массив - Содержит строки с именами элементов формы, которые нужно настроить 
//  ПараметрыНастройки	 - 	Структура 	 - Параметры, которые будут установлены элементу (доступность, видимость и т.п.)
//
//			Настройка 	 -	Строка	  	 - Имя настройки элемента 
//			Значение 	 -	Произвольный - Устанавливаемое значение. Проверок на установку недопустимого значения нет, остаётся на совести программиста
//
// Пока делаю локально для формы, потому что доброска срочная
&НаКлиенте
Процедура ОбновитьНастройкиЭлементовФормы(СписокЭлементов, ПараметрыНастройки)
	
	ЭлементыДляИзменения = Новый Массив;
	
	Для Каждого ИмяЭлемента Из СписокЭлементов Цикл
		
		ЭлементФормы = Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, ИмяЭлемента);
		
		Если НЕ ЭлементФормы = Неопределено Тогда
			ЭлементыДляИзменения.Добавить(ЭлементФормы);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Элемент Из ЭлементыДляИзменения Цикл
		Для Каждого Параметр Из ПараметрыНастройки Цикл
			Элемент[Параметр.Ключ] = Параметр.Значение;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВкладкуСервис()
	
	ГруппаНастройкиСтраницы = Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "НастройкиСтраницы");
	ГруппаНастройкиСтраницы.ТекущаяСтраница = Кэш.ГлавноеОкно.сбисПолучитьСтраницу(ГруппаНастройкиСтраницы, "Сервис");

	Если Не ЭтаФорма.Таблица_Сервис.Количество() И Кэш.Ини.Свойство("Сервис") Тогда
		
		ИниСервис = Кэш.ФормаНастроек.Ини(Кэш, "Сервис");
		
		Для Каждого ПунктКоманды Из ИниСервис Цикл
			
			Если ТипЗнч(ПунктКоманды.Значение) = Тип("Структура") И ПунктКоманды.Значение.Свойство("Имя") Тогда
				
				НовыйПунктКоманды 		   = ЭтаФорма.Таблица_Сервис.Добавить();
				НовыйПунктКоманды.Ключ 	   = ПунктКоманды.Ключ;
				НовыйПунктКоманды.Имя 	   = ПунктКоманды.значение.Имя;
				НовыйПунктКоманды.Описание = ПунктКоманды.значение.Описание;
				НовыйПунктКоманды.Команда  = ПунктКоманды.значение.Значение;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Сбросим начальную страницу
	ГруппаНастройкиСтраницы.ТекущаяСтраница = Кэш.ГлавноеОкно.сбисПолучитьСтраницу(ГруппаНастройкиСтраницы, "ОбщиеНастройки"); 
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСпособХраненияМетокСтатусов(НовоеЗначениеМеток)
	
	Попытка
		МодульОбъектаКлиент().ИзменитьПараметрСбис("СпособХраненияМетокСтатусов", НовоеЗначениеМеток);
		МеткиСтатусов = Кэш.ФормаНастроек.СбисПрочитатьМеткиСтатусов(Кэш);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, МеткиСтатусов);
		ЗаполнитьЗначенияСвойств(Кэш.ГлавноеОкно, МеткиСтатусов);
		Кэш.ФормаНастроек.ИнициализироватьКэшНастроек(Кэш, Новый Структура("Обновить, Параметр", Истина, "status_marks")); //для способа хранения меток в разрезе аккаунта добавим status_marks в список параметров, хранящихся на шаблоне	
	Исключение
		ИнфаОбОшибке = ИнформацияОбОшибке();
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнфаОбОшибке, "ФормаНастройки.ИзменитьСпособХраненияМетокСтатусов")
	КонецПопытки;

КонецПроцедуры

&НаКлиенте                                             
Процедура ОбновитьДоступностьНастроек()
// Процедура устанавливает видимость элементов формы в зависимости от выбранного варианта настроек прокси		

	ДоступностьПрокси = ТипПрокси = "Вручную";
	СбисЭлементВидимость = Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "ИнтеграцияAPIВызовыНаКлиенте");
	Если Не СбисЭлементВидимость = Неопределено Тогда
		#Если ВебКлиент Тогда
			СбисЭлементВидимость.Видимость = Ложь;
		#Иначе
			СбисЭлементВидимость.Видимость = (СпособОбмена = 3);
		#КонецЕсли
	КонецЕсли;
	
	Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "ШифроватьВыборочно").Видимость	= СпособОбмена = 5 Или СпособОбмена = 7;    
																  
	Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "КаталогОбмена").Видимость		= СпособОбмена = 1;
	Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "НастройкаЭП").Видимость			= СпособОбмена = 3;
	Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "КаталогОтладки").Видимость 		= РежимОтладки;
	
	Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "ПроксиСервер").Доступность		= ДоступностьПрокси;
	Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "ПроксиПорт").Доступность			= ДоступностьПрокси;
	Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "ПроксиЛогин").Доступность		= ДоступностьПрокси;
	Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "ПроксиПароль").Доступность		= ДоступностьПрокси;
	
	Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "ПорядокАвтоматическогоСопоставленияФрм").Доступность	= ИспользоватьАвтоматическоеСопоставлениеНоменклатуры;
	
	Если Не Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда 
		Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "НадписьСервер").Доступность	= ДоступностьПрокси;
		Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "НадписьПорт").Доступность	= ДоступностьПрокси;
		Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "НадписьЛогин").Доступность	= ДоступностьПрокси;
		Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "НадписьПароль").Доступность	= ДоступностьПрокси;
	КонецЕсли;
	
	Если	ДоступностьПрокси
		И	Кэш.Парам.Свойство("ПроксиСервер")
		И	СокрЛП(Кэш.Парам.ПроксиСервер) <> "" Тогда
		
		ПроксиСервер = Кэш.Парам.ПроксиСервер;
	КонецЕсли;	 
	
	//Определить возможность использования серверных настроек для интеграции
	ИнтеграцияМодуль		= МодульОбъектаКлиент().МодульИнтеграцииСБИС(СпособОбмена);
	СведенияОбИнтеграции	= ИнтеграцияМодуль.СведенияОбИнтеграции();
	
	Для Каждого Настройка Из ИнтеграцияМодуль.ВидимостьНастроек() Цикл
		
		Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, Настройка.Ключ).Видимость	= Настройка.Значение;	
		
	КонецЦикла;

	Если	СведенияОбИнтеграции.Параметры.ДоступныСерверныеНастройки	Тогда

		Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "СпособХраненияНастроек").ТолькоПросмотр	= Ложь;

	Иначе 

		СпособХраненияНастроек	= 0; 
		Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "СпособХраненияНастроек").ТолькоПросмотр	= Истина;

	КонецЕсли;
	Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "КаталогНастроек").Видимость = СпособХраненияНастроек = 0;
	
	ВариантыСпособаОбмена			= Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "СпособОбмена").СписокВыбора;	
	ДоступностьНовыхСпособовОбмена	= ДоступностьНовыхСпособовОбмена();
	
	Если НЕ ВариантыСпособаОбмена.НайтиПоЗначению(9) = Неопределено И НЕ ДоступностьНовыхСпособовОбмена.SabyHttpClient Тогда
		ВариантыСпособаОбмена.Удалить(ВариантыСпособаОбмена.НайтиПоЗначению(9));
	КонецЕсли; 
	
	Если НЕ ВариантыСпособаОбмена.НайтиПоЗначению(8) = Неопределено И НЕ ДоступностьНовыхСпособовОбмена.SabyPluginConnector Тогда
		ВариантыСпособаОбмена.Удалить(ВариантыСпособаОбмена.НайтиПоЗначению(8));
	КонецЕсли;
	
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "СпособСопоставленияНоменклатуры").ТолькоПросмотр = СпособХраненияНастроек = 1; 
	
	КнопкаПереносСопоставлений = Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "ПеренестиСопоставления");
	
	Если СпособСопоставленияНоменклатуры = 1 Тогда
		//TODO Временно отключаем возможность переноса сопоставлений в DBF (до реализации фун. "ПереносСопоставлений" на DBF)
		КнопкаПереносСопоставлений.Видимость	= Ложь;
	ИначеЕсли МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПараметрыПереносаСопоставлений_Завершен") Тогда 
		КнопкаПереносСопоставлений.Заголовок	= "Перенос выполнен (повторить)";
		КнопкаПереносСопоставлений.Видимость	= Истина;
		КнопкаПереносСопоставлений.Доступность	= Истина;
	ИначеЕсли МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПараметрыПереносаСопоставлений_Начат") Тогда
		КнопкаПереносСопоставлений.Заголовок	= "Продолжить перенос";
		КнопкаПереносСопоставлений.Видимость	= Истина;
		КнопкаПереносСопоставлений.Доступность	= Истина;
	Иначе
		КнопкаПереносСопоставлений.Заголовок	= "Выполнить перенос";
		КнопкаПереносСопоставлений.Видимость	= Истина;
		КнопкаПереносСопоставлений.Доступность	= Истина;
	КонецЕсли;
		
КонецПроцедуры


// Функция - проверяет наличие обработок с внешними компонентами интеграции в справочнике доп. обработок
// 
// Возвращаемое значение:  Структура("SabyHttpClient, SabyPluginConnector", Булево, Булево);
//   - 
//
&НаСервере
Функция ДоступностьНовыхСпособовОбмена()

	Результат						= Новый Структура("SabyHttpClient, SabyPluginConnector", Ложь, Ложь);
	ПараметрыФункций				= Новый Структура("ИмяОбработки", "SabyHttpClient");	
	Если НЕ МодульОбъектаСервер().ВнешняяОбработка_НайтиПоИмениНаСервере(ПараметрыФункций) = Неопределено Тогда
		Результат.SabyHttpClient = Истина;
	КонецЕсли;	
	
	ПараметрыФункций 				= Новый Структура("ИмяОбработки", "SabyPluginConnector");	
	Если НЕ МодульОбъектаСервер().ВнешняяОбработка_НайтиПоИмениНаСервере(ПараметрыФункций) = Неопределено Тогда
		Результат.SabyPluginConnector = Истина;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СбисВыбратьКаталог(СтароеЗначение)
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	ДиалогОткрытия.Каталог		= СтароеЗначение;
	ДиалогОткрытия.Заголовок	= "Выберите каталог"; 
	Если ДиалогОткрытия.Выбрать() Тогда 
		Возврат Кэш.ОбщиеФункции.СбисФорматКаталога(ДиалогОткрытия.Каталог, Кэш.ПараметрыСистемы.Клиент); 
	КонецЕсли;
	
	Возврат	СтароеЗначение;
	
КонецФункции

//Заполняет список адресов сервера
&НаКлиенте
Процедура СбисЗаполнитьАдресСервера(Кэш)
	
	ЭлементАдресСервера = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "АдресСервера");
	ЭлементАдресСервера.СписокВыбора.Очистить();
	
	Если Не ЗначениеЗаполнено(АдресСервера) Тогда
		АдресСервера = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("АдресСервера");
	КонецЕсли;
	
	СписокСерверов		= МодульОбъектаКлиент().СписокДоступныхСерверовСБИС();
	ПредставлениеАдрес	= МодульОбъектаКлиент().ПараметрыАдресаСервераСБИС(АдресСервера).ПредставлениеСервера;
	ДобавитьАдрес		= Истина;
	Для Каждого ЭлементСписка Из СписокСерверов Цикл
		ЭлементАдресСервера.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		Если ЭлементСписка.Представление = ПредставлениеАдрес Тогда
			АдресСервера = ЭлементСписка.Значение;
			ДобавитьАдрес = Ложь;
		КонецЕсли;
	КонецЦикла;
	Если ДобавитьАдрес Тогда
		ЭлементАдресСервера.СписокВыбора.Добавить(АдресСервера, ПредставлениеАдрес);
	КонецЕсли;
	АдресСервера = АдресСервера;//перевыберем для списка
	
КонецПроцедуры

// Процедура записывает выбранные настройки в сохраняемые параметры и закрывает форму	
&НаКлиенте
Процедура СбисПрименитьНастройки()
	
	Если СпособОбмена = 1 И Не ЗначениеЗаполнено(КаталогОбмена) Тогда
		
		ТекстСообщения = "Заполните каталог обмена документами";
		
		Если Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда 	
			Сообщить(ТекстСообщения);
		Иначе
			Предупреждение(ТекстСообщения);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыФормы.Результат		= Новый Структура(КлючиИспользовать);//Набор параметров для завершения
	НастройкиПодключения_Завершение	= Новый Структура(КлючиИспользовать);//Набор параметров для завершения
	ЗаполнитьЗначенияСвойств(ПараметрыФормы.Результат,			ЭтаФорма);
 	ЗаполнитьЗначенияСвойств(НастройкиПодключения_Завершение,	ЭтаФорма);

	НажатиеСохранитьВыполнено = Истина;
	Закрыть(ПараметрыФормы.Результат);

КонецПроцедуры

&НаКлиенте
Процедура СбисПрименитьНастройки_Завершение(АргументыИзменены, ДопПараметры=Неопределено) Экспорт

	ПараметрыЗавершения = Новый Структура;
	ПараметрыЗавершения.Вставить("ПовторныйЗапуск",			Истина);
	ПараметрыЗавершения.Вставить("ИзмененаФормаНастроек",	АргументыИзменены.Настройки);
	ПараметрыЗавершения.Вставить("РазделДо",				Кэш.Текущий.ТипДок);

	Если		АргументыИзменены.Авторизация Тогда
		Кэш.ГлавноеОкно.ПослеОткрытияАвторизация(ПараметрыЗавершения);
		Возврат;
	ИначеЕсли	АргументыИзменены.Настройки Тогда
		//Кэш.ФормаНастроекОбщее.ОчиститьСобранныеНастройки(Кэш);
		Кэш.ГлавноеОкно.ПослеОткрытияЗавершение(ПараметрыЗавершения);
	КонецЕсли;
	
КонецПроцедуры

//Выполняет вызов проверки автообновления
&НаКлиенте
Процедура СбисПроверитьНаличиеОбновлений(ПараметрыПроверки, ДоПараметры = Неопределено) Экспорт
	
	Попытка
		Если ЗначениеЗаполнено(Кэш.Парам.ОжидаемаяВерсия) Тогда
			Сообщить("На текущий момент обновление не требуется - установлена актуальная версия внешней обработки");
			Возврат;
		КонецЕсли;
		
		Кэш.ГлавноеОкно.сбисПоказатьСостояние("Проверка наличия обновлений");
		Кэш.ОбщиеФункции.СбисПроверитьНаличиеОбновлений(Кэш, ПараметрыПроверки);
		Кэш.ГлавноеОкно.сбисСпрятатьСостояние();
		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнфоОбОшибке, "ФормаГлавноеОкно.СбисПроверитьНаличиеОбновлений");
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыОткрытия)
		
	ПараметрыФормы = Новый Структура("РежимЗапуска, Результат");
	ИзмененныеПараметры = Новый Структура;
	МодульОбъектаКлиент = МодульОбъектаКлиент();
	
	Если		ПараметрыОткрытия = Неопределено Тогда
		ПараметрыФормы.РежимЗапуска = "ОбщиеНастройки";
	Иначе
		Если Не	ПараметрыОткрытия.Свойство("РежимЗапуска", ПараметрыФормы.РежимЗапуска) Тогда
			ПараметрыФормы.РежимЗапуска = "ОбщиеНастройки";
		КонецЕсли;
		Если ПараметрыОткрытия.Свойство("Кэш") Тогда
			Кэш = ПараметрыОткрытия.Кэш;
		КонецЕсли;
	КонецЕсли;
	
	Если Кэш = Неопределено Тогда
		Кэш = ВладелецФормы.Кэш;
	КонецЕсли;
	
	Если КлючиИспользовать = Неопределено Тогда
		КлючиИспользовать = "";
		Для Каждого КлючИЗначениеКонтроль Из Кэш.Парам Цикл
			КлючиИспользовать = КлючиИспользовать + "," + КлючИЗначениеКонтроль.Ключ;
		КонецЦикла;
		КлючиИспользовать = Сред(КлючиИспользовать, 2);
	КонецЕсли;
	 //КлючиИспользовать = "СпособОбмена, СпособХраненияНастроек, КаталогНастроек, КаталогОбмена, АдресСервера, ШифроватьВыборочно, ВремяОжиданияОтвета
	 //   			|, ТипПрокси, ПроксиСервер, ПроксиПорт, ПроксиЛогин";
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Кэш.Парам, , "ПорядокАвтоматическогоСопоставления");
		
	ЭлементДействия = Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "НастройкиСтраницы");
	
	Если ПараметрыФормы.РежимЗапуска = "ОбщиеНастройки" Тогда
		
		ЗаполнитьВкладкуСервис();
		//Обновить метки статусов при открытии формы
		МодульОбъектаКлиент.ОбновитьМеткиСтатусов(, Кэш);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Кэш.ГлавноеОкно, "ДатаПоследнегоЗапросаСтатусов, ИдентификаторПоследнегоСобытия, ДатНачЧтенияСтатусов, ДатКнцЧтенияСтатусов");
		
		Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "СтраницаСоединение").Видимость   = Истина;
		Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "НастройкиДокументов").Видимость  = Истина;
		Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "ОбщиеНастройки").Видимость  	   = Истина;
		Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "Сервис").Видимость  			   = Ложь;

		ВариантыВыбора		= МодульОбъектаКлиент.СписокДоступныхСпособовВариантовФильтраПериод();
		ПараметрыИзменения	= Новый ФиксированнаяСтруктура("СписокВыбора", ВариантыВыбора);
		
		ЭлементВыборДатаДок	= МодульОбъектаКлиент.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДатаДокумента_ВыборИзСписка");
		ЭлементВыборВхДата	= МодульОбъектаКлиент.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ВходящаяДата_ВыборИзСписка");
		МодульОбъектаКлиент.ИзменитьЭлементФормыОбработки(ЭлементВыборДатаДок,	ПараметрыИзменения);
		МодульОбъектаКлиент.ИзменитьЭлементФормыОбработки(ЭлементВыборВхДата,	ПараметрыИзменения);
		
		ВариантыВыбора		= МодульОбъектаКлиент.СписокДоступныхСпособовВариантовФильтраНомер();
		ПараметрыИзменения	= Новый ФиксированнаяСтруктура("СписокВыбора", ВариантыВыбора);
		ЭлементВыборВхНомер	= МодульОбъектаКлиент.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ВходящийНомер_ВыборИзСписка");
  		МодульОбъектаКлиент.ИзменитьЭлементФормыОбработки(ЭлементВыборВхНомер,	ПараметрыИзменения);

		ДатаДокумента_ВыборИзСпискаПриИзменении(ЭлементВыборДатаДок);
		ВходящаяДата_ВыборИзСпискаПриИзменении(ЭлементВыборВхДата);
		
		СписокСпособовХранения	= Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "СпособХраненияМетокСтатусов").СписокВыбора;
		СписокЭлементВ_ИБ		= СписокСпособовХранения.НайтиПоЗначению(2);
		Если МодульОбъектаКлиент().ИспользоватьСбисПараметрыДляХраненияОбщихНастроек() Тогда
			Если Не СписокЭлементВ_ИБ = Неопределено Тогда
				СписокСпособовХранения.Удалить(СписокЭлементВ_ИБ);
			КонецЕсли;
		ИначеЕсли СписокЭлементВ_ИБ = Неопределено Тогда
			СписокСпособовХранения.Добавить(2, "Информационной базы");
		КонецЕсли;
		
		// Обработка выбора номенклатуры при загрузке
		ЭлементИзменить		= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "СпособЗагрузки");
		ПараметрыИзменить	= Новый Структура("СписокВыбора", МодульОбъектаКлиент().СписокДоступныхСпособовОбработкиНоменклатуры());
		МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ЭлементИзменить, ПараметрыИзменить);
			
		ЭлементИзменить		= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "РежимЗагрузки");
		ПараметрыИзменить.СписокВыбора = МодульОбъектаКлиент().СписокДоступныхСпособовОбработкиДокументов();
		МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ЭлементИзменить, ПараметрыИзменить);

		Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "ЗаказыПокупателей").Видимость   = Истина;
		
		Если НЕ ЗначениеЗаполнено(СкладПоУмолчанию) 
			И Кэш.ФормаНастроек.ПараметрыРаботы.Свойство("СправочникСклады")
			И ЗначениеЗаполнено(Кэш.ФормаНастроек.ПараметрыРаботы.СправочникСклады) Тогда
			
			НаименованиеТипа = СокрЛП(Кэш.ФормаНастроек.ПараметрыРаботы.СправочникСклады);
			ЭлементСкладПоУмолчанию = Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "СкладПоУмолчанию");
			ЭлементСкладПоУмолчанию.ОграничениеТипа = Новый ОписаниеТипов(НаименованиеТипа);
			
			ИмяСправочника = СтрЗаменить(НаименованиеТипа, "Ссылка", ""); 
			СкладПоУмолчанию = ПредопределенноеЗначение(ИмяСправочника + ".ПустаяСсылка");
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(РасСчетПоУмолчанию) 
			И Кэш.ФормаНастроек.ПараметрыРаботы.Свойство("СправочникРасСчет")
			И ЗначениеЗаполнено(Кэш.ФормаНастроек.ПараметрыРаботы.СправочникРасСчет) Тогда
			
			НаименованиеТипа = СокрЛП(Кэш.ФормаНастроек.ПараметрыРаботы.СправочникРасСчет);
			ЭлементРасСчет = Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "РасСчетПоУмолчанию");
			ЭлементРасСчет.ОграничениеТипа = Новый ОписаниеТипов(НаименованиеТипа);
			
			ИмяСправочника = СтрЗаменить(НаименованиеТипа, "Ссылка", ""); 
			РасСчетПоУмолчанию = ПредопределенноеЗначение(ИмяСправочника + ".ПустаяСсылка");

			ЭлементыДляОбновления = Новый Массив;
			ЭлементыДляОбновления.Добавить("РасСчетПоУмолчанию");
			ЭлементыДляОбновления.Добавить("НадписьРасСчет");
			ПараметрНастройки = Новый Структура("Видимость", Ложь);
			ОбновитьНастройкиЭлементовФормы(ЭлементыДляОбновления, ПараметрНастройки);				
		Иначе
			
			РасСчетПоУмолчанию = Неопределено;
			Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "РасСчетПоУмолчанию").Видимость = Ложь;   // Если заполнен расчетный счет, но из инишки не подтянулся справочник, то принудительно очищаем и прячем
			ЭлементыДляОбновления = Новый Массив;
			ЭлементыДляОбновления.Добавить("РасСчетПоУмолчанию");
			ЭлементыДляОбновления.Добавить("НадписьРасСчет");
			ПараметрНастройки = Новый Структура("Видимость", Ложь);
			ОбновитьНастройкиЭлементовФормы(ЭлементыДляОбновления, ПараметрНастройки);
			
		КонецЕсли;  
		
		Настройки = НастройкиЭлементовЗаполненияКонтрагента1С();	
		ОбновитьНастройкиЭлементовФормы(Настройки.СписокЭлементов, Настройки.ПараметрыНастройки); 
		ПроверитьНаличиеСправочникаПартнеров();
		
		
	ИначеЕсли ПараметрыФормы.РежимЗапуска = "НастройкиСоединения" Тогда   
		
		РежимЗапускаНастройкаСоединения();
		
	ИначеЕсли ПараметрыФормы.РежимЗапуска = "Сервисы" Тогда
		
		Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "СтраницаСоединение").Видимость   = Ложь;
		Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "НастройкиДокументов").Видимость  = Ложь;
		Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "ОбщиеНастройки").Видимость  	   = Ложь;  
		Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "ЗаказыПокупателей").Видимость    = Ложь;
		Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "Сервис").Видимость  			   = Истина;
		ЗаполнитьВкладкуСервис();
		
	Иначе
		
		ИнфоОбОшибке = "Передано неизвестное значение параметра ""Режим запуска""";
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнфоОбОшибке, "ФормаНастройки.ПриОткрытии")

	КонецЕсли;   
	
	Если НЕ Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "НадписьАдресСервисаОбновлений") = Неопределено Тогда 
		Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "НадписьАдресСервисаОбновлений").Видимость = РежимОтладки;   
	КонецЕсли;	
	Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "АдресСервисаОбновлений").Видимость = РежимОтладки;
	
	СбисЗаполнитьАдресСервера(Кэш);
	НастройкиПодключения_Было = Новый Структура(КлючиИспользовать);
	ЗаполнитьЗначенияСвойств(НастройкиПодключения_Было,	ЭтаФорма);
	
	//-------------------------------------------------------------------------------------------------------
	//Проект Расширенные проверки сопоставления номенклатуры
	Если МодульОбъектаКлиент().ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры") Тогда 
		
		Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "СопоставлениеНоменклатуры").Видимость = Истина; 
		Разделитель = ",";
		ПорядокАвтоматическогоСопоставления = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПорядокАвтоматическогоСопоставления");
		ПорядокОбхода = МодульОбъектаКлиент().СбисРазложитьСтрокуВМассивПодстрок(ПорядокАвтоматическогоСопоставления, Разделитель); 
		ЗаполнитьПорядокАвтоматическогоПоискаСопоставлений(ПорядокОбхода);
		
	Иначе
		
		Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "СопоставлениеНоменклатуры").Видимость = Ложь;
		
	КонецЕсли;                                                                                      
	//-----------------------------------------------------------------------------------------------------

	// Выбор реквуизита для заполнения кода номенклатуры в УПД
	РеквизитыКодаНоменклатуры = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("РеквизитыКодаНоменклатуры");
	Если НЕ РеквизитыКодаНоменклатуры = Неопределено Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "РеквизитКодаНоменклатуры").СписокВыбора.ЗагрузитьЗначения(РеквизитыКодаНоменклатуры);
	КонецЕсли;

	ОбновитьДоступностьНастроек();
	
КонецПроцедуры

//Процедура управляет включением/отключением вывода логов
&НаКлиенте
Процедура СбисПереключитьОтладку()
	Если РежимОтладки Тогда
		Кэш.Интеграция.ВключитьОтладку(Кэш, КаталогОтладки);
	Иначе
		Кэш.Интеграция.ОтключитьОтладку(Кэш);
	КонецЕсли;
	
	Кэш.Парам.РежимОтладки	= РежимОтладки;
	Кэш.Парам.КаталогОтладки = КаталогОтладки;
	Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "КаталогОтладки").Видимость = РежимОтладки;
	//+++ МАИ 09.09.2021 Переопределяем сервер обновлений, если пользователь в режиме отладки указал другой
	Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "АдресСервисаОбновлений").Видимость = РежимОтладки;
	Если НЕ РежимОтладки ИЛИ АдресСервисаОбновлений = "" Тогда
		АдресСервисаОбновлений = "update.sbis.ru";
		Кэш.СБИС.ПараметрыИнтеграции.Вставить("АдресСервисаОбновлений", АдресСервисаОбновлений);
	КонецЕсли;
	//--- МАИ 09.09.2021 
	
КонецПроцедуры					

Функция НастройкиЭлементовЗаполненияКонтрагента1С()
	
	СписокЭлементов = Новый Массив;
	СписокЭлементов.Добавить("ГрузополучательНеВедется");
	СписокЭлементов.Добавить("ГрузополучательКонтрагент");
	СписокЭлементов.Добавить("ГрузополучательПартнер");
	СписокЭлементов.Добавить("ТипГрузополучателя");
	
	ПараметрыНастройки = Новый Структура;
	
	Если ЗаполнениеКонтрагента1С = "ГрузополучательСБИС" Тогда
		
		ТипГрузополучателя = "ГрузополучательКонтрагент";
		
		ПараметрыНастройки.Вставить("Доступность", Ложь);		
		
   	Иначе 
		
		ПараметрыНастройки.Вставить("Доступность", Истина);
		
	КонецЕсли;
	
	Настройки = Новый Структура("СписокЭлементов, ПараметрыНастройки", СписокЭлементов, ПараметрыНастройки);
	Возврат Настройки;
	
КонецФункции

&НаКлиенте
Процедура РежимЗапускаНастройкаСоединения()
	
	ЭлементДействия = Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "НастройкиСтраницы");
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "СтраницаСоединение").Видимость   		= Истина; 
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "ЗаказыПокупателей").Видимость    		= Ложь;
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "СопоставлениеНоменклатуры").Видимость = Ложь;
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "НастройкиДокументов").Видимость  		= Ложь;
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "ОбщиеНастройки").Видимость  	   		= Ложь;
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "Сервис").Видимость  			   		= Ложь;
	//СбисЗаполнитьАдресСервера(Кэш);
	//ЗаполнитьЗначенияСвойств(НастройкиПодключения_Было, ЭтаФорма);
	
	СпособОбменаСписокВыбора	= Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "СпособОбмена").СписокВыбора;
		
	Если СпособОбменаСписокВыбора.НайтиПоЗначению(СпособОбмена) = Неопределено Тогда
		
		СписокВсехСпособовОбмена 	= МодульОбъектаКлиент().СписокИнтеграцийСБИС();
		СпособОбменаНайдено			= СписокВсехСпособовОбмена.НайтиПоЗначению(СпособОбмена);
		
		СпособОбменаЕстьВСписке		= Ложь;
		Для Каждого ЭлементСпискаОбмена Из СпособОбменаСписокВыбора Цикл
			
			Если ЭлементСпискаОбмена.Представление = СпособОбменаНайдено.Представление Тогда
				
				СпособОбменаЕстьВСписке = Истина;
				СпособОбмена			= ЭлементСпискаОбмена.Значение;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не СпособОбменаЕстьВСписке Тогда
			
			ИндексВставить = Мин(СпособОбмена, СпособОбменаСписокВыбора.Количество()) - 1;
			СпособОбменаСписокВыбора.Вставить(Макс(0, ИндексВставить), СпособОбмена, СпособОбменаНайдено.Представление);
			СпособОбменаСписокВыбора.СортироватьПоЗначению();
			
		КонецЕсли;	
		
	КонецЕсли;
		
	Если ТипПрокси = Неопределено Тогда
		
		ТипПрокси = "НеИспользовать";
		
	ИначеЕсли Не(	ТипПрокси = "Вручную"
				Или	ТипПрокси = "НеИспользовать") Тогда;
		
		ТипПрокси = "Автоматически";
		
	КонецЕсли;
	
	Если Не ТипПрокси = "Вручную" Тогда
		ПроксиСервер = "";
		ПроксиПорт   = ""; 
		ПроксиЛогин  = "";  
		ПроксиПароль = "";
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиАвтообновлениеПриИзменении(Элемент)
	Кэш.ФормаНастроек.АвтообновлениеПриИзменении(Кэш, НастройкиАвтообновление);
	ПараметрыПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаличиеСправочникаПартнеров()
	
	СписокЭлементов = Новый Массив;
	ПараметрыНастройки = Новый Структура;
	СправочникНайден = ПроверитьНаличиеСправочникаВМетаданных("Партнеры"); 
	
	Если НЕ СправочникНайден Тогда
		Если  ТипГрузополучателя = "ГрузополучательПартнер" Тогда
			ТипГрузополучателя = "ГрузополучательКонтрагент";
		КонецЕсли;
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			СписокЭлементов.Добавить("ГрузополучательПартнер");
			ПараметрыНастройки.Вставить("Видимость", Ложь); 
			Настройки = Новый Структура("СписокЭлементов, ПараметрыНастройки", СписокЭлементов, ПараметрыНастройки);
			ОбновитьНастройкиЭлементовФормы(Настройки.СписокЭлементов, Настройки.ПараметрыНастройки);
		#Иначе
			ТипГрузополучателяЭлемент = Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "ТипГрузополучателя");
			УдаляемыйЭлемент = ТипГрузополучателяЭлемент.СписокВыбора.НайтиПоЗначению("ГрузополучательПартнер");
			Если НЕ УдаляемыйЭлемент = Неопределено Тогда
				ТипГрузополучателяЭлемент.СписокВыбора.Удалить(ТипГрузополучателяЭлемент.СписокВыбора.Индекс(УдаляемыйЭлемент));
			КонецЕсли;
		#КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеСправочникаВМетаданных(ИмяСправочника)
	Если Метаданные.Справочники.Найти(ИмяСправочника) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЗаполнитьПорядокАвтоматическогоПоискаСопоставлений(ПорядокОбхода = Неопределено)
	
	ПорядокАвтоматическогоСопоставленияТабл.Очистить(); 
	
	Если ЗначениеЗаполнено(ПорядокОбхода) Тогда
		
		МасПорядокАвтоматическогоСопоставления = ПорядокОбхода;
		Для Счетчик = 0 По МасПорядокАвтоматическогоСопоставления.Количество() - 1 Цикл                             
			
			НовСтрока = ПорядокАвтоматическогоСопоставленияТабл.Добавить();
			НовСтрока.ПолеСопоставления = МасПорядокАвтоматическогоСопоставления[Счетчик];
			НовСтрока.ПолеСопоставленияИспользуется = Истина;
			
		КонецЦикла;
		
	КонецЕсли;  
	
	МасПорядокАвтоматическогоСопоставленияПоУмолчанию = Новый Массив;
	МасПорядокАвтоматическогоСопоставленияПоУмолчанию.Добавить("Артикул");
	МасПорядокАвтоматическогоСопоставленияПоУмолчанию.Добавить("КодПоставщика");
	МасПорядокАвтоматическогоСопоставленияПоУмолчанию.Добавить("КодПокупателя");
	МасПорядокАвтоматическогоСопоставленияПоУмолчанию.Добавить("GTIN");
	МасПорядокАвтоматическогоСопоставленияПоУмолчанию.Добавить("Идентификатор");
	
	Для Каждого ПолеПоУмолчанию Из МасПорядокАвтоматическогоСопоставленияПоУмолчанию Цикл
		
		Если ПорядокОбхода.Найти(ПолеПоУмолчанию) = Неопределено Тогда                            
			
			НовСтрока = ПорядокАвтоматическогоСопоставленияТабл.Добавить();
			НовСтрока.ПолеСопоставления = ПолеПоУмолчанию;
			НовСтрока.ПолеСопоставленияИспользуется = Ложь;
			
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте 
Процедура ПорядокАвтоСопоставленияПриИзменении(Элемент);
	
	ПорядокСтрока = "";
	Для Каждого Строка Из ПорядокАвтоматическогоСопоставленияТабл Цикл
		
		Если Строка.ПолеСопоставленияИспользуется Тогда
			ПорядокСтрока = ПорядокСтрока + Строка.ПолеСопоставления + ",";
		КонецЕсли;
		
	КонецЦикла;

	
	КолВоСимволовБезПоследнегоРазделителя = СтрДлина(ПорядокСтрока) - 1;
	ПорядокСтрока = Лев(ПорядокСтрока, КолВоСимволовБезПоследнегоРазделителя);
	
	ПорядокАвтоматическогоСопоставления = ПорядокСтрока;
	
	// От элемента внутри вызываемой функции нам нужно только имя, так что передадим структуру с полем "Имя"
	ПараметрФункции = Новый Структура("Имя", "ПорядокАвтоматическогоСопоставления");
	
	ПараметрыПриИзменении(ПараметрФункции);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокАвтоматическогоСопоставленияТаблПолеСопоставленияИспользуетсяПриИзменении(Элемент)
	ПорядокАвтоСопоставленияПриИзменении(Элемент);
КонецПроцедуры

// Процедура записывает в местный и глобальный кэш измененный и зависимый параметр
//
// Параметры:
//  Элемент	 - ПолеФормы - элемент, для которого устанавливаются параметры.  
//
&НаКлиенте
Процедура СоздаватьЧерновикПриИзменении(Элемент)
	
	ПараметрыПриИзменении(Элемент); 
	
	Если СоздаватьЧерновик Тогда
		ИспользоватьНовуюОтправку = Истина;  
	КонецЕсли;
	ЗависимыйЭлемент = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ИспользоватьНовуюОтправку"); 
	ПараметрыПриИзменении(ЗависимыйЭлемент); 
	
КонецПроцедуры

// Процедура записывает в местный и глобальный кэш измененный и зависимый параметр
//
// Параметры:
//  Элемент	 - ПолеФормы - элемент, для которого устанавливаются параметры. 
//
&НаКлиенте
Процедура ИспользоватьНовуюОтправкуПриИзменении(Элемент)
	
	ПараметрыПриИзменении(Элемент); 
	
	Если НЕ ИспользоватьНовуюОтправку Тогда
		СоздаватьЧерновик = Ложь;
	КонецЕсли;	
	ЗависимыйЭлемент = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "СоздаватьЧерновик"); 
	ПараметрыПриИзменении(ЗависимыйЭлемент);

КонецПроцедуры

&НаКлиенте
Процедура ПоддержкаОбменаЕИСПриИзменении(Элемент)
	ПараметрыПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УПД24ПриИзменении(Элемент)
	ПараметрыПриИзменении(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура РеквизитКодНоменклатурыПриИзменении(Элемент)
	ПараметрыПриИзменении(Элемент)
КонецПроцедуры

