
// Процедура - Обновить настройки элементов формы
//
// Параметры:
//  СписокЭлементов		 - Массив - Содержит строки с именами элементов формы, которые нужно настроить 
//  ПараметрыНастройки	 - 	Структура 	 - Параметры, которые будут установлены элементу (доступность, видимость и т.п.)
//
//			Настройка 	 -	Строка	  	 - Имя настройки элемента 
//			Значение 	 -	Произвольный - Устанавливаемое значение. Проверок на установку недопустимого значения нет, остаётся на совести программиста
//
// Пока делаю локально для формы, потому что доброска срочная
&НаКлиенте
Процедура ОбновитьНастройкиЭлементовФормы(СписокЭлементов, ПараметрыНастройки)
	
	ЭлементыДляИзменения = Новый Массив;
	
	Для Каждого ИмяЭлемента Из СписокЭлементов Цикл
		
		ЭлементФормы = Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, ИмяЭлемента);
		
		Если НЕ ЭлементФормы = Неопределено Тогда
			ЭлементыДляИзменения.Добавить(ЭлементФормы);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Элемент Из ЭлементыДляИзменения Цикл
		Для Каждого Параметр Из ПараметрыНастройки Цикл
			Элемент[Параметр.Ключ] = Параметр.Значение;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВкладкуСервис()
	
	ГруппаНастройкиСтраницы = Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "НастройкиСтраницы");
	ГруппаНастройкиСтраницы.ТекущаяСтраница = Кэш.ГлавноеОкно.сбисПолучитьСтраницу(ГруппаНастройкиСтраницы, "Сервис");

	Если Не ЭтаФорма.Таблица_Сервис.Количество() И Кэш.Ини.Свойство("Сервис") Тогда
		
		ИниСервис = Кэш.ФормаНастроек.Ини(Кэш, "Сервис");
		
		Для Каждого ПунктКоманды Из ИниСервис Цикл
			
			Если ТипЗнч(ПунктКоманды.Значение) = Тип("Структура") И ПунктКоманды.Значение.Свойство("Имя") Тогда
				
				НовыйПунктКоманды 		   = ЭтаФорма.Таблица_Сервис.Добавить();
				НовыйПунктКоманды.Ключ 	   = ПунктКоманды.Ключ;
				НовыйПунктКоманды.Имя 	   = ПунктКоманды.значение.Имя;
				НовыйПунктКоманды.Описание = ПунктКоманды.значение.Описание;
				НовыйПунктКоманды.Команда  = ПунктКоманды.значение.Значение;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Сбросим начальную страницу
	ГруппаНастройкиСтраницы.ТекущаяСтраница = Кэш.ГлавноеОкно.сбисПолучитьСтраницу(ГруппаНастройкиСтраницы, "ОбщиеНастройки"); 
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСпособХраненияМетокСтатусов(НовоеЗначениеМеток)
	
	Попытка
		МодульОбъектаКлиент().ИзменитьПараметрСбис("СпособХраненияМетокСтатусов", НовоеЗначениеМеток);
		МеткиСтатусов = Кэш.ФормаНастроек.СбисПрочитатьМеткиСтатусов(Кэш);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, МеткиСтатусов);
		ЗаполнитьЗначенияСвойств(Кэш.ГлавноеОкно, МеткиСтатусов);
		Кэш.ФормаНастроек.ИнициализироватьКэшНастроек(Кэш, Новый Структура("Обновить, Параметр", Истина, "status_marks")); //для способа хранения меток в разрезе аккаунта добавим status_marks в список параметров, хранящихся на шаблоне	
	Исключение
		ИнфаОбОшибке = ИнформацияОбОшибке();
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнфаОбОшибке, "ФормаНастройки.ИзменитьСпособХраненияМетокСтатусов")
	КонецПопытки;

КонецПроцедуры

// Процедура устанавливает видимость элементов формы в зависимости от выбранного варианта настроек прокси		
&НаКлиенте                                             
Процедура ОбновитьДоступностьНастроек(Элемент = Неопределено, ТекущаяСтраница = Неопределено)
	
	ЗакладкаОбновить	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "НастройкиСтраницы").ТекущаяСтраница;
	ОбработчикОбновить	= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ОбновитьЗакладку_" + ЗакладкаОбновить.Имя, ЭтаФорма);
	МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(,ОбработчикОбновить);
	
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
		
		ОбновитьОтображениеДанных(ЗакладкаОбновить);
	
	#КонецЕсли
			
КонецПроцедуры

&НаКлиенте                                             
Процедура ОбновитьЗакладку_СтраницаСоединение(Аргумент = Неопределено, ДопПараметры = Неопределено) Экспорт 
	
	ДоступностьПрокси = ТипПрокси = "Вручную";
	СбисЭлементВидимость = Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "ИнтеграцияAPIВызовыНаКлиенте");
	Если Не СбисЭлементВидимость = Неопределено Тогда
		#Если ВебКлиент Тогда
			СбисЭлементВидимость.Видимость = Ложь;
		#Иначе
			СбисЭлементВидимость.Видимость = (СпособОбмена = 3);
		#КонецЕсли
	КонецЕсли;
	
	Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "ШифроватьВыборочно").Видимость	= СпособОбмена = 5 Или СпособОбмена = 7;    
																  
	Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "КаталогОбмена").Видимость		= СпособОбмена = 1;
	Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "НастройкаЭП").Видимость			= СпособОбмена = 3;
	Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "КаталогОтладки").Видимость 		= РежимОтладки;
	
	Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "ПроксиСервер").Доступность		= ДоступностьПрокси;
	Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "ПроксиПорт").Доступность			= ДоступностьПрокси;
	Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "ПроксиЛогин").Доступность		= ДоступностьПрокси;
	Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "ПроксиПароль").Доступность		= ДоступностьПрокси;
	
	Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "ПорядокАвтоматическогоСопоставленияТабл").Доступность	= ИспользоватьАвтоматическоеСопоставлениеНоменклатуры;
	
	Если Не Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда 
		Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "НадписьСервер").Доступность	= ДоступностьПрокси;
		Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "НадписьПорт").Доступность	= ДоступностьПрокси;
		Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "НадписьЛогин").Доступность	= ДоступностьПрокси;
		Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "НадписьПароль").Доступность	= ДоступностьПрокси;
	КонецЕсли;
	
	Если	ДоступностьПрокси
		И	Кэш.Парам.Свойство("ПроксиСервер")
		И	СокрЛП(Кэш.Парам.ПроксиСервер) <> "" Тогда
		
		ПроксиСервер = Кэш.Парам.ПроксиСервер;
	КонецЕсли;	 
	
	//Определить возможность использования серверных настроек для интеграции
	ИнтеграцияМодуль		= МодульОбъектаКлиент().МодульИнтеграцииСБИС(СпособОбмена);
	СведенияОбИнтеграции	= ИнтеграцияМодуль.СведенияОбИнтеграции();
	
	Для Каждого Настройка Из ИнтеграцияМодуль.ВидимостьНастроек() Цикл
		
		Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, Настройка.Ключ).Видимость	= Настройка.Значение;	
		
	КонецЦикла;

	Если	СведенияОбИнтеграции.Параметры.ДоступныСерверныеНастройки	Тогда

		Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "СпособХраненияНастроек").ТолькоПросмотр	= Ложь;

	Иначе 

		СпособХраненияНастроек	= 0; 
		Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "СпособХраненияНастроек").ТолькоПросмотр	= Истина;

	КонецЕсли;
	
	НастройкиВКаталоге = СпособХраненияНастроек = 0; 
	
	Если СпособОбмена = 1 Тогда
		
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПанельНастройкаСервис").Доступность = Ложь;
		
	Иначе
		
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПанельНастройкаСервис").Доступность = Истина;
		
	КонецЕсли;
	
	Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "КаталогНастроек").Видимость = НастройкиВКаталоге;
	
	ВариантыСпособаОбмена			= Кэш.ГлавноеОкно.СбисЭлементФормы(ЭтаФорма, "СпособОбмена").СписокВыбора;	
	ДоступностьНовыхСпособовОбмена	= ДоступностьНовыхСпособовОбмена();
	
	Если НЕ ВариантыСпособаОбмена.НайтиПоЗначению(9) = Неопределено И НЕ ДоступностьНовыхСпособовОбмена.SabyHttpClient Тогда
		ВариантыСпособаОбмена.Удалить(ВариантыСпособаОбмена.НайтиПоЗначению(9));
	КонецЕсли; 
	
	Если НЕ ВариантыСпособаОбмена.НайтиПоЗначению(8) = Неопределено И НЕ ДоступностьНовыхСпособовОбмена.SabyPluginConnector Тогда
		ВариантыСпособаОбмена.Удалить(ВариантыСпособаОбмена.НайтиПоЗначению(8));
	КонецЕсли;
	
	Если ПараметрыФормы.РежимЗапуска = "НастройкиСоединения" Тогда
		Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "НастройкиАвтообновление").Видимость = НастройкиВКаталоге;
	Иначе
		Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "НастройкиАвтообновление").Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте                                             
Процедура ОбновитьЗакладку_ОбщиеНастройки(Аргумент = Неопределено, ДопПараметры = Неопределено) Экспорт 
	
	МодульТекущий = МодульОбъектаКлиент();
	
	ЭлементГенератор			= МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ИспользоватьГенератор");
	НеДоступенПереключитьФЭД	= МодульТекущий.ПолучитьЗначениеФичи("1c_fed_activate");
	АктивныАктыНакладные		= МодульТекущий.ПолучитьЗначениеФичи("1c_oldformatactnacl");
	Если НеДоступенПереключитьФЭД Тогда
		
		ЭлементГенератор.Подсказка = "Использование опции генерации XML ограничено согласно настройкам кабинета.";

	Иначе

		ЭлементГенератор.Подсказка = "При активной опции генерация XML происходит в облаке, с учетом индивидуальных настроек кабинета.";
		
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда 
		ЭлементГенератор.Доступность	= Не НеДоступенПереключитьФЭД;
	#Иначе
		ЭлементГенератор.ТолькоПросмотр	= НеДоступенПереключитьФЭД;
	#КонецЕсли

	ЭлементНадписьАдресСервисаОбновлений = МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "НадписьАдресСервисаОбновлений");
	Если НЕ ЭлементНадписьАдресСервисаОбновлений = Неопределено Тогда
		
		ЭлементНадписьАдресСервисаОбновлений.Видимость = РежимОтладки;
		
	КонецЕсли;	

	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "АдресСервисаОбновлений").Видимость		= РежимОтладки;
	МодульТекущий.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ОтображениеАктовИНакладных").Доступность = Не АктивныАктыНакладные;
	
КонецПроцедуры

&НаКлиенте                                             
Процедура ОбновитьЗакладку_НастройкиДокументов(Аргумент = Неопределено, ДопПараметры = Неопределено) Экспорт 
	
	ПолеДокументДляСчетаНаОплату	= Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "ДокументДляСчетаНаОплату");
	НадписьДокументДляСчетаНаОплату	= Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "НадписьДокументДляСчетаНаОплату");
	Если ПрикреплятьСчетНаОплатуКДокументуУПД Тогда
		ПолеДокументДляСчетаНаОплату.Видимость = Истина;
		Если НадписьДокументДляСчетаНаОплату <> Неопределено Тогда
			НадписьДокументДляСчетаНаОплату.Видимость = Истина;
		КонецЕсли;
	Иначе
		ПолеДокументДляСчетаНаОплату.Видимость = Ложь;
		Если НадписьДокументДляСчетаНаОплату <> Неопределено Тогда
			НадписьДокументДляСчетаНаОплату.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте                                             
Процедура ОбновитьЗакладку_СопоставлениеНоменклатуры(Аргумент = Неопределено, ДопПараметры = Неопределено) Экспорт 
	
	ТекМодуль = МодульОбъектаКлиент();
	
	ЭлементСпособСопоставленияНоменклатуры						= ТекМодуль.ПолучитьЭлементФормыОбработки(ЭтаФорма, "СпособСопоставленияНоменклатуры");
	КнопкаПеренестиСопоставления								= ТекМодуль.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПеренестиСопоставления");
	ЭлементИспользоватьАвтоматическоеСопоставлениеНоменклатуры	= ТекМодуль.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ИспользоватьАвтоматическоеСопоставлениеНоменклатуры");
	ЭлементИспользоватьОбратноеСопоставление					= ТекМодуль.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ИспользоватьОбратноеСопоставление");
	ЭлементВключенПереносСтарогоСопоставления					= ТекМодуль.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ВключенПереносСтарогоСопоставления");
	ЭлементПорядокАвтоматическогоСопоставленияФрм				= ТекМодуль.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПорядокАвтоматическогоСопоставленияТабл");
	
	ЭлементПорядокАвтоматическогоСопоставленияФрм.Доступность	= ИспользоватьАвтоматическоеСопоставлениеНоменклатуры;
	// --> 12123099	
	ФичаРасширеноеСопоставлениеНоменклатурыВлючена 				= МодульОбъектаКлиент().ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры")
																	ИЛИ МодульОбъектаКлиент().ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры4100");
																		
	ДопПараметрыСопоставНоменклатуры                            = Новый Структура("ТекСпособСопоставНоменклатуры", МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("СпособСопоставленияНоменклатуры"));
	ДоступныеСпособыСопоставленияНоменклатуры 					= МодульОбъектаКлиент().СписокДоступныхСпособовСопоставленияНоменклатуры("Интерфейс", ДопПараметрыСопоставНоменклатуры);	
	
	ПараметрыИзменить = Новый Структура("СписокВыбора",ДоступныеСпособыСопоставленияНоменклатуры);
	ЭлементИзменить = ТекМодуль.ПолучитьЭлементФормыОбработки(ЭтаФорма, "СпособСопоставленияНоменклатуры");
	ТекМодуль.ИзменитьЭлементФормыОбработки(ЭлементИзменить, ПараметрыИзменить);
	СпособСопоставленияНоменклатуры = СпособСопоставленияНоменклатуры;//ВывестиСпособыСопоставленияНоменклатуры(ДоступныеСпособыСопоставленияНоменклатуры, ФичаРасширеноеСопоставлениеНоменклатурыВлючена);
																	
	// <-- 12123099													
	Если СпособСопоставленияНоменклатуры = 1 Тогда
		//TODO Временно отключаем возможность переноса сопоставлений в DBF (до реализации фун. "ПереносСопоставлений" на DBF)
		КнопкаПеренестиСопоставления.Видимость	= Ложь;
	ИначеЕсли ФичаРасширеноеСопоставлениеНоменклатурыВлючена Тогда // 12123099
		Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПараметрыПереносаСопоставлений_Завершен") Тогда // 12123099 
			КнопкаПеренестиСопоставления.Заголовок	= "Перенос выполнен (повторить)";
			КнопкаПеренестиСопоставления.Видимость	= Истина;
		ИначеЕсли МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПараметрыПереносаСопоставлений_Начат") Тогда
			КнопкаПеренестиСопоставления.Заголовок	= "Продолжить перенос";
			КнопкаПеренестиСопоставления.Видимость	= Истина;
		Иначе
			КнопкаПеренестиСопоставления.Заголовок	= "Выполнить перенос";
			КнопкаПеренестиСопоставления.Видимость	= Истина;
		КонецЕсли;// 12123099
	КонецЕсли;
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры_ОбратноеСопоставление") Тогда
		ЭлементИспользоватьОбратноеСопоставление.Видимость = Истина;
	Иначе
		ЭлементИспользоватьОбратноеСопоставление.Видимость = Ложь;
	КонецЕсли;
	
	ИспользоватьНовоеСопоставлениеНоменклатуры = СпособСопоставленияНоменклатуры = 0;
		
	// Глобальная доступность настроек от галки ИспользоватьНовоеСопоставлениеНоменклатуры
	// Оставлять внизу функции
	КнопкаПеренестиСопоставления.Доступность								= ИспользоватьНовоеСопоставлениеНоменклатуры;
	ЭлементИспользоватьАвтоматическоеСопоставлениеНоменклатуры.Доступность	= ИспользоватьНовоеСопоставлениеНоменклатуры;
	ЭлементИспользоватьОбратноеСопоставление.Доступность					= ИспользоватьНовоеСопоставлениеНоменклатуры;
	ЭлементВключенПереносСтарогоСопоставления.Доступность					= ИспользоватьНовоеСопоставлениеНоменклатуры;
	ЭлементПорядокАвтоматическогоСопоставленияФрм.Доступность				= ИспользоватьНовоеСопоставлениеНоменклатуры;
		
	ВидимостьЭлементовРасширенногоСопоставленияНоменклатуры(ИспользоватьНовоеСопоставлениеНоменклатуры);
	
КонецПроцедуры

&НаКлиенте                                             
Процедура ОбновитьЗакладку_Сервис(Аргумент = Неопределено, ДопПараметры = Неопределено) Экспорт 
			
КонецПроцедуры

&НаКлиенте                                             
Процедура ОбновитьЗакладку_ЗаказыПокупателей(Аргумент = Неопределено, ДопПараметры = Неопределено) Экспорт 
			
КонецПроцедуры

// Функция - проверяет наличие обработок с внешними компонентами интеграции в справочнике доп. обработок
// 
// Возвращаемое значение:  Структура("SabyHttpClient, SabyPluginConnector", Булево, Булево);
//   - 
//
&НаСервере
Функция ДоступностьНовыхСпособовОбмена()

	Результат						= Новый Структура("SabyHttpClient, SabyPluginConnector", Ложь, Ложь);
	ПараметрыФункций				= Новый Структура("ИмяОбработки", "SabyHttpClient");	
	Если НЕ МодульОбъектаСервер().ВнешняяОбработка_НайтиПоИмениНаСервере(ПараметрыФункций) = Неопределено Тогда
		Результат.SabyHttpClient = Истина;
	КонецЕсли;	
	
	ПараметрыФункций 				= Новый Структура("ИмяОбработки", "SabyPluginConnector");	
	Если НЕ МодульОбъектаСервер().ВнешняяОбработка_НайтиПоИмениНаСервере(ПараметрыФункций) = Неопределено Тогда
		Результат.SabyPluginConnector = Истина;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СбисВыбратьКаталог(СтароеЗначение)
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	ДиалогОткрытия.Каталог		= СтароеЗначение;
	ДиалогОткрытия.Заголовок	= "Выберите каталог"; 
	Если ДиалогОткрытия.Выбрать() Тогда 
		Возврат Кэш.ОбщиеФункции.СбисФорматКаталога(ДиалогОткрытия.Каталог, Кэш.ПараметрыСистемы.Клиент); 
	КонецЕсли;
	
	Возврат	СтароеЗначение;
	
КонецФункции

//Заполняет список адресов сервера
&НаКлиенте
Процедура СбисЗаполнитьАдресСервера(Кэш)
	
	Если Не ЗначениеЗаполнено(АдресСервера) Тогда
		АдресСервера = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("АдресСервера");
	КонецЕсли;
	
    РазобранныйАдрес = МодульОбъектаКлиент().СбисРазобратьАдресСервера(АдресСервера);
    Country = ВРег(РазобранныйАдрес.Зона);
    Contour = РазобранныйАдрес.Поддомен;	
    Domain = РазобранныйАдрес.Домен;
	
	ЭлементГОСТTLS = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ГОСТTLS");
	Если РазобранныйАдрес.Шифрование Тогда
		ЭлементГОСТTLS.Видимость = Истина;
		ГОСТTLS = Истина;
	Иначе
		ЭлементНевидимаяКнопка = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "НевидимаяКнопка");
		ЭлементНевидимаяКнопка.Видимость = Истина;
		ЭлементГОСТTLS.Видимость = Ложь;
		ГОСТTLS = Ложь;
	КонецЕсли;
	
	Если Contour = "fix" 
		Или Contour = "test" 
		Или Contour = "pre-test" Тогда
		testContour = Истина;
	Иначе
		testContour = Ложь;
	КонецЕсли;
	СчетчикНажатий = 0;	
	СбисДополнитьРеквизитыСтран();
    ОбновитьСписокДоступныхДоменов();
	ОбновитьСписокДоступныхСтендов();	
	
КонецПроцедуры

&НаКлиенте
Функция СбисПолучитьСтруктуруРазобраногоАдреса()
	
	СтруктураАдреса = Новый Структура;
	СтруктураАдреса.Вставить("Страна",	Country);
	СтруктураАдреса.Вставить("Домен",	Domain);
	СтруктураАдреса.Вставить("Стенд",	Contour);
	СтруктураАдреса.Вставить("ГОСТTLS",	ГОСТTLS);
	
	Возврат СтруктураАдреса;
	
КонецФункции 

// Процедура записывает выбранные настройки в сохраняемые параметры и закрывает форму	
&НаКлиенте
Функция СобратьНастройки()
		
	НастройкиПодключения_Результат	= Новый Структура(КлючиИспользовать);
	НастройкиПодключения_Завершение	= Новый Структура(КлючиИспользовать);
	ЗаполнитьЗначенияСвойств(НастройкиПодключения_Результат,	ЭтаФорма);
 	ЗаполнитьЗначенияСвойств(НастройкиПодключения_Завершение,	ЭтаФорма);
	
	Возврат НастройкиПодключения_Результат;

КонецФункции

&НаКлиенте
Процедура СбисПрименитьНастройки_Завершение(АргументыИзменены, ДопПараметры=Неопределено) Экспорт
	
	ПараметрыЗавершения = Новый Структура;
	ПараметрыЗавершения.Вставить("ПовторныйЗапуск",			Истина);
	ПараметрыЗавершения.Вставить("ИзмененаФормаНастроек",	АргументыИзменены.ТребуетсяПеречитатьНастройки);
	ПараметрыЗавершения.Вставить("РазделДо",				Кэш.Текущий.ТипДок);

	Если		АргументыИзменены.ТребуетсяАвторизация Тогда
		
		ФормаАвторизация = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаАвторизация");
		Если ФормаАвторизация.Открыта() Тогда
			
			// Обновить данные формы авторизации
			ФормаАвторизация.ПоказатьПоверх();
			
		Иначе
			
			Кэш.ГлавноеОкно.ПослеОткрытияАвторизация(ПараметрыЗавершения);
			
		КонецЕсли;
		
	ИначеЕсли	АргументыИзменены.ТребуетсяПеречитатьНастройки Тогда
		
		Кэш.ГлавноеОкно.ПослеОткрытияЗавершение(ПараметрыЗавершения);
		
	КонецЕсли;
	
КонецПроцедуры

//Выполняет вызов проверки автообновления
&НаКлиенте
Процедура СбисПроверитьНаличиеОбновлений(ПараметрыПроверки, ДоПараметры = Неопределено) Экспорт
	
	Попытка
		Если ЗначениеЗаполнено(Кэш.Парам.ОжидаемаяВерсия) Тогда
			Сообщить("На текущий момент обновление не требуется - установлена актуальная версия внешней обработки");
			Возврат;
		КонецЕсли;
		
		Кэш.ГлавноеОкно.сбисПоказатьСостояние("Проверка наличия обновлений");
		Кэш.ОбщиеФункции.СбисПроверитьНаличиеОбновлений(Кэш, ПараметрыПроверки);
		Кэш.ГлавноеОкно.сбисСпрятатьСостояние();
		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнфоОбОшибке, "ФормаГлавноеОкно.СбисПроверитьНаличиеОбновлений");
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыОткрытия)
		
	ПараметрыФормы.Вставить("РежимЗапуска");
	
	ИзмененныеПараметры = Новый Структура;
	МодульОбъектаКлиент = МодульОбъектаКлиент();
	
	Если		ПараметрыОткрытия = Неопределено Тогда
		ПараметрыФормы.РежимЗапуска = "ОбщиеНастройки";
	Иначе
		Если Не	ПараметрыОткрытия.Свойство("РежимЗапуска", ПараметрыФормы.РежимЗапуска) Тогда
			ПараметрыФормы.РежимЗапуска = "ОбщиеНастройки";
		КонецЕсли;
		Если ПараметрыОткрытия.Свойство("Кэш") Тогда
			Кэш = ПараметрыОткрытия.Кэш;
		КонецЕсли;
	КонецЕсли;
	
	Если Кэш = Неопределено Тогда
		Кэш = ВладелецФормы.Кэш;
	КонецЕсли;
	
	Если КлючиИспользовать = Неопределено Тогда
		КлючиИспользовать = "";
		Для Каждого КлючИЗначениеКонтроль Из Кэш.Парам Цикл
			КлючиИспользовать = КлючиИспользовать + "," + КлючИЗначениеКонтроль.Ключ;
		КонецЦикла;
		КлючиИспользовать = Сред(КлючиИспользовать, 2);
	КонецЕсли;
	 //КлючиИспользовать = "СпособОбмена, СпособХраненияНастроек, КаталогНастроек, КаталогОбмена, АдресСервера, ШифроватьВыборочно, ВремяОжиданияОтвета
	 //   			|, ТипПрокси, ПроксиСервер, ПроксиПорт, ПроксиЛогин";

	// Выбор реквизита для заполнения кода номенклатуры в УПД
	РеквизитыКодаНоменклатуры = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("РеквизитыКодаНоменклатуры");
	Если НЕ РеквизитыКодаНоменклатуры = Неопределено Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "РеквизитКодаНоменклатуры").СписокВыбора.ЗагрузитьЗначения(РеквизитыКодаНоменклатуры);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Кэш.Парам, , "ПорядокАвтоматическогоСопоставления");
	
	Если ПараметрыФормы.РежимЗапуска = "ОбщиеНастройки" Тогда
		
		РежимЗапускаОбщиеНастройки();
		
	ИначеЕсли ПараметрыФормы.РежимЗапуска = "НастройкиСоединения" Тогда   
		
		РежимЗапускаНастройкаСоединения();
		
	ИначеЕсли ПараметрыФормы.РежимЗапуска = "Сервисы" Тогда
		
		РежимЗапускаСервис();
		
	Иначе
		
		ИнфоОбОшибке = "Передано неизвестное значение параметра ""Режим запуска""";
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнфоОбОшибке, "ФормаНастройки.ПриОткрытии")

	КонецЕсли;   
	
	СбисЗаполнитьАдресСервера(Кэш);
	НастройкиПодключения_Было = Новый Структура(КлючиИспользовать);
	ЗаполнитьЗначенияСвойств(НастройкиПодключения_Было,	ЭтаФорма);
	
	Если ПараметрыОткрытия.Свойство("ПараметрыУстановить") Тогда
		
		// При открытии формы заранее задаются параметры, которые могут быть обработаны как измененные
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ПараметрыОткрытия.ПараметрыУстановить);
		
	КонецЕсли;	
	
	ОбновитьДоступностьНастроек();
		
КонецПроцедуры

//Процедура управляет включением/отключением вывода логов
&НаКлиенте
Процедура СбисПереключитьОтладку()
	Если РежимОтладки Тогда
		Кэш.Интеграция.ВключитьОтладку(Кэш, КаталогОтладки);
	Иначе
		Кэш.Интеграция.ОтключитьОтладку(Кэш);
	КонецЕсли;
	
	Кэш.Парам.РежимОтладки	= РежимОтладки;
	Кэш.Парам.КаталогОтладки = КаталогОтладки;
	Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "КаталогОтладки").Видимость = РежимОтладки;
	
КонецПроцедуры					

Функция НастройкиЭлементовЗаполненияКонтрагента1С()
	
	СписокЭлементов = Новый Массив;
	СписокЭлементов.Добавить("ГрузополучательНеВедется");
	СписокЭлементов.Добавить("ГрузополучательКонтрагент");
	СписокЭлементов.Добавить("ГрузополучательПартнер");
	СписокЭлементов.Добавить("ТипГрузополучателя");
	
	ПараметрыНастройки = Новый Структура;
	
	Если ЗаполнениеКонтрагента1С = "ГрузополучательСБИС" Тогда
		
		ТипГрузополучателя = "ГрузополучательКонтрагент";
		
		ПараметрыНастройки.Вставить("Доступность", Ложь);		
		
   	Иначе 
		
		ПараметрыНастройки.Вставить("Доступность", Истина);
		
	КонецЕсли;
	
	Настройки = Новый Структура("СписокЭлементов, ПараметрыНастройки", СписокЭлементов, ПараметрыНастройки);
	Возврат Настройки;
	
КонецФункции

&НаКлиенте
Процедура РежимЗапускаНастройкаСоединения()
	
	МодульОбъектаКлиент = МодульОбъектаКлиент();

	ЭлементДействия = МодульОбъектаКлиент.ПолучитьЭлементФормыОбработки(ЭтаФорма, "НастройкиСтраницы");
	Страница		= МодульОбъектаКлиент.ПолучитьЭлементФормыОбработки(ЭлементДействия, "СтраницаСоединение");

	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "СтраницаСоединение").Видимость   		= Истина; 
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "ЗаказыПокупателей").Видимость    		= Ложь;
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "СопоставлениеНоменклатуры").Видимость	= Ложь;
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "НастройкиДокументов").Видимость  		= Ложь;
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "ОбщиеНастройки").Видимость  	   			= Ложь;
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "Сервис").Видимость  			   			= Ложь;
	//СбисЗаполнитьАдресСервера(Кэш);
	//ЗаполнитьЗначенияСвойств(НастройкиПодключения_Было, ЭтаФорма);
	
	СпособОбменаСписокВыбора	= Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "СпособОбмена").СписокВыбора;
		
	Если СпособОбменаСписокВыбора.НайтиПоЗначению(СпособОбмена) = Неопределено Тогда
		
		СписокВсехСпособовОбмена 	= МодульОбъектаКлиент().СписокИнтеграцийСБИС();
		СпособОбменаНайдено			= СписокВсехСпособовОбмена.НайтиПоЗначению(СпособОбмена);
		
		СпособОбменаЕстьВСписке		= Ложь;
		Для Каждого ЭлементСпискаОбмена Из СпособОбменаСписокВыбора Цикл
			
			Если ЭлементСпискаОбмена.Представление = СпособОбменаНайдено.Представление Тогда
				
				СпособОбменаЕстьВСписке = Истина;
				СпособОбмена			= ЭлементСпискаОбмена.Значение;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не СпособОбменаЕстьВСписке Тогда
			
			ИндексВставить = Мин(СпособОбмена, СпособОбменаСписокВыбора.Количество()) - 1;
			СпособОбменаСписокВыбора.Вставить(Макс(0, ИндексВставить), СпособОбмена, СпособОбменаНайдено.Представление);
			СпособОбменаСписокВыбора.СортироватьПоЗначению();
			
		КонецЕсли;	
		
	КонецЕсли;
		
	Если ТипПрокси = Неопределено Тогда
		
		ТипПрокси = "НеИспользовать";
		
	ИначеЕсли Не(	ТипПрокси = "Вручную"
				Или	ТипПрокси = "НеИспользовать") Тогда;
		
		ТипПрокси = "Автоматически";
		
	КонецЕсли;
	
	Если Не ТипПрокси = "Вручную" Тогда
		ПроксиСервер = "";
		ПроксиПорт   = ""; 
		ПроксиЛогин  = "";  
		ПроксиПароль = "";
	КонецЕсли;
	
	ЭлементДействия.ТекущаяСтраница = Страница;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимЗапускаОбщиеНастройки()
	
	МодульОбъектаКлиент = МодульОбъектаКлиент();
  	ЭлементДействия		= Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "НастройкиСтраницы");

	ЗаполнитьВкладкуСервис();
	//Обновить метки статусов при открытии формы
	МодульОбъектаКлиент.ОбновитьМеткиСтатусов(, Кэш);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Кэш.ГлавноеОкно, "ДатаПоследнегоЗапросаСтатусов, ИдентификаторПоследнегоСобытия, ДатНачЧтенияСтатусов, ДатКнцЧтенияСтатусов");
	
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "СопоставлениеНоменклатуры").Видимость	= Истина;
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "СтраницаСоединение").Видимость			= Истина;
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "НастройкиДокументов").Видимость			= Истина;
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "ОбщиеНастройки").Видимость				= Истина;
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "Сервис").Видимость						= Ложь;

	ВариантыВыбора		= МодульОбъектаКлиент.СписокДоступныхСпособовВариантовФильтраПериод();
	ПараметрыИзменения	= Новый ФиксированнаяСтруктура("СписокВыбора", ВариантыВыбора);
	
	ЭлементВыборДатаДок	= МодульОбъектаКлиент.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДатаДокумента_ВыборИзСписка");
	ЭлементВыборВхДата	= МодульОбъектаКлиент.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ВходящаяДата_ВыборИзСписка");
	МодульОбъектаКлиент.ИзменитьЭлементФормыОбработки(ЭлементВыборДатаДок,	ПараметрыИзменения);
	МодульОбъектаКлиент.ИзменитьЭлементФормыОбработки(ЭлементВыборВхДата,	ПараметрыИзменения);
	
	ВариантыВыбора		= МодульОбъектаКлиент.СписокДоступныхСпособовВариантовФильтраНомер();
	ПараметрыИзменения	= Новый ФиксированнаяСтруктура("СписокВыбора", ВариантыВыбора);
	ЭлементВыборВхНомер	= МодульОбъектаКлиент.ПолучитьЭлементФормыОбработки(ЭтаФорма, "ВходящийНомер_ВыборИзСписка");
  	МодульОбъектаКлиент.ИзменитьЭлементФормыОбработки(ЭлементВыборВхНомер,	ПараметрыИзменения);

	ДатаДокумента_ВыборИзСпискаПриИзменении(ЭлементВыборДатаДок);
	ВходящаяДата_ВыборИзСпискаПриИзменении(ЭлементВыборВхДата);
	
	// Перезаполнить свойства для ОФ чтобы сработали изменения в списках интерфейса
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ЭтаФорма, "ПоискПоДате_Отклонение, ПоискПоДате, ПоискВходящаяДата, ПоискВходящаяДата_Отклонение, СопоставлениеПоНомеру");
	
	СписокСпособовХранения	= Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "СпособХраненияМетокСтатусов").СписокВыбора;
	СписокЭлементВ_ИБ		= СписокСпособовХранения.НайтиПоЗначению(2);
	Если МодульОбъектаКлиент().ИспользоватьСбисПараметрыДляХраненияОбщихНастроек() Тогда
		Если Не СписокЭлементВ_ИБ = Неопределено Тогда
			СписокСпособовХранения.Удалить(СписокЭлементВ_ИБ);
		КонецЕсли;
	ИначеЕсли СписокЭлементВ_ИБ = Неопределено Тогда
		СписокСпособовХранения.Добавить(2, "Информационной базы");
	КонецЕсли;
	
	// Обработка выбора номенклатуры при загрузке
	ЭлементИзменить		= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "СпособЗагрузки");
	ПараметрыИзменить	= Новый Структура("СписокВыбора", МодульОбъектаКлиент().СписокДоступныхСпособовОбработкиНоменклатуры());
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ЭлементИзменить, ПараметрыИзменить);
		
	ЭлементИзменить		= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "РежимЗагрузки");
	ПараметрыИзменить.СписокВыбора = МодульОбъектаКлиент().СписокДоступныхСпособовОбработкиДокументов();
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ЭлементИзменить, ПараметрыИзменить);

	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "ЗаказыПокупателей").Видимость   = Истина;
	
	Если НЕ ЗначениеЗаполнено(СкладПоУмолчанию) 
		И Кэш.ФормаНастроек.ПараметрыРаботы.Свойство("СправочникСклады")
		И ЗначениеЗаполнено(Кэш.ФормаНастроек.ПараметрыРаботы.СправочникСклады) Тогда
		
		НаименованиеТипа = СокрЛП(Кэш.ФормаНастроек.ПараметрыРаботы.СправочникСклады);
		ЭлементСкладПоУмолчанию = Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "СкладПоУмолчанию");
		ЭлементСкладПоУмолчанию.ОграничениеТипа = Новый ОписаниеТипов(НаименованиеТипа);
		
		ИмяСправочника = СтрЗаменить(НаименованиеТипа, "Ссылка", ""); 
		СкладПоУмолчанию = ПредопределенноеЗначение(ИмяСправочника + ".ПустаяСсылка");
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РасСчетПоУмолчанию) 
		И Кэш.ФормаНастроек.ПараметрыРаботы.Свойство("СправочникРасСчет")
		И ЗначениеЗаполнено(Кэш.ФормаНастроек.ПараметрыРаботы.СправочникРасСчет) Тогда
		
		НаименованиеТипа = СокрЛП(Кэш.ФормаНастроек.ПараметрыРаботы.СправочникРасСчет);
		ЭлементРасСчет = Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "РасСчетПоУмолчанию");
		ЭлементРасСчет.ОграничениеТипа = Новый ОписаниеТипов(НаименованиеТипа);
		
		ИмяСправочника = СтрЗаменить(НаименованиеТипа, "Ссылка", ""); 
		РасСчетПоУмолчанию = ПредопределенноеЗначение(ИмяСправочника + ".ПустаяСсылка");

		ЭлементыДляОбновления = Новый Массив;
		ЭлементыДляОбновления.Добавить("РасСчетПоУмолчанию");
		ЭлементыДляОбновления.Добавить("НадписьРасСчет");
		ПараметрНастройки = Новый Структура("Видимость", Ложь);
		ОбновитьНастройкиЭлементовФормы(ЭлементыДляОбновления, ПараметрНастройки);				
	Иначе
		
		РасСчетПоУмолчанию = Неопределено;
		Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭтаФорма, "РасСчетПоУмолчанию").Видимость = Ложь;   // Если заполнен расчетный счет, но из инишки не подтянулся справочник, то принудительно очищаем и прячем
		ЭлементыДляОбновления = Новый Массив;
		ЭлементыДляОбновления.Добавить("РасСчетПоУмолчанию");
		ЭлементыДляОбновления.Добавить("НадписьРасСчет");
		ПараметрНастройки = Новый Структура("Видимость", Ложь);
		ОбновитьНастройкиЭлементовФормы(ЭлементыДляОбновления, ПараметрНастройки);
		
	КонецЕсли;  
	
	Настройки = НастройкиЭлементовЗаполненияКонтрагента1С();	
	ОбновитьНастройкиЭлементовФормы(Настройки.СписокЭлементов, Настройки.ПараметрыНастройки); 
	ПроверитьНаличиеСправочникаПартнеров();
		
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "АвтоматическоеПроведениеЗаказов").Видимость = Истина;
		
	Если ЗначениеЗаполнено(ДокументДляСчетаНаОплату) Тогда
		УстановитьСписокДокументовДляСчетаНаОплату();
		ДокументДляСчетаНаОплату = ДокументДляСчетаНаОплату;
	КонецЕсли;
	
	ОбновитьДоступностьНастроек();	

КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлементовРасширенногоСопоставленияНоменклатуры(Использовать) 
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ИспользоватьАвтоматическоеСопоставлениеНоменклатуры").Видимость = Использовать; 
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ИспользоватьОбратноеСопоставление").Видимость                   = Использовать;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ВключенПереносСтарогоСопоставления").Видимость                  = Использовать;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПорядокАвтоматическогоСопоставленияТабл").Видимость             = Использовать;
    МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ГруппаПорядокАвтоматическогоСопоставленияФрм").Видимость        = Использовать;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПеренестиСопоставления").Видимость 					           = Использовать;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ИспользоватьНовоеСопоставлениеНоменклатуры").Видимость          = Использовать;
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "КоманднаяПанельПорядокАвтоматическогоСопоставления").Видимость  = Использовать;
	#КонецЕсли
	
	Если Использовать Тогда 
		
		Разделитель = ",";
		ПорядокАвтоматическогоСопоставления = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПорядокАвтоматическогоСопоставления");
		ПорядокОбхода = МодульОбъектаКлиент().СбисРазложитьСтрокуВМассивПодстрок(ПорядокАвтоматическогоСопоставления, Разделитель); 
		ЗаполнитьПорядокАвтоматическогоПоискаСопоставлений(ПорядокОбхода);				
		
	КонецЕсли;
	
КонецПроцедуры
// <-- 12123099	
&НаКлиенте
Процедура РежимЗапускаСервис()

	МодульОбъектаКлиент = МодульОбъектаКлиент();

	ЭлементДействия = МодульОбъектаКлиент.ПолучитьЭлементФормыОбработки(ЭтаФорма, "НастройкиСтраницы");
	Страница		= МодульОбъектаКлиент.ПолучитьЭлементФормыОбработки(ЭлементДействия, "СтраницаСоединение");
	
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "СтраницаСоединение").Видимость   = Ложь;
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "НастройкиДокументов").Видимость  = Ложь;
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "ОбщиеНастройки").Видимость  	   = Ложь;  
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "ЗаказыПокупателей").Видимость    = Ложь;
	Кэш.ГлавноеОкно.СбисПолучитьЭлементФормы(ЭлементДействия, "Сервис").Видимость  			   = Истина;
	ЗаполнитьВкладкуСервис();
	
	ЭлементДействия.ТекущаяСтраница = Страница;

КонецПроцедуры

&НаКлиенте
Процедура НастройкиАвтообновлениеПриИзменении(Элемент)
	Кэш.ФормаНастроек.АвтообновлениеПриИзменении(Кэш, НастройкиАвтообновление);
	ПараметрыПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаличиеСправочникаПартнеров()
	
	СписокЭлементов = Новый Массив;
	ПараметрыНастройки = Новый Структура;
	СправочникНайден = ПроверитьНаличиеСправочникаВМетаданных("Партнеры"); 
	
	Если НЕ СправочникНайден Тогда
		Если  ТипГрузополучателя = "ГрузополучательПартнер" Тогда
			ТипГрузополучателя = "ГрузополучательКонтрагент";
		КонецЕсли;
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			СписокЭлементов.Добавить("ГрузополучательПартнер");
			ПараметрыНастройки.Вставить("Видимость", Ложь); 
			Настройки = Новый Структура("СписокЭлементов, ПараметрыНастройки", СписокЭлементов, ПараметрыНастройки);
			ОбновитьНастройкиЭлементовФормы(Настройки.СписокЭлементов, Настройки.ПараметрыНастройки);
		#Иначе
			ТипГрузополучателяЭлемент = Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "ТипГрузополучателя");
			УдаляемыйЭлемент = ТипГрузополучателяЭлемент.СписокВыбора.НайтиПоЗначению("ГрузополучательПартнер");
			Если НЕ УдаляемыйЭлемент = Неопределено Тогда
				ТипГрузополучателяЭлемент.СписокВыбора.Удалить(ТипГрузополучателяЭлемент.СписокВыбора.Индекс(УдаляемыйЭлемент));
			КонецЕсли;
		#КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеСправочникаВМетаданных(ИмяСправочника)
	Если Метаданные.Справочники.Найти(ИмяСправочника) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЗаполнитьПорядокАвтоматическогоПоискаСопоставлений(ПорядокОбхода = Неопределено)
	
	ПорядокАвтоматическогоСопоставленияТабл.Очистить(); 
	
	Если ЗначениеЗаполнено(ПорядокОбхода) Тогда
		
		МасПорядокАвтоматическогоСопоставления = ПорядокОбхода;
		Для Счетчик = 0 По МасПорядокАвтоматическогоСопоставления.Количество() - 1 Цикл                             
			
			НовСтрока = ПорядокАвтоматическогоСопоставленияТабл.Добавить();
			НовСтрока.ПолеСопоставления = МасПорядокАвтоматическогоСопоставления[Счетчик];
			НовСтрока.ПолеСопоставленияИспользуется = Истина;
			
		КонецЦикла;
		
	КонецЕсли;  
	
	МасПорядокАвтоматическогоСопоставленияПоУмолчанию = МодульОбъектаСервер().ПорядокАвтоматическогоСопоставленияПоУмолчанию();
	
	Для Каждого ПолеПоУмолчанию Из МасПорядокАвтоматическогоСопоставленияПоУмолчанию Цикл
		
		Если ПорядокОбхода.Найти(ПолеПоУмолчанию) = Неопределено Тогда                            
			
			НовСтрока = ПорядокАвтоматическогоСопоставленияТабл.Добавить();
			НовСтрока.ПолеСопоставления = ПолеПоУмолчанию;
			НовСтрока.ПолеСопоставленияИспользуется = Ложь;
			
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте 
Процедура ПорядокАвтоСопоставленияПриИзменении(Элемент);
	
	ПорядокСтрока = "";
	Для Каждого Строка Из ПорядокАвтоматическогоСопоставленияТабл Цикл
		
		Если Строка.ПолеСопоставленияИспользуется Тогда
			ПорядокСтрока = ПорядокСтрока + Строка.ПолеСопоставления + ",";
		КонецЕсли;
		
	КонецЦикла;

	
	КолВоСимволовБезПоследнегоРазделителя = СтрДлина(ПорядокСтрока) - 1;
	ПорядокСтрока = Лев(ПорядокСтрока, КолВоСимволовБезПоследнегоРазделителя);
	
	ПорядокАвтоматическогоСопоставления = ПорядокСтрока;
	
	// От элемента внутри вызываемой функции нам нужно только имя, так что передадим структуру с полем "Имя"
	ПараметрФункции = Новый Структура("Имя", "ПорядокАвтоматическогоСопоставления");
	
	ПараметрыПриИзменении(ПараметрФункции);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокАвтоматическогоСопоставленияТаблПолеСопоставленияИспользуетсяПриИзменении(Элемент)
	ПорядокАвтоСопоставленияПриИзменении(Элемент);
КонецПроцедуры

// Процедура записывает в местный и глобальный кэш измененный и зависимый параметр
//
// Параметры:
//  Элемент	 - ПолеФормы - элемент, для которого устанавливаются параметры.  
//
&НаКлиенте
Процедура СоздаватьЧерновикПриИзменении(Элемент)
	
	ПараметрыПриИзменении(Элемент); 
	
	Если СоздаватьЧерновик Тогда
		ИспользоватьНовуюОтправку = Истина;  
	КонецЕсли;
	ЗависимыйЭлемент = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ИспользоватьНовуюОтправку"); 
	ПараметрыПриИзменении(ЗависимыйЭлемент); 
	
КонецПроцедуры

// Процедура записывает в местный и глобальный кэш измененный и зависимый параметр
//
// Параметры:
//  Элемент	 - ПолеФормы - элемент, для которого устанавливаются параметры. 
//
&НаКлиенте
Процедура ИспользоватьНовуюОтправкуПриИзменении(Элемент)
	
	ПараметрыПриИзменении(Элемент); 
	
	Если НЕ ИспользоватьНовуюОтправку Тогда
		СоздаватьЧерновик = Ложь;
	КонецЕсли;	
	ЗависимыйЭлемент = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "СоздаватьЧерновик"); 
	ПараметрыПриИзменении(ЗависимыйЭлемент);

КонецПроцедуры

&НаКлиенте
Процедура ПоддержкаОбменаЕИСПриИзменении(Элемент)
	ПараметрыПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитКодНоменклатурыПриИзменении(Элемент)
	ПараметрыПриИзменении(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ДокументДляСчетаНаОплатуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	УстановитьСписокДокументовДляСчетаНаОплату();
	
КонецПроцедуры

&НаКлиенте 
Процедура ДокументДляСчетаНаОплатуНачалоВыбораИзСпискаОФ(Элемент, СтандартнаяОбработка) 	
	УстановитьСписокДокументовДляСчетаНаОплату();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСписокДокументовДляСчетаНаОплату()
	
	ЭлементДокументДляСчетаНаОплату = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДокументДляСчетаНаОплату");
	
	Если ЗначениеЗаполнено(ЭлементДокументДляСчетаНаОплату.СписокВыбора) Тогда
		Возврат;
	КонецЕсли;
	
	СписокДокументовДляСчетаНаОплату = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("СписокДокументовДляСчетаНаОплату");
	
	Для Каждого СтрДокументДляСчетаНаОплату Из СписокДокументовДляСчетаНаОплату Цикл
		
		ИниСчета = МодульОбъектаКлиент().ИниПоПараметрам(СтрДокументДляСчетаНаОплату);
		Если ИниСчета = Неопределено Тогда
			// Нет ини со счетом
			Продолжить;
		КонецЕсли;
		
		ПредставлениеЭлемента = Кэш.ОбщиеФункции.РассчитатьЗначение("Реестр1С_Название", ИниСчета);
		Если Не ЗначениеЗаполнено(ПредставлениеЭлемента) Тогда
			Для Каждого мФайлСчет Из ИниСчета.мФайл Цикл
				ПредставлениеЭлемента = Кэш.ОбщиеФункции.РассчитатьЗначение("Документ_Название", мФайлСчет.Значение);
				// Для счета берем первый найденный мФайл. В рамках проекта других сценариев не нужно
				Прервать;
			КонецЦикла;
	КонецЕсли;
		
		ЭлементДокументДляСчетаНаОплату.СписокВыбора.Добавить(СтрДокументДляСчетаНаОплату, ПредставлениеЭлемента);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключенПереносСтарогоСопоставленияПриИзменении(Элемент)
	ПараметрыПриИзменении(Элемент);
КонецПроцедуры

#Область include_core2_vo2_Формы_ФормаНастройки_Интерфейс_ОбработчикиСобытий_Соединение
#КонецОбласти

