
&НаКлиенте
Процедура СбисВызватьАвторизацию(Кэш, ДопПараметры) Экспорт
	формаАвторизации = Кэш.ГлавноеОкно.сбисПолучитьФорму("ФормаАвторизация",,,Кэш.ГлавноеОкно);
	СбисОписаниеОповещение = СбисОписаниеОповещения(Кэш, "СбисПослеАвторизации", Кэш.ГлавноеОкно, ДопПараметры);
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Результат = формаАвторизации.ОткрытьМодально();
		СбисВыполнитьОписаниеОповещения(Кэш, Результат, СбисОписаниеОповещение);
	#Иначе
		формаАвторизации.ОписаниеОповещенияОЗакрытии = СбисОписаниеОповещение;
		формаАвторизации.Открыть();
	#КонецЕсли
КонецПроцедуры
		
