
//Получает Информацию о контрагенте с онлайна
&НаКлиенте
Функция ПолучитьИнформациюОКонтрагенте(Кэш, СтруктураКонтрагента, ДопПараметры, Отказ) Экспорт
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат, СообщатьПриОшибке, ВернутьОшибку", Истина, Ложь, Истина);
	
	kontr = Новый Структура; 
	Если СтруктураКонтрагента.Свойство("СвФЛ") Тогда
		kontr.Вставить( "СвФЛ", СтруктураКонтрагента.СвФЛ );	
	Иначе
		kontr.Вставить( "СвЮЛ", СтруктураКонтрагента.СвЮЛ );
	КонецЕсли;
	Если	ДопПараметры.Свойство("ДопПоля")
		И	ДопПараметры.ДопПоля = "СписокИдентификаторов" Тогда
		kontr.Вставить("ДопПоля", ДопПараметры.ДопПоля);
	КонецЕсли;
	
	оКонтрагент = Кэш.Интеграция.СБИС_ИнформацияОКонтрагенте(Кэш, kontr, ДопПараметрыЗапроса, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(оКонтрагент,  "ОбщиеФункции.ПолучитьИнформациюОКонтрагенте");
	КонецЕсли;
	Возврат оКонтрагент;
КонецФункции

