
////////////////////////Печать//////////////////////

&НаКлиенте
Функция СбисПечатьДокументов(ОбъектыПечати, ПараметрыПечати) Экспорт
	Если ПараметрыПечати.ВФоне Тогда
		Кэш = ПараметрыПечати.Кэш;
		Если МестныйКэш.ПараметрыСистемы.Клиент.ЭтоLinux Тогда
			Сообщить("Печать не поддерживается на ОС Linux.");
		КонецЕсли;
		Попытка
			Shell = Новый COMОбъект("Shell.Application");
		Исключение
			Возврат Неопределено
		КонецПопытки;
		Для Каждого ОбъектПечати Из ОбъектыПечати Цикл
			Если ОбъектПечати.Тип = "Файл" Тогда
				Shell.ShellExecute(ОбъектПечати.Путь, "", "", "print", 0);
			КонецЕсли;
			МестныйКэш.ТекущийСеанс.ВременныеФайлы.Файлы.Получить(ОбъектПечати.Путь).Освободить = Истина;
		КонецЦикла;
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ПолучитьВложенияПакетовНаПечать(СписокПакетов, ПараметрыПечати) Экспорт
	Кэш = ПараметрыПечати.Кэш;
	СписокДляВыбора = Новый СписокЗначений;
	Для Каждого СбисПакет Из СписокПакетов Цикл
		лСоставПакета = СбисПакет.Значение.СоставПакета;
		Если ТипЗнч(лСоставПакета) = Тип("СписокЗначений") Тогда
			Для Каждого СоставПакета Из лСоставПакета Цикл
				ЗаполнитьВложенияИзСоставаПакетаНаПечать(СписокДляВыбора, СоставПакета.Значение)
			КонецЦикла;
		Иначе
			ЗаполнитьВложенияИзСоставаПакетаНаПечать(СписокДляВыбора, лСоставПакета)
		КонецЕсли;
	КонецЦикла;
	Возврат СписокДляВыбора;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьВложенияИзСоставаПакетаНаПечать(СписокДляВыбора, СоставПакета)
	Если Не СоставПакета.Свойство("Вложение") Тогда
		Возврат;
	КонецЕсли;
	Для Каждого ВложениеПакета Из СоставПакета.Вложение Цикл
		//Пока вызов только для вложений, для которых можно получить PDF преставление с online
		Если	ВложениеПакета.Свойство("СсылкаНаPDF")
			И	ЗначениеЗаполнено(ВложениеПакета.СсылкаНаPDF) Тогда
			СписокДляВыбора.Добавить(ВложениеПакета, ВложениеПакета.Название, Истина);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция СбисМассоваяПечать(ОбъектыПечати, ДополнительныеПараметры) Экспорт
	Кэш = ДополнительныеПараметры.Кэш;
	Результат = РезультатДействия_Новый(Кэш, Новый Структура("ПредставлениеОперации, ФормаВызова", "МассоваяПечать", ДополнительныеПараметры.ФормаВызова));
	Если		ОбъектыПечати = Неопределено
		Или	Не	ДополнительныеПараметры.ВФоне Тогда//Пока просто заглушка 
		Возврат Неопределено;
	ИначеЕсли Кэш.ПараметрыСистемы.Клиент.ЭтоLinux Тогда
		Сообщить("Печать не поддерживается на ОС Linux.");
		Возврат Неопределено;
	КонецЕсли;
	СбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "ComObject", "Shell.Application");
	СбисОписаниеОбъекта.Значение = СбисПолучитьЗначениеРассчитанногоОбъекта(Кэш, СбисОписаниеОбъекта);
	Если СбисОписаниеОбъекта.Значение = Неопределено Тогда
		Попытка
			СбисОписаниеОбъекта.Значение = Новый COMОбъект(СбисОписаниеОбъекта.Ключ);
			СбисЗакэшироватьЗначениеРассчитанногоОбъекта(Кэш, СбисОписаниеОбъекта);
		Исключение
			СбисОшибка = СбисИсключение(,"Shell.Application",,,ОписаниеОшибки());
			СтрокаДетализации = РезультатДействия_СформироватьСтрокуДетализации(Кэш, "Подготовка");
			РезультатДействия_ДобавитьОшибку(Кэш, Результат, СтрокаДетализации, СбисОшибка, Новый Структура("ТипОшибки", "Подготовка"));
			Возврат Результат;
		КонецПопытки;
	КонецЕсли;
	Shell = СбисОписаниеОбъекта.Значение;
	ПараметрыЗапросаФайла = Новый Структура("Протокол,Сервер,ИмяФайла,URLПолный","https");
	ПараметрыЗапросаФайла.Сервер = СтрПолучитьСтроку(СтрЗаменить(Кэш.Парам.АдресСервера, "//", Символы.ПС), 2);
	Для Каждого ОбъектПечати Из ОбъектыПечати Цикл
		СтрокаРезультат = РезультатДействия_СформироватьСтрокуДетализации(Кэш, "ВыполнитьДействие");
		СтрокаРезультат.Название = ОбъектПечати.Представление;
		ПараметрыЗапросаФайла.ИмяФайла	= СбисПолучитьИмяВременногоФайлаКлиент("pdf");
		ПараметрыЗапросаФайла.URLПолный	= ОбъектПечати.Значение.СсылкаНаPDF;
		ОшибкаСкачки = Ложь;
		РезультатЗаписи = Кэш.Интеграция.СбисСохранитьВФайлПоСсылке(Кэш, ПараметрыЗапросаФайла, ОшибкаСкачки);
		Если ОшибкаСкачки Тогда
			РезультатДействия_ДобавитьОшибку(Кэш, Результат, СтрокаРезультат, РезультатЗаписи);
			Продолжить;
		КонецЕсли;
		Попытка
			Shell.ShellExecute(ПараметрыЗапросаФайла.ИмяФайла, "", "", "print", 0);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
		МестныйКэш.ТекущийСеанс.ВременныеФайлы.Файлы.Получить(ПараметрыЗапросаФайла.ИмяФайла).Освободить = Истина;
		РезультатДействия_ДобавитьРезультат(Кэш, Результат, СтрокаРезультат, Новый Структура("Выполнено, КлючГруппировки", Истина, "Отправлен на печать"));
	КонецЦикла;
	Возврат Результат;
КонецФункции

