
//Процедура копирует структуру в контексте сервера. Использовать ТОЛЬКО для серверных функций и процедур	
&НаСервереБезКонтекста
Процедура сбисСкопироватьСтруктуру(СтруктураКуда, Знач СтруктураОткуда)  Экспорт
	СбисСкопироватьСтруктуруСПараметрами(СтруктураКуда, СтруктураОткуда, Новый Структура("КлючиНеКопировать", Новый Массив));
КонецПроцедуры

//Процедура копирует структуру в контексте сервера. Использовать ТОЛЬКО для серверных функций и процедур	
&НаСервереБезКонтекста
Процедура СбисСкопироватьСтруктуруСПараметрами(СтруктураКуда, Знач СтруктураОткуда, Знач ДопПараметры)
	Если НЕ ТипЗнч(СтруктураОткуда) =  Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Элемент Из СтруктураОткуда Цикл	
		Если Не ДопПараметры.КлючиНеКопировать.Найти(Элемент.Ключ) = Неопределено Тогда
			Если Не СтруктураКуда.Свойство(Элемент.Ключ) Тогда
				СтруктураКуда.Вставить(Элемент.Ключ,Элемент.Значение);
			Иначе
				СтруктураКуда[Элемент.Ключ] = Элемент.Значение;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
			СтруктураКуда.Вставить(Элемент.Ключ, Новый Структура);
			сбисСкопироватьСтруктуру(СтруктураКуда[Элемент.Ключ], Элемент.Значение);
		ИначеЕсли ТипЗнч(Элемент.Значение) =  Тип("Массив") Тогда
			СтруктураКуда.Вставить(Элемент.Ключ, Новый Массив);
			Для Каждого ЭлементМассива Из Элемент.Значение Цикл
				ПромежуточнаяСтруктура = Новый Структура;
				сбисСкопироватьСтруктуру(ПромежуточнаяСтруктура, ЭлементМассива);
				СтруктураКуда[Элемент.Ключ].Добавить(ПромежуточнаяСтруктура);
			КонецЦикла;
		ИначеЕсли Не СтруктураКуда.Свойство(Элемент.Ключ) Тогда
			СтруктураКуда.Вставить(Элемент.Ключ,Элемент.Значение);
		Иначе
			СтруктураКуда[Элемент.Ключ] = Элемент.Значение;			
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

//Функция возвращает глубокую копию исходного объекта. Поддерживаемые составные типы: Структура, Массив.
&НаСервереБезКонтекста
Функция СбисСкопироватьОбъект(Знач ОбъектНаВход)  Экспорт
	Возврат СкопироватьОбъектСПараметрамиСервер(ОбъектНаВход);
КонецФункции

//Функция возвращает глубокую копию исходного объекта. Поддерживаемые составные типы: Структура, Массив.
&НаКлиенте
Функция СбисСкопироватьОбъектНаКлиенте(ОбъектНаВход)  Экспорт
	Если ТипЗнч(ОбъектНаВход) = Тип("Структура") Тогда
		Результат = Новый Структура;
		Для Каждого КлючИЗначение Из ОбъектНаВход Цикл
			Результат.Вставить(КлючИЗначение.Ключ, сбисСкопироватьОбъектНаКлиенте(КлючИЗначение.Значение));
		КонецЦикла;
	ИначеЕсли ТипЗнч(ОбъектНаВход) = Тип("Массив") Тогда
		Результат = Новый Массив;
		Для Каждого ЭлементМассива Из ОбъектНаВход Цикл
			Результат.Добавить(сбисСкопироватьОбъектНаКлиенте(ЭлементМассива));
		КонецЦикла;
	Иначе
		Результат = ОбъектНаВход;
	КонецЕсли;
	Возврат Результат;
КонецФункции

//Функция возвращает глубокую копию раздела ини без копии расчитанных значений. 
//Поддерживаемые составные типы: Структура, Массив.
//ДопПараметры: КлючиНеКопировать - массив ключей, значения которых не копируются, а переносятся как есть.
&НаСервереБезКонтекста
Функция СкопироватьОбъектСПараметрамиСервер(Знач СбисОбъект, СбисКлючи=Неопределено, ГлубокоеКопирование=Истина) Экспорт
	Если ТипЗнч(СбисОбъект) = Тип("Структура") Тогда
		Если СбисКлючи = Неопределено Тогда
			Результат = Новый Структура;
			Для Каждого КлючИЗначение Из СбисОбъект Цикл
				Результат.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
				Если ГлубокоеКопирование Тогда
					Результат[КлючИЗначение.Ключ] = СкопироватьОбъектСПараметрамиСервер(КлючИЗначение.Значение,,ГлубокоеКопирование)			
				КонецЕсли;
			КонецЦикла;
		Иначе
			Результат = Новый Структура(СбисКлючи);
			ЗаполнитьЗначенияСвойств(Результат, СбисОбъект);
			Если ГлубокоеКопирование Тогда
				Для Каждого КлючИЗначение Из Результат Цикл
					Результат[КлючИЗначение.Ключ] = СкопироватьОбъектСПараметрамиСервер(КлючИЗначение.Значение,,ГлубокоеКопирование)
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(СбисОбъект) = Тип("Массив") Тогда
		Результат = Новый Массив;
		Если СбисКлючи = Неопределено Тогда
			Для Каждого ЭлементМассива Из СбисОбъект Цикл
				Результат.Добавить(?(ГлубокоеКопирование, СкопироватьОбъектСПараметрамиСервер(ЭлементМассива,,ГлубокоеКопирование), ЭлементМассива));
			КонецЦикла;
		Иначе
			Для Счетчик = 0 По СбисОбъект.Количество() Цикл
				Если СбисКлючи.Найти(Счетчик) Тогда
					Результат.Добавить(?(ГлубокоеКопирование, СкопироватьОбъектСПараметрамиСервер(ЭлементМассива,,ГлубокоеКопирование), ЭлементМассива));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Результат = СбисОбъект;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СкопироватьОбъектСПараметрамиКлиент(СбисОбъект, СбисКлючи=Неопределено, ГлубокоеКопирование = Истина) Экспорт
	Если ТипЗнч(СбисОбъект) = Тип("Структура") Тогда
		Если СбисКлючи = Неопределено Тогда
			Результат = Новый Структура;
			Для Каждого КлючИЗначение Из СбисОбъект Цикл
				Результат.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
				Если ГлубокоеКопирование Тогда
					Результат[КлючИЗначение.Ключ] = СкопироватьОбъектСПараметрамиКлиент(КлючИЗначение.Значение,,ГлубокоеКопирование)			
				КонецЕсли;
			КонецЦикла;
		Иначе
			Результат = Новый Структура(СбисКлючи);
			ЗаполнитьЗначенияСвойств(Результат, СбисОбъект);
			Если ГлубокоеКопирование Тогда
				Для Каждого КлючИЗначение Из Результат Цикл
					Результат[КлючИЗначение.Ключ] = СкопироватьОбъектСПараметрамиКлиент(КлючИЗначение.Значение,,ГлубокоеКопирование)
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(СбисОбъект) = Тип("Массив") Тогда
		Результат = Новый Массив;
		Если СбисКлючи = Неопределено Тогда
			Для Каждого ЭлементМассива Из СбисОбъект Цикл
				Результат.Добавить(?(ГлубокоеКопирование, СкопироватьОбъектСПараметрамиКлиент(ЭлементМассива,,ГлубокоеКопирование), ЭлементМассива));
			КонецЦикла;
		Иначе
			Для Счетчик = 0 По СбисОбъект.Количество() Цикл
				Если СбисКлючи.Найти(Счетчик) Тогда
					Результат.Добавить(?(ГлубокоеКопирование, СкопироватьОбъектСПараметрамиКлиент(ЭлементМассива,,ГлубокоеКопирование), ЭлементМассива));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Результат = СбисОбъект;
	КонецЕсли;
	Возврат Результат;
КонецФункции

// МЕТОД УСТАРЕЛ! Не использовать НИГДЕ!
//Процедура дозаполняет структуру данными из другой структуры в контексте клиента	
&НаКлиенте
Процедура сбисСкопироватьСтруктуруНаКлиенте(СтруктураКуда, СтруктураОткуда)  Экспорт
	ТипМассив = Тип("Массив");
	ТипСтруктура = Тип("Структура");
	Для Каждого Элемент Из СтруктураОткуда Цикл	
		Если ТипЗнч(СтруктураОткуда) = ТипМассив Тогда
			
		ИначеЕсли ТипЗнч(Элемент.Значение) = ТипСтруктура Тогда
			СтруктураКуда.Вставить(Элемент.Ключ, Новый Структура);
			сбисСкопироватьСтруктуруНаКлиенте(СтруктураКуда[Элемент.Ключ], Элемент.Значение);				
		ИначеЕсли ТипЗнч(Элемент.Значение) = ТипМассив Тогда
			СтруктураКуда.Вставить(Элемент.Ключ, Новый Массив);
			Для Каждого ЭлементМассива Из Элемент.Значение Цикл
				Если ТипЗнч(ЭлементМассива) = ТипСтруктура Тогда
					
					ПромежуточнаяСтруктура = Новый Структура;
					сбисСкопироватьСтруктуруНаКлиенте(ПромежуточнаяСтруктура, ЭлементМассива);
					СтруктураКуда[Элемент.Ключ].Добавить(ПромежуточнаяСтруктура);
					
				Иначе
					
					// Добавить элемент как есть
					СтруктураКуда[Элемент.Ключ].Добавить(ЭлементМассива);
					
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли Не СтруктураКуда.Свойство(Элемент.Ключ) Тогда
			СтруктураКуда.Вставить(Элемент.Ключ,Элемент.Значение);
		Иначе
			СтруктураКуда[Элемент.Ключ] = Элемент.Значение;			
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

