
//DynamicDirective

//получаем массив файлов из каталога
Функция ОписаниеИниФайлов(ИнтеграцияSABY, ДопПараметры = Неопределено) Экспорт
	Перем ИниДополнить;
	
	ПараметрыДляОписания	= МодульОбъектаКлиентСервер().ИнтеграцияSABY_Выгрузить(ИнтеграцияSABY, "ПараметрыДляЧтенияИни");
	Результат				= яОписаниеИниФайловВКаталоге(ПараметрыДляОписания);

	Если Не ДопПараметры = Неопределено
		И	ДопПараметры.Свойство("ИниДополнить", ИниДополнить) Тогда
		
		Результат.МассивУстановленныхИниФайлов = яДобавитьИмяИниДляОтображения(Результат.МассивУстановленныхИниФайлов, ИниДополнить);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//DynamicDirective

Функция ПроверитьИдентификаторНастроек(КаталогНастроекДляТеста) Экспорт 
	
	ПараметрыСистемы	 = МодульОбъектаКлиентСервер().ГлобальныйКэш_Получить("ПараметрыСистемы");
	Отказ				 = Ложь;
	ПараметрыДляФормата	 = Новый ФиксированнаяСтруктура("Контекст", ПараметрыСистемы.Сервер);

	ТестКаталогНастроек = МодульОбъектаКлиентСервер().ПрименитьФорматКСтроке(КаталогНастроекДляТеста, ПараметрыДляФормата, "Каталог");
	ТестКаталогНастроек = СбисСоздатьКаталогНаСервере(ТестКаталогНастроек, ПараметрыСистемы, Отказ);
	Если Отказ Тогда
		
		ВызватьИсключение МодульОбъектаКлиентСервер().СбисИсключение_Выгрузить(ТестКаталогНастроек);
		
	КонецЕсли;
	
	Возврат ТестКаталогНастроек;
	
КонецФункции

