
// Функция - возвращает формирует значение реквизита ПараметрыФормы для интерфейсный модулей
// 
// Возвращаемое значение:
//  Структура - 
//
Функция ПараметрыИнтерфейсныйМодулей() Экспорт
	
	// Тихий режим на сервере включается по-умолчанию, т.к. на сервере нет интерфейса
	Результат = Новый Структура("Инициирована, ТихийРежим, РежимЗакрытия, Результат", Ложь, Истина);
	Возврат Результат;
	
КонецФункции

// Процедура - Показать состояние. На сервере пока ничего. 
// TODO через хранилище прокидывать статус, чтобы на клиенте отрисовывать состояние
//
// Параметры:
//  ТекстСостояния	 - Строка/Неопределено		 - выводит состояние длительной операции. Неопределено - скрыть состояние длительной операции.
//  ДопПараметры	 - Структура/Неопределено	 - расширение
//		Интерфейс: форма главного окна/ другая форма, куда выводить состояние. 
//		Индикатор: число 1-100 прогресс бар.
//		Пояснение: дополнительная информация в скобках
//
Процедура ПоказатьСостояниеSABY(ТекстСостояния = Неопределено, ДопПараметры = Неопределено) Экспорт
КонецПроцедуры

