
// Тут пока только заглушки от работы с параметрами, т.к. изменение все равно происходит на клиенте.
// Поэтапно перенести реализацию для работы с параметрами на сервере

//DynamicDirective
Процедура ИзменитьПараметрSABY_Общее(ИмяПараметраСбис, ЗначениеПараметраСбис, ЗначениеКэшПрописать, ЭтоГлобальныйПараметр, ДопПараметрыИзменения)
	
		
КонецПроцедуры

//DynamicDirective
Процедура ИзменитьПараметрSABY_Сбис(ИмяПараметраСбис, ЗначениеПараметраСбис, ДопПараметрыИзменения)
		
КонецПроцедуры

//DynamicDirective
Процедура ИзменитьПараметрSABY_ТекущийСеанс(ИмяПараметраСбис, ЗначениеПараметраСбис, ЗначениеКэшПрописать, ЭтоГлобальныйПараметр, ДопПараметрыИзменения)
		
		
КонецПроцедуры

//DynamicDirective
Процедура ИзменитьПараметрSABY_Технический(ИмяПараметраСбис, ЗначениеПараметраСбис, ЗначениеКэшПрописать, ЭтоГлобальныйПараметр, ДопПараметрыИзменения)

КонецПроцедуры

//DynamicDirective
Процедура ИзменитьПараметрSABY_Настройки(ИмяПараметраСбис, ЗначениеПараметраСбис, ЗначениеКэшПрописать, ЭтоГлобальныйПараметр, ДопПараметрыИзменения)
	

КонецПроцедуры	
	
//DynamicDirective
Процедура ИзменитьПараметрСбис_ВызовСервера(ИмяПараметраСбис, ЗначениеПараметраСбис, ДопПараметры = Неопределено)
	
КонецПроцедуры

