
&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыВходящие) Экспорт
	
	ЗаполнитьИзФайла(ПараметрыВходящие.Вложение, ПараметрыВходящие.СоставПакета);
	
КонецПроцедуры

// Процедура - заполняет ревизиты формы данными из файла (ИНН, КПП, контактная информация, банковские реквизиты)	
//
// Параметры:
//  ВложениеСБИС - ВложениеСБИС	 - структура вложения, по которому создается контрагент
//  СоставПакета - СоставПакета	 - структура документа СБИС
// 
&НаКлиенте
Процедура ЗаполнитьИзФайла(ВложениеСБИС, СоставПакета)

	СтруктураФайла		= ВложениеСБИС.СтруктураФайла;
	СтруктураИниФайла	= ВложениеСБИС.СтруктураИниФайла;
	
	ДанныеСтруктурыФайла	= МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "ДанныеСтруктурыФайла");
	РольКонтрагента			= ДанныеСтруктурыФайла.Синонимы.Получить("Контрагент");
	СтруктураКонтрагента	= ДанныеСтруктурыФайла.Поля.Получить("Контрагент");
	
	Если Не ЗначениеЗаполнено(СтруктураКонтрагента) Тогда
		
		ВызватьИсключение "В файле отсутствует блок информации, необходимый для создания контрагента.";

	КонецЕсли;
	ИниКонтрагента			= СтруктураИниФайла.мСторона[РольКонтрагента];
	ПлоскиеДанныеСтороны	= МодульОбъектаКлиент().СторонаSABY_Выгрузить(СтруктураКонтрагента);
	
	Если ПлоскиеДанныеСтороны.ИностраннаяОрганизация Тогда
	
		ВызватьИсключение "Создание контрагента недоступно. Укажите контрагента вручную.";
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ПлоскиеДанныеСтороны);
	
	Заголовок = "Создание контрагента: " + ПлоскиеДанныеСтороны.Наименование; 
	
	АдресПредставление = "";
	Если СтруктураКонтрагента.Свойство("Адрес") Тогда
		
		Если ТипЗнч(СтруктураКонтрагента.Адрес) = Тип("Массив") Тогда
			
			// alo сейчас заглушка позже надо будет сделать заполнение нескольких адресов (юридический, фактический и др.)
			
		ИначеЕсли СтруктураКонтрагента.Адрес.Свойство("АдрРФ") Тогда
			
			Для Каждого Элемент Из СтруктураКонтрагента.Адрес.АдрРФ Цикл
				
				Попытка
					
					ЭтаФорма[Элемент.Ключ] = Элемент.Значение;
				
				Исключение
					
					// Неизвестное поле из адреса, не обрабатываем.
					Продолжить;
					
				КонецПопытки;
				
				Если Элемент.Ключ="Дом" Тогда
					
					АдресПредставление = АдресПредставление+"дом № "+Элемент.Значение+", ";
					
				ИначеЕсли Элемент.Ключ="Корпус" Тогда
					
					АдресПредставление = АдресПредставление+"корпус "+Элемент.Значение+", ";
					
				ИначеЕсли Элемент.Ключ="Кварт" Тогда
					
					АдресПредставление = АдресПредставление+"кв."+Элемент.Значение+", ";
					
				ИначеЕсли Элемент.Ключ="КодРегион" Тогда
					
					АдресПредставление = АдресПредставление+ЗаполнитьРегионПоКоду("")+", ";
					
				Иначе
					
					АдресПредставление = АдресПредставление+Элемент.Значение+", ";
					
				КонецЕсли;
				
			КонецЦикла;
			
			АдресПредставление = Лев(АдресПредставление, СтрДлина(АдресПредставление)-2);
			
		ИначеЕсли СтруктураКонтрагента.Адрес.Свойство("АдрИно") и СтруктураКонтрагента.Адрес.АдрИно.Свойство("АдрТекст") Тогда
			
			АдресПредставление = СтруктураКонтрагента.Адрес.АдрИно.АдрТекст;		
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураКонтрагента.Свойство("Контакт") Тогда
		
		Для Каждого Элемент Из СтруктураКонтрагента.Контакт Цикл
			
			ЭтаФорма[Элемент.Ключ] = Элемент.Значение;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если СтруктураКонтрагента.Свойство("БанкРекв") Тогда
		
		ЕстьБанкРекв = Истина;
		Для Каждого Элемент Из СтруктураКонтрагента.БанкРекв Цикл
			ЭтаФорма[Элемент.Ключ] = Элемент.Значение;
		КонецЦикла;
		
	Иначе
		
		ЕстьБанкРекв = Ложь;
		НаимБанк = "";
		БИК = "";
		РСчет = "";
		
	КонецЕсли;
	
КонецПроцедуры

