
&НаКлиенте
Функция ЗаполнитьИзФайла(СтрокаТаблДок, СоставПакета, Кэш) Экспорт
	// Функция заполняет ревизиты формы данными из файла (ИНН, КПП, контактная информация, банковские реквизиты)	
	МестныйКэш = Кэш;
	СтруктураФайла = СтрокаТаблДок.Вложение[0].Значение.СтруктураФайла;
	СтруктураИниФайла = СтрокаТаблДок.Вложение[0].Значение.СтруктураИниФайла;
	РольКонтрагента = СтрЗаменить(СтруктураИниФайла.Контрагент_Роль.Значение, "'", "");
	Если ЗначениеЗаполнено(РольКонтрагента) Тогда
		ПутьКонтрагента = СтруктураИниФайла;
		Если	ПутьКонтрагента.Свойство("мСторона",		ПутьКонтрагента)
			И	ПутьКонтрагента.Свойство(РольКонтрагента,	ПутьКонтрагента)
			И	ПутьКонтрагента.Свойство("Сторона",			ПутьКонтрагента)
			И	ПутьКонтрагента.Свойство("Данные",			ПутьКонтрагента) Тогда
			СтруктураКонтрагента = Кэш.ОбщиеФункции.РассчитатьЗначениеИзСтруктуры(ПутьКонтрагента, СтруктураФайла);
		Иначе
			ПутьКонтрагента = "Файл.Документ."+РольКонтрагента;
			СтруктураКонтрагента = ?(СтруктураФайла.Файл.Документ.Свойство(РольКонтрагента),СтруктураФайла.Файл.Документ[РольКонтрагента], Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктураКонтрагента) Тогда
		Сообщить("В файле отсутствует блок информации, необходимый для создания контрагента.");
		Возврат Неопределено;
	КонецЕсли;
	ИниКонтрагента = СтруктураИниФайла.мСторона[РольКонтрагента];
	
	СвФлЮл = Неопределено;
	Если СтруктураКонтрагента.Свойство("СвЮЛ",СвФлЮл) Тогда
		Наименование = СвФлЮл.Название;
		ИНН = СвФлЮл.ИНН;
		КПП = СвФлЮл.КПП;
	ИначеЕсли СтруктураКонтрагента.Свойство("СвФЛ",СвФлЮл) Тогда
		Если СтруктураКонтрагента.Свойство("Название") Тогда
			Наименование = СтруктураКонтрагента.Название;
		ИначеЕсли	СвФлЮл.Свойство("Фамилия")
				И	СвФлЮл.Свойство("Имя") Тогда
			Наименование = СвФлЮл.Фамилия + " " + СвФлЮл.Имя + ?(СвФлЮл.Свойство("Отчество")," " + СвФлЮл.Отчество,"");
		КонецЕсли;
		ИНН = СвФлЮл.ИНН;
	КонецЕсли;
	
	АдресПредставление = "";
	Если СтруктураКонтрагента.Свойство("Адрес") Тогда
		Если ТипЗнч(СтруктураКонтрагента.Адрес) = Тип("Массив") Тогда
			// alo сейчас заглушка позже надо будет сделать заполнение нескольких адресов (юридический, фактический и др.)
		ИначеЕсли СтруктураКонтрагента.Адрес.Свойство("АдрРФ") Тогда
			Для Каждого Элемент Из СтруктураКонтрагента.Адрес.АдрРФ Цикл
				ЭтаФорма[Элемент.Ключ] = Элемент.Значение;
				Если Элемент.Ключ="Дом" Тогда
					АдресПредставление = АдресПредставление+"дом № "+Элемент.Значение+", ";
				ИначеЕсли Элемент.Ключ="Корпус" Тогда
					АдресПредставление = АдресПредставление+"корпус "+Элемент.Значение+", ";
				ИначеЕсли Элемент.Ключ="Кварт" Тогда
					АдресПредставление = АдресПредставление+"кв."+Элемент.Значение+", ";
				ИначеЕсли Элемент.Ключ="КодРегион" Тогда
					АдресПредставление = АдресПредставление+ЗаполнитьРегионПоКоду("")+", ";
				Иначе
					АдресПредставление = АдресПредставление+Элемент.Значение+", ";
				КонецЕсли;
			КонецЦикла;
			АдресПредставление = Лев(АдресПредставление, СтрДлина(АдресПредставление)-2);
		ИначеЕсли СтруктураКонтрагента.Адрес.Свойство("АдрИно") и СтруктураКонтрагента.Адрес.АдрИно.Свойство("АдрТекст") Тогда
			АдресПредставление = СтруктураКонтрагента.Адрес.АдрИно.АдрТекст;		
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураКонтрагента.Свойство("Контакт") Тогда
		Для Каждого Элемент Из СтруктураКонтрагента.Контакт Цикл
			ЭтаФорма[Элемент.Ключ] = Элемент.Значение;
		КонецЦикла;
	КонецЕсли;
	Если СтруктураКонтрагента.Свойство("БанкРекв") Тогда
		ЕстьБанкРекв = Истина;
		Для Каждого Элемент Из СтруктураКонтрагента.БанкРекв Цикл
			ЭтаФорма[Элемент.Ключ] = Элемент.Значение;
		КонецЦикла;
	Иначе
		ЕстьБанкРекв = Ложь;
		НаимБанк = "";
		БИК = "";
		РСчет = "";
	КонецЕсли;
	ЭтаФорма.Открыть();	
КонецФункции

