
&НаКлиенте
Процедура СоздатьКонтрагента(Команда)
	// процедура создает нового контрагента и открывает его карточку	
	Попытка
		Контрагент1С = СоздатьКонтрагентаНаСервере();
	Исключение
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ФормаСозданияКонтрагента.СоздатьКонтрагента");
		Возврат
	КонецПопытки;
	ЭтаФорма.Закрыть();
	ФормаПросмотра = ВладелецФормы.СбисПолучитьФорму("ФормаПросмотрДокумента");
	ФормаПросмотра.ЗаполнитьТаблицуДокументов(ФормаПросмотра.СоставПакета);
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ОткрытьЗначение(Контрагент1С);
	#Иначе
		ПоказатьЗначение(Неопределено, Контрагент1С);
	#КонецЕсли
КонецПроцедуры

