
&НаКлиенте
Процедура ДополнительныеПараметрыДокументаПриИзменении(Элемент)
	СоставПакета.Вставить("ПерегенерироватьВложения", Истина);
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Записать").Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПараметрыДокументаПриАктивизацииСтроки(Элемент)
	
	ПараметрыДокументаСбис = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "ДопПараметрыСБИС");
	ТаблицаФормы = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДополнительныеПараметрыДокумента");
	КолонкаПараметрФормы = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДополнительныеПараметрыДокумента.Параметр");
    
    Если НЕ Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
    
    	КолонкаПараметрФормы = КолонкаПараметрФормы.ЭлементУправления;
    
    КонецЕсли;
    
	ТекущаяСтрока = ТаблицаФормы.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрДокумента = МодульОбъектаКлиент().НайтиВМассивеСтруктурПоКлючу(ПараметрыДокументаСбис, ТекущаяСтрока.ИмяПараметра, "Имя");
	
	Если ПараметрДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КолонкаПараметрФормы.КнопкаВыбора = ПараметрДокумента.ИнформацияОТипе.Свойство("ЗначенияСписка")
										ИЛИ ПараметрДокумента.ИнформацияОТипе.Тип.СодержитТип(Тип("Булево"));
	КолонкаПараметрФормы.РедактированиеТекста = НЕ ПараметрДокумента.ИнформацияОТипе.Свойство("ЗначенияСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПараметрыДокументаПараметрНачалоВыбора_Общее()
	
	ПараметрыДокументаСбис = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "ДопПараметрыСБИС");
	ТаблицаФормы = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДополнительныеПараметрыДокумента");
	
	ТекущаяСтрока = ТаблицаФормы.ТекущиеДанные;
	ПараметрДокумента = МодульОбъектаКлиент().НайтиВМассивеСтруктурПоКлючу(ПараметрыДокументаСбис, ТекущаяСтрока.ИмяПараметра, "Имя");

	ПараметрыПослеВыбора = Новый Структура("ПараметрДокумента", ПараметрДокумента);
	ОбраотчикВыбора = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ДополнительныеПараметрыДокументаПараметрНачалоВыбора_Завершение",
																		ЭтаФорма,
																		ПараметрыПослеВыбора);
	ПараметрыВыбора = Новый Структура("ОтметитьЭлементы, Обработчик, Заголовок",
									ПараметрДокумента.ИнформацияОТипе.МножественныйВыбор,
									ОбраотчикВыбора,
									"Выберите значение");
	МодульОбъектаКлиент().СбисВыбратьИзСписка(ПараметрДокумента.ИнформацияОТипе.ЗначенияСписка, ПараметрыВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПараметрыДокументаПараметрНачалоВыбора_Завершение(Результат, ДопПараметры) Экспорт
	
	ЗначениеПараметра = Новый СписокЗначений;

	Если ТипЗнч(Результат) = Тип("СписокЗначений") Тогда
		
		Для каждого ЭлементСписка Из Результат Цикл
		
			Если ЭлементСписка.Пометка Тогда
			
				ЗначениеПараметра.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
			
			КонецЕсли;
		
		КонецЦикла;
		
	ИначеЕсли Результат = Неопределено Тогда
		Возврат;
	Иначе
		ЗначениеПараметра.Добавить(Результат.Значение, Результат.Представление);
	КонецЕсли;
	
	ТаблицаФормы = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДополнительныеПараметрыДокумента");
	ТекущаяСтрока = ТаблицаФормы.ТекущиеДанные;
	ТекущаяСтрока.Параметр = ЗначениеПараметра;
	ТекущаяСтрока.ЗначениеПараметра = МодульОбъектаКлиент().ПреобразоватьЗначениеВJSON(ЗначениеПараметра.ВыгрузитьЗначения());
	
	ДополнительныеПараметрыДокументаПриИзменении(ТаблицаФормы);

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПараметрыДокументаПараметрПриИзменении(Элемент)
	
	ПараметрыДокументаСбис = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "ДопПараметрыСБИС");

	ТаблицаФормы = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДополнительныеПараметрыДокумента");
	ТекущаяСтрока = ТаблицаФормы.ТекущиеДанные;
	ПараметрДокумента = МодульОбъектаКлиент().НайтиВМассивеСтруктурПоКлючу(ПараметрыДокументаСбис, ТекущаяСтрока.ИмяПараметра, "Имя");
	
	ЗначениеПараметра = ?(ПараметрДокумента.ИнформацияОТипе.Свойство("Формат"),
						Формат(ТекущаяСтрока.Параметр, ПараметрДокумента.ИнформацияОТипе.Формат),
						ТекущаяСтрока.Параметр);
						
	ТекущаяСтрока.ЗначениеПараметра = МодульОбъектаКлиент().ПреобразоватьЗначениеВJSON(ЗначениеПараметра);

	ДополнительныеПараметрыДокументаПриИзменении(ТаблицаФормы);
	
КонецПроцедуры

#Область include_local_Формы_ФормаПросмотрДокумента_События_ДополнительныеПараметрыДокумента
#КонецОбласти

