
&НаКлиенте
Процедура ДополнительныеПараметрыДокументаПриИзменении(Элемент)
	СоставПакета.Вставить("ПерегенерироватьВложения", Истина);
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "Записать").Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПараметрыДокументаПриАктивизацииСтроки(Элемент)
	
	ПараметрыДокументаСбис = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "ДопПараметрыСБИС");
	ТаблицаФормы = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДополнительныеПараметрыДокумента");
	КолонкаПараметрФормы = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДополнительныеПараметрыДокумента.Параметр");
    
    Если НЕ Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
    
    	КолонкаПараметрФормы = КолонкаПараметрФормы.ЭлементУправления;
    
    КонецЕсли;
    
	ТекущаяСтрока = ТаблицаФормы.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрДокумента = МодульОбъектаКлиент().НайтиВМассивеСтруктурПоКлючу(ПараметрыДокументаСбис, ТекущаяСтрока.ИмяПараметра, "Имя");
	
	Если ПараметрДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КолонкаПараметрФормы.КнопкаВыбора = ПараметрДокумента.ИнформацияОТипе.Свойство("ЗначенияСписка")
										ИЛИ ПараметрДокумента.ИнформацияОТипе.Тип.СодержитТип(Тип("Булево"))
										ИЛИ ПараметрДокумента.ИнформацияОТипе.Тип.СодержитТип(Тип("СтандартныйПериод"));
	КолонкаПараметрФормы.РедактированиеТекста = НЕ ПараметрДокумента.ИнформацияОТипе.Свойство("ЗначенияСписка")
										И НЕ ПараметрДокумента.ИнформацияОТипе.Тип.СодержитТип(Тип("СтандартныйПериод"));
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПараметрыДокументаПараметрНачалоВыбора_Общее()
	
	ПараметрыДокументаСбис = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "ДопПараметрыСБИС");
	ТаблицаФормы = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДополнительныеПараметрыДокумента");
	
	ТекущаяСтрока = ТаблицаФормы.ТекущиеДанные;
	ПараметрДокумента = МодульОбъектаКлиент().НайтиВМассивеСтруктурПоКлючу(ПараметрыДокументаСбис, ТекущаяСтрока.ИмяПараметра, "Имя");

	Если ПараметрДокумента.ИнформацияОТипе.Тип.СодержитТип(Тип("СтандартныйПериод")) Тогда
		НазваниеТипа = "СтандартныйПериод";
	ИначеЕсли ПараметрДокумента.ИнформацияОТипе.Тип.СодержитТип(Тип("СписокЗначений")) Тогда
		НазваниеТипа = "СписокЗначений";
	КонецЕсли;
	
	ИмяФункцииЗавершения = "ДополнительныеПараметрыДокументаПараметрНачалоВыбора_Завершение" + НазваниеТипа;
	
	ПараметрыПослеВыбора = Новый Структура("ПараметрДокумента", ПараметрДокумента);
	ОбраотчикВыбора = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения(ИмяФункцииЗавершения,
																		ЭтаФорма,
																		ПараметрыПослеВыбора);
																		
	Если НазваниеТипа = "СтандартныйПериод" Тогда
	
		МодульОбъектаКлиент().СбисПоказатьВводПериода(ОбраотчикВыбора, ПараметрДокумента.Параметр);
	
	ИначеЕсли НазваниеТипа = "СписокЗначений" Тогда
	
		ПараметрыВыбора = Новый Структура("ОтметитьЭлементы, Обработчик, Заголовок",
										ПараметрДокумента.ИнформацияОТипе.МножественныйВыбор,
										ОбраотчикВыбора,
										"Выберите значение");
		МодульОбъектаКлиент().СбисВыбратьИзСписка(ПараметрДокумента.ИнформацияОТипе.ЗначенияСписка, ПараметрыВыбора);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПараметрыДокументаПараметрНачалоВыбора_ЗавершениеСписокЗначений(Результат, ДопПараметры) Экспорт
	
	ЗначениеПараметра = Новый СписокЗначений;

	Если ТипЗнч(Результат) = Тип("СписокЗначений") Тогда
		
		Для каждого ЭлементСписка Из Результат Цикл
		
			Если ЭлементСписка.Пометка Тогда
			
				ЗначениеПараметра.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
			
			КонецЕсли;
		
		КонецЦикла;
		
	ИначеЕсли Результат = Неопределено Тогда
		Возврат;
	Иначе
		ЗначениеПараметра.Добавить(Результат.Значение, Результат.Представление);
	КонецЕсли;
	
	ТаблицаФормы = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДополнительныеПараметрыДокумента");
	ТекущаяСтрока = ТаблицаФормы.ТекущиеДанные;
	ТекущаяСтрока.Параметр = ЗначениеПараметра;
	ТекущаяСтрока.ЗначениеПараметра = МодульОбъектаКлиент().ПреобразоватьЗначениеВJSON(ЗначениеПараметра.ВыгрузитьЗначения());
	
	ДополнительныеПараметрыДокументаПриИзменении(ТаблицаФормы);

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПараметрыДокументаПараметрНачалоВыбора_ЗавершениеСтандартныйПериод(Результат, ДопПараметры) Экспорт

	Если НЕ ТипЗнч(Результат) = Тип("СтандартныйПериод") Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаФормата = ?(ЗначениеЗаполнено(ДопПараметры.ПараметрДокумента.ИнформацияОТипе.Формат),
					ДопПараметры.ПараметрДокумента.ИнформацияОТипе.Формат,
					"dd.MM.yy");
	РезультатСтрока = Формат(Результат.ДатаНачала, СтрокаФормата) + "-" + Формат(Результат.ДатаОкончания, СтрокаФормата);
	
	ТаблицаФормы = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДополнительныеПараметрыДокумента");
	ТекущаяСтрока = ТаблицаФормы.ТекущиеДанные;
	ТекущаяСтрока.Параметр = Результат;
	ТекущаяСтрока.ЗначениеПараметра = МодульОбъектаКлиент().ПреобразоватьЗначениеВJSON(РезультатСтрока);
	
	ДополнительныеПараметрыДокументаПриИзменении(ТаблицаФормы);

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПараметрыДокументаПараметрПриИзменении(Элемент)
	
	ПараметрыДокументаСбис = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "ДопПараметрыСБИС");

	ТаблицаФормы = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДополнительныеПараметрыДокумента");
	ТекущаяСтрока = ТаблицаФормы.ТекущиеДанные;
	ПараметрДокумента = МодульОбъектаКлиент().НайтиВМассивеСтруктурПоКлючу(ПараметрыДокументаСбис, ТекущаяСтрока.ИмяПараметра, "Имя");
	
	ЗначениеПараметра = ?(ПараметрДокумента.ИнформацияОТипе.Свойство("Формат"),
						Формат(ТекущаяСтрока.Параметр, ПараметрДокумента.ИнформацияОТипе.Формат),
						ТекущаяСтрока.Параметр);
						
	ТекущаяСтрока.ЗначениеПараметра = МодульОбъектаКлиент().ПреобразоватьЗначениеВJSON(ЗначениеПараметра);

	ДополнительныеПараметрыДокументаПриИзменении(ТаблицаФормы);
	
КонецПроцедуры

#Область include_local_Формы_ФормаПросмотрДокумента_События_ДополнительныеПараметрыДокумента
#КонецОбласти

