
// Процедура обновляет информацию по вложению (просмотр, прохождение, сопоставление номенклатуры) при переключении между вложениями в таблице
&НаКлиенте
Процедура ТаблицаДокументовПриАктивизацииЯчейки(Элемент)

	//Если нет выбранного вложения, или оно уже установлено.
	Если	Элемент.ТекущиеДанные = Неопределено
		Или	(	ПараметрыРаботы.Свойство("ТекущийИдентификатор")
			И	ПараметрыРаботы.ТекущийИдентификатор = Элемент.ТекущиеДанные.Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРаботы.Вставить("ТекущийИдентификатор", Элемент.ТекущиеДанные.Идентификатор);
	
	Вложение = Элемент.ТекущиеДанные.Вложение[0].Значение;
	
	ОбновитьПоляФормыПоВложению(Вложение);

	//Пока так
	сбисЭлементФормы(ЭтаФорма, "НеНайденКонтрагент").Видимость = Найти(Элемент.ТекущиеДанные.Статус, "Не найден контрагент");
	
КонецПроцедуры

