
&НаКлиенте
Процедура ТаблицаТранспортныеУпаковкиПередРазворачиванием(Элемент, Строка, Отказ)
	
	УпаковкаРазвернуть = МодульОбъектаКлиент().ПолучитьСтрокуКоллекцииФормыПоИдентификаторуУФ(ТранспортныеУпаковки, Строка);
	
	ЗаполнитьТранспортныеУпаковки(Новый Структура("УпаковкаРазвернуть", УпаковкаРазвернуть));
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТранспортныеУпаковкиПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Процедура нужна, чтобы была возможность перетаскивать элементы, когда все остальное редактирование таблицы запрещено
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТранспортныеУпаковкиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Перем ВместимостьУпаковки, ЗаполненностьУпаковки, КоличествоПереместить;
	
	Если Строка = Неопределено Тогда
		// Разупаковка
		ИдентификаторКудаПереместить = Null;
	Иначе
		СтрокаКудаПереместить = МодульОбъектаКлиент().ПолучитьСтрокуКоллекцииФормыПоИдентификаторуУФ(ТранспортныеУпаковки, Строка);
	
		Если СтрокаКудаПереместить.ЭтоУпаковка Тогда
			ИдентификаторКудаПереместить = СтрокаКудаПереместить.ИдентификаторСбис;
		Иначе
			Если СтрокаКудаПереместить.ПолучитьРодителя() = Неопределено Тогда
				// Разупаковка
				ИдентификаторКудаПереместить = Null;
			Иначе
				СтрокаКудаПереместить = СтрокаКудаПереместить.ПолучитьРодителя();
				ИдентификаторКудаПереместить = СтрокаКудаПереместить.ИдентификаторСбис;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ИдентификаторКудаПереместить <> Null Тогда
		ВместимостьУпаковки		= СтрокаКудаПереместить.ВместимостьУпаковки;
		ЗаполненностьУпаковки	= СтрокаКудаПереместить.Количество;
	КонецЕсли;
	
	СписокПараметровВызова = Новый Структура;
	СписокПараметровВызова.Вставить("ИдКудаПереместить",	ИдентификаторКудаПереместить);
	СписокПараметровВызова.Вставить("ИдДокументаСБИС",		СоставПакета.Идентификатор);
	
	МассивИдНомеклатурПереместить = Новый Массив;
	КоличествоПереместить = 0;
	
	Для Каждого СтрокаТовараПереместить Из ПараметрыПеретаскивания.Значение Цикл
		
		ТоварПереместить = МодульОбъектаКлиент().ПолучитьСтрокуКоллекцииФормыПоИдентификаторуУФ(ТранспортныеУпаковки, СтрокаТовараПереместить);
		
		Если Не ТоварПереместить.ЭтоУпаковка
				И ТоварПереместить.ПолучитьРодителя() = Неопределено
					Или ТоварПереместить.ПолучитьРодителя().ИдентификаторСбис <> ИдентификаторКудаПереместить Тогда
			
			МассивИдНомеклатурПереместить.Добавить(ТоварПереместить.ИдентификаторСбис);
			
			КоличествоПереместить = КоличествоПереместить + ТоварПереместить.Количество;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(МассивИдНомеклатурПереместить) Тогда
		Возврат;
	КонецЕсли;
	
	СписокПараметровВызова.Вставить("МассивИдНомеклатурПереместить",	МассивИдНомеклатурПереместить);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("СписокПараметровВызова",	СписокПараметровВызова);
	ДопПараметры.Вставить("КоличествоПереместить",	КоличествоПереместить);
	
	Если ЗаполненностьУпаковки = Неопределено Или  ВместимостьУпаковки - ЗаполненностьУпаковки >= КоличествоПереместить Тогда
		// Всё влезает, перемещаем, как есть
		ТаблицаТранспортныеУпаковкиПеретаскивание_Завершение(КоличествоПереместить, ДопПараметры);
		Возврат;
	КонецЕсли;
	
	ОставшаясяВместимость = ВместимостьУпаковки - ЗаполненностьУпаковки;
	Если ОставшаясяВместимость < 0 Тогда
		ОставшаясяВместимость = 0;
	КонецЕсли;
	
	ОбработчикДиалога = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ТаблицаТранспортныеУпаковкиПеретаскивание_Завершение", ЭтаФорма, ДопПараметры);
	
	Если МассивИдНомеклатурПереместить.Количество() = 1 Тогда
		// Задаем вопрос с вводом количества, если перемещаем 1 товар и он не влезает
		ТекстВопроса = "Оставшаяся вместимость упаковки (" + ОставшаясяВместимость + "/" + ВместимостьУпаковки + ")"
			+ Символы.ПС + " меньше пакуемого количества (" + КоличествоПереместить + "). Продолжить?";
		МодульОбъектаКлиент().СбисПоказатьВводЧисла(ОбработчикДиалога, КоличествоПереместить, ТекстВопроса, 15, 3);
	Иначе
		// Задаем вопрос, если несколько позиций товаров не влезают
		ТекстВопроса = "Вместимость упаковки меньше пакуемого количества. Продолжить?";
		
		КнопкиОтвет = Новый СписокЗначений;
		КнопкиОтвет.Добавить("Продолжить",	"Продолжить");
		КнопкиОтвет.Добавить("Отменить",	"Отменить");
		
		МодульОбъектаКлиент().СбисПоказатьВопрос(ОбработчикДиалога, ТекстВопроса, КнопкиОтвет,,,"Переместить");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТранспортныеУпаковкиПеретаскивание_Завершение(Ответ, ДопПараметры) Экспорт
	Перем КоличествоПереместить;
	
	Если ТипЗнч(Ответ) = Тип("Число") Тогда
		КоличествоПереместить = Мин(ДопПараметры.КоличествоПереместить, Ответ);
	ИначеЕсли Ответ = "Продолжить" Тогда
		КоличествоПереместить = ДопПараметры.КоличествоПереместить;
	Иначе
		Возврат;
	КонецЕсли;
	
	
	ДопПараметрыВызова = Новый Структура("КоличествоПереместить", КоличествоПереместить);
	
	Попытка
		МодульОбъектаКлиент().ПереместитьТоварВИзТранспортнойУпаковки(ДопПараметры.СписокПараметровВызова, ДопПараметрыВызова); 
	Исключение
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ТаблицаТранспортныеУпаковкиПеретаскивание_Завершение");
	КонецПопытки;
	
	ЗаполнитьТранспортныеУпаковки();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаУпаковкиКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаТранспортныеУпаковки").ТекущиеДанные;
	
	СписокПараметровВызова = Новый Структура();
	СписокПараметровВызова.Вставить("ИдДокументаСБИС",		СоставПакета.Идентификатор);
	СписокПараметровВызова.Вставить("ИдНоменклатурыСБИС",	ТекущаяСтрока.ИдентификаторСбис);
	СписокПараметровВызова.Вставить("Количество",			ТекущаяСтрока.Количество);
	
	Если ТекущаяСтрока.ПолучитьРодителя() <> Неопределено Тогда
		СписокПараметровВызова.Вставить("ИдУпаковкиСБИС",	ТекущаяСтрока.ПолучитьРодителя().ИдентификаторСбис);
	КонецЕсли;
	
	Попытка
		МодульОбъектаКлиент().ИзменитьКоличествоНоменклатурыВТаблицеТранспортныхУпаковок(СписокПараметровВызова); 
	Исключение
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ТаблицаУпаковкиКоличествоПриИзменении");
	КонецПопытки;
	
	ЗаполнитьТранспортныеУпаковки();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТранспортныеУпаковкиПриАктивизацииЯчейки(Элемент)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	ЭлементКоличество = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Элемент, "ТаблицаУпаковкиКоличество");
	
	Если ТекущаяСтрока <> Неопределено И ТекущаяСтрока.ЭтоУпаковка Тогда
		ЭлементКоличество.ТолькоПросмотр = Истина;
	Иначе
		ЭлементКоличество.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

