
// Процедура устанавливает тип документа 1С, который будет загружен	
&НаКлиенте
Процедура СинонимДокументаПриИзменении(Элемент)
	
	ТипДокумента	= СписокТиповДокументов.НайтиПоЗначению(СинонимДокумента).Представление;
	
	СтрокаТаблДок	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма,"ТаблицаДокументов").ТекущиеДанные;
	ВложениеСбис	= СтрокаТаблДок.Вложение[0].Значение;
	
	ИзмененияВложения		= Новый ФиксированнаяСтруктура("ПодразделИни", ТипДокумента);
	ДопПараметрыВложения	= Новый ФиксированнаяСтруктура("СоставПакета", СоставПакета);
	МодульОбъектаКлиент().ВложениеСБИС_Обновить(ВложениеСбис, ИзмененияВложения, ДопПараметрыВложения);
	
	СтруктураИниФайла = МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСбис, "УстановленныйПодразделИни");
	
	// Старые костыли. Пока оставил, т.к. надо разобрать, на что повлияет
	СтрокаТаблДок.Вложение[0].Значение.Вставить("СтруктураИниФайла", СтруктураИниФайла);
	СоставПакета.Вложение[СтрокаТаблДок.НомерВложенияВПакете].Вставить("СтруктураИниФайла", СтруктураИниФайла);
	//
	
	ТаблицаДокументовУстановитьСтроку(СтрокаТаблДок, ВложениеСбис);
	
	ОбновитьПоляФормыПоВложению(ВложениеСбис);
	
КонецПроцедуры

&НаКлиенте
Процедура Документ1СПриИзменении(Элемент)
	
	ВложениеСбис = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма,"ТаблицаДокументов").ТекущиеДанные.Вложение[0].Значение;
	
	ПараметрыПросмотр = МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСбис, "Просмотр");
	ПараметрыПросмотр.ПараметрыДокумент.Значение = Документ1С;
	СтруктураОбновить = Новый Структура;
	Если ТипЗнч(Документ1С) = Тип("Строка") Тогда
		
		СтруктураОбновить.Вставить("Номер", Документ1С);
		
	Иначе
		
		Если ПараметрыПросмотр.Свойство("ПараметрыДокумент") Тогда
			ПараметрыПросмотр.ПараметрыДокумент.Значение = Документ1С;
		КонецЕсли;
		СтруктураОбновить.Вставить("Документ", Документ1С);
		
	КонецЕсли;
	
	ДопПараметрыВложения = Новый ФиксированнаяСтруктура("СоставПакета", СоставПакета);
	МодульОбъектаКлиент().ВложениеСБИС_Обновить(ВложениеСбис, Новый Структура("Поля1С", СтруктураОбновить), ДопПараметрыВложения);
	
	ОбновитьПоляФормыПоВложению(ВложениеСбис);
	
КонецПроцедуры

&НаКлиенте
Процедура Документ1СВыборВариантаСписокНажатие(Элемент)

	ВариантыОбработкиДокументов = ПараметрыРаботы.ВариантыОбработкиДокумента;
	
	ОбработчикВыбора = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("Документ1СВыборВариантаСписокПослеДиалога", ЭтаФорма);
	ПараметрыВыбораСписка = Новый Структура("Заголовок, Обработчик", Элемент.Заголовок, ОбработчикВыбора);
	МодульОбъектаКлиент().СбисВыбратьИзСписка(ВариантыОбработкиДокументов, ПараметрыВыбораСписка);

КонецПроцедуры

&НаКлиенте
Процедура Документ1СОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ВложениеСбис = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма,"ТаблицаДокументов").ТекущиеДанные.Вложение[0].Значение;
	ДанныеПросмотраДокумента	= МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "Просмотр");
	РедактируемыеПоляВложения	= МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "Поля1С");
	ДанныеПросмотраДокумента.Удалить("ПараметрыДокумент");
	Если Не РедактируемыеПоляВложения.Документ = Неопределено Тогда
		РедактируемыеПоляВложения.Документ.Значение = Неопределено;
	КонецЕсли;
	Если Не РедактируемыеПоляВложения.Номер = Неопределено Тогда
		РедактируемыеПоляВложения.Номер.Значение = Неопределено;
	КонецЕсли;
	
	СтруктураОбновить = Новый Структура;
	СтруктураОбновить.Вставить("Номер",		Неопределено);
	СтруктураОбновить.Вставить("Документ",	Неопределено);
	
	ДопПараметрыВложения = Новый ФиксированнаяСтруктура("СоставПакета", СоставПакета);
	МодульОбъектаКлиент().ВложениеСБИС_Обновить(ВложениеСбис, Новый Структура("Поля1С", СтруктураОбновить), ДопПараметрыВложения);
	
	ОбновитьПоляФормыПоВложению(ВложениеСбис);
	
КонецПроцедуры

&НаКлиенте
Процедура Договор1СПриИзменении(Элемент)

	ВложениеСбис = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма,"ТаблицаДокументов").ТекущиеДанные.Вложение[0].Значение;

	СтруктураОбновить = Новый Структура;
	СтруктураОбновить.Вставить("Договор", Договор1С);

	ДопПараметрыВложения = Новый ФиксированнаяСтруктура("СоставПакета", СоставПакета);
	МодульОбъектаКлиент().ВложениеСБИС_Обновить(ВложениеСбис, Новый Структура("Поля1С", СтруктураОбновить), ДопПараметрыВложения);
	
КонецПроцедуры

&НаКлиенте
Процедура Контрагент1СПриИзменении(Элемент)

	ВложениеСбис = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма,"ТаблицаДокументов").ТекущиеДанные.Вложение[0].Значение;

	СтруктураОбновить = Новый Структура;
	СтруктураОбновить.Вставить("Контрагент", Контрагент1С);

	ДопПараметрыВложения = Новый ФиксированнаяСтруктура("СоставПакета", СоставПакета);
	МодульОбъектаКлиент().ВложениеСБИС_Обновить(ВложениеСбис, Новый Структура("Поля1С", СтруктураОбновить), ДопПараметрыВложения);
	
КонецПроцедуры

&НаКлиенте
Процедура Дата1СПриИзменении(Элемент)

	ВложениеСбис = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма,"ТаблицаДокументов").ТекущиеДанные.Вложение[0].Значение;

	СтруктураОбновить = Новый Структура;
	СтруктураОбновить.Вставить("Дата", Дата1С);

	ДопПараметрыВложения = Новый ФиксированнаяСтруктура("СоставПакета", СоставПакета);
	МодульОбъектаКлиент().ВложениеСБИС_Обновить(ВложениеСбис, Новый Структура("Поля1С", СтруктураОбновить), ДопПараметрыВложения);

КонецПроцедуры


