
// Функция - конструктор прикладного объекта SABY
//
// Параметры:
//	ВходящиеПараметры	 - Произвольный	 - основание для заполнения
//  ДопПараметры		 - Произвольный	 - расширение
// 
// Возвращаемое значение:
//  ПрикладнойОбъектSABY - Структура с предопределенными свойствами
//
//DynamicDirective
Функция Saby_НовыйПрикладнойОбъектSABY(ВходящиеПараметры = Неопределено, ДопПараметры = Неопределено) Экспорт 
	
	Возврат НовыйПрикладнойОбъектSABY(ВходящиеПараметры, ДопПараметры);
	
КонецФункции

// Функция - Базовый get-метод
//
// Параметры:
//  ПрикладнойОбъектSABY	 - ПрикладнойОбъектSABY	 - Структура, с преопределенными полями
//  КлючПолучить		 - Строка				 - Ключ свойства
//  ТипПолучить			 - Строка/Неопределено	 - Данные/Параметр/Тип/Ид
// 
// Возвращаемое значение:
//  Произвольный - свойство класса
//
//DynamicDirective
Функция Saby_ПрикладнойОбъектSABY_Получить(ПрикладнойОбъектSABY, КлючПолучить = Неопределено, ТипПолучить = Неопределено) Экспорт 
	
	Возврат ПрикладнойОбъектSABY_Получить(ПрикладнойОбъектSABY, КлючПолучить, ТипПолучить);
	
КонецФункции

// Процедура - Базовый set-метод
//
// Параметры:
//  ПрикладнойОбъектSABY	 - ПрикладнойОбъектSABY	 - 
//  КлючДобавить		 - Строка				 - 
//  ЗначениеДобавить	 - Произвольный			 - 
//  ТипДобавить			 - Строка				 - Данные/Параметр/Тип
//
//DynamicDirective
Процедура Saby_ПрикладнойОбъектSABY_Установить(ПрикладнойОбъектSABY, КлючДобавить = Неопределено, ЗначениеДобавить = Неопределено, ТипДобавить = Неопределено) Экспорт 
	
	ПрикладнойОбъектSABY_Установить(ПрикладнойОбъектSABY, КлючДобавить, ЗначениеДобавить, ТипДобавить);
	
КонецПроцедуры

