
// Процедура - установить сценарий "разобрать документ для загрузки"
//
// Параметры:
//  РезультатОтправки	 - РезультатОтправки		 - структура массовой операции
//  ПараметрыДляШаблон	 - ФиксированнаяСтруктура	 - структура параметров сценария
//		ЦепочкаКомандОбработки	 - ЦепочкаКомандОбработки, на которую устанавливается сценарий
//		ПараметрыВходящие		 - Структура входных параметров для цепочки в целом
//		ПараметрыСценария		 - Струкутра входные параметры для сценария
//
&НаКлиенте
Процедура МассоваяОперация_РазобратьДляЗагрузки_УстановитьСценарий(РезультатОтправки, ПараметрыДляШаблон) Экспорт
	
	ЦепочкаКомандОбработки	= ПараметрыДляШаблон.ЦепочкаКомандОбработки;
	ПараметрыВходящие		= ПараметрыДляШаблон.ПараметрыВходящие;
	ПараметрыСценария		= ПараметрыДляШаблон.ПараметрыСценария;

	ЦепочкаКомандОбработки_УстановитьКоманду(ЦепочкаКомандОбработки, "МассоваяОперация_Асинх_РазобратьДляЗагрузки");
		
КонецПроцедуры

