
&НаКлиенте
Процедура МассоваяОперация_ПроверитьИПодготовитьКоманду(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыВходящие = Неопределено)
	
	Если ПараметрыВходящие = Неопределено Тогда
		
		СоставПакета = ЦепочкаКомандОбработки_ПолучитьДанные(ЦепочкаКомандОбработки, "СоставПакета");
		МассоваяОперация_ПроверитьИПодготовитьКоманду_СоставПакета(РезультатОтправки, ЦепочкаКомандОбработки, СоставПакета);
		
	ИначеЕсли	ЭтоТипСбис(ПараметрыВходящие, "СоставПакета") Тогда
		
		МассоваяОперация_ПроверитьИПодготовитьКоманду_СоставПакета(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыВходящие);
		
	ИначеЕсли	ТипЗнч(ПараметрыВходящие) = Тип("Структура") Тогда  

		МассоваяОперация_ПроверитьИПодготовитьКоманду_Прочее(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыВходящие);
		
	Иначе
		
		ТекстОшибки			= "Заданы неверные параметры для выполнения массовой операции.";
		ОшибкаПодготовки	= НовыйСбисИсключение(776, "МодульОбъектаКлиент.МассоваяОперация_ПроверитьИПодготовитьКоманду",,,ТекстОшибки, ПараметрыВходящие);
		ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Ошибка", ОшибкаПодготовки);
		
	КонецЕсли;

//	Если ЦепочкаКомандОбработки_Получить(ЦепочкаКомандОбработки, "Статус") = "Ошибка" Тогда
//		
//		Возврат;
//		
//	КонецЕсли;
	
	МассоваяОперация_УстановитьОбъект(РезультатОтправки, ЦепочкаКомандОбработки)
			
КонецПроцедуры

// Процедура - подготовить команды, если есть готовый состав пакета
//
// Параметры:
//  РезультатОтправки		 - РезультатОтправки		 - текущая массовая операция
//  ЦепочкаКомандОбработки	 - ЦепочкаКомандОбработки	 - цепочка, для которой генерируются действия
//  СоставПакета			 - СоставПакета				 - сформированный, либо прочитанный ДокументСБИС
//  ДопПараметры			 - Структура/Неопределено	 - параметры - расширение
//		ИмяКоманды(Необязательный) - Строка - имя действия, которое надо выполнить с документом
//
&НаКлиенте
Процедура МассоваяОперация_ПроверитьИПодготовитьКоманду_СоставПакета(РезультатОтправки, ЦепочкаКомандОбработки, СоставПакета, ДопПараметры = Неопределено)
	Перем НаборСценариевДляКоманд;
	
	// Сперва проверки на ошибки
	Если			СоставПакета.Свойство("Ошибка") Тогда
	
		ПараметрыОшибки = Новый Структура("Подготовка, Исключение", Истина, СоставПакета.Ошибка);
		МассоваяОперация_ЦепочкаКомандОбработки_Ошибка(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыОшибки);
		Возврат;
		
	ИначеЕсли Не	СоставПакета.Свойство("Вложение") Тогда
		
		ОшибкаПодготовки = НовыйСбисИсключение(726, "МодульОбъектаКлиент.МассоваяОперация_ПроверитьИПодготовитьКоманду_СоставПакета");
		ПараметрыОшибки = Новый Структура("Подготовка, Исключение", Истина, ОшибкаПодготовки);
		МассоваяОперация_ЦепочкаКомандОбработки_Ошибка(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыОшибки);
		Возврат;
		
	ИначеЕсли		ДопПараметры = Неопределено
			Или	Не	ДопПараметры.Свойство("Сценарии", НаборСценариевДляКоманд) Тогда
			
		// Сценарии не заданы явно, сформировать по имеющемуся документу	
		ПараметрыПодготовитьСценарии	= Новый Структура;
		СценарииСДокументом				= Новый Структура;
		
		Если СоставПакета.Свойство("Этап") Тогда
			
			СценарииСДокументом = Новый Структура;
			СценарийПрочитать = Новый Структура("СоставПакета, Операция", СоставПакета);
			Если		ДопПараметры = Неопределено
				Или	Не	ДопПараметры.Свойство("Операция", СценарийПрочитать.Операция) Тогда
		
				СценарийПрочитать.Операция = "Черновик";
				
			КонецЕсли;
			
			СценарииСДокументом.Вставить("ПрочитатьДокумент", СценарийПрочитать);
			СценарииСДокументом.Вставить("ВыполнитьДействие", Новый Структура("ИмяКоманды", "Отправить"));
						
		Иначе
			
			ПараметрыСценария = Новый ФиксированнаяСтруктура("СоставПакета, Дополнительно", СоставПакета, ДопПараметры);
			СценарииСДокументом.Вставить("БазоваяОтправка", ПараметрыСценария);

		КонецЕсли;
		
		ПараметрыПодготовитьСценарии.Вставить("Сценарии", СценарииСДокументом);
		
	Иначе
		
		ПараметрыПодготовитьСценарии = ДопПараметры;
		
	КонецЕсли;

	МассоваяОперация_УстановитьСценарии(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыПодготовитьСценарии)
	
КонецПроцедуры

// Процедура - подготовить команды, от произвольных параметров
//
// Параметры:
//  РезультатОтправки		 - РезультатОтправки		 - текущая массовая операция
//  ЦепочкаКомандОбработки	 - ЦепочкаКомандОбработки	 - текущая цепочка команд, в которую требуется установить сценарий
//  ПараметрыВходящие		 - Структура				 - параметры для установки сценариев
//
&НаКлиенте
Процедура МассоваяОперация_ПроверитьИПодготовитьКоманду_Прочее(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыВходящие)
	Перем СоставПакетаПараметр, СценарииСДокументом;
	
	Если	ПараметрыВходящие.Свойство("Ошибка") Тогда
		
		ЦепочкаКомандОбработки_Установить(ЦепочкаКомандОбработки, "Ошибка", ПараметрыВходящие.Ошибка);
		Если ПараметрыВходящие.Свойство("Ссылка1С") Тогда
			
			ЦепочкаКомандОбработки_УстановитьДанные(ЦепочкаКомандОбработки, "Детализация", ПараметрыВходящие.Ссылка1С);
		
		КонецЕсли;
		
		Возврат;
		
	ИначеЕсли Не ПараметрыВходящие.Свойство("Сценарии", СценарииСДокументом) Тогда
		
		СценарииСДокументом		= Новый СписокЗначений;
		НужноУстановитьСценарий	= Истина;
		
	Иначе
		
		НужноУстановитьСценарий	= Ложь;		
		
	КонецЕсли;
	
	// Есть СоставПакета, проверить если это ДокументСБИС, то вся дальнейшая работа идет от него
	Если	ПараметрыВходящие.Свойство("СоставПакета", СоставПакетаПараметр) Тогда
		
		// Если пришел готовый пакет, то сценарии строятся от пакета
		Если ЭтоТипСбис(СоставПакетаПараметр, "СоставПакета") Тогда
		
			МассоваяОперация_ПроверитьИПодготовитьКоманду_СоставПакета(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыВходящие.СоставПакета, ПараметрыВходящие);
			Возврат;
			
		КонецЕсли;
		
		// Установить сценарий базовой отправки, если это не ДокументСБИС
		Если НужноУстановитьСценарий Тогда
			
			СценарийПодготовка = Новый Структура("СоставПакета, Дополнительно", СоставПакетаПараметр);
			СценарииСДокументом.Добавить(СценарийПодготовка, "БазоваяОтправка");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыВходящие.Свойство("ИдентификаторСБИС") Тогда
		
		Если Не ПараметрыВходящие.Свойство("Сценарии") Тогда
			
			Если ПараметрыВходящие.Свойство("Операция") Тогда
		
				СценарийПрочитать = Новый Структура("Операция", ПараметрыВходящие.Операция);
				
			Иначе
				
				СценарийПрочитать = Новый Структура("Операция", "Черновик");
				
			КонецЕсли;
			
			Если НужноУстановитьСценарий Тогда
				
				// Сперва сценарий для ПрочитатьДокумент - проверим, не черновик ли это
				СценарииСДокументом.Вставить(0, СценарийПрочитать, "ПрочитатьДокумент");
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
	ПараметрыВходящие.Вставить("Сценарии", СценарииСДокументом);
	МассоваяОперация_УстановитьСценарии(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыВходящие)

КонецПроцедуры

&НаКлиенте
Процедура МассоваяОперация_УстановитьСценарии(РезультатОтправки, ЦепочкаКомандОбработки, ПараметрыВходящие)
	
	СценарииУстановить	= ПараметрыВходящие.Сценарии;
	ШаблонКоманды		= "МассоваяОперация_{СтрШаблон}_УстановитьСценарий";
	
	Если ТипЗнч(СценарииУстановить) = Тип("Структура") Тогда
		
		Для Каждого КлючИЗначение Из СценарииУстановить Цикл
			
			ПараметрыДляШаблон	= Новый ФиксированнаяСтруктура("ЦепочкаКомандОбработки, ПараметрыВходящие, ПараметрыСценария",
									ЦепочкаКомандОбработки, ПараметрыВходящие, КлючИЗначение.Значение);
			ШаблонПрименить		= ПрименитьФорматКСтроке(ШаблонКоманды, КлючИЗначение.Ключ);
			ОбработчикШаблон	= НовыйСбисОписаниеОповещения(ШаблонПрименить, МодульОбъектаКлиент(), ПараметрыДляШаблон);
			ВыполнитьСбисОписаниеОповещения(РезультатОтправки, ОбработчикШаблон);
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого ЭлементСписка Из СценарииУстановить Цикл
			
			ПараметрыДляШаблон	= Новый ФиксированнаяСтруктура("ЦепочкаКомандОбработки, ПараметрыВходящие, ПараметрыСценария",
									ЦепочкаКомандОбработки, ПараметрыВходящие, ЭлементСписка.Значение);
			ШаблонПрименить		= ПрименитьФорматКСтроке(ШаблонКоманды, ЭлементСписка.Представление);
			ОбработчикШаблон	= НовыйСбисОписаниеОповещения(ШаблонПрименить, МодульОбъектаКлиент(), ПараметрыДляШаблон);
			ВыполнитьСбисОписаниеОповещения(РезультатОтправки, ОбработчикШаблон);
			
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры   

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_МассоваяОперация_private_Команды_УстановкаСценариев_ФлагДокументаИзменен
#КонецОбласти 

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_МассоваяОперация_private_Команды_УстановкаСценариев_ФлагЕстьРасхождения
#КонецОбласти 

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_МассоваяОперация_private_Команды_УстановкаСценариев_ПрочитатьДокумент
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_МассоваяОперация_private_Команды_УстановкаСценариев_ВыполнитьДействие
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_МассоваяОперация_private_Команды_УстановкаСценариев_БазоваяОтправка
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_МассоваяОперация_private_Команды_УстановкаСценариев_ДополнитьДокументВложениями
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_МассоваяОперация_private_Команды_РазобратьДляЗагрузки
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент_Классы_МассоваяОперация_private_Команды_СформироватьРасхождение
#КонецОбласти

