&НаКлиенте 
Процедура Показать(ПараметрыОткрытия) Экспорт

	СбисУстановитьФорму(ПараметрыОткрытия);
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ОткрытьМодально();
	#Иначе
		Открыть();
    #КонецЕсли
КонецПроцедуры 


&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыОткрытия)
	
	ЭтаФорма.Заголовок = ПараметрыОткрытия.Заголовок;
	ТабличнаяЧасть.Очистить();
	Кэш = ПараметрыОткрытия.Кэш; 
	ПараметрыФормы = Новый Структура("Результат");
	
	// v8unpack #Область ЗаполнениеДанныхНоменклатурыСБИС
	// Данные шапки берём неизменно из номенклатуры СБИС, изменения вносить запрещено
	НоменклатураКонтрагента		= ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Наименование;
	КоличествоСБИС				= ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Количество;
	Цена						= ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Цена;
	СтавкаНДС 					= ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.СтавкаНДС;
	СуммаНДСПоДокументу 		= ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.СуммаНДС;  
	СуммаПоДокументу 			= ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Сумма;
	СуммаВсего              	= ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Сумма;
	СуммаНДСВсего				= ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.СуммаНДС;
	СуммаБезНал					= ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.СуммаБезНал;
	
	Если НЕ СуммаБезНал = СуммаВсего И СуммаНДСВсего = 0 Тогда
		СуммаНДСВсего = СуммаВсего - СуммаБезНал;
	КонецЕсли;
	
	ЦенаВключаетНДС				= Цена * КоличествоСБИС	= СуммаВсего;
	
	Если ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Свойство("GTIN") Тогда
		GTIN = ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.GTIN;
	КонецЕсли;
	
	Если ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Свойство("КодПокупателя")  Тогда
		КодПокупателя = ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.КодПокупателя;		
	ИначеЕсли ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Свойство("ТипКода") И ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.ТипКода = "КодПокупателя" Тогда
		КодПокупателя = ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Код;
	Иначе 
		КодПокупателя = "";
	КонецЕсли;
	
	Если ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Свойство("Характеристика") Тогда  
		Характеристика = ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Характеристика;
	КонецЕсли;
	
	// Теоретически не может быть несколько единиц поставщика, но если такая фигня случится, то возьмём первую
	Если ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Единицы.Количество() Тогда 
		Для Каждого ЕдиницаПоставщика Из ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Единицы Цикл 
			ЕдиницыИзмерения 		= ЕдиницаПоставщика.Значение.Название;
			КоэффициентСБИС 		= ЕдиницаПоставщика.Значение.Коэффициент; 
			Прервать;
		КонецЦикла;
	КонецЕсли;
	// v8unpack #КонецОбласти //ЗаполнениеДанныхНоменклатурыСБИС
	
	// v8unpack #Область УстановкаОграниченияТиповПолейФормы
	
	УстановитьОграничениеТипаХарактеристики();
	УстановитьОграничениеТипаНоменклатуры(ПараметрыОткрытия);
	УстановитьОграничениеТипаЕдиницы();
	
	// v8unpack #КонецОбласти // Установка ограничения типов полей формы
	
	ДанныеРучногоСопоставления = ПараметрыОткрытия.ОсновныеДанные;
	
	// v8unpack #Область ЗаполнениеНоменклатуры1С 
	
	// Определим, есть ли среди найденных номенклатур "Основная" 
	ОсновнаяНоменклатураОпределена = Ложь;
	Если ПараметрыОткрытия.ОсновныеДанные.Номенклатура1С.Количество() > 1 Тогда
		Для Каждого Номенклатура1С Из ПараметрыОткрытия.ОсновныеДанные.Номенклатура1С Цикл
			Если Номенклатура1С.Значение.Основное Тогда
				ОсновнаяНоменклатураОпределена = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОсновноеСопоставлениеНайдено = Ложь;
	Для Каждого Номенклатура1С Из ПараметрыОткрытия.ОсновныеДанные.Номенклатура1С Цикл
		
		Если НЕ ОсновноеСопоставлениеНайдено 
			И Номенклатура1С.Значение.Основное Тогда
			ОсновноеСопоставлениеНайдено = Истина;
		ИначеЕсли ОсновноеСопоставлениеНайдено 
			И Номенклатура1С.Значение.Основное Тогда
			МодульОбъектаКлиент().ОписаниеНоменклатуры1СКлиент_Вставить(Номенклатура1С.Значение, "Основное", Ложь);
		Иначе
			// Подумать какие ещё варианты развития событий могут быть
		КонецЕсли;
		
		Если ПараметрыОткрытия.ОсновныеДанные.Номенклатура1С.Количество() = 1 
			И НЕ ЗначениеЗаполнено(Номенклатура1С.Ключ) Тогда
			
			ТабличнаяЧастьНстр = ТабличнаяЧасть.Добавить(); 
			ЗаполнитьЗначенияСвойств(ТабличнаяЧастьНСтр, ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС, "Цена, Кол_во, СуммаНДС, СтавкаНДС, СуммаБезНал, Сумма");
			
			Если НЕ КоэффициентСБИС = 0 Тогда
				ТабличнаяЧастьНСтр.Коэффициент 	  = КоэффициентСБИС;
				ТабличнаяЧастьНСтр.КоэффициентБыл = КоэффициентСБИС; 
			Иначе
				ТабличнаяЧастьНСтр.Коэффициент 	  = 1;
				ТабличнаяЧастьНСтр.КоэффициентБыл = 1;
			КонецЕсли;
			
			Если ТабличнаяЧастьНСтр.Кол_во = 0 Тогда
				ТабличнаяЧастьНСтр.Кол_во = 1;
			КонецЕсли;
			
			Прервать;
			
		ИначеЕсли ПараметрыОткрытия.ОсновныеДанные.Номенклатура1С.Количество() > 1
			И НЕ ЗначениеЗаполнено(Номенклатура1С.Ключ) Тогда
			Продолжить; 
		Иначе
			ТабличнаяЧастьНстр = ТабличнаяЧасть.Добавить();	
		КонецЕсли;     
		
		ТабличнаяЧастьНстр.Номенклатура = Номенклатура1С.Ключ;    
		
		ЗаполнитьДанныеДляЗагрузкиВДокумент1С(ДанныеРучногоСопоставления, ТабличнаяЧастьНстр.Номенклатура);
		
		// Первую заполненную номенклатуру 1С в списке найденных сопоставлений считаем основной и заполняем для неё все табличные данные из документа
		Если (НЕ ОсновнаяНоменклатураОпределена ИЛИ Номенклатура1С.Значение.Основное) 
			И ТабличнаяЧастьНстр.Кол_во = 0 
			И ТабличнаяЧастьНСтр.Цена = 0 Тогда
			
			ОсновнаяНоменклатураОпределена = Истина;
			ЗаполнитьЗначенияСвойств(ТабличнаяЧастьНСтр, ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС, "Цена, Кол_во, СуммаНДС, СтавкаНДС, СуммаБезНал, Сумма");   
			
		КонецЕсли;
		
		Если ТабличнаяЧастьНстр.СуммаНДС = 0 Тогда
			ТабличнаяЧастьНстр.СуммаНДС = ТабличнаяЧастьНстр.Сумма - ТабличнаяЧастьНстр.СуммаБезНал;
		КонецЕсли;
		
		// Для всех строк по умолчанию заполняем:
		// --Единицы
		// --Ссылку на номенклатуру 1С
		// --GTIN    
		ЗаполнитьЗначенияСвойств(ТабличнаяЧастьНСтр, Номенклатура1С.Значение, "GTIN");
		ТабличнаяЧастьНстр.Номенклатура = Номенклатура1С.Ключ;
		
		Если ЗначениеЗаполнено(Номенклатура1С.Значение.Единицы) Тогда 
			
			Для Каждого Единица Из Номенклатура1С.Значение.Единицы Цикл
				ТабличнаяЧастьНСтр.Единицы 	   = Единица.Ключ;
				
				Если ЗначениеЗаполнено(Единица.Значение.Коэффициент) Тогда
					ТабличнаяЧастьНСтр.Коэффициент = Единица.Значение.Коэффициент;
				ИначеЕсли ЗначениеЗаполнено(КоэффициентСБИС) Тогда
					ТабличнаяЧастьНСтр.Коэффициент = КоэффициентСБИС;
				Иначе
					ТабличнаяЧастьНСтр.Коэффициент = 1;
				КонецЕсли;
				
				ТабличнаяЧастьНстр.БазоваяЕдиницаОКЕИ = МодульОбъектаКлиент().ОКЕИБазовойЕдиницыНоменклатуры1С(Единица.Ключ);
				Прервать;
			КонецЦикла;
					
			ТабличнаяЧастьНСтр.КоэффициентБыл = ТабличнаяЧастьНСтр.Коэффициент;
			ПроизвестиПересчетПоКоэффициентуЕдиницИзмерения(ТабличнаяЧастьНСтр);
				
		КонецЕсли;
		
		
	КонецЦикла;
	
	Если НЕ ТабличнаяЧасть.Количество() Тогда
		ТабличнаяЧастьНстр = ТабличнаяЧасть.Добавить();
		ЗаполнитьЗначенияСвойств(ТабличнаяЧастьНСтр, ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС, "Цена, Кол_во, СуммаНДС, СтавкаНДС, СуммаБезНал, Сумма");
	КонецЕсли;
	// v8unpack #КонецОбласти //ЗаполнениеНоменклатуры1С
		
	// Не допилено, на будущее: обработка ошибок сопоставления номенклатуры будет блокировать интерфейс для закрытия пока пользователь не исправит всё, или закроет без сохранения изменений
	СообщенияОбОшибках = Новый Структура;
	СообщенияОбОшибках.Вставить("Модуль");
	СообщенияОбОшибках.Вставить("ТекстОшибки");
	СообщенияОбОшибках.Вставить("Критическая");
	// --------------------------------------------------------- 
	
	ЗакрытьБезСохранения = Ложь;
	СохранениеПроведено  = Ложь; 
	ИмеютсяИзмененияСопоставленнойНоменклатуры = Ложь;
	                  
	// v8unpack #Область Подвал
	ПеречистатьСуммыПоСтрокам();
	ПересчитатьИспользованноеИДоступноеКоличествоПоДокументу();
	// v8unpack #КонецОбласти // Подвал
	
	УстановитьВидимостьЭлементовФорм(ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементовФорм(ПараметрыОткрытия)
	
	ПараметрыНоменклатуры = ПараметрыОткрытия.ДопПараметрыФормыПросмотра.ПараметрыНоменклатуры;
	
	КолонкаХарактеристика = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧасть.Характеристика");
	
	Если ПараметрыНоменклатуры.Свойство("ЕстьХарактеристики")
			И ПараметрыНоменклатуры.ЕстьХарактеристики Тогда
			
		КолонкаХарактеристика.Видимость = Истина;
	Иначе
		КолонкаХарактеристика.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура  УстановитьОграничениеТипаХарактеристики() Экспорт			

	МодульТекущий	= МодульОбъектаКлиент();
	ОписанияТипов	= МодульТекущий.ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолей1С");
	
	Если Не ОписанияТипов.Свойство("Характеристика") Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеТипа = ОписанияТипов.Характеристика.ОписаниеТипа;
	
	ОписаниеПараметраИзменить = Новый ФиксированнаяСтруктура("Форма, Реквизит", ЭтаФорма, "ТабличнаяЧасть.Характеристика");
	ПараметрыИзменить = Новый Структура;
	ПараметрыИзменить.Вставить("УстановитьОграничениеТипа", ОписаниеТипа);
	
	Попытка
		МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеПараметраИзменить, ПараметрыИзменить);
	Исключение
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(),  "ФормаРучногоСопоставленияКонтрагентов.УстановитьОграничениеТипаХарактеристики");
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура  УстановитьОграничениеТипаНоменклатуры(ПараметрыОткрытия) Экспорт			

	МодульТекущий	= МодульОбъектаКлиент();
	ОписанияТипов	= МодульТекущий.ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолей1С");
	
	ПараметрыНоменклатуры = ПараметрыОткрытия.ДопПараметрыФормыПросмотра.ПараметрыНоменклатуры;
	
	Если  ПараметрыНоменклатуры.Свойство("ТипНоменклатуры1СПоИни")
			И ЗначениеЗаполнено(ПараметрыНоменклатуры.ТипНоменклатуры1СПоИни) Тогда
			
		ОписаниеТипа = МодульОбъектаКлиент().СоздатьОписаниеТипаПоОбъекту(ПараметрыНоменклатуры.ТипНоменклатуры1СПоИни);
	Иначе
		ОписаниеТипа = ОписанияТипов.Номенклатура.ОписаниеТипа;
	КонецЕсли;
	
	ОписаниеПараметраИзменить = Новый ФиксированнаяСтруктура("Форма, Реквизит", ЭтаФорма, "ТабличнаяЧасть.Номенклатура");
	ПараметрыИзменить = Новый Структура;
	ПараметрыИзменить.Вставить("УстановитьОграничениеТипа", ОписаниеТипа);
	
	Попытка
		МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеПараметраИзменить, ПараметрыИзменить);
	Исключение
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(),  "ФормаРучногоСопоставленияКонтрагентов.УстановитьОграничениеТипаНоменклатуры");
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура  УстановитьОграничениеТипаЕдиницы() Экспорт			

	МодульТекущий	= МодульОбъектаКлиент();
	ОписанияТипов	= МодульТекущий.ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолей1С");
	
	Если Не ОписанияТипов.Свойство("КлассификаторЕдиницИзмерения") Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеТипа = ОписанияТипов.КлассификаторЕдиницИзмерения.ОписаниеТипа;
	
	ОписаниеПараметраИзменить = Новый ФиксированнаяСтруктура("Форма, Реквизит", ЭтаФорма, "ТабличнаяЧасть.Единицы");
	ПараметрыИзменить = Новый Структура;
	ПараметрыИзменить.Вставить("УстановитьОграничениеТипа", ОписаниеТипа);
	
	Попытка
		МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеПараметраИзменить, ПараметрыИзменить);
	Исключение
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(),  "ФормаРучногоСопоставленияКонтрагентов.УстановитьОграничениеТипаЕдиницы");
	КонецПопытки;

КонецПроцедуры

