&НаКлиенте 
Процедура Показать(ПараметрыОткрытия) Экспорт

	СбисУстановитьФорму(ПараметрыОткрытия);
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ОткрытьМодально();
	#Иначе
		Открыть();
    #КонецЕсли
КонецПроцедуры 


&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыОткрытия)
	
	ЭтаФорма.Заголовок = ПараметрыОткрытия.Заголовок;
	ТабличнаяЧасть.Очистить();
	МестныйКэш = ПараметрыОткрытия.Кэш; 
	ПараметрыФормы = Новый Структура("Результат");
	
	#Область ЗаполнениеДанныхНоменклатурыСБИС
	// Данные шапки берём неизменно из номенклатуры СБИС, изменения вносить запрещено
	НоменклатураКонтрагента = ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Наименование;
	КоличествоСБИС 			= ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Количество;
	Цена 					= ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Цена;
	СтавкаНДС 				= ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.СтавкаНДС;
	СуммаНДСПоДокументу 	= ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.СуммаНДС;  
	СуммаПоДокументу 		= ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Сумма;
	СуммаВсего              = ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Сумма;
	СуммаНДСВсего			= ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.СуммаНДС;
	
	ОсталосьКоличествоВБазовыхЕдиницах = 0;
	ЗарезервированноеКоличествоВБазовыхЕдиницах = КоличествоСБИС * КоэффициентСБИС;
	
	
	Если ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Свойство("GTIN") Тогда
		GTIN = ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.GTIN;
	КонецЕсли;
	
	Если ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Свойство("КодПокупателя")  Тогда
		КодПокупателя = ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.КодПокупателя;		
	ИначеЕсли ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Свойство("ТипКода") И ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.ТипКода = "КодПокупателя" Тогда
		КодПокупателя = ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Код;
	Иначе 
		КодПокупателя = "";
	КонецЕсли;
	
	Если ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Свойство("Характеристика") Тогда  
		Характеристика = ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Характеристика;
	КонецЕсли;
	
	// Теоретически не может быть несколько единиц поставщика, но если такая фигня случится, то возьмём последнюю
	Если ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Единицы.Количество() Тогда 
		Для Каждого ЕдиницаПоставщика Из ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС.Единицы Цикл 
			ЕдиницыИзмерения 		= ЕдиницаПоставщика.Значение.Название;
			КоэффициентСБИС 		= ЕдиницаПоставщика.Значение.Коэффициент;  
		КонецЦикла;
	КонецЕсли;
	#КонецОбласти //ЗаполнениеДанныхНоменклатурыСБИС
	
	Если МестныйКэш.Ини.Конфигурация.Свойство("Номенклатура") Тогда
		ИмяСправочникаНоменклатуры = СокрЛП(Сред(МестныйКэш.Ини.Конфигурация.Номенклатура.Значение, Найти(МестныйКэш.Ини.Конфигурация.Номенклатура.Значение, ".") + 1));
		СправочникНоменклатураПолноеИмя = "Справочник." + ИмяСправочникаНоменклатуры;
		ТипСправочникаНоменклатуры = "СправочникСсылка." + ИмяСправочникаНоменклатуры;
	Иначе
		СправочникНоменклатураПолноеИмя = "Справочник.Номенклатура";
		ТипСправочникаНоменклатуры = "СправочникСсылка.Номенклатура";
	КонецЕсли;

	Если МестныйКэш.Ини.Конфигурация.Свойство("СправочникЕдиницИзмеренийДляСопоставлений") Тогда
		СправочникЕдиницИмя = СокрЛП(Сред(МестныйКэш.Ини.Конфигурация.СправочникЕдиницИзмеренийДляСопоставлений.Значение, Найти(МестныйКэш.Ини.Конфигурация.СправочникЕдиницИзмеренийДляСопоставлений.Значение, ".")+1));
		СправочникЕдиницПолноеИмя = "Справочник." + СправочникЕдиницИмя;		
		ТипСправочникаЕдиницаИзмерения = МестныйКэш.Ини.Конфигурация.СправочникЕдиницИзмеренийДляСопоставлений.Значение;
	Иначе
		СправочникНоменклатураПолноеИмя = "Справочник.Номенклатура";
		ТипСправочникаЕдиницаИзмерения = "СправочникСсылка.КлассификаторЕдиницИзмерения";
	КонецЕсли;
	
	ЭлементТабличнаяЧастьНоменклатура = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧастьНоменклатура");
	ЭлементТабличнаяЧастьНоменклатура.ОграничениеТипа = Новый ОписаниеТипов(ТипСправочникаНоменклатуры);

	ЭлементТабличнаяЧастьЕдиницы = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТабличнаяЧастьЕдиницы");
	ЭлементТабличнаяЧастьЕдиницы.ОграничениеТипа = Новый ОписаниеТипов(ТипСправочникаЕдиницаИзмерения);
	
	ДанныеРучногоСопоставления = ПараметрыОткрытия.ОсновныеДанные;

	#Область ЗаполнениеНоменклатуры1С
	ОсновноеСопоставление = Истина;
	Для Каждого Номенклатура1С Из ПараметрыОткрытия.ОсновныеДанные.Номенклатура1С Цикл
		
		Если ПараметрыОткрытия.ОсновныеДанные.Номенклатура1С.Количество() = 1 
			И НЕ ЗначениеЗаполнено(Номенклатура1С.Ключ) Тогда
			
			ТабличнаяЧастьНстр = ТабличнаяЧасть.Добавить();
			ЗаполнитьЗначенияСвойств(ТабличнаяЧастьНСтр, ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС, "Цена, Количество, СуммаНДС, СтавкаНДС, СуммаБезНДС, Сумма");   
			ТабличнаяЧастьНСтр.Коэффициент = КоэффициентСБИС;
			ТабличнаяЧастьНСтр.КоэффициентБыл = КоэффициентСБИС;
			ОсновноеСопоставление = Ложь;
			Прервать;
		ИначеЕсли ПараметрыОткрытия.ОсновныеДанные.Номенклатура1С.Количество() > 1
			И НЕ ЗначениеЗаполнено(Номенклатура1С.Ключ) Тогда
			Продолжить;
		КонецЕсли;     
		
		ТабличнаяЧастьНстр = ТабличнаяЧасть.Добавить();  
		ТабличнаяЧастьНстр.Номенклатура = Номенклатура1С.Ключ;    
		
		ЗаполнитьДанныеДляЗагрузкиВДокумент1С(ДанныеРучногоСопоставления, ТабличнаяЧастьНстр.Номенклатура, "КлассСопоставления");
		
		// Первую заполненную номенклатуру 1С в списке найденных сопоставлений считаем основной и заполняем для неё все табличные данные из документа
		Если ОсновноеСопоставление 
			И ТабличнаяЧастьНстр.Количество = 0 
			И ТабличнаяЧастьНСтр.Цена = 0 Тогда
			
			ЗаполнитьЗначенияСвойств(ТабличнаяЧастьНСтр, ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС, "Цена, Количество, СуммаНДС, СтавкаНДС, СуммаБезНДС, Сумма");   
			ОсновноеСопоставление = Ложь;  
			
		КонецЕсли;
		
		// Для всех строк по умолчанию заполняем:
		// --Елиницы
		// --Ссылку на номенклатуру 1С
		// --GTIN
		ЗаполнитьЗначенияСвойств(ТабличнаяЧастьНСтр, Номенклатура1С.Значение, "GTIN");
		ТабличнаяЧастьНстр.Номенклатура = Номенклатура1С.Ключ;
		
		Если НЕ Номенклатура1С.Значение.Единицы = Неопределено Тогда 
			
			Для Каждого Единица Из Номенклатура1С.Значение.Единицы Цикл
				ТабличнаяЧастьНСтр.Единицы 	   = Единица.Ключ; 
				ТабличнаяЧастьНСтр.Коэффициент = Единица.Значение.Коэффициент;
				Прервать;
			КонецЦикла;
					
			Если НЕ ЗначениеЗаполнено(ТабличнаяЧастьНСтр.Коэффициент) И ЗначениеЗаполнено(КоэффициентСБИС) Тогда   
				ТабличнаяЧастьНСтр.Коэффициент = КоэффициентСБИС;
			Иначе
				ТабличнаяЧастьНСтр.Коэффициент = 1;		
			КонецЕсли;               
			
			ТабличнаяЧастьНСтр.КоэффициентБыл = ТабличнаяЧастьНСтр.Коэффициент;
			ПроизвестиПересчетПоКоэффициентуЕдиницИзмерения(ТабличнаяЧастьНСтр);
			
		Иначе
			ТабличнаяЧастьНСтр.Единицы = ПустаяСсылкаИскомогоСправочника(СправочникЕдиницИмя);;	
		КонецЕсли;
		
		
	КонецЦикла;
	
	Если НЕ ТабличнаяЧасть.Количество() Тогда
		ТабличнаяЧастьНстр = ТабличнаяЧасть.Добавить();
		ЗаполнитьЗначенияСвойств(ТабличнаяЧастьНСтр, ПараметрыОткрытия.ОсновныеДанные.НоменклатураСБИС, "Цена, Количество, СуммаНДС, СтавкаНДС, СуммаБезНДС, Сумма");
	КонецЕсли;
	#КонецОбласти //ЗаполнениеНоменклатуры1С
		
	// Не допилено, на будущее: обработка ошибок сопоставления номенклатуры будет блокировать интерфейс для закрытия пока пользователь не исправит всё, или закроет без сохранения изменений
	СообщенияОбОшибках = Новый Структура;
	СообщенияОбОшибках.Вставить("Модуль");
	СообщенияОбОшибках.Вставить("ТекстОшибки");
	СообщенияОбОшибках.Вставить("Критическая");
	
	ЗакрытьБезСохранения = Ложь;
	СохранениеПроведено  = Ложь; 
	ИмеютсяИзмененияСопоставленнойНоменклатуры = Ложь;
	// ---------------------------------------------------------
	
КонецПроцедуры
