
&НаКлиенте
Перем МестныйКэш, Форма_ExtSDK, ПлагинКоннектор Экспорт;

#Область include_local_ВебКлиент
#КонецОбласти

#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

////////////////////////////////////////////////////
//////////////////Автообновление////////////////////
////////////////////////////////////////////////////

&НаКлиенте
Функция СбисПолучитьПараметрыАктуальнойВерсии(Кэш, ПараметрыОбновления, Отказ) Экспорт
	Возврат сбисСохранитьВФайлПоСсылке(Кэш, ПараметрыОбновления, Отказ);
КонецФункции

&НаКлиенте
Функция СбисСохранитьВФайлПоСсылке(Кэш, СбисПараметрыФайла, Отказ) Экспорт
	ДопПараметрыЗапроса	= Новый Структура("СообщатьПриОшибке, ВернутьОшибку", Ложь, Истина);
	ПараметрыМетода = Новый Структура("FileName, Url", сбисПараметрыФайла.ИмяФайла);
	Если сбисПараметрыФайла.Свойство("URL") И Лев(сбисПараметрыФайла.URL, 8) = "https://" Тогда   
		ПараметрыМетода.Url = сбисПараметрыФайла.URL;
	ИначеЕсли Не сбисПараметрыФайла.Свойство("URLПолный", ПараметрыМетода.Url) Тогда		
		ПараметрыМетода.Url = сбисПараметрыФайла.Протокол + "://" + сбисПараметрыФайла.Сервер + сбисПараметрыФайла.URL;
	КонецЕсли;
	сбисРезультатЧтения = СбисОтправитьИОбработатьКоманду(Кэш, "LoadDataFromURLToFile", ПараметрыМетода, ДопПараметрыЗапроса, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(сбисРезультатЧтения,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".сбисСохранитьВФайлПоСсылке", 700, "Неизвестная ошибка подключения", сбисРезультатЧтения.details);
	КонецЕсли;	
	Возврат Истина;	
КонецФункции

////////////////////////////////////////////////////
////////////////////Авторизация/////////////////////
////////////////////////////////////////////////////

//Авторизуется по сертификату	
&НаКлиенте
Функция АвторизоватьсяПоСертификату(Кэш,Сертификат,Отказ=Ложь) Экспорт

	ДопПараметры = Новый Структура("СообщатьПриОшибке, ВернутьОшибку, БезАвторизации", Ложь, Истина, Истина);	
	ДопПараметры.Вставить("ОчиститьПараметры", Истина);
	ПараметрыРезультат = Новый Структура(	"Метод,			Параметры,								ДополнительныеПараметры", 
											"AuthByCert",	Новый Структура("Imprint", Сертификат),	ДопПараметры);
	Возврат сбисОтправитьИОбработатьКоманду(Кэш, ПараметрыРезультат.Метод, ПараметрыРезультат.Параметры, ДопПараметры, Отказ);

КонецФункции

//Авторизуется по токену	
&НаКлиенте
Функция АвторизоватьсяПоТокену(Кэш,Отказ=Ложь) Экспорт 	
	ДопПараметры = Новый Структура("СообщатьПриОшибке, ВернутьОшибку, БезАвторизации", Ложь, Истина, Истина);
	МестныйКэш = Кэш;
	
	Токен = Кэш.ГлавноеОкно.сбисПолучитьФорму("API").ПолучитьТокенДляТекущегоПользователя(Кэш, Отказ);
	Если Отказ Тогда
		Возврат Токен;
	КонецЕсли;
	
	ДопПараметры.Вставить("ОчиститьПараметры", Истина);
	ПараметрыРезультат = Новый Структура( "Метод, Параметры, ДополнительныеПараметры", "AuthByToken", Новый Структура("Token", Токен), ДопПараметры);
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, ПараметрыРезультат.Метод, ПараметрыРезультат.Параметры, ДопПараметры, Отказ);
	Если Не Отказ Тогда   
		МестныйКэш.Парам.ИдентификаторСессии = Результат;
		сбисПараметрыСтатистики = Новый Структура("Действие, ДетальноеСообщение", "Аутентификация", "По токену");
		Кэш.ОбщиеФункции.сбисСтатистика_СформироватьИЗаписатьСтатистикуНаСервис(МестныйКэш, сбисПараметрыСтатистики, Ложь);
	КонецЕсли;
	Возврат Результат;
КонецФункции

//Функция получает токен по текущему сиду	
&НаКлиенте
функция ПолучитьТикетДляТекущегоПользователя(Кэш) Экспорт
	Отказ = Ложь;
	РезультатЗапроса = СбисОтправитьИОбработатьКоманду(Кэш, "ReadTicket", Новый Структура, Новый Структура,Отказ);
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат РезультатЗапроса;
КонецФункции

//Закрывает текущую сессию	
&НаКлиенте
Функция ЗакрытьСессию(Кэш) Экспорт
	
	Отказ				= Ложь;
	Кэш.КэшСертификатов	= Новый Структура;
	ДопПараметрыЗапроса	= Новый Структура;
	МодульОбъектаКлиент().ИзменитьПараметрСбис("Авторизован",	Ложь);
	РезультатЗапроса = сбисОтправитьИОбработатьКоманду(Кэш, "TerminateSession", Новый Структура, ДопПараметрыЗапроса,Отказ);
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат РезультатЗапроса;
	
КонецФункции	

//Метод устарел, вместо него использовать Кэш.СБИС.МодульОбъектаКлиент.СбисПолучитьИнформациюОТекущемПользователе
//Получает строковое представление ФИО о текущем пользователе	
&НаКлиенте
Функция ИнформацияОТекущемПользователе(Кэш) Экспорт
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат", Истина);
	
	РезультатЗапроса = СбисОтправитьИОбработатьКоманду(Кэш, "ReadCurrentUserInfo", Новый Структура, ДопПараметрыЗапроса,Отказ);
	Если Отказ Тогда
		Возврат "";
	КонецЕсли;
	
	Фамилия	= Неопределено;
	Имя		= Неопределено;
	Отчество= Неопределено;
	
	Если Не РезультатЗапроса.Свойство("Фамилия", Фамилия) Тогда
		Фамилия = "";
	КонецЕсли;
	Если Не РезультатЗапроса.Свойство("Имя", Имя) Тогда
		Имя = "";
	КонецЕсли;
	Если Не РезультатЗапроса.Свойство("Отчество",	Отчество) Тогда
		Отчество = "";
	КонецЕсли;
	Возврат Фамилия+" "+Имя+" "+Отчество;
КонецФункции

//Отправляет код авторизации на номер телефона, указанный в карточке сотрудника
&НаКлиенте
Функция ОтправитьКодАвторизации(Кэш, ПараметрыПодтверждения, Отказ) Экспорт
КонецФункции

//Функция выполняет подтверждение введенного кода для двухфакторной аутентификации
&НаКлиенте
Функция ПодтвердитьАвторизацию(Кэш, ПараметрыВвода, ПараметрыПодтверждения, Отказ) Экспорт
	ДопПараметры = Новый Структура("СообщатьПриОшибке, ВернутьОшибку, БезАвторизации", Ложь, Истина, Истина);	
	
	ПараметрыЗапроса = Новый Структура("Param", Новый Структура("Код, Идентификатор, ВызываемыйМетод", ПараметрыВвода.ПинКод, ПараметрыПодтверждения.Идентификатор, ПараметрыПодтверждения.МетодВалидации));
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "AuthConfirmCode", ПараметрыЗапроса, ДопПараметры, Отказ);
	Если Не Отказ Тогда
		МодульОбъектаКлиент().ИзменитьПараметрСбис("Авторизован",	Истина);
	КонецЕсли;
	Возврат Результат;	
КонецФункции

//Получает список сертификатов, пригодных для авторизации	
&НаКлиенте
Функция ПолучитьСписокСертификатовДляАвторизации(Кэш, ТекстОшибки) Экспорт
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура("ВернутьОшибку, ЕстьРезультат, ВремяОжиданияОтвета, БезАвторизации", Истина, Истина, 120, Истина);      // увеличено время ожидания, т.к. через сбисПараметры можно переопределить только для вызовов после авторизаии
	СписокСертификатов	= Новый СписокЗначений();
	МестныйКэш			= Кэш;
	
	РезультатЗапроса = СбисОтправитьИОбработатьКоманду(Кэш, "ReadCertListForAuth", Новый Структура("Filter", Новый Структура), ДопПараметрыЗапроса,Отказ);
	Если Отказ Тогда
		ТекстОшибки = РезультатЗапроса.message;
		Возврат Ложь;
	КонецЕсли;
	Возврат Форма_ExtSDK.ОбработатьСписокСертификатовДляАвторизации(Кэш, РезультатЗапроса["Сертификат"]);
	
КонецФункции

//Проверяет активна ли текущая сессия
&НаКлиенте
Функция СбисСессияДействительна(Кэш) Экспорт
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат, СообщатьПриОшибке", Истина, Ложь);
	
	РезультатЗапроса = СбисОтправитьИОбработатьКомандуCallSabyApi(Кэш, "СБИС.ПроверитьСессию", Новый Структура, ДопПараметрыЗапроса,Отказ);
	Если Не Отказ
		И РезультатЗапроса.СессияАктивна = "Да" Тогда
		Возврат 1;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Функция СбисИдАккаунта(Кэш) Экспорт
	
	//Тут дело в том, что этот ИД аккаунта это не номер аккаунта в биллинге. Это сессия/токен для корректного вызова СБИС плагин.
	//Переписать использование поля на СбисТокенАвторизации и на поле Авторизация в команде
	Возврат Кэш.Парам.ИдентификаторСессии;
	
КонецФункции

&НаКлиенте
Функция ПолучитьИдТекущегоАккаунта(Кэш) Экспорт
	Перем СбисИдАккаунта;
	Если Кэш.СБИС.ПараметрыИнтеграции.Свойство("ИдАккаунта", СбисИдАккаунта) Тогда
		Возврат СбисИдАккаунта;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции
&НаКлиенте
Функция Аккордеон_ОтключенныеРазделы() Экспорт
	ОтключенныеРазделы = Новый Структура();
	Возврат ОтключенныеРазделы;
КонецФункции
//Устанавливает в SDK настройки подключения		
&НаКлиенте
Функция СформироватьНастройкиПодключения(Кэш, ИдентификаторСессии = "", ДопПараметрыЗапроса=Неопределено, Отказ=Ложь) Экспорт
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура СбисУстановитьВремяОжидания(Кэш, ВремяОжидания) Экспорт
	Форма_ExtSDK.СбисУстановитьВремяОжидания(Кэш, ВремяОжидания);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНастройкиПлагина(Кэш, ДопПараметрыЗапроса, Отказ) Экспорт
	Если Не(	(	Кэш.Парам.СпособОбмена = 5 Или Кэш.Парам.СпособОбмена = 7) 
			И		Кэш.Парам.ШифроватьВыборочно = Истина) 
			И	Не	Кэш.Свойство("КаталогЗашифрованных") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Параметр = Новый Структура();
	Если ДопПараметрыЗапроса = Неопределено Тогда
		ДопПараметрыЗапроса = Новый Структура;	
	КонецЕсли;
	Рез = сбисОтправитьИОбработатьКоманду(Кэш,"GetPluginSettings",Параметр, ДопПараметрыЗапроса,Отказ);	
	Если Не Отказ Тогда
		Если Рез.Свойство("SecureLoading") и Рез.SecureLoading.Свойство("fromFolder") и Рез.SecureLoading.encrypt = Истина Тогда
			Кэш.Вставить("КаталогЗашифрованных", Рез.SecureLoading.fromFolder);	
		КонецЕсли;
	КонецЕсли;
КонецФункции	

////////////////////////////////////////////////////
////////////////////Сертификаты/////////////////////
////////////////////////////////////////////////////

//Функция активирует серверные сертификаты для определенного списка ИНН	
&НаКлиенте
Функция АктивироватьСерверныеСертификаты(Кэш, СписокСертификатов) Экспорт
	ДопПараметрыЗапроса = Новый Структура;
	Отказ = Ложь;
	Для Каждого Элемент Из СписокСертификатов Цикл
		Сертификат = Элемент.Значение;
		ПараметрыАктивации = Новый Структура;
		ПараметрыАктивации.Вставить("Отпечаток", Сертификат.Отпечаток);
		ПараметрыАктивации.Вставить("КодАктивации", Сертификат.КодАктивации);
		
		РезультатЗапроса = СбисОтправитьИОбработатьКомандуCallSabyApi(Кэш, "СБИС.АктивироватьСертификат", ПараметрыАктивации, ДопПараметрыЗапроса,Отказ);
		Если Отказ Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Не Отказ;
КонецФункции

//Получает список доступных сертификатов	
&НаКлиенте
Функция ПолучитьСписокСертификатов(Кэш, filter=Неопределено) Экспорт
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат", Истина);
	
	Если filter = Неопределено Тогда
		filter = Новый Структура;
	КонецЕсли;
	
	РезультатЗапроса = СбисОтправитьИОбработатьКоманду(Кэш, "ReadCertList", Новый Структура("Filter", filter), ДопПараметрыЗапроса,Отказ);
	Если Отказ Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	Возврат Форма_ExtSDK.ОбработатьСписокСертификатовДляАктивации(Кэш, РезультатЗапроса.Сертификат);
КонецФункции 

&НаКлиенте
Функция ПолучитьСписокСертификатовПоФильтру(Кэш, filter=Неопределено, Отказ) Экспорт
	
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат, СообщатьПриОшибке, ВернутьОшибку", Истина, Ложь, Истина);
	
	Если filter = Неопределено Тогда
		filter = Новый Структура;
	КонецЕсли;
	
	РезультатЗапроса = СбисОтправитьИОбработатьКоманду(Кэш, "ReadCertList", Новый Структура("Filter", filter), ДопПараметрыЗапроса,Отказ);
	Если Отказ Тогда
		Возврат МодульОбъектаКлиент().НовыйСбисИсключение(РезультатЗапроса);
	КонецЕсли;
		
	Возврат Форма_ExtSDK.ОбработатьСписокСертификатовДляАктивации(Кэш, РезультатЗапроса.Сертификат);
КонецФункции

&НаКлиенте
Функция ПолучитьСписокЛокальныхСертификатов(Кэш, filter=Неопределено) Экспорт
	
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат", Истина);
	
	Если filter = Неопределено Тогда
		filter = Новый Структура;
	КонецЕсли;
	
	РезультатЗапроса = СбисОтправитьИОбработатьКоманду(Кэш, "ReadCertList", Новый Структура("Filter", filter), ДопПараметрыЗапроса,Отказ);
	Если Отказ Тогда
		Возврат МодульОбъектаКлиент().ВызватьСбисИсключение(РезультатЗапроса, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".ПолучитьСписокЛокальныхСертификатов");
	КонецЕсли;
	
	Возврат Форма_ExtSDK.ОбработатьСписокСертификатовДляАктивации(Кэш, РезультатЗапроса.Сертификат);
	
КонецФункции


//Функция активирует серверные сертификаты для определенного списка ИНН	
&НаКлиенте
Функция ПолучитьСертификатыДляАктивации(Кэш, СписокИНН) Экспорт
	Возврат Форма_ExtSDK.ПолучитьСертификатыДляАктивации(Кэш, СписокИНН);
КонецФункции

//Функция получает код активации для сертификата
&НаКлиенте
Функция ПолучитьКодАктивацииСертификата(Кэш, Сертификат) Экспорт
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура;
	
	ПараметрыАктивации = Новый Структура("Отпечаток", Сертификат.Отпечаток);
	
	РезультатЗапроса = СбисОтправитьИОбработатьКомандуCallSabyApi(Кэш, "СБИС.ПолучитьКодАктивацииСертификата", ПараметрыАктивации, ДопПараметрыЗапроса,Отказ);
	Возврат Не Отказ;
КонецФункции

////////////////////////////////////////////////////
/////////////////Списочные методы///////////////////
////////////////////////////////////////////////////

//Получает статусы документов сбис
&НаКлиенте
Функция ПолучитьСписокИзменений(Кэш, ДопПараметрыФильтра = Неопределено) Экспорт
	Возврат Форма_ExtSDK.ПолучитьСписокИзменений(Кэш, ДопПараметрыФильтра);
КонецФункции

//Получает список организаций, присутствующих одновременно в кабинете СБИС и в базе 1С, у которых есть необработанные служебные документы
&НаКлиенте
Функция ПолучитьСписокНашихОрганизаций(Кэш, СписокИНН) Экспорт
	Возврат Форма_ExtSDK.ПолучитьСписокНашихОрганизаций(Кэш, СписокИНН);
КонецФункции

// Устарел. Использовать МодульОбъектаКлиент().ПолучитьСписокДокументовОтгрузкиСБИС()
&НаКлиенте
Функция ПолучитьСписокДокументовОтгрузки(Кэш) Экспорт
	
	Возврат МодульОбъектаКлиент().ПолучитьСписокДокументовОтгрузкиСБИС();
	
КонецФункции

// Устарел. Использовать МодульОбъектаКлиент().ПолучитьСписокДокументовПоСобытиямСБИС()
&НаКлиенте
Функция ПолучитьСписокСобытий(Кэш, ТипРеестра) Экспорт
	
	Возврат МодульОбъектаКлиент().ПолучитьСписокДокументовПоСобытиямСБИС(Новый Структура("ТипРеестра", ТипРеестра));
	
КонецФункции

// Устарел. Использовать МодульОбъектаКлиент().ПолучитьСписокДокументовСБИС()
&НаКлиенте
Функция СбисПолучитьСписокДокументов(Кэш) Экспорт
	
	Возврат МодульОбъектаКлиент().ПолучитьСписокДокументовСБИС();
	
КонецФункции

//Получает список документов определенного типа с online.saby.ru	
&НаКлиенте
Функция СбисПолучитьСписокЗадач(Кэш, сбисФильтр, Отказ) Экспорт
	ДопПараметрыЗапроса = Новый Структура("ЕстьРезультат", Истина);
	Результат = СбисОтправитьИОбработатьКомандуCallSabyApi(Кэш, "API3.TaskList", сбисФильтр, ДопПараметрыЗапроса, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат, "ExtSDK.сбисПолучитьСписокЗадач");
	КонецЕсли;
	Возврат Результат
КонецФункции	

////////////////////////////////////////////////////
/////////////////Чтение документов//////////////////
////////////////////////////////////////////////////

//Получает структуру документа СБИС
&НаКлиенте
Функция ПрочитатьДокумент(Кэш, ИдДок, ДопПараметры=Неопределено, Отказ=Ложь) Экспорт
	Возврат Форма_ExtSDK.ПрочитатьДокумент(Кэш,ИдДок,ДопПараметры,Отказ);
КонецФункции

//Получает html по xml	
&НаКлиенте
функция ПолучитьHTMLПоXML(Кэш, Вложение) Экспорт 
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат", Истина);
	
	Если ТипЗнч(Вложение) = Тип("Структура") Тогда
	
		XMLДокумента = СтрЗаменить(Вложение.XMLДокумента, "UTF-8", "windows-1251");
		document = Новый Структура("XML, Тип, Подтип, ВерсияФормата, ПодВерсияФормата", XMLДокумента, "", "", "", "");
		ЗаполнитьЗначенияСвойств(document, Вложение);
		//Костыль на случай, если ПодВерсия есть, но неопределена
		Если document.ПодВерсияФормата = Неопределено Тогда
			 document.ПодВерсияФормата = "";
		КонецЕсли;
		
	Иначе   // для совместимости с внешними функциями (СформироватьРасхождение)
		
		document = Новый Структура("XML", Вложение);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(document) Тогда
		
		Возврат "";
		
	КонецЕсли;

	Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("Шифрование") Тогда
		
		РезультатЗапроса = СбисОтправитьИОбработатьКоманду(Кэш, "GenerateHTMLFromXMLClient", Новый Структура("Parameter", document), ДопПараметрыЗапроса, Отказ);
		
	Иначе
		
		РезультатЗапроса = СбисОтправитьИОбработатьКоманду(Кэш, "GenerateHTMLFromXML", Новый Структура("XML", document.XML), ДопПараметрыЗапроса,Отказ);
		
	КонецЕсли;
	
	Если		Отказ Тогда
		
		Возврат "";
		
	ИначеЕсли	ТипЗнч(РезультатЗапроса) = Тип("Структура")
			И	РезультатЗапроса.Свойство("HTML") Тогда
			
		РезультатЗапроса = РезультатЗапроса.HTML;
			
	КонецЕсли;
	
	Возврат РезультатЗапроса;
	
КонецФункции

//Проверка подписей на вложении	
&НаКлиенте
Функция ПроверитьПодписиВложения(Кэш,Вложение) Экспорт 
	Возврат Форма_ExtSDK.ПроверитьПодписиВложения(Кэш,Вложение);
КонецФункции

//Получает html по идентификаторам пакета и вложения
//Используется при просмотре документов из реестров СБИС
&НаКлиенте
функция ПолучитьHTMLВложения(Кэш,ИдДок, Вложение) Экспорт 
	Возврат Форма_ExtSDK.ПолучитьHTMLВложения(Кэш,ИдДок, Вложение);
КонецФункции

////////////////////////////////////////////////////
//////////////////Действия и операции///////////////
////////////////////////////////////////////////////

//Обрабатывает служебные документы организации	
&НаКлиенте
Функция ОбработатьСлужебныеДокументыОрганизации(Кэш, оОрганизация)
	Возврат Форма_ExtSDK.ОбработатьСлужебныеДокументыОрганизации(Кэш, оОрганизация);
КонецФункции

//Отправляет каталог товаров в СБИС	
&НаКлиенте
функция ОтправитьКаталогТоваров(Кэш,КаталогТоваров) экспорт
	Возврат Форма_ExtSDK.ОтправитьКаталогТоваров(Кэш,КаталогТоваров);
КонецФункции

&НаКлиенте
Функция сбисЭмитироватьКМ(Кэш, ИдДок, ДопПараметры=Неопределено, Отказ=Ложь) Экспорт 
	Отказ				= Ложь;
	МестныйКэш			= Кэш;
	
	param = Новый Структура("Идентификатор",ИдДок);
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	ДопПараметры.Вставить("ЕстьРезультат", Истина);
	
	Результат = СбисОтправитьИОбработатьКомандуCallSabyApi(Кэш, "СБИС.ЭмитироватьКМ", param, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".сбисЭмитироватьКМ");
	КонецЕсли;
	Возврат Результат
	
КонецФункции

//Возможные значения параметра 'ГосОперация':
//Госсистема -> Маркировка
//Операция -> ВводВОборот, Списание, ОтправитьКоды, ГотовКВводуВОборот 
//Госсистема -> Прослеживаемость
//Операция -> ПроверкаРНПТ
&НаКлиенте
Функция сбисЗарегистрироватьВГоссистеме(Кэш, ИдДок, ДопПараметры=Неопределено, Отказ=Ложь) Экспорт
	Отказ				= Ложь;
	МестныйКэш			= Кэш;  
	
	ИдентификаторДокумента = Новый Структура("Идентификатор",ИдДок);
	ГосОперация = Новый Структура("Госсистема, Операция", "Маркировка", "ВводВОборот");
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	Иначе
		Для Каждого ТекСтрока ИЗ ГосОперация Цикл
			Ключ = ТекСтрока.Ключ; 
			Если ДопПараметры.Свойство(Ключ) Тогда
				ГосОперация[Ключ] = ДопПараметры[Ключ];
				ДопПараметры.Удалить(Ключ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ДопПараметры.Вставить("ЕстьРезультат", Истина);
	
	param = Новый Массив;
	param.Добавить(ИдентификаторДокумента);
	param.Добавить(ГосОперация);
	
	Результат = СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, "СБИС.ЗарегистрироватьВГоссистеме", param, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".сбисЗарегистрироватьВГоссистеме");
	КонецЕсли;
	Возврат Результат
	
КонецФункции


//Использовать ОбщиеФункции.ПолучитьИнформациюОКонтрагенте
//Получает Информацию о контрагенте с онлайна
&НаКлиенте
Функция ПолучитьИнформациюОКонтрагенте(Кэш, СтруктураКонтрагента) Экспорт
	Отказ				= Ложь;
	МестныйКэш			= Кэш;
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат", Истина);
	
	kontr = Новый Структура; 
	Если СтруктураКонтрагента.Свойство("СвФЛ") Тогда
		kontr.Вставить( "СвФЛ", СтруктураКонтрагента.СвФЛ );	
	Иначе
		kontr.Вставить( "СвЮЛ", СтруктураКонтрагента.СвЮЛ );
	КонецЕсли;
	
	оКонтрагент = СБИС_ИнформацияОКонтрагенте(Кэш, kontr, ДопПараметрыЗапроса, Отказ);
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат оКонтрагент;
КонецФункции

//Выполняет указанное действие по документу СБИС
&НаКлиенте
Функция сбисВыполнитьДействие(Кэш, СоставПакета, Этап, Действие, Комментарий, ПредставлениеПакета) Экспорт
	Возврат Форма_ExtSDK.сбисВыполнитьДействие(Кэш, СоставПакета, Этап, Действие, Комментарий, ПредставлениеПакета);
КонецФункции

&НаКлиенте
Функция сбисПодписатьВложения(Кэш, attachmentList, ПараметрыДействия, Отказ) Экспорт 
    Перем ДовереностьПрокинуть;
	
	Если Не ПараметрыДействия.Сертификат.Свойство("Доверенность", ДовереностьПрокинуть) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Для Каждого Вложение Из attachmentList Цикл
		
		ЭЦП				= Новый Массив;	
		ЗаписьЭЦП		= Новый Структура;
		СертификатЭЦП	= Новый Структура; 
		
		СертификатЭЦП.Вставить("Доверенность", ДовереностьПрокинуть);
		ЗаписьЭЦП.Вставить("Сертификат",СертификатЭЦП);
		ЭЦП.Добавить(ЗаписьЭЦП);
		Вложение.Вставить("Подпись", ЭЦП);
		
	КонецЦикла;
	
КонецФункции

// Переводит документ повторно на ранее выполненный этап
&НаКлиенте
Функция СбисПовторитьЭтап(Кэш, ИдДок, ЭтапНазвание, Отказ=Ложь) Экспорт
	Отказ = Ложь;
	
	ПараметрыКоманды = Новый Структура("Идентификатор,Этап", ИдДок, Новый Структура("Название", ЭтапНазвание));
	ДопПараметрыЗапроса = Новый Структура("ЕстьРезультат, СообщатьПриОшибке, ВернутьОшибку", Истина, Ложь, Истина);
	
	оДокумент = СбисОтправитьИОбработатьКомандуCallSabyApi(Кэш, "СБИС.ПовторитьЭтап", ПараметрыКоманды, ДопПараметрыЗапроса,Отказ);
	Если Отказ Тогда
		Кэш.ГлавноеОкно.СбисСообщитьОбОшибке(Кэш, оДокумент);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат оДокумент;
КонецФункции

//Сохраняет вложение по ссылке со сбисДиск в указанный файл
&НаКлиенте
Функция СохранитьВложениеПоСсылкеВФайл(Кэш,Ссылка,ИмяФайла) Экспорт
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат", Истина);
	
	ПараметрыЗаписи = Новый Структура("Url, FileName", Ссылка, ИмяФайла);
	
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "LoadDataFromURLToFile", ПараметрыЗаписи, ДопПараметрыЗапроса, Отказ);
	Если Отказ Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

////////////////////////////////////////////////////
//////////////Сотрудники////////////////////////////
////////////////////////////////////////////////////

&НаКлиенте
функция СбисЗаписатьСотрудников(Кэш, ДанныеСотрудников, Отказ) Экспорт
	Возврат Форма_ExtSDK.СбисЗаписатьСотрудников(Кэш, ДанныеСотрудников, Отказ);
КонецФункции

////////////////////////////////////////////////////
//////////////Серверные настройки вызов/////////////
////////////////////////////////////////////////////

// Функция для переопределения видимости настроек для способа интеграции
// 
// Возвращаемое значение: Структура
//   - 
//
&НаКлиенте
Функция ВидимостьНастроек() Экспорт
	
	Настройки = МодульОбъектаКлиент().ВидимостьНастроекПоУмолчанию();	
	Настройки.ИспользоватьГенератор 	= Истина;
	Настройки.ВремяОжиданияОтвета		= Истина;
	
	Возврат Настройки;
	
КонецФункции

&НаКлиенте
Функция ПолучитьXslt(Кэш, ПараметрыМетода, ДопПараметрыЗапроса, Отказ) Экспорт
	
	Если Не ДопПараметрыЗапроса.Свойство("СообщатьПриОшибке") Тогда
		ДопПараметрыЗапроса.Вставить("СообщатьПриОшибке",	Ложь);
	КонецЕсли;
	
	ДопПараметрыЗапроса.Вставить("ЕстьРезультат",		Истина);
	ДопПараметрыЗапроса.Вставить("ВернутьОшибку",		Истина);
	ДопПараметрыЗапроса.Вставить("АдресРесурса",		"/int-settings/service/");
	
	ПараметрыЗапроса = Новый Структура();
	Если ТипЗнч(ПараметрыМетода) = Тип("Структура")	И ПараметрыМетода.Свойство("НазваниеXSLT") Тогда
		ПараметрыЗапроса.Вставить("mask", ПараметрыМетода.НазваниеXSLT	+ ".sbis3.xslt");
	ИначеЕсли ТипЗнч(ПараметрыМетода) = Тип("Строка") Тогда
		ПараметрыЗапроса.Вставить("mask", ПараметрыМетода				+ ".sbis3.xslt");
	Иначе
		// Оставляем пустым и получаем весь список XSLT
		ПараметрыЗапроса.Вставить("mask", "*.xslt");
	КонецЕсли;
	
	Результат = СбисОтправитьИОбработатьКомандуCallIntegrationApi(Кэш, "API301.FindXSLT", ПараметрыЗапроса, ДопПараметрыЗапроса, Отказ);
	
	Если Отказ Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Кэш.РаботаСJson.СбисПрочитатьJSON(Результат);
	Если Результат.Свойство("error") Тогда
		Отказ = Истина;
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + " (API301.FindXSLT)", 770, Результат.error.message);
	ИначеЕсли Результат.Свойство("data") Тогда
		Результат = Результат.data;
	Иначе
		// Возвращаем, как есть
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьИни(Кэш, ИмяМетода, ПараметрыМетода, ДопПараметрыЗапроса, Отказ) Экспорт
	ДопПараметрыЗапроса.Вставить("АдресРесурса",	"/int-settings/service/");
	Если Не ДопПараметрыЗапроса.Свойство("СообщатьПриОшибке") Тогда
		ДопПараметрыЗапроса.Вставить("СообщатьПриОшибке",	Ложь);
	КонецЕсли;
	Если ИмяМетода = "ReadConfig" Тогда
		СбисМетодПозвать = "IntegrationConfig." + ИмяМетода;
		Возврат СбисОтправитьИОбработатьКомандуCallIntegrationApi(Кэш, СбисМетодПозвать, ПараметрыМетода, ДопПараметрыЗапроса, Отказ);
	Иначе
		СбисМетодПозвать = "IntegrationConnection." + ИмяМетода;
		Результат = СбисОтправитьИОбработатьКомандуCallIntegrationApi(Кэш, СбисМетодПозвать, ПараметрыМетода, ДопПараметрыЗапроса, Отказ);
		Если Результат = Неопределено Тогда
			Отказ = Истина;
			Результат = Кэш.ОбщиеФункции.сбисИсключение(, СбисМетодПозвать, 756, "Подключение недоступно", 
			"Возникла ошибка на сервисе интеграции, обратитесь в техническую поддержку.");
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ЗаписатьConnection(Кэш, ПараметрыМетода, ДопПараметрыЗапроса, Отказ) Экспорт
	ДопПараметрыЗапроса.Вставить("СообщатьПриОшибке",	Ложь);
	Возврат СбисОтправитьИОбработатьКомандуCallIntegrationApi(Кэш, "IntegrationConnection.WriteConnection", ПараметрыМетода, ДопПараметрыЗапроса, Отказ)
КонецФункции

&НаКлиенте
Функция ПолучитьСписокConnection(Кэш, ПараметрыМетода, ДопПараметрыЗапроса, Отказ) Экспорт
	ДопПараметрыЗапроса.Вставить("СообщатьПриОшибке",	Ложь);
	Возврат СбисОтправитьИОбработатьКомандуCallIntegrationApi(Кэш, "IntegrationConnection.ReadConnectionList", ПараметрыМетода, ДопПараметрыЗапроса, Отказ)
КонецФункции

&НаКлиенте
Функция ПолучитьСписокConfig(Кэш, ПараметрыМетода, ДопПараметрыЗапроса, Отказ) Экспорт
	ДопПараметрыЗапроса.Вставить("СообщатьПриОшибке",	Ложь);
	Возврат СбисОтправитьИОбработатьКомандуCallIntegrationApi(Кэш, "IntegrationConfig.ReadConfigList", Новый Структура("filter,ini", ПараметрыМетода, Неопределено), ДопПараметрыЗапроса, Отказ)
КонецФункции

////////////////////////////////////////////////////
//////////////////Статистика вызов//////////////////
////////////////////////////////////////////////////

//Отправляет собщение о статистике на online
&НаКлиенте
Функция сбисОтправитьСообщениеСтатистики(Кэш, СообщениеСтатистики, Отказ) Экспорт
	ДопПараметры = Новый Структура("ВернутьОшибку", Истина);
	Возврат СбисОтправитьИОбработатьКомандуCallIntegrationApi(Кэш, "IntegrationStat.RegisterActions2",СообщениеСтатистики, ДопПараметры, Отказ);
КонецФункции

//Отправляет собщение о ошибке на online
&НаКлиенте
Функция сбисОтправитьСообщениеОшибки(Кэш, СообщениеОбОшибке, Отказ) Экспорт
	ДопПараметры = Новый Структура("СообщатьПриОшибке, ВернутьОшибку", Ложь, Истина);
	Возврат СбисОтправитьИОбработатьКомандуCallIntegrationApi(Кэш, "IntegrationStat.RegisterErrors2", СообщениеОбОшибке, ДопПараметры, Отказ);
КонецФункции

&НаКлиенте
Функция сбисПроверкаОбновления(Кэш, ИнформацияОТекущейВерсии, Отказ) Экспорт
	ДопПараметры = Новый Структура("АдресРесурса, ВернутьОшибку", "/int-settings/service/", Ложь);
	Возврат СбисОтправитьИОбработатьКомандуCallIntegrationApi(Кэш, "API3.GetProductVersionStatus", ИнформацияОТекущейВерсии, ДопПараметры, Отказ);
КонецФункции

////////////////////////////////////////////////////
//////////////////Системные команды/////////////////
////////////////////////////////////////////////////

//Добавляет СБИСПлагин в Кэш	
&НаКлиенте
Функция Включить(Кэш, ДопПараметры=Неопределено, Отказ=Ложь) Экспорт

	МестныйКэш				= Кэш;
	СведенияОбИнтеграции	= СведенияОбИнтеграции();
	ПараметрыВключения		= СведенияОбИнтеграции.Параметры;

	Если ЗначениеЗаполнено(ДопПараметры) Тогда 
		ЗаполнитьЗначенияСвойств(ПараметрыВключения, ДопПараметры);
	КонецЕсли;

	МодульОбъектаКлиент().ИзменитьПараметрSABY("СведенияОбИнтеграции",			СведенияОбИнтеграции,					"Сеанс");
	МодульОбъектаКлиент().ИзменитьПараметрSABY("Отправка_РазмерПачки",			ПараметрыВключения.КоличествоПотоков);
	МодульОбъектаКлиент().ИзменитьПараметрSABY("Потоки_МаксимальноеКоличество",	ПараметрыВключения.КоличествоПотоков);
	МодульОбъектаКлиент().ИзменитьПараметрSABY("Потоки_КоличествоСвободных",	ПараметрыВключения.КоличествоПотоков);

	СбисУстановитьПодпискиСбис3Плагина(Кэш);

	Для Каждого ПараметрИнтеграции Из ПараметрыВключения Цикл
		
		МодульОбъектаКлиент().ИзменитьПараметрSABY(ПараметрИнтеграции.Ключ, ПараметрИнтеграции.Значение);
		
	КонецЦикла;    

	РезультатЗапроса = ПолучитьМодульИнтеграции(Кэш, ПараметрыВключения, Отказ);
	Если Отказ Тогда  

		МодульОбъектаКлиент().ИзменитьПараметрSABY("ОбменВключен",	Ложь,	"Сбис");
		РезультатЗапроса = МодульОбъектаКлиент().НовыйСбисИсключение(РезультатЗапроса, "ExtSDK2.Включить");
		
	Иначе
		
		МодульОбъектаКлиент().ИзменитьПараметрSABY("ОбменВключен",	Истина, "Сбис");
		СведенияОбИнтеграции.Версия = ВерсияМодуляИнтеграции();
		
	КонецЕсли;
	
	Возврат Форма_ExtSDK.СбисОценитьРезультатВключения(Кэш, РезультатЗапроса, ДопПараметры, Отказ);
	
КонецФункции

&НаКлиенте
Функция СведенияОбИнтеграции() Экспорт
    Перем ВерсияИнтеграции;
	
	ФормаExtSDK1 = МодульОбъектаКлиент().ПолучитьФормуОбработки("ExtSDK");	
	
	СведенияОбИнтеграции = ФормаExtSDK1.СведенияОбИнтеграции();
	СведенияОбИнтеграции.Имя = "ExtSDK2";
	СведенияОбИнтеграции.Параметры.ИмяВнешнегоМодуля	= "ExtSdk2";
 	СведенияОбИнтеграции.Параметры.ИмяВнутреннегоМодуля = "ExtSDK2";// Имя для поиска функций вызова

	ТекущееИмяИнтеграция	= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
	
	Если	МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ОбменВключен")
		И	Лев(ТекущееИмяИнтеграция, СтрДлина(СведенияОбИнтеграции.Имя)) = СведенияОбИнтеграции.Имя Тогда
		
		ОшибкаЧтенияВерсии = Ложь;
		ВерсияИнтеграции = ВерсияМодуляИнтеграции(ОшибкаЧтенияВерсии);
		Если ОшибкаЧтенияВерсии Тогда
			
			ВерсияИнтеграции = Неопределено;
			
		КонецЕсли;	

	КонецЕсли;
	
	СведенияОбИнтеграции.Версия = ВерсияИнтеграции;
	
	Возврат СведенияОбИнтеграции;
	
КонецФункции

&НаКлиенте
Функция ВерсияМодуляИнтеграции(Отказ = Ложь)
	Попытка
		
		ВерсияИнтеграции = СбисОтправитьИОбработатьКоманду(	МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш(),
															"GetVersion",
															Новый Структура,
															Новый Структура("СообщатьПриОшибке", Ложь),
															Отказ);
		
	Исключение
		
		Отказ = Истина; 
		ВерсияИнтеграции = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "ExtSDK2.ВерсияМодуляИнтеграции");
		
	КонецПопытки;
	
	Возврат ВерсияИнтеграции;

	
КонецФункции

&НаКлиенте
Функция Завершить(Кэш, ДопПараметры, Отказ) Экспорт
	
	Если Не Форма_ExtSDK = Неопределено Тогда
		
		Возврат Форма_ExtSDK.ЗавершитьExtSDK(Кэш, ДопПараметры, Отказ);
		
	КонецЕсли;
	Форма_ExtSDK	= Неопределено;
	ПлагинКоннектор = Неопределено;
	
КонецФункции

&НаКлиенте
Процедура СбисУстановитьПодпискиСбис3Плагина(Кэш)
	ПараметрыПодписчиков = Новый Структура("Кэш", Кэш);
	Кэш.СБИС.ДанныеИнтеграции.Подписки.Вставить("extsdk2.async.progress", 			Новый Структура("Функция, Параметры, Модуль", "ExtSdk2AsyncProgress",	ПараметрыПодписчиков, ЭтаФорма));
	Кэш.СБИС.ДанныеИнтеграции.Подписки.Вставить("UnValidToken",  		 			Новый Структура("Функция, Параметры, Модуль", "UnValidToken",			ПараметрыПодписчиков, ЭтаФорма));
	Кэш.СБИС.ДанныеИнтеграции.Подписки.Вставить("SbisPluginClientCOM.Disconnected", Новый Структура("Функция, Параметры, Модуль", "Disconnected",			ПараметрыПодписчиков, ЭтаФорма));
	Кэш.СБИС.ДанныеИнтеграции.Подписки.Вставить("Disconnected",						Новый Структура("Функция, Параметры, Модуль", "Disconnected",			ПараметрыПодписчиков, ЭтаФорма));
	Кэш.СБИС.ДанныеИнтеграции.Подписки.Вставить("No license",						Новый Структура("Функция, Параметры, Модуль", "NoLicense",				ПараметрыПодписчиков, ЭтаФорма));
	//Кэш.СБИС.ДанныеИнтеграции.Подписки.Вставить("extsdk2.async.error",		Новый Структура("Функция, Параметры, Модуль", "ExtSdk2AsyncError",		ПараметрыПодписчиков, ЭтаФорма));
	//Кэш.СБИС.ДанныеИнтеграции.Подписки.Вставить("extsdk2.async.complete",	Новый Структура("Функция, Параметры, Модуль", "ExtSdk2AsyncComplete",	ПараметрыПодписчиков, ЭтаФорма));
КонецПроцедуры

//Функция делает GetModule выбранной интеграции, устанавливает параметры работы
&НаКлиенте
Функция ПолучитьМодульИнтеграции(Кэш, ДопПараметры, Отказ) Экспорт
	Перем ExtSDK_ID, COMОбъектИнтеграции, Т_ОбъектыИнтеграции;

	ОжиданиеОтвета			= 10;//На время включения, ответ от плагина должен приходить быстро
	НачДата					= ТекущаяДата();
	Форма_ExtSDK			= МодульОбъектаКлиент().ПолучитьФормуОбработки("ExtSDK");
	Форма_ExtSDK.МестныйКэш	= Кэш;
	
	СведенияОбИнтеграции	= МодульОбъектаКлиент().ПараметрSABY("СведенияОбИнтеграции",	"Сеанс");
	ПлагинКоннектор			= МодульОбъектаКлиент().ПараметрSABY("ПлагинКоннектор",			"Сбис");
	
	ИмяИнтеграции			= СведенияОбИнтеграции.Имя;
	ИмяМодуляПолучить		= СведенияОбИнтеграции.Параметры.ИмяВнешнегоМодуля;
	Если ИмяМодуляПолучить = Неопределено Тогда
		
		ИмяМодуляПолучить = ИмяИнтеграции;
		
	КонецЕсли;
	
	//Создаем объект транспорта, или берём существующий
	Если 	ПлагинКоннектор = Неопределено Тогда
		
		Попытка
			
			ПлагинКоннектор = Новый COMОбъект("Tensor.SbisPluginClientCOM");
			
		Исключение
			
			Отказ = Истина;
			Возврат МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "ExtSDK2.ПолучитьМодульИнтеграции", 767,, "Не зарегистрирована компонента Tensor.SbisPluginClientCOM." + ОписаниеОшибки());
			
		КонецПопытки;
		
	Иначе
		
		//Чистим все старые, накопленные сообщения
		Попытка
			
			ПлагинКоннектор.ReadAllXml2();
			
		Исключение
			
			Отказ = Истина;
			Возврат МодульОбъектаКлиент().НовыйСбисИсключение(711101, "ExtSDK2.ПолучитьМодульИнтеграции",,,
			"Требуется обновить Saby Plugin и повторить операцию");
			
		КонецПопытки;
		
	КонецЕсли;
	
	МодульОбъектаКлиент().ИзменитьПараметрSABY("ПлагинКоннектор",		ПлагинКоннектор, "Сбис");	
	МодульОбъектаКлиент().ИзменитьПараметрSABY("ВремяОжиданияОтвета",	ДопПараметры.ВремяОжиданияОтвета);
	
	//Получаем SDK	
	НачалоПодключения	= ТекущаяДата();
	РезультатЗапроса	= Форма_ExtSDK.СБИСПлагин_GetModule(Кэш, ИмяМодуляПолучить, Отказ);
	
	Если РезультатЗапроса = "Unknown module" Тогда
		
		Отказ = Истина;
		ТекстСообщения = "Модуль """ + ИмяМодуляПолучить + """ не найден в Saby.Плагин";
		Возврат МодульОбъектаКлиент().НовыйСбисИсключение(400, ИмяИнтеграции + ".ПолучитьМодульИнтеграции",,,ТекстСообщения);
	
	ИначеЕсли Отказ Тогда
		
		Если		РезультатЗапроса.code = 756 Тогда
			
			// TODO разобрать помойку с подключением
			//Попытка переподключения
			ОшибкаНаВозврат = РезультатЗапроса;
			ОшибкаПодключения = Ложь;
			СбисПлагинКомандаConnected = Форма_ExtSDK.СБИСПлагин_Команда(Кэш, "ОжиданиеСобытия",,Новый Структура("Аккаунт", Неопределено),Отказ);
			СбисПлагинКомандаConnected.Идентификатор = "SbisPluginClientCOM.Connected";
			СбисПлагинКомандаConnected.ВремяОжиданияОтвета = 0;
			РезультатКоманды = Неопределено;
			Пока	ТекущаяДата() - НачалоПодключения < ОжиданиеОтвета
				И	РезультатКоманды = Неопределено Цикл
				ОшибкаПодключения = Ложь;
				МодульОбъектаКлиент().ГлобальныйКэш_ЧтениеОтветовИВызовСобытий();
				РезультатКоманды = Форма_ExtSDK.СБИСПлагин_ПолучитьОтвет_Синхронно(Кэш, СбисПлагинКомандаConnected, Новый Структура, ОшибкаПодключения);
				Если ОшибкаПодключения Тогда
					Возврат РезультатКоманды;
				КонецЕсли;
				РезультатКоманды = Форма_ExtSDK.СБИСПлагин_GetModule(Кэш, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя, ОшибкаПодключения);
			КонецЦикла;
			Если  РезультатКоманды = Неопределено Тогда
				Возврат ОшибкаНаВозврат;
			ИначеЕсли ОшибкаПодключения Тогда
				Возврат РезультатКоманды;
			КонецЕсли;
			Отказ = Ложь;
		ИначеЕсли	РезультатЗапроса.code = 762 Тогда
			
			Возврат РезультатЗапроса;
			
		ИначеЕсли	РезультатЗапроса.code = 775 Тогда
			
			РезультатЗапроса.details = РезультатЗапроса.details + " Возможно Saby плагин не запущен.";
			Возврат РезультатЗапроса;
			
		Иначе
			
			Возврат РезультатЗапроса;
			
		КонецЕсли;
		
	Иначе
		
		Возврат РезультатЗапроса;
		
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////
/////////////Асинхронные События////////////////////
////////////////////////////////////////////////////

//Обработка события прогресса отправки пакета
&НаКлиенте
Процедура ExtSdk2AsyncProgress(РезультатВызова, ПараметрыОбработки) Экспорт
	//Тут происходит ничего
КонецПроцедуры

&НаКлиенте
Процедура UnValidToken(РезультатВызова, ПараметрыОбработки) Экспорт
	МодульОбъектаКлиент = МодульОбъектаКлиент();
	Кэш = МодульОбъектаКлиент.ПолучитьТекущийЛокальныйКэш();
	Если МодульОбъектаКлиент.ПолучитьЗначениеПараметраСБИС("Авторизован") Тогда
		
		МодульОбъектаКлиент.ИзменитьПараметрСБИС("Авторизован", Ложь);
		ОбработчикПродолжить = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("сбисПослеАвторизации", Кэш.ГлавноеОкно, Новый Структура);
		
		ДопПараметрыАвторизовать = Новый ФиксированнаяСтруктура("ПоказатьИнтерфейс, ОбработчикПродолжить", Истина, ОбработчикПродолжить);
		МодульОбъектаКлиент().АвторизоватьсяВSABY(, ДопПараметрыАвторизовать);

	КонецЕсли;
КонецПроцедуры

//Обработка успешной отправки пакета
&НаКлиенте
Процедура WriteDocumentEx_Message(РезультатВызова, ПараметрыОбработки) Экспорт

	WriteDocumentEx_ОбработатьВременныеФайлы(РезультатВызова, ПараметрыОбработки);
	Форма_ExtSdk.WriteDocumentEx_Message(РезультатВызова.Данные, ПараметрыОбработки);
	
КонецПроцедуры

//Обработка ошибки отправки
&НаКлиенте
Процедура WriteDocumentEx_Error(РезультатВызова, ПараметрыОбработки) Экспорт
	
	WriteDocumentEx_ОбработатьВременныеФайлы(РезультатВызова, ПараметрыОбработки);
	Форма_ExtSdk.WriteDocumentEx_Error(РезультатВызова.Данные, ПараметрыОбработки);
	
КонецПроцедуры

//Вспомогательная функция, чисто под способ обмена.
&НаКлиенте
Процедура WriteDocumentEx_ОбработатьВременныеФайлы(РезультатВызова, ПараметрыОбработки)
	
	Попытка 
		
		ВложенияОбработаны = ПараметрыОбработки.Команда.АргументВызова.Вложение;
		Для Каждого ВложениеПакета Из ВложенияОбработаны Цикл
			
			КлючВременногоФайла = ВложениеПакета;
			Если	Не КлючВременногоФайла.Свойство("Файл",			КлючВременногоФайла)
				Или Не КлючВременногоФайла.Свойство("ПутьКФайлу",	КлючВременногоФайла) Тогда
				Продолжить;
			КонецЕсли;
			МодульОбъектаКлиент().ОсвободитьВременныйФайл(КлючВременногоФайла);
			
		КонецЦикла;
		
	Исключение
		
		Возврат;
		
	КонецПопытки;
	
КонецПроцедуры

// Обработка события разрыва соединения с плагином
&НаКлиенте
Процедура Disconnected(РезультатВызова, ПараметрыОбработки) Экспорт 
	
	МодульОбъектаКлиент = МодульОбъектаКлиент();
	Если МодульОбъектаКлиент.ПолучитьЗначениеПараметраСБИС("ОбменВключен") Тогда
		
		АргументДляДействия = Новый Структура;
		АргументДляДействия.Вставить("ИдентификаторСессии", МодульОбъектаКлиент.ПолучитьПараметрПользователя("ИдентификаторСессии"));
		
		ПараметрыФормыОткрыть	= Новый Структура("РежимЗапуска, ПараметрыУстановить", "НастройкиСоединения", АргументДляДействия);
		ДопПараметрыОткрыть		= Новый Структура("Отложенно", Истина);
		
		фрм = МодульОбъектаКлиент.ПолучитьФормуОбработки("ФормаНастройки");
		фрм.ПоказатьПоверх(ПараметрыФормыОткрыть, ДопПараметрыОткрыть);
		
		МодульОбъектаКлиент.СообщитьСбисИсключение(РезультатВызова.Данные, Новый Структура("Отложенно", Истина));

	КонецЕсли;
	
	// Потеряно соединение с плагином, требуется переполучить COM объект.
	Завершить(МодульОбъектаКлиент.ПолучитьТекущийЛокальныйКэш(), Новый Структура("Ошибка", РезультатВызова.Данные), Ложь);
	
КонецПроцедуры    

// Обработка события отсутствия лицензии
&НаКлиенте
Процедура NoLicense(РезультатВызова, ПараметрыОбработки) Экспорт 
	
	МодульОбъектаКлиент = МодульОбъектаКлиент();
	ГлавноеОкно = МодульОбъектаКлиент.ПолучитьФормуОбработки("ФормаГлавноеОкно");
	
	СбисИсключение = РезультатВызова.Данные;
	
	ПараметрыДействия = Новый Структура();														
	ПользовательскиеДействия = МодульОбъектаКлиент.СбисИсключение_ПользовательскиеДействия(СбисИсключение, ПараметрыДействия);
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ИсключениеСбис", СбисИсключение);
	ПараметрыОткрытияФормы.Вставить("ПользовательскиеДействия", ПользовательскиеДействия);
	
	СвойстваФормы = Новый Структура("Владелец", ГлавноеОкно);
	ФормаДействия = МодульОбъектаКлиент.ПолучитьФормуОбработки("ФормаОграниченийПоЛицензии",
																СвойстваФормы);
	ФормаДействия.ПоказатьПоверх(ПараметрыОткрытияФормы);
	
КонецПроцедуры    


////////////////////////////////////////////////////
/////////////////////СБИСПлагин/////////////////////
////////////////////////////////////////////////////

//////// Отправка ////////////////

//Отправляет сформированные пакеты документов	
&НаКлиенте
Функция ОтправитьПакетыДокументов(Кэш, МассивПакетов, РезультатОтправки=Неопределено) Экспорт
	Возврат Форма_ExtSDK.ОтправитьПакетыДокументов(Кэш, МассивПакетов, РезультатОтправки);
КонецФункции

//Точка входа завершения отправки
&НаКлиенте
Процедура СбисПолучитьОтветыПоОтправке(Кэш) Экспорт
	Форма_ExtSDK.СбисПолучитьОтветыПоОтправке(Кэш);
КонецПроцедуры

&НаКлиенте
Функция Отправка_ПодготовитьСтруктуруПакета(Кэш, ПараметрыПодготовки, ДопПараметры, Отказ) Экспорт
	Возврат Форма_ExtSDK.Отправка_ПодготовитьСтруктуруПакета(Кэш, ПараметрыПодготовки, ДопПараметры, Отказ);
КонецФункции

//Готовит пакет к отправке, формиует события-обработчики, делает вызов
//ПараметрыОтправки - СоставПакета, ДокументОтправить
&НаКлиенте
Процедура Отправка_Вызов(Кэш, ПараметрыОтправки, ДопПараметры) Экспорт

	Форма_ExtSDK = Форма_ExtSDK;
	
	ПараметрыВыполнить		= Новый Структура("СоставПакета, СтатусПакета, Отказ, Ошибки, ДокументОтправить", ПараметрыОтправки.СоставПакета, ПараметрыОтправки.СтатусПакета, Ложь, Новый Массив);
	ДопПараметрыДляВызовов	= Новый Структура("Кэш, ДополнительныеПараметры", Кэш, ДопПараметры);
	
	ФункцияОбработкиОшибки	= "WriteDocumentEx_FatalError";
	СобытияКоманды			= Новый Структура;
	СобытияКоманды.Вставить("Error",			Новый Структура("Функция, ФункцияОшибки, Модуль, МодульОшибки",	"WriteDocumentEx_Error", 		ФункцияОбработкиОшибки,	ЭтаФорма, Форма_ExtSDK));
	СобытияКоманды.Вставить("Message",			Новый Структура("Функция, ФункцияОшибки, Модуль, МодульОшибки",	"WriteDocumentEx_Message",		ФункцияОбработкиОшибки,	ЭтаФорма, Форма_ExtSDK));
	СобытияКоманды.Вставить("BeforeCall",		Новый Структура("Функция, ФункцияОшибки, Модуль",				"WriteDocumentEx_Before_Call",	ФункцияОбработкиОшибки,	Форма_ExtSDK));
	СобытияКоманды.Вставить("AfterCall",		Новый Структура("Функция, ФункцияОшибки, Модуль",				"WriteDocumentEx_After_Call",	ФункцияОбработкиОшибки,	Форма_ExtSDK));

	Попытка
		ОбработчикКоманды		= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("СбисОтправитьКоманду_Асинхронно", Форма_ExtSDK, ДопПараметрыДляВызовов);
		ДопПараметрыКоманды		= Новый Структура("ПодпискиНаСобытия, ВремяОжиданияОтвета", СобытияКоманды, МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ВремяОжиданияОтвета_Отправка"));
		АсинхроннаяСбисКоманда	= МодульОбъектаКлиент().НовыйАсинхроннаяСбисКоманда(ОбработчикКоманды, ДопПараметрыКоманды);
	Исключение
		ОшибкаКоманды = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "ExtSDK.НовыйАсинхроннаяСбисКоманда");
		//Упал метод генерации queryID, прерываем отправку.
		Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, ОшибкаКоманды);
		Кэш.РезультатОтправки.Вставить("ПрерватьОтправку", ОшибкаКоманды.details);
		Возврат
	КонецПопытки;
	АсинхроннаяСбисКоманда.ПараметрыСобытий = Новый Структура("Кэш, СоставПакета, Команда", Кэш, ПараметрыОтправки.СоставПакета, АсинхроннаяСбисКоманда);
	
	Если Не ПараметрыОтправки.Свойство("ДокументОтправить", ПараметрыВыполнить.ДокументОтправить) Тогда
		//Переадресация на форму интеграции для КриптоExtSDK
		Отказ		= Ложь;
		Результат	= Кэш.Интеграция.Отправка_ПодготовитьСтруктуруПакета(Кэш, ПараметрыВыполнить, Новый Структура, Отказ);
		Если Результат.Отказ Тогда
			СбисИсключение		= МодульОбъектаКлиент().НовыйСбисИсключение(Результат.Ошибки[0], Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".Отправка_Вызов");
			СобытиеОшибки		= МодульОбъектаКлиент().НовыйАсинхронноеСбисСобытие(АсинхроннаяСБИСКоманда, СбисИсключение, "Error");
			МодульОбъектаКлиент().АсинхроннаяСбисКоманда_ВызватьСобытие(АсинхроннаяСбисКоманда, СобытиеОшибки);
			Возврат;
		КонецЕсли;
		//Счетчик по обработанным документам
		Кэш.РезультатОтправки.ПорНомер = Кэш.РезультатОтправки.ПорНомер + 1;
	КонецЕсли;
	Если ПараметрыВыполнить.СтатусПакета = "Готов" Тогда
		
		АсинхроннаяСбисКоманда.АргументВызова = Новый Структура("Метод, ПараметрыМетода", "WriteDocumentEx", Новый Структура("Document", ПараметрыВыполнить.ДокументОтправить));
		Попытка
			МодульОбъектаКлиент().АсинхроннаяСбисКоманда_Выполнить(АсинхроннаяСбисКоманда);
			ПараметрыОтправки.СтатусПакета = "Отправлен";
		Исключение
			СбисИсключение		= МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".Отправка_Вызов");
			СобытиеОшибки		= МодульОбъектаКлиент().НовыйАсинхронноеСбисСобытие(АсинхроннаяСБИСКоманда, СбисИсключение, "Error");
			МодульОбъектаКлиент().АсинхроннаяСбисКоманда_ВызватьСобытие(АсинхроннаяСбисКоманда, СобытиеОшибки);
		КонецПопытки;

	Иначе
		//Добавим пакет в очередь, пока не будет проставлена пометка Готов
		Кэш.РезультатОтправки.ПодготовленныеКОтправке.Вставить(ПараметрыВыполнить.СоставПакета.Идентификатор, ПараметрыВыполнить);
	КонецЕсли;
	
КонецПроцедуры

////////////Обертки///////////////

&НаКлиенте
Функция СБИСПлагин_ЗаписатьСотрудника(Кэш, param, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКомандуCallSabyApi(Кэш, "СБИС.ЗаписатьСотрудника", param, ДопПараметры,Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_ЗаписатьСотрудника");
	КонецЕсли;
	Возврат Результат
КонецФункции

&НаКлиенте
Функция СБИСПлагин_ИмпортНоменклатурыИзCML(Кэш, param, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКомандуCallSabyApi(Кэш, "СБИС.ИмпортНоменклатурыИзCML", param, ДопПараметры, Отказ); 
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_ИмпортНоменклатурыИзCML");
	КонецЕсли;
	Возврат Результат
КонецФункции

&НаКлиенте
Функция СБИСПлагин_ИнформацияОСлужебныхЭтапах(Кэш, param, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКомандуCallSabyApi(Кэш, "СБИС.ИнформацияОСлужебныхЭтапах", param, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_ИнформацияОСлужебныхЭтапах");
	КонецЕсли;
	Возврат Результат
КонецФункции	
	
&НаКлиенте
Функция СБИСПлагин_ОбработкаСлужебныхЭтапов(Кэш, param, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "ProcessServiceStagesEx", Новый Структура("Filter", param), ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_ОбработкаСлужебныхЭтапов");
	КонецЕсли;
	Возврат Результат
КонецФункции

//Обработка внешнего файла в FileLoader. Вызов делается в ExtSDK2
&НаКлиенте
Процедура СБИСПлагин_ОбработатьВнешнийФайл(Кэш, ДанныеФайла, ПараметрыПодготовки) Экспорт

	ИмяФайлаОбработать = ДанныеФайла.Вложение.ПолноеИмяФайла;
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("Шифрование") Тогда
		
		ДанныеФайла.Файл.Вставить("ДвоичныеДанные", МодульОбъектаКлиент().ПолучитьBASE64ПоИмениФайлаКлиент(ИмяФайлаОбработать));
		
	Иначе
		
		ДанныеФайла.Файл.Вставить("ПутьКФайлу", ИмяФайлаОбработать); 
		
	КонецЕсли;
КонецПроцедуры

//Обработка XML файла при отправке. 
//ДанныеФайла - параметры обрабатываемого файла. Файл - структура в списке вложений. Вложение - обрабатываемое вложение состава пакета
//ПараметрыПодготовки - параметры обрабатываемого пакета документов.
&НаКлиенте
Процедура СБИСПлагин_ОбработатьXMLФайл(Кэш, ДанныеФайла, ПараметрыПодготовки) Экспорт
	
	ВременныйПутьФайлаДокумента = Кэш.ОбщиеФункции.СбисПолучитьИмяВременногоФайлаКлиент();
	ВременныйФайлТекст = Новый ЗаписьТекста(ВременныйПутьФайлаДокумента, 
		МодульОбъектаКлиент().ОпределитьКодировкуФайлаXML(ДанныеФайла.Вложение.XMLДокумента));
	ВременныйФайлТекст.Записать(ДанныеФайла.Вложение.XMLДокумента);
	ВременныйФайлТекст.Закрыть();
	ДанныеФайла.Файл.Вставить("ПутьКФайлу", ВременныйПутьФайлаДокумента);
	
КонецПроцедуры

&НаКлиенте
Функция СБИСПлагин_СписокДокументов(Кэш, filter, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКомандуCallSabyApi(Кэш, "СБИС.СписокДокументов", filter, ДопПараметры, Отказ);
	Если Отказ Тогда
		Результат = Кэш.ОбщиеФункции.СбисИсключение(Результат, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".ReadDocuments");
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СБИСПлагин_СписокИзменений(Кэш, filter, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКомандуCallSabyApi(Кэш, "СБИС.СписокИзменений", filter, ДопПараметры, Отказ);
	Если Отказ Тогда
		Результат = Кэш.ОбщиеФункции.СбисИсключение(Результат, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".ReadDocuments");
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СБИСПлагин_СписокНашихОрганизаций(Кэш, filter, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКомандуCallSabyApi(Кэш, "СБИС.СписокНашихОрганизаций", filter, ДопПараметры, Отказ);
	Если Отказ Тогда
		Результат = Кэш.ОбщиеФункции.СбисИсключение(Результат, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".ReadOurOrganizations");
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СБИС_СписокДокументов(Кэш, filter, ДопПараметры, Отказ) Экспорт
 	
	Возврат Форма_ExtSDK.СБИС_СписокДокументов(Кэш, filter, ДопПараметры, Отказ);
	
КонецФункции

&НаКлиенте
Функция СБИС_СписокДокументовПоСобытиям(Кэш, filter, ДопПараметры, Отказ) Экспорт
	
	Результат = СбисОтправитьИОбработатьКомандуCallSabyApi(Кэш, "СБИС.СписокДокументовПоСобытиям", filter, ДопПараметры, Отказ);
	Если Отказ Тогда
		Результат = Кэш.ОбщиеФункции.СбисИсключение(Результат, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_СписокДокументовПоСобытиям");
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

//Проверяет активна ли текущая сессия
&НаКлиенте
Функция СБИС_ПроверитьСессию(ПараметрыСессииПроверить, ДопПараметры = Неопределено) Экспорт
	
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат, СообщатьПриОшибке", Истина, Ложь);
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	
	РезультатЗапроса = СбисОтправитьИОбработатьКомандуCallSabyApi(Кэш, "СБИС.ПроверитьСессию", Новый Структура, ДопПараметрыЗапроса,Отказ);
	
	Если Отказ Тогда
		
		Возврат Ложь;
		//ОшибкаПроверитьСессию = НовыйСбисИсключение(РезультатЗапроса, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_ПроверитьСессию");
		//ВызватьИсключение СбисИсключение_ВСтроку(ОшибкаПроверитьСессию);
		
	КонецЕсли;
	
	Возврат	РезультатЗапроса.СессияАктивна = "Да"

КонецФункции

#Область include_core2_vo2_СпособыОбмена_ExtSDK_2_ВнешниеОбертки
#КонецОбласти

////////////////////////////////////////////////////
///////////////////Прочие функции///////////////////
////////////////////////////////////////////////////

// Заглушка (SDK)
&НаКлиенте
Функция ВключитьОтладку(Кэш, КаталогОтладки) Экспорт
КонецФункции

// Заглушка (SDK)
&НаКлиенте
Функция ОтключитьОтладку(Кэш) Экспорт
КонецФункции

//Получает данные файла вложения	
&НаКлиенте
функция ПолучитьДанныеФайла(Кэш,Ссылка) экспорт
	Возврат Форма_ExtSDK.ПолучитьДанныеФайла(Кэш,Ссылка);
КонецФункции

//Получает данные файла вложения	
&НаКлиенте
функция ПолучитьДанныеЗашифрованногоФайла(Кэш,Ссылка) экспорт
	Возврат Форма_ExtSDK.ПолучитьДанныеЗашифрованногоФайла(Кэш,Ссылка);
КонецФункции

//Получает данные файла вложения	
&НаКлиенте
функция СбисПолучитьФайл(Кэш,Ссылка) экспорт
	Возврат Форма_ExtSDK.сбисПолучитьФайл(Кэш,Ссылка);
КонецФункции

&НаКлиенте
функция СБИСЗаписатьВложения(Кэш,СоставПакета, Вложение) экспорт
	Возврат Форма_ExtSDK.СБИСЗаписатьВложения(Кэш, СоставПакета, Вложение);
КонецФункции

//Выполняет указанную команду по документу СБИС (утверждение/отклонение)	
&НаКлиенте
Функция СбисВыполнитьКоманду(Кэш, Идентификатор,ИмяКоманды, ПредставлениеПакета) Экспорт
	Возврат Форма_ExtSDK.сбисВыполнитьКоманду(Кэш, Идентификатор,ИмяКоманды, ПредставлениеПакета)
КонецФункции

//Получает список организаций с необработанными этапами и запускает для них обработку служебных документов
&НаКлиенте
Функция ОбработкаСлужебныхДокументов(Кэш) Экспорт
	Возврат Форма_ExtSDK.ОбработкаСлужебныхДокументов(Кэш);
КонецФункции

//Получает текущую дату в миллисекундах с начала 1970г
&НаКлиенте
функция сбисТекущаяДатаМСек(Кэш) Экспорт
	Возврат Форма_ExtSDK.сбисТекущаяДатаМСек(Кэш);	
КонецФункции

//Если более часа не проверяли статусы, то выводим красное предупреждение	
&НаКлиенте
Процедура УстановитьВидимостьОбновитьСтатусы(Кэш) Экспорт
	Форма_ExtSDK.УстановитьВидимостьОбновитьСтатусы(Кэш);
КонецПроцедуры

//Получает Информацию о подписанте документа
&НаКлиенте
Функция сбисПодписант(Кэш, ИНН) Экспорт 
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("Шифрование") Тогда
		
		СписокСертификатов = ПолучитьСписокСертификатов(Кэш, Новый Структура("ИНН",ИНН));
		
		Если СписокСертификатов.Количество() Тогда
			
			Возврат СписокСертификатов[0].Значение;
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат Форма_ExtSDK.сбисПодписант(Кэш, ИНН);
	
КонецФункции

//Получает Информацию о контрагенте с онлайна
&НаКлиенте
Функция сбисИдентификаторУчастника(Кэш, ИНН, КПП, Название) Экспорт
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("Шифрование") Тогда

		// Получает Информацию о контрагенте с онлайна
		Участник = Новый Структура;
		Если СтрДлина(СокрЛП(Инн)) = 12 Тогда
			
			СвФЛ = Новый Структура;
			Участник.Вставить("СвФЛ",СвФЛ);
			Участник.СвФЛ.Вставить("ИНН",Инн);
			ФИОСтруктура = Кэш.ОбщиеФункции.сбисПолучитьФИОИзНазвания(Название);
			Участник.СвФЛ.Вставить("Фамилия",ФИОСтруктура.Фамилия);
			Участник.СвФЛ.Вставить("Имя",ФИОСтруктура.Имя);
			Участник.СвФЛ.Вставить("Отчество",ФИОСтруктура.Отчество);
		Иначе
			СвЮЛ = Новый Структура;
			Участник.Вставить("СвЮЛ",СвЮЛ);
			Участник.СвЮЛ.Вставить("ИНН",ИНН);
			Участник.СвЮЛ.Вставить("КПП",КПП);
			Участник.СвЮЛ.Вставить("Название",Название);
		КонецЕсли;
		
		оКонтрагент = ПолучитьИнформациюОКонтрагенте(Кэш, Участник);
		
		Если оКонтрагент <> Неопределено И оКонтрагент <> Ложь Тогда
			
			Возврат оКонтрагент.Идентификатор;
			
		КонецЕсли;
		
		Возврат "";
		
	КонецЕсли;
		
	Возврат Форма_ExtSDK.сбисИдентификаторУчастника(Кэш, ИНН, КПП, Название);
	
КонецФункции

//Выполняет указанный метод и возвращает результат, либо генерирует и сообщает ошибку.
//Дополнительные параметры - структура, для управления выводом и возвратом результата в случае ошибок. 
//	Возможные значения: СообщатьПриОшибке(Истина),ВернутьОшибку(Ложь),ЕстьРезультат(Ложь), ЖдатьОтвета(Истина). 
//	Так же в качестве дополнительного параметра может быть передана структура Поток и Идентификатор для выполнения запроса.
//Отказ - булево, определяет наличие ошибок в процессе выполнения метода и что вернулось в качестве результата. Если Истина, то структура ошибки с полями "code, message, details"
&НаКлиенте
Функция СбисОтправитьИОбработатьКоманду(Кэш, Метод, ПараметрыМетода=Неопределено, ДопПараметры,Отказ) Экспорт
	Возврат Форма_ExtSDK.СбисОтправитьИОбработатьКоманду(Кэш, Метод, ПараметрыМетода, ДопПараметры,Отказ);
КонецФункции

&НаКлиенте
Функция СбисОтправитьИОбработатьКомандуCallIntegrationApi(Кэш, Метод, ПараметрыМетода=Неопределено, ДопПараметры,Отказ) Экспорт
	ПараметрыCallIntegrationApi = Новый Массив;
	Если Не ПараметрыМетода = Неопределено Тогда
		Для Каждого КлючИЗначение Из ПараметрыМетода Цикл
			ПараметрыCallIntegrationApi.Добавить(КлючИЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("Method", Метод);
	ПараметрыВызова.Вставить("Params", Новый Структура("param", ПараметрыCallIntegrationApi));
	Возврат Форма_ExtSDK.СбисОтправитьИОбработатьКоманду(Кэш, "CallIntegrationApi", ПараметрыВызова, ДопПараметры,Отказ);
КонецФункции  

&НаКлиенте
Функция СбисОтправитьИОбработатьКомандуCallSabyApi(Кэш, Метод, ПараметрыМетода=Неопределено, ДопПараметры,Отказ) Экспорт
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("Method", Метод);
	ПараметрыВызова.Вставить("Params", ПараметрыМетода);
	Возврат Форма_ExtSDK.СбисОтправитьИОбработатьКоманду(Кэш, "CallSabyApi", ПараметрыВызова, ДопПараметры,Отказ);
КонецФункции

&НаКлиенте
Функция СбисОтправитьИОбработатьКомандуCallSabyApi2(Кэш, Метод, ПараметрыМетода=Неопределено, ДопПараметры,Отказ) Экспорт
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("Method", Метод);
	ПараметрыВызова.Вставить("Params", ПараметрыМетода);
	Возврат Форма_ExtSDK.СбисОтправитьИОбработатьКоманду(Кэш, "CallSabyApi2", ПараметрыВызова, ДопПараметры,Отказ);
КонецФункции

&НаКлиенте
Функция ОбновитьЗаписьСопоставления(Кэш, Фильтр, Данные, Отказ) Экспорт
	ДопПараметрыВызова = Новый Структура("ЕстьРезультат,АдресРесурса,РежимКонвертации", Истина, "/int-settings/service/", "Стандарт");
	Результат = СбисОтправитьИОбработатьКомандуCallIntegrationApi(Кэш, "MappingObject.FindAndUpdate", Новый Структура("Filter,Data", Фильтр, Данные), ДопПараметрыВызова, Отказ);
	Если Отказ Тогда
		Результат = Кэш.ОбщиеФункции.сбисИсключение(Результат, "API.РассчитатьОбъектыНаЗапись");
	КонецЕсли;
	Возврат Результат;
КонецФункции

#Область include_core2_vo2_СпособыОбмена_ExtSDK_2_ВнешниеОбертки_АсинхронныеОперации
#КонецОбласти
