
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

// Добавляет СБИСПлагин в Кэш
&НаКлиенте
Функция Включить(Кэш, ДопПараметры = Неопределено, Отказ = Ложь) Экспорт
	
	ФормаExtSDK = МодульОбъектаКлиент().МодульИнтеграцииСБИС("ExtSDK2");
	Результат	= ФормаExtSDK.Включить(Кэш, ДопПараметры, Отказ);
	
	Если Отказ Тогда
		
		Возврат Результат;
		
	КонецЕсли;

	СведенияОбИнтеграции = СведенияОбИнтеграции();
	Для Каждого ПараметрИнтеграции Из СведенияОбИнтеграции.Параметры Цикл
		
		МодульОбъектаКлиент().ИзменитьПараметрСбис(ПараметрИнтеграции.Ключ, ПараметрИнтеграции.Значение);
		
	КонецЦикла;
	
	МодульОбъектаКлиент().ИзменитьПараметрСбис("Интеграция",	ФормаExtSDK);

	ФормаExtSDK.ПолучитьНастройкиПлагина(Кэш, Новый Структура(), Ложь);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СведенияОбИнтеграции() Экспорт

	ФормаExtSDK = МодульОбъектаКлиент().МодульИнтеграцииСБИС("ExtSDK2");
	
	СведенияОбИнтеграции = ФормаExtSDK.СведенияОбИнтеграции();
	
	СведенияОбИнтеграции.Имя					= СведенияОбИнтеграции.Имя + "(Шифрование)";
	СведенияОбИнтеграции.Параметры.ГенераторФЭД = Ложь;
	СведенияОбИнтеграции.Параметры.Шифрование	= Истина;

	Возврат СведенияОбИнтеграции;
	
КонецФункции

// Функция для переопределения видимости настроек для способа интеграции
// 
// Возвращаемое значение: Структура
//   - 
//
&НаКлиенте
Функция ВидимостьНастроек() Экспорт
	
	Настройки = МодульОбъектаКлиент().ВидимостьНастроекПоУмолчанию();	
	Настройки.ВремяОжиданияОтвета = Истина;
	
	Возврат Настройки;
	
КонецФункции
