
&НаКлиенте
Перем МестныйКэш Экспорт;
&НаКлиенте
Перем ЕстьИзменения Экспорт;
&НаКлиенте
Перем ПоследнееИзменение Экспорт;

#Область include_local_ВебКлиент
#КонецОбласти

#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

// функции для совместимости кода 
&НаКлиенте
Функция сбисПолучитьФорму(СбисИмяФормы)
	Возврат ВладелецФормы.сбисПолучитьФорму(СбисИмяФормы);
КонецФункции
&НаКлиенте
Функция сбисЭлементФормы(Форма,ИмяЭлемента)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Форма.Элементы.Найти(ИмяЭлемента);
	КонецЕсли;
	Возврат Форма.ЭлементыФормы.Найти(ИмяЭлемента);
КонецФункции
&НаКлиенте
Процедура сбисПоказатьСостояние(ТекстСостояния, Форма = Неопределено, Индикатор = Неопределено, Пояснение = "")
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Состояние(ТекстСостояния,Индикатор,Пояснение);
	Иначе
		Форма.ЭлементыФормы.ПанельОжидания.Видимость = Истина;
		Форма.НадписьОжидания = Символы.ПС + ТекстСостояния;
		Форма.НадписьПояснение = Пояснение;
		Если Индикатор<>Неопределено Тогда
			Форма.ЭлементыФормы.Индикатор.Видимость = Истина;
			Форма.ЭлементыФормы.Индикатор.Значение = Индикатор;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
&НаКлиенте
Процедура сбисСпрятатьСостояние(Форма = Неопределено)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
	Иначе
		Форма.ЭлементыФормы.ПанельОжидания.Видимость = Ложь;
		Форма.ЭлементыФормы.Индикатор.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры
//------------------------------------------------------

// Заглушка (SDK)
&НаКлиенте
Функция ВключитьОтладку(Кэш, КаталогОтладки) Экспорт
КонецФункции
// Заглушка (SDK)
&НаКлиенте
Функция ОтключитьОтладку(Кэш) Экспорт
КонецФункции
//// v8unpack &НаКлиенте
//Функция	УстановитьСоответствиеЭлементовДанных(Карта)
//	
//	//Результат.s
//	//оДокумент
//	СтруктураДанных	= Новый	Структура(	"Дата, 			ИдСБИС, 	Контрагент, НашаОрганизация",
//										"doc_datetime", "doc_id",	);
//	
//КонецФункции
&НаКлиенте
функция ПолучитьДанныеФайла(Кэш,Ссылка) экспорт
	// Получает данные файла вложения	
	ИмяФайла = сбисПолучитьФайл(Кэш,Ссылка);
	
	Если ИмяФайла = Ложь Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстДок = Новый ЧтениеТекста(ИмяФайла);
	СтрокаТекст = СтрЗаменить(НРег(ТекстДок.ПрочитатьСтроку()),"'","""");
	СтрокаКодировка = МодульОбъектаКлиент().ОпределитьКодировкуФайлаXML(СтрокаТекст);
	ТекстДок.Открыть(ИмяФайла,СтрокаКодировка);
	РезультатТекст = ТекстДок.Прочитать();
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
	КонецПопытки;
	
	Если	РезультатТекст = Неопределено
		Или	Лев(РезультатТекст,4)="%PDF" Тогда// для PDF-файла иногда возвращается крокозябра, которая потом вызывает ошибку передачи данных между клиентом и сервером, несмотря на то, что это строка
		РезультатТекст = "";
	КонецЕсли;
	
	Возврат РезультатТекст;
КонецФункции
&НаКлиенте
функция ПолучитьДанныеЗашифрованногоФайла(Кэш,Ссылка) экспорт
	// Получает данные файла вложения	
	ИмяФайла = сбисПолучитьФайл(Кэш,Ссылка);
	
	Если ИмяФайла = Ложь Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РезультатТекст = РасшифроватьДанныеФайла(Кэш,ИмяФайла);
	
	Возврат РезультатТекст;
КонецФункции
&НаКлиенте
функция сбисПолучитьФайл(Кэш,Ссылка) экспорт
	// Получает данные файла вложения	
	ИмяФайла = Кэш.ОбщиеФункции.СбисПолучитьИмяВременногоФайлаКлиент();
	РезультатЗаписи = Кэш.Интеграция.СохранитьВложениеПоСсылкеВФайл(Кэш,Ссылка,ИмяФайла);
	Если РезультатЗаписи = Ложь Тогда
		Возврат РезультатЗаписи;
	КонецЕсли;
	
	Возврат ИмяФайла;
КонецФункции
&НаКлиенте
функция ПолучитьПараметрыШтампа(Вложение) Экспорт//au
	Подпись = Неопределено;
	Событие = Неопределено;
	Результат = Неопределено;
	
	Если Не	Вложение.Свойство("Событие",Событие) Тогда
		Возврат Результат;
	КонецЕсли;
	Вложение.Свойство("Подпись",Подпись);
	
	//Есть события, значит заполним дополнительные данные для штампа подписи.
	//Сперва отсортируем по дате для корректного вывода подписей
	СписокСобытия = Новый СписокЗначений;
	СписокСобытия.ЗагрузитьЗначения(Событие);
	Для Каждого ЭлементСписка Из СписокСобытия Цикл
		ЭлементСписка.Представление = ЭлементСписка.Значение.ДатаВремя;
	КонецЦикла;
	СписокСобытия.СортироватьПоПредставлению();
	Событие = СписокСобытия.ВыгрузитьЗначения();
	
	Результат = Новый Массив;
	СтруктураПоиска = Новый Структура("Название", Вложение.Название);
	Для Каждого ЭлементСобытие Из Событие Цикл
		//Смотрим в событиях наше вложение и если есть, то выбираем подпись и дату.
		Если Не ЭлементСобытие.Свойство("Вложение") Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ЭлементВложение	Из ЭлементСобытие.Вложение Цикл
			Найден = Истина;
			Для Каждого Отбор Из СтруктураПоиска Цикл
				Если ЭлементВложение[Отбор.Ключ] = Отбор.Значение Тогда
					Продолжить;
				КонецЕсли;
				Найден = Ложь;
				Прервать;
			КонецЦикла;
			Если Не Найден Тогда
				Продолжить;
			КонецЕсли;
			ВложениеПодписи = Неопределено;
			Если Не ЭлементВложение.Свойство("Подпись", ВложениеПодписи) Тогда
				Продолжить;
			КонецЕсли;
			//Чтобы исключить возможность попадания сертификатов, не относящихся к вложению, проверяем, что подпись события есть в подписях вложения.
			Для Каждого ПодписьСобытия Из ВложениеПодписи Цикл
				Найден = Ложь;
				Если Подпись = Неопределено Тогда
					Найден = Истина;//Подписи не переданы, значит возьмем первый сертификат из списка
				Иначе	
					Для Каждого ПодписьВложения Из Подпись Цикл 
						Если ПодписьСобытия.Сертификат.СерийныйНомер = ПодписьВложения.Сертификат.СерийныйНомер Тогда
							Найден = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				Если Не Найден Тогда
					Продолжить;
				КонецЕсли;
				СтрокаРезультат = Новый Структура("Сертификат, Переход, ДатаВремя",ПодписьСобытия.Сертификат,ПодписьСобытия.Направление,"");
				//Переставляем названия для штампа
				СтрокаРезультат.ДатаВремя = ?(ЗначениеЗаполнено(ЭлементСобытие.ДатаВремяДокумента), ЭлементСобытие.ДатаВремяДокумента,ЭлементСобытие.ДатаВремя);
				Если Вложение.Направление = "Входящий" Тогда
					Если		СтрокаРезультат.Переход = "Входящая" Тогда 
						СтрокаРезультат.Переход = "Отправка";
					ИначеЕсли	СтрокаРезультат.Переход = "Исходящая" Тогда
						СтрокаРезультат.Переход = "Подпись";
					КонецЕсли;
				Иначе
					Если		СтрокаРезультат.Переход = "Входящая" Тогда 
						СтрокаРезультат.Переход = "Подпись";
					ИначеЕсли	СтрокаРезультат.Переход = "Исходящая" Тогда
						СтрокаРезультат.Переход = "Отправка";
					КонецЕсли;
				КонецЕсли;
				Результат.Добавить(СтрокаРезультат);
				Если Подпись = Неопределено Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Прервать;
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;
КонецФункции
// << alo Меркурий
&НаКлиенте
Функция СБИСЗаписатьВложения(Кэш,СоставПакета, Вложение) Экспорт
	Попытка
		Кэш.СБИС.МодульОбъектаКлиент.ЗаписатьВложенияСБИС(СоставПакета, Вложение, Новый Структура, Новый Структура("Кэш", Кэш));
	Исключение  
		
		Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, ИнформацияОбОшибке());
		Возврат Ложь;  
		
	КонецПопытки;   
	
	Возврат Истина;
КонецФункции		// alo Меркурий >>
&НаКлиенте
Функция сбисВыполнитьКоманду(Кэш, Идентификатор,ИмяКоманды, ПредставлениеПакета) Экспорт
	// Выполняет указанную команду по документу СБИС (утверждение/отклонение)	
	МестныйКэш = Кэш;	
	ГлавноеОкно = Кэш.ГлавноеОкно;
	МодульТекущий = МодульОбъектаКлиент(); 
	// Прочитаем пакет   
	ИмяИнтерация = МодульТекущий.ПолучитьЗначениеПараметраСБИС("ИнтеграцияИмя");
	
	ОшибкаЧтенияПакета = Ложь;
	СоставПакета = ПрочитатьДокумент(Кэш,Идентификатор,,ОшибкаЧтенияПакета);
	Если ОшибкаЧтенияПакета Тогда
				
		Если МодульТекущий.ПолучитьЗначениеПараметраСБИС("ТихийРежим") Тогда
			
			ОшибкаВыполнитьДействие = МодульТекущий.НовыйСбисИсключение(СоставПакета, ИмяИнтерация + ".сбисВыполнитьКоманду");
			ВызватьИсключение МодульТекущий.СбисИсключение_Выгрузить(ОшибкаВыполнитьДействие);
			
		Иначе

			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	ТекущееДействие = Неопределено;
	
	Если СоставПакета.Свойство("Этап") Тогда
		Для Каждого ЭлДействие Из СоставПакета.Этап[0].Действие Цикл
			Если ЭлДействие.Название = ИмяКоманды Тогда
				ТекущееДействие = ЭлДействие;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ТекущееДействие = Неопределено Тогда
		
		ДетализацияОшибки = "У документа " + МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "Название") + " отсутствует переход " + ИмяКоманды;
		ОшибкаВыполнитьДействие = МодульТекущий.НовыйСбисИсключение(, ИмяИнтерация + ".сбисВыполнитьКоманду", 718103, ,ДетализацияОшибки);
		ВызватьИсключение МодульТекущий.СбисИсключение_Выгрузить(ОшибкаВыполнитьДействие);
		
	КонецЕсли;	
		
	Комментарий = "";
	ПараметрыОтклонения = Новый Структура("Кэш,СоставПакета,Действие,ПредставлениеПакета",Кэш, СоставПакета, ТекущееДействие, ПредставлениеПакета);
	Если НРег(ТекущееДействие.ТребуетКомментария) = "да" Тогда
		СтрокаПодсказка = "Необходим комментарий"; 
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Если Не ВвестиСтроку(Комментарий,СтрокаПодсказка,,Истина) Тогда
				Комментарий = "";
			КонецЕсли;
		#Иначе
			ПоказатьВводСтроки(Новый ОписаниеОповещения("сбисВыполнитьКомандуПослеВвводаКомментария",ЭтаФорма, ПараметрыОтклонения),Комментарий,СтрокаПодсказка,,Истина);
			Возврат Ложь;
		#КонецЕсли
	КонецЕсли;
	
	Возврат сбисВыполнитьКомандуПослеВвводаКомментария(Комментарий,  ПараметрыОтклонения);
	
КонецФункции
&НаКлиенте
Функция сбисВыполнитьКомандуПослеВвводаКомментария(Комментарий, ДопПараметры) Экспорт
	// Выполняет указанную команду по документу СБИС (утверждение/отклонение)	
	Кэш = ДопПараметры.Кэш;
	СоставПакета = ДопПараметры.СоставПакета;
	ПредставлениеПакета = ДопПараметры.ПредставлениеПакета;
	Действие = ДопПараметры.Действие;
	ИмяКоманды = Действие.Название;
	МодульТекущий = МодульОбъектаКлиент(); 
	
	Если НРег(Действие.ТребуетКомментария) = "да" И Не ЗначениеЗаполнено(Комментарий) Тогда
		
		Если МодульТекущий.ПолучитьЗначениеПараметраСБИС("ТихийРежим") Тогда
			
			ИмяИнтерация = МодульТекущий.ПолучитьЗначениеПараметраСБИС("ИнтеграцияИмя");
			ОшибкаВыполнитьДействие = МодульТекущий.НовыйСбисИсключение(, ИмяИнтерация + ".сбисВыполнитьКоманду", 780,, "Для выполнения операции, необходимо указать комментарий!");
			ВызватьИсключение МодульТекущий.СбисИсключение_Выгрузить(ОшибкаВыполнитьДействие);
			
		Иначе
			
			Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, Новый Структура("code, message, details", 780, "Не заполнено обязательное поле", "Для выполнения операции, необходимо указать комментарий!"), Новый Структура());
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
    Если ДопПараметры.Действие.ТребуетКомментария  = "Да" Тогда
        СтруктураДЛяОтложеногоДействия = Новый Структура("ИмяПроцедуры, Модуль","ОбновитьКонтент",Кэш.ГлавноеОкно );
        ОтложенноеДействие = МодульОбъектаКлиент().НовыйОтложенноеДействие(СтруктураДЛяОтложеногоДействия);
        МодульОбъектаКлиент().ПодключитьОтложенноеДействие(ОтложенноеДействие);
    КонецЕсли;
	
	Результат = сбисВыполнитьДействие(Кэш, СоставПакета, СоставПакета.Этап[0], Действие, Комментарий, ПредставлениеПакета);
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ОбработкаСлужебныхДокументов(Кэш) Экспорт
	// Получает список организаций с необработанными этапами и запускает для них обработку служебных документов
	МестныйКэш = Кэш;
	ГлавноеОкно = Кэш.ГлавноеОкно;
	сбисПоказатьСостояние("Обработка служебных документов",ГлавноеОкно);
	СписокИНН = Новый СписокЗначений;
	МассивОрганизаций = ПолучитьСписокНашихОрганизаций(Кэш, СписокИНН);
	СписокСертификатов = Кэш.Интеграция.ПолучитьСертификатыДляАктивации(Кэш, СписокИНН);
	Если СписокСертификатов.Количество()>0 Тогда
		Для Каждого Элемент Из СписокСертификатов Цикл
			Сертификат = Элемент.Значение;
			Если Сертификат.Ключ.СпособАктивации<>"СтатическийКод" Тогда
				ПолучитьКодАктивацииСертификата(Кэш, Сертификат);				
			КонецЕсли;
			ФормаВводаПинкода = ГлавноеОкно.сбисПолучитьФорму("ФормаВводаПинкода");
			ПараметрыВвода = Новый Структура("СертификатИмя", Кэш.ОбщиеФункции.СформироватьЗаголовокСертификатаДляФормыВвода(Кэш, Сертификат));
			КодАктивации = ФормаВводаПинкода.Показать(ПараметрыВвода);
			Если	Не	ЗначениеЗаполнено(КодАктивации)
				Или		КодАктивации.ПинКод = "" Тогда
				Сообщить("Не активирован сертификат для подписания документов.");
				Возврат Ложь;	
			КонецЕсли;
			Сертификат.Вставить("КодАктивации", КодАктивации.ПинКод);
		КонецЦикла;
		Если Кэш.Интеграция.АктивироватьСерверныеСертификаты(Кэш, СписокСертификатов) = Ложь Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;	
	Для Каждого оОрганизация из МассивОрганизаций Цикл
		ИзвещенияОбработаны = ОбработатьСлужебныеДокументыОрганизации(Кэш, оОрганизация);
	КонецЦикла;	
	сбисСпрятатьСостояние(ГлавноеОкно);
КонецФункции
&НаКлиенте
Функция Аккордеон_ОтключенныеРазделы() Экспорт
	ОтключенныеРазделы = Новый Структура();
	Возврат ОтключенныеРазделы;
КонецФункции

//////////////// Вспомогательные функции/////////////////////

&НаКлиенте
Функция ПолучитьФильтр(ГлавноеОкно,ДопПараметры) Экспорт
	Возврат ГлавноеОкно.Кэш.ОбщиеФункции.ПолучитьФильтрСобытий(ГлавноеОкно.Кэш, ДопПараметры);
КонецФункции
&НаКлиенте
Функция СокращенноеФИО(Кэш, ФИО)
	// Формирует сокращенное ФИО из полного	
	ФИО = Кэш.ОбщиеФункции.РазбитьСтрокуВМассивНаКлиенте(ФИО," ");
	
	Фамилия  = ?(ФИО.Количество()>0,ФИО[0],"");
	Имя      = ?(ФИО.Количество()>=2,Лев(ФИО[1],1)+".","");
	Отчество = ?(ФИО.Количество()>=3,Лев(ФИО[2],1)+".","");
	Возврат Фамилия+" "+Имя+Отчество;
КонецФункции
//&НаСервереБезКонтекста
Функция ПолучитьРеквизитОбъекта(Объект1С, ИмяРеквизита)
	// Получает значение реквизита объекта 1С	
	Возврат Объект1С[ИмяРеквизита];	
КонецФункции

//Получает текущую дату в миллисекундах с начала 1970г
&НаКлиенте
функция сбисТекущаяДатаМСек(Кэш) Экспорт
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат", Истина);
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "getMillisecondsSinceEpoch2", Новый Структура, ДопПараметрыЗапроса, Отказ);
	Если Отказ Тогда
		Возврат 0;
	КонецЕсли;
	Возврат Результат;
КонецФункции
//&НаСервереБезКонтекста
функция сбисСтрокаВBASE64(строка, кодировка = "windows-1251") экспорт
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.УстановитьТекст(строка);
	ИмяВрФ = КаталогВременныхФайлов()+"sbisTemp.xml";
	ТекстДок.Записать(ИмяВрФ, кодировка);
	ТекстXMLBase64 = сбисФайлВBASE64(ИмяВрФ);  
	Попытка 
		УдалитьФайлы(ИмяВрФ); 
	Исключение 
	КонецПопытки;	
	Возврат ТекстXMLBase64;
КонецФункции
//&НаСервереБезКонтекста
функция сбисBASE64ВСтроку(ТекстXMLBase64) экспорт
	ДвоичныеДанныеXML = Base64Значение(ТекстXMLBase64);
	ИмяВрФ = КаталогВременныхФайлов()+"sbisTemp.xml";
	ДвоичныеДанныеXML.Записать(ИмяВрФ);
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ИмяВрФ);
	html_text = ТекстДок.ПолучитьТекст();
	Попытка 
		УдалитьФайлы(ИмяВрФ); 
	Исключение 
	КонецПопытки;
	Возврат html_text;
КонецФункции
//&НаСервереБезКонтекста
функция сбисФайлВBASE64(ПолноеИмяФайла) экспорт
	ДвоичныеДанныеXML = Новый ДвоичныеДанные(ПолноеИмяФайла);
	ТекстXMLBase64 = СтрЗаменить(СтрЗаменить(Base64Строка(ДвоичныеДанныеXML),Символы.ПС,""),Символы.ВК,"");  
	Возврат ТекстXMLBase64;
КонецФункции
&НаКлиенте
функция сбисФайлСКлиентаВBASE64(ПолноеИмяФайла) экспорт
	# Если НЕ ВебКлиент Тогда
		ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
		Возврат сбисФайлНаСервереВBASE64(ДвоичныеДанные);
	# Иначе
		ПомещаемыеФайлы = Новый Массив;
		ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ПолноеИмяФайла,""));
		ПомещенныеФайлы = Новый Массив;
		Попытка
			ПоместитьФайлы(ПомещаемыеФайлы,ПомещенныеФайлы,,Ложь, УникальныйИдентификатор);
			Возврат сбисФайлНаСервереВBASE64(ПомещенныеФайлы, Истина);
		Исключение
			Ошибка = ОписаниеОшибки();
		КонецПопытки;
	# КонецЕсли
	Возврат "";
КонецФункции
//&НаСервереБезКонтекста
функция сбисФайлНаСервереВBASE64(Данные, ЭтоВебКлиент = Ложь) экспорт
	Если ЭтоВебКлиент Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Данные[0].Хранение);
	Иначе
		ДвоичныеДанные = Данные;
	КонецЕсли;
	Возврат Base64Строка(ДвоичныеДанные);
КонецФункции
&НаКлиенте
Процедура УстановитьВидимостьОбновитьСтатусы(Кэш) Экспорт
	// Если более часа не проверяли статусы, то выводим красное предупреждение	
	ГлавноеОкно = Кэш.ГлавноеОкно;
	//СтруктураНастроек = Кэш.ФормаНастроек.ПолучитьПараметрыСБИС(Кэш,Кэш.Парам.ИдентификаторНастроек);
	ОбновитьСтатусы		= Ложь;
	Если	(	Не	ЗначениеЗаполнено(ГлавноеОкно.ДатКнцЧтенияСтатусов)
			Или		ТекущаяДата()-ГлавноеОкно.ДатКнцЧтенияСтатусов > 3600) Тогда
		ОбновитьСтатусы = Истина;
	КонецЕсли;	
	сбисЭлементФормы(ГлавноеОкно, "ОбновитьСтатусы").Видимость = ОбновитьСтатусы;

КонецПроцедуры
&НаКлиенте
Функция сбисПодписант(Кэш, ИНН) Экспорт
	// Получает Информацию о подписанте документа
	Возврат Новый Структура("Должность,ФИО,ИНН");
КонецФункции
&НаКлиенте
Функция сбисИдентификаторУчастника(Кэш, ИНН, КПП, Название) Экспорт
	// Получает Информацию о контрагенте с онлайна
	Возврат "";
КонецФункции
&НаКлиенте
Процедура сбисПрерываниеПользователем()
	// Прячет состояние при прерывании отправки, обработки служебных, обработки статусов	
	ГлавноеОкно = сбисПолучитьФорму("ФормаГлавноеОкно");
	сбисСпрятатьСостояние(ГлавноеОкно);	
КонецПроцедуры
&НаКлиенте
Процедура ПрерываниеПользователемОбработкиСтатусов()
	// Сохраняем параметры запроса статусов, если выполнение было прервано пользователем
	ГлавноеОкно = сбисПолучитьФорму("ФормаГлавноеОкно");
	Если ЕстьИзменения и ПоследнееИзменение.Свойство("Событие") Тогда
		КоличествоСобытий = ПоследнееИзменение.Событие.Количество();
		//СтруктураНастроек = Новый Структура("ДатаПоследнегоЗапросаСтатусов,ИдентификаторПоследнегоСобытия", ПоследнееИзменение.Событие[КоличествоСобытий-1].ДатаВремя,ПоследнееИзменение.Событие[КоличествоСобытий-1].Идентификатор);
		//МестныйКэш.ФормаНастроек.СохранитьПараметрыСБИС(МестныйКэш,СтруктураНастроек, МестныйКэш.Парам.ИдентификаторНастроек);
		ГлавноеОкно.ДатаПоследнегоЗапросаСтатусов = ПоследнееИзменение.Событие[КоличествоСобытий-1].ДатаВремя;
		ГлавноеОкно.ИдентификаторПоследнегоСобытия = ПоследнееИзменение.Событие[КоличествоСобытий-1].Идентификатор;
	КонецЕсли;
	//МестныйКэш.ФормаНастроек.СохранитьПараметрыСБИС(МестныйКэш,Новый Структура("ДатКнцЧтенияСтатусов", ТекущаяДата()), МестныйКэш.Парам.ИдентификаторНастроек);
	ГлавноеОкно.ДатКнцЧтенияСтатусов = ТекущаяДата();
	сбисСпрятатьСостояние(ГлавноеОкно);	
КонецПроцедуры

////////////////Методы взаимодействия с плагином/////////////

////////////////////////////////////////////////////
//////////////////Автообновление////////////////////
////////////////////////////////////////////////////

&НаКлиенте
Функция сбисПолучитьПараметрыАктуальнойВерсии(Кэш, ПараметрыОбновления, Отказ) Экспорт
	Возврат сбисСохранитьВФайлПоСсылке(Кэш, ПараметрыОбновления, Отказ);
КонецФункции

&НаКлиенте
Функция сбисСохранитьВФайлПоСсылке(Кэш, сбисПараметрыФайла, Отказ) Экспорт
	
	ДопПараметрыЗапроса	= Новый Структура("СообщатьПриОшибке, ВернутьОшибку", Ложь, Истина);
	ПараметрыМетода		= Новый Структура("filename_in, uri_in", сбисПараметрыФайла.ИмяФайла);
	Если сбисПараметрыФайла.Свойство("URL") И Лев(сбисПараметрыФайла.URL, 8) = "https://" Тогда   
		ПараметрыМетода.uri_in = сбисПараметрыФайла.URL;
	ИначеЕсли Не сбисПараметрыФайла.Свойство("URLПолный", ПараметрыМетода.uri_in) Тогда
		ПараметрыМетода.uri_in = сбисПараметрыФайла.Протокол + "://" + сбисПараметрыФайла.Сервер + сбисПараметрыФайла.URL;
	КонецЕсли;
	сбисРезультатЧтения = сбисОтправитьИОбработатьКоманду(Кэш, "LoadDataFromURIToFile2", ПараметрыМетода, ДопПараметрыЗапроса, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(сбисРезультатЧтения,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".сбисСохранитьВФайлПоСсылке", 700, "Неизвестная ошибка подключения", сбисРезультатЧтения.details);
	КонецЕсли;	
	Возврат Истина;	
	
КонецФункции

////////////////////////////////////////////////////
////////////////////Авторизация/////////////////////
////////////////////////////////////////////////////

//Авторизуется по логину/паролю	
&НаКлиенте
Функция АвторизоватьсяПоЛогинуПаролю(Кэш,Логин,Пароль,Отказ=Ложь) Экспорт
	ДопПараметры = Новый Структура("СообщатьПриОшибке, ВернутьОшибку, ПоСертификату", Ложь, Истина, Ложь);
	МестныйКэш = Кэш;
	
	РезультатЗапроса = СформироватьНастройкиПодключения(Кэш,,ДопПараметры,Отказ);	
	Если Отказ Тогда
		Возврат РезультатЗапроса;
	КонецЕсли;
	
	ДопПараметры.Вставить("ОчиститьПараметры", Истина);
	ПараметрыРезультат = Новый Структура(	"Метод,				Параметры,											ДополнительныеПараметры", 
											"Authenticate2",	Новый Структура("login,password", Логин, Пароль),	ДопПараметры);
	ПараметрыРезультат.Вставить("Результат", СбисОтправитьИОбработатьКоманду(Кэш, ПараметрыРезультат.Метод, ПараметрыРезультат.Параметры, ДопПараметры, Отказ));
	Возврат сбисРезультатАвторизации(Кэш, ПараметрыРезультат, Отказ);
	
КонецФункции

// Авторизуется по сертификату	
&НаКлиенте
Функция АвторизоватьсяПоСертификату(Кэш,Сертификат,Отказ=Ложь) Экспорт
	ДопПараметры = Новый Структура("СообщатьПриОшибке, ВернутьОшибку, ПоСертификату", Ложь, Истина, Истина);
	МестныйКэш = Кэш;
	
	РезультатЗапроса = СформироватьНастройкиПодключения(Кэш,,ДопПараметры,Отказ);	
	Если Отказ Тогда
		Возврат РезультатЗапроса;
	КонецЕсли;
	
	ДопПараметры.Вставить("ОчиститьПараметры", Истина);
	ПараметрыРезультат = Новый Структура(	"Метод,							Параметры,							ДополнительныеПараметры", 
											"AuthenticateByCertificate2",	Новый Структура("id", Сертификат),	ДопПараметры);
	ПараметрыРезультат.Вставить("Результат", сбисОтправитьИОбработатьКоманду(Кэш, ПараметрыРезультат.Метод, ПараметрыРезультат.Параметры, ДопПараметры, Отказ));
	Возврат сбисРезультатАвторизации(Кэш, ПараметрыРезультат, Отказ);	
КонецФункции

// Авторизуется по токену	
&НаКлиенте
Функция АвторизоватьсяПоТокену(Кэш,Отказ=Ложь) Экспорт 	
	ДопПараметры = Новый Структура("СообщатьПриОшибке, ВернутьОшибку, ПоСертификату", Ложь, Истина, Ложь);
	МестныйКэш = Кэш;
	
	Токен = Кэш.ГлавноеОкно.сбисПолучитьФорму("API").ПолучитьТокенДляТекущегоПользователя(Кэш, Отказ);
	Если Отказ Тогда
		Возврат Токен;
	КонецЕсли;
	
	РезультатЗапроса = СформироватьНастройкиПодключения(Кэш,,ДопПараметры,Отказ);	
	Если Отказ Тогда
		Возврат РезультатЗапроса;
	КонецЕсли;

	ДопПараметры.Вставить("ОчиститьПараметры", Истина);
	ПараметрыРезультат = Новый Структура( "Метод, Параметры, ДополнительныеПараметры", "AuthenticateByToken", Новый Структура("Token", Токен), ДопПараметры);
	ПараметрыРезультат.Вставить("Результат", сбисОтправитьИОбработатьКоманду(Кэш, ПараметрыРезультат.Метод, ПараметрыРезультат.Параметры, ДопПараметры, Отказ));
	Результат = СбисРезультатАвторизации(Кэш, ПараметрыРезультат, Отказ);  
	Если Не Отказ Тогда
		МестныйКэш.Парам.ИдентификаторСессии = Результат;
		сбисПараметрыСтатистики = Новый Структура("Действие, ДетальноеСообщение", "Аутентификация", "По токену");
		Кэш.ОбщиеФункции.сбисСтатистика_СформироватьИЗаписатьСтатистикуНаСервис(МестныйКэш, сбисПараметрыСтатистики, Ложь);
	КонецЕсли;
	Возврат Результат;
КонецФункции

// функция получает токен по текущему сиду	
&НаКлиенте
функция ПолучитьТикетДляТекущегоПользователя(Кэш) Экспорт
	Отказ = Ложь;
	РезультатЗапроса = сбисОтправитьИОбработатьКоманду(Кэш, "GetTicketForCurrentSid", Новый Структура, Новый Структура,Отказ);
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат РезультатЗапроса;
КонецФункции

//Функция обрабатывает результат авторизации
&НаКлиенте
Функция СбисРезультатАвторизации(Кэш, ПараметрыРезультата, Отказ) Экспорт
	РезультатАвторизации = ПараметрыРезультата.Результат;
	Если Не Отказ Тогда
		МодульОбъектаКлиент().ИзменитьПараметрСбис("Авторизован",	Истина);
		Возврат РезультатАвторизации;
	КонецЕсли;
	Если РезультатАвторизации.code = 303 Тогда
		//Если код ошибки - 303, значит ожидается подтверждение аутентификации. Разбираем строку в details ошибки для выборки данных формирования СМС и последующей авторизации.
		addInfo = Новый Структура;
		addInfo.Вставить("Идентификатор",		РезультатАвторизации.data.data.addinfo.ResourceID);
		addInfo.Вставить("ИдентификаторСессии",	РезультатАвторизации.data.data.addinfo.SessionID);
		addInfo.Вставить("МетодВалидации",		РезультатАвторизации.data.data.addinfo.MethodToValidate);
		addInfo.Вставить("ПоСертификату",		ПараметрыРезультата.ДополнительныеПараметры.ПоСертификату);
		РезультатАвторизации.Вставить("data", Новый Структура("addinfo", addinfo));
	КонецЕсли;
	
	Возврат РезультатАвторизации;
	
КонецФункции

//Закрывает текущую сессию	
&НаКлиенте
Функция ЗакрытьСессию(Кэш) Экспорт 	
	Отказ				= Ложь;
	Кэш.КэшСертификатов	= Новый Структура;
	ДопПараметрыЗапроса	= Новый Структура;
	МодульОбъектаКлиент().ИзменитьПараметрСбис("Авторизован",	Ложь);
	РезультатЗапроса = сбисОтправитьИОбработатьКоманду(Кэш, "TerminateSession2", Новый Структура, ДопПараметрыЗапроса,Отказ);
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат РезультатЗапроса;
КонецФункции	

//Получает строковое представление ФИО о текущем пользователе	
&НаКлиенте
Функция ИнформацияОТекущемПользователе(Кэш) Экспорт
	
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат", Истина);
	
	РезультатЗапроса = сбисОтправитьИОбработатьКоманду(Кэш, "ReadCurrentUserInfo2", Новый Структура, ДопПараметрыЗапроса,Отказ);
	Если Отказ Тогда
		Возврат "";
	КонецЕсли;
	
	Фамилия	= Неопределено;
	Имя		= Неопределено;
	Отчество= Неопределено;
	
	Если Не РезультатЗапроса.Пользователь.Свойство("Фамилия", Фамилия) Тогда
		Фамилия = "";
	КонецЕсли;
	Если Не РезультатЗапроса.Пользователь.Свойство("Имя", Имя) Тогда
		Имя = "";
	КонецЕсли;
	Если Не РезультатЗапроса.Пользователь.Свойство("Отчество",	Отчество) Тогда
		Отчество = "";
	КонецЕсли;
	Возврат Фамилия+" "+Имя+" "+Отчество;
КонецФункции

//Отправляет код авторизации на номер телефона, указанный в карточке сотрудника
&НаКлиенте
Функция ОтправитьКодАвторизации(Кэш, ПараметрыПодтверждения, Отказ) Экспорт
	ДопПараметрыЗапроса	= Новый Структура("СообщатьПриОшибке, ВернутьОшибку", Ложь, Истина);
	
	Парам = Новый Структура("Идентификатор", ПараметрыПодтверждения.Идентификатор);
	Возврат сбисОтправитьИОбработатьКоманду(Кэш, "SendAuthenticateCode", Парам, ДопПараметрыЗапроса, Отказ);
КонецФункции

//Функция выполняет подтверждение введенного кода для двухфакторной аутентификации
&НаКлиенте
Функция ПодтвердитьАвторизацию(Кэш, ПараметрыВвода, ПараметрыПодтверждения, Отказ) Экспорт
	ДопПараметрыЗапроса	= Новый Структура("СообщатьПриОшибке, ВернутьОшибку", Ложь, Истина);
	
	ПараметрыЗапроса = Новый Структура("Код, Идентификатор, Метод, ПоСертификату", ПараметрыВвода.ПинКод, ПараметрыПодтверждения.Идентификатор, ПараметрыПодтверждения.МетодВалидации, ПараметрыПодтверждения.ПоСертификату);
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "ConfirmAuthentication", ПараметрыЗапроса, ДопПараметрыЗапроса, Отказ);
	Если Не Отказ Тогда
		МодульОбъектаКлиент().ИзменитьПараметрСбис("Авторизован",	Истина);
	КонецЕсли;
	Возврат Результат;
КонецФункции

//Получает список сертификатов, пригодных для авторизации	
&НаКлиенте
Функция ПолучитьСписокСертификатовДляАвторизации(Кэш, ТекстОшибки) Экспорт
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура("ВернутьОшибку, ЕстьРезультат, ВремяОжиданияОтвета", Истина, Истина, 120);      // увеличено время ожидания, т.к. через сбисПараметры можно переопределить только для вызовов после авторизаии
	МестныйКэш			= Кэш;
	
	РезультатЗапроса = СформироватьНастройкиПодключения(Кэш,,ДопПараметрыЗапроса,Отказ);	
	Если Отказ Тогда
		ТекстОшибки = РезультатЗапроса.message;
		Возврат Ложь;
	КонецЕсли;
	
	ДопПараметрыЗапроса.Вставить("ЕстьРезультат", Истина);
	РезультатЗапроса = сбисОтправитьИОбработатьКоманду(Кэш, "ReadCertificatesForAuth", Новый Структура, ДопПараметрыЗапроса,Отказ);
	Если Отказ Тогда
		ТекстОшибки = РезультатЗапроса.message;
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ОбработатьСписокСертификатовДляАвторизации(Кэш, РезультатЗапроса["Сертификат"]);
КонецФункции

&НаКлиенте
Функция ОбработатьСписокСертификатовДляАвторизации(Кэш, ObjectList) Экспорт
	Если ObjectList = Неопределено Тогда
		Возврат ObjectList;
	КонецЕсли;
	СписокСертификатов = Новый СписокЗначений();
	Размер = ObjectList.Количество();
	Для сч=0 По Размер-1 Цикл
		Сертификат = ObjectList[сч];
		Если Сертификат.Аутентификация.Зарегистрирован = "Да" Тогда
			Если Сертификат.Свойство("ДействителенПо") Тогда
				Если ТипЗнч(Сертификат.ДействителенПо)=Тип("Дата") Тогда
					ДействителенПо = Дата(Год(Сертификат.ДействителенПо), Месяц(Сертификат.ДействителенПо), День(Сертификат.ДействителенПо));
				Иначе
					ДействителенПо = Дата(Сред(Сертификат.ДействителенПо,7,4), Сред(Сертификат.ДействителенПо,4,2), Лев(Сертификат.ДействителенПо, 2));
				КонецЕсли;
			КонецЕсли;
			СписокСертификатов.Добавить(Сертификат, Кэш.ОбщиеФункции.ПолучитьПредставлениеСертификата(Сертификат, "[ФИО].([Должность])., [Название].(ИНН [ИНН])., действителен до [ДействителенПо]", Истина, "ДЛФ=DD"));
		КонецЕсли;
	КонецЦикла;
	Возврат СписокСертификатов;

КонецФункции

&НаКлиенте
Функция ОбработатьСписокСертификатовДляАктивации(Кэш, ObjectList) Экспорт
	Если ObjectList = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	СписокСертификатов	= Новый СписокЗначений();
	Размер = ObjectList.Количество();
	Для сч=0 По Размер-1 Цикл
		Сертификат = ObjectList[сч];
		Если ТипЗнч(Сертификат.ДействителенПо)=Тип("Дата") Тогда
			ДействителенПо = Дата(Год(Сертификат.ДействителенПо), Месяц(Сертификат.ДействителенПо), День(Сертификат.ДействителенПо));
		Иначе
			ДействителенПо = Дата(Сред(Сертификат.ДействителенПо,7,4), Сред(Сертификат.ДействителенПо,4,2), Лев(Сертификат.ДействителенПо, 2));
		КонецЕсли;
		Если ДействителенПо>=ТекущаяДата() Тогда
			СписокСертификатов.Добавить(Сертификат);
		КонецЕсли;
	КонецЦикла;

	Возврат СписокСертификатов;
КонецФункции

//Проверяет активна ли текущая сессия
&НаКлиенте
Функция СбисСессияДействительна(Кэш) Экспорт
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат", Истина);
	
	РезультатЗапроса = сбисОтправитьИОбработатьКоманду(Кэш, "CheckSession2", Новый Структура, ДопПараметрыЗапроса,Отказ);
	Если Не Отказ
		И РезультатЗапроса.СессияАктивна = "Да" Тогда
		Возврат 1;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Функция СбисИдАккаунта(Кэш) Экспорт
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Функция ПолучитьИдТекущегоАккаунта(Кэш) Экспорт
	Возврат Неопределено;
КонецФункции

//Устанавливает в SDK настройки подключения		
&НаКлиенте
Функция СформироватьНастройкиПодключения(Кэш, ИдентификаторСессии = "", ДополнительныеПараметрыЗапроса=Неопределено, Отказ=Ложь) Экспорт
	Параметр = Новый Структура("host", СтрЗаменить(Кэш.СБИС.АдресСервера,".ru/",".ru"));
	Если ЗначениеЗаполнено(ИдентификаторСессии) Тогда
		Параметр.Вставить("sid",ИдентификаторСессии);
	КонецЕсли;
	Если ДополнительныеПараметрыЗапроса = Неопределено Тогда
		ДополнительныеПараметрыЗапроса = Новый Структура;	
	КонецЕсли;
	Рез = сбисОтправитьИОбработатьКоманду(Кэш,"setConnectionInfo",Параметр, ДополнительныеПараметрыЗапроса,Отказ);
	ПолучитьНастройкиПлагина(Кэш, Новый Структура("СообщатьПриОшибке, ВернутьОшибку", Ложь, Ложь), Отказ);
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура СбисУстановитьВремяОжидания(Кэш, ВремяОжидания) Экспорт
	МодульОбъектаКлиент().ИзменитьПараметрСбис("ВремяОжиданияОтвета",	ВремяОжидания);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНастройкиПлагина(Кэш, ДополнительныеПараметрыЗапроса=Неопределено, Отказ=Ложь) Экспорт
	Если 	(	Кэш.Парам.СпособОбмена = 5 Или Кэш.Парам.СпособОбмена = 7)
		И		Кэш.Парам.ШифроватьВыборочно = Истина
		И	Не Кэш.Свойство("КаталогЗашифрованных") Тогда
		Параметр = Новый Структура();
		Если ДополнительныеПараметрыЗапроса = Неопределено Тогда
			ДополнительныеПараметрыЗапроса = Новый Структура;	
		КонецЕсли;
		Рез = сбисОтправитьИОбработатьКоманду(Кэш,"getPluginSettings",Параметр, ДополнительныеПараметрыЗапроса,Отказ);	
		Если Не Отказ Тогда
			Если Рез.Свойство("NEW_SETTINGS") и Рез.NEW_SETTINGS.Свойство("SecureLoading") и Рез.NEW_SETTINGS.SecureLoading.Свойство("fromFolder") и Рез.NEW_SETTINGS.SecureLoading.encrypt = Истина Тогда
				Кэш.Вставить("КаталогЗашифрованных", Рез.NEW_SETTINGS.SecureLoading.fromFolder);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецФункции	

////////////////////////////////////////////////////
////////////////////Сертификаты/////////////////////
////////////////////////////////////////////////////

//Функция активирует серверные сертификаты для определенного списка ИНН	
&НаКлиенте
Функция АктивироватьСерверныеСертификаты(Кэш, СписокСертификатов) Экспорт
	ДопПараметрыЗапроса = Новый Структура;
	Отказ = Ложь;
	Для Каждого Элемент Из СписокСертификатов Цикл
		Сертификат = Элемент.Значение;
		ПараметрыАктивации = Новый Структура;
		ПараметрыАктивации.Вставить("Отпечаток", Сертификат.Отпечаток);
		ПараметрыАктивации.Вставить("КодАктивации", Сертификат.КодАктивации);
		
		РезультатЗапроса = сбисОтправитьИОбработатьКоманду(Кэш, "ActivateCertificate", ПараметрыАктивации, ДопПараметрыЗапроса,Отказ);
		Если Отказ Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Не Отказ;
КонецФункции

//Получает список доступных сертификатов	
&НаКлиенте
Функция ПолучитьСписокСертификатов(Кэш, filter=Неопределено) Экспорт
	МестныйКэш			= Кэш;
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат", Истина);
	
	Если filter = Неопределено Тогда
		filter = Новый Структура;
	КонецЕсли;
	
	РезультатЗапроса = СбисОтправитьИОбработатьКоманду(Кэш, "ReadCertificates", filter, ДопПараметрыЗапроса,Отказ);
	Если Отказ Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	Возврат ОбработатьСписокСертификатовДляАктивации(Кэш, РезультатЗапроса.Сертификат);
КонецФункции 


&НаКлиенте
Функция ПолучитьСписокСертификатовПоФильтру(Кэш, filter=Неопределено, Отказ) Экспорт
	
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат, СообщатьПриОшибке, ВернутьОшибку", Истина, Ложь, Истина);
	
	Если filter = Неопределено Тогда
		filter = Новый Структура;
	КонецЕсли;
	
	РезультатЗапроса = СбисОтправитьИОбработатьКоманду(Кэш, "ReadCertificates", filter, ДопПараметрыЗапроса,Отказ);
	Если Отказ Тогда
		Возврат МодульОбъектаКлиент().НовыйСбисИсключение(РезультатЗапроса);
	КонецЕсли;
		
	Возврат ОбработатьСписокСертификатовДляАктивации(Кэш, РезультатЗапроса.Сертификат);
КонецФункции

&НаКлиенте
Функция ПолучитьСписокЛокальныхСертификатов(Кэш, filter=Неопределено) Экспорт
	Возврат Новый СписокЗначений();
КонецФункции

//Функция активирует серверные сертификаты для определенного списка ИНН	
&НаКлиенте
Функция ПолучитьСертификатыДляАктивации(Кэш, СписокИНН) Экспорт
	СписокСертификатовДляАктивации = Новый СписокЗначений;
	СписокСертификатов = Кэш.Интеграция.ПолучитьСписокСертификатов(Кэш);
	Для Каждого ИНН Из СписокИНН Цикл
		Для Каждого Элемент Из СписокСертификатов Цикл
			Сертификат = Элемент.Значение;
			Если Сертификат.ИНН = ИНН.Значение Тогда
				Если Сертификат.Ключ.Тип = "Серверный" и Сертификат.Ключ.Активирован = "Нет" Тогда
					СписокСертификатовДляАктивации.Добавить(Сертификат);
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат СписокСертификатовДляАктивации;
КонецФункции

//Функция получает код активации для сертификата
&НаКлиенте
Функция ПолучитьКодАктивацииСертификата(Кэш, Сертификат) Экспорт
	МестныйКэш			= Кэш;
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура;
	
	ПараметрыАктивации = Новый Структура("Отпечаток", Сертификат.Отпечаток);
	
	РезультатЗапроса = сбисОтправитьИОбработатьКоманду(Кэш, "AcquireCertificateActivation", ПараметрыАктивации, ДопПараметрыЗапроса,Отказ);
	Возврат Не Отказ;
КонецФункции

////////////////////////////////////////////////////
/////////////////Списочные методы///////////////////
////////////////////////////////////////////////////

// Получает статусы документов сбис
&НаКлиенте
Функция ПолучитьСписокИзменений(Кэш, ДопПараметрыФильтра = Неопределено) Экспорт
	Отказ		= Ложь;
	ДопПараметры= Новый Структура("СообщатьПриОшибке, ВернутьОшибку, ЕстьРезультат", Ложь, Истина, Истина);
	ГлавноеОкно	= Кэш.ГлавноеОкно;
	
	//Тут ищем новую функцию. Переназначение на старые обработчики происходит внутри типовой формы работы со статусами
	фрм = ГлавноеОкно.сбисНайтиФормуФункции("СбисЗаписатьИзмененияПоДокументам1С", Кэш.ФормаРаботыСоСтатусами, "", Кэш);
	// << alo 
	Если Кэш.парам.СостояниеЭД Тогда
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("ИмяФункции",	"ЗаписатьИзмененияПоДокументам1С");
		ПараметрыПоиска.Вставить("КлючФорм",	"Статусы_СостоянияЭД");
		фрмЭД = Кэш.ОбщиеФункции.сбисНайтиФормуФункцииПодсистемы(Кэш, ПараметрыПоиска);
	КонецЕсли;
	// alo >>
	фрмПольз = ГлавноеОкно.сбисНайтиФормуФункции("ОбработатьСписокИзменений","РаботаСДокументами1С","",Кэш);
	сбисПоказатьСостояние("Обновление статусов отправленных документов", ГлавноеОкно,, "(прервать -  Ctrl+Break)");
	
	СтруктураНастроек = Новый Структура("ДатаПоследнегоЗапросаСтатусов, ИдентификаторПоследнегоСобытия, ДатНачЧтенияСтатусов, ДатКнцЧтенияСтатусов",
			ГлавноеОкно.ДатаПоследнегоЗапросаСтатусов,
			ГлавноеОкно.ИдентификаторПоследнегоСобытия,
			ГлавноеОкно.ДатНачЧтенияСтатусов,
			ГлавноеОкно.ДатКнцЧтенияСтатусов);
	Если (Не ЗначениеЗаполнено(СтруктураНастроек.ДатНачЧтенияСтатусов)) 
		или (ЗначениеЗаполнено(СтруктураНастроек.ДатНачЧтенияСтатусов) и ЗначениеЗаполнено(СтруктураНастроек.ДатКнцЧтенияСтатусов) и СтруктураНастроек.ДатКнцЧтенияСтатусов>=СтруктураНастроек.ДатНачЧтенияСтатусов)
		или (ЗначениеЗаполнено(СтруктураНастроек.ДатНачЧтенияСтатусов) и ТекущаяДата()-СтруктураНастроек.ДатНачЧтенияСтатусов>30) Тогда
		Если Не ЗначениеЗаполнено(СтруктураНастроек.ДатаПоследнегоЗапросаСтатусов) Тогда
			СтруктураНастроек.ДатаПоследнегоЗапросаСтатусов = НачалоДня(ТекущаяДата());
		КонецЕсли;
		filter = Новый Структура; 
		filter.Вставить( "ПолныйСертификатЭП", "Нет");
		Если ЗначениеЗаполнено(СтруктураНастроек.ИдентификаторПоследнегоСобытия) Тогда
			filter.Вставить( "ИдентификаторСобытия", СтруктураНастроек.ИдентификаторПоследнегоСобытия);	
		Иначе
			filter.Вставить( "ДатаВремяС", Формат(СтруктураНастроек.ДатаПоследнегоЗапросаСтатусов,"ДФ=""дд.ММ.гггг ЧЧ.мм.сс""") ); 
		КонецЕсли;
		Если ДопПараметрыФильтра <> Неопределено Тогда
			Для Каждого ДопПарам Из ДопПараметрыФильтра Цикл
				filter.Вставить( ДопПарам.Ключ, ДопПарам.Значение);     
			КонецЦикла;
		КонецЕсли;
		
		navigation = Новый Структура; 
		navigation.Вставить( "РазмерСтраницы", "100" ); 
		filter.Вставить( "Навигация", navigation );
		//navigation.Вставить( "ВернутьРазмерСписка", "Да" );
		сч = 0;
		счДок = 0;
		оДокумент = Новый Структура;
		ЕстьИзменения = Ложь;
		ЕстьЕще = Истина;
		ПодключитьОбработчикОжидания("ПрерываниеПользователемОбработкиСтатусов",0.1,Истина);
		Пока ЕстьЕще Цикл
			//Кэш.ФормаНастроек.СохранитьПараметрыСБИС(Кэш,Новый Структура("ДатНачЧтенияСтатусов", ТекущаяДата()),Кэш.Парам.ИдентификаторНастроек);
			ГлавноеОкно.ДатНачЧтенияСтатусов = ТекущаяДата();
			сбисПоказатьСостояние("Обновление статусов отправленных документов "+строка(счДок), ГлавноеОкно,, "(прервать -  Ctrl+Break)");
			МассивДокументов = Новый Массив;
			Если сч>0 Тогда
				Если оДокумент.Свойство("Событие") Тогда
					КоличествоСобытий = оДокумент.Событие.Количество();
					filter.Вставить( "ИдентификаторСобытия", оДокумент.Событие[КоличествоСобытий-1].Идентификатор);
					filter.Удалить( "ДатаВремяС");
				Иначе
					//Кэш.ФормаНастроек.СохранитьПараметрыСБИС(Кэш,Новый Структура("ДатКнцЧтенияСтатусов", ТекущаяДата()), Кэш.Парам.ИдентификаторНастроек);
					ГлавноеОкно.ДатКнцЧтенияСтатусов = ТекущаяДата();
					Возврат Ложь;
				КонецЕсли;
			КонецЕсли;
			
			Результат = Кэш.Интеграция.СБИСПлагин_СписокИзменений(Кэш, filter, ДопПараметры, Отказ);
			Если Отказ Тогда
				//Если проблемы с плагином, то просто сообщим ошибку и закончим работу.
				Если	Результат.code = 775
					Или	Результат.code = 400 Тогда
					ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, Результат);
					Возврат Ложь;
				КонецЕсли;
				//Если событие на онлайне удалили, то пытаемся по дате запросить
				Если ЗначениеЗаполнено(СтруктураНастроек.ИдентификаторПоследнегоСобытия) и сч = 0 Тогда
					filter = Новый Структура;
					filter.Вставить( "ПолныйСертификатЭП", "Нет");
					filter.Вставить( "ДатаВремяС", Формат(СтруктураНастроек.ДатаПоследнегоЗапросаСтатусов,"ДФ=""дд.ММ.гггг ЧЧ.мм.сс""") );
					filter.Вставить( "Навигация", navigation );
					Если ДопПараметрыФильтра <> Неопределено Тогда
						Для Каждого ДопПарам Из ДопПараметрыФильтра Цикл
							filter.Вставить( ДопПарам.Ключ, ДопПарам.Значение);     
						КонецЦикла;
					КонецЕсли;
					
					Отказ = Ложь;
					Результат = Кэш.Интеграция.СБИСПлагин_СписокИзменений(Кэш, filter, ДопПараметры, Отказ);
					Если Отказ Тогда
						Возврат Ложь;
					КонецЕсли;
				Иначе	
					ГлавноеОкно.сбисСпрятатьСостояние(ГлавноеОкно);
					ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, Результат);
					//Кэш.ФормаНастроек.СохранитьПараметрыСБИС(Кэш,Новый Структура("ДатКнцЧтенияСтатусов", ТекущаяДата()), Кэш.Парам.ИдентификаторНастроек);
					ГлавноеОкно.ДатКнцЧтенияСтатусов = ТекущаяДата();
					Возврат Ложь;
				КонецЕсли;    
			КонецЕсли;
			
			сч = сч + 1;
			СписокИзменений = Результат;
			ЕстьЕще = СписокИзменений.Навигация.ЕстьЕще="Да";
			Для Каждого оДокумент Из СписокИзменений.Документ Цикл
				счДок = счДок + 1;
				ЕстьИзменения = Истина;
				сбисПоказатьСостояние("Обновление статусов отправленных документов "+строка(счДок), ГлавноеОкно,, "(прервать -  Ctrl+Break)");
				МассивДокументов.Добавить(оДокумент);
				Если Кэш.ИспользоватьОбработчикиСобытий = Истина Тогда
					ИмяОбработчика = СтрЗаменить("сбис"+оДокумент.Регламент.Название+"_"+оДокумент.Событие[0].Название, " ", "_");
					фрмОбработчика = Кэш.ГлавноеОкно.сбисНайтиФормуФункции(ИмяОбработчика,"РаботаСДокументами1С","",Кэш);
					Если фрмОбработчика <> Ложь Тогда
						Контекст = Новый структура("Док, Кэш", оДокумент, Кэш);
						Результат=вычислить("фрмОбработчика."+ИмяОбработчика+"(Контекст)");
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;
			сбисПоказатьСостояние("Обновление статусов отправленных документов "+строка(счДок), ГлавноеОкно,, "(прервать -  Ctrl+Break)");
			ПоследнееИзменение = оДокумент;
			//сбисПоказатьСостояние("Запись статусов в регистр сведений", ГлавноеОкно);
			фрм.СбисЗаписатьИзмененияПоДокументам1С(Кэш, МассивДокументов, Новый Структура("ИдАккаунта", Кэш.Интеграция.ПолучитьИдТекущегоАккаунта(Кэш)));
			// << alo 
			Если кэш.парам.СостояниеЭД И фрмЭД<>Ложь Тогда
				фрмЭД.ЗаписатьИзмененияПоДокументам1С(МассивДокументов, Кэш.Ини, ГлавноеОкно.Кэш.Парам.КаталогНастроек);
			конецесли; // alo >>
			Если фрмПольз<>Ложь Тогда
				фрмПольз.ОбработатьСписокИзменений(МассивДокументов, Кэш);	
			КонецЕсли;
			//Кэш.ФормаНастроек.СохранитьПараметрыСБИС(Кэш,Новый Структура("ДатКнцЧтенияСтатусов", ТекущаяДата()), Кэш.Парам.ИдентификаторНастроек);
			ГлавноеОкно.ДатКнцЧтенияСтатусов = ТекущаяДата();
			ОбработкаПрерыванияПользователя();
		КонецЦикла;	
		Если ЕстьИзменения и оДокумент.Свойство("Событие") Тогда
			КоличествоСобытий = оДокумент.Событие.Количество();
			СтруктураНастроек = Новый Структура("ДатаПоследнегоЗапросаСтатусов,ИдентификаторПоследнегоСобытия", оДокумент.Событие[КоличествоСобытий-1].ДатаВремя,оДокумент.Событие[КоличествоСобытий-1].Идентификатор);
			Кэш.ФормаНастроек.СохранитьПараметрыСБИС(Кэш,СтруктураНастроек, Кэш.Парам.ИдентификаторНастроек);
			ГлавноеОкно.ДатаПоследнегоЗапросаСтатусов = оДокумент.Событие[КоличествоСобытий-1].ДатаВремя;
			ГлавноеОкно.ИдентификаторПоследнегоСобытия = оДокумент.Событие[КоличествоСобытий-1].Идентификатор;
		КонецЕсли;
	Иначе
		Сообщить("Обновление статусов уже выполняется по запросу другого пользователя.");
	КонецЕсли;
	сбисСпрятатьСостояние(ГлавноеОкно);
	ОтключитьОбработчикОжидания("ПрерываниеПользователемОбработкиСтатусов");
КонецФункции

// Получает список организаций, присутствующих одновременно в кабинете СБИС и в базе 1С, у которых есть необработанные служебные документы
&НаКлиенте
Функция ПолучитьСписокНашихОрганизаций(Кэш, СписокИНН) Экспорт
	Отказ						= Ложь;
	СтруктураДляОбновленияФормы	= Новый Структура;
	МестныйКэш					= Кэш;
	
	ЕстьЕще				= Истина;
	ТекущаяСтраница		= 0;
	МассивОрганизаций	= Новый Массив;
	
	Пока ЕстьЕще Цикл
		filter		= Новый Структура;
		navigation	= Новый Структура;
		navigation.Вставить( "Страница", строка(ТекущаяСтраница));
		filter.Вставить( "Навигация", navigation );
		
		Результат = Кэш.Интеграция.СБИСПлагин_СписокНашихОрганизаций(Кэш, filter, Новый Структура,Отказ);
		Если Отказ Тогда
			Возврат МассивОрганизаций;
		КонецЕсли;
		
		//Получаем список наших организаций
		Выборка	= Результат.НашаОрганизация;
		Размер	= Выборка.Количество();
		СтруктураОрганизаций = Новый Структура;
		Для сч=0 По Размер-1 Цикл
			оОрганизация = Выборка[сч];	
			Организация1С = Ложь;
			Организация1С = МестныйКэш.ОбщиеФункции.НайтиОрганизациюИзДокументаСБИС(МестныйКэш.Ини.Конфигурация, оОрганизация);
			Если Организация1С <> Неопределено И Организация1С <> Ложь Тогда
				оОрганизация.Вставить("Название", строка(Организация1С));
				
				МассивОрганизаций.Добавить(оОрганизация);
				// добавляем ИНН в список для активации серверных ключей
				Если оОрганизация.Свойство("СвФЛ") Тогда
					Если СписокИНН.НайтиПоЗначению(оОрганизация.СвФЛ.ИНН)=Неопределено Тогда 
						СписокИНН.Добавить(оОрганизация.СвФЛ.ИНН);
					КонецЕсли;
				Иначе
					Если СписокИНН.НайтиПоЗначению(оОрганизация.СвЮЛ.ИНН)=Неопределено Тогда
						СписокИНН.Добавить(оОрганизация.СвЮЛ.ИНН);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		ТекущаяСтраница = ТекущаяСтраница + 1;
		ЕстьЕще = Результат.Навигация.ЕстьЕще="Да";
	КонецЦикла;
	Возврат МассивОрганизаций;
КонецФункции

// Устарел. Использовать МодульОбъектаКлиент().ПолучитьСписокДокументовОтгрузкиСБИС()
&НаКлиенте
Функция ПолучитьСписокДокументовОтгрузки(Кэш) Экспорт
	
	Возврат МодульОбъектаКлиент().ПолучитьСписокДокументовОтгрузкиСБИС();
	
КонецФункции

// Устарел. Использовать МодульОбъектаКлиент().ПолучитьСписокДокументовПоСобытиямСБИС()
&НаКлиенте
Функция ПолучитьСписокСобытий(Кэш, ТипРеестра) Экспорт
	
	Возврат МодульОбъектаКлиент().ПолучитьСписокДокументовПоСобытиямСБИС(Новый Структура("ТипРеестра", ТипРеестра));
	
КонецФункции

// Устарел. Использовать МодульОбъектаКлиент().ПолучитьСписокДокументовПоСобытиямСБИС()
&НаКлиенте
Функция ПолучитьСписокСобытийПоФильтру(Кэш, filter, ГлавноеОкно) Экспорт
	
	ПараметрыСписка = Новый Структура;
	Если ЗначениеЗаполнено(filter) Тогда
		ПараметрыСписка.Вставить("Фильтр", filter);
	КонецЕсли;
	
	Возврат МодульОбъектаКлиент().ПолучитьСписокДокументовПоСобытиямСБИС(ПараметрыСписка);
	
КонецФункции

// Устарел. Использовать МодульОбъектаКлиент().ПолучитьСписокДокументовСБИС()
&НаКлиенте
Функция СбисПолучитьСписокДокументов(Кэш) Экспорт
	
	Возврат МодульОбъектаКлиент().ПолучитьСписокДокументовСБИС();
	
КонецФункции

// Получает список документов определенного типа с online.saby.ru	
&НаКлиенте
Функция СбисПолучитьСписокЗадач(Кэш, сбисФильтр, Отказ) Экспорт
	ДопПараметрыЗапроса = Новый Структура("ЕстьРезультат", Истина);
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "getTaskList", сбисФильтр, ДопПараметрыЗапроса, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат, "ExtSDK.сбисПолучитьСписокЗадач");
	КонецЕсли;
	Возврат Результат
КонецФункции

////////////////////////////////////////////////////
/////////////////Чтение документов//////////////////
////////////////////////////////////////////////////

//Метод устарел, вместо него использовать МодульОбъектаКлиент.ПрочитатьДокументСБИС
&НаКлиенте
Функция ПрочитатьДокумент(Кэш, ИдДок, ДопПараметры=Неопределено, Отказ=Ложь) Экспорт
	
	ОписаниеДокумент = Новый ФиксированнаяСтруктура("Идентификатор", ИдДок);

	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;

	Попытка
		
		оДокумент = МодульОбъектаКлиент().ПрочитатьДокументСБИС(ОписаниеДокумент, ДопПараметры);
		
	Исключение
		
		ИмяИнтерации	= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ИнтеграцияИмя");
		МодульОбъектаКлиент().СбисСообщить(ИнформацияОбОшибке(), ИмяИнтерации + ".ПрочитатьДокумент");
		Отказ = Истина;
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат оДокумент;
	
КонецФункции

//Получает html по xml	
&НаКлиенте
функция ПолучитьHTMLПоXML(Кэш, Вложение) экспорт
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат", Истина);
	
	Если ТипЗнч(Вложение) = Тип("Структура") Тогда
		document = Новый Структура("XML", Вложение.XMLДокумента);
	Иначе   // для совместимости с внешними функциями (СформироватьРасхождение)
		document = Новый Структура("XML", Вложение);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(document) Тогда
		Возврат "";
	КонецЕсли;
	
	РезультатЗапроса = сбисОтправитьИОбработатьКоманду(Кэш, "GenerateHTMLFromXML", document, ДопПараметрыЗапроса,Отказ);
	Если Отказ Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат РезультатЗапроса.HTML;
КонецФункции

//Проверка подписей на вложении	
&НаКлиенте
Функция ПроверитьПодписиВложения(Кэш,Вложение) экспорт
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура;
	
	Если Вложение.Свойство("Подпись") Тогда
		Для Каждого Подпись из Вложение.Подпись Цикл
			ФайлПодписи = сбисПолучитьФайл(Кэш, Подпись.Файл.Ссылка);
			Если ФайлПодписи = Ложь Тогда
				Продолжить;
			КонецЕсли;
			
			ДвоичныеДанныеПодписи = Новый ДвоичныеДанные(ФайлПодписи);
			Подпись.Файл.Вставить("ДвоичныеДанные",СтрЗаменить(СтрЗаменить(Base64Строка(ДвоичныеДанныеПодписи),Символы.ПС,""),Символы.ВК,""));
			
			Попытка
				УдалитьФайлы(ФайлПодписи);
			Исключение
			КонецПопытки;
		КонецЦикла;
		СбисОтправитьИОбработатьКоманду(Кэш, "CheckSignatures", Вложение, ДопПараметрыЗапроса, Отказ);
	КонецЕсли;
	Возврат Не Отказ;
КонецФункции

//Получает html по идентификаторам пакета и вложения
//Используется при просмотре документов из реестров СБИС
&НаКлиенте
функция ПолучитьHTMLВложения(Кэш,ИдДок, Вложение) экспорт
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура("СообщатьПриОшибке, ВернутьОшибку", Ложь, Истина);
	
	Если Вложение.Зашифрован = "Да" Тогда
		Вложение.Вставить("ПодписьШтамп", ПолучитьПараметрыШтампа(Вложение));
	КонецЕсли;
	Парам = Новый Массив;
	document = Новый Структура();
	document.Вставить("Идентификатор",ИдДок);
	ext_document = Новый Структура;
	ext_document.Вставить("Зашифрован", Вложение.Зашифрован);
	ext_document.Вставить("Тип", Вложение.Тип);
	ext_document.Вставить("Подтип", Вложение.Подтип);
	ext_document.Вставить("ВерсияФормата", Вложение.ВерсияФормата);
	Если Вложение.Свойство("ПодВерсияФормата") и ЗначениеЗаполнено(Вложение.ПодВерсияФормата) Тогда
		ext_document.Вставить("ПодВерсияФормата", Вложение.ПодВерсияФормата);
	КонецЕсли;
	Если Вложение.Свойство("ПодписьШтамп") и ЗначениеЗаполнено(Вложение.ПодписьШтамп) Тогда
		ext_document.Вставить("ПодписьШтамп", Вложение.ПодписьШтамп);
	КонецЕсли;
	ext_document.Вставить("СсылкаНаHTML", Вложение.СсылкаНаHTML);
	ext_document.Вставить("Файл", Вложение.Файл);
	document.Вставить("Вложение",ext_document);
	
	РезультатЗапроса = Кэш.Интеграция.СБИС_ПрочитатьДокументКакHTML(Кэш, document, ДопПараметрыЗапроса,Отказ);
	Если Отказ Тогда
		Если	Вложение.Зашифрован = "Да"
			Или	(	ЗначениеЗаполнено(Вложение.СсылкаНаHTML) 
				И	Вложение.Зашифрован = "Нет") Тогда
			Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, РезультатЗапроса);
		КонецЕсли;
		Возврат "";
	КонецЕсли;
	
	Возврат РезультатЗапроса.HTML;
КонецФункции

////////////////////////////////////////////////////
//////////////////Действия и операции///////////////
////////////////////////////////////////////////////

//Обрабатывает служебные документы организации	
&НаКлиенте
Функция ОбработатьСлужебныеДокументыОрганизации(Кэш, оОрганизация)
	Отказ				= Ложь;
	МестныйКэш			= Кэш;
	ГлавноеОкно			= Кэш.ГлавноеОкно;
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат", Истина);
	
	param   = Новый Структура;
	Орг = оОрганизация;
	org = Новый Структура; 
	Если Орг.Свойство("СвФЛ") Тогда
		СвФЛ = Новый Структура;
		СвФЛ.Вставить( "ИНН", Орг.СвФЛ.ИНН); 
		org.Вставить( "СвФЛ", СвФЛ );	
	Иначе
		СвЮЛ = Новый Структура;
		СвЮЛ.Вставить( "ИНН", Орг.СвЮЛ.ИНН ); 
		СвЮЛ.Вставить( "КПП", Орг.СвЮЛ.КПП );
		Если Орг.СвЮЛ.Свойство("КодФилиала") и ЗначениеЗаполнено(Орг.СвЮЛ.КодФилиала) Тогда
			СвЮЛ.Вставить( "КодФилиала", Орг.СвЮЛ.КодФилиала );	
		КонецЕсли;
		org.Вставить( "СвЮЛ", СвЮЛ );
	КонецЕсли;
	param.Вставить("НашаОрганизация",org);
	
	сбисПоказатьСостояние("Обработка служебных документов "+оОрганизация.Название,ГлавноеОкно);
	ИнформацияПоНеобработанным = Кэш.Интеграция.СБИСПлагин_ИнформацияОСлужебныхЭтапах(Кэш, param, ДопПараметрыЗапроса, Отказ);
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Всего = Число(ИнформацияПоНеобработанным.ЧислоНеобработанныхЭтапов);
	
	Если Всего>0 Тогда
		ЕстьНеобработанныеИзвещения = "Да";
		Обработано = 0;
		ПодключитьОбработчикОжидания("сбисПрерываниеПользователем",0.1,Истина);
		Пока ЕстьНеобработанныеИзвещения = "Да" Цикл
			Результат = Кэш.Интеграция.СБИСПлагин_ОбработкаСлужебныхЭтапов(Кэш, param, ДопПараметрыЗапроса, Отказ);
			Если Отказ Тогда
				Возврат Ложь;
			КонецЕсли;
			
			ЕстьНеобработанныеИзвещения = Результат.ЕстьНеобработанныеЭтапы;
			ОбработаноЗаИтерацию = Число(Результат.ОбработаноЭтапов);
			Обработано = Обработано + ОбработаноЗаИтерацию;
			
			сбисПоказатьСостояние("Обработка служебных документов "+оОрганизация.Название,ГлавноеОкно,Мин(100,Окр(Обработано*100/Всего)), "(прервать -  Ctrl+Break)");
			
			Если ОбработаноЗаИтерацию=0 и ЕстьНеобработанныеИзвещения = "Да" Тогда     // Необработанные есть, но обработать по какой-то причине не можем
				Прервать;
			КонецЕсли;
			ОбработкаПрерыванияПользователя();
		КонецЦикла;
		ОтключитьОбработчикОжидания("сбисПрерываниеПользователем");
		ГлавноеОкно.сбисСпрятатьСостояние(ГлавноеОкно);
	КонецЕсли;
	Возврат Истина;
КонецФункции

//Обрабатывает служебные по одному пакету
&НаКлиенте
Функция ОбработатьСлужебныеДокументыПоПакету(Кэш, СоставПакета) Экспорт
	Отказ				= Ложь;
	МестныйКэш			= Кэш;
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат", Истина);
	
	Парам   = Новый Структура;
	Парам.Вставить("ИдентификаторДокумента",СоставПакета.Идентификатор);
	
	ИнформацияПоНеобработанным = Кэш.Интеграция.СБИСПлагин_ИнформацияОСлужебныхЭтапах(Кэш, Парам, ДопПараметрыЗапроса, Отказ);
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Всего = Число(ИнформацияПоНеобработанным.ЧислоНеобработанныхЭтапов);
	
	Если Всего>0 Тогда
		ДопПараметрыЗапроса = Новый Структура;
		Кэш.Интеграция.СБИСПлагин_ОбработкаСлужебныхЭтапов(Кэш, Парам, ДопПараметрыЗапроса, Отказ);
		Если Отказ Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
КонецФункции

//Отправляет каталог товаров в СБИС	
&НаКлиенте
функция ОтправитьКаталогТоваров(Кэш,КаталогТоваров) экспорт
	Отказ				= Ложь;
	МестныйКэш			= Кэш;
	
	param = Новый Структура;
	param.Вставить( "Файл", сбисСтрокаВBASE64(КаталогТоваров, "UTF-16") ); 
	//Выполняем метод и не ждём ответа. Если вызов упал, то сообщить
	ДопПараметры = Новый Структура("СообщатьПриОшибке, ВернутьОшибку, ПолучитьОтвет", Ложь, Истина, Ложь);
	РезультатОтправки = Кэш.Интеграция.СБИСПлагин_ИмпортНоменклатурыИзCML(Кэш, param, ДопПараметры, Отказ);
	Если Отказ Тогда
		Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, РезультатОтправки);
	КонецЕсли;
	Возврат Не Отказ;
КонецФункции

//// v8unpack &НаКлиенте
//Функция сбисЭмитироватьКМ(Кэш, ИдДок, ДополнительныеПараметры=Неопределено, Отказ=Ложь) Экспорт
//	Отказ				= Ложь;
//	МестныйКэш			= Кэш;
//	
//	param = Новый Структура("url,method_name,method_params", Кэш.СБИС.АдресСервера+"/service/?srv=1", "СБИС.ЭмитироватьКМ", Новый Структура("Документ", Новый Структура("Идентификатор",ИдДок)));
//	Если ДополнительныеПараметры = Неопределено Тогда
//		ДополнительныеПараметры = Новый Структура;
//	КонецЕсли;
//	ДополнительныеПараметры.Вставить("ЕстьРезультат", Истина);
//	
//	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "callBLObjectEx2", param, ДополнительныеПараметры, Отказ);
//	Если Отказ Тогда
//		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".сбисЭмитироватьКМ");
//	КонецЕсли;
//	Возврат Результат
//	
//КонецФункции

//// v8unpack &НаКлиенте
//Функция сбисЗарегистрироватьВГоссистеме(Кэш, ИдДок, ДополнительныеПараметры=Неопределено, Отказ=Ложь) Экспорт
//	Отказ				= Ложь;
//	МестныйКэш			= Кэш;
//	
//	param = Новый Структура("url,method_name,method_params", Кэш.СБИС.АдресСервера+"/service/?srv=1", "СБИС.ЗарегистрироватьВГоссистеме", Новый Структура("Документ", Новый Структура("Идентификатор",ИдДок)));
//	Если ДополнительныеПараметры = Неопределено Тогда
//		ДополнительныеПараметры = Новый Структура;
//	КонецЕсли;
//	ДополнительныеПараметры.Вставить("ЕстьРезультат", Истина);
//	
//	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "callBLObjectEx2", param, ДополнительныеПараметры, Отказ);
//	Если Отказ Тогда
//		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".сбисЗарегистрироватьВГоссистеме");
//	КонецЕсли;
//	Возврат Результат
//	
//КонецФункции
&НаКлиенте
Функция сбисЭмитироватьКМ(Кэш, ИдДок, ДополнительныеПараметры=Неопределено, Отказ=Ложь) Экспорт
	Отказ				= Истина;
	Сообщить("Функционал доступен только для способов обмена ""extSDK2"" и ""API"". Способ обмена можно изменить на вкладке ""Настройки"".");
	Возврат Ложь;
КонецФункции

&НаКлиенте
Функция сбисЗарегистрироватьВГоссистеме(Кэш, ИдДок, ДополнительныеПараметры=Неопределено, Отказ=Ложь) Экспорт
	Отказ				= Истина;
	Сообщить("Функционал доступен только для способов обмена ""extSDK2"" и ""API"". Способ обмена можно изменить на вкладке ""Настройки"".");
	Возврат Ложь;
КонецФункции

//Получает Информацию о контрагенте с онлайна
&НаКлиенте
Функция ПолучитьИнформациюОКонтрагенте(Кэш, СтруктураКонтрагента) Экспорт
	Отказ				= Ложь;
	МестныйКэш			= Кэш;
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат", Истина);
	
	kontr = Новый Структура; 
	Если СтруктураКонтрагента.Свойство("СвФЛ") Тогда
		kontr.Вставить( "СвФЛ", СтруктураКонтрагента.СвФЛ );	
	Иначе
		kontr.Вставить( "СвЮЛ", СтруктураКонтрагента.СвЮЛ );
	КонецЕсли;
	
	оКонтрагент = СбисОтправитьИОбработатьКоманду(Кэш, "ReadContragentInfo", kontr, ДопПараметрыЗапроса, Отказ);
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат оКонтрагент;
КонецФункции

//Расшифровывает данные файла вложения	
&НаКлиенте
Функция РасшифроватьДанныеФайла(Кэш, ИмяФайла) Экспорт
	Отказ				= Ложь;
	ГлавноеОкно			= Кэш.ГлавноеОкно;
	ДопПараметрыЗапроса	= Новый Структура("СообщатьПриОшибке, ВернутьОшибку, ЕстьРезультат", Ложь, Истина, Истина);
	
	ДД_Файла	= Новый ДвоичныеДанные(ИмяФайла);
	СтрокаBase64= СтрЗаменить(СтрЗаменить(Base64Строка(ДД_Файла),Символы.ПС,""),Символы.ВК,"");
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
	КонецПопытки;
	
	ПараметрыЗапроса = Новый Структура("encrypted_data", СтрокаBase64);
	
	Результат = Кэш.Интеграция.СБИС_РасшифроватьФайл(Кэш, ПараметрыЗапроса, ДопПараметрыЗапроса, Отказ);
	
	Если Отказ Тогда
		
		МодульОбъектаКлиент = МодульОбъектаКлиент();
		// Если в кэше стоит отлов ошибок расшиврофки, то сообщить сразу и вернуть пустое значение для совемстимости старой логики
		Если	Кэш.Свойство("ЕстьОшибкиРасшифровки") Тогда
			
			Если Кэш.ЕстьОшибкиРасшифровки = Ложь Тогда
				
				// сообщаем об ошибке один раз на весь пакет, а не на каждое вложение
				ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, Результат);
				
			КонецЕсли;
			
			Кэш.ЕстьОшибкиРасшифровки = Истина;

			Возврат ""; 
			
		Иначе
			
			// Флага нет, просто прокинуть ошибку в общем режиме
			ИмяИнтеграции		= МодульОбъектаКлиент.ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
			ОшибкаРасшифровки	= МодульОбъектаКлиент.НовыйСбисИсключение(Результат, ИмяИнтеграции + ".РасшифроватьДанныеФайла");
			ВызватьИсключение МодульОбъектаКлиент.СбисИсключение_Выгрузить(ОшибкаРасшифровки);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

//Выполняет указанное действие по документу СБИС
&НаКлиенте
Функция СбисВыполнитьДействие(Кэш, СоставПакета, Этап, Действие, Комментарий, ПредставлениеПакета) Экспорт
	Перем Сертификат;
	МодульТекущий = МодульОбъектаКлиент();
	МестныйКэш = Кэш;
	Отказ = Ложь;
	
	ПараметрыВыполнить = Новый Структура("СоставПакета, Этап, Действие, Комментарий, ПредставлениеПакета, Сертификат", СоставПакета, Этап, Действие, Комментарий, ПредставлениеПакета, Сертификат);
	Если Действие.ТребуетПодписания = "Да" Тогда
		
		Попытка
			
			СведенияОСертификате = МодульОбъектаКлиент().СведенияСертификатаДляДействияСДокументомСБИС(ПараметрыВыполнить);
			
		Исключение
			
			ОшибкаСертификата = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), Кэш.ИнтеграцияИмя + ".СбисВыполнитьДействие");
			Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ТихийРежим") Тогда
				
				ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(ОшибкаСертификата);
				
			КонецЕсли;
			МодульОбъектаКлиент().СбисСообщить(ОшибкаСертификата);
			Возврат Ложь;
			
		КонецПопытки;
		
		ПараметрыВыполнить.Вставить("Сертификат", СведенияОСертификате.Сертификат);
		Если СведенияОСертификате.Свойство("Алгоритм") Тогда
			
			ПараметрыВыполнить.Вставить("СертификатДляПодписания",	СведенияОСертификате.ДвоичныеДанные);
			ПараметрыВыполнить.Вставить("Алгоритм",					СведенияОСертификате.Алгоритм);
			
		КонецЕсли;
		
	КонецЕсли;

	ОбработатьСлужебныеДокументыПоПакету(Кэш, СоставПакета);

    //ПараметрыВыполнить = Новый Структура("СоставПакета, Этап, Действие, Комментарий, Сертификат", СоставПакета, Этап, Действие, Комментарий, Сертификат);
	Попытка
		
		МодульОбъектаКлиент().ВыполнитьДействиеСДокументомСБИС(ПараметрыВыполнить);
		
	Исключение
		Если МодульТекущий.ПолучитьЗначениеПараметраСБИС("ТихийРежим") Тогда
			
			ОшибкаВыполнитьДействие = МодульТекущий.НовыйСбисИсключение(ИнформацияОбОшибке(), Новый Структура("ИмяКоманды", Кэш.ИнтеграцияИмя + ".СбисВыполнитьДействие"));
			ВызватьИсключение МодульТекущий.СбисИсключение_Выгрузить(ОшибкаВыполнитьДействие);
			
		Иначе
			
			Отказ = Истина;
			МодульТекущий.СообщитьСбисИсключение(ИнформацияОбОшибке(), Новый Структура("ИмяКоманды", Кэш.ИнтеграцияИмя + ".СбисВыполнитьДействие"));
			
		КонецЕсли;
		
	КонецПопытки;
	
	Возврат Не Отказ;	

КонецФункции

//Заглушка, подписание в СБИС Плагине
&НаКлиенте
Функция сбисПодписатьВложения(Кэш, attachmentList, ПараметрыДействия, Отказ) Экспорт 
	Возврат Ложь;
КонецФункции

// Переводит документ повторно на ранее выполненный этап
&НаКлиенте
Функция СбисПовторитьЭтап(Кэш, ИдДок, ЭтапНазвание, Отказ=Ложь) Экспорт
	Отказ				= Ложь;
	МестныйКэш			= Кэш;
	
	ПараметрыКоманды = Новый Структура("Документ", Новый Структура("Идентификатор,Этап",ИдДок, Новый Структура("Название", ЭтапНазвание)));
	ДопПараметрыЗапроса = Новый Структура("ЕстьРезультат, СообщатьПриОшибке", Истина, Истина);
	
	оДокумент = сбисОтправитьИОбработатьКоманду(Кэш, "RepeatStage", ПараметрыКоманды, ДопПараметрыЗапроса,Отказ);
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат оДокумент;
КонецФункции

//Функция вызывает отправку на СБИС диск файл кусками. Вовзращает ид загрузки файла по которому придёт событие о завершении
&НаКлиенте
Функция ОтправитьФайлНаСбисДиск(Кэш, ПолноеИмяФайла, ДопПараметры, Отказ)
	
	AccountID =	СтрПолучитьСтроку(СтрЗаменить(Кэш.Парам.ИдентификаторСессии, "-", Символы.ПС), 2) + "@" +
				СтрЗаменить(Сред(Кэш.СБИС.АдресСервера, Найти(Кэш.СБИС.АдресСервера, ":")+1), "/", "");
	лПараметрыЗапроса = Новый Структура;
	лПараметрыЗапроса.Вставить("fileName",			ПолноеИмяФайла);
	лПараметрыЗапроса.Вставить("targetURL",			Кэш.СБИС.АдресСервера + "disk/api/v1/temp");
	лПараметрыЗапроса.Вставить("AccountID",			AccountID); 
	лПараметрыЗапроса.Вставить("removeAfterUpload",	Ложь);
	лПараметрыЗапроса = Новый Структура("requestParams", Кэш.РаботаСJson.ПреобразоватьЗначениеВJSON(лПараметрыЗапроса));
	//Если обработчик ответа не передан извне, то сделаем по-умолчанию, для отправки
	ДополнительныеПараметрыВызова = Новый Структура("Аккаунт, Модуль, ВремяОжиданияОтвета, События", AccountID, "FileLoader", ДопПараметры.ВремяОжиданияОтвета);
	Если Не ДопПараметры.Свойство("События", ДополнительныеПараметрыВызова.События) Тогда
		//Подписка на событие загрузчика по типу. Можно сделать события по-умолчанию, но пока только передача извне.
		Отказ = Истина;
		Возврат Кэш.ОбщиеФункции.СбисИсключение(,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".UploadToSbisDisk", 700,,"Отсутствует описание событий для вызова асинхронной функции!");
		//СбисПараметрыСобытия = Новый Структура("Кэш, Параметры", Кэш, ДопПараметры);
		//СбисОбработчикиСобытий = Новый Структура;
		//СбисОбработчикиСобытий.Вставить("UploadToSbisDiskCompleteEvent",	Новый Структура("Параметры", СбисПараметрыСобытия));
		//СбисОбработчикиСобытий.Вставить("UploadToSbisDiskFatalErrorEvent",Новый Структура("Параметры", СбисПараметрыСобытия));
		//СбисОбработчикиСобытий.Вставить("НеПолученОтвет",					Новый Структура("Параметры", СбисПараметрыСобытия));
	КонецЕсли;
	//Отправляем загрузку на вызов, подписываем на обработку результата. 
	//Не используем штатный механизм, так как ИД подписки будет ИД чтения событий, который сперва надо прочитать.
	
	//СБИС3Команда = СБИСПлагин_Команда(Кэш, "uploadToSbisDisk", лПараметрыЗапроса,ДополнительныеПараметрыВызова, Отказ);
	//Если Отказ Тогда
	//	Возврат Кэш.ОбщиеФункции.СбисИсключение(СБИС3Команда,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".UploadToSbisDisk");
	//КонецЕсли;
	//
	//РезультатВызова = СБИСПлагин_ВыполнитьМетод(Кэш, СБИС3Команда, ДополнительныеПараметрыВызова, Отказ);
	//Если Отказ Тогда
	//	Возврат Кэш.ОбщиеФункции.СбисИсключение(РезультатВызова,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".UploadToSbisDisk");
	//КонецЕсли;
	//
	//РезультатВызова = СБИСПлагин_ПолучитьОтвет_Синхронно(Кэш, СБИС3Команда, ДополнительныеПараметрыВызова, Отказ);
	//Если Отказ Тогда
	//	Возврат Кэш.ОбщиеФункции.СбисИсключение(РезультатВызова,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".UploadToSbisDisk");
	//КонецЕсли;
	//
	//РезультатВызова = СБИСПлагин_ОбработатьРезультат_Синхронно(Кэш, РезультатВызова, ДополнительныеПараметрыВызова, Отказ);
	//Если Отказ Тогда
	//	Возврат Кэш.ОбщиеФункции.СбисИсключение(РезультатВызова,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".UploadToSbisDisk");
	//КонецЕсли;
	//
	//СБИСПлагин_ЗанятьПоток(Кэш, РезультатВызова, СБИС3Команда);
	//Возврат РезультатВызова;

КонецФункции

//Сохраняет вложение по ссылке со сбисДиск в указанный файл
&НаКлиенте
Функция СохранитьВложениеПоСсылкеВФайл(Кэш,Ссылка,ИмяФайла) Экспорт
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат", Истина);
	
	ПараметрыЗаписи = Новый Структура("uri_in, filename_in", Ссылка, ИмяФайла);
	
	Результат = сбисОтправитьИОбработатьКоманду(Кэш, "LoadDataFromURIToFile2", ПараметрыЗаписи, ДопПараметрыЗапроса, Отказ);
	Если Отказ Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

////////////////////////////////////////////////////
//////////////Сотрудники////////////////////////////
////////////////////////////////////////////////////

&НаКлиенте
функция сбисЗаписатьСотрудников(Кэш, ДанныеСотрудников, Отказ) Экспорт
	// функция активирует серверные сертификаты для определенного списка ИНН	
	ДопПараметрыЗапроса = Новый Структура("СообщатьПриОшибке, ВернутьОшибку", Ложь, Истина);
	РезультатОтправки = Новый Структура("ТипыОшибок,Отправлено,НеОтправлено,НеСформировано,Ошибок,ДетализацияОшибок,ВсегоПакетов, Успешные", Новый СписокЗначений,0,0,0,0, Новый Соответствие,ДанныеСотрудников.Количество(), Новый Массив);
	Для Каждого Элемент Из ДанныеСотрудников Цикл
		Отказ = Ложь;
		РезультатЗапроса = Кэш.Интеграция.СБИСПлагин_ЗаписатьСотрудника(Кэш, Элемент.Значение, ДопПараметрыЗапроса, Отказ);
		Если Отказ Тогда 
			РезультатОтправки.Ошибок = РезультатОтправки.Ошибок + 1;
			// TODO убрать после обертки ошибки в плагине
			Если Лев(РезультатЗапроса.message, 18) = "Неизвестная ошибка" и Лев(РезультатЗапроса.details, 30) = "В справочнике ролей не найдены" Тогда
				РезультатЗапроса.message = "В справочнике ролей не найдены роли";
			КонецЕсли;
			ТекстОшибки = РезультатЗапроса.message;
			ЭлементСписка = РезультатОтправки.ТипыОшибок.НайтиПоЗначению(ТекстОшибки);
			Если ЭлементСписка=Неопределено Тогда
				РезультатОтправки.ТипыОшибок.Добавить(ТекстОшибки, 1);
			Иначе
				ЭлементСписка.Представление = Число(ЭлементСписка.Представление)+1;
			КонецЕсли;
			ЭлементСоответствия = РезультатОтправки.ДетализацияОшибок.Получить(ТекстОшибки);
			Если ЭлементСоответствия=Неопределено Тогда
				ЭлементСоответствия = Новый Массив;
				РезультатОтправки.ДетализацияОшибок.Вставить(ТекстОшибки, ЭлементСоответствия);
			КонецЕсли;
			СтрокаВСоответствие = Новый Структура("ОбработанДокумент1С,Сообщение,СтруктураОшибки", Элемент.Ключ, РезультатЗапроса.details, Новый Структура("message,details,code", ТекстОшибки, РезультатЗапроса.details, РезультатЗапроса.code));
			ЭлементСоответствия.Добавить(СтрокаВСоответствие);
		Иначе			
			РезультатОтправки.Отправлено = РезультатОтправки.Отправлено + 1;
			РезультатОтправки.Успешные.Добавить(РезультатЗапроса);
		КонецЕсли;
	КонецЦикла;
	Возврат РезультатОтправки;
КонецФункции

////////////////////////////////////////////////////
//////////////Серверные настройки вызов/////////////
////////////////////////////////////////////////////

&НаКлиенте
Функция ПолучитьXslt(Кэш, ПараметрыМетода, ДопПараметрыЗапроса, Отказ) Экспорт
	
	Если Не ДопПараметрыЗапроса.Свойство("СообщатьПриОшибке") Тогда
		ДопПараметрыЗапроса.Вставить("СообщатьПриОшибке",	Ложь);
	КонецЕсли;
	
	ДопПараметрыЗапроса.Вставить("ЕстьРезультат",		Истина);
	ДопПараметрыЗапроса.Вставить("ВернутьОшибку",		Истина);
	ДопПараметрыЗапроса.Вставить("АдресРесурса",		"/int-settings/service/");
	
	
	ПараметрыЗапроса = Новый Структура();
	Если ТипЗнч(ПараметрыМетода) = Тип("Структура")	И ПараметрыМетода.Свойство("НазваниеXSLT") Тогда
		ПараметрыЗапроса.Вставить("mask", ПараметрыМетода.НазваниеXSLT	+ ".sbis3.xslt");
	ИначеЕсли ТипЗнч(ПараметрыМетода) = Тип("Строка") Тогда
		ПараметрыЗапроса.Вставить("mask", ПараметрыМетода				+ ".sbis3.xslt");
	Иначе
		// Оставляем пустым и получаем весь список XSLT
		ПараметрыЗапроса.Вставить("mask", "*.xslt");
	КонецЕсли;
	
	Результат = СбисОтправитьИОбработатьКомандуCallIntegrationApi(Кэш, "API301.FindXSLT", ПараметрыЗапроса, ДопПараметрыЗапроса, Отказ);
	
	Если Отказ Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Кэш.РаботаСJson.СбисПрочитатьJSON(Результат);
	Если Результат.Свойство("error") Тогда
		Отказ = Истина;
		ИнтеграцияИмя  = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя");
		Результат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат,  ИнтеграцияИмя + " (API301.FindXSLT)", 770, Результат.error.message);
	ИначеЕсли Результат.Свойство("data") Тогда
		Результат = Результат.data;
	Иначе
		// Возвращаем, как есть
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьИни(Кэш, ИмяМетода, ПараметрыМетода, ДопПараметрыЗапроса, Отказ) Экспорт
	ДопПараметрыЗапроса.Вставить("СообщатьПриОшибке",	Ложь);
	ДопПараметрыЗапроса.Вставить("ВернутьОшибку",		Истина);
	Возврат сбисОтправитьИОбработатьКоманду(Кэш, ИмяМетода, ПараметрыМетода, ДопПараметрыЗапроса, Отказ)
КонецФункции

&НаКлиенте
Функция ЗаписатьConnection(Кэш, ПараметрыМетода, ДопПараметрыЗапроса, Отказ) Экспорт
	ДопПараметрыЗапроса.Вставить("СообщатьПриОшибке",	Ложь);
	ДопПараметрыЗапроса.Вставить("ВернутьОшибку",		Истина);
	Возврат сбисОтправитьИОбработатьКоманду(Кэш, "WriteConnection", ПараметрыМетода, ДопПараметрыЗапроса, Отказ)
КонецФункции

&НаКлиенте
Функция ПолучитьСписокConnection(Кэш, ПараметрыМетода, ДопПараметрыЗапроса, Отказ) Экспорт
	ДопПараметрыЗапроса.Вставить("СообщатьПриОшибке",	Ложь);
	ДопПараметрыЗапроса.Вставить("ВернутьОшибку",		Истина);
	Возврат сбисОтправитьИОбработатьКоманду(Кэш, "ReadConnectionList", ПараметрыМетода, ДопПараметрыЗапроса, Отказ)
КонецФункции

&НаКлиенте
Функция ПолучитьСписокConfig(Кэш, ПараметрыМетода, ДопПараметрыЗапроса, Отказ) Экспорт
	ДопПараметрыЗапроса.Вставить("СообщатьПриОшибке",	Ложь);
	ДопПараметрыЗапроса.Вставить("ВернутьОшибку",		Истина);
	Возврат сбисОтправитьИОбработатьКоманду(Кэш, "ReadConfigList_v2", ПараметрыМетода, ДопПараметрыЗапроса, Отказ)
КонецФункции

////////////////////////////////////////////////////
//////////////////Статистика вызов//////////////////
////////////////////////////////////////////////////

//Отправляет собщение о статистике на online
&НаКлиенте
Функция сбисОтправитьСообщениеСтатистики(Кэш, СообщениеСтатистики, Отказ) Экспорт
	ДопПараметры = Новый Структура("ВернутьОшибку", Истина);
	Возврат сбисОтправитьИОбработатьКоманду(Кэш, "WriteStat", СообщениеСтатистики, ДопПараметры, Отказ);
КонецФункции

//Отправляет собщение о ошибке на online
&НаКлиенте
Функция сбисОтправитьСообщениеОшибки(Кэш, СообщениеОбОшибке, Отказ) Экспорт
	ДопПараметры = Новый Структура("СообщатьПриОшибке, ВернутьОшибку", Ложь, Истина);
	СообщениеОбОшибке.data = Кэш.РаботаСJson.ПреобразоватьЗначениеВJSON(СообщениеОбОшибке.data);
	Возврат сбисОтправитьИОбработатьКоманду(Кэш, "WriteError", СообщениеОбОшибке, ДопПараметры, Отказ);
КонецФункции

&НаКлиенте
Функция сбисПроверкаОбновления(Кэш, ИнформацияОТекущейВерсии, Отказ) Экспорт
	ДопПараметры = Новый Структура("ВернутьОшибку", Ложь);
	Возврат СбисОтправитьИОбработатьКомандуCallIntegrationApi(Кэш, "API3.GetProductVersionStatus", ИнформацияОТекущейВерсии, Новый Структура("ВернутьОшибку", Ложь), Отказ);
КонецФункции

////////////////////////////////////////////////////
//////////////////Системные команды/////////////////
////////////////////////////////////////////////////

//Ожидает получения ответа на вызов команды.
&НаКлиенте
Функция СБИСПлагин_ПолучитьОтвет_Синхронно(Кэш, СБИС3Команда, ДопПараметры, Отказ) Экспорт
	Перем Результат;
	ОжидаемыеКоманды = Новый Соответствие;
	ОжидаемыеКоманды.Вставить(СБИС3Команда.Идентификатор, СБИС3Команда);
	Результат = Неопределено;
	Пока Истина Цикл
		РезультатПолучения = СБИСПлагин_ЧтениеОтветовИВызовСобытий(Кэш, ОжидаемыеКоманды, ДопПараметры, Отказ);
		Если Отказ Тогда
			Возврат РезультатПолучения;
		КонецЕсли;
		Результат = РезультатПолучения.Получить(СБИС3Команда.Идентификатор);
		Если	Не Результат = Неопределено 				
			Или	Не СБИС3Команда.ВремяОжиданияОтвета Тогда 
			//Получен ответ на запрос, или делаем один проход на чтение	
			Прервать;
		ИначеЕсли ТекущаяДата() - СБИС3Команда.ВремяВызова > СБИС3Команда.ВремяОжиданияОтвета Тогда
			//Установленный на команде таймаут
			Отказ = Истина;
			Результат = МодульОбъектаКлиент().НовыйСбисИсключение(775101,"ExtSDK.СБИСПлагин_ПолучитьОтвет_Синхронно",,,
			"Нам не удалось получить ответ от плагина в течении " + Строка(СБИС3Команда.ВремяОжиданияОтвета) + " секунд");
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СбисОтправитьИОбработатьКомандуCallIntegrationApi(Кэш, Метод, ПараметрыМетода=Неопределено, ДопПараметры,Отказ) Экспорт
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("method", Метод);
	ПараметрыВызова.Вставить("param", ПараметрыМетода);
	Возврат Кэш.СБИС.ДанныеИнтеграции.Объекты.Форма_ExtSDK.СбисОтправитьИОбработатьКоманду(Кэш, "CallIntegration", ПараметрыВызова, ДопПараметры,Отказ);
КонецФункции

//Добавляет СБИСПлагин в Кэш	
&НаКлиенте
Функция Включить(Кэш, ДопПараметры=Неопределено, Отказ=Ложь) Экспорт

	СведенияОбИнтеграции	= СведенияОбИнтеграции();
	ПараметрыВключения		= СведенияОбИнтеграции.Параметры;
	
	Если ЗначениеЗаполнено(ДопПараметры) Тогда 
		ЗаполнитьЗначенияСвойств(ПараметрыВключения, ДопПараметры);
	КонецЕсли; 
	МодульОбъектаКлиент().ИзменитьПараметрТекущегоСеанса("СведенияОбИнтеграции", СведенияОбИнтеграции);
	
	МодульОбъектаКлиент().ИзменитьПараметрСбис("Отправка_РазмерПачки",			ПараметрыВключения.КоличествоПотоков);
	МодульОбъектаКлиент().ИзменитьПараметрСбис("Потоки_МаксимальноеКоличество",	ПараметрыВключения.КоличествоПотоков);
	МодульОбъектаКлиент().ИзменитьПараметрСбис("Потоки_КоличествоСвободных",	ПараметрыВключения.КоличествоПотоков);
	МодульОбъектаКлиент().ИзменитьПараметрСбис("ВремяОжиданияОтвета_Отправка",	ПараметрыВключения.ВремяОжиданияОтвета_Отправка);
	МодульОбъектаКлиент().ИзменитьПараметрСбис("ИмяВнешнегоМодуля",				ПараметрыВключения.ИмяВнешнегоМодуля);
	
	СведенияОбИнтеграции = СведенияОбИнтеграции();
	Для Каждого ПараметрИнтеграции Из СведенияОбИнтеграции.Параметры Цикл
		
		МодульОбъектаКлиент().ИзменитьПараметрСбис(ПараметрИнтеграции.Ключ, ПараметрИнтеграции.Значение);
		
	КонецЦикла;

	Результат = ВключитьExtSDK(Кэш,ПараметрыВключения,Отказ);
	
	Возврат СбисОценитьРезультатВключения(Кэш, Результат, ДопПараметры, Отказ);
	
КонецФункции

// Функция - Сведения об интеграции
// 
// Возвращаемое значение:
//  Структура - параметры интеграции по-умолчанию
//
&НаКлиенте
Функция СведенияОбИнтеграции() Экспорт

	ЛокальныйКэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	
	ПараметрыИнтеграции = Новый Структура;
	ПараметрыИнтеграции.Вставить("ГенераторФЭД",				Истина);
	ПараметрыИнтеграции.Вставить("Шифрование",					Ложь);
	ПараметрыИнтеграции.Вставить("МногопоточныйРежим",			Истина);
	ПараметрыИнтеграции.Вставить("ДоступныСерверныеНастройки",	Истина);
	//Ставим время по-умолчанию 60 секунд. Меняется при наличии одноименного узла в сбисПараметрах при установке настроек.	
	//Ставим время на отправку по-умолчанию 120 секунд. После меняется при наличии одноименного узла в сбисПараметрах при установке настроек.
	ПараметрыИнтеграции.Вставить("ВремяОжиданияОтвета",			60);
	ПараметрыИнтеграции.Вставить("ВремяОжиданияОтвета_Отправка",120);
	ПараметрыИнтеграции.Вставить("КоличествоПотоков",			10);
	ПараметрыИнтеграции.Вставить("ИмяКоннкетора",				"1c-extsdk2");
	Если ЛокальныйКэш.ГлавноеОкно.ПараметрыФормы = Неопределено Тогда
		ПараметрыИнтеграции.Вставить("ВключитьВО3",				Ложь);
	Иначе     
		ПараметрыИнтеграции.Вставить("ВключитьВО3",				ЛокальныйКэш.ГлавноеОкно.ПараметрыФормы.ДоступностьВО3);	
	КонецЕсли;	
	ПараметрыИнтеграции.Вставить("СтатусыВРазрезеРегламента",	Ложь);
	ПараметрыИнтеграции.Вставить("ВстроеннаяКриптография",		Ложь);// Используется криптография 1С
	ПараметрыИнтеграции.Вставить("ИмяВнешнегоМодуля",			"ExtSdk");// Имя для вызовов плагин
	ПараметрыИнтеграции.Вставить("ИмяВнутреннегоМодуля",		"ExtSDK");// Имя для поиска функций вызова
	
	СведенияОбИнтеграцииСБИС = Новый Структура("Имя, Параметры, Версия", "ExtSDK", ПараметрыИнтеграции);
	
	Возврат СведенияОбИнтеграцииСБИС;
	
КонецФункции

&НаКлиенте
Функция ВключитьExtSDK(Кэш,ДопПараметры,Отказ)
	Перем  ExtSDK1_ID;
	ОжиданиеОтвета = 10;//На время включения, ответ от плагина должен приходить быстро

	РезультатЗапроса = ПолучитьМодульИнтеграции(Кэш,ДопПараметры,Отказ);
	Если Отказ Тогда
		Возврат РезультатЗапроса;
	КонецЕсли;
	
	Кэш.СБИС.ОбменВключен = Истина;//Переключим обмен для вызова CallMethod
	Если Не Кэш.СБИС.ДанныеИнтеграции.Свойство("ExtSdk1", ExtSDK1_ID) Тогда
		ExtSDK1_ID = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	Парам				= Новый Структура("id", ExtSDK1_ID);
	ДопПараметры_EXT	= Новый Структура("ЕстьРезультат,ВернутьОшибку,СообщатьПриОшибке,ВремяОжиданияОтвета", Истина, Истина, Ложь, ОжиданиеОтвета);
	
	РезультатЗапроса = сбисОтправитьИОбработатьКоманду(Кэш, "getConnectionID", Парам, ДопПараметры_EXT, Отказ);
	Если Отказ Тогда
		Если РезультатЗапроса.code = 775 Тогда
			РезультатЗапроса.details = "Не удалось получить расширение ExtSdk. Возможно, Saby плагин не запущен.";
		КонецЕсли;
		Возврат РезультатЗапроса;
	КонецЕсли;
	ExtSDK1_ID = РезультатЗапроса;
	
	//Возьмём версию и проверим, что соответствует минимально допустимой
	РезультатЗапроса = сбисОтправитьИОбработатьКоманду(Кэш, "getVersion", , ДопПараметры_EXT, Отказ);
	Если Отказ Тогда
		Если РезультатЗапроса.code = 775 Тогда
			РезультатЗапроса.details = "Не удалось получить расширение ExtSdk. Возможно, Saby плагин не запущен.";
		КонецЕсли;
		Возврат РезультатЗапроса;
	КонецЕсли;

	ВерсияИнтеграции = РезультатЗапроса;
	
	Кэш.СБИС.ДанныеИнтеграции.Объекты.Вставить("ExtSdk1", ExtSDK1_ID);	
	
	МодульОбъектаКлиент().ИзменитьПараметрСбис("ОбменВключен",					Истина);
	МодульОбъектаКлиент().ИзменитьПараметрСбис("Версия",						ВерсияИнтеграции);
	

	Кэш.Плагин = ЭтаФорма;//Для сохранения совместимости со старым кодом
	
	СбисУстановитьПодпискиСбис3Плагина(Кэш);
	Возврат Кэш.СБИС.ОбменВключен;
	
КонецФункции

//Функция делает GetModule выбранной интеграции, устанавливает параметры работы
&НаКлиенте
Функция ПолучитьМодульИнтеграции(Кэш, ДопПараметры, Отказ) Экспорт
	Перем ExtSDK_ID, ОбъектПлагин, Т_ОбъектыИнтеграции;

	ОжиданиеОтвета		= 10;//На время включения, ответ от плагина должен приходить быстро
	НачДата				= ТекущаяДата();
	ОбъектыИнтеграции	= Новый Структура("Форма_ExtSDK", ЭтаФорма);
	
	СведенияОбИнтеграции	= МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("СведенияОбИнтеграции");
	ИмяИнтеграции			= СведенияОбИнтеграции.Имя;
	ИмяМодуляПолучить		= СведенияОбИнтеграции.Параметры.ИмяВнешнегоМодуля;
	Если ИмяМодуляПолучить = Неопределено Тогда
		
		ИмяМодуляПолучить = ИмяИнтеграции;
		
	КонецЕсли;
	
	Если Не Кэш.СБИС.ДанныеИнтеграции.Свойство("Объекты", Т_ОбъектыИнтеграции) Тогда
		Т_ОбъектыИнтеграции = Новый Структура;
	КонецЕсли;
	
	//Создаем объект транспорта, или берём существующий
	Если 		Т_ОбъектыИнтеграции.Свойство("Плагин", ОбъектПлагин)
		И	Не	ОбъектПлагин = Неопределено Тогда
		//Чистим все старые, накопленные сообщения
		Попытка
			ОбъектПлагин.ReadAllXml2();
		Исключение
			Отказ = Истина;
			СбисИсключение = МодульОбъектаКлиент().НовыйСбисИсключение(711101,"ExtSDK.ПолучитьМодульИнтеграции",,,
			"Требуется обновить Saby Plugin и повторить операцию");
			Возврат СбисИсключение;
		КонецПопытки;
	Иначе
		Попытка
			ОбъектПлагин = Новый COMОбъект("Tensor.SbisPluginClientCOM");
		Исключение
			Отказ = Истина;
			СбисИсключение = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(),"ExtSDK.ПолучитьМодульИнтеграции",767,,
			"Не зарегистрирована компонента Tensor.SbisPluginClientCOM." );
			Возврат СбисИсключение;
		КонецПопытки;
	КонецЕсли;
	ОбъектыИнтеграции.Вставить("Плагин", ОбъектПлагин);
	//Дозаполняем данные в кэше
	Кэш.СБИС.ДанныеИнтеграции.Вставить("Объекты", ОбъектыИнтеграции);
	//Кэш.СБИС.ДанныеИнтеграции.Вставить("Плагин", Новый Структура("Подписки, Потоки, НеизвестныеОтветы", Новый Соответствие, Новый Соответствие, Новый Соответствие));
	
	СбисУстановитьВремяОжидания(Кэш, ДопПараметры.ВремяОжиданияОтвета);
	
	//Получаем SDK	
	НачалоПодключения	= ТекущаяДата();
	РезультатЗапроса	= СБИСПлагин_GetModule(Кэш, ИмяМодуляПолучить, Отказ);
	
	Если РезультатЗапроса = "Unknown module" Тогда
		
		Отказ = Истина;
		ТекстСообщения = "Модуль """ + ИмяМодуляПолучить + """ не найден в Saby.Плагин";
		Возврат МодульОбъектаКлиент().НовыйСбисИсключение(400, ИмяИнтеграции + ".ПолучитьМодульИнтеграции",,,ТекстСообщения);
	
	ИначеЕсли Отказ Тогда
		
		Если		РезультатЗапроса.code = 756 Тогда
			//Попытка переподключения
			ОшибкаНаВозврат = РезультатЗапроса;
			ОшибкаПодключения = Ложь;
			СбисПлагинКомандаConnected = СБИСПлагин_Команда(Кэш, "ОжиданиеСобытия",,Новый Структура("Аккаунт", Неопределено),Отказ);
			СбисПлагинКомандаConnected.Идентификатор = "SbisPluginClientCOM.Connected";
			СбисПлагинКомандаConnected.ВремяОжиданияОтвета = 0;
			РезультатКоманды = Неопределено;
			Пока	ТекущаяДата() - НачалоПодключения < ОжиданиеОтвета
				И	РезультатКоманды = Неопределено Цикл
				ОшибкаПодключения = Ложь;
				РезультатКоманды = СБИСПлагин_ЧтениеОтветовИВызовСобытий(Кэш,,, ОшибкаПодключения);
				РезультатКоманды = СБИСПлагин_ПолучитьОтвет_Синхронно(Кэш, СбисПлагинКомандаConnected, Новый Структура, ОшибкаПодключения);
				Если ОшибкаПодключения Тогда
					Возврат РезультатКоманды;
				КонецЕсли;
				РезультатКоманды = СБИСПлагин_GetModule(Кэш, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя, ОшибкаПодключения);
			КонецЦикла;
			Если  РезультатКоманды = Неопределено Тогда
				Возврат ОшибкаНаВозврат;
			ИначеЕсли ОшибкаПодключения Тогда
				Возврат РезультатКоманды;
			КонецЕсли;
			Отказ = Ложь;
		ИначеЕсли	РезультатЗапроса.code = 762 Тогда
			
			Возврат РезультатЗапроса;
			
		ИначеЕсли	РезультатЗапроса.code = 775 Тогда
			
			РезультатЗапроса.details = РезультатЗапроса.details + " Возможно Saby плагин не запущен.";
			Возврат РезультатЗапроса;
			
		Иначе
			
			Возврат РезультатЗапроса;
			
		КонецЕсли;
		
	Иначе
		
		Возврат РезультатЗапроса;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция СбисОценитьРезультатВключения(Кэш, Результат, ДопПараметры, Отказ) Экспорт
	
	Если Не Отказ Тогда
		
		МодульОбъектаКлиент().ИзменитьПараметрСбис("ОбменВключен", Истина);	
		Возврат Истина;
		
	КонецЕсли;

	//Пришла структура ошибки. Сообщим об ошибке. Если это проблема с версией компоненты, то покажем полное предупреждение со ссылкой для скачки 
	МодульОбъектаКлиент().ИзменитьПараметрСбис("ОбменВключен", Ложь);
	
	Если	МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ТихийРежим") Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	сбисОткрытьПредупреждение = Ложь;
	Если Результат.code = 762 Тогда
		
		ТекстПредупреждение			= Результат.message + " (" + Результат.details + ")" + Символы.ПС + "Переустановите плагин в режиме полной установки и перезапустите 1С для дальнейшей работы.";
		АдресСсылкаРешение			= "https://update.sbis.ru/Sbis3Plugin/master/win32/sbis3plugin-setup-full.msi";
		сбисОткрытьПредупреждение	= Истина;
		
		ПараметрыСообщения = Новый Структура;
		ПараметрыСообщения.Вставить("АдресСсылка",	"https://update.sbis.ru/Sbis3Plugin/master/win32/sbis3plugin-setup-full.msi");
		ПараметрыСообщения.Вставить("ТекстСсылка",	"Скачать последнюю версию Saby плагина");
		ПараметрыСообщения.Вставить("Текст",		ТекстПредупреждение);
		
	ИначеЕсли Результат.code = 767 Тогда
		
		сбисОткрытьПредупреждение	= Истина;
		ТекстПредупреждение			= Результат.message + " (" + Результат.details + ")";
		АдресСсылкаРешение			= "https://saby.ru/help/integration/1C_set/modul/typical_errors/activex_component";
		
	ИначеЕсли Результат.code = 775 Тогда
		
		сбисОткрытьПредупреждение	= Истина;
		ТекстПредупреждение			= Результат.message + " (" + Результат.details + ")";
		АдресСсылкаРешение			= "https://online.saby.ru/reg/?check=ExtSDK2";
		
	КонецЕсли;
	
	Если сбисОткрытьПредупреждение Тогда
		
		ИсключениеРезультат = МодульОбъектаКлиент().НовыйСбисИсключение(Результат, "ExtSDK.СбисОценитьРезультатВключения", , ТекстПредупреждение, ТекстПредупреждение,, АдресСсылкаРешение);
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИсключениеРезультат, Новый Структура("Отложенно", Истина));

	Иначе
		
		Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, Результат, ДопПараметры);
		
	КонецЕсли;
	
	Возврат Результат.message + "(" + Результат.details + ")";

КонецФункции

&НаКлиенте
Процедура СбисУстановитьПодпискиСбис3Плагина(Кэш)
	//Добавим подписчики событий файл лоадера
	ПараметрыПодписчиков = Новый Структура("Кэш", Кэш);
	//TODO40 спилить старые имена событий
	//Кэш.СБИС.ДанныеИнтеграции.Подписки.Вставить("uploadtosbisdiskcompleteevent",		Новый Структура("Параметры", ПараметрыПодписчиков));
	//Кэш.СБИС.ДанныеИнтеграции.Подписки.Вставить("uploadtosbisdiskfatalerrorevent",	Новый Структура("Параметры", ПараметрыПодписчиков));
	//Кэш.СБИС.ДанныеИнтеграции.Подписки.Вставить("uploadedchunkevent",				Новый Структура("Параметры", ПараметрыПодписчиков));
	Кэш.СБИС.ДанныеИнтеграции.Подписки.Вставить("SbisPluginClientCOM.Disconnected", 	Новый Структура("Функция, Параметры", "Disconnected",						ПараметрыПодписчиков));
	Кэш.СБИС.ДанныеИнтеграции.Подписки.Вставить("UnValidToken", 						Новый Структура("Функция, Параметры", "Disconnected",						ПараметрыПодписчиков));
	Кэш.СБИС.ДанныеИнтеграции.Подписки.Вставить("sbisdisk.complete-event",			Новый Структура("Функция, Параметры", "uploadtosbisdiskcompleteevent",		ПараметрыПодписчиков));
	Кэш.СБИС.ДанныеИнтеграции.Подписки.Вставить("sbisdisk.fatal-error",				Новый Структура("Функция, Параметры", "uploadtosbisdiskfatalerrorevent",	ПараметрыПодписчиков));
	Кэш.СБИС.ДанныеИнтеграции.Подписки.Вставить("sbisdisk.uploaded-chunk",			Новый Структура("Функция, Параметры", "uploadedchunkevent",					ПараметрыПодписчиков));	
КонецПроцедуры

&НаКлиенте
Функция Завершить(Кэш, ДопонительныеПараметры, Отказ) Экспорт

	Если Кэш.ТекущийСеанс.Свойство("ЗавершитьПлагин") И Кэш.ТекущийСеанс.ЗавершитьПлагин = Истина Тогда
		СБИСПлагин_Завершить(Кэш);
	КонецЕсли;
	
	Возврат ЗавершитьExtSDK(Кэш, ДопонительныеПараметры, Отказ)
	
КонецФункции

&НаКлиенте
Функция ЗавершитьExtSDK(Кэш, ДопПараметры, Отказ) Экспорт
	Перем ИдМодуляИнтеграции;
	Попытка
		
		МодульОбъектаКлиент = МодульОбъектаКлиент();
		
		ВремяОжиданияОтветаБыло	= МодульОбъектаКлиент.ПолучитьЗначениеПараметраСБИС("ВремяОжиданияОтвета");
		ИмяИнтеграции			= МодульОбъектаКлиент.ПолучитьЗначениеПараметраСБИС("ИнтеграцияИмя");
		
		Если	ДопПараметры.Свойство("ЗавершитьРаботу")
			И	ДопПараметры.ЗавершитьРаботу Тогда 
			
			// Если это закрытие обработки, то обработать просроченные вызовы и выгрузить невостребованные ответы, если был включен режим отладки
			МодульОбъектаКлиент.ИзменитьПараметрСбис("ВремяОжиданияОтвета", 0);
			МодульОбъектаКлиент.ГлобальныйКэш_ОбработатьПросроченныеВызовы(, Истина);
			МодульОбъектаКлиент.ГлобальныйКэш_ОчиститьНевостребованныеОтветы();
			МодульОбъектаКлиент.ИзменитьПараметрСбис("ВремяОжиданияОтвета", ВремяОжиданияОтветаБыло);
			
		КонецЕсли;
		
		COMОбъектИнтеграции = МодульОбъектаКлиент().ПараметрSABY("ПлагинКоннектор", "Сбис");
		ИдМодуляИнтеграции	= МодульОбъектаКлиент().ПараметрSABY(ИмяИнтеграции, "Сбис");
		Если Не ИдМодуляИнтеграции = Неопределено Тогда
			COMОбъектИнтеграции.ReleaseModule(ИдМодуляИнтеграции);
		КонецЕсли;
		
		МодульОбъектаКлиент.ИзменитьПараметрСбис("ДанныеИнтеграции",	МодульОбъектаКлиент.НовыйДанныеИнтеграции());
		МодульОбъектаКлиент.ИзменитьПараметрСбис("ОбменВключен",		Ложь);
		
		Если	Кэш.Свойство("РезультатОтправки")
			И	ДопПараметры.Свойство("Ошибка") Тогда
			
			Кэш.РезультатОтправки.Вставить("ПрерватьОтправку", ДопПараметры.Ошибка.details);
			
		КонецЕсли;
		
	Исключение
		
		Сообщить("При завершении ExtSDK возникла проблема: " + ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

////////////////////////////////////////////////////
/////////////////////СБИСПлагин/////////////////////
////////////////////////////////////////////////////

//Делает вызов extSDK в плагине
&НаКлиенте
Функция СБИСПлагин_ВыполнитьМетод(Кэш, ПараметрыСБИС3Команды, ДопПараметры, Отказ) Экспорт
	Перем Sbi3Module_ID, Call_method, Call_param, Connection_ID, Acc_ID, ПараметрПроверка;
	
	//Если IDConnection не указан, то модуль вызывается напрямую
	Если Не Кэш.СБИС.ДанныеИнтеграции.Свойство("Объекты", ПараметрПроверка) Тогда
		Отказ = Истина;
		Возврат Кэш.ОбщиеФункции.СбисИсключение(,Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_ВыполнитьМетод", 700,,"Не подключена подсистема взаимодействия со Saby плагин");
	ИначеЕсли ПараметрыСБИС3Команды.Модуль = "ExtSdk" Тогда
		Sbi3Module_ID = ПараметрПроверка[ПараметрыСБИС3Команды.Модуль];
		Call_Ext = Ложь;
		Если Не ПараметрПроверка.Свойство("ExtSdk1", Connection_ID) Тогда
			Connection_ID = "";
		ИначеЕсли ЗначениеЗаполнено(Connection_ID) Тогда
			Call_Ext = Истина;
		КонецЕсли;
		Если Call_Ext Тогда
			Call_method	= "callMethod";
			Call_param = Новый Структура;
			Call_param.Вставить("idConnection",	Connection_ID);
			Call_param.Вставить("method",		ПараметрыСБИС3Команды.Метод);
			Call_param.Вставить("param",		ПараметрыСБИС3Команды.Параметры);
		Иначе
			Call_method	= ПараметрыСБИС3Команды.Метод;
			Call_param	= Новый Структура("param", ПараметрыСБИС3Команды.Параметры);
		КонецЕсли;
	Иначе
		Call_param = ПараметрыСБИС3Команды.Параметры;
		Call_method= ПараметрыСБИС3Команды.Метод;
		Если Не ПараметрПроверка.Свойство(ПараметрыСБИС3Команды.Модуль, Sbi3Module_ID) Тогда
			Sbi3Module_ID = СБИСПлагин_GetModule(Кэш, ПараметрыСБИС3Команды.Модуль, Отказ);
			Если Отказ Тогда
				Возврат Кэш.ОбщиеФункции.СбисИсключение(Sbi3Module_ID, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_ВыполнитьМетод");
			КонецЕсли;
		КонецЕсли;
		ПараметрыСБИС3Команды.Свойство("Аккаунт", Acc_ID);
	КонецЕсли;
	Call_param	= Кэш.РаботаСJson.ПреобразоватьЗначениеВJSON(Call_param, Новый Структура("Режим", ПараметрыСБИС3Команды.Модуль));
	ПараметрыСБИС3Команды.ВремяВызова = ТекущаяДата();
	
	Если ПараметрыСБИС3Команды.Свойство("Контракт") И ЗначениеЗаполнено(ПараметрыСБИС3Команды.Контракт) Тогда
		MethodName = ПараметрыСБИС3Команды.Контракт + "." + Call_method;
	Иначе
		MethodName = ПараметрыСБИС3Команды.Модуль + "." + Call_method;
	КонецЕсли;
	
	ПлагинКоннектор = МодульОбъектаКлиент().ПараметрSABY("ПлагинКоннектор", "Сбис");
	Попытка
		Если	ДопПараметры.Свойство("БезАвторизации")
			И	ДопПараметры.БезАвторизации Тогда
			Хост = Кэш.СБИС.ПараметрыИнтеграции.ПредставлениеСервера;
			ПлагинКоннектор.CallMethodWithoutAuth(ПараметрыСБИС3Команды.Идентификатор, Sbi3Module_ID, MethodName, Call_param, Хост);
		Иначе
			ПлагинКоннектор.CallMethod(ПараметрыСБИС3Команды.Идентификатор, Sbi3Module_ID, MethodName, Call_param, Acc_ID);
		КонецЕсли;
		РезультатВызова = ПараметрыСБИС3Команды.Идентификатор;
	Исключение
		Отказ = Истина;
		РезультатВызова = Кэш.ОбщиеФункции.СбисИсключение(ОписаниеОшибки(), ПараметрыСБИС3Команды.Модуль + "." + Call_method, 700, Call_method,, "Ошибка вызова метода плагина " + Call_method + ". Детально: " + ОписаниеОшибки());
	КонецПопытки;
	Если	ДопПараметры.Свойство("ОчиститьПараметры")
		И	ДопПараметры.ОчиститьПараметры Тогда
		ПараметрыСБИС3Команды.Параметры=Неопределено;
	КонецЕсли;	

	Возврат РезультатВызова;
	
КонецФункции

//Выполняет указанный метод. При ошибке отправки(не обработки!) возвращает её.
//Дополнительные параметры - структура. 
//Отказ - булево, определяет наличие ошибок в процессе выполнения метода и что вернулось в качестве результата. Если Истина, то объект ExtSysException
&НаКлиенте
Функция СБИСПлагин_ОтправитьКоманду_Асинхронно(Кэш, СБИС3Команда, ДопПараметры, Отказ) Экспорт
	Если Не Кэш.СБИС.ОбменВключен Тогда
		Отказ = Истина;
		Возврат Кэш.ОбщиеФункции.СбисИсключение(,Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_ОтправитьКоманду_Асинхронно", 409,,"Перезапустите Saby Плагин для дальнейшей работы");
	КонецЕсли;
	//Вызываем метод плагина и подключаем обработчик на результат.
	РезультатВызова = СБИСПлагин_ВыполнитьМетод(Кэш, СБИС3Команда, ДопПараметры, Отказ);
	Если Отказ Тогда
		СБИС3Команда.Ответ = Кэш.ОбщиеФункции.СбисИсключение(РезультатВызова, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_ОтправитьКоманду_Асинхронно");
		Возврат СБИС3Команда;
	КонецЕсли;
	СБИСПлагин_ЗанятьПоток(Кэш, СБИС3Команда.Идентификатор, СБИС3Команда);
	Возврат Истина;
КонецФункции

//Проверяет наличие ответа от плагина и вызывает событие обработки полученного ответа.
//Имеет смысл сделать обработчиком ожидания, но тогда придётся кардинально переделывать отправку на других формах
&НаКлиенте
Процедура СБИСПлагин_ОбработатьОтветы_Асинхронно(Кэш)
	
	Попытка
		
		МодульОбъектаКлиент().ГлобальныйКэш_ЧтениеОтветовИВызовСобытий();
		
	Исключение
		
		ИсключениеОтправки = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "ExtSDK.СБИСПлагин_ОбработатьОтветы_Асинхронно");
		Если Кэш.Свойство("РезультатОтправки") Тогда
			
			//Если идёт отправка, то прерываем
			Кэш.РезультатОтправки.Вставить("ПрерватьОтправку", ИсключениеОтправки.details);
			
		КонецЕсли;
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИсключениеОтправки);
		
	КонецПопытки;
	
	СБИСПлагин_ОбработатьПросроченныеВызовы(Кэш);
	
КонецПроцедуры

&НаКлиенте
Процедура СБИСПлагин_ОбработатьПросроченныеВызовы(Кэш)
	
	МодульОбъектаКлиент().ГлобальныйКэш_ОбработатьПросроченныеВызовы();

КонецПроцедуры

//Обработчик ответа при синхронном вызове
&НаКлиенте
Функция СБИСПлагин_ОбработатьРезультат_Синхронно(Кэш, СбисРезультат, ДопПараметры, Отказ)
	Перем message_result, message_type, checkResult;
	Если Отказ Тогда
		Если Не СбисРезультат.Свойство("Ответ",message_result) Тогда 
			message_result = СбисРезультат;
		КонецЕсли;
	ИначеЕсли Не	СбисРезультат.Свойство("Ответ", message_result) Тогда
		//Метод не вернул результат. Проверить, должно ли так быть. (Для метода, у которого однозначно должен быть ответ это ошибка)
		Если	ДопПараметры.Свойство("ЕстьРезультат")
			И	ДопПараметры.ЕстьРезультат Тогда
			Отказ = Истина;
			message_result = Кэш.ОбщиеФункции.СбисИсключение(,СбисРезультат.Метод,400,,"Отсутствует результат выполнения метода " + СбисРезультат.Метод + "()");
		Иначе
			message_result = Неопределено;
		КонецЕсли;
	ИначеЕсли Не message_result.Свойство("Данные", checkResult) Тогда
		Отказ = Истина;
		message_result = Кэш.ОбщиеФункции.СбисИсключение(,СбисРезультат.Метод,400,,"Неизвестный формат ответа в результате выполнения метода " + СбисРезультат.Метод + "(). Ответ не является асинхронным событием");
	Иначе
		Если message_result.Тип = "Error" Тогда
			Отказ = Истина;
			Если	Не	ТипЗнч(checkResult) = Тип("Структура")
				Или	Не	checkResult.Свойство("Error", message_result) Тогда
				message_result = Кэш.ОбщиеФункции.СбисИсключение(checkResult, СбисРезультат.Метод);
			КонецЕсли; 
			Если message_result.code = 411 Тогда
				ДопПараметры.Вставить("СообщатьПриОшибке", Ложь);
			КонецЕсли;
		ИначеЕсли	Не	ТипЗнч(checkResult) = Тип("Структура")
				Или	Не	checkResult.Свойство("Result", message_result) Тогда
			message_result = checkResult;
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		message_result = Кэш.ОбщиеФункции.СбисИсключение(message_result, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_ОбработатьРезультат_Синхронно");
	КонецЕсли;
	
	Возврат	message_result;	
	
КонецФункции

//Класс команды для вызова СБИС3 плагина
&НаКлиенте
Функция СБИСПлагин_Команда(Кэш, Метод, ПараметрыМетода=Неопределено, ДопПараметры=Неопределено, Отказ) Экспорт
	Перем СбисАккаунт;
	Если ПараметрыМетода = Неопределено Тогда
		ПараметрыМетода = Новый Структура;
	КонецЕсли;
	Попытка
		СбисИдЗапроса = Строка(Кэш.СБИС.ДанныеИнтеграции.Объекты.Плагин.GenerateQueryID());
	Исключение
		Отказ = Истина;
		Возврат Кэш.ОбщиеФункции.СбисИсключение(,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_Команда", 400,,"Ошибка при генерации ИД запроса. Детально: " + ОписаниеОшибки());
	КонецПопытки;
	Результат = Новый Структура(
	"Метод,	Параметры,			Идентификатор,	Модуль,												События,		Аккаунт, Ответ, ВремяОжиданияОтвета, ВремяВызова, ВремяПолучения, Контракт", 
	Метод,	ПараметрыМетода,	СбисИдЗапроса,	Кэш.СБИС.ПараметрыИнтеграции.ИмяМодуляИнтеграции,	Новый Структура);
	Если ДопПараметры = Неопределено Тогда
		Результат.Аккаунт = Кэш.СБИС.ДанныеИнтеграции.Объекты["Форма_" + Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя].СбисИдАккаунта(Кэш);
		Возврат Результат;
	КонецЕсли;
	Если Не ДопПараметры.Свойство("ВремяОжиданияОтвета", Результат.ВремяОжиданияОтвета) Тогда
		Результат.ВремяОжиданияОтвета = Кэш.СБИС.ПараметрыИнтеграции.ВремяОжиданияОтвета;
	КонецЕсли;
	Если ДопПараметры.Свойство("Модуль") Тогда
		Результат.Модуль = ДопПараметры.Модуль;
	КонецЕсли;
	//Контракт - объект бизнес логики, дополнительная адресация в плагине, 
	//в большенстве случаев контракт и модуль совпадают поэтому может не указываться
	ДопПараметры.Свойство("Контракт", Результат.Контракт);
	//Спилить переопределение аккаунта, после переезда на extSDK2
	Если ДопПараметры.Свойство("Аккаунт") Тогда
		Результат.Аккаунт = ДопПараметры.Аккаунт;
	Иначе
		Результат.Аккаунт = Кэш.Интеграция.СбисИдАккаунта(Кэш);
	КонецЕсли;
	Если ДопПараметры.Свойство("События") Тогда
		Результат.События = ДопПараметры.События;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

// Разбор сообщения от плагина
//
// Параметры:
//  Сбис3СобытиеОтвет	- Сообщение из пула ответов	 - 
// 
// Возвращаемое значение:
// АсинхронноеСбисСобытие  - 
//
&НаКлиенте
Функция СБИС_ОбработатьОтвет(Сбис3СобытиеОтвет, ДопПараметры=Неопределено) Экспорт
	
    ОбработанноеСобытие = СБИС_ОбработатьСобытиеОтвета(Сбис3СобытиеОтвет, ДопПараметры);
	Результат = МодульОбъектаКлиент().НовыйАсинхронноеСбисСобытие(ОбработанноеСобытие.queryID, ОбработанноеСобытие.data, ОбработанноеСобытие.type);
	Если Не ДопПараметры = Неопределено Тогда
		Результат.Получено = ДопПараметры.ВремяПолучения;
	КонецЕсли;
	
КонецФункции
	
// Разбор сообщения от плагина
//
// Параметры:
//  Сбис3СобытиеОтвет	- Сообщение из пула ответов	 - 
// 
// Возвращаемое значение:
// АсинхронноеСбисСобытие  - 
//
&НаКлиенте
Функция СБИС_ОбработатьСобытиеОтвета(Сбис3СобытиеОтвет, ДопПараметры=Неопределено) Экспорт
	
	Если		Сбис3СобытиеОтвет.type = "Message" Тогда	//parse_Message
		Сбис3СобытиеОтвет.data	= СБИС_РазобратьОтвет(Сбис3СобытиеОтвет.data);
	ИначеЕсли	Сбис3СобытиеОтвет.type = "Event" Тогда	//parse_Event
		Сбис3СобытиеОтвет.data	= СБИС_РазобратьОтвет(Сбис3СобытиеОтвет.data);
		СбисEventName			= Сбис3СобытиеОтвет.data.eventName;
		
		Сбис3СобытиеОтвет.Вставить("queryID", СбисEventName);
		
		РезультатСобытия	= Неопределено;
		ОшибкаОбработки		= Ложь;
		//костылим имя эвента при чтении ответа.
		Если		СбисEventName = "extsdk2.async.error" Тогда
			Сбис3СобытиеОтвет = Новый Структура("type,queryID,data","Error", Сбис3СобытиеОтвет.data.data.QueryId, Сбис3СобытиеОтвет.data.data);
			Если Сбис3СобытиеОтвет.data.Свойство("Error") Тогда
				Сбис3СобытиеОтвет.data = Сбис3СобытиеОтвет.data.Error;
			КонецЕсли;
		ИначеЕсли	СбисEventName = "extsdk2.async.complete" Тогда
			Сбис3СобытиеОтвет = Новый Структура("type,queryID,data","Message",Сбис3СобытиеОтвет.data.data.QueryId, Сбис3СобытиеОтвет.data.data);				 
			Если Сбис3СобытиеОтвет.data.Свойство("Result") Тогда
				Сбис3СобытиеОтвет.data = Сбис3СобытиеОтвет.data.Result;
			КонецЕсли;
		Иначе
			//Обычное событие
		КонецЕсли;
	ИначеЕсли	Сбис3СобытиеОтвет.type = "Error" Тогда	//parse_Error
		Если Сбис3СобытиеОтвет.queryID = "ReadAllXml" Тогда//ошибка сериализатора
			Сбис3СобытиеОтвет.type	= "CriticalError";//Переставим тип, чтобы позвать подписочное событие
			Сбис3СобытиеОтвет.data	= МодульОбъектаКлиент().НовыйСбисИсключение(, "ExtSDK2.ReadAllXml2", 700,"Возникла критическая ошибка при чтении ответа." , Сбис3СобытиеОтвет.data);
		Иначе	
			Сбис3СобытиеОтвет.data = СБИС_РазобратьОтвет(Сбис3СобытиеОтвет.data);
			Если ТипЗнч(Сбис3СобытиеОтвет.data) = Тип("Строка") Тогда
				//Отвалился плагин. Останавливаем обмен
				Если	Найти(Сбис3СобытиеОтвет.data, "disconnect")
					Или	Сбис3СобытиеОтвет.data = "Not connected"
					Или	Сбис3СобытиеОтвет.data = "Server not found" Тогда
					Сбис3СобытиеОтвет.data = МодульОбъектаКлиент().НовыйСбисИсключение(
						756,	"МодульОбъектаКлиент.СБИСПлагин_ЧтениеОтветовИВызовСобытий",,
						"Подключение недоступно", "Работа Saby плагина была остановлена. Перезапустите Saby Плагин для дальнейшей работы.");
					Сбис3СобытиеОтвет.queryID	= "SbisPluginClientCOM.Disconnected";
					Сбис3СобытиеОтвет.type		= "Event";//Переставим тип, чтобы позвать подписочное событие
				ИначеЕсли Сбис3СобытиеОтвет.data = "Передан недействительный токен" Тогда
					Сбис3СобытиеОтвет.data = МодульОбъектаКлиент().НовыйСбисИсключение(
						411, "МодульОбъектаКлиент.СБИСПлагин_ЧтениеОтветовИВызовСобытий",, 
						"Для выполнения этой операции необходимо авторизоваться в Saby Плагин", "Работа пользователя была завершена. Требуется повторная авторизация.");
					Сбис3СобытиеОтвет.queryID	= "UnValidToken";
					Сбис3СобытиеОтвет.type		= "CriticalError";//Переставим тип, чтобы позвать подписочное событие
				Иначе
					//Это обычное исключение
					Сбис3СобытиеОтвет.data = МодульОбъектаКлиент().НовыйСбисИсключение(Сбис3СобытиеОтвет.data, "МодульОбъектаКлиент.СБИСПлагин_ЧтениеОтветовИВызовСобытий");
				КонецЕсли;
			ИначеЕсли	Сбис3СобытиеОтвет.data.Свойство("detail")
					И	Сбис3СобытиеОтвет.data.detail = "#ASYNC" Тогда
				Сбис3СобытиеОтвет.type = "Async";	
			Иначе
				//Обычная ошибка
			КонецЕсли;
		КонецЕсли;
	Иначе
		МодульОбъектаКлиент().ВызватьСбисИсключение(773, "ExtSDK2.СБИС_ОбработатьОтвет",,,"Не поддерживаемый формат ответа!");
	КонецЕсли;
	Возврат Сбис3СобытиеОтвет;
	
КонецФункции

//Вызывает метод подписки на событие Event
//Параметры: 
//Кэш - Кэш главного окна, 
//Сбис3СобытиеОтвет - описание полученного события
//ДопПараметры - дополнительные параметры вызова, которые передаются в обработчик события.
//РезультатСобытия - в переменную помещается результат вызова события по подписке, если функция что-то возвращает
&НаКлиенте
Функция СБИСПлагин_ВызватьСобытиеПоПодписке(Кэш, Сбис3СобытиеОтвет, ДопПараметры=Неопределено, РезультатСобытия=Неопределено, Отказ=Ложь)
	СбисПараметрыПодписки = Кэш.СБИС.ДанныеИнтеграции.Подписки.Получить(Сбис3СобытиеОтвет.Идентификатор);
	Результат = Ложь;
	Если Не СбисПараметрыПодписки = Неопределено Тогда
		ИмяФункцииПодписки = Неопределено;
		Если Не СбисПараметрыПодписки.Свойство("Функция", ИмяФункцииПодписки) Тогда
			//Для события QueryID = его тип, если не указана функция вызова
			ИмяФункцииПодписки = Сбис3СобытиеОтвет.Идентификатор;
		КонецЕсли;
		ПараметрыСобытия = Новый Структура("Основные, Дополнительные", СбисПараметрыПодписки.Параметры, ДопПараметры);
		ВызовПодписки = Новый Структура("Модуль, Функция, Параметры", ЭтаФорма, ИмяФункцииПодписки, ПараметрыСобытия);
		Если СбисПараметрыПодписки.Свойство("Модуль") Тогда
			ВызовПодписки.Модуль = СбисПараметрыПодписки.Модуль;
		КонецЕсли;
		Попытка
			СБИСПлагин_ВызватьФункциюСобытия(Кэш, Сбис3СобытиеОтвет, ВызовПодписки);
		Исключение
			Отказ = Истина;
			РезультатСобытия = Кэш.ОбщиеФункции.СбисИсключение(ОписаниеОшибки(), Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_ВызватьСобытиеПоПодписке",,,,Новый Структура("data", Сбис3СобытиеОтвет));
		КонецПопытки;
		Результат = Истина;
	КонецЕсли;
	Если Кэш.Парам.РежимОтладки Тогда
		СбисТекстОтвета = Кэш.РаботаСJson.ПреобразоватьЗначениеВJson(Сбис3СобытиеОтвет);
		лОтладочныеДанные = Новый Структура("Тип, Модуль, Время, Идентификатор, Сообщение, Вызов", "EVENT", "Events", ТекущаяДата(), Сбис3СобытиеОтвет.Идентификатор, СбисТекстОтвета, "Unknown");
		Если Результат Тогда
			лОтладочныеДанные.Вызов = ИмяФункцииПодписки;
		КонецЕсли;
		ДанныеВЛог = Новый Массив;
		ДанныеВЛог.Добавить(лОтладочныеДанные);
		Если Отказ Тогда
			//Если пришёл результат от подписки на событие, то его тоже выгрузим в лог
			СбисТекстОтвета = Кэш.РаботаСJson.ПреобразоватьЗначениеВJson(РезультатСобытия);
			лОтладочныеДанные = Новый Структура("Тип, Модуль, Время, Идентификатор, Сообщение, Вызов", "E_ERROR", Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя, ТекущаяДата(), Сбис3СобытиеОтвет.Идентификатор, СбисТекстОтвета, ИмяФункцииПодписки);
			ДанныеВЛог.Добавить(лОтладочныеДанные);
		КонецЕсли;
		Кэш.ОбщиеФункции.сбисСохранитьОтладочныеДанные(Кэш, Новый Структура("Log", ДанныеВЛог));
	КонецЕсли;
	Возврат Результат;
КонецФункции

//Функция получает ID модуля плагина для вызова его методов.
&НаКлиенте
Функция СБИСПлагин_GetModule(Кэш, ИмяМодуля, Отказ) Экспорт
	
	//Проверим наличие подключенного модуля.
	МодульОбработкиВызова	= МодульОбъектаКлиент();
	ПлагинКоннектор			= МодульОбработкиВызова.ПараметрSABY("ПлагинКоннектор", "Сбис");
	Попытка 
		
		РезультатЗапроса = ПлагинКоннектор.GetModule(ИмяМодуля);
		
		Если РезультатЗапроса = "" Тогда
			
			// Костыль. Попробовать ещё раз, на случай если COM залип после перезапуска плагина, пока не будет исправлено в самом объекте
			ПлагинКоннектор.ReadAllXml2();
			РезультатЗапроса = ПлагинКоннектор.GetModule(ИмяМодуля);
			
		КонецЕсли;
		
	Исключение
		
		Отказ = Истина;//Если падает метод COM, значит его нет в модуле и это старый плагин
		Возврат МодульОбработкиВызова.НовыйСбисИсключение(711101, "ExtSDK2.СБИСПлагин.GetModule" ,,,
		"Требуется обновить Saby Plugin и повторить операцию");
		
	КонецПопытки;
	
	//Проверим, что модуль получен
	Если РезультатЗапроса = "" Тогда
		Попытка
			МодульОбработкиВызова.ГлобальныйКэш_ЧтениеОтветовИВызовСобытий();
		Исключение
			СтруктураОшибки = МодульОбработкиВызова.НовыйСбисИсключение(ИнформацияОбОшибке(), ИмяМодуля + ".СБИСПлагин_GetModule");
		КонецПопытки;
		Отказ	= Истина;
		//Смотрим вернувшиеся ошибки и обрабатываем в порядке приоритета:
		//1. Ошибка 756 о завершении работы плагина
		//2. Ошибка 775 о отсутствии запущенного плагина
		//3. Последняя ошибка в списке, которая должна относиться к GetModule()
		СтруктураОшибки = Неопределено;
		КлючиОчистить = Новый Массив;
		
		НеизвестныеОтветы = МодульОбработкиВызова.ПараметрSABY("НеизвестныеОтветы", "Сбис");
		Для Каждого КлючИЗначениеОтвет Из НеизвестныеОтветы Цикл
			
			Для Каждого ЗначениеСобытия Из КлючИЗначениеОтвет.Значение Цикл
				
				Если МодульОбработкиВызова.ЭтоТипСбис(ЗначениеСобытия, "АсинхронноеСбисСобытие") Тогда
					
					ЗначениеОтвет = ЗначениеСобытия;
					
				Иначе
					
					ЗначениеОтвет = ЗначениеСобытия.Ответ;
					
				КонецЕсли;
				
				Если	ЗначениеОтвет.Тип = "Error"
					Или	ЗначениеОтвет.Тип = "CriticalError"Тогда
					СтруктураОшибки = ЗначениеОтвет.Данные;
					Если СтруктураОшибки.code = 756 Тогда
						КлючиОчистить.Добавить(КлючИЗначениеОтвет.Ключ);
						Прервать;
					ИначеЕсли   СтруктураОшибки.code = 775 Тогда
						КлючиОчистить.Добавить(КлючИЗначениеОтвет.Ключ);
						СтруктураОшибки.details = "Не удалось получить расширение " + ИмяМодуля + ".";
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого КлючОчистить Из КлючиОчистить Цикл
			
			НеизвестныеОтветы.Удалить(КлючОчистить);
			
		КонецЦикла;
		
		Если Не ЗначениеЗаполнено(СтруктураОшибки) Тогда
			
			СтруктураОшибки = Новый Структура("code, message, details", 775, "Не получен ответ от SABY плагина", "Не удалось получить расширение " + ИмяМодуля + ".");
			
		КонецЕсли;
		
		Возврат СтруктураОшибки;
		
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		ОписаниеПараметраSABY = Новый Структура("Ключ, Значение", ИмяМодуля, РезультатЗапроса);
		МодульОбработкиВызова.ИзменитьПараметрSABY("ОбъектИнтеграции", ОписаниеПараметраSABY, "Сбис");
		
	КонецЕсли;
	Возврат РезультатЗапроса;
	
КонецФункции

//Функция переадресует обработку ответа соотствующей функции, если такая есть
&НаКлиенте
Функция СБИСПлагин_ПереадресацияПоРезультату(РезультатВызова, ПараметрыОбработки) Экспорт
	ОбрабатываемаяКоманда = ПараметрыОбработки.Команда;
	Кэш = ПараметрыОбработки.Кэш;
	КлючСобытия = ОбрабатываемаяКоманда.Метод + "_" + ПараметрыОбработки.Тип;
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции(КлючСобытия, "ExtSDK");
	Если фрм = Ложь Тогда
		СБИСПлагин_ДобавитьНеобработанныйОтвет(Кэш, ОбрабатываемаяКоманда.Идентификатор, РезультатВызова);
	Иначе
		СБИСПлагин_ВызватьФункциюСобытия(Кэш, РезультатВызова, Новый Структура("Модуль, Функция, Параметры", фрм, КлючСобытия, ПараметрыОбработки));
	КонецЕсли;
КонецФункции

//Функция запускает плагин
&НаКлиенте
Функция СБИСПлагин_Запустить(Кэш, ДопПараметры=Неопределено) Экспорт
	
	Если Кэш.ПараметрыСистемы.Клиент.ЭтоLinux Тогда
		
		СообщениеОПроблеме = "Отсуствуют параметры для запуска приложения SABY на ОС Linux.";
		ОшибкаЗапускаПЛагина = МодульОбъектаКлиент().НовыйСбисИсключение(510100, "ExtSDK.СБИСПлагин.Запустить",,, СообщениеОПроблеме);
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(ОшибкаЗапускаПЛагина);
		
	КонецЕсли;
	Кэш.ГлавноеОкно.СбисПоказатьСостояние("Запускаем плагин...");  
	
	saby_desktop_connector_path	= "C:\ProgramData\Tensor\Saby\sbis-plugin-connector-path";
	sbis_plugin_connector_path	= "C:\ProgramData\Sbis3Plugin\sbis-plugin-connector-path";    
	
	sbis_plugin_await_timeout	= 10;                                                         	 
	ИмяПлагина 					= "saby.exe";
	
	Если Не ДопПараметры = Неопределено Тогда
		Если ДопПараметры.Свойство("ПутьККоннектору") Тогда
			sbis_plugin_connector_path = ДопПараметры.ПутьККоннектору;
		КонецЕсли;	
		Если ДопПараметры.Свойство("ВремяОжиданияЗапуска") Тогда
			sbis_plugin_await_timeout = ДопПараметры.ВремяОжиданияЗапуска;
		КонецЕсли;	
	КонецЕсли;	
	
	ФайлПлагин = Новый Файл(saby_desktop_connector_path); // Проверяем доступность файла Saby Desktop 
	
	Если НЕ ФайлПлагин.Существует() Тогда 
		
		ФайлПлагин = Новый Файл(sbis_plugin_connector_path); // Проверяем доступность файла Sbis Plugin 
		
		Если НЕ ФайлПлагин.Существует() Тогда 
			
			СообщениеОПроблеме = "Не найдено установленное приложение SABY: отсутствует каталог коннектора.";
			ОшибкаЗапускаПЛагина = МодульОбъектаКлиент().НовыйСбисИсключение(779104, "ExtSDK.СБИСПлагин.Запустить",,, СообщениеОПроблеме);
			ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(ОшибкаЗапускаПЛагина);
			
		КонецЕсли;
		
		ИмяПлагина = "sbis3plugin.exe"; 
		saby_desktop_connector_path = sbis_plugin_connector_path;  
		
	КонецЕсли;  
		
	ТекстовыйФайл = Новый ЧтениеТекста;
	ТекстовыйФайл.Открыть(saby_desktop_connector_path);              
	sbis_plugin_connector_path_dll = ТекстовыйФайл.ПрочитатьСтроку();
	Если sbis_plugin_connector_path_dll = Неопределено Тогда
		
		СообщениеОПроблеме = "Не найдено установленное приложение SABY: не указан путь к коннектору.";
		ОшибкаЗапускаПЛагина = МодульОбъектаКлиент().НовыйСбисИсключение(779104, "ExtSDK.СБИСПлагин.Запустить",,, СообщениеОПроблеме);
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(ОшибкаЗапускаПЛагина);
		
	КонецЕсли;
	
	НайденныеПутиИсполения		= Новый Массив;
	НайденИсполнительныйКаталог = Ложь;
	ПолноеИмя = "";
	Разделитель = "\";
	//sbis_plugin_connector_path_dll = "C:\Program Files (x86)\Tensor Company Ltd\SBIS3Plugin\21.6204.67\service\sbis-plugin-connector.dll"
	//отсекаем 3 последние элемента
	sbis_plugin_connector_path_dll = СтрЗаменить(sbis_plugin_connector_path_dll, Разделитель, Символы.ПС);
	КоличествоСтрокПути = СтрЧислоСтрок(sbis_plugin_connector_path_dll) - 3;
	Для Индекс = 1 ПО КоличествоСтрокПути Цикл
		
		СтрокаВПути = СтрПолучитьСтроку(sbis_plugin_connector_path_dll, Индекс);
		ПолноеИмя = ПолноеИмя + СтрокаВПути + Разделитель;
		Если СтрокаВПути = "Tensor" Тогда
			
			НайденИсполнительныйКаталог = Истина;
			Прервать;
			
		КонецЕсли;
			
	КонецЦикла;
	
	Если Не НайденИсполнительныйКаталог Тогда
		
		СообщениеОПроблеме = "Не найдено установленное приложение SABY: по указанному пути отсутствует каталог приложения Tensor.Saby.";
		ОшибкаЗапускаПЛагина = МодульОбъектаКлиент().НовыйСбисИсключение(779104, "ExtSDK.СБИСПлагин.Запустить",,, СообщениеОПроблеме);
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(ОшибкаЗапускаПЛагина);

	КонецЕсли;
	
	Для Индекс = Индекс + 1 ПО КоличествоСтрокПути Цикл
		
		СтрокаВПути	= СтрПолучитьСтроку(sbis_plugin_connector_path_dll, Индекс);
		ПолноеИмя	= ПолноеИмя + СтрокаВПути + Разделитель;
		
		ФайлПлагин	= Новый Файл(ПолноеИмя + ИмяПлагина);
		Если   ФайлПлагин.Существует() Тогда
			
			НайденныеПутиИсполения.Вставить(0, ПолноеИмя + ИмяПлагина);
			
		КонецЕсли;
			
	КонецЦикла;	
	
	Если Не	НайденныеПутиИсполения.Количество() Тогда
		
		СообщениеОПроблеме = "Не найдено установленное приложение SABY: не найден исполняющий файл """ + ИмяПлагина + """.";
		ОшибкаЗапускаПЛагина = МодульОбъектаКлиент().НовыйСбисИсключение(779104, "ExtSDK.СБИСПлагин.Запустить",,, СообщениеОПроблеме);
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(ОшибкаЗапускаПЛагина);
		
	КонецЕсли;	
	
	ЗапуститьПриложение(НайденныеПутиИсполения[0]);
	ВремяЗапуска = ТекущаяДата();
	
	Кэш.ГлавноеОкно.СбисПоказатьСостояние("Ожидание запуска...");
	ПредТест	= 0;
	ТекТест		= Цел(ТекущаяДата() - ВремяЗапуска);    
	
	// Получить имя модуля интеграции и переопределить для чтения параметров
	СведенияОбИнтеграции	= МодульОбъектаКлиент().ПараметрSABY("СведенияОбИнтеграции", "Сеанс");
	ПараметрыВключения		= СведенияОбИнтеграции.Параметры;
	МодульИнтеграции		= МодульОбъектаКлиент().МодульИнтеграцииСБИС(ПараметрыВключения.ИмяВнутреннегоМодуля);
	
	МодульПолучен		= Ложь;
	Пока ТекТест < sbis_plugin_await_timeout Цикл
		ТекТест = Цел(ТекущаяДата() - ВремяЗапуска);
		Если ПредТест = ТекТест Тогда
			Продолжить;
		КонецЕсли;
		ПредТест = ТекТест;
		ОшибкаПолучения = Ложь;
		РезультатЗапроса = МодульИнтеграции.ПолучитьМодульИнтеграции(Кэш, ПараметрыВключения, ОшибкаПолучения);
		Если ОшибкаПолучения Тогда
			ОшибкаПолучения = Ложь;
			Продолжить;
		КонецЕсли;
		МодульПолучен = Истина;
		Прервать;
	КонецЦикла;
	Кэш.ГлавноеОкно.СбисСпрятатьСостояние();
	Если Не МодульПолучен Тогда
		
		СообщениеОПроблеме = "Не удалось запустить приложение SABY за установленный промежуток времени: " + sbis_plugin_await_timeout + " секунд.";
		ОшибкаЗапускаПЛагина = МодульОбъектаКлиент().НовыйСбисИсключение(412100, "ExtSDK.СБИСПлагин.Запустить",,, СообщениеОПроблеме);
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Выгрузить(ОшибкаЗапускаПЛагина);
		
	КонецЕсли;
	
	//КомандаСистемы("""" + ФайлПлагин.ПолноеИмя + """"); 
	//открывает терминал cmd в виде модального окна и затем
	//1С дожидается его закрытия для продолжения исполнения кода
	
	Возврат Истина;
	
КонецФункции

//Функция завершает работу плагина
&НаКлиенте
Функция СБИСПлагин_Завершить(Кэш) Экспорт
	
	AccountID =	СтрПолучитьСтроку(СтрЗаменить(Кэш.Парам.ИдентификаторСессии, "-", Символы.ПС), 2) + "@" +
				СтрЗаменить(Сред(Кэш.СБИС.АдресСервера, Найти(Кэш.СБИС.АдресСервера, ":")+1), "/", "");
	
	ПараметрыЗапроса = Новый Структура("action", "close");
	ДополнительныеПараметрыВызова = Новый Структура("Аккаунт, Модуль, ВремяОжиданияОтвета, Контракт", AccountID, "CoreService", 10, "Application");
	
	Отказ = Ложь;
	СБИС3Команда = СБИСПлагин_Команда(Кэш, "Exit", ПараметрыЗапроса, ДополнительныеПараметрыВызова, Отказ);
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РезультатВызова = СБИСПлагин_ВыполнитьМетод(Кэш, СБИС3Команда, ДополнительныеПараметрыВызова, Отказ);
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

//////// Отправка ////////////////

//Отправляет сформированные пакеты документов	
&НаКлиенте
Функция ОтправитьПакетыДокументов(Кэш, МассивПакетов, РезультатОтправки=Неопределено) Экспорт
	Если Не МассивПакетов.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Отправка_ОбработатьВКэшеПодготовленные(Кэш);
	Отправка_ОбработатьВКэшеПереотправляемые(Кэш);
	
	//Затем отправляем наши пакеты
	Для Каждого СоставПакета Из МассивПакетов Цикл
		Отправка_ДокументВСвободныйПоток(Кэш, Новый Структура("СоставПакета,СтатусПакета", СоставПакета, "Подготовка"), Новый Структура("ДобавлятьВОчередь", Истина));
	КонецЦикла;
	
КонецФункции

//Точка входа завершения отправки
&НаКлиенте
Процедура сбисПолучитьОтветыПоОтправке(Кэш) Экспорт
	Кэш.ГлавноеОкно.сбисПоказатьСостояние("Ожидание ответов", Кэш.ГлавноеОкно);
	Отправка_Завершение(Кэш);
	Кэш.ГлавноеОкно.сбисСпрятатьСостояние(Кэш.ГлавноеОкно);
КонецПроцедуры

//Подсчет времени на отправку.
&НаКлиенте
Процедура Отправка_ВремяОтправки(Кэш, ИдентификаторОтправки) Экспорт
	ДетализацияОтправки = Кэш.РезультатОтправки.ДетализацияОтправки.Получить(ИдентификаторОтправки);
	Если ДетализацияОтправки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДатКнц = Кэш.ОбщиеФункции.СбисТекущаяДатаВМиллисекундах(Кэш);
	ДетализацияОтправки.ВремяВыполнения = (ДатКнц - ДетализацияОтправки.ДатНач)/1000;
	Кэш.РезультатОтправки.ВремяОтправки = Кэш.РезультатОтправки.ВремяОтправки + ДетализацияОтправки.ВремяВыполнения;
КонецПроцедуры

//Отправляет в подготовленные пакеты пока есть свободные потоки
&НаКлиенте
Процедура Отправка_ОбработатьВКэшеПодготовленные(Кэш, ОжидатьСвободныеПотоки=Истина)
	Если Не	Кэш.РезультатОтправки.Свойство("ПодготовленныеКОтправке") Тогда
		Кэш.РезультатОтправки.Вставить("ПодготовленныеКОтправке", Новый Соответствие);
		Возврат;
	КонецЕсли;
	ПакетыОтправлены = Новый Массив;
	ОтправляемыеПакеты = Кэш.РезультатОтправки.ПодготовленныеКОтправке;
	Для Каждого КлючИЗначениеПодготовлен Из Кэш.РезультатОтправки.ПодготовленныеКОтправке Цикл
		Если 		ОжидатьСвободныеПотоки
			И	Не	Кэш.СБИС.ПараметрыИнтеграции.Потоки_КоличествоСвободных Тогда
			Прервать;
		ИначеЕсли Не	(	КлючИЗначениеПодготовлен.Значение.СтатусПакета = "Готов"
						Или	КлючИЗначениеПодготовлен.Значение.СтатусПакета = "Подготовка") Тогда
			Продолжить;
		КонецЕсли;
		Отправка_ДокументВСвободныйПоток(Кэш, КлючИЗначениеПодготовлен.Значение, Новый Структура("ДобавлятьВОчередь", Ложь));
		ПакетыОтправлены.Добавить(КлючИЗначениеПодготовлен.Ключ);
	КонецЦикла;
	Для Каждого ПакетОтправлен Из ПакетыОтправлены Цикл
		//Отправка должна проставить статус отправлен, иначе могло выйти так, что в процессе необходимо выполнить дополнительные действия и пакет пока не был отправлен
		Если Кэш.РезультатОтправки.ПодготовленныеКОтправке.Получить(ПакетОтправлен).СтатусПакета = "Отправлен" Тогда
			Кэш.РезультатОтправки.ПодготовленныеКОтправке.Удалить(ПакетОтправлен);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

//Отправляет в пакеты, упавшие с нефатальными ошибками
&НаКлиенте
Процедура Отправка_ОбработатьВКэшеПереотправляемые(Кэш, ОжидатьСвободныеПотоки=Истина)
	Если Не	Кэш.РезультатОтправки.Свойство("ПакетыДляПереотправки") Тогда
		Возврат;
	КонецЕсли;
	ОтправляемыеПакеты = Кэш.РезультатОтправки.ПакетыДляПереотправки;
	Пока	ОтправляемыеПакеты.Количество()
		И	(	Не	ОжидатьСвободныеПотоки
			Или		Кэш.СБИС.ПараметрыИнтеграции.Потоки_КоличествоСвободных) Цикл
		Отправка_ДокументВСвободныйПоток(Кэш, Новый Структура("СоставПакета,СтатусПакета", ОтправляемыеПакеты[0],"Подготовка"), Новый Структура("ДобавлятьВОчередь", Ложь));
		ОтправляемыеПакеты.Удалить(0);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Отправка_ОбработатьОтветыОтПлагина(Кэш)
	
	//Кэш = МестныйКэш;
	ДатаНачалаОбработки = Кэш.ОбщиеФункции.СбисТекущаяДатаВМиллисекундах(Кэш);
	СБИСПлагин_ОбработатьОтветы_Асинхронно(Кэш);
	//При вызове через файллоадер есть небольшой шанс того, что событие о закачке придёт раньше, чем оформится подписка.
	//Проверим наличие таких событий и вызовем их получение повторно.
	КлючиОбработаны = Новый Массив;
	Для Каждого КлючИЗначениеЗапросОтправлен Из Кэш.СБИС.ДанныеИнтеграции.Потоки Цикл
		ОтветПОлученРаньшеПодписки = Кэш.СБИС.ДанныеИнтеграции.НеизвестныеОтветы.Получить(КлючИЗначениеЗапросОтправлен.Ключ);
		Если ОтветПОлученРаньшеПодписки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ОтветОжидаетОбработки Из ОтветПОлученРаньшеПодписки Цикл
			Если СБИСПлагин_ВызватьСобытиеПоПодписке(Кэш, ОтветОжидаетОбработки.Ответ, Новый Структура("ПовторныйВызов", Истина)) Тогда
				КлючиОбработаны.Добавить(КлючИЗначениеЗапросОтправлен.Ключ);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	СБИСПлагин_ОчиститьНевостребованныеОтветы();
	//Запишем время, что ушло на обработку ответа от плагина.
	ДатаКонцаОбработки = Кэш.ОбщиеФункции.СбисТекущаяДатаВМиллисекундах(Кэш);
	Кэш.РезультатОтправки.ВремяОжиданияОтвета = Кэш.РезультатОтправки.ВремяОжиданияОтвета + (ДатаКонцаОбработки - ДатаНачалаОбработки) / 1000;
КонецПроцедуры
	
&НаКлиенте
Процедура Отправка_ОбработатьОшибкуОтправки(Кэш, Сбис3КомандаОтправки, СтруктураОшибки)
	
	ИдентификаторОтправки	= МодульОбъектаКлиент().АсинхроннаяСбискоманда_Получить(Сбис3КомандаОтправки, "Идентификатор");

	Если	СтруктураОшибки.details = "Необходимо аутентифицироваться для выполнения запросов к серверу"
		Или	СтруктураОшибки.details = "Недопустимый URI: Невозможно определить формат URI."
		Или Лев(СтруктураОшибки.details, 18) = "Ошибка авторизации" Тогда
		Если	Кэш.РезультатОтправки.Свойство("ВремяПоследнейАвторизации")
			И	Сбис3КомандаОтправки.ВремяВызова <= Кэш.РезультатОтправки.ВремяПоследнейАвторизации Тогда   
			// если уже переавторизовались, но получаем более ранние ответы с ошибкой авторизации
			Кэш.РезультатОтправки.ПакетыДляПереотправки.Добавить(Кэш.РезультатОтправки.СформированныеПакеты.Получить(ИдентификаторОтправки));
			Кэш.РезультатОтправки.КоличествоПереотправок = Кэш.РезультатОтправки.КоличествоПереотправок + 1;
			Возврат;
		ИначеЕсли	(	Кэш.Парам.ВходПоСертификату И Кэш.Парам.ЗапомнитьСертификат) 
				Или (Не	Кэш.Парам.ВходПоСертификату И Кэш.Парам.ЗапомнитьПароль) Тогда
			// переавторизуемся
			Попытка
		    	МодульОбъектаКлиент().АвторизоватьсяВSABY(Кэш.Парам);
				УспешнаяАвторизация = Истина;
			Исключение
				УспешнаяАвторизация =  Ложь;
			КонецПопытки;

			Если УспешнаяАвторизация = Истина Тогда
				Кэш.РезультатОтправки.Вставить("ВремяПоследнейАвторизации", ТекущаяДата());
				Если Не Кэш.РезультатОтправки.Свойство("ПакетыДляПереотправки") Тогда
					Кэш.РезультатОтправки.Вставить("ПакетыДляПереотправки", Новый Массив);
					Кэш.РезультатОтправки.Вставить("КоличествоПереотправок", 0);
				КонецЕсли;
				Кэш.РезультатОтправки.ПакетыДляПереотправки.Добавить(Кэш.РезультатОтправки.СформированныеПакеты.Получить(ИдентификаторОтправки));
				Кэш.РезультатОтправки.КоличествоПереотправок = Кэш.РезультатОтправки.КоличествоПереотправок+1;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли   СтруктураОшибки.code = 775
			Или (		СтруктураОшибки.Свойство("dump")
				И	Не	СтруктураОшибки.dump = Неопределено
				И		СтруктураОшибки.dump.Свойство("response")
				И		СтруктураОшибки.dump.response.Свойство("data")
				И		СтруктураОшибки.dump.response.data.Свойство("classid")
				И		Лев(Врег(СтруктураОшибки.dump.response.data.classid),28)="{00000000-0000-0000-0000-1AA") Тогда // нефатальная ошибка
		Если Не Кэш.РезультатОтправки.Свойство("НефатальныеОшибкиПодряд") Тогда
			Кэш.РезультатОтправки.Вставить("НефатальныеОшибкиПодряд", 0);
		КонецЕсли;
		Кэш.РезультатОтправки.НефатальныеОшибкиПодряд = Кэш.РезультатОтправки.НефатальныеОшибкиПодряд + 1;
		Если Кэш.РезультатОтправки.НефатальныеОшибкиПодряд = 5 Тогда
			Кэш.РезультатОтправки.Вставить("ПрерватьОтправку", "Повторите попытку позже. Получен ряд нефатальных ошибок: " + СтруктураОшибки.message + ?(СтруктураОшибки.Свойство("details") И СтруктураОшибки.message<>СтруктураОшибки.details, " ("+СтруктураОшибки.details+")", ""));
		КонецЕсли;
	ИначеЕсли Кэш.РезультатОтправки.Свойство("НефатальныеОшибкиПодряд") Тогда
		Кэш.РезультатОтправки.НефатальныеОшибкиПодряд = 0;
	КонецЕсли;
	Кэш.РезультатОтправки.НаЗаписьСтатусов.Ошибки.Вставить(ИдентификаторОтправки, СтруктураОшибки);

КонецПроцедуры

//Обрабатываем событие отправки на завершение FileLoader
&НаКлиенте
Функция Отправка_UploadToSbisDiskCompleteEvent(РезультатВызова, ПараметрыВызова) Экспорт
	Кэш = ПараметрыВызова.Кэш;
	//ИдентификаторПакета = ПараметрыВызова.РезультатПодготовки.СоставПакета.Идентификатор;
	РезультатПодготовки = ПараметрыВызова.РезультатПодготовки;	
	Если РезультатПодготовки.Отказ Тогда 
		//Что-то упало и уже обработано. В любом случае, дальше проверять нет смысла.
		Возврат Неопределено;
	КонецЕсли;
	ГотовКОтправке = Истина;
	Для Каждого ВложениеПакета Из РезультатПодготовки.ДокументОтправить.Вложение Цикл
		//Проверим пакет в отправке на предмет остальных запросов Future. Если есть, то ещё не готово, полученное почистим
		Если Не ВложениеПакета.Файл.Свойство("Future") Тогда
			Продолжить;
		КонецЕсли;
		Если РезультатВызова.data.UploadGuid = ВложениеПакета.Файл.Future Тогда
			ВложениеПакета.Файл.Удалить("Future");
			ВложениеПакета.Файл.Вставить("Ссылка", РезультатВызова.data.UploadId);
			Продолжить;
		КонецЕсли;
		ГотовКОтправке = Ложь;
	КонецЦикла;
	Если ГотовКОтправке Тогда
		РезультатПодготовки.СтатусПакета = "Готов";
	КонецЕсли;
КонецФункции

//Обрабатываем событие отправки на ошибку FileLoader
&НаКлиенте
Функция Отправка_UploadToSbisDiskFatalErrorEvent(РезультатВызова, ПараметрыВызова) Экспорт
	Кэш = ПараметрыВызова.Кэш;
	//ИдентификаторПакета = ПараметрыВызова.ИдентификаторПакета;
	
	РезультатПодготовки		= ПараметрыВызова.РезультатПодготовки;	
	ИдентификаторПакета		= РезультатПодготовки.СоставПакета.Идентификатор;
	ИдентификаторОтправки	= МодульОбъектаКлиент().АсинхроннаяСбискоманда_Получить(ПараметрыВызова.Команда, "Идентификатор");
	СбисИсключение			= Кэш.ОбщиеФункции.СбисИсключение(РезультатВызова,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".Отправка_Вызов");
	
	РезультатПодготовки.Ошибки.Добавить(СбисИсключение);			
	Если РезультатПодготовки.Отказ Тогда                                
		//При отправке пакета была другая ошибка
		Возврат Неопределено;
	КонецЕсли;
	РезультатПодготовки.Отказ = Истина;
	Если Кэш.РезультатОтправки.ПодготовленныеКОтправке.Получить(ИдентификаторПакета) = Неопределено Тогда
		//Нет подготовленного к отправке, значит ещё находимся в процессе подготовки пакета. Обработаем ошибку в общем порядке подготовки в Отправка_Вызов.
		Возврат Неопределено;
	КонецЕсли;	
	Кэш.РезультатОтправки.ПодготовленныеКОтправке.Удалить(ИдентификаторПакета);

	Отправка_ДобавитьСтатусВРезультатПоПакету(Кэш, ИдентификаторОтправки, РезультатПодготовки.СоставПакета);
	Отправка_ОбработатьОшибкуОтправки(Кэш, ПараметрыВызова.Команда, СбисИсключение);
	
КонецФункции

&НаКлиенте
Функция Отправка_UploadToSbisDisk_AfterCall(РезультатВызова, ПараметрыВызова) Экспорт
	//После вызова аплоада ставим пакету статус не готов, для ожидания ответа от сбисдиска
	ПараметрыВызова.РезультатПодготовки.СтатусПакета = "ОжиданиеОтветов";
КонецФункции

//Отправляет пакет в свободный поток или добавляет в очередь
&НаКлиенте
Процедура Отправка_ДокументВСвободныйПоток(Кэш, ДанныеОтправки, ДопПараметры)
	Потоки_МаксимальноеКоличество = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("Потоки_МаксимальноеКоличество");
	Потоки_КоличествоСвободных = Потоки_МаксимальноеКоличество - МодульОбъектаКлиент().ГлобальныйКэш_КоличествоАктивныхПотоков();
	
	Если Потоки_КоличествоСвободных Тогда
		//Есть свободный поток, сразу отправляем его в путь
	ИначеЕсли	ДопПараметры.ДобавлятьВОчередь//Есть место в кэше для подготовленных, добавим в очередь
			И	Кэш.РезультатОтправки.ПодготовленныеКОтправке.Количество() < Потоки_МаксимальноеКоличество Тогда
		ИдПакета = Неопределено;
		//Если у пакета нет ИД, то извлечем его из пользовательского, либо составим новый и добавим в пакет, чтобы при подготовке он был обработан
		Если Не ДанныеОтправки.СоставПакета.Свойство("Идентификатор", ИдПакета) Тогда
			ИдПакета = Отправка_ИдентификаторСоставаПакета(Кэш, ДанныеОтправки.СоставПакета);
			ДанныеОтправки.СоставПакета.Вставить("ВременныйИдентификатор", ИдПакета);
		КонецЕсли;
	
		Кэш.РезультатОтправки.ПодготовленныеКОтправке.Вставить(ИдПакета, ДанныеОтправки);
		Возврат;
	Иначе//Очередь заполнена, ждём, пока освободятся потоки. Пока идёт ожидание, записываем статусы по полученным ответам
		Пока Не Потоки_КоличествоСвободных Цикл 
			Отправка_ОбработатьОтветыОтПлагина(Кэш);
			Отправка_ЗаписатьСтатусыПоДокументам(Кэш);
			
			Потоки_КоличествоСвободных = Потоки_МаксимальноеКоличество - МодульОбъектаКлиент().ГлобальныйКэш_КоличествоАктивныхПотоков();
		КонецЦикла;
	КонецЕсли;
	Кэш.Интеграция.Отправка_Вызов(Кэш, ДанныеОтправки, ДопПараметры);
КонецПроцедуры

//Записываем статусы из полученных ответов
&НаКлиенте
Процедура Отправка_ЗаписатьСтатусыПоДокументам(Кэш) Экспорт
	//Кэш = МестныйКэш;
	Если Не Кэш.РезультатОтправки.Свойство("НаЗаписьСтатусов") Тогда
		Возврат;
	КонецЕсли;
		
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ЗаписатьПараметрыДокументовСБИС",Кэш.ФормаРаботыСоСтатусами,"",Кэш);
	Если Кэш.Парам.СостояниеЭД Тогда
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("ИмяФункции",	"ЗаписатьПараметрыДокументовСБИС");
		ПараметрыПоиска.Вставить("КлючФорм",	"Статусы_СостоянияЭД");
		фрмЭД = Кэш.ОбщиеФункции.сбисНайтиФормуФункцииПодсистемы(Кэш, ПараметрыПоиска);
	КонецЕсли;
	
	ИндексыДляУдаления = Новый СписокЗначений;
	ДанныеПоСтатусам = Новый Массив;
	Для СчетчикПоСтатусам = 0 По Кэш.РезультатОтправки.ДанныеПоСтатусам.Количество()-1 Цикл
		ЭлементДанныхСтатусов = Кэш.РезультатОтправки.ДанныеПоСтатусам[СчетчикПоСтатусам]; 
		//Получаем ответ, либо ошибку и пишем в статус
		СообщениеОтправки	= Кэш.РезультатОтправки.НаЗаписьСтатусов.Ответы.Получить(ЭлементДанныхСтатусов.Идентификатор);
		Если		СообщениеОтправки = Неопределено Тогда
			СообщениеОтправки = Кэш.РезультатОтправки.НаЗаписьСтатусов.Ошибки.Получить(ЭлементДанныхСтатусов.Идентификатор);
			Если СообщениеОтправки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ДокументСБИС_Статус = "Ошибка: " + СообщениеОтправки.message;
			Кэш.ОбщиеФункции.ДобавитьОшибкуВРезультат(Кэш, СообщениеОтправки, ЭлементДанныхСтатусов);
		ИначеЕсли	СообщениеОтправки.Свойство("Состояние") Тогда
			Кэш.РезультатОтправки.Отправлено = Кэш.РезультатОтправки.Отправлено + 1;
			ДокументСБИС_Статус = СообщениеОтправки.Состояние["Название"];
		Иначе
			ДокументСБИС_Статус = "Ошибка: В ответе отсутствует состояние документа.";
			СбисСтруктураОшибки = Кэш.ОбщиеФункции.СбисИсключение(, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".Отправка_ЗаписатьСтатусыПоДокументам",700,,"В ответе отсутствует состояние документа",Новый Структура("Ответ", СообщениеОтправки));
			Кэш.ОбщиеФункции.ДобавитьОшибкуВРезультат(Кэш, СбисСтруктураОшибки, ЭлементДанныхСтатусов);
		КонецЕсли;
		Для Каждого Стр Из ЭлементДанныхСтатусов.Статусы Цикл
			СтруктураСвойств = Новый Структура("ДокументСБИС_Ид,ДокументСБИС_ИдВложения,ДокументСБИС_Статус", Стр.СтруктураСвойств.ДокументСБИС_Ид, Стр.СтруктураСвойств.ДокументСБИС_ИдВложения, ДокументСБИС_Статус);
			СтрокаЗаписьСтатусы = Новый Структура("СтруктураСвойств, Документ1С, Регламент, ИдАккаунта", СтруктураСвойств, Стр.Документ1С, "", Кэш.Интеграция.ПолучитьИдТекущегоАккаунта(Кэш));
			Если Стр.Свойство("Регламент") Тогда
				СтрокаЗаписьСтатусы.Регламент = Стр.Регламент;
			КонецЕсли;
			ДанныеПоСтатусам.Добавить(СтрокаЗаписьСтатусы);
		КонецЦикла;
		ИндексыДляУдаления.Добавить(СчетчикПоСтатусам);
		Кэш.РезультатОтправки.ПолученоОтветов = Кэш.РезультатОтправки.ПолученоОтветов + 1;
	КонецЦикла;
	
	Кэш.РезультатОтправки.НаЗаписьСтатусов.Ошибки.Очистить();
	Кэш.РезультатОтправки.НаЗаписьСтатусов.Ответы.Очистить();
	
	Если Не ДанныеПоСтатусам.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНач = Кэш.ОбщиеФункции.СбисТекущаяДатаВМиллисекундах(Кэш);
	фрм.ЗаписатьПараметрыДокументовСБИС(ДанныеПоСтатусам, Кэш.Ини.Конфигурация, Кэш.ГлавноеОкно.Кэш.Парам.КаталогНастроек);
	// << alo 
	Если Не Кэш.Парам.СостояниеЭД Тогда 
	ИначеЕсли	Не фрмЭД = Неопределено
				И Не фрмЭД = Ложь Тогда
				
		фрмЭД.ЗаписатьПараметрыДокументовСБИС(ДанныеПоСтатусам, Кэш.Ини.Конфигурация, Кэш.ГлавноеОкно.Кэш.Парам.КаталогНастроек);
	Иначе 
		МодульОбъектаКлиент().СбисСообщить(Новый Структура("Текст", "Дублирование событий Saby в типовых регистрах 1с в данной конфигурации не поддерживается"));
	КонецЕсли;	// alo >>  	
	//Точка входа после отправки партии пакетов документов с данными по статусам.
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("сбисОбработатьСписокОтправленных","РаботаСДокументами1С","", Кэш);
	Если Не фрм = Ложь Тогда
		//Данные по детализации статусов и списка номенклатуры смотреть в кэше.
		Контекст = Новый Структура("ДанныеПоСтатусам", ДанныеПоСтатусам);//Структура для возможности расширения, если понадобится добавить что-то ещё.
		фрм.сбисОбработатьСписокОтправленных(Кэш, Контекст);
	КонецЕсли;
	//
	ДатаКнц = Кэш.ОбщиеФункции.СбисТекущаяДатаВМиллисекундах(Кэш);
	Кэш.РезультатОтправки.ВремяЗаписиСтатусов = Кэш.РезультатОтправки.ВремяЗаписиСтатусов+(ДатаКнц-ДатаНач)/1000;
	
	//Очищаем записанные статусы
	ИндексыДляУдаления.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	Для Каждого Элемент Из ИндексыДляУдаления Цикл
		Кэш.РезультатОтправки.ДанныеПоСтатусам.Удалить(Элемент.Значение);		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Отправка_ДобавитьСтатусВРезультатПоПакету(Кэш, ИдентификаторВызова, СоставПакета)
	//KES 050751151 ver 2 Статусы в разрезе регламентов ExtSDK-->
	МассивСтатусРегламент = Новый Массив;
	Если  Кэш.ФормаРаботыСоСтатусами = "Статусы_Регистры" 
		И Кэш.ини.Конфигурация.Свойство("СтатусРегламент") Тогда
			МассивСтатусРегламент =  Кэш.ОбщиеФункции.РазбитьСтрокуВМассивНаКлиенте(Кэш.ини.Конфигурация.СтатусРегламент.Значение,",");
	КонецЕсли;
	//<--KES 0507511151 ver 2 Статусы в разрезе регламентов ExtSDK

	Статусы = Новый Массив;
	//KES 050751151 ver 2 Статусы в разрезе регламентов ExtSDK-->
	СтатусРегламент = "";
	Если СоставПакета.Свойство("Регламент")
		 И ЗначениеЗаполнено(СоставПакета.Регламент)
		И СоставПакета.Регламент.Свойство("Название") 
		И НЕ МассивСтатусРегламент.Найти(СоставПакета.Регламент.Название)=Неопределено Тогда
		СтатусРегламент = СоставПакета.Регламент.Название; 
	КонецЕсли;
	//<-- KES 050751151 ver 2 Статусы в разрезе регламентов ExtSDK
	
	Для Каждого Вложение Из СоставПакета.Вложение Цикл
		Если Не Вложение.Свойство("Документы1С") Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого Документ1С Из Вложение.Документы1С Цикл
			СтруктураСвойств = Новый Структура("ДокументСБИС_Ид,ДокументСБИС_ИдВложения,ДокументСБИС_Статус", СоставПакета.Идентификатор,Вложение.Идентификатор,);
			//KES 050751151 ver 2 Статусы в разрезе регламентов ExtSDK-->
			Статусы.Добавить(Новый Структура("СтруктураСвойств, Документ1С, Регламент", СтруктураСвойств, Документ1С.Значение, СтатусРегламент));
			//<-- KES 050751151 ver 2 Статусы в разрезе регламентов ExtSDK
		КонецЦикла;
	КонецЦикла;
	
	ОсновнойДокумент1С = Неопределено;
	Если	СоставПакета.Вложение.Количество()
		И	СоставПакета.Вложение[0].Свойство("Документы1С") Тогда
		ОсновнойДокумент1С = СоставПакета.Вложение[0].Документы1С[0].Значение;
	КонецЕсли;
	Кэш.РезультатОтправки.ДанныеПоСтатусам.Добавить(Новый Структура("Идентификатор, ОсновнойДокумент1С, Статусы", ИдентификаторВызова, ОсновнойДокумент1С, Статусы));
КонецПроцедуры
	
&НаКлиенте
Функция Отправка_ПодготовитьСтруктуруПакета(Кэш, ПараметрыПодготовки, ДопПараметры, Отказ) Экспорт
	
	ПараметрыПодготовки.ДокументОтправить = МодульОбъектаКлиент().СоставПакета_Выгрузить(ПараметрыПодготовки.СоставПакета);
	ПараметрыПодготовки.СтатусПакета = "Готов";
		
	Возврат ПараметрыПодготовки;
	
КонецФункции

&НаКлиенте
Функция Отправка_ИдентификаторСоставаПакета(Кэш, СоставПакета) Экспорт
	Перем ИдПакета;
	Если СоставПакета.Свойство("ВременныйИдентификатор", ИдПакета) Тогда
	ИначеЕсли СоставПакета.Свойство("ПользовательскийИдентификатор", ИдПакета) и Не (СоставПакета.Свойство("Контрагент") и СоставПакета.Контрагент.Свойство("ЗапретРедакций")) Тогда
		ИдПакета = Сред(ИдПакета,Найти(ИдПакета,":")+1);
	Иначе
		ИдПакета = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	Возврат ИдПакета;
КонецФункции

//Готовит пакет к отправке, формиует события-обработчики, делает вызов
//ПараметрыОтправки - СоставПакета, ДокументОтправить
&НаКлиенте
Процедура Отправка_Вызов(Кэш, ПараметрыОтправки, ДопПараметры) Экспорт
	Отказ = Ложь;
	ПараметрыВыполнить = Новый Структура("СоставПакета, СтатусПакета, Отказ, Ошибки, ДокументОтправить", ПараметрыОтправки.СоставПакета, ПараметрыОтправки.СтатусПакета, Ложь, Новый Массив);
	Сбис3Команда = СБИСПлагин_Команда(Кэш, "WriteDocumentEx2",,,Отказ);
	Если Отказ Тогда
		//Упал метод генерации queryID, прерываем отправку.
		Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, Сбис3Команда);
		Кэш.РезультатОтправки.Вставить("ПрерватьОтправку", Сбис3Команда.details);
		Возврат;
	КонецЕсли;
	Если Не ПараметрыОтправки.Свойство("ДокументОтправить", ПараметрыВыполнить.ДокументОтправить) Тогда
		//Переадресация на форму интеграции для КриптоExtSDK
		Результат = Кэш.Интеграция.Отправка_ПодготовитьСтруктуруПакета(Кэш, ПараметрыВыполнить, Новый Структура, Отказ);
		Если Результат.Отказ Тогда
			ОшибкаПодготовки = Результат.Ошибки[0];//Пока завязка на первую ошибку
			//Чтобы ошибка подготовки пакета попала в итоговый результат
			ИдентификаторОтправки = МодульОбъектаКлиент().АсинхроннаяСбискоманда_Получить(Сбис3Команда, "Идентификатор");
			Отправка_ДобавитьСтатусВРезультатПоПакету(Кэш, ИдентификаторОтправки, ПараметрыОтправки.СоставПакета);
			Отправка_ОбработатьОшибкуОтправки(Кэш, Сбис3Команда, Кэш.ОбщиеФункции.СбисИсключение(ОшибкаПодготовки,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".Отправка_Вызов"));
			Возврат;
		КонецЕсли;
		//Счетчик по обработанным документам
		Кэш.РезультатОтправки.ПорНомер = Кэш.РезультатОтправки.ПорНомер + 1;
	КонецЕсли;
	Если ПараметрыВыполнить.СтатусПакета = "Готов" Тогда
		Сбис3Команда.ВремяОжиданияОтвета = Кэш.СБИС.ПараметрыИнтеграции.ВремяОжиданияОтвета_Отправка;
		Сбис3Команда.Параметры = Новый Структура("document_in, prepare", ПараметрыВыполнить.ДокументОтправить, Истина);
		
		ПараметрыСобытий = Новый Структура("Кэш, СоставПакета", Кэш, ПараметрыОтправки.СоставПакета);
		Сбис3Команда.События.Вставить("Error",			Новый Структура("Функция, Параметры",	"WriteDocumentEx_Error",		ПараметрыСобытий));
		Сбис3Команда.События.Вставить("Message",		Новый Структура("Функция, Параметры",	"WriteDocumentEx_Message",		ПараметрыСобытий));
		Сбис3Команда.События.Вставить("НеПолученОтвет",	Новый Структура("Функция, Параметры",	"WriteDocumentEx_Error",		ПараметрыСобытий));
		Сбис3Команда.События.Вставить("Before_Call",	Новый Структура("Функция, Параметры",	"WriteDocumentEx_Before_Call",	ПараметрыСобытий));
		Сбис3Команда.События.Вставить("After_Call",		Новый Структура("Функция, Параметры",	"WriteDocumentEx_After_Call",	ПараметрыСобытий));
				
		Результат = СБИСПлагин_ОтправитьКоманду_Асинхронно(Кэш, Сбис3Команда, ДопПараметры, Отказ);
		ПараметрыОтправки.СтатусПакета = "Отправлен";
		Если Отказ Тогда
			
			ИдентификаторОтправки	= МодульОбъектаКлиент().АсинхроннаяСбискоманда_Получить(Сбис3Команда, "Идентификатор");
			Сбис3Команда.Ответ = Кэш.ОбщиеФункции.СбисИсключение(Результат.Ответ,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".Отправка_Вызов");
			Отправка_ДобавитьСтатусВРезультатПоПакету(Кэш, ИдентификаторОтправки, ПараметрыОтправки.СоставПакета);
			Отправка_ОбработатьОшибкуОтправки(Кэш, Сбис3Команда, Сбис3Команда.Ответ);
		КонецЕсли;
	Иначе
		//Добавим пакет в очередь, пока не будет проставлена пометка Готов
		Кэш.РезультатОтправки.ПодготовленныеКОтправке.Вставить(ПараметрыВыполнить.СоставПакета.Идентификатор, ПараметрыВыполнить);
	КонецЕсли;
	
КонецПроцедуры

//Завершает отправку ВСЕХ пакетов - доотправляет накопленные в кэше, отправляет статистику на БЛ
&НаКлиенте
Процедура Отправка_Завершение(Кэш);
	//Доотправляем всё накопленное
	Если Не Кэш.РезультатОтправки.Свойство("ПрерватьОтправку") Тогда
		//Минимум 1 проход должен быть
		Отправка_ОбработатьОтветыОтПлагина(Кэш);
		Отправка_ОбработатьВКэшеПодготовленные(Кэш, Ложь);
		Отправка_ОбработатьВКэшеПереотправляемые(Кэш, Ложь);
		Отправка_ЗаписатьСтатусыПоДокументам(Кэш);
	КонецЕсли;

	Если Не Кэш.РезультатОтправки.Свойство("КоличествоПереотправок") Тогда
		Кэш.РезультатОтправки.Вставить("КоличествоПереотправок", 0);
	КонецЕсли;
	
	//Пока всё не обработается/отвалится с ошибкой
	Пока Кэш.РезультатОтправки.ПолученоОтветов < Кэш.РезультатОтправки.ПорНомер - Кэш.РезультатОтправки.КоличествоПереотправок Цикл
		Отправка_ОбработатьОтветыОтПлагина(Кэш);
		Отправка_ОбработатьВКэшеПодготовленные(Кэш, Ложь);
		Отправка_ОбработатьВКэшеПереотправляемые(Кэш, Ложь);
		Отправка_ЗаписатьСтатусыПоДокументам(Кэш);
	КонецЦикла;
	
	Кэш.ОбщиеФункции.сбисСтатистика_СформироватьИЗаписатьСтатистикуНаСервис(Кэш, Новый Структура("Действие", "Отправка"),Ложь);
КонецПроцедуры

////////////Обертки///////////////

&НаКлиенте
Функция СБИСПлагин_ИнформацияОСлужебныхЭтапах(Кэш, param, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "ReadServiceStagesInfo", param, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_ИнформацияОСлужебныхЭтапах");
	КонецЕсли;
	Возврат Результат
КонецФункции

//Обработка внешнего файла в FileLoader. 
//ДанныеФайла - параметры обрабатываемого файла. Файл - структура в списке вложений. Вложение - обрабатываемое вложение состава пакета
//ПараметрыПодготовки - параметры обрабатываемого пакета документов.
&НаКлиенте
Процедура СБИСПлагин_ОбработатьВнешнийФайл(Кэш, ДанныеФайла, ПараметрыПодготовки) Экспорт
	ДанныеФайла.Файл.Вставить("Future", Неопределено);
	ОшибкаОтправкиФайла = Ложь;
	//Отдаём по ссылке РезультатПодготовки как параметр, куда положим ссылку в случае завершения заливки и получения события раньше, чем успеем обработать весь пакет.
	СбисПараметрыСобытия = Новый Структура("Кэш, РезультатПодготовки", Кэш, ПараметрыПодготовки);
	СбисОбработчикиСобытий = Новый Структура;
	СбисОбработчикиСобытий.Вставить("After_Call",						Новый Структура("Функция, Параметры", "Отправка_UploadToSbisDisk_AfterCall",		СбисПараметрыСобытия));
	СбисОбработчикиСобытий.Вставить("UploadToSbisDiskCompleteEvent",	Новый Структура("Функция, Параметры", "Отправка_UploadToSbisDiskCompleteEvent",		СбисПараметрыСобытия));
	СбисОбработчикиСобытий.Вставить("UploadToSbisDiskCompleteEvent",	Новый Структура("Функция, Параметры", "Отправка_UploadToSbisDiskCompleteEvent",		СбисПараметрыСобытия));
	СбисОбработчикиСобытий.Вставить("UploadToSbisDiskFatalErrorEvent",	Новый Структура("Функция, Параметры", "Отправка_UploadToSbisDiskFatalErrorEvent",	СбисПараметрыСобытия));
	СбисОбработчикиСобытий.Вставить("НеПолученОтвет",					Новый Структура("Функция, Параметры", "Отправка_UploadToSbisDiskFatalErrorEvent",	СбисПараметрыСобытия));
	
	РезультатОтправки = ОтправитьФайлНаСбисДиск(Кэш, ДанныеФайла.Вложение.ПолноеИмяФайла, Новый Структура("ВремяОжиданияОтвета, События", Кэш.СБИС.ПараметрыИнтеграции.ВремяОжиданияОтвета_Отправка, СбисОбработчикиСобытий), ОшибкаОтправкиФайла);
	Если ОшибкаОтправкиФайла Тогда
		ПараметрыПодготовки.Отказ = Истина;
		ПараметрыПодготовки.Ошибки.Добавить(РезультатОтправки);
		Возврат;
	КонецЕсли;
	ДанныеФайла.Файл.Future = РезультатОтправки;
КонецПроцедуры

//Обработка XML файла при отправке. 
//ДанныеФайла - параметры обрабатываемого файла. Файл - структура в списке вложений. Вложение - обрабатываемое вложение состава пакета
//ПараметрыПодготовки - параметры обрабатываемого пакета документов.
&НаКлиенте
Процедура СБИСПлагин_ОбработатьXMLФайл(Кэш, ДанныеФайла, ПараметрыПодготовки) Экспорт
	ДанныеФайла.Файл.Вставить("ДвоичныеДанные", сбисСтрокаВBASE64(ДанныеФайла.Вложение.XMLДокумента)); 
КонецПроцедуры
	
&НаКлиенте
Функция СБИС_ПрочитатьДокументКакHTML(Кэш, param, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "ReadDocumentAsHTML", param, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИС_ПрочитатьДокументКакHTML", , "Не удалось сформировать печатную форму. Повторите попытку позднее", , Новый Структура("Error", Результат));
	КонецЕсли;
	Возврат Результат
КонецФункции	

&НаКлиенте
Функция СБИСПлагин_ИмпортНоменклатурыИзCML(Кэш, param, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "ImportNomenclatureFromCML", param, ДопПараметры, Отказ); 
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_ИмпортНоменклатурыИзCML");
	КонецЕсли;
	Возврат Результат
КонецФункции

&НаКлиенте
Функция СБИСПлагин_ЗаписатьСотрудника(Кэш, param, ДопПараметры, Отказ) Экспорт
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Параметр", param);
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "LoadEmployee", ПараметрыКоманды, ДопПараметры,Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_ЗаписатьСотрудника");
	КонецЕсли;
	Возврат Результат
КонецФункции

&НаКлиенте
Функция СБИСПлагин_ОбработкаСлужебныхЭтапов(Кэш, param, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "ProcessServiceStagesEx", param, ДопПараметры, Отказ);
	Если Отказ Тогда
		Возврат Кэш.ОбщиеФункции.сбисИсключение(Результат,  Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_ОбработкаСлужебныхЭтапов");
	КонецЕсли;
	Возврат Результат
КонецФункции
	
&НаКлиенте
Функция СБИСПлагин_СписокДокументов(Кэш, filter, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "ReadDocuments", filter, ДопПараметры, Отказ);
	Если Отказ Тогда
		Результат = Кэш.ОбщиеФункции.СбисИсключение(Результат, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".ReadDocuments");
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СБИСПлагин_СписокИзменений(Кэш, filter, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "ReadChanges", filter, ДопПараметры,Отказ);
	Если Отказ Тогда
		Результат = Кэш.ОбщиеФункции.СбисИсключение(Результат, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_СписокИзменений");
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СБИСПлагин_СписокНашихОрганизаций(Кэш, filter, ДопПараметры, Отказ) Экспорт
	Результат = СбисОтправитьИОбработатьКоманду(Кэш, "ReadOurOrganizations", filter, ДопПараметры, Отказ);
	Если Отказ Тогда
		Результат = Кэш.ОбщиеФункции.СбисИсключение(Результат, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_СписокНашихОрганизаций");
	КонецЕсли;
	Возврат Результат;
КонецФункции

/////////ОберткиОбщие/////////////

#Область include_core2_vo2_СпособыОбмена_ExtSDK_ВнешниеВызовы
#КонецОбласти

#Область include_core2_vo2_СпособыОбмена_ExtSDK_1_ВнешниеОбертки
#КонецОбласти

#Область include_core2_vo2_СпособыОбмена_ExtSDK_1_АсинхронныеСобытия
#КонецОбласти

#Область include_core2_vo2_СпособыОбмена_ExtSDK_1_XMLКонвертер
#КонецОбласти

&НаКлиенте
Функция СБИС_РазобратьОтвет(ДанныеИзПулаОтвета) Экспорт
	
	Node = Новый ЧтениеXML();
	Node.УстановитьСтроку(ДанныеИзПулаОтвета);
	Если Не Node.Прочитать() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Попытка
		Результат = XmlSerializer_DecodeNode(Node, Новый Структура("Тип,Путь",Node.Имя,"Ответ"));
	Исключение
		МодульОбъектаКлиент().ВызватьСбисИсключение(, МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИнтеграцияИмя") + ".СБИС_РазобратьОтвет", 773,,ИнформацияОбОшибке().Описание, Новый Структура("message", ДанныеИзПулаОтвета));
	КонецПопытки;
	Node.Закрыть();
	Node = Неопределено;
	Возврат Результат; 
	
КонецФункции

#Область include_core2_vo2_СпособыОбмена_ExtSDK_1_СбисОтправитьИОбработатьКоманду
#КонецОбласти

#Область include_core2_vo2_СпособыОбмена_ExtSDK_1_old_ЧтениеОтветов
#КонецОбласти
