
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

// Добавляет СБИСПлагин в Кэш
&НаКлиенте
Функция Включить(Кэш, ДопПараметры = Неопределено, Отказ = Ложь) Экспорт
	
	ФормаExtSDK = МодульОбъектаКлиент().МодульИнтеграцииСБИС("ExtSDK2");
	// Меняем модуль интеграции, т.к. вызовы будут идти на него.
	МодульОбъектаКлиент().ИзменитьПараметрСбис("Интеграция", ФормаExtSDK);

	Результат = ФормаExtSDK.Включить(Кэш, ДопПараметры, Отказ);
	
	Если Отказ Тогда
		
		Возврат Результат;
		
	КонецЕсли;

	СведенияОбИнтеграции = СведенияОбИнтеграции();
	МодульОбъектаКлиент().ИзменитьПараметрТекущегоСеанса("СведенияОбИнтеграции", СведенияОбИнтеграции);
	
	Для Каждого ПараметрИнтеграции Из СведенияОбИнтеграции.Параметры Цикл
		
		МодульОбъектаКлиент().ИзменитьПараметрСбис(ПараметрИнтеграции.Ключ, ПараметрИнтеграции.Значение);
		
	КонецЦикла;

	ФормаExtSDK.ПолучитьНастройкиПлагина(Кэш, Новый Структура(), Ложь);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СведенияОбИнтеграции() Экспорт

	ФормаExtSDK = МодульОбъектаКлиент().МодульИнтеграцииСБИС("ExtSDK2");
	
	СведенияОбИнтеграции = ФормаExtSDK.СведенияОбИнтеграции();
 	СведенияОбИнтеграции.Вставить("Заголовок", СведенияОбИнтеграции.Имя + "(Шифрование)");
	
	СведенияОбИнтеграции.Имя = "ExtSDK2Crypto";
	СведенияОбИнтеграции.Параметры.ГенераторФЭД = Ложь;
	СведенияОбИнтеграции.Параметры.Шифрование	= Истина;

	Возврат СведенияОбИнтеграции;
	
КонецФункции

// Функция для переопределения видимости настроек для способа интеграции
// 
// Возвращаемое значение: Структура
//   - 
//
&НаКлиенте
Функция ВидимостьНастроек() Экспорт
	
	Настройки = МодульОбъектаКлиент().ВидимостьНастроекПоУмолчанию();	
	Настройки.ВремяОжиданияОтвета = Истина;
	
	Возврат Настройки;
	
КонецФункции
