
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

// функции для совместимости кода
&НаКлиенте
Функция сбисПолучитьФорму(СбисИмяФормы)
	Возврат ВладелецФормы.сбисПолучитьФорму(СбисИмяФормы);
КонецФункции
&НаКлиенте
Функция сбисЭлементФормы(Форма,ИмяЭлемента)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Форма.Элементы.Найти(ИмяЭлемента);
	КонецЕсли;
	Возврат Форма.ЭлементыФормы.Найти(ИмяЭлемента);
КонецФункции
&НаКлиенте
Процедура сбисПоказатьСостояние(ТекстСостояния, Форма = Неопределено, Индикатор = Неопределено, Пояснение = "")
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Состояние(ТекстСостояния,Индикатор,Пояснение);
	Иначе
		Форма.ЭлементыФормы.ПанельОжидания.Видимость = Истина;
		Форма.НадписьОжидания = Символы.ПС + ТекстСостояния;
		Форма.НадписьПояснение = Пояснение;
		Если Индикатор<>Неопределено Тогда
			Форма.ЭлементыФормы.Индикатор.Видимость = Истина;
			Форма.ЭлементыФормы.Индикатор.Значение = Индикатор;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
&НаКлиенте
Процедура сбисСпрятатьСостояние(Форма = Неопределено)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
	Иначе
		Форма.ЭлементыФормы.ПанельОжидания.Видимость = Ложь;
		Форма.ЭлементыФормы.Индикатор.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры
//------------------------------------------------------
&НаКлиенте
функция ПолучитьСертификатыДляАктивации(Кэш, СписокИНН) Экспорт
	// функция активирует серверные сертификаты для определенного списка ИНН	
	СписокСертификатовДляАктивации = Новый СписокЗначений;;
	Возврат СписокСертификатовДляАктивации;
КонецФункции
&НаКлиенте
Функция ПолучитьСписокСертификатовПоФильтру(Кэш, filter=Неопределено, Отказ)
	Возврат Новый СписокЗначений();	
КонецФункции
&НаКлиенте
Функция ПолучитьСписокЛокальныхСертификатов() Экспорт
	Возврат Новый СписокЗначений();
КонецФункции
&НаКлиенте
функция АктивироватьСерверныеСертификаты(Кэш, СписокСертификатов) Экспорт
	// функция активирует серверные сертификаты для определенного списка ИНН	
	Возврат Истина;
КонецФункции
&НаКлиенте
Функция сбисПодписант(Кэш, ИНН) Экспорт
// Получает Информацию о подписанте документа
	Возврат Новый Структура("Должность,ФИО,ИНН");
КонецФункции
&НаКлиенте
Функция сбисИдентификаторУчастника(Кэш, ИНН, КПП, Название) Экспорт
// Получает Информацию о контрагенте с онлайна
	Возврат "";
КонецФункции
&НаКлиенте
Функция ОтправитьПакетыДокументов(Кэш, МассивПакетов) Экспорт
// Выгружает сформированные пакеты документов в каталог
	КаталогОтправкиИмя = Кэш.Парам.КаталогОбмена+"\Отправляемые\";
	КаталогОтправки = Новый Файл(КаталогОтправкиИмя);
	Если Не КаталогОтправки.Существует() Тогда
		СоздатьКаталог(КаталогОтправкиИмя);
	КонецЕсли;
	ГлавноеОкно = Кэш.ГлавноеОкно;
	фрм = ГлавноеОкно.сбисНайтиФормуФункции("ЗаписатьПараметрыДокументовСБИС",Кэш.ФормаРаботыСоСтатусами,"",Кэш);
	// << alo 
	если Кэш.парам.СостояниеЭД тогда
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("ИмяФункции",	"ЗаписатьПараметрыДокументовСБИС");
		ПараметрыПоиска.Вставить("КлючФорм",	"Статусы_СостоянияЭД");
		фрмЭД = Кэш.ОбщиеФункции.сбисНайтиФормуФункцииПодсистемы(Кэш, ПараметрыПоиска);
	конецесли;
	// alo >>
	сбисПоказатьСостояние("Отправка документов", ГлавноеОкно);
	ВсегоОтправлено = 0;
	ВсегоОшибок = 0;
	КоличествоПакетов = МассивПакетов.Количество();
	ДанныеПоСтатусам = Новый Массив;
		
	Для Каждого СоставПакета Из МассивПакетов Цикл
	    Попытка
			СтруктураКонверта = Новый Структура("СписокДокумент", Новый Структура("Документ", Новый Структура));
			Если СоставПакета.Свойство("ПользовательскийИдентификатор") Тогда
				СтруктураКонверта.СписокДокумент.Документ.Вставить("ПользовательскийИдентификатор", СоставПакета.ПользовательскийИдентификатор);
		    КонецЕсли;
			Если СоставПакета.Свойство("ПользовательскийИдентификатор") и Не (СоставПакета.Свойство("Контрагент") и СоставПакета.Контрагент.Свойство("ЗапретРедакций")) Тогда
				ИдПакета = Сред(СоставПакета.ПользовательскийИдентификатор,Найти(СоставПакета.ПользовательскийИдентификатор,":")+1);
			Иначе
				ИдПакета = строка(Новый УникальныйИдентификатор());
			КонецЕсли;
			СоставПакета.Вставить("Идентификатор", ИдПакета);
			СтруктураКонверта.СписокДокумент.Документ.Вставить("Идентификатор", СоставПакета.Идентификатор);
			СтруктураКонверта.СписокДокумент.Документ.Вставить("Тип", СоставПакета.Тип);
			Если СоставПакета.Свойство("Подтип") и ЗначениеЗаполнено(СоставПакета.Подтип) Тогда
				СтруктураКонверта.СписокДокумент.Документ.Вставить( "Подтип",СоставПакета.Подтип);
			КонецЕсли;
			
			Если СоставПакета.Свойство("Дата") и ЗначениеЗаполнено(СоставПакета.Дата) Тогда
				СтруктураКонверта.СписокДокумент.Документ.Вставить( "Дата",СоставПакета.Дата);	
			КонецЕсли;
			Если СоставПакета.Свойство("Номер") и ЗначениеЗаполнено(СоставПакета.Номер) Тогда
				СтруктураКонверта.СписокДокумент.Документ.Вставить( "Номер",СоставПакета.Номер);	
			КонецЕсли;
			Если СоставПакета.Свойство("Сумма") и ЗначениеЗаполнено(СоставПакета.Сумма) Тогда
				СтруктураКонверта.СписокДокумент.Документ.Вставить("Сумма", СоставПакета.Сумма);	
			КонецЕсли;
			Если СоставПакета.Свойство("Примечание") и ЗначениеЗаполнено(СоставПакета.Примечание) Тогда
				СтруктураКонверта.СписокДокумент.Документ.Вставить("Примечание", СоставПакета.Примечание);	
			КонецЕсли;
			Если СоставПакета.Свойство("Регламент") и (СоставПакета.Регламент.Свойство("Идентификатор") или СоставПакета.Регламент.Свойство("Название")) Тогда
				СтруктураКонверта.СписокДокумент.Документ.Вставить("Регламент", СоставПакета.Регламент);
			КонецЕсли;
			Если СоставПакета.Свойство("Ответственный") и СоставПакета.Ответственный.Количество()>0 Тогда
				СтруктураКонверта.СписокДокумент.Документ.Вставить("Ответственный", СоставПакета.Ответственный);
			КонецЕсли;
			Если СоставПакета.Свойство("Подразделение") и СоставПакета.Подразделение.Количество()>0 Тогда
				СтруктураКонверта.СписокДокумент.Документ.Вставить("Подразделение", СоставПакета.Подразделение);
			КонецЕсли;
			
			Если СоставПакета.Свойство("ДокументОснование") и СоставПакета.ДокументОснование.Количество()>0 Тогда
				Основания = Новый Массив;
				Для Каждого ДокОсн Из СоставПакета.ДокументОснование Цикл 
					Осн = Новый Структура;
					Док = Новый Структура;
					Для Каждого Элемент Из ДокОсн Цикл
						Док.Вставить( Элемент.Ключ, Элемент.Значение );	
					КонецЦикла;
					Осн.Вставить( "Документ", Док );
					Основания.Добавить(Осн);
				КонецЦикла;
				СтруктураКонверта.СписокДокумент.Документ.Вставить("СписокДокументОснование", Новый Структура("ДокументОснование", Основания));
			КонецЕсли;

			СтруктураКонверта.СписокДокумент.Документ.Вставить("НашаОрганизация", Новый Структура);
			Если СоставПакета.НашаОрганизация.Свойство("СвФЛ") Тогда
				СтруктураКонверта.СписокДокумент.Документ.НашаОрганизация.Вставить("СвФЛ", СоставПакета.НашаОрганизация.СвФЛ);
			Иначе
				СтруктураКонверта.СписокДокумент.Документ.НашаОрганизация.Вставить("СвЮЛ", СоставПакета.НашаОрганизация.СвЮЛ);
			КонецЕсли;  
			
			Если СоставПакета.Свойство("Контрагент") Тогда
				kontr = МодульОбъектаКлиент().СоставПакета_СтруктураКонтрагентаДляОтправки(СоставПакета);
				СтруктураКонверта.СписокДокумент.Документ.Вставить("Контрагент", kontr);
				КодФилиалаОтправителя = МодульОбъектаКлиент().ПрочитатьДополнительныйПараметрСтороны(СоставПакета.Контрагент, "КодФилиалаОтправителя");
				Если ЗначениеЗаполнено(КодФилиалаОтправителя) Тогда
					Если СоставПакета.НашаОрганизация.Свойство("СвФЛ") Тогда
						СтруктураКонверта.СписокДокумент.Документ.НашаОрганизация.СвФЛ.Вставить("КодФилиала",КодФилиалаОтправителя); 
					Иначе
						СтруктураКонверта.СписокДокумент.Документ.НашаОрганизация.СвЮЛ.Вставить("КодФилиала",КодФилиалаОтправителя); 
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Вложения = Новый Массив;
			Для Каждого Вложение Из СоставПакета.Вложение Цикл
				ИдВложения = Строка(Новый УникальныйИдентификатор());
				СбисСсылкаНаФайл = "";
				Если Вложение.Свойство("ПолноеИмяФайла") Тогда // внешний файл добавлен в пакет
					ИмяФайла = Вложение.ИмяФайла;
					СбисСсылкаНаФайл = ИдВложения + "_" + ИмяФайла;
					КопироватьФайл(Вложение.ПолноеИмяФайла, КаталогОтправкиИмя + СбисСсылкаНаФайл);
				Иначе  // сформирован xml
					ИмяФайла = Вложение.СтруктураФайла.Файл.Имя+".xml";
					СбисСсылкаНаФайл = ИмяФайла;
					ИсхФайл = Новый ТекстовыйДокумент;
					ИсхФайл.УстановитьТекст(Вложение.XMLДокумента);
					ПолноеИмяФайла = КаталогОтправкиИмя+ИмяФайла;
					ИсхФайл.Записать(ПолноеИмяФайла,"windows-1251");
				КонецЕсли;
				Вложение.Вставить("Идентификатор", ИдВложения);
				СтруктураВложения = Новый Структура("Идентификатор, Файл",ИдВложения, Новый Структура("СсылкаНаФайл,Имя",СбисСсылкаНаФайл,ИмяФайла));
				Если Вложение.Свойство("Дата") Тогда
					СтруктураВложения.Вставить("Дата",Вложение.Дата);
				КонецЕсли;
				Если Вложение.Свойство("Номер") Тогда
					СтруктураВложения.Вставить("Номер",Вложение.Номер);
				КонецЕсли;
				Вложения.Добавить(СтруктураВложения);
			КонецЦикла;
			СтруктураКонверта.СписокДокумент.Документ.Вставить("СписокВложение", Новый Структура("Вложение", Вложения));		
			ОшибкаПреобразования = Ложь;
			ШаблонXML = Кэш.ОбщиеФункции.СбисПреобразоватьДокументВXML(СтруктураКонверта, Кэш.СовместимостьМетодов, ОшибкаПреобразования);
			Если ОшибкаПреобразования Тогда
				СбисПараметрыОшибки = Новый Структура("ОсновнойДокумент1С");
				Если СоставПакета.Вложение[0].Документы1С.Количество() Тогда
					СбисПараметрыОшибки.ОсновнойДокумент1С = СоставПакета.Вложение[0].Документы1С[0].Значение;
				КонецЕсли;
				Кэш.ОбщиеФункции.ДобавитьОшибкуВРезультат(Кэш, ШаблонXML, СбисПараметрыОшибки);
				Возврат Ложь;
			КонецЕсли;				
			КонвертФайл = Новый ТекстовыйДокумент;
			КонвертФайл.УстановитьТекст(ШаблонXML);
			ИмяФайла = "KONVERT"+"__"+Формат(ТекущаяДата(),"ДФ=yyyyMMdd")+"_"+строка(Новый УникальныйИдентификатор())+".native.xml";
			ПолноеИмяФайла = КаталогОтправкиИмя+ИмяФайла;
			КонвертФайл.Записать(ПолноеИмяФайла,"windows-1251");		
			СоставПакета.Вставить("Отправлен", Истина);
			ВсегоОтправлено = ВсегоОтправлено + 1;
			Кэш.РезультатОтправки.Отправлено = Кэш.РезультатОтправки.Отправлено + 1;
		Исключение
			СбисОшибка = Кэш.ОбщиеФункции.СбисИсключение(ОписаниеОшибки(), "ИнтеграцияКаталог.ОтправитьПакетыДокументов");
			СбисПараметрыОшибки = Новый Структура("ОсновнойДокумент1С");
			Если СоставПакета.Вложение[0].Документы1С.Количество() Тогда
				СбисПараметрыОшибки.ОсновнойДокумент1С = СоставПакета.Вложение[0].Документы1С[0].Значение;
			КонецЕсли;
			Кэш.ОбщиеФункции.ДобавитьОшибкуВРезультат(Кэш, СбисОшибка, СбисПараметрыОшибки);
			Продолжить;	
		КонецПопытки;
		Для Каждого Вложение Из СоставПакета.Вложение Цикл
			Если Вложение.Свойство("Документы1С") Тогда
				Для Каждого Документ1С Из Вложение.Документы1С Цикл
					СтруктураСвойств = Новый Структура("ДокументСБИС_Ид,ДокументСБИС_ИдВложения,ДокументСБИС_Статус", СоставПакета.Идентификатор,Вложение.Идентификатор,"Выгружен");
					ДанныеПоСтатусам.Добавить(Новый Структура("СтруктураСвойств, Документ1С",СтруктураСвойств, Документ1С.Значение));
				КонецЦикла;
			КонецЕсли;	
		КонецЦикла;

	КонецЦикла;
	фрм.ЗаписатьПараметрыДокументовСБИС(ДанныеПоСтатусам, Кэш.Ини.Конфигурация, Кэш.ГлавноеОкно.Кэш.Парам.КаталогНастроек);
	// << alo 
	Если Не Кэш.Парам.СостояниеЭД Тогда 
	ИначеЕсли	Не фрмЭД = Неопределено
				И Не фрмЭД = Ложь Тогда
				
		фрмЭД.ЗаписатьПараметрыДокументовСБИС(ДанныеПоСтатусам, Кэш.Ини.Конфигурация, Кэш.ГлавноеОкно.Кэш.Парам.КаталогНастроек);
	Иначе 
		МодульОбъектаКлиент().СбисСообщить(Новый Структура("Текст", "Дублирование событий Saby в типовых регистрах 1с в данной конфигурации не поддерживается"));
	КонецЕсли;	// alo >>
	
	//AU точка входа после отправки партии пакетов документов с данными по статусам.
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("сбисОбработатьСписокОтправленных","РаботаСДокументами1С","", Кэш);
	Если Не фрм = Ложь Тогда
		//Данные по детализации статусов и списка номенклатуры смотреть в кэше.
		Контекст = Новый Структура("ДанныеПоСтатусам", ДанныеПоСтатусам);//Структура для возможности расширения, если понадобится добавить что-то ещё.
		фрм.сбисОбработатьСписокОтправленных(Кэш, Контекст);
	КонецЕсли;
	//
	
	сбисСпрятатьСостояние(ГлавноеОкно);
КонецФункции
&НаКлиенте
Процедура сбисПолучитьОтветыПоОтправке(Кэш) Экспорт
КонецПроцедуры
&НаКлиенте
Функция ПолучитьСписокИзменений(Кэш, ДопПараметрыФильтра = Неопределено) Экспорт
	// Получает статусы документов сбис
	ГлавноеОкно = Кэш.ГлавноеОкно;
	фрм = ГлавноеОкно.сбисНайтиФормуФункции("СбисЗаписатьИзмененияПоДокументам1С",Кэш.ФормаРаботыСоСтатусами,"",Кэш);
	// << alo 
	Если Кэш.парам.СостояниеЭД Тогда
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("ИмяФункции",	"ЗаписатьИзмененияПоДокументам1С");
		ПараметрыПоиска.Вставить("КлючФорм",	"Статусы_СостоянияЭД");
		фрмЭД = Кэш.ОбщиеФункции.сбисНайтиФормуФункцииПодсистемы(Кэш, ПараметрыПоиска);
	КонецЕсли;
	// alo >>
	сбисПоказатьСостояние("Обновление статусов отправленных документов", ГлавноеОкно,, "(прервать -  Ctrl+Break)");
	КаталогСостоянийИмя = Кэш.Парам.КаталогОбмена+"\Состояние\";
	КаталогСостояний = Новый Файл(КаталогСостоянийИмя);
	Если Не КаталогСостояний.Существует() Тогда
		КаталогСостоянийИмя = Кэш.Парам.КаталогОбмена+"\СостояниеОтправки\"
	КонецЕсли;
    ФайлыСтатусов = НайтиФайлы(КаталогСостоянийИмя, "*.native.xml", Истина);
	Всего = ФайлыСтатусов.Количество();
	сч = 0;
	МассивДокументов = Новый Массив;
	МассивОбработанныхФайлов = Новый Массив;
	ПодключитьОбработчикОжидания("ПрерываниеПользователемОбработкиСтатусов",0.1,Истина);
	Для Каждого Файл Из ФайлыСтатусов Цикл
		сч = сч+1;
		сбисПоказатьСостояние("Обновление статусов отправленных документов ", ГлавноеОкно,Мин(100,Окр(сч*100/Всего)), "(прервать -  Ctrl+Break)");
		Текст = Новый ЧтениеТекста(Файл.ПолноеИмя);
		СтрокаXML = Текст.Прочитать();
		СтруктураФайла = Кэш.ОбщиеФункции.ЗаполнитьСтруктуруФайла(СтрокаXML);
	
		оДокумент = СтруктураФайла.Документ;
		// Проверяем, к этой ли базе 1С относится файл
		оОрганизация = Кэш.ОбщиеФункции.НайтиОрганизациюИзДокументаСБИС(Кэш.Ини.Конфигурация, оДокумент.НашаОрганизация);
		Если оОрганизация <> Неопределено И оОрганизация <> Ложь Тогда
			МассивДокументов.Добавить(оДокумент);
			МассивОбработанныхФайлов.Добавить(Файл.ПолноеИмя);
			Если Кэш.ИспользоватьОбработчикиСобытий = Истина Тогда
				ИмяОбработчика = СтрЗаменить("сбис"+оДокумент.Регламент.Название+"_"+оДокумент.Событие[0].Название, " ", "_");
				фрмОбработчика = Кэш.ГлавноеОкно.сбисНайтиФормуФункции(ИмяОбработчика,"РаботаСДокументами1С","",Кэш);
				Если фрмОбработчика <> Ложь Тогда
					Контекст = Новый структура("Док, Кэш", оДокумент, Кэш);
					Результат=вычислить("фрмОбработчика."+ИмяОбработчика+"(Контекст)");
				КонецЕсли;	
			КонецЕсли;
			Если МассивДокументов.Количество()=100 Тогда
				фрм.СбисЗаписатьИзмененияПоДокументам1С(Кэш, МассивДокументов, Новый Структура("ИдАккаунта", ПолучитьИдТекущегоАккаунта(Кэш)));
				// << alo 
				если кэш.парам.СостояниеЭД тогда
					фрмЭД.ЗаписатьИзмененияПоДокументам1С(МассивДокументов, Кэш.Ини, ГлавноеОкно.Кэш.Парам.КаталогНастроек);
				конецесли; // alo >>
				МассивДокументов.Очистить();
				Для Каждого ОбработанныйФайл Из МассивОбработанныхФайлов Цикл
					Попытка
						УдалитьФайлы(ОбработанныйФайл);
					Исключение
					КонецПопытки;
				КонецЦикла;
				МассивОбработанныхФайлов.Очистить();
			КонецЕсли;
		КонецЕсли;
		ОбработкаПрерыванияПользователя();
	КонецЦикла;
	фрм.СбисЗаписатьИзмененияПоДокументам1С(Кэш, МассивДокументов, Новый Структура("ИдАккаунта", ПолучитьИдТекущегоАккаунта(Кэш)));
	// << alo 
	если кэш.парам.СостояниеЭД тогда
		фрмЭД.ЗаписатьИзмененияПоДокументам1С(МассивДокументов, Кэш.Ини, ГлавноеОкно.Кэш.Парам.КаталогНастроек);
	конецесли; // alo >>
	Для Каждого ОбработанныйФайл Из МассивОбработанныхФайлов Цикл
		Попытка
			УдалитьФайлы(ОбработанныйФайл);
		Исключение
		КонецПопытки;
	КонецЦикла;
	МассивОбработанныхФайлов.Очистить();
	сбисСпрятатьСостояние(ГлавноеОкно);
	ОтключитьОбработчикОжидания("ПрерываниеПользователемОбработкиСтатусов");
КонецФункции
&НаКлиенте
Процедура ПрерываниеПользователемОбработкиСтатусов()
// Прячем состояние
    ГлавноеОкно = сбисПолучитьФорму("ФормаГлавноеОкно");
	сбисСпрятатьСостояние(ГлавноеОкно);	
КонецПроцедуры
&НаКлиенте
функция ПолучитьHTMLПоXML(Кэш, Вложение) экспорт
	// Используется при просмотре документов из реестров продаж (1С)
	Возврат Вложение.XMLДокумента;
КонецФункции
&НаКлиенте
Функция ОбработкаСлужебныхДокументов(Кэш) Экспорт
// При работе через каталог ничего не делает
КонецФункции
&НаКлиенте
Процедура УстановитьВидимостьОбновитьСтатусы(Кэш) Экспорт
// Если есть файлы статусов в каталоге СостояниеОтправки, то выводим красное предупреждение	
	ГлавноеОкно = Кэш.ГлавноеОкно;
	ФайлыСтатусов = НайтиФайлы(Кэш.Парам.КаталогОбмена+"\СостояниеОтправки\", "*.native.xml", Истина);
	Если ФайлыСтатусов.Количество() > 0 Тогда
		сбисЭлементФормы(ГлавноеОкно, "ОбновитьСтатусы").Видимость = Истина;
	Иначе
		сбисЭлементФормы(ГлавноеОкно, "ОбновитьСтатусы").Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
функция сбисТекущаяДатаМСек(Кэш) экспорт
	// Получает текущую дату в миллисекундах с начала 1970г
	Возврат 0;
КонецФункции
&НаКлиенте
функция ExtSys_FeatureIsOn(ПараметрыФичи, ДопПараметрыВызова) Экспорт
	// Потом добавим файл Features.xml
	Возврат Ложь;
КонецФункции

// Вызов функции MappingObject.List. Формирует список
// объектов синхронизируемых объектов определенного типа,
// с данными сопоставления и с расшифровкой естественных ключей
//
// Параметры:
//  Кэш  - Структура - Кэш обработки
//  ДопПоля  - Структура - Набор полей, которыми будут расширены
//					возвращаемые записи.
//	Фильтр	- Структура - Параметры фильтрации выборки.
//	Сортировка	- Структура - Параметры сортировки записей в выборке.
//	Навигация	-	 Структура - Параметры для навигации с типом
//					"постраничная", "бесконечный скролл"
//					или "по курсору".
//
// Возвращаемое значение:
//   Структура   - Результат вызова. Список объектов или ошибка
//
&НаКлиенте
Функция MappingObject_List(Кэш, ДопПоля, Фильтр, Навигация, Отказ = Ложь) Экспорт 

	Возврат Новый Структура("Данные, Навигация", Новый Массив, Новый Массив);

КонецФункции // MappingObject_List()&НаКлиенте

&НаКлиенте
Функция СБИС_ПолучитьСопоставлениеСторон(Кэш, ПараметрыДанныеУчастников, ДопПараметрыВызова=Неопределено, Отказ=Ложь) Экспорт 
	Возврат Новый Массив;
КонецФункции

&НаКлиенте
Функция Включить(Кэш, ДопПараметры=Неопределено, Отказ=Ложь) Экспорт

	КаталогОбмена = МодульОбъектаКлиент().ПараметрSABY("КаталогОбмена");
	Если Не ЗначениеЗаполнено(КаталогОбмена) Тогда
		
		Отказ = Истина;
		Возврат МодульОбъектаКлиент().НовыйСбисИсключение(785101, "ИнтеграцияКаталог.Включить",,,"Заполните каталог обмена документами");
		
	КонецЕсли;
	СведенияОбИнтеграции	= СведенияОбИнтеграции();
	ПараметрыВключения		= СведенияОбИнтеграции.Параметры;
	
	Если ЗначениеЗаполнено(ДопПараметры) Тогда 
		ЗаполнитьЗначенияСвойств(ПараметрыВключения, ДопПараметры);
	КонецЕсли; 
	МодульОбъектаКлиент().ИзменитьПараметрТекущегоСеанса("СведенияОбИнтеграции", СведенияОбИнтеграции);
	МодульОбъектаКлиент().ИзменитьПараметрСбис("ОбменВключен",		Истина);
 	МодульОбъектаКлиент().ИзменитьПараметрСбис("ВходПоСертификату",	Ложь);

	Для Каждого ПараметрИнтеграции Из СведенияОбИнтеграции.Параметры Цикл
		
		МодульОбъектаКлиент().ИзменитьПараметрСбис(ПараметрИнтеграции.Ключ, ПараметрИнтеграции.Значение);
		
	КонецЦикла;
		
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция СведенияОбИнтеграции() Экспорт

	ПараметрыИнтеграции = Новый Структура;
	ПараметрыИнтеграции.Вставить("ГенераторФЭД",				Ложь);
	ПараметрыИнтеграции.Вставить("Шифрование",					Ложь);
	ПараметрыИнтеграции.Вставить("МногопоточныйРежим",			Ложь);
	ПараметрыИнтеграции.Вставить("ДоступныСерверныеНастройки",	Ложь);
	ПараметрыИнтеграции.Вставить("КоличествоПотоков",			1);
	ПараметрыИнтеграции.Вставить("ИмяКоннкетора",				"1c-folder");
	ПараметрыИнтеграции.Вставить("ВремяОжиданияОтвета",			60);
	ПараметрыИнтеграции.Вставить("ВключитьВО3",					Ложь);
	ПараметрыИнтеграции.Вставить("ВстроеннаяКриптография",		Ложь);					// Используется криптография 1С
 	ПараметрыИнтеграции.Вставить("ИмяВнутреннегоМодуля",		"ИнтеграцияКаталог");	// Имя для поиска функций вызова
 	ПараметрыИнтеграции.Вставить("РеестрыSABY",					Ложь);					// Нет доступа к реестрам БЛ
	
	СведенияОбИнтеграции = Новый Структура("Имя, Параметры, Версия, Заголовок", "ИнтеграцияКаталог", ПараметрыИнтеграции);
	СведенияОбИнтеграции.Версия		= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("КаталогОбмена");
	СведенияОбИнтеграции.Заголовок	= "Каталог";
	Возврат СведенияОбИнтеграции;

КонецФункции

&НаКлиенте
Функция Завершить(Кэш, ДопонительныеПараметры, Отказ) Экспорт
	Возврат Истина;
КонецФункции

// Заглушка (SDK)
&НаКлиенте
Функция ВключитьОтладку(Кэш, КаталогОтладки) Экспорт
КонецФункции

// Заглушка (SDK)
&НаКлиенте
Функция ОтключитьОтладку(Кэш) Экспорт
КонецФункции

// Функция для переопределения видимости настроек для способа интеграции
// 
// Возвращаемое значение: Структура
//   - 
//
&НаКлиенте
Функция ВидимостьНастроек() Экспорт
	
	Настройки = МодульОбъектаКлиент().ВидимостьНастроекПоУмолчанию();	
	
	Возврат Настройки;
	
КонецФункции

//+tda//Функции для загрузки документов из каталога
&НаКлиенте
функция ПрочитатьДокумент(Кэш,Док, ДопПараметры=Неопределено, Отказ=Ложь) экспорт
	// При работе через каталог возвращаем сам документ	
	Возврат Док;
КонецФункции

// Устарел. Использовать МодульОбъектаКлиент().ПолучитьСписокДокументовОтгрузкиСБИС()
&НаКлиенте
Функция ПолучитьСписокДокументовОтгрузки(Кэш) Экспорт
	
	Возврат МодульОбъектаКлиент().ПолучитьСписокДокументовПоСобытиямСБИС();
	
КонецФункции

// Устарел. Использовать МодульОбъектаКлиент().ПолучитьСписокДокументовПоСобытиямСБИС()
&НаКлиенте
Функция ПолучитьСписокСобытий(Кэш, ТипРеестра) Экспорт

	Возврат МодульОбъектаКлиент().ПолучитьСписокДокументовПоСобытиямСБИС(Новый Структура("ТипРеестра", ТипРеестра));
	
КонецФункции

// Устарел. Использовать МодульОбъектаКлиент().ПолучитьСписокДокументовПоСобытиямСБИС()
&НаКлиенте
Функция ПолучитьСписокСобытийПоФильтру(Кэш, filter, ГлавноеОкно) Экспорт
	
	ПараметрыСписка = Новый Структура;
	Если ЗначениеЗаполнено(filter) Тогда
		ПараметрыСписка.Вставить("Фильтр", filter);
	КонецЕсли;
	
	Возврат МодульОбъектаКлиент().ПолучитьСписокДокументовПоСобытиямСБИС(ПараметрыСписка);
	
КонецФункции

// Устарел. Использовать МодульОбъектаКлиент().ПолучитьСписокДокументовСБИС()
&НаКлиенте
Функция сбисПолучитьСписокДокументов(Кэш) Экспорт
	
	Возврат МодульОбъектаКлиент().ПолучитьСписокДокументовСБИС();
	
КонецФункции

&НаКлиенте
функция ПолучитьДанныеФайла(Кэш,Файл) экспорт
	// Получает данные файла вложения	
	# Если ВебКлиент Тогда
		Возврат Ложь;
	# Иначе
		Если Файл.СсылкаНаФайл = Неопределено Тогда
			Сообщить("Не удалось прочитать файл: " + ". Отсутствует ссылка на документ.");
	Возврат	Ложь;
		КонецЕсли;
		
		ТекстДок = Новый ЧтениеТекста(Файл.СсылкаНаФайл);
		РезультатТекст = ТекстДок.Прочитать();
		Если Найти(РезультатТекст, "encoding=""UTF-8""")>0 Тогда
			ТекстДок = Новый ЧтениеТекста(Файл.СсылкаНаФайл, КодировкаТекста.UTF8);
			РезультатТекст = ТекстДок.Прочитать();
		КонецЕсли;
		//AU Добавил проверку
		Если РезультатТекст = Неопределено Тогда
			Сообщить("Не удалось прочитать файл:" + Файл.СсылкаНаФайл + ". Возможно файл не является текстовым документом.");
			Возврат "";
		КонецЕсли;
		
		Если Лев(РезультатТекст,4)="%PDF" Тогда // для PDF-файла иногда возвращается крокозябра, которая потом вызывает ошибку передачи данных между клиентом и сервером, несмотря на то, что это строка
			Возврат "";
		КонецЕсли;

		Возврат ПолучитьДанныеФайла_ОбработкаПослеЧтения(Файл, РезультатТекст);
		
	# КонецЕсли
КонецФункции

&НаКлиенте
функция ПолучитьHTMLВложения(Кэш,ИдДок, Вложение) экспорт
	Если Вложение.Свойство("Файл") И Вложение.Файл.Свойство("ТекстXML") Тогда
		
		Возврат Вложение.Файл.ТекстXML;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция УдалитьФайлПакетаДокументов(ИмяФайла) Экспорт
	ФайлПакета = Новый Файл(ИмяФайла);
	ПутьКФайлу = ФайлПакета.Путь;
	Если ФайлПакета.Существует() Тогда
		Попытка
			ФайлПакета = "";
			УдалитьФайлы(ИмяФайла);
			УдалитьФайлы(ПутьКФайлу);			
			Сообщить("Пакет документов удалён " + ИмяФайла);
		Исключение
			Сообщить("Не удалось удалить файл " + ИмяФайла + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецФункции

//AU заглушки методов авторизации для открытия формы авторизации//

//Заглушка закрытия сессии	
&НаКлиенте
Функция ЗакрытьСессию(Кэш) Экспорт 	
	Возврат Истина;
КонецФункции	

//Заглушка авторизации через логин/пароль. При работе через каталог SID не нужен	
&НаКлиенте
Функция АвторизоватьсяПоЛогинуПаролю(Кэш,Логин,Пароль,Отказ=Ложь) Экспорт 	
	Возврат "Ok";	
КонецФункции	

//Заглушка авторизации через сертификат. При работе через каталог SID не нужен	
&НаКлиенте
Функция АвторизоватьсяПоСертификату(Кэш,Сертификат,Отказ=Ложь) Экспорт
	Возврат "Ok";	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокСертификатовДляАвторизации(Кэш,ТекстОшибки) Экспорт
	Возврат Новый СписокЗначений;
КонецФункции

//Заглушка информации о пользователе.	
&НаКлиенте
Функция ИнформацияОТекущемПользователе(Кэш) Экспорт
	Возврат "Каталог";
КонецФункции

//AU заглушки прочих методов

//Заглушка для отправки статистики
&НаКлиенте
Функция сбисОтправитьСообщениеСтатистики(Кэш, СообщениеСтатистики, Отказ) Экспорт
	Возврат Неопределено;
КонецФункции

//Заглушка для отправки статистики
&НаКлиенте
Функция сбисОтправитьСообщениеОшибки(Кэш, СообщениеОбОшибке, Отказ) Экспорт
	Возврат Неопределено;
КонецФункции

//Заглушка для выполнения команды
&НаКлиенте
Функция сбисВыполнитьКоманду(Кэш, Идентификатор,ИмяКоманды, ПредставлениеПакета) Экспорт
	
	Возврат Ложь;
	
КонецФункции
//Заглушка, подписание в СБИС Коннекте
&НаКлиенте
Функция сбисПодписатьВложения(Кэш, attachmentList, ПараметрыДействия, Отказ) Экспорт 
	Возврат Ложь;
КонецФункции
// Переводит документ повторно на ранее выполненный этап
&НаКлиенте
Функция сбисПовторитьЭтап(Кэш, ИдДок, ЭтапНазвание, Отказ=Ложь) Экспорт
	Отказ				= Истина;
	Сообщить("Функционал доступен только для способов обмена ""extSDK"" и ""API"". Способ обмена можно изменить на вкладке ""Настройки"".");
	Возврат Ложь;
КонецФункции
&НаКлиенте
Функция сбисЭмитироватьКМ(Кэш, ИдДок, ДополнительныеПараметры=Неопределено, Отказ=Ложь) Экспорт
	Отказ				= Истина;
	Сообщить("Функционал доступен только для способов обмена ""extSDK2"" и ""API"". Способ обмена можно изменить на вкладке ""Настройки"".");
	Возврат Ложь;
КонецФункции
&НаКлиенте
Функция сбисЗарегистрироватьВГоссистеме(Кэш, ИдДок, ДополнительныеПараметры=Неопределено, Отказ=Ложь) Экспорт
	Отказ				= Истина;
	Сообщить("Функционал доступен только для способов обмена ""extSDK2"" и ""API"". Способ обмена можно изменить на вкладке ""Настройки"".");
	Возврат Ложь;
КонецФункции
&НаКлиенте
Функция ПолучитьИдТекущегоАккаунта(Кэш) Экспорт
	Возврат Неопределено;
КонецФункции
&НаКлиенте
Функция Аккордеон_ОтключенныеРазделы() Экспорт
	ОтключенныеРазделы = Новый Структура();
	ОтключенныеРазделы.Вставить("Полученные", "ТолькоПодразделы");
	ОтключенныеРазделы.Вставить("Отправленные", "ВесьРаздел");
	ОтключенныеРазделы.Вставить("Учет", "ВесьРаздел");
	ОтключенныеРазделы.Вставить("Задачи", "ВесьРаздел");
	Возврат ОтключенныеРазделы;
КонецФункции

&НаКлиенте
Функция СтруктураСобытияИзФайла(ПараметрыФайла, Кэш)
	
	Текст			= Новый ЧтениеТекста(ПараметрыФайла.ПолноеИмя);
	СтрокаXML		= Текст.Прочитать();
	Возврат Кэш.ОбщиеФункции.ЗаполнитьСтруктуруФайла(СтрокаXML);
	
КонецФункции

&НаКлиенте
Функция ДатаВремяИзСтроки(СтрокаДатаВремя)
	ДатаРазбита = СтрЗаменить(СтрЗаменить(СтрокаДатаВремя, ".", Символы.ПС), " ", Символы.ПС);
	Возврат Дата(
		СтрПолучитьСтроку(ДатаРазбита, 3), 
		СтрПолучитьСтроку(ДатаРазбита, 2),
		СтрПолучитьСтроку(ДатаРазбита, 1),
		СтрПолучитьСтроку(ДатаРазбита, 4),
		СтрПолучитьСтроку(ДатаРазбита, 5),
		СтрПолучитьСтроку(ДатаРазбита, 6));
КонецФункции

//Подготовка данных по загружаемым в 1С объектам на сервисе IntegrationConfig порционно
&НаКлиенте
Функция Connector_Prepare(Кэш, ПараметрыВызова, Отказ) Экспорт
    Возврат Неопределено;    
КонецФункции

//Получение объекта на загрузку в 1С
&НаКлиенте
Функция ExtSyncDoc_GetObjectForExecute(Кэш,ИдентификаторПосылки, Отказ) Экспорт
    Возврат Неопределено;
КонецФункции

//Рассчет объекта на сервисе
&НаКлиенте
Функция ExtSyncDoc_CalcObjectForExecute(Кэш, СтруктураОбъекта, ИдентификаторПосылки, ИмяИни, Отказ) Экспорт
    
    Возврат Неопределено;
    
КонецФункции

// Обертка метода ExtSyncDoc.Write
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаКлиенте
Функция ExtSyncDoc_Write(Кэш, ПараметрыМетода, Отказ = Ложь) Экспорт        
    
    Возврат Неопределено;

КонецФункции // ExtSyncDoc_Write()

// Обертка метода ExtSyncDoc.Execute
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаКлиенте
Функция ExtSyncDoc_Execute(Кэш, ПараметрыМетода, Отказ = Ложь) Экспорт         
    
    Возврат Неопределено;

КонецФункции // ExtSyncDoc_Execute()

// Обертка метода API3.GetSbisObject
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаКлиенте     
Функция API3_GetSbisObject(Кэш, ПараметрыМетода, ДопПараметры, Отказ = Ложь) Экспорт  
    
    Возврат Неопределено;

КонецФункции // API3_GetSbisObject()

// Обертка метода API3.FindSbisObject
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаКлиенте
Функция API3_FindSbisObject(Кэш, ПараметрыМетода, ДопПараметры, Отказ = Ложь) Экспорт 

	Возврат Неопределено; 

КонецФункции // API3.FindSbisObject()

////////////////////////////////////////////////////
//////////////////Автообновление////////////////////
////////////////////////////////////////////////////

&НаКлиенте
функция СбисПроверкаОбновления(Кэш, ИнформацияОТекущейВерсии, Отказ) Экспорт
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Функция сбисПолучитьПараметрыАктуальнойВерсии(Кэш, ПараметрыОбновления, Отказ) Экспорт
	
	Возврат Кэш.ГлавноеОкно.сбисПолучитьФорму("API").сбисПолучитьПараметрыАктуальнойВерсии(Кэш, ПараметрыОбновления, Отказ);
	
КонецФункции

//Функция сохраняет вложение по ссылке. Необходимо переданное соединение для корректной работы с переадресацией.
&НаКлиенте
Функция сбисСохранитьВФайлПоСсылке(Кэш, сбисПараметрыФайла, Отказ) Экспорт
	
	Возврат Кэш.ГлавноеОкно.сбисПолучитьФорму("API").сбисСохранитьВФайлПоСсылке(Кэш, сбисПараметрыФайла, Отказ);
	
КонецФункции

&НаКлиенте
функция СохранитьВложениеПоСсылкеВФайл(Кэш,Ссылка,ИмяФайла="") Экспорт
	
	Возврат Кэш.ГлавноеОкно.сбисПолучитьФорму("API").СохранитьВложениеПоСсылкеВФайл(Кэш,Ссылка,ИмяФайла);
	
КонецФункции

////////////////////////////////////////////////////
//////////////Сотрудники////////////////////////////
////////////////////////////////////////////////////

&НаКлиенте
функция сбисЗаписатьСотрудников(Кэш, ДанныеСотрудников, Отказ) Экспорт
	// функция активирует серверные сертификаты для определенного списка ИНН	
	ПараметрыСообщения = Новый Структура;
	ПараметрыСообщения.Вставить("Текст",	"Загрузка сотрудников в Saby дступна только при способе обмена ExtSDK, ExtSDK2 или API. "+Символы.ПС+
											"Изменить способ обмена можно на вкладке ""Настройки"".");
	сбисПолучитьФорму("ФормаПредупреждения").ПоказатьПоверх(ПараметрыСообщения);
	Отказ = Истина;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура сбисУстановитьВремяОжидания(Кэш, ВремяОжидания) Экспорт
	Кэш.СБИС.ПараметрыИнтеграции.Вставить("ВремяОжиданияОтвета", ВремяОжидания);
КонецПроцедуры

#Область include_core2_vo2_СпособыОбмена_ИнтеграцияКаталог_Прочее
#КонецОбласти

#Область include_core2_vo2_СпособыОбмена_ИнтеграцияКаталог_ВнешниеВызовы
#КонецОбласти

#Область include_core2_vo2_СпособыОбмена_ИнтеграцияКаталог_ВнешниеОбертки
#КонецОбласти

#Область include_core2_vo2_СпособыОбмена_ИнтеграцияКаталог_ВнешниеОбертки_АсинхроннаяОтправка
#КонецОбласти
