
&НаКлиенте
Процедура ЗагрузкаВ1С_Начало()

	МодульТекущий = МодульОбъектаКлиент();
	ДокРазобран	=	(ДокументУчетаРазобран	И ИмяРеквизитаВложений = "ВложениеУчета")
				Или (ДокументРазобран		И ИмяРеквизитаВложений = "Вложение");
								
	Если Не ДокРазобран Тогда
					
		СбисВыполнитьРазбор();
		КонтентВыборЗакладки("Загрузка");
		
	КонецЕсли;
	
	ВложенияКЗагрузке = Новый Массив;
	Для Каждого СтрокаОтмечена Из ТаблицаДокументов.НайтиСтроки(Новый Структура("Отмечен", Истина)) Цикл
		
		ВложениеСБИС = СтрокаОтмечена.Вложение[0].Значение;
		//ПараметрыЗагрузитьВ1С	= МодульТекущий.ВложениеСБИС_МожемЗагрузитьВ1С(ВложениеСБИС);
		Если Не СтрокаОтмечена.МожемЗагрузитьВ1С Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		// Обновить вложение как в СписокВложенийДляОперация, но передаем пока строку
		ИзмененияВложения = Новый ФиксированнаяСтруктура("СтрокаФормыПросмотра", СтрокаОтмечена);
		МодульТекущий.ВложениеСБИС_Обновить(ВложениеСБИС, ИзмененияВложения);
		ВложенияКЗагрузке.Добавить(СтрокаОтмечена);
		
	КонецЦикла;
	
	Если Не ВложенияКЗагрузке.Количество() Тогда
		
		МодульТекущий.СбисСообщить("Нет отмеченных документов, поддерживаемых для загрузки.");
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОбработки	= Новый Структура("СоставПакета, Вложение", СоставПакета, ВложенияКЗагрузке);
	ДиалогиПроверить	= ЗагрузкаВ1С_Диалоги_Подготовить(ПараметрыОбработки);

	ЗагрузкаВ1С_Диалоги_Следующий(ДиалогиПроверить);

КонецПроцедуры

&НаКлиенте
Функция ЗагрузкаВ1С_ОбработатьРезультат(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
		
	Если РезультатЗагрузки = Неопределено Тогда
		//В процессе был диалог, а значит для УФ с результатом попадём уже после выбора и последующей обработки. Для ОФ уже попадали
		Возврат Неопределено;
	КонецЕсли;
	
	//Заполняем данные формы в зависимости от результата.
	Для Каждого КлючИЗначение Из РезультатЗагрузки.Ошибки.ДетализацияОшибок Цикл
		Для Каждого СтрокаДетализации Из КлючИЗначение.Значение Цикл
			Если Найти(СтрокаДетализации.Сообщение, "Автоматическое создание номенклатуры при загрузке не поддерживается для Вашей конфигурации") Тогда
				КонтентВыборЗакладки("Загрузка");
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Для Каждого КлючИЗначение Из РезультатЗагрузки.Действие.ДетализацияВыполнено Цикл
		Для Каждого СтрокаДетализации Из КлючИЗначение.Значение Цикл
			Для Каждого СтрокаРасшифровки Из СтрокаДетализации.ОбработаныОбъекты1С Цикл
				Если Не СтрокаРасшифровки.Свойство("СтруктураДокумента1С") Тогда
					Продолжить;
				КонецЕсли;
				ОбновлятьГлавноеОкно = Истина;
				ЗаполнитьДокумент1СВСоставеПакета(СтрокаДетализации.ИдентификаторВложения, СтрокаРасшифровки.Ссылка, СтрокаРасшифровки.СтруктураДокумента1С);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	ОбновитьПоляФормыПоДокументуСБИС(СоставПакета);
	
	ТекущаяСтрокаТаблицыДокументов	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма,"ТаблицаДокументов").ТекущиеДанные;
	АктивноеВложениеСбис			= ТекущаяСтрокаТаблицыДокументов.Вложение[0].Значение;

	ОбновитьСтрокуТаблицыДокументов(ТекущаяСтрокаТаблицыДокументов);
	ОбновитьПоляФормыПоВложениюСБИС(АктивноеВложениеСбис);

	ПараметрыСообщить = Новый Структура("СообщитьНеВыполнено", Ложь);
	МестныйКэш.ОбщиеФункции.РезультатДействия_СообщитьРезультат(РезультатЗагрузки, ПараметрыСообщить);
	
КонецФункции

#Область include_core2_vo2_Формы_ФормаПросмотрДокумента_ОбработчикиСобытий_Загрузка_Диалоги
#КонецОбласти

