
// Процедура - обработчик при изменении свойства интеграции в зависиомсти от способа хранения настроек. Должно быть вынесено в класс
//
// Параметры:
//  ИнтеграцияSABY	 - ИнтеграцияSABY			 - ИнтеграцияSABY
//  КлючСвойства	 - Строка					 - ключ изменного свойства
//  ЗначениеСвойства - Произвольный				 - изменное значение
//  ДопПараметры	 - Неопределено, Структура	 - расширение
//
//DynamicDirective
Процедура ИнтеграцияSABY_ПриИзмененииСвойства(ИнтеграцияSABY, КлючСвойства, ЗначениеСвойства, ДопПараметры = Неопределено) Экспорт
	
	Если КлючСвойства = "ОтключеныДоработки" Тогда
		
		КаталогНастроекОбщий = МодульОбъектаКлиентСервер().ИнтеграцияSABY_Получить(ИнтеграцияSABY, "Идентификатор");
		Если ЗначениеСвойства Тогда
			
			// Сформировать пустой инсталяционный каталог
			ИмяКаталогаБезДоработок	= "temp_" + МодульОбъектаКлиентСервер().ГлобальныйКэш_Получить("ИдТекущегоСеансаSaby");
			ПараметрыСистемы		= МодульОбъектаКлиентСервер().ГлобальныйКэш_Получить("ПараметрыСистемы");
			ПараметрыДляФормат		= Новый Структура("Путь, Контекст", ИмяКаталогаБезДоработок, ПараметрыСистемы.Сервер);
			ИмяКаталогаБезДоработок	= МодульОбъектаКлиентСервер().ПрименитьФорматКСтроке_Каталог(КаталогНастроекОбщий, ПараметрыДляФормат);
			
			ИдентификаторПослеУстановки	 = ПроверитьИдентификаторНастроек(ИмяКаталогаБезДоработок);
			Если Не ИдентификаторПослеУстановки = ИмяКаталогаБезДоработок Тогда
				
				ВызватьИсключение "Ошибка отключения доработок: не удалось подготовить временный каталог для чистой инсталляции";
				
			КонецЕсли;
			
		Иначе
			
			ИдентификаторПослеУстановки = КаталогНастроекОбщий;
			Если МодульОбъектаКлиентСервер().ИнтеграцияSABY_Получить(ИнтеграцияSABY, КлючСвойства) Тогда
				
				// Доработки были отключены, а теперь включаются
				яИнтеграцияSABY_ОчиститьВременныйЧистыйКаталог(ИнтеграцияSABY);
				
			КонецЕсли;
			
		КонецЕсли;
		
		МодульОбъектаКлиентСервер().ИнтеграцияSABY_Установить(ИнтеграцияSABY, "КаталогНастроек", ИдентификаторПослеУстановки);
		
		ПараметрыДляИзменения = МодульОбъектаКлиентСервер().ИнтеграцияSABY_Выгрузить(ИнтеграцияSABY, "ПараметрыДляЧтенияИни");
		сбисПодключитьЗаплатки(МодульОбъектаКлиентСервер().ПолучитьТекущийЛокальныйКэш(), ПараметрыДляИзменения);
		
	КонецЕсли;
	
КонецПроцедуры

#Область include_core2_vo2_Настройки_Каталог_КлиентСервер_Классы_ИнтеграцияSABY_private
#КонецОбласти

