
// Функция - Реализация чтения коннекшена при работе через каталог
//
// Параметры:
//  КоннекшенSABY	 - 	 - 
//  ДопПараметры	 - 	 - 
//  Отказ			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Процедура КоннекшенSaby_Прочитать(КоннекшенSaby, ДопПараметры = Неопределено) Экспорт
    Перем СписокИниПолучить;
	
	АктивныеИни = МодульОбъектаКлиент().КоннекшенSABY_Получить(КоннекшенSaby, "Ини");
	ОписаниеИни = МодульОбъектаКлиент().КоннекшенSABY_Получить(КоннекшенSaby, "ОписаниеИни");
	
	Если ЗначениеЗаполнено(АктивныеИни) Тогда
		
		СписокИниПолучить = Новый Массив;
		Для Каждого КлючИЗначениеИни Из АктивныеИни Цикл
			
			Если Не КлючИЗначениеИни.Значение = Неопределено Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			СписокИниПолучить.Добавить(ОписаниеИни.ПолноеОписание[КлючИЗначениеИни.Ключ]);
			
		КонецЦикла;
		
	Иначе
		
		СписокИниПолучить = ОписаниеИни.ПолноеОписание;
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СписокИниПолучить) Тогда 
		
		ПараметрыДляФормированияДанныхИни	= МодульОбъектаКлиент().КоннекшенSABY_Выгрузить(КоннекшенSaby, "ПараметрыДляЧтенияИни"); 
		СтруктураИни						= яДанныеИниПоПараметрам(Новый Структура("ИниФайлы", СписокИниПолучить), ПараметрыДляФормированияДанныхИни);
		МодульОбъектаКлиент().КоннекшенSABY_Установить(КоннекшенSABY, "Ини", СтруктураИни);
		
	КонецЕсли;
	
КонецПроцедуры

