
// Функция - Реализация чтения коннекшена при работе через каталог
//
// Параметры:
//  КоннекшенSABY	 - 	 - 
//  ДопПараметры	 - 	 - 
//  Отказ			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
//DynamicDirective
Процедура КоннекшенSaby_Прочитать(КоннекшенSaby, ДопПараметры = Неопределено) Экспорт
	
	ОписаниеИни = МодульОбъектаКлиентСервер().КоннекшенSABY_Получить(КоннекшенSaby, "ОписаниеИни");
	
	// Собрать список ини для чтения.
	Если МодульОбъектаКлиентСервер().КоннекшенSABY_Получить(КоннекшенSaby, "ИнициированыДанные") Тогда

		АктивныеИни = МодульОбъектаКлиентСервер().КоннекшенSABY_Получить(КоннекшенSaby, "Ини");

		СписокИниПолучить = Новый Массив;
		Для Каждого КлючИЗначениеИни Из АктивныеИни Цикл
			
			Если Не КлючИЗначениеИни.Значение = Неопределено Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			СписокИниПолучить.Добавить(ОписаниеИни.ПолноеОписание[КлючИЗначениеИни.Ключ]);
			
		КонецЦикла;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(ОписаниеИни.Установлены) Тогда
			ПараметрыУстановитьДляПрименить = МодульОбъектаКлиентСервер().КоннекшенSABY_Выгрузить(КоннекшенSaby, "ПараметрыДляЧтенияИни"); 
			яРаспаковатьСтандартныеИни(ПараметрыУстановитьДляПрименить);
			МодульОбъектаКлиентСервер().КоннекшенSABY_Очистить(КоннекшенSaby, "ОписаниеИни");
			ОписаниеИни = МодульОбъектаКлиентСервер().КоннекшенSABY_Получить(КоннекшенSaby, "ОписаниеИни");
		КонецЕсли;
		
		// Ини еще не читались, отдаем на прочтение весь список.
		СписокИниПолучить = ОписаниеИни.ПолноеОписание;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СписокИниПолучить) Тогда 
		
		ПараметрыДляФормированияДанныхИни = МодульОбъектаКлиентСервер().КоннекшенSABY_Выгрузить(КоннекшенSaby, "ПараметрыДляЧтенияИни"); 
		СтруктураИни = яДанныеИниПоПараметрам(Новый Структура("ИниФайлы", СписокИниПолучить), ПараметрыДляФормированияДанныхИни);
		МодульОбъектаКлиентСервер().КоннекшенSABY_Установить(КоннекшенSABY, "Ини", СтруктураИни);
		
	КонецЕсли;
		
КонецПроцедуры

// Функция - Реализация завершения коннекшена при работе через каталог
//
// Параметры:
//  КоннекшенSABY	 - КоннекшенSaby			 - установленное подключение, с которым работал модуль
//  ДопПараметры	 - Неопределено, Структура	 - расширение
// 
//DynamicDirective
Процедура КоннекшенSABY_ЗавершитьРаботу(КоннекшенSaby, ДопПараметры = Неопределено) Экспорт
	
	Если Не МодульОбъектаКлиентСервер().КоннекшенSaby_Получить(КоннекшенSaby, "ОтключеныДоработки") Тогда
		
		Возврат;
		
	КонецЕсли;

	яИнтеграцияSABY_ОчиститьВременныйЧистыйКаталог(КоннекшенSaby);
	
КонецПроцедуры

// Функция - Реализация записи параметров коннекшена при работе через каталог
//
// Параметры:
//  КоннекшенSABY		 - КоннекшенSaby - установленное подключение
//  СтруктураПараметров	 - Структура	 - структура записываемых параметров в файл сбисПараметры
// 
//DynamicDirective
Процедура КоннекшенSABY_СохранитьПараметрыSaby(КоннекшенSaby, СтруктураПараметров) Экспорт
	
	Кэш					= МодульОбъектаКлиентСервер().ПолучитьТекущийЛокальныйКэш();
	КлючПользователя	= ПолучитьКлючПользователяСтенда(Кэш);
	КлючАккаунта		= ПолучитьКлючАккаунта(Кэш);
	
	КлючПользовательскойНастройки = Строка(КлючПользователя) + Строка(КлючАккаунта);
	
	КаталогНастроек		= МодульОбъектаКлиентСервер().КоннекшенSaby_Получить(КоннекшенSaby, "КаталогПараметров");
	ПараметрыДляЗаписи	= Новый Структура("КлючПользовательскихПараметров, КаталогПараметров", КлючПользовательскойНастройки, КаталогНастроек);
	
	Попытка
		
		яПараметрыSaby_ЗаписатьСервер(СтруктураПараметров, ПараметрыДляЗаписи);
		
	Исключение
		
		ОшибкаЗаписи = МодульОбъектаКлиентСервер().NewExtExeption(ИнформацияОбОшибке(), "ФайлыНастроекКаталог.КоннекшенSABY.СохранитьПараметрыSaby");
		ВызватьИсключение МодульОбъектаКлиентСервер().ExtExeption_Dump(ОшибкаЗаписи);
		
	КонецПопытки;
	
КонецПроцедуры

// Функция - Реализация чтения параметров коннекшена при работе через каталог
//
// Параметры:
//  КоннекшенSABY	 - КоннекшенSaby - установленное подключение
//  ДопПараметры	 - Неопределено	 - расширение
// 
//DynamicDirective
Функция КоннекшенSaby_ПрочитатьПараметрыSaby(КоннекшенSaby, ДопПараметры = Неопределено) Экспорт
	
	Кэш					= МодульОбъектаКлиентСервер().ПолучитьТекущийЛокальныйКэш();
	КлючПользователя	= ПолучитьКлючПользователяСтенда(Кэш);
	КлючАккаунта		= ПолучитьКлючАккаунта(Кэш);
	
	КлючПользовательскойНастройки = Строка(КлючПользователя) + Строка(КлючАккаунта);
	
	КаталогНастроек		= МодульОбъектаКлиентСервер().КоннекшенSaby_Получить(КоннекшенSaby, "КаталогПараметров");
	ПараметрыДляЗаписи	= Новый Структура("КлючПользовательскихПараметров, КаталогПараметров", КлючПользовательскойНастройки, КаталогНастроек);

	Возврат яПараметрыSaby_ПрочитатьСервер(ПараметрыДляЗаписи);
	
КонецФункции

