
&НаКлиенте
Процедура КонфигурацияПриИзменении_Завершение(АргументЗавершения, ДопПараметры) Экспорт
	
	лОткатитьСистему = ДопПараметры.Отказ;
	ПараметрыОбновить = Новый Структура;
	Если АргументЗавершения = Неопределено Тогда
		лОткатитьСистему = Истина;
	Иначе
		ПараметрыОбновить.Вставить("УстановленныеИни", АргументЗавершения);		
	КонецЕсли;
	Если лОткатитьСистему Тогда
		Конфигурация = ПараметрыРаботы.КонфигурацияБыла;
	КонецЕсли;
	Если ДопПараметры.Отказ Тогда
		МодульОбъектаКлиент().СбисСообщить(АргументЗавершения.details);
		Возврат;
	КонецЕсли;	
	СбисОбновитьОтображение(ПараметрыОбновить);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием_ПослеДиалога(РезультатДиалога, ДопПараметры) Экспорт
	
	Если		ДопПараметры.Режим = "Завершить" Тогда
		Если РезультатДиалога = КодВозвратаДиалога.Да Тогда

			МодульОбъектаКлиент().СбисЗавершитьРаботу();
			
		КонецЕсли;
		
		Возврат;
	ИначеЕсли	ДопПараметры.Режим = "Сохранить" Тогда
		Если		РезультатДиалога = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		ИначеЕсли	РезультатДиалога = КодВозвратаДиалога.Да Тогда 
			ПараметрыЗаписи = Новый Структура("Отказ, ПродолжитьВыполнение", Ложь, Истина);
			Кэш.ФормаНастроек.СбисСохранитьВыбранныеНастройки(Кэш, ПараметрыЗаписи);
			Если ПараметрыЗаписи.Отказ Тогда 
				Возврат;
			КонецЕсли;
			ФормаЗакрытьУстановитьСтатусОк();
			Кэш.КэшНастроек.ИзмененияВНастройках = Ложь;
			ОбработчикДействия = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПерейтиВРаздел", Кэш.ГлавноеОкно);
			ОтложенноеДействие = МодульОбъектаКлиент().НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения", ОбработчикДействия));
			МодульОбъектаКлиент().ПодключитьОтложенноеДействие(ОтложенноеДействие);
		Иначе 
			ФормаЗакрытьУстановитьСтатусОк();
			ОбработчикДействия = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПерейтиВРаздел", Кэш.ГлавноеОкно);
			ОтложенноеДействие = МодульОбъектаКлиент().НовыйОтложенноеДействие(Новый Структура("ОписаниеОповещения", ОбработчикДействия));
			МодульОбъектаКлиент().ПодключитьОтложенноеДействие(ОтложенноеДействие);
		КонецЕсли;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СбисОбновитьТаблицыИниФайлов(УстановленныеИниФайлы = Неопределено, Отказ = Ложь) Экспорт
	Перем СписокИниФайлыПрименить;
	
	Если Отказ Тогда
		ОбновитьПоляФормы(Новый Структура("ТабУстановленныеИниФайлы", Новый Массив()));
		Возврат;
	КонецЕсли;
	
	// Если инишки не передали, то проверим их 
	Если УстановленныеИниФайлы = Неопределено Тогда
		ДопПараметры = Новый Структура("Автообновление", Кэш.Парам.НастройкиАвтообновление);      
		УстановленныеИниФайлы = Кэш.ФормаНастроек.сбисПолучитьМассивУстановленныхИниФайлов(Кэш, ДопПараметры);
	КонецЕсли;
	
	Если Не Кэш.Свойство("Конфигурация") Тогда
		ЭтаФорма.ТабДоступныеИниФайлы.Очистить();
		
		СписокТиповНастроек = Кэш.ФормаНастроек.сбисПолучитьСписокДоступныхНастроек(Кэш);
		
		Если СписокТиповНастроек = Неопределено Тогда    
			ИнфоОбОшибке = "Не удалось получить список доступных настроек. Обратитесь в техподдержку";
			МодульОбъектаКлиент().ВызватьСбисИсключение(ИнфоОбОшибке, "ФайлыНастроекОбщее.СбисОбновитьТаблицыИниФайлов");
		КонецЕсли;
		
		ДанныеКонфигураций = Кэш.ФормаНастроекОбщее.СформироватьСтруктуруКонфигураций(Кэш, СписокТиповНастроек);
		Кэш.ГлавноеОкно.сбисЭлементФормы(ЭтаФорма, "Конфигурация").СписокВыбора.ЗагрузитьЗначения(ДанныеКонфигураций.СписокВыбора);		
		Кэш.Вставить("Конфигурация", ДанныеКонфигураций.СтруктураКонфигураций);
		Конфигурация = Конфигурация;//Это имеет смысл, т.к. обновляет список выбора значением.
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Конфигурация) Тогда 
		
		ПрефиксСервис = Кэш.КэшНастроек.ПараметрыНастроек.ПрефиксСервис;
		ЗначениеПредставление = Новый Структура("ЗначениеПредставление", "Представление");
		Префикс = Кэш.ФормаНастроекОбщее.ПолучитьМассивФайловДляКонфигурации(СписокТиповНастроек, ПрефиксСервис, ЗначениеПредставление);
		
		Конфигурация = Кэш.ФормаНастроекОбщее.ОпределитьТипНастроекПоПрефиксу(Кэш.КэшНастроек.ПараметрыНастроек.ПрефиксСервис, Префикс);
	КонецЕсли;
	
	Если Не (ТипЗнч(УстановленныеИниФайлы) = Тип("Структура") И	УстановленныеИниФайлы.Свойство("СписокФайлов", СписокИниФайлыПрименить)) Тогда
		СписокИниФайлыПрименить = УстановленныеИниФайлы;
	КонецЕсли;                                                                                                       
	
	//Обновим таблицу доступных инишек
	Если	Кэш.Свойство("Конфигурация") Тогда
		
		Если СписокИниФайлыПрименить = Неопределено Тогда
			СписокИниФайлыПрименить = ТабУстановленныеИниФайлы;
		КонецЕсли;                                           
		
		СтруктураКонфигурации	= Кэш.ФормаНастроек.сбисПолучитьСтруктуруКонфигурации(Кэш, Кэш.Конфигурация, Конфигурация);
		ДоступныеИниФайлы		= Кэш.ФормаНастроекОбщее.СформироватьМассивТабДоступныеИниФайлыОбновить(СтруктураКонфигурации, СписокИниФайлыПрименить);
	Иначе
		ДоступныеИниФайлы = Новый Массив();
	КонецЕсли;
	
	ОбновитьПоляФормы(Новый Структура("ТабДоступныеИниФайлы", ДоступныеИниФайлы));
	
	//Если есть чем, то установленных инишек
	Если Не	УстановленныеИниФайлы = Неопределено Тогда
		ОбновитьПоляФормы(Новый Структура("ТабУстановленныеИниФайлы", СписокИниФайлыПрименить));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СбисОбновитьОтображение(ПараметрыОбновления=Неопределено, ДопПараметры=Неопределено)
	
	Перем УстановленныеИниФайлы;
	Если    	ПараметрыОбновления = Неопределено
		Или	Не	ПараметрыОбновления.Свойство("УстановленныеИни", УстановленныеИниФайлы) Тогда
		ДопПараметры = Новый Структура("Автообновление", Кэш.Парам.НастройкиАвтообновление);      
		УстановленныеИниФайлы = Кэш.ФормаНастроек.СбисПолучитьМассивУстановленныхИниФайлов(Кэш, ДопПараметры);
	КонецЕсли;
	СбисОбновитьТаблицыИниФайлов(УстановленныеИниФайлы);
	СбисОбновитьЭлементы_РазделНастроек();
	
КонецПроцедуры

//Процедура управляет отображением элементов на вкладке файлов настроек
&НаКлиенте
Процедура СбисОбновитьЭлементы_РазделНастроек()
	
	Перем ОсновнойЭлементПанелиДействий, ТипНастроек, ВыбраныНастройки;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ГруппаДействияНастройкиЛево").Видимость 
						= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ДоступныСерверныеНастройки");
	
	СпособХраненияНастроек = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("СпособХраненияНастроек");
	КаталогНастроек        = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("КаталогНастроек");
	
	ОбычнаяФорма = Не Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение;
	АктивныСерверныеНастройки = СпособХраненияНастроек	= 1;
	ЗаголовокНазвания = ?(АктивныСерверныеНастройки, "Выбранные настройки", "Каталог настроек");
	ЗаголовокНазвания = ЗаголовокНазвания + ?(ОбычнаяФорма, ":", "");
	ДобавитьКЗаголовку = "";
	
	Если	АктивныСерверныеНастройки
		И	Кэш.КэшНастроек.Свойство("ВыбранныеНастройки", ВыбраныНастройки)
		И	ВыбраныНастройки.ПараметрыРаботы.Свойство("ТипНастроек", ТипНастроек) Тогда
		
		ДобавитьКЗаголовку = ?(ТипНастроек = Неопределено, "", ТипНастроек);
		
		Если Кэш.ФормаНастроек.ЕстьИзмененияНастроек(Кэш) Тогда
			ДобавитьКЗаголовку = ДобавитьКЗаголовку + "*";
		КонецЕсли;
		
		НастройкиНазвание = ВыбраныНастройки.Название;
		
	КонецЕсли; 
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда	
		Если АктивныСерверныеНастройки Тогда
			СтраницаПутиКНастройкам = "СтраницаНастройкиНазвание";
		Иначе	
			СтраницаПутиКНастройкам = "СтраницаКаталогНастроек";
		КонецЕсли;  
		ОтображениеНастроек = сбисЭлементФормы(ЭтаФорма, "ГруппаПутьКНастройкам");
		ОтображениеНастроек.ТекущаяСтраница = сбисПолучитьСтраницу(ОтображениеНастроек, СтраницаПутиКНастройкам);
	#Иначе
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "КаталогНастроек").Видимость	= Не АктивныСерверныеНастройки;
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "НастройкиНазвание").Видимость	= АктивныСерверныеНастройки;
	#КонецЕсли
	
	ЭлементДействия = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДействияСНастройками");
	ЭлементДействие_СохранитьИзменения	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭлементДействия, "ДействияСНастройками_СохранитьИзменения");
	ЭлементДействие_ПеречитатьНастройки	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭлементДействия, "ДействияСНастройками_ПеречитатьНастройки");
	ЭлементДействие_ЗагрузитьИзКаталога	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭлементДействия, "ДействияСНастройками_ЗагрузитьИзКаталога");
	ЭлементДействие_ВыгрузитьВКаталог	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭлементДействия, "ДействияСНастройками_ВыгрузитьВКаталог");
	
	Если АктивныСерверныеНастройки Тогда
		
		ОсновнойЭлементПанелиДействий	= ЭлементДействие_СохранитьИзменения;
		ЗаголовокДействиеЗагрузить		= "Загрузить настройки из каталога";
		ЗаголовокДействиеВыгрузить		= "Выгрузить настройки в каталог";
		
	ИначеЕсли	Не Кэш.ПараметрыСистемы.Конфигурация.Файловая
			И	Не ОбычнаяФорма Тогда
			
		ОсновнойЭлементПанелиДействий	= ЭлементДействие_ЗагрузитьИзКаталога;
		ЗаголовокДействиеЗагрузить		= "Перенести настройки из каталога на сервер";
		ЗаголовокДействиеВыгрузить		= "Получить настройки с сервера в каталог";
		
	КонецЕсли;
	
	Если ОсновнойЭлементПанелиДействий = Неопределено Тогда
		
		ЭлементДействия.Видимость = Ложь;
		
		Если ОбычнаяФорма Тогда
			//TODO спилить отдельную кнопку и сделать как на УФ, от панели
			МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДействияСНастройками_СохранитьИзменения").Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		
		ЭлементДействия.Видимость = Истина;
		
		Если ОбычнаяФорма Тогда
			МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДействияСНастройками_СохранитьИзменения").Видимость = Истина;
		Иначе
			
			ЭлементДействие_СохранитьИзменения.Видимость	= АктивныСерверныеНастройки;
			ЭлементДействие_ПеречитатьНастройки.Видимость	= АктивныСерверныеНастройки;
			ЭлементДействие_ЗагрузитьИзКаталога.Заголовок	= ЗаголовокДействиеЗагрузить;
			ЭлементДействие_ВыгрузитьВКаталог.Заголовок		= ЗаголовокДействиеВыгрузить;
			
			ЭлементДействия.Заголовок	= ОсновнойЭлементПанелиДействий.Заголовок;
			ЭлементДействия.Картинка	= ОсновнойЭлементПанелиДействий.Картинка;
			
		КонецЕсли;
		
	КонецЕсли;

	Если ОбычнаяФорма	Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "НадписьНастройки").Заголовок	= ЗаголовокНазвания + " " + ДобавитьКЗаголовку;
	ИначеЕсли АктивныСерверныеНастройки Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "НастройкиНазвание").Заголовок	= ЗаголовокНазвания + " " + ДобавитьКЗаголовку;
	КонецЕсли;
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
		ОбновитьОтображениеДанных();
	#КонецЕсли
КонецПроцедуры

 // Процедура проверяет структуру настроек, обновляет данные на форме об установленных настройках	
&НаКлиенте
Процедура СбисОбновитьИнформациюНастроек(Кэш, УстановленныеИниФайлы = Неопределено, Отказ = Ложь) Экспорт
	
	СбисОбновитьОтображение();
		
КонецПроцедуры

