
&НаКлиенте
Процедура ПередЗакрытиемОбработчик(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка = Истина)
	
	Если ПараметрыФормы.РежимЗакрытия = "ЗавершениеРаботы" Тогда
		
		Возврат;

	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Не Кэш.КэшНастроек.ИниВПорядке Тогда
		ОбработчикДиалога = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПередЗакрытием_ПослеДиалога", ЭтаФорма, Новый Структура("Режим", "Завершить"));
		ТекстВопроса = "Обнаружены ошибки в файлах настроек.
		|Без их исправления дальнейшая работа невозможна.";
		МодульОбъектаКлиент().СбисПоказатьВопрос(ОбработчикДиалога, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Завершить работу?");
		Отказ = Истина;
		Возврат;
	ИначеЕсли Кэш.ФормаНастроек.ЕстьИзмененияНастроек(Кэш) Тогда
		ОбработчикДиалога = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПередЗакрытием_ПослеДиалога", ЭтаФорма, Новый Структура("Режим", "Сохранить"));
		Если Кэш.ФормаНастроек.СбисПолучитьИдентификаторНастроек(Кэш) = МодульОбъектаКлиент().ПолучитьИдКоннекшена() Тогда
			МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(КодВозвратаДиалога.Да, ОбработчикДиалога);
		Иначе	
			МодульОбъектаКлиент().СбисПоказатьВопрос(ОбработчикДиалога, "Сохранить изменения в настройках?", РежимДиалогаВопрос.ДаНетОтмена,,,"Рекомендуется сохранить внесенные изменения.");	
		КонецЕсли;

		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонфигурацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ПараметрыРаботы.Вставить("КонфигурацияБыла", Конфигурация);

КонецПроцедуры

&НаКлиенте
Процедура КонфигурацияПриИзменении(Элемент)
	
	ПараметрыКонфигурации	= НайтиВыбраннуюКонфигурациюНастроек(Кэш.Конфигурация, Конфигурация);
	ОбработчикЗавершения	= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("КонфигурацияПриИзменении_Завершение", ЭтаФорма, Новый Структура("Кэш, Отказ", Кэш, Ложь));
	Кэш.ФормаНастроек.КонфигурацияПриИзменении(Новый Структура("Конфигурация, ОбработчикЗавершения", ПараметрыКонфигурации, ОбработчикЗавершения), Кэш);
	                                    
КонецПроцедуры

