
&НаКлиенте
Функция ПолучитьАдресДоставкиУП(Контекст) Экспорт
	
	АдресЗапись = Новый Структура;
	КодСтраны = РассчитатьЗначение("АдресДоставкиКодСтраны", Контекст);
	НаимСтран = РассчитатьЗначение("АдресДоставкиНаимСтран", Контекст);
	Если НЕ Контекст.Свойство("АдресДоставкиПредставление") ИЛИ НЕ ЗначениеЗаполнено(Контекст.АдресДоставкиПредставление) Тогда
		Возврат Неопределено;
	Иначе
		АдресЗапись.Вставить("Представление", Контекст.АдресДоставкиПредставление);
	КонецЕсли;
	
	Если Контекст.Свойство("АдресДоставкиЗначение") И ЗначениеЗаполнено(Контекст.АдресДоставкиЗначение) И Не Контекст.АдресДоставкиЗначение = Ложь Тогда
		АдресЗначение = Контекст.АдресДоставкиЗначение;
	ИначеЕсли	Контекст.мСторона.Свойство("Грузополучатель")
				И ЗначениеЗаполнено(Контекст.мСторона.Грузополучатель.Сторона) Тогда
		ДопКонтекст = Новый Структура("Контрагент, АдресПредставление", Контекст.мСторона.Грузополучатель.Сторона, Контекст.АдресДоставкиПредставление);
		АдресЗначение = ПолучитьАдресЗначениеПоКонтрагентуИПредставлениюАдресаУП_НаСервере(ДопКонтекст);
	Иначе
		АдресЗначение = Неопределено;
	КонецЕсли;
	Если ЗначениеЗаполнено(АдресЗначение) Тогда
		АдресЗапись.Вставить("Значение", АдресЗначение);
	ИначеЕсли ЗначениеЗаполнено(КодСтраны) Тогда
		АдресЗапись.Вставить("КодСтраны", КодСтраны);
		АдресЗапись.Вставить("НаимСтран", НаимСтран);
	КонецЕсли;
	
	Если Контекст.Свойство("АдресДоставкиЗначенияПолей") И ЗначениеЗаполнено(Контекст.АдресДоставкиЗначенияПолей) И Не Контекст.АдресДоставкиЗначенияПолей = Ложь Тогда
		АдресЗапись.Вставить("ЗначенияПолей", Контекст.АдресДоставкиЗначенияПолей);
	КонецЕсли;
	
	Возврат ПолучитьАдресУПОбщая(АдресЗапись);
	
КонецФункции

&НаКлиенте
Функция ПолучитьАдресПогрузкиУП(Контекст) Экспорт
	АдресЗапись = Новый Структура;
	Если НЕ Контекст.Свойство("АдресПогрузкиПредставление") ИЛИ НЕ ЗначениеЗаполнено(Контекст.АдресПогрузкиПредставление) Тогда
		Возврат Неопределено;
	Иначе
		АдресЗапись.Вставить("Представление",Контекст.АдресПогрузкиПредставление);
	КонецЕсли;
	
	Если Контекст.Свойство("АдресПогрузкиЗначение") И ЗначениеЗаполнено(Контекст.АдресПогрузкиЗначение) Тогда
		АдресЗапись.Вставить("Значение",Контекст.АдресПогрузкиЗначение);
	КонецЕсли;
	
	Если Контекст.Свойство("АдресПогрузкиЗначенияПолей") И ЗначениеЗаполнено(Контекст.АдресПогрузкиЗначенияПолей) Тогда
		АдресЗапись.Вставить("ЗначенияПолей",Контекст.АдресПогрузкиЗначенияПолей);
	КонецЕсли;
	
	Возврат ПолучитьАдресУПОбщая(АдресЗапись);
КонецФункции

// Общая функция,  возвращает структуру адреса в универсальном формате (3.01)
// Используется для конфигураций, где адреса хранятся в табличной части КонтактнаяИнформация справочников Организации и Контрагенты
// Параметры: 
// - АдресЗапись (Тип "Строка"(см. АдресЗапись.Представление) или "Структура"). Если структура:
//		- АдресЗапись.Представление	(Тип "Строка", обязательный) - представление адреса в текстовом виде
//		- АдресЗапись.Значение		(Тип "Строка") - Адрес в виде строки JSON
//		- АдресЗапись.ЗначенияПолей	(Тип "Строка") - Адрес в виде строки XML
// 		Обязательно к заполнению хотя бы одно из полей "АдресЗапись.Значение", "АдресЗапись.ЗначенияПолей"
&НаКлиенте
Функция ПолучитьАдресУПОбщая(АдресЗапись) Экспорт

	Адрес = Новый Структура;
	Адрес.Вставить("Тип", "Юридический");
	Если ТипЗнч(АдресЗапись) = Тип("Строка") Тогда
		
		Адрес.Вставить("АдрТекст",	АдресЗапись);
		Адрес.Вставить("АдрИно",	сбисСтруктураАдрИно(,АдресЗапись));
		Возврат Адрес;
		
	ИначеЕсли НЕ АдресЗапись.Свойство("Представление") ИЛИ НЕ ЗначениеЗаполнено(АдресЗапись.Представление)  Тогда
		
		Возврат Неопределено;
		
	ИначеЕсли	(НЕ АдресЗапись.Свойство("Значение") ИЛИ НЕ ЗначениеЗаполнено(АдресЗапись.Значение)) 
			И	(НЕ АдресЗапись.Свойство("ЗначенияПолей") ИЛИ НЕ ЗначениеЗаполнено(АдресЗапись.ЗначенияПолей)) Тогда 
			
		КодСтраны = Неопределено;
		НаимСтран = Неопределено;
		АдресЗапись.Свойство("КодСтраны", КодСтраны);
		АдресЗапись.Свойство("НаимСтран", НаимСтран);
		Адрес.Вставить("АдрТекст",	АдресЗапись.Представление);
		Адрес.Вставить("АдрИно",	сбисСтруктураАдрИно(КодСтраны, АдресЗапись.Представление, НаимСтран));
		Возврат Адрес;
		
	КонецЕсли;		
	
	Адрес.Вставить("АдрТекст",АдресЗапись.Представление);
	
	ПараметрыАдрес = Новый Структура;
	
	ПараметрыАдрес.Вставить("Индекс",		"");
	ПараметрыАдрес.Вставить("КодРегион",	"");
	ПараметрыАдрес.Вставить("Регион",		"");
	ПараметрыАдрес.Вставить("Район",		"");
	ПараметрыАдрес.Вставить("Город",		"");
	ПараметрыАдрес.Вставить("НаселПункт",	"");
	ПараметрыАдрес.Вставить("Улица",		"");
	ПараметрыАдрес.Вставить("УлицаДопИнфо",	"");
	ПараметрыАдрес.Вставить("Дом",			"");
	ПараметрыАдрес.Вставить("Корпус",		"");
	ПараметрыАдрес.Вставить("Квартира",		"");
	ПараметрыАдрес.Вставить("ТипКвартиры",	"");
	ПараметрыАдрес.Вставить("ТипКорпуса",	"");
	ПараметрыАдрес.Вставить("КодСтраны",	"");
	ПараметрыАдрес.Вставить("НаимСтран",	"");
	ПараметрыАдрес.Вставить("ФиасИД",		"");
	
	ПараметрыАдрес.Вставить("ЗаполненоЗначениеАдреса", Ложь);
	// В приоритете берем адрес из поля Значение, т.к. в последних версиях конфигураций в ЗначенияПолей кладется не вся инфа (например, нет Района)
	Если	АдресЗапись.Свойство("Значение")
		И	Лев(АдресЗапись.Значение, 1) = "{" Тогда
		
		ЗаполнитьДанныеАдресаИзJSON(АдресЗапись.Значение, ПараметрыАдрес);
		
	КонецЕсли;
	
	Если НЕ ПараметрыАдрес.ЗаполненоЗначениеАдреса Тогда
		
		АдресРег = АдресЗапись.ЗначенияПолей;
		
		Если Лев(АдресРег,21) = "<КонтактнаяИнформация" Тогда
			
			ЗаполнитьДанныеАдресаИзXML(АдресРег, ПараметрыАдрес)

		Иначе
			
			ЗаполнитьДанныеАдресаИзСтроки(АдресРег, ПараметрыАдрес)
			
		КонецЕсли;
		
	КонецЕсли;
			
	Если Лев(ПараметрыАдрес.Корпус,5) = "корп." Тогда
		
		// отрезаем "корп." в начале, чтобы в пользовательских визуализациях не выводилось два раза "корп."
		ПараметрыАдрес.Корпус = Сред(ПараметрыАдрес.Корпус,6);
		
	КонецЕсли;
	
	Если Прав(ПараметрыАдрес.Корпус,1) = "," Тогда
		
		ПараметрыАдрес.Корпус = Лев(ПараметрыАдрес.Корпус,СтрДлина(ПараметрыАдрес.Корпус)-1);
		
	КонецЕсли;
	
	Если Лев(ПараметрыАдрес.Квартира,3) = "кв." Тогда
		
		// отрезаем "кв." в начале, чтобы в пользовательских визуализациях не выводилось два раза "кв."
		ПараметрыАдрес.Квартира = Сред(ПараметрыАдрес.Квартира,4);
		
	КонецЕсли;
	
	Если Прав(ПараметрыАдрес.Квартира,1) = "," Тогда
		
		ПараметрыАдрес.Квартира = Лев(ПараметрыАдрес.Квартира,СтрДлина(ПараметрыАдрес.Квартира)-1);
		
	КонецЕсли;
	
	Если ПараметрыАдрес.КодРегион = "" И Не ПустаяСтрока(ПараметрыАдрес.Регион) Тогда
		
		сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "ПользовательскиеЗначения.КлассификаторРегионов", ПараметрыАдрес.Регион); 
		сбисОписаниеОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
		Если сбисОписаниеОбъекта.Значение = Неопределено Тогда
			
			сбисОписаниеОбъекта.Значение = ПолучитьКодРегионаПоНазванию(сбисОписаниеОбъекта.Ключ);
			сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
			
		КонецЕсли;
		ПараметрыАдрес.КодРегион = сбисОписаниеОбъекта.Значение;
		
	КонецЕсли;	

	АдресЗаполнен = Истина;
	Попытка
		
		Если ПараметрыАдрес.КодРегион = "" Тогда
			
			АдресЗаполнен = Ложь;
			
		Иначе
			
			Адрес.Вставить("АдрРФ", сбисСтруктураАдрРФ(ПараметрыАдрес));
			
		КонецЕсли;
				
	Исключение
		
		// Ошибка при заполнении адреса, не заполнено, чтобы выставилось АдрИно
		АдресЗаполнен = Ложь;
		
	КонецПопытки;
	
	Если Не АдресЗаполнен Тогда
		
		Адрес.Вставить("АдрИно", сбисСтруктураАдрИно(ПараметрыАдрес.КодСтраны, АдресЗапись.Представление, ПараметрыАдрес.НаимСтран));

	КонецЕсли;
	
	Адрес.Вставить("ФиасИД", ПараметрыАдрес.ФиасИД);
	
	Возврат Адрес;
	
КонецФункции

&НаСервере
Функция ПолучитьКодРегионаПоНазванию(НазваниеРегиона) Экспорт

	Возврат МодульОбъектаСервер().ПолучитьКодРегионаПоНазваниюНаСервере(НазваниеРегиона)
	
КонецФункции
	
&НаКлиенте
Функция ПолучитьАдресУП(Контекст) Экспорт
	// Функция заполняет структуру адреса в универсальном формате (3.01)	
	// Используется для конфигураций, где адреса хранятся в табличной части КонтактнаяИнформация справочников Организации и Контрагенты
	Если Контекст.Свойство("Адрес") и ЗначениеЗаполнено(Контекст.Адрес) Тогда
		АдресЗапись = Контекст.Адрес;
	ИначеЕсли Контекст.Свойство("АдресФЛ") и ЗначениеЗаполнено(Контекст.АдресФЛ) Тогда
		АдресЗапись = Контекст.АдресФЛ;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	АдресРезультат = ПолучитьАдресУПОбщая(АдресЗапись);
	
	Если НЕ РассчитатьЗначение("РасширенныйАдрес", Контекст) = Истина Тогда
		
		УдаляемыеУзлы = Новый Массив;
		УдаляемыеУзлы.Добавить("АдрРФ.НаимРегион");
		УдаляемыеУзлы.Добавить("АдрИно.НаимСтран");
		УдаляемыеУзлы.Добавить("ФиасИД");

		Для Каждого ПутьУзла Из УдаляемыеУзлы Цикл
			
			РазобранныйПутьУзла = Новый СписокЗначений;
			РазобранныйПутьУзла.ЗагрузитьЗначения(РазбитьСтрокуВМассивНаКлиенте(ПутьУзла, "."));
			
			МодульОбъектаКлиент().УдалитьУзелИзСтруктурыДанных(АдресРезультат, РазобранныйПутьУзла);
			
		КонецЦикла;                      
		
	КонецЕсли;
	
	Возврат АдресРезультат;
	
КонецФункции

//Функция вынесена из ПолучитьАдресУП.
&НаКлиенте
Функция ПолучитьПараметрАдресаУП(ЗначениеСостав, КлючПараметра)
	ЗначениеПараметра = Неопределено;
	Если ЗначениеСостав.Свойство(КлючПараметра, ЗначениеПараметра) Тогда
		Если ТипЗнч(ЗначениеПараметра) = Тип("Структура") И ЗначениеПараметра.Свойство("Параметр") Тогда
			Возврат ЗначениеПараметра.Параметр;
		ИначеЕсли ТипЗнч(ЗначениеПараметра) = Тип("Строка") Тогда
			Возврат ЗначениеПараметра;
		КонецЕсли;
	КонецЕсли;
	Возврат "";	
КонецФункции

#Область include_core2_vo2_ОбщиеФункции_ЗагрузкаДокументов_БлокФункцийИниФайлов_Адрес_Общее
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ЗагрузкаДокументов_БлокФункцийИниФайлов_Адрес_ЗаполнитьДанныеАдресаИзJSON
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ЗагрузкаДокументов_БлокФункцийИниФайлов_Адрес_ЗаполнитьДанныеАдресаИзXML
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ЗагрузкаДокументов_БлокФункцийИниФайлов_Адрес_ЗаполнитьДанныеАдресаИзСтроки
#КонецОбласти

