
&НаКлиенте
Функция сбисПолучитьДанныеПоКонтуру(Контекст) Экспорт
	
	Перем Сделка, Реализация;
	
	//Запрос для КонтурEDI
	Если Не Контекст.Ини.Свойство("Сделка", Сделка) Или Не Контекст.Ини.Свойство("Реализация", Реализация) Тогда
		
		// Возможно это УоО надо попробовать взять узел документ
		Реализация = Контекст.Ини.Документ;
		
	КонецЕсли;
	
	МассивНоменклатурCХар = Новый Массив;
	МассивНоменклатурБезХар = Новый Массив;
	
	Для Каждого Элемент Из Контекст.ТаблДок.СтрТабл Цикл
		
		Если НЕ Элемент.Свойство("Номенклатура") Тогда
			
			Продолжить;
			
		КонецЕсли;
			
		ЭлементНоменклатуры = Новый Структура;
		ЭлементНоменклатуры.Вставить("Номенклатура", Элемент.Номенклатура);
		ЭлементНоменклатуры.Вставить("ЕдИзм1С", Элемент.ЕдИзм1С); 
		
		Если Элемент.Свойство("Характеристика1С") И ЗначениеЗаполнено(Элемент.Характеристика1С) Тогда 
			
			ЭлементНоменклатуры.Вставить("Характеристика",Элемент.Характеристика1С);
		    МассивНоменклатурCХар.Добавить(ЭлементНоменклатуры); 
			
		Иначе
			
			МассивНоменклатурБезХар.Добавить(ЭлементНоменклатуры); 
			
		КонецЕсли;  
		
	КонецЦикла;
	
	СтороныДокумента = Контекст.Ини.мСторона;  
	
	СторонаПолучатель		= МодульОбъектаКлиент().БыстроеВнедрениеEDI_ПолучитьДанныеСтороныПоИмени(СтороныДокумента, "Получатель").Сторона;
	СторонаОтправитель 		= МодульОбъектаКлиент().БыстроеВнедрениеEDI_ПолучитьДанныеСтороныПоИмени(СтороныДокумента, "Отправитель").Сторона; 
	СторонаГрузополучатель	= МодульОбъектаКлиент().БыстроеВнедрениеEDI_ПолучитьДанныеСтороныПоИмени(СтороныДокумента, "Грузополучатель").Сторона; 
	СторонаГрузоотправитель	= МодульОбъектаКлиент().БыстроеВнедрениеEDI_ПолучитьДанныеСтороныПоИмени(СтороныДокумента, "Грузоотправитель").Сторона; 
	
	СтороныКонтура = Новый Структура;
	
	СтороныКонтура.Вставить("Получатель",		СторонаПолучатель);  
	СтороныКонтура.Вставить("Отправитель",		СторонаОтправитель);
	СтороныКонтура.Вставить("Грузополучатель",	СторонаГрузополучатель);
	СтороныКонтура.Вставить("Грузоотправитель",	СторонаГрузоотправитель);
	
	ПартнерКонтура 	= МодульОбъектаКлиент().БыстроеВнедрениеEDI_ПоискПартнераВКонтуре(СторонаПолучатель);
	ДанныеКонтура 	= ПолучитьДанныеКонтура(Реализация, Сделка, МассивНоменклатурБезХар, МассивНоменклатурCХар, ПартнерКонтура, СтороныКонтура);
		
	Возврат ДанныеКонтура;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеКонтура(Реализация, Сделка, МассивНоменклатурБезХар, МассивНоменклатурCХар, ПартнерКонтура, СтороныКонтура)
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц; 
	
	ПодготовитьНоменклатуру(МенеджерВТ, МассивНоменклатурCХар, МассивНоменклатурБезХар);
	ПолучитьДанныеНоменклатурКонтура(МенеджерВТ, ПартнерКонтура);
	ПолучитьДанныеGLNКонтура(МенеджерВТ, СтороныКонтура, ПартнерКонтура);
	ПолучитьДанныеОснованийКонтура(Реализация, Сделка, МенеджерВТ);
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Текст = "ВЫБРАТЬ * из ВТ_ДанныеКонтура";	
	ТабОснованийКонтура = Запрос.Выполнить().Выгрузить();
	ОснованияКонтура = МодульОбъектаСервер().СериализоватьОбъектДляВозвратаНаКлиент(ТабОснованийКонтура);
	
	Запрос.Текст = "ВЫБРАТЬ * из ВТ_ДанныеGLN";
	ТабДанныеGLN = Запрос.Выполнить().Выгрузить();
	ДанныеGLN = МодульОбъектаСервер().СериализоватьОбъектДляВозвратаНаКлиент(ТабДанныеGLN);
	
	Запрос.Текст = "ВЫБРАТЬ * из ВТ_GTIN_Номенклатуры";	
	ТабНоменклатураКонтура = Запрос.Выполнить().Выгрузить();
	
	НомеклатураМассивСтруктур = МодульОбъектаСервер().СериализоватьОбъектДляВозвратаНаКлиент(ТабНоменклатураКонтура);
	
	СтруктураДанныхКонтура = Новый Структура;
	СтруктураДанныхКонтура.Вставить("ОснованияКонтура", ОснованияКонтура);
	СтруктураДанныхКонтура.Вставить("НоменклатураКонтура", НомеклатураМассивСтруктур);
	СтруктураДанныхКонтура.Вставить("ДанныеGLN", ДанныеGLN[0]);
	
	Возврат СтруктураДанныхКонтура;
		
КонецФункции

&НаСервере
Процедура ПодготовитьНоменклатуру(МенеджерВТ, МассивНоменклатурCХар, МассивНоменклатурБезХар)
	
	ЕстьСХар   = МассивНоменклатурCХар.Количество() > 0;
	ЕстьБезХар = МассивНоменклатурБезХар.Количество() > 0;
	
	Если ЕстьСХар Тогда
		МодульОбъектаСервер().ПоместитьОбъектВоВременнуюТаблицу(МенеджерВТ,
		Новый Структура("Имя, Значение", "ВТ_НоменклатураКонтураСХар", МассивНоменклатурCХар));
	КонецЕсли;
	
	Если ЕстьБезХар Тогда
		МодульОбъектаСервер().ПоместитьОбъектВоВременнуюТаблицу(МенеджерВТ,
		Новый Структура("Имя, Значение", "ВТ_НоменклатураКонтураБезХар", МассивНоменклатурБезХар));
	КонецЕсли;
	
	Если ЕстьСХар И ЕстьБезХар Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|   Объединение.Номенклатура КАК Номенклатура,
		|   Объединение.ЕдИзм1С КАК ЕдИзм1С,
		|   Объединение.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТ_Итоговая
		|ИЗ (
		|   ВЫБРАТЬ
		|       ВТ_НоменклатураКонтураСХар.Номенклатура КАК Номенклатура,
		|       ВТ_НоменклатураКонтураСХар.ЕдИзм1С КАК ЕдИзм1С,
		|       ВТ_НоменклатураКонтураСХар.Характеристика КАК Характеристика
		|   ИЗ ВТ_НоменклатураКонтураСХар КАК ВТ_НоменклатураКонтураСХар
		|
		|   ОБЪЕДИНИТЬ ВСЕ
		|
		|   ВЫБРАТЬ
		|       ВТ_НоменклатураКонтураБезХар.Номенклатура КАК Номенклатура,
		|       ВТ_НоменклатураКонтураБезХар.ЕдИзм1С КАК ЕдИзм1С,
		|       NULL КАК Характеристика
		|   ИЗ ВТ_НоменклатураКонтураБезХар КАК ВТ_НоменклатураКонтураБезХар
		|) КАК Объединение";
		
	ИначеЕсли ЕстьСХар Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|   ВТ_НоменклатураКонтураСХар.Номенклатура КАК Номенклатура,
		|   ВТ_НоменклатураКонтураСХар.ЕдИзм1С КАК ЕдИзм1С,
		|   ВТ_НоменклатураКонтураСХар.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТ_Итоговая
		|ИЗ ВТ_НоменклатураКонтураСХар КАК ВТ_НоменклатураКонтураСХар";
		
	ИначеЕсли ЕстьБезХар Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|   ВТ_НоменклатураКонтураБезХар.Номенклатура КАК Номенклатура,
		|   ВТ_НоменклатураКонтураБезХар.ЕдИзм1С КАК ЕдИзм1С,
		|   NULL КАК Характеристика
		|ПОМЕСТИТЬ ВТ_Итоговая
		|ИЗ ВТ_НоменклатураКонтураБезХар КАК ВТ_НоменклатураКонтураБезХар";
		
	Иначе
		// Оба массива пусты
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|   NULL КАК Номенклатура,
		|   NULL КАК ЕдИзм1С,
		|   NULL КАК Характеристика
		|ПОМЕСТИТЬ ВТ_Итоговая
		|ГДЕ 1 = 0";
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить(); 
	
КонецПроцедуры  


&НаСервере
Процедура ПолучитьДанныеОснованийКонтура(Реализация, Сделка, МенеджерВТ)
	
 	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 	"ВЫБРАТЬ
	|	КонтурEDI_Сообщения.НомерЗаказа КАК НомерЗаказа,
	|	КонтурEDI_Сообщения.ДатаЗаказа КАК ДатаЗаказа,
	|	КонтурEDI_Сообщения.ДатаПоставки КАК ДатаПоставки
	|ПОМЕСТИТЬ ВТ_ЗАказ
	|ИЗ
	|	Справочник.КонтурEDI_Сообщения КАК КонтурEDI_Сообщения
	|ГДЕ
	|	КонтурEDI_Сообщения.ТипСообщения = ""ORDERS""
	|	И (КонтурEDI_Сообщения.Документ = &Сделка
	|			ИЛИ КонтурEDI_Сообщения.Документ = &Реализация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурEDI_Сообщения.НомерДокумента КАК НомерДокумента,
	|	КонтурEDI_Сообщения.ДатаДокумента КАК ДатаДокумента
	|ПОМЕСТИТЬ ВТ_Отгр
	|ИЗ
	|	Справочник.КонтурEDI_Сообщения КАК КонтурEDI_Сообщения
	|ГДЕ
	|	КонтурEDI_Сообщения.ТипСообщения = ""RECADV""
	|	И КонтурEDI_Сообщения.Документ = &Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗАказ.НомерЗаказа КАК НомерЗаказа,
	|	ВТ_ЗАказ.ДатаЗаказа КАК ДатаЗаказа,
	|	ВТ_ЗАказ.ДатаПоставки КАК ДатаПоставки,
	|	ВТ_Отгр.НомерДокумента КАК НомерДокумента,
	|	ВТ_Отгр.ДатаДокумента КАК ДатаДокумента
	|ПОМЕСТИТЬ ВТ_ДанныеКонтура
	|ИЗ
	|	ВТ_ЗАказ КАК ВТ_ЗАказ
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Отгр КАК ВТ_Отгр
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗАказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Отгр";
	
	Если Не ЗначениеЗаполнено(Сделка) И Не ЗначениеЗаполнено(Реализация) Тогда
		Запрос.УстановитьПараметр("Сделка", Ложь);
		Запрос.УстановитьПараметр("Реализация", Ложь)	
	Иначе 
		Запрос.УстановитьПараметр("Сделка", ?(ЗначениеЗаполнено(Сделка), Сделка, Ложь));
		Запрос.УстановитьПараметр("Реализация", ?(ЗначениеЗаполнено(Реализация), Реализация, Ложь));
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеНоменклатурКонтура(МенеджерВТ, ПартнерКонтура)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Текст =                         
	"ВЫБРАТЬ
	|	ВТ_Итоговая.Номенклатура КАК Номенклатура,
	|	КонтурEDI_СоответствияТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	КонтурEDI_СоответствияТоваров.Единица КАК Единица,
	|	КонтурEDI_СоответствияТоваров.GTIN КАК GTIN
	|ПОМЕСТИТЬ ВТ_GTIN_Номенклатуры
	|ИЗ
	|	ВТ_Итоговая КАК ВТ_Итоговая
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурEDI_СоответствияТоваров КАК КонтурEDI_СоответствияТоваров
	|		ПО (ВТ_Итоговая.Номенклатура = КонтурEDI_СоответствияТоваров.Номенклатура)
	|			И (КонтурEDI_СоответствияТоваров.ХарактеристикаНоменклатуры = ЕСТЬNULL(ВТ_Итоговая.Характеристика, Неопределено))
	|			И (КонтурEDI_СоответствияТоваров.Единица = ВТ_Итоговая.ЕдИзм1С)
	|			И (КонтурEDI_СоответствияТоваров.Партнер = &Партнер)";
	
	
	Запрос.УстановитьПараметр("Партнер", ПартнерКонтура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
КонецПроцедуры


&НаСервере
Процедура ПолучитьДанныеGLNКонтура(МенеджерВТ, СтороныКонтура, ПартнерКонтура)
		 
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	1 КАК Дубль
	|ПОМЕСТИТЬ ВТ_Якорь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтурEDI_ДополнительныеРеквизиты.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_Отправитель
	|ИЗ
	|	РегистрСведений.КонтурEDI_ДополнительныеРеквизиты КАК КонтурEDI_ДополнительныеРеквизиты
	|ГДЕ
	|	КонтурEDI_ДополнительныеРеквизиты.Объект = &Отправитель
	|	И КонтурEDI_ДополнительныеРеквизиты.Свойство В (""GLN_Контрагента"", ""GLN_Организации"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтурEDI_ДополнительныеРеквизиты.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_Получатель
	|ИЗ
	|	РегистрСведений.КонтурEDI_ДополнительныеРеквизиты КАК КонтурEDI_ДополнительныеРеквизиты
	|ГДЕ
	|	КонтурEDI_ДополнительныеРеквизиты.Объект = &Получатель
	|	И КонтурEDI_ДополнительныеРеквизиты.Свойство В (""GLN_Контрагента"", ""GLN_Организации"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтурEDI_ТочкиДоставки.СвязанныйСправочник1 КАК СвязанныйСправочник1,
	|	КонтурEDI_ТочкиДоставки.GLN КАК GLN
	|ПОМЕСТИТЬ ВТ_ГрузополучательПоПартнеру
	|ИЗ
	|	Справочник.КонтурEDI_ТочкиДоставки КАК КонтурEDI_ТочкиДоставки
	|ГДЕ
	|	КонтурEDI_ТочкиДоставки.Партнер = &Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтурEDI_ТочкиДоставки.GLN КАК GLN,
	|	КонтурEDI_ТочкиДоставки.СвязанныйСправочник1 КАК СвязанныйСправочник1
	|ПОМЕСТИТЬ ВТ_ГрузоотправительПоПартнеру
	|ИЗ
	|	Справочник.КонтурEDI_ТочкиДоставки КАК КонтурEDI_ТочкиДоставки
	|ГДЕ
	|	КонтурEDI_ТочкиДоставки.Партнер = &Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГрузополучательПоПартнеру.GLN КАК GLN
	|ПОМЕСТИТЬ ВТ_Грузополучатель
	|ИЗ
	|	ВТ_ГрузополучательПоПартнеру КАК ВТ_ГрузополучательПоПартнеру
	|ГДЕ
	|	ВТ_ГрузополучательПоПартнеру.СвязанныйСправочник1 = &Грузополучатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГрузоотправительПоПартнеру.GLN КАК GLN
	|ПОМЕСТИТЬ ВТ_Грузоотправитель
	|ИЗ
	|	ВТ_ГрузоотправительПоПартнеру КАК ВТ_ГрузоотправительПоПартнеру
	|ГДЕ
	|	ВТ_ГрузоотправительПоПартнеру.СвязанныйСправочник1 = &Грузоотправитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Грузоотправитель.GLN КАК GLN_Грузоотправитель,
	|	ВТ_Отправитель.Значение КАК GLN_Отправитель,
	|	ВТ_Получатель.Значение КАК GLN_Получатель
	|ПОМЕСТИТЬ ВТ_ДанныеGLN
	|ИЗ
	|	ВТ_Якорь КАК Я
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Грузоотправитель КАК ВТ_Грузоотправитель
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Грузополучатель КАК ВТ_Грузополучатель
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Отправитель КАК ВТ_Отправитель
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Получатель КАК ВТ_Получатель
	|		ПО (ИСТИНА)";
	
	СторонаПолучатель		= СтороныКонтура.Получатель;
	СторонаОтправитель		= СтороныКонтура.Отправитель;
	СторонаГрузополучатель	= СтороныКонтура.Грузополучатель;
	СторонаГрузоотправитель	= СтороныКонтура.Грузоотправитель;
	
	Запрос.УстановитьПараметр("Партнер",			?(ЗначениеЗаполнено(ПартнерКонтура), ПартнерКонтура, Ложь));
	Запрос.УстановитьПараметр("Получатель",			?(ЗначениеЗаполнено(СторонаПолучатель), СторонаПолучатель, Ложь));
	Запрос.УстановитьПараметр("Отправитель",		?(ЗначениеЗаполнено(СторонаОтправитель), СторонаОтправитель, Ложь));
	Запрос.УстановитьПараметр("Грузополучатель",	?(ЗначениеЗаполнено(СторонаГрузополучатель), СторонаГрузополучатель, Ложь));
	Запрос.УстановитьПараметр("Грузоотправитель",	?(ЗначениеЗаполнено(СторонаГрузоотправитель), СторонаГрузоотправитель, Ложь));
	
	РезультатЗапроса = Запрос.Выполнить();
		
КонецПроцедуры


