
//DynamicDirective

Функция яПараметрSABY_Пользовательские(ИсточникПроверкиПараметра, КлючПараметра, ДопПараметры)
	Перем ЗначениеПараметраСбис;
	
	КлючТест = НРег(КлючПараметра);
	
	Если КлючТест = "идентификаторподключения" Тогда
		
		КлючиНастроек			= КэшСБИС_Получить(ИсточникПроверкиПараметра.СБИС, "КлючиКоннекшеновПользователя");
		СохраненныеПараметры	= ПараметрSABY("СохраненныеИдентификаторыПодключений", "Технический");

		Для Каждого КлючНастроек Из	КлючиНастроек Цикл
			ЗначениеИдентификатора = СохраненныеПараметры.НайтиПоЗначению(КлючНастроек);
			Прервать; // Берется первое значени из списка, устаревшие свойства не проверяются.
		КонецЦикла;
		
		Если ЗначениеИдентификатора = Неопределено Тогда
			
			// TODO26.6100 Удалить чтение из старого параметра, вместе с самим параметром 
			ИдентификаторыНастроекСтарые = ПараметрSABY("ИдентификаторыНастроекВСБИС");
			Для Каждого КлючНастроек Из	КлючиНастроек Цикл
				ЗначениеИдентификатора = СохраненныеПараметры.НайтиПоЗначению(КлючНастроек);
				Если Не ЗначениеИдентификатора = Неопределено Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;

			Если ЗначениеИдентификатора = Неопределено Тогда
				
				ЗначениеПараметраСбис = "";
				
			КонецЕсли;
			
		Иначе
			
			ЗначениеПараметраСбис = ЗначениеИдентификатора.Представление;
			
		КонецЕсли;
		
		
	Иначе
		
		ИсточникПроверкиПараметра.Парам.Свойство(КлючПараметра, ЗначениеПараметраСбис);	
		
	КонецЕсли;	
	
	Возврат ЗначениеПараметраСбис;
	
КонецФункции

//DynamicDirective

Функция яПараметрSABY_Технические(ИсточникПроверкиПараметра, КлючПараметра, ДопПараметры)
	Перем ЗначениеПараметраСбис;

	ИсточникПроверкиПараметра = ИсточникПроверкиПараметра.Парам.ТехническиеПараметры;
	ИсточникПроверкиПараметра.Свойство(КлючПараметра, ЗначениеПараметраСбис);
	
	КлючТест = НРег(КлючПараметра);

	Если КлючТест = "сохраненныеидентификаторыподключений" Тогда
		
		Если ЗначениеПараметраСбис = Неопределено Тогда
			
            ЗначениеПараметраСбис = Новый СписокЗначений;
			МодульОбъектаКлиентСервер().ИзменитьПараметрSABY(КлючПараметра, ЗначениеПараметраСбис, "Технический");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЗначениеПараметраСбис;

КонецФункции

//DynamicDirective
Функция яПараметрSABY_Настройки(ИсточникПроверкиПараметра, КлючПараметра, ДопПараметры)
	Перем ЗначениеПараметраСбис;

	ИсточникПроверкиПараметра = ИсточникПроверкиПараметра.КэшНастроек;
	ИсточникПроверкиПараметра.Свойство(КлючПараметра, ЗначениеПараметраСбис);	
	
	Возврат ЗначениеПараметраСбис;

КонецФункции

