
&НаКлиенте
Функция яЧтениеИниПоДанным1С_СоответствиеДанных(ЧтениеИниПоДанным1С)
	
	СоответствиеДокументДанные = Новый Соответствие;
	
	ФорматныеФайлы		= ЧтениеИниПоДанным1С_Получить(ЧтениеИниПоДанным1С, "СписокОбъектовЧтения");
	ПодготовленРасчет	= ЧтениеИниПоДанным1С_Получить(ЧтениеИниПоДанным1С, "ПодготовленРасчет"); 
	ФормаНастройки		= ПараметрSABY("МодульУправленияНастройками", "Сеанс");
	
	Для Каждого Элемент Из ФорматныеФайлы Цикл		
		
		Документ				= Элемент.Значение;
		ИниДокумента			= Элемент.Представление;
		ЗначениеИниДокумента	= ПодготовленРасчет.Получить(Документ);
		
		Если ЗначениеИниДокумента = Неопределено Тогда
			
			ИниДокумента			= Элемент.Представление;
			ЗначениеИниДокумента	= ИниПоПараметрам(ИниДокумента);
			
			Если ЗначениеИниДокумента = Неопределено Тогда
				
				ОшибкаЧтениеПакета = NewExtException(, "МодульОбъектаКлиент.ЧтениеИниПоДанным1С.СоответствиеДанных", 747,,
						"Отсутствует ини файл: " + ИниДокумента,
						Новый Структура("Ини", ИниДокумента));
				ВызватьИсключение ExtException_Dump(ОшибкаЧтениеПакета);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ФормаНастройки.Ини_ЗаполнитьПараметрыПередРасчетом(ЗначениеИниДокумента);

		ИдентификаторДокумента = СбисИдентификаторДокумента1С(Документ, ИниДокумента);
		
		СоответствиеДокументДанные.Вставить(ИдентификаторДокумента, Новый Структура("ИмяИни, ДокументДанные",ИниДокумента, ЗначениеИниДокумента));
		
	КонецЦикла;
	
	Возврат СоответствиеДокументДанные;
	
КонецФункции

