
// Процедура - Обработка ТЧ документа
//
// Параметры:
//  ПараметрыОбработкиВходящие	- Структура	 - Таблица, Ключи. Очистить
//  Кэш				 			- Структура	 - ЛокальныйКэш
//
&НаКлиенте
Процедура ОбработатьТабличнуюЧастьДокумента(ПараметрыОбработкиВходящие, Кэш) Экспорт
	Перем ЗначениеПоиска;
	Для Каждого СтрокаТЧ Из ПараметрыОбработкиВходящие.Таблица Цикл
		СтрокаПодходит = Истина;
		Для Каждого КлючИЗначениеПоиска Из ПараметрыОбработкиВходящие.Ключи Цикл
			Если	Не СтрокаТЧ.Свойство(КлючИЗначениеПоиска.Ключ, ЗначениеПоиска)
				Или	(Не ЗначениеПоиска = КлючИЗначениеПоиска.Значение
					И	ЗначениеЗаполнено(КлючИЗначениеПоиска.Значение)
					И	ЗначениеЗаполнено(ЗначениеПоиска)) Тогда
				СтрокаПодходит = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не СтрокаПодходит Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючОчистить Из ПараметрыОбработкиВходящие.Очистить Цикл
			СтрокаТЧ.Вставить(КлючОчистить);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

