
// Процедура - Обработка ТЧ документа
//
// Параметры:
//  ПараметрыОбработкиВходящие	- Структура	 - Таблица, Ключи. Очистить
//  Кэш				 			- Структура	 - ЛокальныйКэш
//
&НаКлиенте
Процедура ОбработатьТабличнуюЧастьДокумента(ПараметрыОбработкиВходящие, Кэш) Экспорт
	Перем ЗначениеПоиска;
	
	Для Каждого СтрокаТЧ Из ПараметрыОбработкиВходящие.Таблица Цикл
		СтрокаПодходит = Истина;
		Для Каждого КлючИЗначениеПоиска Из ПараметрыОбработкиВходящие.Ключи Цикл
			Если	Не СтрокаТЧ.Свойство(КлючИЗначениеПоиска.Ключ, ЗначениеПоиска)
					И ЗначениеЗаполнено(КлючИЗначениеПоиска.Значение)
				Или	Не ЗначениеПоиска = КлючИЗначениеПоиска.Значение
					И	(ЗначениеЗаполнено(КлючИЗначениеПоиска.Значение)
					ИЛИ	ЗначениеЗаполнено(ЗначениеПоиска)) Тогда
				СтрокаПодходит = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не СтрокаПодходит Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючИзменить Из ПараметрыОбработкиВходящие.Изменить Цикл
			СтрокаТЧ.Вставить(КлючИзменить.Ключ, КлючИзменить.Значение);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

