
// Процедура - Обработка ТЧ документа
//
// Параметры:
//  ПараметрыОбработкиВходящие	- Структура	 - Таблица, Ключи. Очистить
//  Кэш				 			- Структура	 - ЛокальныйКэш
//
&НаКлиенте
Процедура ОбработатьТабличнуюЧастьДокумента(ПараметрыОбработкиВходящие, Кэш) Экспорт
	Перем ЗначениеПоиска;
	
	Для Каждого СтрокаТЧ Из ПараметрыОбработкиВходящие.Таблица Цикл
		СтрокаПодходит = Истина;
		Для Каждого КлючИЗначениеПоиска Из ПараметрыОбработкиВходящие.Ключи Цикл
			Если	Не СтрокаТЧ.Свойство(КлючИЗначениеПоиска.Ключ, ЗначениеПоиска)
					И ЗначениеЗаполнено(КлючИЗначениеПоиска.Значение)
				Или	Не ЗначениеПоиска = КлючИЗначениеПоиска.Значение
					И	(ЗначениеЗаполнено(КлючИЗначениеПоиска.Значение)
					ИЛИ	ЗначениеЗаполнено(ЗначениеПоиска)) Тогда
				СтрокаПодходит = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не СтрокаПодходит Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючИзменить Из ПараметрыОбработкиВходящие.Изменить Цикл
			СтрокаТЧ.Вставить(КлючИзменить.Ключ, КлючИзменить.Значение);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьВложенияСБИС(ВложениеСБИС, ДобавляемоеВложение, ДопПараметры) Экспорт
	
	ТабличнаяЧастьОриг = МодульОбъектаКлиент().ВложениеСБИС_Выгрузить(ВложениеСБИС, "ТабличнаяЧасть", ДопПараметры);
	ТабличнаяЧастьДобавляемая = МодульОбъектаКлиент().ВложениеСБИС_Выгрузить(ДобавляемоеВложение, "ТабличнаяЧасть", ДопПараметры);
	Попытка
		ОбъединитьТабличныеЧасти(ТабличнаяЧастьОриг, ТабличнаяЧастьДобавляемая, ДопПараметры);
	Исключение
		Ошибка = ОписаниеОшибки();
		СбисИсключение = МодульОбъектаКлиент().НовыйСбисИсключение(Ошибка, "Файл_Шаблон.ОбъединитьТабличныеЧасти");
		ДопПараметры.Вставить("Ошибка", СбисИсключение);
	КонецПопытки;
	
	ДопПараметры.Вставить("ПолучитьИтоги", Истина);
	ИтогиОриг = МодульОбъектаКлиент().ВложениеСБИС_Выгрузить(ВложениеСБИС, "ТабличнаяЧасть", ДопПараметры);
	ИтогиДобавляемые = МодульОбъектаКлиент().ВложениеСБИС_Выгрузить(ДобавляемоеВложение, "ТабличнаяЧасть", ДопПараметры);
	
	Попытка
		ОбъединитьИтоги(ИтогиОриг, ИтогиДобавляемые, ДопПараметры);
	Исключение
		Ошибка = ОписаниеОшибки();
		СбисИсключение = МодульОбъектаКлиент().НовыйСбисИсключение(Ошибка, "Файл_Шаблон.ОбъединитьИтоги");
		ДопПараметры.Вставить("Ошибка", СбисИсключение);
	КонецПопытки;
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьТабличныеЧасти(ТабличнаяЧастьОриг, ТабличнаяЧастьДобавляемая, ДопПараметры); 
	
	Для Каждого Строка Из ТабличнаяЧастьДобавляемая Цикл
		Строка.ПорНомер = Строка(ТабличнаяЧастьОриг.Количество() + 1);
		ТабличнаяЧастьОриг.Добавить(Строка);
	КонецЦикла;
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьИтоги(ИтогиОриг, ИтогиДобавляемые, ДопПараметры);
	
	СтрокаИтоговОриг = ИтогиОриг[0];
	СтрокаИтоговДобавляемая = ИтогиДобавляемые[0];
	
	ДопПараметрыПриведения = Новый Структура("ТипПриведенияРасширенный", "Число");
	
	СтрокаИтоговОриг.Кол_Во = Число(СтрокаИтоговОриг.Кол_Во) + Число(СтрокаИтоговДобавляемая.Кол_во);
	СтрокаИтоговОриг.Кол_Во = МодульОбъектаКлиент().ПривестиТипСбис(СтрокаИтоговОриг.Кол_Во, "Количество", ДопПараметрыПриведения);
	
	СтрокаИтоговОриг.Сумма = Число(СтрокаИтоговОриг.Сумма) + Число(СтрокаИтоговДобавляемая.Сумма);
	СтрокаИтоговОриг.Сумма = МодульОбъектаКлиент().ПривестиТипСбис(СтрокаИтоговОриг.Сумма, "Сумма", ДопПараметрыПриведения); 
	
	СтрокаИтоговОриг.СуммаБезНал = Число(СтрокаИтоговОриг.СуммаБезНал) + Число(СтрокаИтоговДобавляемая.СуммаБезНал);
	СтрокаИтоговОриг.СуммаБезНал = МодульОбъектаКлиент().ПривестиТипСбис(СтрокаИтоговОриг.СуммаБезНал, "Сумма", ДопПараметрыПриведения);

	
	Если НЕ СтрокаИтоговОриг.Свойство("НДС") 
		 ИЛИ НЕ СтрокаИтоговДобавляемая.Свойство("НДС") Тогда
		 Возврат;
	КонецЕсли;
	 
	СтрокаИтоговОриг.НДС.Сумма = Число(СтрокаИтоговОриг.НДС.Сумма) + Число(СтрокаИтоговДобавляемая.НДС.Сумма);
	СтрокаИтоговОриг.НДС.Сумма = МодульОбъектаКлиент().ПривестиТипСбис(СтрокаИтоговОриг.НДС.Сумма, "Сумма", ДопПараметрыПриведения);
			
	Возврат;
	
КонецПроцедуры 

