
//Функция формирует структуру табличной части файла	
&НаКлиенте
Функция ПолучитьТабличнуюЧастьДокумента1С(Кэш,Контекст) Экспорт
	
	Перем СбисНДСИсчисляетсяАгентом, ВложениеТипДляФункций;
	
	МодульФункций = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	
	Валютныйформат = "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00";
	ОписаниеЧисла = Новый ОписаниеТипов("Число");

	СуммаВключаетНДС = Кэш.ОбщиеФункции.РассчитатьЗначение("СуммаВключаетНДС", Контекст.ФайлДанные,Кэш);
	КодыМаркировки = Кэш.ОбщиеФункции.РассчитатьЗначение("КодыМаркировки", Контекст.ФайлДанные,Кэш);
	ПредКодыМаркировки = Кэш.ОбщиеФункции.РассчитатьЗначение("ПредКодыМаркировки", Контекст.ФайлДанные,Кэш);
	Если Не Контекст.Свойство("НДСИсчисляетсяАгентом", СбисНДСИсчисляетсяАгентом) Тогда
		СбисНДСИсчисляетсяАгентом = Кэш.ОбщиеФункции.РассчитатьЗначение("НДСИсчисляетсяАгентом", Контекст.ФайлДанные) = Истина;
	КонецЕсли;
	УказанТипНоменклатуры = Ложь;
	КолТоваров = 0;
	// проверяем надо ли пересчитывать суммы в валюту учета
	Валюта = Кэш.ОбщиеФункции.РассчитатьЗначение("Валюта", Контекст.ФайлДанные,Кэш);
	ВалютаУчета = Кэш.ОбщиеФункции.РассчитатьЗначение("ВалютаУчета", Контекст.ФайлДанные,Кэш);
	Если ЗначениеЗаполнено(Валюта) И ЗначениеЗаполнено(ВалютаУчета) И Валюта <> ВалютаУчета Тогда
		ПересчитатьВВалютеУчета = Кэш.ОбщиеФункции.РассчитатьЗначение("ПересчитатьВВалютеУчета", Контекст.ФайлДанные, Кэш);
	Иначе
		ПересчитатьВВалютеУчета = Ложь;
	КонецЕсли;
	Если ПересчитатьВВалютеУчета = Истина Тогда
		ИтогСумма = Кэш.ОбщиеФункции.РассчитатьЗначение("ИтогСумма", Контекст.ФайлДанные,Кэш);
		СуммаДляПересчетаВключаетНДС = Кэш.ОбщиеФункции.РассчитатьЗначение("СуммаДляПересчетаВключаетНДС", Контекст.ФайлДанные,Кэш);	
		Если Не ЗначениеЗаполнено(СуммаДляПересчетаВключаетНДС) Тогда
			СуммаДляПересчетаВключаетНДС = СуммаВключаетНДС;
		КонецЕсли;
		КурсВзаиморасчетов = Кэш.ОбщиеФункции.РассчитатьЗначение("КурсВзаиморасчетов", Контекст.ФайлДанные,Кэш);
		КратностьВзаиморасчетов = Кэш.ОбщиеФункции.РассчитатьЗначение("КратностьВзаиморасчетов", Контекст.ФайлДанные,Кэш);
		Если Контекст.ФайлДанные.Свойство("Валюта_КодОКВ") И Контекст.ФайлДанные.Свойство("ВалютаУчета_КодОКВ") Тогда
			Контекст.ФайлДанные.Валюта_КодОКВ = Контекст.ФайлДанные.ВалютаУчета_КодОКВ;
		КонецЕсли;
		Если Контекст.ФайлДанные.Свойство("Валюта_Название") И Контекст.ФайлДанные.Свойство("ВалютаУчета_Название") Тогда
			Контекст.ФайлДанные.Валюта_Название = Контекст.ФайлДанные.ВалютаУчета_Название;
		КонецЕсли;
	КонецЕсли;
	
	ЦенаВключаетНДС = Кэш.ОбщиеФункции.РассчитатьЗначение("ЦенаВключаетНДС", Контекст.ФайлДанные, Кэш);
	Если Не ЗначениеЗаполнено(ЦенаВключаетНДС) Тогда
		ЦенаВключаетНДС = СуммаВключаетНДС;
	КонецЕсли;
	
	ВозможныеТипыСБИС 	= МодульОбъектаКлиент().ПрименяетсяЭлемент_КолВедМарк();
	КлючПоискаТипа 		= НРЕГ(МодульФункций.РассчитатьЗначение("Вложение_Тип", Контекст.ФайлДанные, Кэш));
	НовыйФорматУПД 		= НЕ ВозможныеТипыСБИС.Найти(КлючПоискаТипа) = Неопределено;  
	
	ИмяФормыПоФормату = "Файл_" + Контекст.ФайлДанные.Файл_Формат + "_" + СтрЗаменить(СтрЗаменить(Контекст.ФайлДанные.Файл_ВерсияФормата, ".", "_"), " ", "");
				
	МассивМодулей = Новый Массив;
			
	Если Контекст.ФайлДанные.Свойство("Вложение_ТипДляФункций", ВложениеТипДляФункций) Тогда
	
		ИмяФормыДляФункций = "Файл_" + ВложениеТипДляФункций + "_" + СтрЗаменить(СтрЗаменить(Контекст.ФайлДанные.Файл_ВерсияФормата, ".", "_"), " ", "");
		МассивМодулей.Добавить(ИмяФормыДляФункций);

	КонецЕсли; 
	
	МассивМодулей.Добавить(ИмяФормыПоФормату);
	МассивМодулей.Добавить("Файл_Шаблон");
	
	МодульДанныхСтроки	= МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ПолучитьТабличнуюЧастьДокумента1С_НовоеСопоставлениеНоменклатуры", МассивМодулей); 
	МодульФункцийСтроки = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("сбисПослеФормированияСтроки", МассивМодулей);
	
	сч = 1;
	Для Каждого Параметр Из Контекст.ФайлДанные.мТаблДок Цикл
		// Чтобы одна и та же табличная часть не попадала 2 раза в документ (в СФ, если по документу-основанию формируются дополнительные файлы)
		Если Контекст.Свойство("СписокТЧ") Тогда  
			Если Контекст.СписокТЧ.НайтиПоЗначению(Параметр.Ключ)<>Неопределено Тогда
				Продолжить;
			Иначе
				Контекст.СписокТЧ.Добавить(Параметр.Ключ);
			КонецЕсли;
		КонецЕсли;		
		
		Если ТипЗнч(Параметр.Значение) = Тип("Массив") Тогда    // стандартная табличная часть
			ТабЧастьДокумента = Параметр.Значение;
		ИначеЕсли ТипЗнч(Параметр.Значение) = Тип("Структура") и Лев(Параметр.Значение.ТаблДок,1)<>"{" Тогда  // табличная часть из одной строки, которая заполняется прямо из реквизитов документа
			ТабЧастьДокумента = Новый Массив;
			ТабЧастьДокумента.Добавить(Параметр.Значение);
		Иначе   // табличная часть вычисляется с помощью функции
			Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Контекст.ФайлДанные, Параметр.Значение);
			ТабЧастьДокумента = Кэш.ОбщиеФункции.РассчитатьЗначение("ТаблДок", Контекст.ФайлДанные, Кэш);
		КонецЕсли;
		
		Если ТипЗнч(ТабЧастьДокумента) = Тип("Массив") Тогда
			Для Каждого Стр Из ТабЧастьДокумента Цикл
				//Если Кэш.Парам.ОтправлятьНоменклатуруСДокументами = Истина и Кэш.Ини.Свойство("Номенклатура") Тогда
				//	Номенклатура = Кэш.ОбщиеФункции.РассчитатьЗначение("Номенклатура", Стр, Кэш);
				//	Если Кэш.СписокНоменклатуры.НайтиПоЗначению(Номенклатура) = Неопределено Тогда
				//		Кэш.СписокНоменклатуры.Добавить(Номенклатура);
				//	КонецЕсли;
				//КонецЕсли;
				ДобавлятьСтроку = ?(Стр.Свойство("ДобавлятьСтроку"),Стр.ДобавлятьСтроку,Истина);
				Стр.Вставить("РеквизитСопоставленияНоменклатуры", Кэш.Парам.РеквизитСопоставленияНоменклатуры);
				Стр.Вставить("СуммаВключаетНДС",СуммаВключаетНДС);
				Стр.Вставить("КодыМаркировки", КодыМаркировки);
				Стр.Вставить("ПредКодыМаркировки", ПредКодыМаркировки);
				НоваяСтрока = Новый Структура;
				Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"ТаблДок",Стр,НоваяСтрока);
				НоваяСтрока.Вставить("ПорНомер",Формат(сч, "ЧГ=0")); 
				СуммаНДС = Кэш.ОбщиеФункции.РассчитатьЗначение("СуммаНДС", Стр, Кэш);
				Попытка
					СуммаНДС = Число(СуммаНДС);
				Исключение
					СуммаНДС = 0;
				КонецПопытки;

				Если НоваяСтрока.Свойство("Сумма")
					И СуммаВключаетНДС <> Неопределено Тогда
					
					НоваяСтрока.Сумма = ОписаниеЧисла.ПривестиЗначение(НоваяСтрока.Сумма);
					
					// VAAl Авансы
					Если НЕ Контекст.ФайлДанные.Свойство("мПараметр")
						ИЛИ НЕ Контекст.ФайлДанные.мПараметр.Свойство("ОбстФормСЧФ")
						ИЛИ Контекст.ФайлДанные.мПараметр.ОбстФормСЧФ.Параметр_Значение <> "2" Тогда
						НоваяСтрока.Вставить("СуммаБезНал", Формат(НоваяСтрока.Сумма - ?(СуммаВключаетНДС, СуммаНДС, 0), Валютныйформат));
					КонецЕсли;
					
					// d.ch 20.02.19 Для налоговой ставки "НДС исчисляется налоговым агентом" обнуляем сумму с учетом НДС
					Если СбисНДСИсчисляетсяАгентом Тогда
						НоваяСтрока.Сумма = 0;
					Иначе
						НоваяСтрока.Сумма = ОписаниеЧисла.ПривестиЗначение(НоваяСтрока.Сумма) + ?(СуммаВключаетНДС, 0, СуммаНДС);
					КонецЕсли;
					
					НоваяСтрока.Сумма = Формат(НоваяСтрока.Сумма, Валютныйформат);
					
				КонецЕсли;
				Если Стр.Свойство("СуммаАкциз") и ЗначениеЗаполнено(Стр.СуммаАкциз) Тогда
					НоваяСтрока.Вставить("Акциз",Новый Структура);
					НоваяСтрока.Акциз.Вставить("Сумма", Кэш.ОбщиеФункции.РассчитатьЗначение("СуммаАкциз", Стр, Кэш));	
				КонецЕсли;
				Если Стр.Свойство("СуммаНДС") Тогда
					НоваяСтрока.Вставить("НДС",Новый Структура);
					фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ЗначениеИТипСтавки","РаботаСДокументами1С","",Кэш);
					СтрСтавка = фрм.ЗначениеИТипСтавки(Стр.СтавкаНДС);
					НоваяСтрока.НДС.Вставить( "Сумма", Формат(СуммаНДС, Валютныйформат));	
					НоваяСтрока.НДС.Вставить( "Ставка", СтрСтавка.Ставка);	
					НоваяСтрока.НДС.Вставить( "ТипСтавки", СтрСтавка.ТипСтавки);	
				КонецЕсли;
				
				Если Стр.Свойство("мПараметр") Тогда
					НоваяСтрока.Вставить("Параметр", Новый Массив);
					Для Каждого Элемент Из Стр.мПараметр Цикл
						Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Стр,Элемент.Значение);
						Параметр = Новый Структура();
						Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш, "Параметр", Стр, Параметр);
						НоваяСтрока.Параметр.Добавить(Параметр);
					КонецЦикла;
				КонецЕсли;
				
				Если Стр.Свойство("НомСредИдентТов") Тогда
					НомСредИдентТов = Кэш.ОбщиеФункции.РассчитатьЗначение("НомСредИдентТов", Стр, Кэш); 
					КодыМаркировки = Стр.КодыМаркировки; 
					НоваяСтрока.Вставить("НомСредИдентТов", НомСредИдентТов);
				КонецЕсли; 
				
				Если Стр.Свойство("GTINМарк")
					И ЗначениеЗаполнено(Стр.GTINМарк)
					И НовыйФорматУПД Тогда
					НоваяСтрока.Вставить("GTIN", Стр.GTINМарк);
				КонецЕсли;
				
				Если	Стр.Свойство("мСведПрослеж")
					И	Стр.мСведПрослеж.Свойство("СведПрослежРасчет") Тогда
					КонтекстРасчета = Кэш.ОбщиеФункции.СкопироватьОбъектСПараметрамиКлиент(Стр.мСведПрослеж.СведПрослежРасчет,, Ложь);
					КонтекстРасчета.Вставить("мСведПрослеж", Стр.мСведПрослеж);
					Стр.мСведПрослеж = Новый Структура("СведПрослеж", Кэш.ОбщиеФункции.РассчитатьЗначение("СведПрослеж", КонтекстРасчета, Кэш));
				КонецЕсли;				
				
				// KES МОТП ИСМП-->
				// перебрать все свойства строки и найти сложные узлы
				мСложныеУзлы = Новый Массив;
				Для Каждого Элемент Из Стр Цикл
					Если ТипЗнч(Элемент.Значение) = Тип("Структура")
						И	Не (	Элемент.Ключ = "мПараметр"
								Или	Элемент.Ключ = "ПредСтрТабл_СведПрослеж") Тогда
						ОбработатьСложныйУзел(Элемент.Значение, Стр, НоваяСтрока, Кэш);
					КонецЕсли;
				КонецЦикла;
				//<--KES МОТП ИСМП
				
				Если Стр.Свойство("ПредСтрТабл") Тогда
					Если сч = 1 Тогда  
						Контекст.Вставить("ЕстьПредыдущиеДанные", Истина);
					КонецЕсли;
					//В строку должны быть заполнены все простые узлы заранее (которые добавляются кодом), чтобы при заполнении они выгружались в случае наличия составных узлов в ини
					ПредыдущиеДанные = Новый Структура("СуммаБезНал");
					
					Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"ПредСтрТабл",Стр,ПредыдущиеДанные);
					СуммаНДСДо = Кэш.ОбщиеФункции.РассчитатьЗначение("СуммаНДСДо", Стр, Кэш);
					СуммаНДСДо = Число(СуммаНДСДо);
					ПредыдущиеДанные.СуммаБезНал = формат(Число(ПредыдущиеДанные.Сумма) - ?(СуммаВключаетНДС, СуммаНДСДо, 0), Валютныйформат);
					Если СбисНДСИсчисляетсяАгентом Тогда
						ПредыдущиеДанные.Сумма = "0.00";
					Иначе 
						ПредыдущиеДанные.Сумма = формат(Число(ПредыдущиеДанные.Сумма) + ?(СуммаВключаетНДС, 0, СуммаНДСДо), Валютныйформат);
					КонецЕсли;
					Если Стр.Свойство("СуммаАкцизДо") И ЗначениеЗаполнено(Стр.СуммаАкцизДо) Тогда
						ПредыдущиеДанные.Вставить("Акциз", Новый Структура);
						ПредыдущиеДанные.Акциз.Вставить( "Сумма", Стр.СуммаАкцизДо);	
					КонецЕсли;
					ПредыдущиеДанные.Вставить("НДС",Новый Структура);
					фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ЗначениеИТипСтавки", "РаботаСДокументами1С", "", Кэш);
					СтрСтавка = фрм.ЗначениеИТипСтавки(Стр.СтавкаНДСДо);
					ПредыдущиеДанные.НДС.Вставить( "Сумма", формат(СуммаНДСДо, Валютныйформат));	
					ПредыдущиеДанные.НДС.Вставить( "Ставка", СтрСтавка.Ставка);	
					ПредыдущиеДанные.НДС.Вставить( "ТипСтавки", СтрСтавка.ТипСтавки);
					
					Если Стр.Свойство("ПредНомСредИдентТов") Тогда
						ПредНомСредИдентТов = Кэш.ОбщиеФункции.РассчитатьЗначение("ПредНомСредИдентТов", Стр, Кэш);
						ПредыдущиеДанные.Вставить("НомСредИдентТов", ПредНомСредИдентТов);
					КонецЕсли;
					
					НоваяСтрока.Вставить("ПредСтрТабл",ПредыдущиеДанные);
					Контекст.ПредИтогСумма       	= Контекст.ПредИтогСумма + ПредыдущиеДанные.Сумма;
					Контекст.ПредИтогСуммаБезНалога = Контекст.ПредИтогСуммаБезНалога + ПредыдущиеДанные.СуммаБезНал;
					Контекст.ПредИтогСуммаНДС    	= Контекст.ПредИтогСуммаНДС + СуммаНДСДо;
				КонецЕсли;				
				
				Если Стр.Свойство("Расхождения") Тогда
					НоваяСтрока.Вставить("Расхождения", Новый Массив);
					Для Каждого Элемент Из Стр.Расхождения Цикл
						Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Стр,Элемент);
						Расхождение = Новый Структура();
						Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Расхождения",Стр,Расхождение);
						НоваяСтрока.Расхождения.Добавить(Расхождение);
					КонецЦикла;	
				КонецЕсли;
				
				// при необходимости пересчитываем в валюту учета
				Если ПересчитатьВВалютеУчета = Истина Тогда
					Если НЕ ЗначениеЗаполнено(ИтогСумма) Тогда   // есть готовые суммы по каждой строке и не надо распределять общую сумму по строкам
						CуммаДляПересчета = Кэш.ОбщиеФункции.РассчитатьЗначение("CуммаДляПересчета", Стр, Кэш); 
						CуммаНДСДляПересчета = Кэш.ОбщиеФункции.РассчитатьЗначение("CуммаНДСДляПересчета", Стр, Кэш); 
						Попытка
							СуммаВВалютеУчета = CуммаДляПересчета*КурсВзаиморасчетов/?(КратностьВзаиморасчетов=0,1,КратностьВзаиморасчетов);
							СуммаНДСВВалютеУчета = CуммаНДСДляПересчета*КурсВзаиморасчетов/?(КратностьВзаиморасчетов=0,1,КратностьВзаиморасчетов);
							СуммаНДС = СуммаНДСВВалютеУчета;
							НоваяСтрока.СуммаБезНал = формат(СуммаВВалютеУчета - ?(СуммаДляПересчетаВключаетНДС, СуммаНДСВВалютеУчета, 0), Валютныйформат);
							Если Не СбисНДСИсчисляетсяАгентом Тогда
								НоваяСтрока.Сумма = формат(Число(СуммаВВалютеУчета) + ?(СуммаДляПересчетаВключаетНДС, 0, СуммаНДСВВалютеУчета), Валютныйформат);
								НоваяСтрока.НДС.Сумма = формат(СуммаНДСВВалютеУчета, Валютныйформат);
							КонецЕсли;
							Если НЕ (НоваяСтрока.Свойство("Цена") И Число(НоваяСтрока.Цена) = 0) Тогда
								НоваяСтрока.Вставить("Цена", формат(Число(НоваяСтрока.СуммаБезНал)/?(Число(НоваяСтрока.Кол_во)=0,1,Число(НоваяСтрока.Кол_во)), Валютныйформат));
							КонецЕсли;
							Если НоваяСтрока.Свойство("Параметр") Тогда
								Для каждого мПараметр Из НоваяСтрока.Параметр Цикл
									Если мПараметр.Имя = "Цена1С" Тогда
										мПараметр.Значение = формат(Число(?(ЦенаВключаетНДС, НоваяСтрока.Сумма, НоваяСтрока.СуммаБезНал))/?(Число(НоваяСтрока.Кол_во)=0,1,Число(НоваяСтрока.Кол_во)), Валютныйформат);	
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
						Исключение
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
				
				СтруктураУпаковка = Новый Структура;
				Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Упаковка",Стр,СтруктураУпаковка);
				Если СтруктураУпаковка.Количество() > 0 Тогда
					НоваяСтрока.Вставить("Упаковка",СтруктураУпаковка);
				КонецЕсли;
				
				СтруктураБрутто = Новый Структура;
				Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Брутто",Стр,СтруктураБрутто);
				Если СтруктураБрутто.Количество() > 0 Тогда
					НоваяСтрока.Вставить("Брутто",СтруктураБрутто);
				КонецЕсли;
				
				СтруктураНетто = Новый Структура;
				Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш,"Нетто",Стр,СтруктураНетто);
				Если СтруктураНетто.Количество() > 0 Тогда
					НоваяСтрока.Вставить("Нетто",СтруктураНетто);
				КонецЕсли;
				
				СтруктураХарактеристика = Новый Структура;
				Кэш.ОбщиеФункции.ЗаполнитьАтрибуты(Кэш, "Характеристика", Стр, СтруктураХарактеристика);
				Если СтруктураХарактеристика.Количество() > 0 Тогда
					НоваяСтрока.Вставить("Характеристика", СтруктураХарактеристика);
				КонецЕсли; 
				
				МодульДанныхСтроки.ПолучитьТабличнуюЧастьДокумента1С_НовоеСопоставлениеНоменклатуры(Контекст, Стр, НоваяСтрока);
				
				Если МодульФункцийСтроки <> Ложь Тогда 
					
					ДобавлятьСтроку = МодульФункцийСтроки.сбисПослеФормированияСтроки(НоваяСтрока, Кэш, Контекст, Стр);	 
					
				КонецЕсли; 
				
				Если ДобавлятьСтроку <> Ложь Тогда      // <>Ложь написано для совместимости со старыми функциями сбисПослеФормированияСтроки, которые могли ничего не возвращать
					
					Попытка
						Контекст.ИтогКоличество     = Контекст.ИтогКоличество + НоваяСтрока.Кол_во;
					Исключение
					КонецПопытки;
					Попытка
					Контекст.ИтогСумма       	= Контекст.ИтогСумма + НоваяСтрока.Сумма;
					Контекст.ИтогСуммаБезНалога = Контекст.ИтогСуммаБезНалога
						+ ?(НоваяСтрока.Свойство("СуммаБезНал"), НоваяСтрока.СуммаБезНал, 0);
					Если НоваяСтрока.Свойство("НДС") Тогда
						Контекст.ИтогСуммаНДС    	= Контекст.ИтогСуммаНДС + НоваяСтрока.НДС.Сумма;
					КонецЕсли;
					Исключение
					КонецПопытки;
					Попытка
						Контекст.ИтогБрутто         = Контекст.ИтогБрутто + ?(НоваяСтрока.Брутто.Свойство("Кол_во"),НоваяСтрока.Брутто.Кол_во, 0);
					Исключение
					КонецПопытки;
					Попытка
						Контекст.ИтогНетто         = Контекст.ИтогНетто + ?(НоваяСтрока.Нетто.Свойство("Кол_во"),НоваяСтрока.Нетто.Кол_во, 0);
					Исключение
					КонецПопытки;
					Попытка
						Контекст.ИтогКолМест 	    = Контекст.ИтогКолМест + ?(НоваяСтрока.Упаковка.Свойство("КолМест"),НоваяСтрока.Упаковка.КолМест, 0);
					Исключение
					КонецПопытки;
					
					Контекст.ТаблДок.СтрТабл.Добавить(НоваяСтрока);
					сч=сч+1;
					Если НоваяСтрока.Свойство("Тип") Тогда
						УказанТипНоменклатуры = Истина;
						Если НоваяСтрока.Тип = "1" Тогда
							КолТоваров = КолТоваров+1;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				// При необходимости проверяем, вся ли номенклатура сопоставлена
				Если Контекст.Свойство("НоменклатураКодКонтрагента") и (Не НоваяСтрока.Свойство(Контекст.НоменклатураКодКонтрагента) или Не ЗначениеЗаполнено(НоваяСтрока[Контекст.НоменклатураКодКонтрагента]))  Тогда
					Контекст.СоставПакета.Вставить("Ошибка","Не вся номенклатура сопоставлена");	
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Если Контекст.ФайлДанные.Свойство("ЗаполнятьГрузотпрГрузполуч") Тогда
		Контекст.Вставить("ЗаполнятьГрузотпрГрузполуч", Контекст.ФайлДанные.ЗаполнятьГрузотпрГрузполуч);
	ИначеЕсли УказанТипНоменклатуры = Ложь или (УказанТипНоменклатуры и КолТоваров>0) Тогда
		Контекст.Вставить("ЗаполнятьГрузотпрГрузполуч", Истина);
	Иначе
		Контекст.Вставить("ЗаполнятьГрузотпрГрузполуч", Ложь);
	КонецЕсли;
	
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("СбисПослеФормированияТабличнойЧасти","Файл_"+Кэш.ОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(Контекст.ФайлДанные.Файл_Формат)+"_"+Кэш.ОбщиеФункции.сбисЗаменитьНедопустимыеСимволы(Контекст.ФайлДанные.Файл_ВерсияФормата),"Файл_Шаблон", Кэш);
	Если Не фрм = Ложь Тогда
		фрм.СбисПослеФормированияТабличнойЧасти(Кэш, Контекст, Новый Структура("ТаблДок, ПересчитатьВВалютеУчета, ИтогСумма", Контекст.ТаблДок, ПересчитатьВВалютеУчета=Истина, ИтогСумма));	
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ПолучитьТабличнуюЧастьДокумента1С_НовоеСопоставлениеНоменклатуры(Контекст, Стр, НоваяСтрока) Экспорт  
	
	Перем СохранятьСсылки;
	
	НеСохранятьСсылки = Контекст.Свойство("СохранятьСсылки", СохранятьСсылки) 
						И НЕ СохранятьСсылки; 
						
	ИскатьВДополнительныхИсточниках = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИскатьВДополнительныхИсточниках");
	
	МодульФункций = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ФункцииДокументов");
	
	ИспользоватьОбратноеСопоставление = МодульФункций.РассчитатьЗначение("ИспользоватьСопоставлениеНоменклатуры", Контекст.ФайлДанные);
	ИспользоватьОбратноеСопоставление = ИспользоватьОбратноеСопоставление = Истина
									И	МодульОбъектаКлиент().ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры_ОбратноеСопоставление")
									И	МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ИспользоватьОбратноеСопоставление");   
									
	Контекст.Вставить("ИспользоватьСопоставлениеНоменклатуры", ИспользоватьОбратноеСопоставление);    
	
	Если НеСохранятьСсылки Тогда
		
		Возврат;
		
	КонецЕсли;
		
	НовоеСопоставлениеНоменклатуры = (МодульОбъектаКлиент().ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры")
		ИЛИ МодульОбъектаКлиент().ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры4100"))
		И МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ИспользоватьНовоеСопоставлениеНоменклатуры")
		И Стр.Свойство("Номенклатура");
		
	Если НовоеСопоставлениеНоменклатуры
			Или ИскатьВДополнительныхИсточниках Тогда
		
		НоваяСтрока.Вставить("Номенклатура", Стр.Номенклатура);
		НоваяСтрока.Вставить("ЕдИзм1С", Стр.ЕдИзм); 
		
		Если Стр.Свойство("Характеристика") Тогда
			НоваяСтрока.Вставить("Характеристика1С", Стр.Характеристика);   	
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция СформироватьНаборСопоставленийНоменклатурыПоТабличнойЧасти(Вложение, Кэш, ДопПараметры = Неопределено) Экспорт
	
	НеИскатьПоДокументу = Истина;
	ИдентификаторДокумента = Неопределено;
	Если НЕ ДопПараметры = Неопределено Тогда
		Если ДопПараметры.Свойство("ИдОснования") Тогда
			ИдентификаторДокумента = ДопПараметры.ИдОснования;
		КонецЕсли;
		Если ДопПараметры.Свойство("НеИскатьПоДокументу") Тогда
			НеИскатьПоДокументу = ДопПараметры.НеИскатьПоДокументу;
		КонецЕсли;
	КонецЕсли;
	
	Если Вложение.Свойство("СтруктураДокумента") Тогда
		КореньДанныхДокумента = Вложение.СтруктураДокумента;
	Иначе
		КореньДанныхДокумента = Вложение.СтруктураФайла;
	КонецЕсли;
	Если КореньДанныхДокумента.Файл.Документ.Свойство("ТаблДок") Тогда		
		ТаблДок = КореньДанныхДокумента.Файл.Документ.ТаблДок.СтрТабл;		
	ИначеЕсли КореньДанныхДокумента.Файл.Документ.Свойство("СписокСтрТабл") Тогда
		ТаблДок = КореньДанныхДокумента.Файл.Документ.СписокСтрТабл.СтрТабл;
	Иначе
		ТаблДок = Неопределено;
		СбисИсключение = МодульОбъектаКлиент().НовыйСбисИсключение(500, "Файл_Шаблон.СформироватьНаборСопоставленийНоменклатурыПоТабличнойЧасти",,,"На вложении не обнаружен табличный документ");
		ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_ВСтроку(СбисИсключение);
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура();
	ДанныеЗаполнения.Вставить("КодПокупателя", "");
	ДанныеЗаполнения.Вставить("Код", "");
	ДанныеЗаполнения.Вставить("Артикул", "");
	ДанныеЗаполнения.Вставить("Название", "");
	ДанныеЗаполнения.Вставить("Идентификатор", "");
	ДанныеЗаполнения.Вставить("Номенклатура");
	ДанныеЗаполнения.Вставить("Характеристика");
	ДанныеЗаполнения.Вставить("GTIN", "");
	ДанныеЗаполнения.Вставить("КодПоставщика", "");
	ДанныеЗаполнения.Вставить("ЕдИзм1С"); 
	ДанныеЗаполнения.Вставить("ЕдИзм");
	ДанныеЗаполнения.Вставить("ОКЕИ", "");
	ДанныеЗаполнения.Вставить("Цена", 0);
	ДанныеЗаполнения.Вставить("Кол_Во", 0);
	ДанныеЗаполнения.Вставить("Сумма", 0);
	ДанныеЗаполнения.Вставить("СуммаБезНал", 0);
	ДанныеЗаполнения.Вставить("СуммаНДС", 0); 
	ДанныеЗаполнения.Вставить("СтавкаНДС", 0);
	ДанныеЗаполнения.Вставить("БазоваяЕдиницаОКЕИ");
	Если ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
		ДанныеЗаполнения.Вставить("ИдентификаторДокумента", ИдентификаторДокумента);
	КонецЕсли;
	
	Если Вложение.Свойство("Параметры")
		И Вложение.Параметры.Свойство("ДокументДляСопоставления") Тогда
		ДокументДляСопоставления = Вложение.Параметры.ДокументДляСопоставления;
	Иначе
		ДокументДляСопоставления = Неопределено;
	КонецЕсли;
	
	СписокНоменклатурДляОбогащения = Новый Массив; 
	
	Для Каждого СтрокаНоменклатуры Из ТаблДок Цикл
		// Заполнение данных для обогащения из файла 
		Если СтрокаНоменклатуры.Свойство("НеЗагружать") Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, СтрокаНоменклатуры);
		
		ДанныеЗаполнения.БазоваяЕдиницаОкеи = СтрокаНоменклатуры.ОКЕИ; 
		Если СтрокаНоменклатуры.НДС.Свойство("Сумма") И СтрокаНоменклатуры.НДС.Свойство("Ставка") Тогда
			ДанныеЗаполнения.СуммаНДС  			= СтрокаНоменклатуры.НДС.Сумма;  
			ДанныеЗаполнения.СтавкаНДС 			= СтрокаНоменклатуры.НДС.Ставка;
		Иначе
			ДанныеЗаполнения.СуммаНДС = 0; 
			ДанныеЗаполнения.СтавкаНДС = "";
		КонецЕсли;
		
		Если СтрокаНоменклатуры.Свойство("ЕдИзм1С") Тогда
			ДанныеЗаполнения.ЕдИзм1С 			= СтрокаНоменклатуры.ЕдИзм1С;
		Иначе
			ДанныеЗаполнения.ЕдИзм1С 			= СтрокаНоменклатуры.ЕдИзм;
		КонецЕсли;
		
		ДопПараметрыЛокальные = Новый Структура("ЗаполнениеНоменклатуры1С", Истина);
		ГолыйКлассНоменклатурыДляСопоставления = МодульОбъектаКлиент().НовыйСтрокаСопоставленияСБИСКлиент(ДанныеЗаполнения, ДопПараметрыЛокальные);
				
		СписокНоменклатурДляОбогащения.Добавить(ГолыйКлассНоменклатурыДляСопоставления); 
		
	КонецЦикла;
	
	ПараметрыДляОбогащения = Новый Структура("Контрагент, Номенклатура"); 
	ИсточникЗапросаСопоставления = МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "СторонаПоРоли", "Получатель");	                                                           
	
	ПараметрыДляОбогащения.Вставить("Контрагент",	ИсточникЗапросаСопоставления);  
	ПараметрыДляОбогащения.Вставить("Номенклатура",	СписокНоменклатурДляОбогащения);
	
	МодульСопоставления = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("МодульСопоставлениеНоменклатуры"); 
	
	ДопПараметрыЛокальные = Новый Структура("Кэш, НеИскатьПоДокументу, ДокументДляСопоставления", Кэш, НеИскатьПоДокументу, ДокументДляСопоставления);
	Попытка
		ОбогащенныеДанныеНоменклатурыДляСопоставления =	МодульСопоставления.НоменклатураПоставщика_МассовыйПоиск(ПараметрыДляОбогащения, ДопПараметрыЛокальные); 
	Исключение          
		ОбогащенныеДанныеНоменклатурыДляСопоставления = СписокНоменклатурДляОбогащения;
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ФормаРаботыСНоменклатурой.НоменклатураПоставщика_МассовыйПоиск");
	КонецПопытки;
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("РежимОтладки") Тогда
		
		ДанныеЛогирования = Новый Структура;
		ДанныеЛогирования.Вставить("Тип", 			"СопоставлениеНоменклатуры");
		ДанныеЛогирования.Вставить("Идентификатор", МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "Название"));
		ДанныеЛогирования.Вставить("Вызов", 		ОбогащенныеДанныеНоменклатурыДляСопоставления);
		ДанныеЛогирования.Вставить("Модуль", 		"Файл_Шаблон");
		
		МодульОбъектаКлиент().СохранитьОтладочныеДанныеСБИС(ДанныеЛогирования);
		
	КонецЕсли;
	
	Возврат ОбогащенныеДанныеНоменклатурыДляСопоставления;
	
КонецФункции

&НаКлиенте
Функция НайтиОснованиеПоТипу(СтруктураДокумента, ТипОснования) Экспорт
	Перем НаборОснованийДокумента;
	
	Если Не СтруктураДокумента.Файл.Документ.Свойство("Основание", НаборОснованийДокумента) Тогда
		
		 Возврат Неопределено;
		
	КонецЕсли;	
	Для Каждого Основание ИЗ НаборОснованийДокумента Цикл
		
		Если	Основание.Свойство("Название") 
			И	Основание.Название = ТипОснования Тогда
			
			Возврат Основание;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

// Функция - Сформировать табличную часть по набору сопоставлений номенклатуры
//
// Параметры:
//  НаборСопоставленийНоменклатуры	 - Структура	 - Содержит 
//	                                 - 
//  ДопПараметры					 - Структура	 - Брать направление и если исходящий, то схлопнуть ТаблДок по номенклатуре СБИС. Схлопнуть Да/Нет
// 
// Возвращаемое значение:
// Массив  - Подготовленные для загрузки/выгрузки строки табличной части документа 1С
//
&НаКлиенте
Функция СформироватьТабличнуюЧастьПоНаборуСопоставленийНоменклатуры(ВходныеДанные, ДопПараметры = Неопределено) Экспорт
	
	// Сделать списочный и точечный методы класса для получения значений свойств
	
	// Инициализация локальных переменных
	ИндексСтрокиНоменклатурыСБИС = 0;  
	РассчитаннаяСтрокаТЧ = Новый Структура; 
	ТаблДокОбработанный = Новый Массив;
	ПорядковыйНомер = 1;
	
	// Входящие параметры
	НаборСопоставлений 	  = ВходныеДанные.НаборСопоставлений;
	ТабличнаяЧастьИзФайла = ВходныеДанные.ТабличнаяЧасть;
	ФайлПерегенерируется  = ДопПараметры.ФайлПерегенерируется;
	ВложениеСБИС 		  = ДопПараметры.ВложениеСБИС;
	
	СЛокПерем = Неопределено;
	Если ВложениеСБИС.Свойство("Направление1С", СЛокПерем) Тогда
		НаправлениеДокумента = СЛокПерем;
	Иначе
		НаправлениеДокумента = ВложениеСБИС.Направление;
	КонецЕсли;
	
	Для Каждого Сопоставление Из НаборСопоставлений Цикл   
		
		КодПокупателя = Сопоставление.НоменклатураСБИС.Код; // Ду-ду КОСТЫЛЬ, пока код не будет храниться на классе номенклатура1С (делает Мышляев)
		Для Каждого СтрокаНоменклатуры1С Из Сопоставление.Номенклатура1С Цикл
			
			Номенклатура1С = СтрокаНоменклатуры1С.Значение;
			Если НЕ ЗначениеЗаполнено(Число(Номенклатура1С.Кол_во))
				И НаправлениеДокумента = "Входящий" Тогда
				Номенклатура1С.Кол_во = 1;
			КонецЕсли;
			
			ЛокальныйКэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
			РассчитаннаяСтрокаТЧ = ЛокальныйКэш.ТекущийСеанс.Модули.ФункцииДокументов.СбисСкопироватьОбъектНаКлиенте(ТабличнаяЧастьИзФайла[ИндексСтрокиНоменклатурыСБИС]);
			РассчитаннаяСтрокаТЧ.Вставить("Номенклатура"); 
			Если Номенклатура1С.Характеристики.Количество() Тогда
				// Принудительно добавляем характеристику, если она есть в сопоставлении
				РассчитаннаяСтрокаТЧ.Вставить("Характеристика");
			КонецЕсли;
			
			Если НЕ РассчитаннаяСтрокаТЧ.Свойство("Кол_Во") Тогда
				РассчитаннаяСтрокаТЧ.Вставить("Кол_Во", 1);
				РассчитаннаяСтрокаТЧ.Вставить("Цена", 0);
				РассчитаннаяСтрокаТЧ.Вставить("Сумма", Сопоставление.НоменклатураСБИС.Сумма);
				РассчитаннаяСтрокаТЧ.Вставить("СуммаБезНал", Сопоставление.НоменклатураСБИС.СуммаБезНал);
				РассчитаннаяСтрокаТЧ.Вставить("НДС", Новый Структура("Ставка, Сумма", Сопоставление.НоменклатураСБИС.СтавкаНДС, Сопоставление.НоменклатураСБИС.СуммаНДС)); 
			КонецЕсли;
			
			СписокСвойствНаЗаполнение = Новый Массив;
			
			Для Каждого Элемент Из РассчитаннаяСтрокаТЧ Цикл
				СписокСвойствНаЗаполнение.Добавить(Элемент.Ключ);
			КонецЦикла;
			
			ИндексУдаляемогоЭлемента = СписокСвойствНаЗаполнение.Найти("ОКЕИ");
			Если НЕ ИндексУдаляемогоЭлемента = Неопределено Тогда
				СписокСвойствНаЗаполнение.Удалить(ИндексУдаляемогоЭлемента);
			КонецЕсли;
			
			ИндексУдаляемогоЭлемента = СписокСвойствНаЗаполнение.Найти("Коэффициент");
			Если НЕ ИндексУдаляемогоЭлемента = Неопределено Тогда
				СписокСвойствНаЗаполнение.Удалить(ИндексУдаляемогоЭлемента);
			КонецЕсли;
			
			ВыгруженнаяНоменклатуры1С = МодульОбъектаКлиент().ОписаниеНоменклатуры1СКлиент_Получить(Номенклатура1С, СписокСвойствНаЗаполнение);
			
			Если ДопПараметры.Свойство("КонтекстДляСопоставления") 
				И ДопПараметры.КонтекстДляСопоставления.Свойство("ПересчетПоДокументуОснованию") Тогда
				
				Если ЗначениеЗаполнено(Сопоставление.НоменклатураСБИС.Наименование) Тогда
					РассчитаннаяСтрокаТЧ.Название = Сопоставление.НоменклатураСБИС.Наименование;
				КонецЕсли;
				
				Для Каждого Единица Из Сопоставление.НоменклатураСБИС.Единицы Цикл
					РассчитаннаяСтрокаТЧ.ЕдИзм = Единица.Значение.Название;
					РассчитаннаяСтрокаТЧ.ОКЕИ = Единица.Значение.ОКЕИ;
					Прервать; 
				КонецЦикла;
				РассчитаннаяСтрокаТЧ.Цена = ВыгруженнаяНоменклатуры1С.Цена;
			КонецЕсли;
			
			РассчитаннаяСтрокаТЧ.Номенклатура = ВыгруженнаяНоменклатуры1С.Номенклатура;
			Если РассчитаннаяСтрокаТЧ.Свойство("СуммаБезНал") 
				И ЗначениеЗаполнено(РассчитаннаяСтрокаТЧ.СуммаБезНал) 
				И НЕ Число(ВыгруженнаяНоменклатуры1С.Кол_во) = 0 Тогда
				ЦенаБезНДС = Формат(Окр(РассчитаннаяСтрокаТЧ.СуммаБезНал / ВыгруженнаяНоменклатуры1С.Кол_во, 2), "ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00");
				РассчитаннаяСтрокаТЧ.Вставить("ЦенаБезНДС", ЦенаБезНДС);
			КонецЕсли;
			
			// Сделать проверку на перегенерацию файла. Положить признак ФайлПерегенерируется на Вложение.Параметры через конструктор Вложения
			Если ВыгруженнаяНоменклатуры1С.Свойство("ЕдИзм1С")  Тогда
				ДанныеЕдиницы = ПолучитьДанныеЕдиницы(ВыгруженнаяНоменклатуры1С.ЕдИзм1С);
			ИначеЕсли ВыгруженнаяНоменклатуры1С.Свойство("ЕдИзм") И НЕ ТипЗнч(ВыгруженнаяНоменклатуры1С.ЕдИзм) = Тип("Строка") Тогда
				ДанныеЕдиницы = ПолучитьДанныеЕдиницы(ВыгруженнаяНоменклатуры1С.ЕдИзм);  
			Иначе
				ДанныеЕдиницы = Неопределено;
			КонецЕсли;
			
			Если НЕ ДанныеЕдиницы = Неопределено 
				И ДопПараметры.Свойство("ПересчетПоДокументуОснованию") 
				И НЕ ДопПараметры.ПересчетПоДокументуОснованию  Тогда
				РассчитаннаяСтрокаТЧ.ОКЕИ = ДанныеЕдиницы.ОКЕИ;
				РассчитаннаяСтрокаТЧ.ЕдИзм = ДанныеЕдиницы.Наименование;
			КонецЕсли;
			
			СписокКлючей = Новый Массив;
			СписокКлючей.Добавить("Код");
			СписокКлючей.Добавить("Параметр");
			СписокКлючей.Добавить("НомСредИдентТов");
			СписокКлючей.Добавить("Акциз");
			СписокКлючей.Добавить("Страна");
			СписокКлючей.Добавить("СтранаНаименование");
			СписокКлючей.Добавить("Упаковка");
			СписокКлючей.Добавить("Описание");
			СписокКлючей.Добавить("СведПрослеж");
			СписокКлючей.Добавить("Характеристика");
			
			КопироватьЗначенияПоСпискуКлючей(РассчитаннаяСтрокаТЧ, ТабличнаяЧастьИзФайла[ИндексСтрокиНоменклатурыСБИС], СписокКлючей);
			
			// Начало временного костыля (с)Сыч
			ЭтоУведомлОтгр = ВложениеСБИС.Тип = "УведомлОтгр";
			ЭтоПодтверждениеЗаказа = ВложениеСБИС.Тип = "ПодтверждениеЗаказа";
			
			СписокКлючейДополнительно = Новый Массив;
			
			Если Сопоставление.НоменклатураСБИС.Свойство("GTIN") И НЕ ЗначениеЗаполнено(Сопоставление.НоменклатураСБИС.GTIN) Тогда
				СписокКлючейДополнительно.Добавить("GTIN");
			ИначеЕсли Сопоставление.НоменклатураСБИС.Свойство("GTIN") 
				И РассчитаннаяСтрокаТЧ.Свойство("GTIN")
				И НЕ ЗначениеЗаполнено(РассчитаннаяСтрокаТЧ.GTIN) Тогда
				РассчитаннаяСтрокаТЧ.Вставить("GTIN", Сопоставление.НоменклатураСБИС.GTIN);
			КонецЕсли;
			
			Если Сопоставление.НоменклатураСБИС.Свойство("КодПокупателя") И НЕ ЗначениеЗаполнено(Сопоставление.НоменклатураСБИС.КодПокупателя) Тогда
				СписокКлючейДополнительно.Добавить("КодПокупателя");
			ИначеЕсли Сопоставление.НоменклатураСБИС.Свойство("КодПокупателя") Тогда
				РассчитаннаяСтрокаТЧ.Вставить("КодПокупателя", Сопоставление.НоменклатураСБИС.КодПокупателя);
			КонецЕсли;
			
			Если Сопоставление.НоменклатураСБИС.Свойство("КодПоставщика") И НЕ ЗначениеЗаполнено(Сопоставление.НоменклатураСБИС.КодПоставщика) Тогда
				СписокКлючейДополнительно.Добавить("КодПоставщика");
			ИначеЕсли Сопоставление.НоменклатураСБИС.Свойство("КодПоставщика") Тогда
				РассчитаннаяСтрокаТЧ.Вставить("КодПоставщика", Сопоставление.НоменклатураСБИС.КодПоставщика);
			КонецЕсли;
			
			КопироватьЗначенияПоСпискуКлючей(РассчитаннаяСтрокаТЧ, ТабличнаяЧастьИзФайла[ИндексСтрокиНоменклатурыСБИС], СписокКлючейДополнительно);
			
			ПараметрыСОнлайна = Неопределено;
			Если Сопоставление.Параметры.Свойство("ПараметрыСтрокиСОнлайна", ПараметрыСОнлайна) Тогда
				Если ПараметрыСОнлайна.Свойство("КодПокупателя") Тогда
					РассчитаннаяСтрокаТЧ.Вставить("КодПокупателя", ПараметрыСОнлайна.КодПокупателя);
				КонецЕсли;
				Если ПараметрыСОнлайна.Свойство("КодПоставщика") Тогда
					РассчитаннаяСтрокаТЧ.Вставить("КодПоставщика", ПараметрыСОнлайна.КодПоставщика);
				КонецЕсли;
			КонецЕсли;
			
			ПараметрыСтр = Неопределено;
			ИскатьПоПараметрам = Истина;
			Если РассчитаннаяСтрокаТЧ.Свойство("Параметр", ПараметрыСтр) Тогда
				ПараметрыСтроки = ПараметрыСтр
			ИначеЕсли РассчитаннаяСтрокаТЧ.Свойство("СписокПараметр", ПараметрыСтр) Тогда
				ПараметрыСтроки = ПараметрыСтр.Параметр;
			Иначе
				ИскатьПоПараметрам = Ложь;
			КонецЕсли;
			
			Если ИскатьПоПараметрам Тогда
				GTINВПараметрах = МодульОбъектаКлиент().НайтиВМассивеСтруктурПоКлючу(ПараметрыСтроки, "GTIN", "Имя");
				КодПокупателяВПараметрах = МодульОбъектаКлиент().НайтиВМассивеСтруктурПоКлючу(ПараметрыСтроки, "КодПокупателя", "Имя");
				КодПоставщикаВПараметрах = МодульОбъектаКлиент().НайтиВМассивеСтруктурПоКлючу(ПараметрыСтроки, "КодПоставщика", "Имя");
				
				Если Сопоставление.НоменклатураСБИС.Свойство("GTIN") 
					И ЗначениеЗаполнено(Сопоставление.НоменклатураСБИС.GTIN)
					И НЕ GTINВПараметрах = Неопределено Тогда
						GTINВПараметрах.Значение = Сопоставление.НоменклатураСБИС.GTIN; 
				ИначеЕсли Сопоставление.НоменклатураСБИС.Свойство("GTIN") 
					И ЗначениеЗаполнено(Сопоставление.НоменклатураСБИС.GTIN)
					И ВложениеСБИС.Свойство("Направление1С") 
					И ВложениеСБИС.Направление1С = "Исходящий" Тогда
						ПараметрыСтроки.Добавить(Новый Структура("Имя, Значение", "GTIN", Сопоставление.НоменклатураСБИС.GTIN));					
				КонецЕсли;  
				Если РассчитаннаяСтрокаТЧ.Свойство("КодПокупателя") 
					И ЗначениеЗаполнено(РассчитаннаяСтрокаТЧ.КодПокупателя)
					И НЕ КодПокупателяВПараметрах = Неопределено Тогда
						КодПокупателяВПараметрах.Значение = РассчитаннаяСтрокаТЧ.КодПокупателя;
				КонецЕсли;
				Если РассчитаннаяСтрокаТЧ.Свойство("КодПоставщика") 
					И ЗначениеЗаполнено(РассчитаннаяСтрокаТЧ.КодПоставщика)
					И НЕ КодПоставщикаВПараметрах = Неопределено Тогда
						КодПоставщикаВПараметрах.Значение = РассчитаннаяСтрокаТЧ.КодПоставщика;
				КонецЕсли;
			КонецЕсли; 
			
			МаркированныйТоварВСтроке	= МодульОбъектаКлиент().ПолучитьДанныеПоПути(Новый Структура("Путь, Данные", "НомСредИдентТов", РассчитаннаяСтрокаТЧ)); 
			ОбъемноСортовойУчет 		= ЗначениеЗаполнено(МаркированныйТоварВСтроке)
											И ЗначениеЗаполнено(МодульОбъектаКлиент().ПолучитьДанныеПоПути(Новый Структура("Путь, Данные", "КолВедМарк", МаркированныйТоварВСтроке[0])));
			
			УдалятьEDIПараметрыСтроки = ВложениеСБИС.Свойство("Направление1С") 
									И ВложениеСБИС.Направление1С = "Исходящий" 
									И НЕ (ЭтоУведомлОтгр Или ЭтоПодтверждениеЗаказа) 
									И РассчитаннаяСтрокаТЧ.Свойство("GTIN")
									И РассчитаннаяСтрокаТЧ.GTIN = Сопоставление.НоменклатураСБИС.GTIN
									И НЕ ОбъемноСортовойУчет; 
			
			Если УдалятьEDIПараметрыСтроки Тогда 
					РассчитаннаяСтрокаТЧ.Удалить("GTIN");
					РассчитаннаяСтрокаТЧ.Удалить("КодПокупателя"); 
					РассчитаннаяСтрокаТЧ.Удалить("КодПоставщика");
			КонецЕсли;
			// Конец временного костыля
			
			СписокИзмененныхТабличныхДанныхНоменклатуры = Новый Массив;
			СписокИзмененныхТабличныхДанныхНоменклатуры.Добавить("Характеристика"); 
			
			Если ВыгруженнаяНоменклатуры1С.Свойство("НДС") И 
				ЗначениеЗаполнено(ВыгруженнаяНоменклатуры1С.НДС.Ставка) Тогда
				ВыгруженнаяНоменклатуры1С.НДС.Ставка = Строка(ВыгруженнаяНоменклатуры1С.НДС.Ставка);
				ВыгруженнаяНоменклатуры1С.НДС.Сумма = Строка(ВыгруженнаяНоменклатуры1С.НДС.Сумма);
				ВыгруженнаяНоменклатуры1С.НДС.Сумма = СтрЗаменить(ВыгруженнаяНоменклатуры1С.НДС.Сумма, ",", ".");
				СписокИзмененныхТабличныхДанныхНоменклатуры.Добавить("НДС"); 
			КонецЕсли;                                                 
			
			Если ВыгруженнаяНоменклатуры1С.Свойство("Сумма") 
				И ЗначениеЗаполнено(ВыгруженнаяНоменклатуры1С.Сумма) Тогда
				СписокИзмененныхТабличныхДанныхНоменклатуры.Добавить("Цена");
				СписокИзмененныхТабличныхДанныхНоменклатуры.Добавить("Кол_во");
				СписокИзмененныхТабличныхДанныхНоменклатуры.Добавить("Сумма");
				СписокИзмененныхТабличныхДанныхНоменклатуры.Добавить("СуммаБезНал");
				СписокИзмененныхТабличныхДанныхНоменклатуры.Добавить("ЦенаБезНДС");
			КонецЕсли;
			
			ТипСтавки = Неопределено;
			Если РассчитаннаяСтрокаТЧ.Свойство("НДС") 
				И РассчитаннаяСтрокаТЧ.НДС.Свойство("ТипСтавки") Тогда
				ТипСтавки = РассчитаннаяСтрокаТЧ.НДС.ТипСтавки;
			КонецЕсли;
			
			КопироватьЗначенияПоСпискуКлючей(РассчитаннаяСтрокаТЧ, ВыгруженнаяНоменклатуры1С, СписокИзмененныхТабличныхДанныхНоменклатуры);
			
			Если НЕ ТипСтавки = Неопределено Тогда
				РассчитаннаяСтрокаТЧ.НДС.Вставить("ТипСтавки", ТипСтавки);
			КонецЕсли;
			
			Если РассчитаннаяСтрокаТЧ.Свойство("Характеристика") Тогда
				Если РассчитаннаяСтрокаТЧ.Характеристика = Неопределено Тогда
					РассчитаннаяСтрокаТЧ.Вставить("Характеристика", Новый Структура);
				Иначе
					// Дополнительно добавляем поле с таким именем, птмчт так прописано во всех ини
					РассчитаннаяСтрокаТЧ.Вставить("ХарактеристикаНоменклатуры", РассчитаннаяСтрокаТЧ.Характеристика);
					Если ТипЗнч(РассчитаннаяСтрокаТЧ.Характеристика) <> Тип("Структура") Тогда
						РассчитаннаяСтрокаТЧ.Вставить("Характеристика", Новый Структура("Значение", Строка(РассчитаннаяСтрокаТЧ.Характеристика)));
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если РассчитаннаяСтрокаТЧ.Свойство("ЦенаСНДС") 
				И НЕ ЗначениеЗаполнено(РассчитаннаяСтрокаТЧ.ЦенаСНДС)
				И НЕ РассчитаннаяСтрокаТЧ.Кол_Во = 0 Тогда
				РассчитаннаяСтрокаТЧ.ЦенаСНДС = Строка(РассчитаннаяСтрокаТЧ.Сумма / РассчитаннаяСтрокаТЧ.Кол_Во);
			ИначеЕсли РассчитаннаяСтрокаТЧ.Свойство("ЦенаСНДС")
				И НЕ РассчитаннаяСтрокаТЧ.Цена = РассчитаннаяСтрокаТЧ.ЦенаБезНДС Тогда
				РассчитаннаяСтрокаТЧ.ЦенаСНДС = РассчитаннаяСтрокаТЧ.Цена - РассчитаннаяСтрокаТЧ.ЦенаБезНДС;	
			КонецЕсли;

			Если НЕ ДопПараметры.СвернутьСтроки Тогда
				Если НЕ ЗначениеЗаполнено(РассчитаннаяСтрокаТЧ.Название)И ЗначениеЗаполнено(РассчитаннаяСтрокаТЧ.Номенклатура) Тогда
					РассчитаннаяСтрокаТЧ.Название = ПолучитьИмяНоменклатурыПоСсылкеКлиент(РассчитаннаяСтрокаТЧ.Номенклатура);
				ИначеЕсли НЕ ЗначениеЗаполнено(РассчитаннаяСтрокаТЧ.Название) И ЗначениеЗаполнено(Сопоставление.НоменклатураСБИС.Наименование) Тогда
					РассчитаннаяСтрокаТЧ.Название = Сопоставление.НоменклатураСБИС.Наименование; 
				ИначеЕсли НЕ ЗначениеЗаполнено(РассчитаннаяСтрокаТЧ.Название) Тогда  
					РассчитаннаяСтрокаТЧ.Название = РассчитаннаяСтрокаТЧ.Описание;
				КонецЕсли;
				
				НомерСтрокиТЧ = ПорядковыйНомер - 1;
			
				Если РассчитаннаяСтрокаТЧ.Свойство("ПорНомер") Тогда
					РассчитаннаяСтрокаТЧ.ПорНомер = ПорядковыйНомер; 
				КонецЕсли;
			
			ИначеЕсли ДопПараметры.Свойство("ПересчетПоДокументуОснованию")
				И ДопПараметры.ПересчетПоДокументуОснованию
				И ДопПараметры.СвернутьСтроки 
				И ДопПараметры.НаправлениеСворачивания = "СБИС"
				И РассчитаннаяСтрокаТЧ.Номенклатура = ВыгруженнаяНоменклатуры1С.Номенклатура Тогда
				//СложитьДанныеНоменклатур1С(РассчитаннаяСтрокаТЧ, ВыгруженнаяНоменклатуры1С);
			ИначеЕсли ДопПараметры.Свойство("ПересчетПоДокументуОснованию")
				И НЕ ДопПараметры.ПересчетПоДокументуОснованию Тогда
				СложитьДанныеНоменклатурСбис(РассчитаннаяСтрокаТЧ, ВыгруженнаяНоменклатуры1С);
			КонецЕсли;
			
			// На отправку нам не нужны все данные которые отдаёт класс сопоставления, но функцию делать менее универсальной нет желания, потому заполним ТаблДок, а потом удалим лишнее
			Если НЕ ФайлПерегенерируется = Неопределено
				И НЕ ФайлПерегенерируется Тогда
				СписокАтрибутов = Новый Массив;
				СписокАтрибутов.Добавить("Номенклатура"); 
				СписокАтрибутов.Добавить("ХарактеристикаНоменклатуры");
				СписокАтрибутов.Добавить("ПорНомерВФайлеКонтрагента");
				СписокАтрибутов.Добавить("ЕдИзм1С");
				СписокАтрибутов.Добавить("ИмяТЧ");
				СписокАтрибутов.Добавить("НомерСтрокиТЧ");
				СписокАтрибутов.Добавить("НеЗагружать");
				СписокАтрибутов.Добавить("ЦенаБезНДС");
				
				МодульОбъектаКлиент().УдалитьЛишниеАтрибутыСтрокиТабличнойЧасти(РассчитаннаяСтрокаТЧ, СписокАтрибутов);	
			КонецЕсли;
			// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
			
			ТаблДокОбработанный.Добавить(РассчитаннаяСтрокаТЧ);
			ПорядковыйНомер = ПорядковыйНомер + 1;

		КонецЦикла;
		ИндексСтрокиНоменклатурыСБИС = ИндексСтрокиНоменклатурыСБИС + 1;
	КонецЦикла; 
	
	Возврат ТаблДокОбработанный;	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеЕдиницы(Знач Единица) 
	
	Если НЕ ЗначениеЗаполнено(Единица) Тогда
		Результат = Новый Структура("ОКЕИ, Наименование", "796", "шт");
		Возврат Результат;
	КонецЕсли;
	СпрОбъект = Единица.ПолучитьОбъект();
	
	Результат = Новый Структура("ОКЕИ, Наименование", СпрОбъект.Код, СпрОбъект.Наименование);
	Возврат Результат;	
	
КонецФункции

&НаКлиенте
Процедура КопироватьЗначенияПоСпискуКлючей(Приемник, Источник, СписокКлючей)
	
	Для Каждого Ключ Из СписокКлючей Цикл
		Если Источник.Свойство(Ключ) Тогда
			Приемник.Вставить(Ключ, Источник[Ключ]);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьИмяНоменклатурыПоСсылкеКлиент(Ссылка)
	Возврат МодульОбъектаСервер().ПолучитьИмяНоменклатурыПоСсылкеСервер(Ссылка);
КонецФункции

&НаКлиенте
Процедура СложитьДанныеНоменклатур1С(Приемник, Источник)
	
	СписокСвойств = Новый Массив;
	СписокСвойств.Добавить("Кол_во");
	СписокСвойств.Добавить("Сумма");
	СписокСвойств.Добавить("СуммаНДС");
	СписокСвойств.Добавить("СуммаБезНал");
	
	
	Для Каждого Ключ Из СписокСвойств Цикл
		
		Если Ключ = "СуммаНДС" Тогда
			Приемник.НДС.Сумма = Приемник.НДС.Сумма + Источник.НДС.Сумма;
		Иначе
			Приемник[Ключ] = Приемник[Ключ] + Источник[Ключ];	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СложитьДанныеНоменклатурСбис(Приемник, Источник)
	
	// В душе не чаю что тут нужно делать, так что это пока заглушка (с) Сыч
	Возврат;
	
КонецПроцедуры

#Область include_core2_vo2_Файл_Шаблон_ПолучитьТабличнуюЧастьДокумента1С_ШтатныеОбработчикиТочекВхода
#КонецОбласти

#Область include_core2_vo2_Файл_Шаблон_ПолучитьТабличнуюЧастьДокумента1С_Прочее
#КонецОбласти

