
// Процедура - сообщить пользователю
//
// Параметры:
//  ПараметрыСообщения	 - Структура - Текст, СтатусСообщения, ЭлементНазначения, ФормаВладелец
//  ДопПараметры		 - Строка/Структура/ФиксированнаяСтруктура	 - расширение.
//
&НаКлиенте
Процедура СбисСообщить(ПараметрыСообщения, ДопПараметры=Неопределено) Экспорт
	Перем СбисСтатусСообщения, СбисТекстСообщения;
	
	ТихийРежим	= ПолучитьЗначениеПараметраСбис("ТихийРежим") = Истина
				Или	(Не ДопПараметры = Неопределено
					И	(	ТипЗнч(ДопПараметры) = Тип("Структура")
						Или ТипЗнч(ДопПараметры) = Тип("ФиксированнаяСтруктура"))
					И	ДопПараметры.Свойство("ТихийРежим")
					И	ДопПараметры.ТихийРежим);
	
	Если ТихийРежим Тогда
						
		Возврат;
		
	ИначеЕсли ТипЗнч(ПараметрыСообщения) = Тип("Строка") Тогда
		
		СбисТекстСообщения	= ПараметрыСообщения;
		
	ИначеЕсли ЭтоТипСбис(ПараметрыСообщения, "СбисИсключение") Тогда
		
		СообщитьСбисИсключение(ПараметрыСообщения, ДопПараметры);
		Возврат;
		
	ИначеЕсли ПараметрыСообщения = Неопределено Тогда
		
		// На случай некорректных сообщений, нечего сообщать.
		Возврат;
		
	Иначе
		
		СбисТекстСообщения	= ПараметрыСообщения.Текст;
		
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Если    	ТипЗнч(ПараметрыСообщения) = Тип("Строка")
			Или	Не	ПараметрыСообщения.Свойство("СтатусСообщения", СбисСтатусСообщения) Тогда
			СбисСтатусСообщения = СтатусСообщения.Обычное
		КонецЕсли;
		Сообщить(СбисТекстСообщения, СбисСтатусСообщения);
		
	#Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СбисТекстСообщения;
		
		Если	ТипЗнч(ПараметрыСообщения) = Тип("Структура")
			Или	ТипЗнч(ПараметрыСообщения) = Тип("ФиксированнаяСтруктура") Тогда
			
			Если ПараметрыСообщения.Свойство("ЭлементНазначения") Тогда
				Сообщение.Поле = ПараметрыСообщения.ЭлементНазначения;
			КонецЕсли;
			Если		ПараметрыСообщения.Свойство("ФормаВладелец")
				И Не	ПараметрыСообщения.ФормаВладелец = Неопределено  Тогда
				Сообщение.ИдентификаторНазначения = ПараметрыСообщения.ФормаВладелец.УникальныйИдентификатор;
			КонецЕсли;
			
		КонецЕсли;	
		
		Сообщение.Сообщить(); 
		
	#КонецЕсли	
КонецПроцедуры

// Процедура - Сообщает сбис исключение
//
// Параметры:
//  ИсключениеВходящее	 - Структура, ИнформацияОбОшибке	- экземпляр ExtSysException(СбисИсключение) в разобранном виде, либо в виде сериализованной строки
//  ДопПараметры		 - Структура, Строка	- дополнительные параметры. Если строка, то имя команды для стека при вызове как ИнформацияОбОшибке
//		СтатусСообщения		- Строка	- статус сообщения: "warning" - показать форму предупреждения со ссылкой на решение проблемы. "attention" - показать форму ошибки, "message" - вывод в обычном режиме
//		Отправлять			- Булево, признак отключения отправки ошибки в статистику
//		ИмяКоманды			- Строка для генерации исключения, если как исключение пришла ИнформацияОбОшибке
//
&НаКлиенте
Процедура СообщитьСбисИсключение(ИсключениеВходящее, ДопПараметры=Неопределено) Экспорт
	Перем СтатусОшибки, лРешениеПроблемы, лФормаВладелец, лОтправлятьОшибку, лИдентификаторОшибки;
	
	Если		ТипЗнч(ИсключениеВходящее) = Тип("ИнформацияОбОшибке")
		Или Не	ЭтоТипСбис(ИсключениеВходящее, "СбисИсключение") Тогда
		
		// Если Информация об ошибке, то тоже надо перегенерировать ошибку
		Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
			
			ИмяКомандыВСтэк = ДопПараметры.ИмяКоманды;
			
		Иначе
			
			Если ДопПараметры = Неопределено Тогда
				
				ИмяКомандыВСтэк = МодульОбъектаКлиентСервер_Представление() + "СообщитьСбисИсключение";
				
			Иначе
				
				ИмяКомандыВСтэк = ДопПараметры;
			
			КонецЕсли;
			ДопПараметры = Новый Структура;
			
		КонецЕсли;
		СбисИсключение = НовыйСбисИсключение(ИсключениеВходящее, ИмяКомандыВСтэк);
		
	Иначе
		
		СбисИсключение = ИсключениеВходящее;
		
	КонецЕсли;
	
	Если Не ДопПараметры = Неопределено Тогда
			
		Если 	ДопПараметры.Свойство("Отложенно")
			И	ДопПараметры.Отложенно Тогда
			//Показать ошибку отложенно.
			ДопПараметры.Удалить("Отложенно");
			СбисПараметрыДействия = Новый Структура("ИмяПроцедуры, Модуль, ДополнительныеПараметры, Аргумент");
			СбисПараметрыДействия.ИмяПроцедуры				= "СообщитьСбисИсключение";
			СбисПараметрыДействия.Модуль					= МодульОбъектаКлиент();
			СбисПараметрыДействия.ДополнительныеПараметры	= ДопПараметры;
			СбисПараметрыДействия.Аргумент					= ИсключениеВходящее;
			
			Попытка
				
				ПодключитьОтложенноеДействие(НовыйОтложенноеДействие(СбисПараметрыДействия));
				
			Исключение
				
				СообщитьСбисИсключение(НовыйСбисИсключение(ИнформацияОбОшибке(), "МодульОбъектаКлиент.ПодключитьОтложенноеДействие"), Новый Структура("СтатусСообщения", "message"));
				
			КонецПопытки;
			Возврат;
			
		КонецЕсли;
		
		ДопПараметры.Свойство("Идентификатор",		лИдентификаторОшибки);
		ДопПараметры.Свойство("СтатусСообщения",	СтатусОшибки);
		ДопПараметры.Свойство("ФормаВладелец",		лФормаВладелец);
		ДопПараметры.Свойство("Отправлять",			лОтправлятьОшибку);
		
	КонецЕсли;
	
	Если СбисИсключение.code = 304 Тогда
		
		лОтправлятьОшибку = Ложь;
		
	КонецЕсли;
	
	ТекстОшибки = СбисИсключение_Выгрузить(СбисИсключение, "сообщение");
	СбисИсключение.Свойство("help", лРешениеПроблемы);
	
	//Статус сообщения, если не указан
	Если СтатусОшибки = Неопределено Тогда
		
		Если ЗначениеЗаполнено(лРешениеПроблемы) Тогда
			СтатусОшибки = "warning";
		Иначе
			СтатусОшибки = "attention";
		КонецЕсли;
		
	КонецЕсли;
	
	//Отправлять ошибку в статистику, если не указано
	Если лОтправлятьОшибку = Неопределено Тогда
		лОтправлятьОшибку = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГлобальныйКэш) Тогда
		
		Если ПолучитьЗначениеПараметраСбис("РежимОтладки") Тогда
			
			ЗаписьВЛог = Новый Структура("Идентификатор, Исключение", лИдентификаторОшибки, СбисИсключение);
			СохранитьОтладочныеДанныеСБИС(Новый Структура("Log", ЗаписьВЛог));
			
		КонецЕсли;
		
		Если ПолучитьЗначениеПараметраСбис("ТихийРежим") Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Если НЕ (	ДопПараметры.Свойство("НеВызыватьРекурсивно")
				И	ДопПараметры.НеВызыватьРекурсивно) Тогда
			ИсключениеДоп = НовыйСбисИсключение(,"МодульОбъектКлиент.СообщитьСбисИсключение",,"Не определен ГлобальныйКэш");
			СообщитьСбисИсключение(ИсключениеДоп, Новый Структура("СтатусоСообщения, Отправлять, НеВызыватьРекурсивно", "platform_warning", Ложь, Истина));
			СтатусОшибки = "platform_warning";
			лОтправлятьОшибку = Ложь;	
		КонецЕсли;
	КонецЕсли;

	ПараметрыСообщения = Новый Структура;
	ПараметрыСообщения.Вставить("Текст",			ТекстОшибки);
	Если ЗначениеЗаполнено(лРешениеПроблемы) Тогда
		ПараметрыСообщения.Вставить("ТекстСсылка",	"Решение проблемы");
		ПараметрыСообщения.Вставить("АдресСсылка",	лРешениеПроблемы);
	КонецЕсли;
	ПараметрыСообщения.Вставить("ФормаВладелец",	лФормаВладелец);
	лОтправлятьОшибку = лОтправлятьОшибку И Не СбисИсключение.code = 775;

	Если		СтатусОшибки = "warning" Тогда
		
		//Важная ошибка, которую обязательно прочитать, либо которая имеет заготовленное решение.
		ПараметрыФормыОшибки = Новый Структура;
		ПараметрыФормыОшибки.Вставить("Владелец",			лФормаВладелец);
		ПараметрыФормыОшибки.Вставить("ПолучитьНовую",		Истина);
		ПараметрыФормыОшибки.Вставить("КэшироватьФорму",	Ложь);
		
		ФормаПредупреждение = ПолучитьФормуОбработки("ФормаПредупреждения", ПараметрыФормыОшибки);
		ФормаПредупреждение.ПоказатьПоверх(ПараметрыСообщения);
		
	ИначеЕсли	СтатусОшибки = "attention" Тогда

		//Обычные исключения показываем в информационной панели. В форме показываем только критические ошибки, либо ошибки, имеющие подготовленное решение.
		ПараметрыСообщения.Вставить("СтатусСообщения", СтатусСообщения.Внимание);
		СбисСообщить(ПараметрыСообщения); 
		
	ИначеЕсли СтатусОшибки = "platform_warning" Тогда
		
		//Только на случай, если либо еще не проинитился кэш, либо нет возможности получить форму предупреждения.
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Предупреждение(ТекстОшибки);
		#Иначе
			ПоказатьПредупреждение(,ТекстОшибки);
		#КонецЕсли
		
	Иначе
		
		//Сообщить ошибку с обычным статусом.
		ПараметрыСообщения.Вставить("СтатусСообщения", СтатусСообщения.Обычное);
		СбисСообщить(ПараметрыСообщения);
		
	КонецЕсли;
	//Если не отключено, то отправим информацию о возникшей ошибке
	Если лОтправлятьОшибку Тогда	
		сбисПараметрыСтатистики = Новый Структура("Действие, Ошибка", "Ошибка", СбисИсключение);
		Попытка
			СбисСтатистика_СформироватьИЗаписать(сбисПараметрыСтатистики, Новый Структура);	
		Исключение
			ИнфоОбОшибке = ИнформацияОбОшибке();
			СообщитьСбисИсключение(НовыйСбисИсключение(ИнфоОбОшибке, "МодульОбъектКлиент.СформироватьИЗаписатьСтатистикуНаСервис"), Новый Структура("Отправлять", Ложь));
		КонецПопытки;
	КонецЕсли;	
КонецПроцедуры

// Процедура - Сбис показать вопрос. Идентично ПоказатьВопрос, с учетом модальности ОФ.
//
// Параметры:
//  СбисОписаниеОповещенияОЗавершении	 - СбисОписаниеОповещения	 - обработчик диалога
//  ТекстВопроса						 - Строка					 - 
//  Кнопки								 - Список					 - 
//  Таймаут								 - Таймаут					 - 
//  КнопкаПоУмочанию					 - Кнопка/элемент списка	 - 
//  Заголовок							 - Строка					 - 
//  КнопкаТаймаута						 - Кнопка/элемент списка	 - 
//
&НаКлиенте
Процедура СбисПоказатьВопрос(СбисОписаниеОповещенияОЗавершении, ТекстВопроса, Кнопки, Таймаут=0, КнопкаПоУмочанию = Неопределено, Заголовок="", КнопкаТаймаута=Неопределено) Экспорт

	#Если ТолстыйКлиентОбычноеПриложение Тогда

		РезультатДиалога = Вопрос(ТекстВопроса, Кнопки, Таймаут, КнопкаПоУмочанию, Заголовок, КнопкаТаймаута);
		ПодключитьОтложенноеДействие(СбисОписаниеОповещенияОЗавершении, РезультатДиалога);
		
	#Иначе
		
		ПоказатьВопрос(СбисОписаниеОповещенияОЗавершении, ТекстВопроса, Кнопки, Таймаут, КнопкаПоУмочанию, Заголовок, КнопкаТаймаута);
		
	#КонецЕсли
	
КонецПроцедуры

// Процедура - Сбис показать ввод строки
//
// Параметры:
//  ОписаниеОповещения	 -  ОписаниеОповещения - Содержит описание процедуры, которая будет
//												вызвана после закрытия окна ввода строки со
//												следующими параметрами:
//													<Строка> - введенное значение строки или
//														Неопределено, если пользователь
//														отказался от ввода,
//													<ДополнительныеПараметры> - значение,
//														которое было указано при создании
//														объекта ОписаниеОповещения.
//  Строка				 - Строка - Начальное значение строки, которое будет использовано в
//									качестве начального значения в окне ввода.
//  Подсказка			 - Строка - Текст заголовка окна диалога ввода строки. Может
//									использоваться в качестве подсказки пользователю.
//  Длина				 - Число - Длина вводимой строки. Если параметр не указан, то строка неограниченной длины.
//  Многострочность		 - Булево - Определяет режим ввода многострочного текста: Истина - ввод многострочного
//									текста с разделителями строк; Ложь - ввод простой строки.
//
&НаКлиенте
Процедура СбисПоказатьВводСтроки(ОписаниеОповещения, Строка, Подсказка = "", Длина = 0, Многострочность = Ложь) Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	 
	 	РезультатДиалога = ВвестиСтроку(Строка, Подсказка, Длина, Многострочность);
		ПодключитьОтложенноеДействие(ОписаниеОповещения, РезультатДиалога);
		
	#Иначе
		
		ПоказатьВводСтроки(ОписаниеОповещения, Строка, Подсказка, Длина, Многострочность);
	
	#КонецЕсли
	
КонецПроцедуры

// Процедура - Сбис показать ввод строки
//
// Параметры:
//  ОписаниеОповещения	 -  ОписаниеОповещения - Содержит описание процедуры, которая будет
//												вызвана после закрытия окна ввода строки со
//												следующими параметрами:
//													<Строка> - введенное значение строки или
//														Неопределено, если пользователь
//														отказался от ввода,
//													<ДополнительныеПараметры> - значение,
//														которое было указано при создании
//														объекта ОписаниеОповещения.
//  Число				 - Число - Начальное значение числа, которое будет использовано в
//									качестве начального значения в окне ввода.
//  Подсказка			 - Строка - Текст заголовка окна диалога ввода числа. Может
//									использоваться в качестве подсказки пользователю.
//  Длина				 - Число - Длина вводимого числа, включая дробную часть.
//  Точность		 	 - Число - определяет число знаков после запятой
//
&НаКлиенте
Процедура СбисПоказатьВводЧисла(ОписаниеОповещения, Число, Подсказка = "", Длина = 0, Точность = 0) Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	 
	 	РезультатДиалога = ВвестиЧисло(Число, Подсказка, Длина, Точность);
		ПодключитьОтложенноеДействие(ОписаниеОповещения, РезультатДиалога);
		
	#Иначе
		
		ПоказатьВводЧисла(ОписаниеОповещения, Число, Подсказка, Длина, Точность);
	
	#КонецЕсли
	
КонецПроцедуры

// Процедура - Сбис показать ввод стандартного периода
//
// Параметры:
//  ОписаниеОповещения	 -  ОписаниеОповещения - Содержит описание процедуры, которая будет
//												вызвана после закрытия окна ввода строки со
//												следующими параметрами:
//													<Строка> - введенное значение строки или
//														Неопределено, если пользователь
//														отказался от ввода,
//													<ДополнительныеПараметры> - значение,
//														которое было указано при создании
//														объекта ОписаниеОповещения.
//  Период				 - СтандартныйПериод - Редактируемый стандартный период.
//
&НаКлиенте
Процедура СбисПоказатьВводПериода(ОписаниеОповещения, Период) Экспорт
	
	ДиалогРедактированияСтандартногоПериода = Новый ДиалогРедактированияСтандартногоПериода;
	ДиалогРедактированияСтандартногоПериода.Период = Период;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		ДиалогРедактированияСтандартногоПериода.Редактировать();
	 	РезультатДиалога = ДиалогРедактированияСтандартногоПериода.Период;
		ПодключитьОтложенноеДействие(ОписаниеОповещения, РезультатДиалога);
		
	#Иначе
		
		ДиалогРедактированияСтандартногоПериода.Показать(ОписаниеОповещения);
	
	#КонецЕсли
	
КонецПроцедуры

//Процедура показывает пользователю выбор из сформированного списка значений
&НаКлиенте
Процедура СбисВыбратьИзСписка(СписокВыбора, ДопПараметры) Экспорт
	
	Если	ДопПараметры.Свойство("ОтметитьЭлементы")
		И	ДопПараметры.ОтметитьЭлементы Тогда
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			Если СписокВыбора.ОтметитьЭлементы(ДопПараметры.Заголовок) Тогда
				
				ВыполнитьСбисОписаниеОповещения(СписокВыбора, ДопПараметры.Обработчик);
				
			Иначе
				
				ВыполнитьСбисОписаниеОповещения(Неопределено, ДопПараметры.Обработчик);
				
			КонецЕсли;
			
		#Иначе
			
			СписокВыбора.ПоказатьОтметкуЭлементов(ДопПараметры.Обработчик, ДопПараметры.Заголовок);
			
		#КонецЕсли
		
	ИначеЕсли ДопПараметры.Свойство("ЭлементПривязки") Тогда 
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			ВыполнитьСбисОписаниеОповещения(ДопПараметры.Форма.ВыбратьИзМеню(СписокВыбора, ДопПараметры.ЭлементПривязки), ДопПараметры.Обработчик);
			
		#Иначе
			
			ДопПараметры.Форма.ПоказатьВыборИзМеню(ДопПараметры.Обработчик, СписокВыбора, ДопПараметры.ЭлементПривязки);
			
		#КонецЕсли	
		
	Иначе
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			ПодключитьОтложенноеДействие(ДопПараметры.Обработчик, СписокВыбора.ВыбратьЭлемент(ДопПараметры.Заголовок));
			
		#Иначе
			
			СписокВыбора.ПоказатьВыборЭлемента(ДопПараметры.Обработчик, ДопПараметры.Заголовок);
			
		#КонецЕсли	
		
	КонецЕсли;
	
КонецПроцедуры

// Функция - диалог выбор файла
//
// Параметры:
//  ОписаниеОповещения	 - СбисОписаниеОповещения	 - обработчик, который будет вызван после закрытия диалога
//  ПараметрыВыбораФайла - Структура				 - расширение
// 
&НаКлиенте
Процедура CбисВыбратьФайл(ОписаниеОповещения, ПараметрыВыбораФайла) Экспорт
	Перем РежимВыбораФайла;
	
	ПараметрыВыбораФайла.Свойство("РежимВыбораФайла", РежимВыбораФайла);
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимВыбораФайла); 
	Если ПараметрыВыбораФайла.Свойство("Каталог") Тогда
		
		ДиалогОткрытия.Каталог = ПараметрыВыбораФайла.Каталог;
		
	КонецЕсли;
	Если Не ПараметрыВыбораФайла.Свойство("Заголовок", ДиалогОткрытия.Заголовок) Тогда
		
		ДиалогОткрытия.Заголовок = "Укажите путь";
		
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Если ДиалогОткрытия.Выбрать() Тогда
			
			НаборФайловВыбран = Новый Массив;
			НаборФайловВыбран.Добавить(ДиалогОткрытия.Каталог);
			
			ВыполнитьСбисОписаниеОповещения(НаборФайловВыбран, ОписаниеОповещения);
			
		Иначе
			
			ВыполнитьСбисОписаниеОповещения(Неопределено, ОписаниеОповещения);
			
		КонецЕсли;
		
	#Иначе
		
		ДиалогОткрытия.Показать(ОписаниеОповещения);
		
	#КонецЕсли
	
КонецПроцедуры

// Процедура показывает пользователю поле для ввода значения
//
// Параметры:
// ПараметрыПоляВвода - Структура - содержит информацию для вывода формы
// 		Заголовок - Строка - заголовок формы
//      Обработчик - Структура - Процедура для обработки выбора
//
&НаКлиенте
Процедура СбисПоказатьПолеВвода(ПараметрыПоляВвода) Экспорт
	
	ПараметрыПолученияФормы = Новый Структура("Владелец, ПолучитьНовую, КэшироватьФорму", 
	ПараметрыПоляВвода.Обработчик.Модуль.ЭтаФорма, Истина, Ложь);
	ПараметрыФормы =  Новый Структура("ПолеВвода", Истина);
	
	ОбработкаВыбора = НовыйСбисОписаниеОповещения(ПараметрыПоляВвода.Обработчик.ИмяПроцедуры, 
	ПараметрыПоляВвода.Обработчик.Модуль.ЭтаФорма, ПараметрыПолученияФормы); 
	
	фрм = ПолучитьФормуОбработки("ФормаПрограммнаяГенерация", ПараметрыПолученияФормы);
	
	фрм.ОписаниеОповещенияОЗакрытии = ОбработкаВыбора;
	фрм.Заголовок = ПараметрыПоляВвода.Заголовок;
	фрм.ПоказатьПоверх(ПараметрыФормы);
КонецПроцедуры

