
&НаКлиенте
Перем МестныйКэш Экспорт;

#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

#Область include_local_РаботаСДокументами1С
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ЗагрузкаДокументов_ФункцииДляСовместимостиКода
#КонецОбласти

//------------------------------------------------------

#Область include_core2_vo2_ОбщиеФункции_Разное_Функции
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ЗагрузкаДокументов_БлокФункцийИниФайлов
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ВыгрузкаДокументов_ВнешнийВызов
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ВыгрузкаДокументов_Расчет
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ВыгрузкаДокументов_Функции
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ВыгрузкаДокументов_Нумерация
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ВыгрузкаДокументов_СверткаСтрок
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ЗагрузкаДокументов_ЗагрузкаДокументов
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ЗагрузкаДокументов_РазборДокументов
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ЗагрузкаДокументов_ЗагрузкаНоменклатуры
#КонецОбласти

// Процедура - Валидация автоматического сопоставления
// Если единицы 1С и СБИС отличаются, то автоматическое сопоставление проходить не должно, ибо мы не имеем коэффициента для приведения табличных данных 
//
// Параметры:
// КлассНоменклатуры - Структура - Данные класса сопоставления номенклатуры (см. МодульОбъектаКлиент - НовыйСтрокаСопоставленияСБИСКлиент)
//
&НаСервере
Процедура ВалидацияАвтоматическогоСопоставления(КлассНоменклатуры)
	
	Для Каждого Номенклатура1С Из КлассНоменклатуры.Номенклатура1С Цикл
		Единицы1С = МодульОбъектаСервер().ОписаниеНоменклатуры1ССервер_Получить(Номенклатура1С.Значение, "Единицы"); 
		ЕдиницаТекущейНоменклатуры = Единицы1С.Получить(Номенклатура1С.Ключ.ЕдиницаИзмерения);
		ОКЕИЕдиницы1С = МодульОбъектаСервер().СопоставлениеДляЕдиницыСервер_Получить(ЕдиницаТекущейНоменклатуры, "ОКЕИ");		
		Прервать;
	КонецЦикла;
	
	ЕдиницыСБИС = МодульОбъектаСервер().СтрокаСопоставленияСБИССервер_Получить(КлассНоменклатуры, "Единицы"); 
	Для Каждого Единица Из ЕдиницыСБИС Цикл
		ОКЕИЕдиницыСБИС = Единица.Значение.ОКЕИ;
		Прервать;
	КонецЦикла;
	
	Если НЕ ОКЕИЕдиницы1С = ОКЕИЕдиницыСБИС Тогда
		МодульОбъектаСервер().СтрокаСопоставленияСБИССервер_Вставить(КлассНоменклатуры, "АвтоматическоеСопоставлениеПровалено", Истина);
	КонецЕсли;
	
КонецПроцедуры
	

#Область include_core2_vo2_ОбщиеФункции_ОтправкаПрайса
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ЗагрузкаСотрудников
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ЗагрузкаДокументов_APIФункцииЗагрузки
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ЗагрузкаДокументов_ФункциОставленДляСовместимости
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ЗагрузкаДокументов_ВспомогательныеФункцииЗагрузки
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ВспомогательныеФункцииКэширование
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_Прочее
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ОбработкаXMLКонвертеров
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_РезультатДействия
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ExtSysException
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_РезультатОтправки
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_Статистика
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_Подсистемы
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ЛентаДокумента
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ИдПакетаДокумента
#КонецОбласти

#Область include_core2_vo2_ОбщиеФункции_ФормированиеОтчетности
#КонецОбласти

#Область include_core2_ТребуетРефактор_ОбщиеФункции_Отладка
#КонецОбласти
