
#Область include_core2_vo2_Файл_ПодтверждениеЗаказа_301_ГенераторФЭД
#КонецОбласти  

#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

// Функция - формирует структура табличной части файла
//
// Параметры:
//  Кэш		 - Структура - Кэш обработки
//  Контекст - Структура - Структура рассчета
// 
// Возвращаемое значение:
//  Структура - результат работы функции
//
&НаКлиенте
Функция ПолучитьТабличнуюЧастьДокумента1С(Кэш, Контекст) Экспорт  
	
	Контекст.Вставить("СохранятьСсылки", Ложь);
	Возврат МодульОбъектаКлиент().ПолучитьФормуОбработки("Файл_Шаблон").ПолучитьТабличнуюЧастьДокумента1С(Кэш, Контекст);
	
КонецФункции
