
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти
 
//Переадресация на обработчик
&НаКлиенте
Функция СформироватьДокументДляГенератора(ПараметрыФормированияВходящие, Кэш) Экспорт
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("СформироватьДокументДляГенератора","Файл_Шаблон_3_03","", Кэш);
	Возврат фрм.СформироватьДокументДляГенератора(ПараметрыФормированияВходящие, Кэш);		
КонецФункции

&НаКлиенте
Процедура ПропатчитьСтруктуруВложения(ВложениеСБИС, ДопПараметры) Экспорт
	
	УдаляемыеУзлы = Новый Массив;
	УдаляемыеУзлы.Добавить("Файл.Документ.Стороны.Покупатель.Адрес.Юридический.АдрРФ.НаимРегион");
	УдаляемыеУзлы.Добавить("Файл.Документ.Стороны.Поставщик.Адрес.Юридический.АдрРФ.НаимРегион");
	УдаляемыеУзлы.Добавить("Файл.Документ.Стороны.Грузоотправитель.Адрес.Юридический.АдрРФ.НаимРегион");
	УдаляемыеУзлы.Добавить("Файл.Документ.Стороны.Грузополучатель.Адрес.Юридический.АдрРФ.НаимРегион");

	УдаляемыеУзлы.Добавить("Файл.Документ.Стороны.Покупатель.Адрес.Юридический.АдрИно.НаимСтран");
	УдаляемыеУзлы.Добавить("Файл.Документ.Стороны.Поставщик.Адрес.Юридический.АдрИно.НаимСтран");
	УдаляемыеУзлы.Добавить("Файл.Документ.Стороны.Грузоотправитель.Адрес.Юридический.АдрИно.НаимСтран");
	УдаляемыеУзлы.Добавить("Файл.Документ.Стороны.Грузополучатель.Адрес.Юридический.АдрИно.НаимСтран"); 
	
	// В инишке УоО, на БУХ3, 5 сторон почему-то
	УдаляемыеУзлы.Добавить("Файл.Документ.Стороны.Отправитель.Адрес.Юридический.АдрРФ.НаимРегион");	
	УдаляемыеУзлы.Добавить("Файл.Документ.Стороны.Отправитель.Адрес.Юридический.АдрИно.НаимСтран");

	МодульОбъектаКлиент().ВложениеСБИС_УдалитьУзлыИзСтруктурыДанных(ВложениеСБИС, УдаляемыеУзлы);

КонецПроцедуры
