
#Область includr_core2_vo2_СистемныеИнтерфейсы_ИнтерфейсныйМодуль
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_СбисЗаблокироватьИнтерфейс
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_СбисРазблокироватьИнтерфейс
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_ОбработкаОповещения
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_ПриОткрытииОбработчик
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_ПередЗакрытиемОбработчик
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_ПриЗакрытииОбработчик
#КонецОбласти

#Область include_core2_vo2_Формы_ФормаПредупреждения_СистемныйИнтерфейс
#КонецОбласти

&НаКлиенте
Процедура ПредупреждениеСсылкаНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если ПредупреждениеАдресСсылка = "Сохранить ошибку" Тогда
		ВыбраныйКаталог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		ВыбраныйКаталог.Заголовок = "Выберите каталог";
		Если ВыбраныйКаталог.Выбрать() Тогда
			КаталогВыгрузкиФайла = ВыбраныйКаталог.Каталог;//Исправлена ошибка при массовом сохранении документов. 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КаталогВыгрузкиФайла) Тогда
			JSONОшибки = МодульОбъектаКлиент().СбисИсключение_ОшибкаВJSON(ПредупреждениеСтруктураОшибки);
			ФайлВыгрузки = Новый ТекстовыйДокумент;
			ФайлВыгрузки.ДобавитьСтроку(JSONОшибки);
			ФайлВыгрузки.Записать(КаталогВыгрузкиФайла + "/ДанныеОбОшибке.txt", КодировкаТекста.UTF8);
		КонецЕсли;
	Иначе
		ЗапуститьПриложение(ПредупреждениеАдресСсылка);
	КонецЕсли;
	
КонецПроцедуры

