
&НаКлиенте
Функция Показать(Кэш,СписокОтмеченныхДокументов)Экспорт

	МестныйКэш	= Кэш;
	фрм			= Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПолучитьВыборкуОтправляемыхПакетов",,"ФормаПересылкаПакетов",МестныйКэш);
	СписокДокументов = фрм.ПолучитьВыборкуОтправляемыхПакетов(МестныйКэш, СписокОтмеченныхДокументов);
	Если СписокДокументов.Количество() Тогда
		
		ЗаголовокФормы = "Переслать для ознакомления";
		Если СписокДокументов.Количество() = 1 Тогда
			
			Попытка
				
				ЗаголовокФормы = ЗаголовокФормы + " " + СписокДокументов[0].Значение.Название;
				
			Исключение
				
				ЗаголовокФормы = ЗаголовокФормы + " 1 документ";
				
			КонецПопытки;
			
		Иначе
			
			ЗаголовокФормы = ЗаголовокФормы + " " + Формат(СписокДокументов.Количество(), "ЧГ=0") + " документов";

		КонецЕсли;
		
		Если Не ЭтаФорма.Открыта() Тогда

			ЭтаФорма.Заголовок = ЗаголовокФормы;
			ЭтаФорма.Открыть();
			
		КонецЕсли;	
		
	Иначе
		
		Сообщить("Переслать можно только утвержденные документы.");
		
	КонецЕсли;
КонецФункции	

&НаКлиенте
Функция ПолучитьВыборкуОтправляемыхПакетов(Кэш, СписокОтмеченныхДокументов)Экспорт
	СписокОтправляемыхДокументов = Новый СписокЗначений();
	Если СписокОтмеченныхДокументов.Количество() Тогда
		Для Каждого Строка Из СписокОтмеченныхДокументов Цикл
			
			СоставПакета = Строка.Значение.СоставПакета[0].Значение;
			Если Не СоставПакета.Состояние.Код = "7" Тогда //или Строка.Значение.СоставПакета[0].Значение.Состояние.Код="4" Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			СтрокаДляОтправки = Новый Структура("ИдСБИС, Отмечен, Название");
			ЗаполнитьЗначенияСвойств(СтрокаДляОтправки, Строка.Значение);
			
			СтрокаДляОтправки.Отмечен	= Истина;
			СтрокаДляОтправки.Название	= СоставПакета.Название;
			
			СписокОтправляемыхДокументов.Добавить(СтрокаДляОтправки);
			
		КонецЦикла;
		
	Иначе 
		
		Предупреждение("Не выбран ни один документ");
		
	КонецЕсли;
	
	Возврат СписокОтправляемыхДокументов;
КонецФункции

&НаКлиенте
Процедура ПереслатьПакеты(Кнопка)

	ПереслатьПакеты_Начало();
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьСтруктуруДокумента(ПараметрыПодготовкиДокумента, Кэш) Экспорт

	МодульТекущий	= МодульОбъектаКлиент();
	оДокумент		= ПараметрыПодготовкиДокумента.ДокументСБИС;
	МассивПакетов	= Новый Массив;
	
	ДокОснование = Новый Структура;
	ДокОснование.Вставить("Идентификатор",	оДокумент.Идентификатор);
	ДокОснование.Вставить("ВидСвязи",		"Переслать");
	
	ПараметрыПакет = Новый Структура;
	ПараметрыПакет.Вставить("Тип",					"КоррИсх");
	ПараметрыПакет.Вставить("ДокументОснование",	Новый Массив);
	ПараметрыПакет.Вставить("Дата",					ТекущаяДата());
	ПараметрыПакет.Вставить("Контрагент",			ПараметрыПодготовкиДокумента.Дополнительно);
	ПараметрыПакет.Вставить("НашаОрганизация",		оДокумент.НашаОрганизация);
	ПараметрыПакет.Вставить("Название",				"Ознакомление: " + оДокумент.Название);

	ПараметрыПакет.ДокументОснование.Добавить(ДокОснование);

	СтруктураПакета = МодульТекущий.НовыйСоставПакета(ПараметрыПакет);
	НаборВложений	= МодульТекущий.СоставПакета_Получить(оДокумент, "Вложения", Новый ФиксированнаяСтруктура("Служебные", Истина));	
	
	ПараметрыДляФайл = Новый Структура("СоздаватьНовый, ИмяФайла", Истина);

	Для Каждого ВложениеПереслать Из НаборВложений Цикл
		
		Подпись = Новый Массив;
		
		СтруктураВложения = МодульТекущий.НовыйВложениеСБИС(ВложениеПереслать);
		
		Попытка
			
			ИмяФайлаВложение	= ВложениеПереслать.Файл.Имя;
			УрлФайлаВложение	= ВложениеПереслать.Файл.Ссылка;
			
			ПараметрыДляФайл.ИмяФайла	= ИмяФайлаВложение;
			СкачанныйФайлКлиент			= МодульТекущий.СкачатьВФайлПоПараметрам(УрлФайлаВложение, ПараметрыДляФайл);
			оФайл						= Новый Файл(СкачанныйФайлКлиент);
			
			МодульТекущий.ВложениеСБИС_Обновить(СтруктураВложения, оФайл);
			
			МодульТекущий.СоставПакета_Добавить(СтруктураПакета, СтруктураВложения);
			
			Для Каждого ФайлПодписи Из МодульТекущий.ВложениеСБИС_Получить(ВложениеПереслать, "Подписи") Цикл
				СсылкаНаФайлПодписи	= ФайлПодписи.Файл.Ссылка;
				ИмяФайлаПодписи		= ФайлПодписи.Файл.Имя;
				
				Если Найти(ИмяФайлаПодписи, ИмяФайлаВложение) Тогда
					
					ПараметрыДляФайл.ИмяФайла	= ИмяФайлаПодписи;
					СкачанныйФайлПодписиКлиент	= МодульТекущий.СкачатьВФайлПоПараметрам(СсылкаНаФайлПодписи, ПараметрыДляФайл);
					оФайлПодписи				= Новый Файл(СкачанныйФайлПодписиКлиент);
					
					ОписаниеФайлаПодписи = Новый Структура("Имя, ПолноеИмяФайла", оФайлПодписи.Имя, оФайлПодписи.ПолноеИмя);
					
					Подпись.Добавить(Новый Структура("Файл, Направление", ОписаниеФайлаПодписи, "Внешняя"));
					
				КонецЕсли;
				
			КонецЦикла;

		Исключение
			
			ОшибкаСохранения = МодульТекущий.НовыйСбисИсключение(ИнформацияОбОшибке(), "ФормаПересылкиПакетов.ПодготовитьСтруктуруДокумента");
			ВызватьИсключение МодульТекущий.СбисИсключение_ВСтроку(ОшибкаСохранения);
			
		КонецПопытки;
		
		Если Подпись.Количество() Тогда
			
			МодульТекущий.ВложениеСБИС_Обновить(СтруктураВложения, Новый Структура("Подпись", Подпись));

		КонецЕсли;
		
	КонецЦикла;		
	
	МассивПакетов.Добавить(СтруктураПакета);
	Возврат МассивПакетов;
	
КонецФункции

&НаКлиенте
Процедура ПереслатьПакеты_Начало()
	
   	Если Не ЗначениеЗаполнено(Получатель) Тогда
		Сообщить("Не выбран получатель!");
		Возврат;
	КонецЕсли;
	
	Если Не СписокДокументов.Количество() Тогда
		
		Сообщить("Нет отмеченных документов для пересылки!");
		Возврат;
		
	КонецЕсли;

	ДанныеСторонПрочитать = Новый Массив;
	ДанныеСторонПрочитать.Добавить(Получатель);
	
	ДанныеСторон	= МодульОбъектаКлиент().ПрочитатьСтороныПоДанным1С(ДанныеСторонПрочитать);
	СтруктураИННКПП	= ДанныеСторон.Получить(Получатель);
	Если СтруктураИННКПП.Свойство("Ошибка") Тогда
		
		МодульОбъектаКлиент().СообщитьСбисИсключение(СтруктураИННКПП.Ошибка);
		Возврат;
		
	КонецЕсли; 
	
	СтруктураИННКПП = СтруктураИННКПП.Результат;
	
	ДанныеКОтправке = Новый Массив;
	Для Каждого Строка Из СписокДокументов Цикл
		
		ДанныеКОтправке.Добавить(Новый Структура("ИдентификаторСБИС", Строка.Значение.ИдСБИС));
		
    КонецЦикла;
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ИспользоватьНовуюОтправку") Тогда
		
		ПереслатьПакеты_НовыйВариант(ДанныеКОтправке, СтруктураИННКПП);
		
	Иначе
		
		ПереслатьПакеты_СтарыйВариант(ДанныеКОтправке, СтруктураИННКПП);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПереслатьПакеты_СтарыйВариант(ДанныеКОтправке, СтруктураИННКПП)
	
	Всего =  СписокДокументов.Количество();
	сч=0;
 	ВремКаталог = КаталогВременныхФайлов();
	ВремКаталог = ВремКаталог + "ПересылкаСБИС\";
	Каталог = Новый Файл(ВремКаталог);
	Если Не Каталог.Существует() Тогда
		СоздатьКаталог(ВремКаталог);
	КонецЕсли;
	ГлавноеОкно = МестныйКэш.ГлавноеОкно;

	МассивПакетов = Новый Массив;
	МассивФайловДляУдаления = Новый Массив;
		

	Кэш = МестныйКэш;
	ПараметрыДляПрочитать = Новый Структура("НужныСлужебные", Истина);
	Для Каждого Строка из СписокДокументов Цикл

		сч=сч+1;
		
		Кэш.ГлавноеОкно.сбисПоказатьСостояние("Формирование электронных документов", Кэш.ГлавноеОкно,Мин(100,Окр(сч*100/Всего)));
		
		ОписаниеДокумент = Новый ФиксированнаяСтруктура("Идентификатор", Строка.Значение.ИдСБИС);
		
		Попытка
			
			оДокумент = МодульОбъектаКлиент().ПрочитатьДокументСБИС(ОписаниеДокумент, ПараметрыДляПрочитать);
			
		Исключение
			
			ИмяИнтерации	= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ИнтеграцияИмя");
			МодульОбъектаКлиент().СбисСообщить(ИнформацияОбОшибке(), "ФормаПересылкиПакетов.ПереслатьПакеты");
			
		КонецПопытки;
		
		ПараметрыПодготовить = Новый Структура("ДокументСБИС, Дополнительно", оДокумент, СтруктураИННКПП);
		СтруктураПакета = ПодготовитьСтруктуруДокумента(ПараметрыПодготовить, МестныйКэш);
		Если СтруктураПакета = Неопределено Тогда 
			
			Продолжить;
			
		КонецЕсли;
		
		МассивПакетов.Добавить(СтруктураПакета);
	КонецЦикла;	
	ВремяНачала = МодульОбъектаКлиент().ПолучитьДатуВМиллисекундах();	
	РезультатОтправки = Новый Структура("ТипыОшибок,Отправлено,НеОтправлено,НеСформировано,Ошибок,ДетализацияОшибок,ВсегоПакетов,ОшибкиДоОтправки,ДанныеПоСтатусам,ПорНомер,КоличествоСвободныхПотоков,ОтправкаИзПересылки,ОтправленоСообщений,ПолученоОтветов,ВремяНачала,ВремяФормирования,ВремяОтправки,ДетализацияОтправки,ВремяЗаписиСтатусов,ВремяПолученияДанных,ВремяОжиданияОтвета, СформированныеПакеты", Новый СписокЗначений,0,0,0,0, Новый Соответствие,0,0,Новый Массив,0,30,Истина,0,0,ВремяНачала,0,0, Новый Соответствие,0,0,0, Новый Соответствие);
	РезультатОтправки.Вставить("НаЗаписьСтатусов", Новый Структура("Ошибки, Ответы", Новый Соответствие, Новый Соответствие));
	МестныйКэш.Вставить("РезультатОтправки",РезультатОтправки);
	ГлавноеОкно.сбисПолучитьФорму("Документ_Шаблон").ОтправитьПодготовленныеПакетыДокументы(МестныйКэш, МассивПакетов);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПереслатьПакеты_НовыйВариант(ДанныеКОтправке, СтруктураИННКПП)
	
	СписокКОтправке = Новый Массив;
	
	ПараметрыЗавершить			= Новый Структура("Кэш", МестныйКэш);
	ОбработчикРезультатОтправки	= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ПереслатьПакеты_Завершение", ЭтаФорма, ПараметрыЗавершить);

	ДопПараметрыОтправки = Новый Структура("ОбработчикРезультата", ОбработчикРезультатОтправки);

	ОперацииВыполнить = Новый СписокЗначений;
	ОперацииВыполнить.Добавить(Новый Структура("Операция, НужныСлужебные", "Пересылка", Истина),				"ПрочитатьДокумент");
	ОперацииВыполнить.Добавить(Новый Структура("МодульПодготовки, Дополнительно", ЭтаФорма, СтруктураИННКПП),	"БазоваяОтправка");
	Для Каждого Строка Из СписокДокументов Цикл
		
		// Главное окно должно сообщить что требуется проверить документ на черновик
		СтрокаДобавить = Новый Структура("ИдентификаторСБИС", Строка.Значение.ИдСБИС); 
		СтрокаДобавить.Вставить("Сценарии",	ОперацииВыполнить);			
	
		СписокКОтправке.Добавить(СтрокаДобавить);

	КонецЦикла;
	
	МодульОбъектаКлиент().ЗапуститьМассовуюОтправкуДокументов(СписокКОтправке, ДопПараметрыОтправки);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПереслатьПакеты_Завершение(АргументЗавершить, ДопПараметры) Экспорт 
	
	фрм = МестныйКэш.ГлавноеОкно.сбисНайтиФормуФункции("ПоказатьРезультатОтправки", "ФормаРезультатОтправки","");
	фрм.ПоказатьРезультатОтправки(МестныйКэш);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтправки(Кэш) Экспорт
// Если есть ошибки отправки, то выводим результат, иначе закрываем просмотр 	
	УдалитьСохраненныеВложения();
	Если ЭтаФорма.Открыта() Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСохраненныеВложения() Экспорт
	Попытка
		УдалитьФайлы(ВремКаталог);
	Исключение
		Ошибка=ОписаниеОшибки();
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Функция СформироватьСтруктуруПакетов(оДокумент,МассивВложений,МассивПодписей)Экспорт
	СтруктураПакета = Новый Структура;
	СтруктураПакета.Вставить("Вложение",Новый Массив);
	СтруктураПакета.Вставить("НашаОрганизация", Новый Структура);
	СтруктураПакета.Вставить("Контрагент", Новый Структура);
	СтруктураПакета.Вставить("Тип","КоррИсх");
	СтруктураПакета.Вставить("ДокументОснование",Новый Массив);
	СтруктураПакета.Вставить("Дата",Формат(ТекущаяДата(),"ДЛФ=Д"));
	ДокОснование = Новый Структура;
	ДокОснование.Вставить("Идентификатор",оДокумент.Идентификатор);
	ДокОснование.Вставить("ВидСвязи","Переслать");
	СтруктураПакета.ДокументОснование.Добавить(ДокОснование);
	ИНН="";
	КПП=Неопределено;
	
	ДанныеСторонПрочитать = Новый Массив;
	ДанныеСторонПрочитать.Добавить(Получатель);
	ДанныеСторон	= МодульОбъектаКлиент().ПрочитатьСтороныПоДанным1С(ДанныеСторонПрочитать);
	СтруктураИННКПП	= ДанныеСторон.Получить(Получатель);
	Если СтруктураИННКПП.Свойство("Ошибка") Тогда
		МодульОбъектаКлиент().СообщитьСбисИсключение(СтруктураИННКПП.Ошибка);
		Возврат Ложь;
	КонецЕсли;
	СтруктураПакета.Контрагент = СтруктураИННКПП.Результат;
	
	Если оДокумент.НашаОрганизация.Свойство("СвЮЛ") Тогда
		СтруктураПакета.НашаОрганизация.Вставить("СвЮЛ",оДокумент.НашаОрганизация.СвЮЛ);
	Иначе
		СтруктураПакета.НашаОрганизация.Вставить("СвФЛ",оДокумент.НашаОрганизация.СвФЛ);
	КонецЕсли;
	сч = 0;
	Для Каждого оФайл из МассивВложений Цикл
		НайденнаяПодпись = "";
		Подпись = Новый Массив;
		СтруктураВложения = Новый Структура;
		СтруктураВложения.Вставить("ИмяФайла",оФайл.Имя);
		СтруктураВложения.Вставить("ПолноеИмяФайла",оФайл.ПолноеИмя);
		СтруктураВложения.Вставить("Тип",оДокумент.Вложение[сч].Тип);
		СтруктураВложения.Вставить("ПодТип",оДокумент.Вложение[сч].Подтип);
		СтруктураВложения.Вставить("ВерсияФормата",оДокумент.Вложение[сч].ВерсияФормата);
		СтруктураВложения.Вставить("ПодВерсияФормата",оДокумент.Вложение[сч].ПодВерсияФормата);
		СтруктураВложения.Вставить("Название",оДокумент.Вложение[сч].Название);
		Если оДокумент.Вложение[сч].Свойство("Зашифрован") и оДокумент.Вложение[сч].Зашифрован="Да" Тогда
			СтруктураВложения.Вставить("Зашифрован",оДокумент.Вложение[сч].Зашифрован);	
		КонецЕсли;
		СтруктураПакета.Вложение.Добавить(СтруктураВложения);
		// для вложения ищем файлы подписей
		Для Каждого оПодпись из МассивПодписей Цикл
			Если Найти(оПодпись.ИмяБезРасширения,оФайл.Имя)>0 Тогда
				Подпись.Добавить(Новый Структура("Файл,Направление",Новый Структура("Имя,ПолноеИмяФайла",оПодпись.Имя,оПодпись.ПолноеИмя),"Внешняя"));
			КонецЕсли;	
		КонецЦикла;	
		Если МассивПодписей.Количество()>0 Тогда
			СтруктураВложения.Вставить("Подпись",Подпись);
		КонецЕсли;	
		сч = сч+1;
	КонецЦикла;		
	
	Возврат СтруктураПакета;
Конецфункции	

&НаКлиенте	
Функция СписокВложенийДляЗаписиНаДиск(оДокумент) Экспорт
	
	МассивВложенийКЗаписи = Новый Массив;
	
КонецФункции

&НаКлиенте	
Функция СохранитьВложенияНаДиск(НаборВложений) Экспорт
	МассивСохраненныхФайлов = Новый Массив;
	
	//перебираем массив вложений
	Для Каждого Вложение Из НаборВложений Цикл
		
		СсылкаНаФайл = Вложение.Файл.Ссылка;
		ИмяФайла = ВремКаталог+Вложение.Файл.Имя;
		
		Рез = МестныйКэш.Интеграция.СохранитьВложениеПоСсылкеВФайл(МестныйКэш,СсылкаНаФайл,ИмяФайла);
		
		//если хотябы один файл не сохранен, то отправки не будет
		Если Рез=Ложь или Рез=Неопределено Тогда
			Возврат Новый Массив;
		КонецЕсли;	
		оФайл = Новый Файл(ИмяФайла);
		МассивСохраненныхФайлов.Добавить(оФайл); 
		
	КонецЦикла;
		
	Возврат МассивСохраненныхФайлов;
	
КонецФункции

&НаКлиенте	
Функция СохранитьПодписиНаДиск(оДокумент)Экспорт
		
	МассивПодписей = Новый Массив;
	//перебираем массив вложений
	Для Каждого Вложение из оДокумент.Вложение Цикл
		//перебор файлов подписей
		Если Вложение.Свойство("Подпись") Тогда
			сч=1;
			Для Каждого ФайлПодписи из Вложение.Подпись Цикл
				СсылкаНаФайл = ФайлПодписи.Файл.Ссылка;
				ИмяФайла = ВремКаталог+ФайлПодписи.Файл.Имя;
				//избежание перезаписи файлов, если имена файлов подписей одинаковые
				тмпФайл = Новый Файл(ИмяФайла);
				Если тмпФайл.Существует() Тогда
					ИмяФайла = тмпФайл.Путь+тмпФайл.ИмяБезрасширения+"."+строка(сч)+тмпФайл.Расширение;
					сч=сч+1;
				КонецЕсли;
				Рез = МестныйКэш.Интеграция.СохранитьВложениеПоСсылкеВФайл(МестныйКэш,СсылкаНаФайл,ИмяФайла);
	 			оФайл = Новый Файл(ИмяФайла);
				МассивПодписей.Добавить(оФайл); 
			КонецЦикла;	  
		КонецЕсли;	
	КонецЦикла;	
	Возврат МассивПодписей;
КонецФункции
	
