
#Область includr_core2_vo2_СистемныеИнтерфейсы_ИнтерфейсныйМодуль
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_СбисЗаблокироватьИнтерфейс
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_СбисРазблокироватьИнтерфейс
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_ОбработкаОповещения
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_ПередЗакрытиемОбработчик
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_ПриОткрытииОбработчик
#КонецОбласти

#Область include_core2_vo2_Формы_ФормаПросмотрДокументов
#КонецОбласти 

// Функция открывает форму и заполняет все данные на ней	
&НаКлиенте
Функция ПоказатьДокументы(Кэш, МассивПакетов) Экспорт
	
	Показать(Новый Структура("МассивПакетов", МассивПакетов));
	
КонецФункции

&НаКлиенте
Процедура ОтправитьНажатие(Команда)
	
	// Процедура отправляет список выбранных пакетов документ
	МассивПодготовленныхПакетов = Новый Массив;
	Для Каждого СтрокаТаблицы из СписокПакетов Цикл
		Если СтрокаТаблицы.Отмечен Тогда
			МассивПодготовленныхПакетов.Добавить(СтрокаТаблицы.пакет[0].значение);
		КонецЕсли;
	КонецЦикла;
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();			
	Кэш.Вставить("РезультатОтправки", Новый Структура("ТипыОшибок,Отправлено,НеОтправлено,НеСформировано,Ошибок,ДетализацияОшибок,ВсегоПакетов,ОшибкиДоОтправки,ДанныеПоСтатусам,ПорНомер,КоличествоСвободныхПотоков,ФормаОтправки,ОтправленоСообщений,ПолученоОтветов,ВремяНачала,ВремяФормирования,ВремяОтправки,ДетализацияОтправки,ВремяЗаписиСтатусов,ВремяПолученияДанных,ВремяОжиданияОтвета, СформированныеПакеты", Новый СписокЗначений,0,0,0,0,Новый Соответствие,0,0,Новый Массив,0,30,"ФормаПросмотрДокументов",0,0,ВремяНачала,0,0, Новый Соответствие,0,0,0, Новый Соответствие));
	Кэш.РезультатОтправки.Вставить("НаЗаписьСтатусов", Новый Структура("Ошибки, Ответы", Новый Соответствие, Новый Соответствие));
	
	МодульОбъектаКлиент().ПолучитьФормуОбработки("Документ_Шаблон").ОтправитьПодготовленныеПакетыДокументы(Кэш, МассивПодготовленныхПакетов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтправки(Кэш) Экспорт

	Если Кэш.РезультатОтправки.НеОтправлено Тогда  // если есть ошибки при отправке, показываем окно результатов

		ПараметрыПоказать = Новый ФиксированнаяСтруктура("Владелец", ЭтаФорма);
		МодульОбъектаКлиент().МассоваяОперация_Показать(Кэш.РезультатОтправки, ПараметрыПоказать)
		
	Иначе    // если отправилось без ошибок, закрываем окно просмотра
		
		ОбновлятьГлавноеОкно = Истина;
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПакетовВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	КоманднаяПанельСписокПакетовПросмотр(неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельСписокПакетовПросмотр(Команда)

	Если МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "СписокПакетов").ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПолныйСоставПакета = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "СписокПакетов").ТекущиеДанные.пакет[0].значение;
	Если ПолныйСоставПакета.Свойство("Вложение") Тогда
		Для Каждого Элемент Из ПолныйСоставПакета.Вложение Цикл
			Если Элемент.Свойство("XMLДокумента") И ЗначениеЗаполнено(Элемент.XMLДокумента) Тогда
				ТекстHTML = Кэш.Интеграция.ПолучитьHTMLПоXML(Кэш, Элемент);
			Иначе
				ТекстHTML = "";
			КонецЕсли;
			Элемент.Вставить("ТекстHTML",ТекстHTML);
		КонецЦикла;
		фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПоказатьДокумент", "ФормаПросмотрДокумента","", Кэш); 
		ДопПараметры = Новый Структура;  
		ДопПараметры.Вставить("ПакетнаяОтправка", Истина);
		фрм.ПоказатьДокумент(Кэш,ПолныйСоставПакета, ДопПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	ОтметитьВсе = Не ОтметитьВсе;
	Для Каждого Пакет из СписокПакетов Цикл
		Пакет.Отмечен= ОтметитьВсе;
	конеццикла;
КонецПроцедуры

// Обновляет контент на главном окне.
&НаКлиенте
Процедура ПриЗакрытииОбработчик(ЗавершениеРаботы)

	ФормаГлавногоОкна = Кэш.ГлавноеОкно;
	Если ФормаГлавногоОкна.Открыта() и ОбновлятьГлавноеОкно = Истина Тогда
		ФормаГлавногоОкна.ОбновитьКонтент();
	КонецЕсли;
	
	фрм = ФормаГлавногоОкна.сбисНайтиФормуФункции("сбисПослеЗакрытияФормыПросмотра","РаботаСДокументами1С","", Кэш);
	Если фрм<>Ложь Тогда
		фрм.сбисПослеЗакрытияФормыПросмотра(Кэш); 
	КонецЕсли;
	
	ПриЗакрытииТиповойОбработчик(ЗавершениеРаботы);
		
КонецПроцедуры
