
#Область includr_core2_vo2_СистемныеИнтерфейсы_ИнтерфейсныйМодуль
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_СбисЗаблокироватьИнтерфейс
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_СбисРазблокироватьИнтерфейс
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_ОбработкаОповещения
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_ПриЗакрытииОбработчик
#КонецОбласти

&НаКлиенте
Функция сбисЭлементФормы(Форма,ИмяЭлемента)
	Если Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		Возврат Форма.Элементы.Найти(ИмяЭлемента);
	КонецЕсли;
	Возврат Форма.ЭлементыФормы.Найти(ИмяЭлемента);
КонецФункции

&НаКлиенте
Функция сбисПолучитьСтраницу(Элемент, ИмяСтраницы)
	Если Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		Возврат Элемент.ПодчиненныеЭлементы[ИмяСтраницы];
	КонецЕсли;
	Возврат Элемент.Страницы[ИмяСтраницы];
КонецФункции

////////////////////////////////
///////внутренние функции///////

// Процедура заполняет реквизиты формы из кэша	
&НаКлиенте
Процедура ЗагрузитьПараметрыАвторизации()

	ЗапомнитьПароль		= МодульОбъектаКлиент().ПолучитьПараметрПользователя("ЗапомнитьПароль");
	ЗапомнитьСертификат	= МодульОбъектаКлиент().ПолучитьПараметрПользователя("ЗапомнитьСертификат");
	Логин				= МодульОбъектаКлиент().ПолучитьПараметрПользователя("Логин");
	
	ПараметрыФормы.Вставить("ВходПоСертификату", МодульОбъектаКлиент().ПолучитьПараметрПользователя("ВходПоСертификату"));

	Если ЗапомнитьПароль Тогда
		
		Пароль = МодульОбъектаКлиент().ПолучитьПараметрПользователя("Пароль");
		
	Иначе 
		
		Пароль = "";
		
	КонецЕсли;
	
	Если ЗапомнитьСертификат Тогда
		
		Сертификат = МодульОбъектаКлиент().ПолучитьПараметрПользователя("Сертификат");
		
	Иначе
		
		Сертификат = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыОткрытия = Неопределено)
	
	ЗагрузитьПараметрыАвторизации();
	
	Если ПараметрыФормы.ВходПоСертификату Тогда
		
		ОбновитьСписокСертификатов();
		
	КонецЕсли;	
	
	ОбновитьОтображение = Истина;
	Если МодульОбъектаКлиент().ЭтоТипСбис(ПараметрыОткрытия, "СбисИсключение") Тогда
		
		Авторизоваться_ОбработатьОшибку(ПараметрыОткрытия);
		ОбновитьОтображение = Ложь;
		
	ИначеЕсли	ЗначениеЗаполнено(ПараметрыОткрытия)
			И	ПараметрыОткрытия.Свойство("Режим")
			И	ПараметрыОткрытия.Режим = "Старт" Тогда
			
		// Ошибка при старте обработки. Обработать только если это не ошибка незаполненных параметров.
		Если Не ПараметрыОткрытия.Ошибка.code = 785 Тогда
			
			Авторизоваться_ОбработатьОшибку(ПараметрыОткрытия.Ошибка);
			ОбновитьОтображение = Ложь;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Если ОбновитьОтображение Тогда 
		
		сбисОбновитьОтображение(Новый Структура("ТекстОшибки", ""));
		
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьНастройкиСоединения() Экспорт
	
	фрм = Кэш.ГлавноеОкно.СбисПолучитьФорму("ФормаНастройки", , , ЭтаФорма);

	ПараметрыПослеНастройки = Новый Структура("СпособОбмена, СпособХраненияНастроек, АдресСервера", Кэш.Парам.СпособОбмена, Кэш.Парам.СпособХраненияНастроек, Кэш.СБИС.АдресСервера);
	ДопПараметрыОткрыть		= Новый Структура("Отложенно", Истина);
	
	лОбработчикЗавершения = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("сбисПослеНастройкиСоединения", ЭтаФорма, ПараметрыПослеНастройки);
	фрм.ОписаниеОповещенияОЗакрытии = лОбработчикЗавершения;
	фрм.ПоказатьПоверх(Новый Структура("РежимЗапуска, Кэш", "НастройкиСоединения", Кэш), ДопПараметрыОткрыть);
	
КонецПроцедуры

// Процедура - сохраняет параметры авторизации в кэш
//
&НаКлиенте
Процедура СохранитьПараметрыАвторизации()
	
	Если ПараметрыФормы.ВходПоСертификату Тогда
		
		ЗапомнитьПароль = Ложь;
		
	Иначе
		
		ЗапомнитьСертификат = Ложь;
		
	КонецЕсли;
	
	МодульОбъектаКлиент().ИзменитьПараметрСбис("ЗапомнитьПароль",		ЗапомнитьПароль);
	МодульОбъектаКлиент().ИзменитьПараметрСбис("ЗапомнитьСертификат",	ЗапомнитьСертификат);
	МодульОбъектаКлиент().ИзменитьПараметрСбис("ВходПоСертификату",		ПараметрыФормы.ВходПоСертификату);
 	МодульОбъектаКлиент().ИзменитьПараметрСбис("Логин",					Логин);
	
	Если ЗапомнитьПароль Тогда
		
		МодульОбъектаКлиент().ИзменитьПараметрСбис("Пароль", Пароль);
		
	Иначе
		
		МодульОбъектаКлиент().ИзменитьПараметрСбис("Пароль", "");

	КонецЕсли;
	
	Если ЗапомнитьСертификат Тогда
		
		ВыбранныйСертификат	= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "СписокСертификатов").ТекущиеДанные;
		
		Если Не ВыбранныйСертификат = Неопределено Тогда
			
			// Сертификат не выставлялся, ничего не меняем.
			ВыбранныйСертификат = ВыбранныйСертификат.Значение.Отпечаток;
			МодульОбъектаКлиент().ИзменитьПараметрСбис("Сертификат", ВыбранныйСертификат);
			
		КонецЕсли;
		
	Иначе
		
		МодульОбъектаКлиент().ИзменитьПараметрСбис("Сертификат", "");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СбисОбновитьОтображение(ПараметрыОтображения)
	ПоказатьРежимВхода			= Истина;
	ПоказатьРежимВходаПоЛогину  = Истина;
	ПоказатьПанельАвторизации	= Истина;
	ПараметрПроверить			= Неопределено;
	СтрокаЗаголовок				= "Войти на " + МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ПредставлениеСервера");
		//Каталог - не авторизуемся на online, просто нажать на кнопку входа.	
	Если 	Кэш.Парам.СпособОбмена = 1 Тогда
		ПоказатьРежимВхода = Ложь;
		ПоказатьРежимВходаПоЛогину = Ложь;
		ПоказатьПанельАвторизации = Ложь;
		СтрокаЗаголовок = "Работа через каталог";
	КонецЕсли;
	Если ПараметрыОтображения.Свойство("ТекстОшибки", ПараметрПроверить) Тогда
		ОшибкаАвторизации = ПараметрПроверить;
	КонецЕсли;
	СбисЭлементФормы = сбисЭлементФормы(ЭтаФорма,"ПоТокену");
	Если Не СбисЭлементФормы = Неопределено Тогда
		СбисЭлементФормы.Видимость =(	(	Кэш.Парам.СпособОбмена = 3 И Не Кэш.Парам.ИнтеграцияAPIВызовыНаКлиенте)
										Или	Кэш.Парам.СпособОбмена = 4 
										Или	Кэш.Парам.СпособОбмена = 5
										Или Кэш.Парам.СпособОбмена = 6
										Или Кэш.Парам.СпособОбмена = 7);
	КонецЕсли;
	сбисЭлементФормы(ЭтаФорма,"РежимВхода").Видимость = ПоказатьРежимВходаПоЛогину;
	сбисЭлементФормы(ЭтаФорма,"РежимВхода1").Видимость = ПоказатьРежимВхода;
	сбисЭлементФормы(ЭтаФорма,"РежимВходаПоСертификату").Видимость = ПоказатьРежимВхода;
	сбисЭлементФормы(ЭтаФорма,"РежимВходаПоСертификату1").Видимость = ПоказатьРежимВхода;
	ЭтаФорма.Заголовок = СтрокаЗаголовок;
	
	ПанельДанныеАвторизации = сбисЭлементФормы(ЭтаФорма,"ПанельДанныеАвторизации");
	Если Не ПоказатьПанельАвторизации Тогда
		//"Скрываем" панель авторизации.
		сбисЭлементФормы(ЭтаФорма,"ЗапомнитьСертификат").Видимость = Ложь;
		ПанельДанныеАвторизации.ТекущаяСтраница = сбисПолучитьСтраницу(ПанельДанныеАвторизации,"ПоСертификату");
		СписокСертификатов.Очистить();
	ИначеЕсли ПараметрыФормы.ВходПоСертификату Тогда 
		сбисЭлементФормы(ЭтаФорма,"ЗапомнитьСертификат").Видимость = Истина;
		ПанельДанныеАвторизации.ТекущаяСтраница = сбисПолучитьСтраницу(ПанельДанныеАвторизации,"ПоСертификату");
	Иначе		
		ПанельДанныеАвторизации.ТекущаяСтраница = сбисПолучитьСтраницу(ПанельДанныеАвторизации,"ПоПаролю");
		ЭтаФорма.ТекущийЭлемент = ПанельДанныеАвторизации;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СбисПослеНастройкиСоединения(АргументПослеИзменения, ДопПараметры = Неопределено) Экспорт
	
	Если АргументПослеИзменения = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	РезультатИзменения	= АргументПослеИзменения.ПараметрыНовые;
	ПараметрыНастройки	= АргументПослеИзменения.ПараметрыБыли;
	
	ОбновитьОтображение = Истина;
	ПараметрыОтображения = Новый Структура;
	
	Если РезультатИзменения.СпособОбмена = 1 Тогда  
		
		//Закрываем форму авторизации, как было раньше
		ФормаЗакрытьУстановитьСтатусОк("Ok", Истина);
		
	КонецЕсли;
	
	Если	Не ПараметрыНастройки.СпособОбмена = РезультатИзменения.СпособОбмена
		Или	Не ПараметрыНастройки.АдресСервера = РезультатИзменения.АдресСервера Тогда 
		ЭлементТокен = СбисЭлементФормы(ЭтаФорма, "ПоТокену");
		
		Если Не ЭлементТокен = Неопределено Тогда
			ЭлементТокен.Видимость = (	Кэш.Парам.СпособОбмена=3 
									Или Кэш.Парам.СпособОбмена=4 
									Или Кэш.Парам.СпособОбмена=5
									Или Кэш.Парам.СпособОбмена=6
									Или Кэш.Парам.СпособОбмена=7);
		КонецЕсли;
								
		//Изменился способ обмена	
		Если ПараметрыФормы.ВходПоСертификату Тогда
			
			ОбновитьОтображение = Ложь;
			ОбновитьСписокСертификатов();
			
		Иначе
			
			ПараметрыОтображения.Вставить("ТекстОшибки", "");
			
		КонецЕсли;
	КонецЕсли; 
	
	Если ОбновитьОтображение Тогда
		
		сбисОбновитьОтображение(ПараметрыОтображения);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет список сертификатов
&НаКлиенте
Процедура ОбновитьСписокСертификатов()
	ТекстОшибки = "";
	СписокСертификатов.Очистить();
	Если Не МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ОбменВключен") Тогда
		Ошибка = Новый Структура("code, message, details", 100, "Не включен обмен с Saby", "Сертификаты не найдены. Выберите способ обмена в настройках соединения.");
		Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, Ошибка, Новый Структура("ФормаВладелец, Отправлять", ЭтаФорма, Ложь));
		ТекстОшибки = Ошибка.message;
	КонецЕсли;
	
	//Получим список
	Если ТекстОшибки = "" Тогда
		СписокСертификатовСырой = Кэш.Интеграция.ПолучитьСписокСертификатовДляАвторизации(Кэш, ТекстОшибки);
	КонецЕсли;
	Если	ТекстОшибки = ""
		И	Не	ЗначениеЗаполнено(СписокСертификатовСырой) Тогда
		ТекстОшибки = "Сертификаты не найдены";
	КонецЕсли;
	//Сортируем сертификаты
	Если ТекстОшибки = "" Тогда
		ПараметрыСортировки = Новый Структура("ПоляСортировки", Новый Массив);
		ПараметрыСортировки.ПоляСортировки.Добавить(Новый Структура("Поле,Направление", "ДействителенПо",	"Убыв"));
		ПараметрыСортировки.ПоляСортировки.Добавить(Новый Структура("Поле,Направление", "Квалифицированный","Возр"));
		СписокСертификатов = Кэш.ОбщиеФункции.сбисОтсортироватьОбъект(СписокСертификатовСырой,ПараметрыСортировки, Ложь);
	КонецЕсли;
	ПараметрыОтображения = Новый Структура;
	Если Не ТекстОшибки = "" Тогда
		ПараметрыОтображения.Вставить("ТекстОшибки", ТекстОшибки);	
	КонецЕсли;	
	СбисОбновитьОтображение(ПараметрыОтображения);
КонецПроцедуры

////////////////////////////////
//////////события формы/////////

&НаКлиенте
Процедура КнопкаВойтиНажатие(Кнопка)

	ПараметрыАвторизоваться = Новый Структура("Режим");
	Если		МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ВходПотокену") = Истина Тогда
		
		ПараметрыАвторизоваться.Режим = "ПоТокену";
		
	ИначеЕсли	ПараметрыФормы.ВходПоСертификату  Тогда
		
		ВыбранныйСертификат = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "СписокСертификатов").ТекущиеДанные;
		Если ВыбранныйСертификат = Неопределено Тогда
			
			ОшибкаАвторизации = "Выберите сертификат для авторизации";
			Возврат;
			
		КонецЕсли;
		
		ВыполнитьАвторизацию_Сертификат(ВыбранныйСертификат.Значение);
		Возврат;
		
	Иначе
		
		ПараметрыАвторизоваться.Режим = "ПоЛогинуПаролю";
		ПараметрыАвторизоваться.Вставить("Логин",	Логин);
		ПараметрыАвторизоваться.Вставить("Пароль",	Пароль);
		
	КонецЕсли;

	ВыполнитьАвторизацию(ПараметрыАвторизоваться);
	
	ПараметрыАвторизоваться.Очистить();
	
КонецПроцедуры

// Процедура открывает окно настройки соединения	
&НаКлиенте
Процедура НастройкаСоединенияНажатие(Элемент)
	ИзменитьНастройкиСоединения();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПриИзменении(Элемент)
	
	МодульОбъектаКлиент().ИзменитьПараметрПользователя(Элемент.Имя,  ЭтаФорма[Элемент.Имя]);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемОбработчик(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ПередЗакрытиемТиповойОбработчик(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);	
	
	Если ЗавершениеРаботы Тогда
		
		Возврат;
		
	ИначеЕсли Не ПараметрыФормы.РежимЗакрытия = "ОК" Тогда//Если на кнопку не нажимали, то результат авторизации должен быть неопределен.
		
		ФормаЗакрытьУстановитьСтатусОк();
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииОбработчик(Отказ)
	
	Если ПараметрыФормы = Неопределено Тогда
		
		// На случай устаревшего вызова формы, минуя штатные механизмы Показать/ПоказатьПоверх
		ДопПараметры = Новый Структура("Инициировать", Истина);
		ФормаУстановитьОбщее(,ДопПараметры);
		СбисУстановитьФорму();
		
	КонецЕсли;
	
	Если Не Кэш.СБИС.ОбменВключен Тогда
		
		ИсключениеОбмен = МодульОбъектаКлиент().НовыйСбисИсключение("Не включен обмен с SABY.", "ФормаАвторизация.ПриОткрытииОбработчик");
		СобытиеРазрывСвязи = МодульОбъектаКлиент().НовыйАсинхронноеСбисСобытие("Disconnected", ИсключениеОбмен, "CriticalError");
		МодульОбъектаКлиент().АсинхронноеСбисСобытие_ВызватьСобытиеПоПодписке(СобытиеРазрывСвязи);
		
	КонецЕсли;
	
	ПриОткрытииТиповойОбработчик(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОткрытия()
	
	ИзменитьНастройкиСоединения();
	//Костыль на случай, если открыто предупреждение и его закрывает окно настройки
	ФормаПредупреждение = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаПредупреждения");
	Если ФормаПредупреждение.Открыта() Тогда
		ФормаПредупреждение.Активизировать();
	КонецЕсли;
	
КонецПроцедуры

// Функция переключает варианты авторизации По сертификату/По паролю	
&НаКлиенте
Процедура РежимВходаПоПаролюПриНажатии(Элемент)

	ПараметрыФормы.Вставить("ВходПоСертификату", Ложь);

	сбисОбновитьОтображение(Новый Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимВходаПоСертификатуПриНажатии(Элемент)
	
	ПараметрыФормы.Вставить("ВходПоСертификату", Истина);

	ОбновитьСписокСертификатов();
	
	//Если 1 сертификат и вход по сертификату, то авторизоваться и закрыть форму
	Если СписокСертификатов.Количество() = 1 Тогда
		
		ОтложенноАвторизовать = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ВыполнитьАвторизацию_Сертификат", ЭтаФорма);
		МодульОбъектаКлиент().ПодключитьОтложенноеДействие(ОтложенноАвторизовать, СписокСертификатов[0].Значение);
		
	КонецЕсли;
	
КонецПроцедуры

//Процедура вызывает авторизацию при выборе сертификата	
&НаКлиенте
Процедура СписокСертификатовВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	ВыбранныйСертификат = Элемент.ТекущиеДанные.Значение;
	ВыполнитьАвторизацию_Сертификат(ВыбранныйСертификат);
	
КонецПроцедуры

////////////////////////////////
////двухфакторная авторизация///

//Функция выполняет авторизацию на онлайне по сертификату или по логину/паролю	
&НаКлиенте
Функция Авторизоваться(ПараметрыАвторизации = Неопределено) Экспорт
	Перем ПараметрыДляАвторизоваться;
	
	ОшибкаАвторизации = "";  
	
	Если МодульОбъектаКлиент().ЭтоТипСбис(ПараметрыАвторизации, "ЛокальныйКэш") Тогда
		
		ПараметрыДляАвторизоваться = ПараметрыАвторизации.Парам;
		
	Иначе
		
		ПараметрыДляАвторизоваться = ПараметрыАвторизации;
		
	КонецЕсли;
	
	Попытка
		
		МодульОбъектаКлиент().АвторизоватьсяВSABY(ПараметрыДляАвторизоваться);
		Возврат Истина;
		
	Исключение
		
		лОшибкаАвторизации = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "ФормаАвторизации.Авторизоваться");
	    Авторизоваться_ОбработатьОшибку(лОшибкаАвторизации);
		Возврат Ложь;
			
	КонецПопытки;

КонецФункции

&НаКлиенте
Процедура Авторизоваться_ОбработатьОшибку(ОшибкаАвторизацииВходящая)
	Перем ПараметрыПодтверждения;
	
	ПараметрыОбновления = Новый Структура("ТекстОшибки", "");
	Если ОшибкаАвторизацииВходящая.code = 303 Тогда
		
		ПараметрыОбновления.ТекстОшибки = ОшибкаАвторизацииВходящая.message;
		Если ОшибкаАвторизацииВходящая.Свойство("data", ПараметрыПодтверждения) Тогда
			
			ПараметрыПодтверждения	= ПараметрыПодтверждения.addinfo;
			
		КонецЕсли;
		
		ОбработчикПодтвердить = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("Авторизация_ПодтвердитьВход", ЭтаФорма);
		МодульОбъектаКлиент().ПодключитьОтложенноеДействие(ОбработчикПодтвердить, ПараметрыПодтверждения);
		
	ИначеЕсли ОшибкаАвторизацииВходящая.code = 412 Тогда
		
		ИзменитьНастройкиСоединения();

	ИначеЕсли ОшибкаАвторизацииВходящая.code = 775 Тогда // Не получен ответ от SABY плагина
		
		ОшибкаАвторизацииВходящая.details = "Перезагрузите SABY плагин";
		ПараметрыОбновления.ТекстОшибки = "Не получен ответ от SABY плагина. " + ОшибкаАвторизацииВходящая.details;
		Кэш.ГлавноеОкно.сбисСообщитьОбошибке(Кэш, ОшибкаАвторизацииВходящая, Новый Структура("ФормаВладелец, Отправлять", ЭтаФорма, Ложь));
		
	Иначе
		
		ПараметрыОбновления.ТекстОшибки = ОшибкаАвторизацииВходящая.details;
		Кэш.ГлавноеОкно.сбисСообщитьОбошибке(Кэш, ОшибкаАвторизацииВходящая, Новый Структура("ФормаВладелец, Отправлять", ЭтаФорма, Ложь));
		
	КонецЕсли;
	
	сбисОбновитьОтображение(ПараметрыОбновления);//Обновим элементы на случай, если поменялся адрес сервера и переключились на резерв	
	
КонецПроцедуры

//Процедура вызывает автризацию с выбранными параметрами
&НаКлиенте
Процедура ВыполнитьАвторизацию(ПараметрыАвторизации) 
	
	Если Авторизоваться(ПараметрыАвторизации) Тогда
		Авторизация_Завершение(Новый Структура("ИдентификаторСессии", Кэш.Парам.ИдентификаторСессии));
	КонецЕсли;
	
КонецПроцедуры	

//Процедура вызывает авторизацию при выборе сертификата	
&НаКлиенте
Процедура ВыполнитьАвторизацию_Сертификат(ВыбранныйСертификат, ДопПараметры = Неопределено) Экспорт
	
	ПараметрыАвторизации = Новый Структура("Режим, Сертификат", "ПоСертификату", ВыбранныйСертификат.Отпечаток);

    ВыполнитьАвторизацию(ПараметрыАвторизации);
	
КонецПроцедуры

//Процедура вызывает авторизацию при выборе сертификата	
&НаКлиенте
Процедура ВыполнитьАвторизацию_Токен(ПараметрыВходящие = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	ПараметрыАвторизации = Новый Структура("Режим", "ПоТокену");
	
    ВыполнитьАвторизацию(ПараметрыАвторизации);
	
КонецПроцедуры

//Процедура вызывает подтверждение входа по СМС
&НаКлиенте
Процедура Авторизация_ПодтвердитьВход(ПараметрыПодтверждения, ДопПараметры) Экспорт
	
	Отказ = Ложь;
	РезультатОтправки = Кэш.Интеграция.ОтправитьКодАвторизации(Кэш, ПараметрыПодтверждения, Отказ);
	Если Отказ Тогда
		ОшибкаАвторизации = РезультатОтправки.message; 
		Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, РезультатОтправки, Новый Структура("ФормаВладелец, Отправлять", ЭтаФорма, Ложь));
		Возврат;
	КонецЕсли;
	ДополнительныеПараметрыЗавершения = Новый Структура("ПараметрыОперации", ПараметрыПодтверждения);
	ПараметрыВвода = Новый Структура("ЗаголовокВвода, Заголовок, Режим","Код подтверждения", "Для входа введите полученный код из СМС.", "ВводКодаАвторизации");
	
	ФормаВвода = Кэш.ГлавноеОкно.сбисПолучитьФорму("ФормаВводаПинкода",,,ЭтаФорма);
	ФормаВвода.ОписаниеОповещенияОЗакрытии = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("Авторизация_Завершение", ЭтаФорма, ДополнительныеПараметрыЗавершения);
	ФормаВвода.ПоказатьПоверх(ПараметрыВвода);
	
КонецПроцедуры

//Процедура проверяет выполнение авторизации на онлайне и в случае успеха закрывает окно авторизации.
&НаКлиенте
Процедура Авторизация_Завершение(Результат, ДополнительныеПараметры=Неопределено) Экспорт
	Перем ИдентификаторСессии;
	
	Если	ЗначениеЗаполнено(Результат) Тогда
		Если		Результат.Свойство("ИдентификаторСессии", ИдентификаторСессии) Тогда
			//Просто берем переданный СИД
		ИначеЕсли	Результат.Свойство("ПинКод") Тогда 
			//Проверяем полученный код из СМС, если все ок, то берем СИД, если нет то пользователю нужно повторно авторизоваться для получения нового кода и показа формы. Согласование 1175952857.
			Отказ = Ложь;
			РезультатВвода = Кэш.Интеграция.ПодтвердитьАвторизацию(Кэш, Результат, ДополнительныеПараметры.ПараметрыОперации, Отказ);
			Если Отказ Тогда
				ОшибкаАвторизации = РезультатВвода.message; 
				Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, РезультатВвода, Новый Структура("ФормаВладелец, Отправлять", ЭтаФорма, Ложь));
			Иначе
				ИдентификаторСессии = РезультатВвода;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ИдентификаторСессии) Тогда 
		
		МодульОбъектаКлиент().ИзменитьПараметрСбис("ИдентификаторСессии", ИдентификаторСессии);

		Если Открыта() Тогда
			
			СохранитьПараметрыАвторизации();
			
			ФормаЗакрытьУстановитьСтатусОк(ИдентификаторСессии);
			ЭтаФорма.Закрыть(ИдентификаторСессии);
			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВойтиПоТокену(Команда)
	
	ВыполнитьАвторизацию_Токен();

КонецПроцедуры
