
#Область includr_core2_vo2_СистемныеИнтерфейсы_ИнтерфейсныйМодуль
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_СбисЗаблокироватьИнтерфейс
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_СбисРазблокироватьИнтерфейс
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_ОбработкаОповещения
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_ПриОткрытииОбработчик
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_ПередЗакрытиемОбработчик
#КонецОбласти

&НаСервере
Функция ТекстНовостиПоУмолчанию()
	
	Возврат МодульОбъектаСервер().ПолучитьМакетОбработкиНаСервере("Новости", Новый Структура("Текст", Истина));
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииОбработчик(ЗавершениеРаботы)
	
	Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
		
		ЭтаФорма.ВладелецФормы.сбисПослеПросмотраНовости(Показывать);
		
	КонецЕсли;
	

	ПриЗакрытииТиповойОбработчик(ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура СбисУстановитьФорму(ПараметрыУстановить = Неопределено)
	
	Кэш = ЭтаФорма.ВладелецФормы.Кэш;
	
	Показывать = Кэш.ПараметрыСистемы.Обработка.Версия <> Кэш.Парам.ПрочитаннаяНовость;
	
	СформироватьТекстНовости(); 
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьТекстНовости()

	ТекстНовости = ТекстНовостиПоОдномуФайлу();
	
	Если ТекстНовости = "" Тогда
		
		ТекстНовости = ТекстНовостиПоДвумФайлам();
		
	КонецЕсли;
	
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(Новый ФиксированнаяСтруктура("Форма, Реквизит", ЭтаФорма, "НовостьHTML"),
														Новый ФиксированнаяСтруктура("HTML", ТекстНовости))	

КонецПроцедуры

&НаКлиенте
Функция ТекстНовостиПоОдномуФайлу()
	
	СбисПараметрыФайла = Кэш.ОбщиеФункции.сбисПараметрыСервисаОбновления(Кэш);
	СбисПараметрыФайла.Вставить("Таймаут", 3);
	СбисПараметрыФайла.URL = СбисПараметрыФайла.URL_General + "1c_vo2_news.html";
		
	Попытка
		
		ИмяФайла		= МодульОбъектаКлиент().СкачатьВФайлПоПараметрам(СбисПараметрыФайла);
		ТекстНовости	= МодульОбъектаКлиент().ПрочитатьФайлКлиент(ИмяФайла, Новый ФиксированнаяСтруктура("Кодировка", "UTF-8"));
		
	Исключение
		
		ОшибкаПолученияНовости	= МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "ФормаНовости.СформироватьТекстНовости");
		ТекстНовости			= "";
		
	КонецПопытки;
	
	Возврат ТекстНовости;
	
КонецФункции 

&НаКлиенте
Функция ТекстНовостиПоДвумФайлам()

	СбисПараметрыФайла = Кэш.ОбщиеФункции.сбисПараметрыСервисаОбновления(Кэш);
	СбисПараметрыФайла.URL	= СбисПараметрыФайла.URL_General + "new_versions_changelog.html";
	ПараметрыЧтенияМакета	= Новый ФиксированнаяСтруктура("Кодировка", "UTF-8");
	ОсновнойТекст			= ТекстНовостиПоУмолчанию();

	ИмяФайла						= МодульОбъектаКлиент().СкачатьВФайлПоПараметрам(СбисПараметрыФайла);
	ТекстНовостиАктуальныхВерсий	= МодульОбъектаКлиент().ПрочитатьФайлКлиент(ИмяФайла, ПараметрыЧтенияМакета);
		
	ОсновнойТекст = СтрЗаменить(ОсновнойТекст, "%NEW_VERSIONCHANGELOG%", ТекстНовостиАктуальныхВерсий);
	
	// Получаем полезные ссылки
	СбисПараметрыФайла.URL = СбисПараметрыФайла.URL_General + "useful_links.html";

	ИмяФайла			= МодульОбъектаКлиент().СкачатьВФайлПоПараметрам(СбисПараметрыФайла);
	ТекстПолезныеСсылки	= МодульОбъектаКлиент().ПрочитатьФайлКлиент(ИмяФайла, ПараметрыЧтенияМакета);
	
	ОсновнойТекст = СтрЗаменить(ОсновнойТекст, "%USEFUL_LINKS%", ТекстПолезныеСсылки);
	
	Возврат ОсновнойТекст;
	
КонецФункции
