
// Процедура - возвращает выбранное значение
&НаКлиенте
Процедура Отправить(Кнопка = Неопределено)  
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
		Если ЭтаФорма.ВозвращаемоеЗначение = "ПолеВвода" Тогда
			АргументЗакрытия =  ЭтаФорма.ПолеВвода;
			ФормаЗакрытьУстановитьСтатусОк(ЭтаФорма.ПолеВвода);
		Иначе
			АргументЗакрытия =  Элементы.ТаблицаВыбораСписка.ТекущиеДанны;
			ФормаЗакрытьУстановитьСтатусОк(Элементы.ТаблицаВыбораСписка.ТекущиеДанны);
		КонецЕсли;
	#Иначе
		Если ПараметрыФормы.Параметры.Свойство("ПолеВвода") Тогда
			АргументЗакрытия = ЭтаФорма.ЭлементыФормы.ПолеВвода.Значение;
			ФормаЗакрытьУстановитьСтатусОк(ЭтаФорма.ЭлементыФормы.ПолеВвода.Значение);
		Иначе
			АргументЗакрытия = ЭлементыФормы.ТаблицаВыбораСписка.ТекущиеДанны;
			ФормаЗакрытьУстановитьСтатусОк(ЭлементыФормы.ТаблицаВыбораСписка.ТекущиеДанны);
		КонецЕсли;
	#КонецЕсли
	ЭтаФорма.Закрыть(АргументЗакрытия);

КонецПроцедуры       

// Процедура - Создает таблицу для выбора из списка
// 
// Параметры:
//  ЗначенияВыбора - ТаблицаЗначений - значения для вывода в списке
//
&НаСервере
Процедура СоздатьТаблицуВыбораИзСписка(ЗначенияВыбора)
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
		
		// Добавить реквизит таблицы значений
		МассивДобавляемыхРеквизитов = Новый Массив;
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ТаблицаВыбораСписка", Новый ОписаниеТипов("ТаблицаЗначений")));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Значение", Новый ОписаниеТипов("Строка") ,"ТаблицаВыбораСписка","Значение"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Представление", Новый ОписаниеТипов("Строка") ,"ТаблицаВыбораСписка","Значение"));
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		// Вывести таблицу на форму
		ТаблицаНаФорме = ЭтаФорма.Элементы.Добавить("ТаблицаВыбораСписка", Тип("ТаблицаФормы"));
		ТаблицаНаФорме.ПутьКДанным = "ТаблицаВыбораСписка";
		ТаблицаНаФорме.Отображение = ОтображениеТаблицы.Список;
		ТаблицаНаФорме.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		
		НоваяКолонка = ЭтаФорма.Элементы.Добавить("ТаблицаВыбораСпискаПредставление", Тип("ПолеФормы"), ТаблицаНаФорме);
		НоваяКолонка.ПутьКДанным = "ТаблицаВыбораСписка.Представление";
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.МногострочныйРежим = Истина;
		НоваяКолонка.Ширина = 15;   
		
		НоваяКолонка = ЭтаФорма.Элементы.Добавить("ТаблицаВыбораСпискаЗначение", Тип("ПолеФормы"), ТаблицаНаФорме);
		НоваяКолонка.ПутьКДанным = "ТаблицаВыбораСписка.Значение";
		НоваяКолонка.Видимость = Ложь;
		
		// Заполнить данными
		ТаблицаЗнач = Новый ТаблицаЗначений;
		ТаблицаЗнач.Колонки.Добавить("Значение", Новый ОписаниеТипов("Строка"));
		ТаблицаЗнач.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
		
		Для каждого Элемент Из ЗначенияВыбора Цикл
			
			Строка = ТаблицаЗнач.Добавить();
			Строка.Значение = Элемент.Значение; 
			Строка.Представление = Элемент.Представление;
			
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(ТаблицаЗнач, "ТаблицаВыбораСписка");
		
		Команда = ЭтаФорма.Команды.Добавить("Выбрать");
		Команда.Действие = "Отправить";
		Команда.Заголовок = "Выбрать";
		
		Элемент1 = ЭтаФорма.Элементы.Добавить("Выбрать", Тип("КнопкаФормы"), ЭтаФорма);
		Элемент1.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		Элемент1.ИмяКоманды = "Выбрать";
		
	#Иначе
		
		// Вывести таблицу на форму
		ТабличноеПоле  = ЭтаФорма.ЭлементыФормы.Добавить(Тип("ТабличноеПоле"), "ТаблицаВыбораСписка", Истина);
		
		НоваяКолонка = ТаблицаНаФорме.Колонки.Добавить("Значение");
		ТаблицаНаФорме.Колонки.Добавить("Представление");
		
		ЭлементыФормы.ТаблицаВыбораСписка.Данные = "ТаблицаНаФорме";
		
		ЭлементыФормы.ТаблицаВыбораСписка.Верх = 10;
		ЭлементыФормы.ТаблицаВыбораСписка.Лево = 10;
		ЭлементыФормы.ТаблицаВыбораСписка.Ширина = 380;
		ЭлементыФормы.ТаблицаВыбораСписка.Высота = 450;
		
		ЭлементыФормы.ТаблицаВыбораСписка.ТолькоПросмотр = Ложь;
		ЭлементыФормы.ТаблицаВыбораСписка.ИзменятьПорядокСтрок = Истина;
		ЭлементыФормы.ТаблицаВыбораСписка.ИзменятьСоставСтрок = Истина;
		ЭлементыФормы.ТаблицаВыбораСписка.СоздатьКолонки();
		
		ЭлементыФормы.ТаблицаВыбораСписка.Колонки.Значение.Видимость = Ложь;
		ЭлементыФормы.ТаблицаВыбораСписка.Колонки.Представление.ВысотаЯчейки = 4;
		
		Для каждого Элемент Из ЗначенияВыбора Цикл
			Строка = ТаблицаНаФорме.Добавить();
			Строка.Значение = Элемент.Значение; 
			Строка.Представление = Элемент.Представление;
		КонецЦикла;
		
		Команда = ЭтаФорма.ЭлементыФормы.Добавить(Тип("Кнопка"), "Выбрать", Истина);
		Команда.Заголовок = "Выбрать";
		Команда.Лево = 10;
		Команда.Верх = 470;
		Команда.Ширина = 100;
		Команда.Высота = 20;
		Команда.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
		Команда.УстановитьПривязку(ГраницаЭлементаУправления.Право);
		Действие = Новый Действие("Отправить");
		Команда.УстановитьДействие("Нажатие", Действие);
	#КонецЕсли
	
КонецПроцедуры  

// Процедура - Создает поле ввода
&НаСервере
Процедура СоздатьПолеВвода() 
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
		
		МассивДобавляемыхРеквизитов = Новый Массив;
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПолеВвода", Новый ОписаниеТипов("Строка"), "", "Поле комментария"));
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);   
		
		ЭтаФорма.Ширина = 35;
		ЭтаФорма.АвтоЗаголовок = Ложь;
		
		ПолеВвода = Элементы.Добавить("ПолеВвода", Тип("ПолеФормы"), ЭтаФорма); 
		ПолеВвода.ПутьКДанным = "ПолеВвода";
		ПолеВвода.Заголовок="Комментарий"; 
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.МногострочныйРежим = Истина;
		ПолеВвода.Ширина = 15;
		
		Команда = ЭтаФорма.Команды.Добавить("Выбрать");
		Команда.Действие = "Отправить";
		Команда.Заголовок = "Отправить";
		
		Элемент1 = ЭтаФорма.Элементы.Добавить("Выбрать", Тип("КнопкаФормы"), ЭтаФорма);
		Элемент1.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		Элемент1.ИмяКоманды = "Выбрать"; 
	#Иначе
		ПараметрыФормы.Вставить("ИзмененияФормы", Новый Структура);
		ПараметрыФормы.ИзмененияФормы.Вставить("Ширина", 370);
		ПараметрыФормы.ИзмененияФормы.Вставить("Высота", 150);
		ПолеВвода = ЭтаФорма.ЭлементыФормы.Добавить(Тип("ПолеВвода"), "ПолеВвода", Истина); 
		ПолеВвода.Лево = 10;
		ПолеВвода.Верх = 10;
		ПолеВвода.Ширина = 350;
		ПолеВвода.Высота = 100;
		ПолеВвода.МногострочныйРежим = Истина;
		
		Команда = ЭтаФорма.ЭлементыФормы.Добавить(Тип("Кнопка"), "Выбрать", Истина);
		Команда.Заголовок = "Отправить";
		Команда.Лево = 120;
		Команда.Верх = 120;
		Команда.Ширина = 100;
		Команда.Высота = 20;
		Команда.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
		Команда.УстановитьПривязку(ГраницаЭлементаУправления.Право);
		Действие = Новый Действие("Отправить");
		Команда.УстановитьДействие("Нажатие", Действие);
		
	#КонецЕсли
	
КонецПроцедуры 

// Процедура - определяет что генерируется на ОФ
&НаСервере
Процедура СбисУстановитьФорму(Параметры = Неопределено)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ПараметрыФормы.Вставить("Параметры", Параметры);
		Если Параметры.Свойство("ПолеВвода") Или Параметры = Неопределено Тогда 
			СоздатьПолеВвода();
		ИначеЕсли Параметры.Свойство("СписокВыбора") Тогда
			СоздатьТаблицуВыбораИзСписка(Параметры.ТаблицаЗначений);
		КонецЕсли;  
	#Иначе	
		МассивДобавляемыхРеквизитов = Новый Массив;
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВозвращаемоеЗначение", Новый ОписаниеТипов("Строка")));
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		Если Параметры.Свойство("ПолеВвода") Или Параметры = Неопределено Тогда 
			ЭтаФорма.ВозвращаемоеЗначение = "ПолеВвода";
			СоздатьПолеВвода();
		ИначеЕсли Параметры.Свойство("СписокВыбора") Тогда
			ЭтаФорма.ВозвращаемоеЗначение = "СписокВыбора";
			СоздатьТаблицуВыбораИзСписка(Параметры.ТаблицаЗначений);
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии()
	Если ПараметрыФормы.Свойство("ИзмененияФормы") Тогда
		Для каждого Элемент Из ПараметрыФормы.ИзмененияФормы Цикл
			ЭтаФорма[Элемент.Ключ] =  Элемент.Значение;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

