
#Область include_core2_vo2_Формы_ФормаСопоставитьСДокументами1С_public
#КонецОбласти

#Область include_core2_vo2_Формы_ФормаСопоставитьСДокументами1С_private
#КонецОбласти

#Область include_core2_vo2_Формы_ФормаСопоставитьСДокументами1С_Интерфейс
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_СбисЗаблокироватьИнтерфейс
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_СбисРазблокироватьИнтерфейс
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_ОбработкаОповещения
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_ПриОткрытииОбработчик
#КонецОбласти

#Область include_core2_vo2_СистемныеИнтерфейсы_Формы_ИнтерфейсныйМодуль_Перегрузка_ПриЗакрытииОбработчик
#КонецОбласти

//требуется из-за применения фильтра
&НаСервере
Функция ЗаполнитьКопиюТаблицыСопоставления(СбисПараметрыСистемы)
	Если СбисПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		ТаблицаСопоставленияДокументовКопия.Загрузить(ТаблицаСопоставленияДокументов.Выгрузить());
	Иначе
		ТаблицаСопоставленияДокументовКопия = ТаблицаСопоставленияДокументов.Скопировать();
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция СбисЭтоДубльВложения(ТаблицаСопоставленияДокументов,СтрокаДокумента)
	Если Не ТаблицаСопоставленияДокументов.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	ОтборДляПоискаДублей = Новый Структура;
	ОтборДляПоискаДублей.Вставить("Номер",				СтрокаДокумента.Номер);
	ОтборДляПоискаДублей.Вставить("ДатаДокумента",		СтрокаДокумента.Дата);
	ОтборДляПоискаДублей.Вставить("ТипВерсияВложения",	СтрокаДокумента.ТипВерсияВложения);
	ОтборДляПоискаДублей.Вставить("ОрганизацияИНН",		?(СтрокаДокумента.НашаОрганизация.Свойство("СвЮЛ"),СтрокаДокумента.НашаОрганизация.СвЮЛ.ИНН,?(СтрокаДокумента.НашаОрганизация.Свойство("СвФЛ"),СтрокаДокумента.НашаОрганизация.СвФЛ.ИНН,"")));
	ОтборДляПоискаДублей.Вставить("ОрганизацияКПП",		?(СтрокаДокумента.НашаОрганизация.Свойство("СвЮЛ"),СтрокаДокумента.НашаОрганизация.СвЮЛ.КПП,""));
	ОтборДляПоискаДублей.Вставить("КонтрагентИНН",		?(СтрокаДокумента.Контрагент.Свойство("СвЮЛ"),СтрокаДокумента.Контрагент.СвЮЛ.ИНН,?(СтрокаДокумента.Контрагент.Свойство("СвФЛ"),СтрокаДокумента.Контрагент.СвФЛ.ИНН,"")));
	ОтборДляПоискаДублей.Вставить("КонтрагентКПП",		?(СтрокаДокумента.Контрагент.Свойство("СвЮЛ"),СтрокаДокумента.Контрагент.СвЮЛ.КПП,""));
	
	НайденныеСтроки  =  ТаблицаСопоставленияДокументов.НайтиСтроки(ОтборДляПоискаДублей);
	Возврат ?(НайденныеСтроки.Количество()>0,Истина,Ложь);
КонецФункции

//не используется, возможно в дальнейшем потребуется выводить на форме итогов текстовые подписи, не стала удалять
&НаКлиенте
Функция ОпределитьОкончание(Значение, Корень, Окончание1, Окончание2, Окончание3)
	// Функция определяет окончание в нужном падеже для надписей с количеством документов	
	Если Число(Прав(Значение,2))>=10 и Число(Прав(Значение,2))<20 Тогда
		Возврат Корень+Окончание3;		
	ИначеЕсли Прав(Значение, 1)="1" Тогда 
		Возврат Корень+Окончание1;	
	ИначеЕсли Прав(Значение, 1)="2" или Прав(Значение, 1)="3" или Прав(Значение, 1)="4" Тогда 
		Возврат Корень+Окончание2;	
	Иначе
		Возврат Корень+Окончание3;	
	КонецЕсли;
КонецФункции

// Массив документов с данными, необходимыми для сопоставления
&НаКлиенте
Функция ПодготовитьСписокДокументовКСопоставлению(СписокОтмеченныхДокументов) Экспорт
	
	ГлавноеОкно							= Кэш.ГлавноеОкно;
	фрмСтатусы							= ГлавноеОкно.сбисНайтиФормуФункции("НайтиДокументы1СПоИдВложенияСБИС", Кэш.ФормаРаботыСоСтатусами, "", Кэш);
	СписокДокументовДляСопоставления	= Новый Массив; //документ1С,guidсбис,дата,номер,сумма,тип1С,Контрагент,Огранизация,Сумма1С,название документа СБИС

	ЕстьМеркурий	= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("Меркурий");
	ТекущийРеестр	= Кэш.Текущий.ТипДок;
			
	Всего	= СписокОтмеченныхДокументов.Количество();
	сч		= 0;
	Для Каждого Строка из СписокОтмеченныхДокументов Цикл
		сч = сч + 1;
		ГлавноеОкно.сбисПоказатьСостояние("Формируем список документов для сопоставления", ГлавноеОкно, Мин(100,Окр(сч*100/Всего)));   
		
		СоставПакета = Строка.Значение.СоставПакета[0].Значение;
		
		НаличиеВложений = ЗначениеЗаполнено(МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "Вложение"));
	
		Если Не НаличиеВложений Тогда
			
			СоставПакета = МодульОбъектаКлиент().ПрочитатьДокументСБИС(СоставПакета); 
			
			ДопПоля = Новый Структура("Вложение", СоставПакета.Вложение); 
			МодульОбъектаКлиент().СоставПакета_Обновить(Строка.Значение.СоставПакета[0].Значение, Новый Структура("ДопПоля", ДопПоля));  
			
		КонецЕсли;  
	
		ВложенияПакета = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "Вложения");    
		
		Если НЕ ЗначениеЗаполнено(ВложенияПакета) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Для Каждого Вложение Из ВложенияПакета Цикл
			
			РеквизитыДляПоиска	= Новый Структура();
			СтрокаДобавлена		= Ложь;
			Попытка
				Ини = МодульОбъектаКлиент().ИниПоПараметрам(Новый Структура("Вложение", Вложение)); 	
			Исключение
				Продолжить;
			КонецПопытки;
			Если Не ЗначениеЗаполнено(Ини) Тогда
				Продолжить;
			КонецЕсли;

			ТипВерсияВложения	= МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "ТипВерсияВложения");
			Если Не Вложение.Свойство("Документы1С") Тогда // реестры документов отдельных типов (например, акт сверки)
				ДанныеДокумента1С = фрмСтатусы.НайтиДокументы1СПоИдВложенияСБИС(Строка.Значение.СоставПакета[0].Значение.Идентификатор, Вложение.Идентификатор, Кэш.Ини, Кэш.Парам.КаталогНастроек);
				Вложение.Вставить("Документы1С", Новый СписокЗначений);
				Если ЗначениеЗаполнено(ДанныеДокумента1С) Тогда
					Вложение.Документы1С = ДанныеДокумента1С.Ссылки;
				КонецЕсли;
			КонецЕсли;
			фрм = ГлавноеОкно.сбисНайтиФормуФункции("ПолучитьРеквизитыДокумента","Файл_" + ТипВерсияВложения,"Файл_Шаблон",Кэш);
			фрм.ПолучитьРеквизитыДокумента(Кэш, Ини, РеквизитыДляПоиска, Вложение, Строка.Значение);
			РеквизитыДляПоиска.Вставить("ТипВерсияВложения",	ТипВерсияВложения);
			РеквизитыДляПоиска.Вставить("Ини",					Ини);
			СписокДокументовДляСопоставления.Добавить(РеквизитыДляПоиска);  
			
		КонецЦикла; 
		
	КонецЦикла;
	
	Если ЕстьМеркурий Тогда
        //Для Меркурия требуется дополнить из загрузочных инишек под раздел типы поддерживаемых документов 1С
		ПараметрыИни	= Новый Структура("ТипСБИС, ТипИни", ТекущийРеестр, "Загрузка");
		ИниЗагрузки		= МодульОбъектаКлиент().ИниПоПараметрам(ПараметрыИни);
		Если ИниЗагрузки.Количество() Тогда 
			фрмРеквизиты = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("ПолучитьРеквизитыДокумента","Файл_Шаблон");
			
			ДополнительныеТипы1СОтРеестра	= Новый Массив;
			ДополнительныеСтроки			= Новый Массив;
			Для Каждого КлючИЗначениеИниЗагрузки Из ИниЗагрузки Цикл
				Для Каждого РазделДокумента Из КлючИЗначениеИниЗагрузки.Значение.мДокумент Цикл
					Если Не РазделДокумента.Значение.Свойство("Документ") Тогда
						
						Продолжить;
						
					КонецЕсли;
					ДополнитыйТипДобавить = Сред(РазделДокумента.Значение.Документ.Значение, Найти(РазделДокумента.Значение.Документ.Значение,".") + 1);
					Если ДополнительныеТипы1СОтРеестра.Найти(ДополнитыйТипДобавить) = Неопределено Тогда
						ДополнительныеТипы1СОтРеестра.Добавить();
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			Для Каждого ТипСопоставления Из СписокДокументовДляСопоставления Цикл

				Если	ТипСопоставления.ТипСБИС = ТекущийРеестр Тогда
					//Если документ текущего реестра, то расширить допустимые типы
					Для Каждого  ДопТип1С Из ДополнительныеТипы1СОтРеестра цикл
						Если	ТипСопоставления.Типы1С.НайтиПоЗначению(ДопТип1С) = Неопределено Тогда 
							ТипСопоставления.Типы1С.Добавить(ДопТип1С);
						КонецЕсли;
					КонецЦикла;
				Иначе
					//Добавить новую строку для отдельной обработки сопоставления.
					Для Каждого КлючИЗначениеИниЗагрузки Из ИниЗагрузки Цикл
						
						РеквизитыДляПоиска = Новый Структура("ТипВерсияВложения", "");
						фрмРеквизиты.ПолучитьРеквизитыДокумента(Кэш, КлючИЗначениеИниЗагрузки.Значение, РеквизитыДляПоиска, Неопределено, ТипСопоставления.СоставПакета);
						РеквизитыДляПоиска.Вставить("Ини",			КлючИЗначениеИниЗагрузки.Значение);
						РеквизитыДляПоиска.Вставить("НазваниеСБИС", ТипСопоставления.СоставПакета.Название);
						
						Если Не  ЗначениеЗаполнено(РеквизитыДляПоиска.Документы1С) Тогда
							
							ДанныеДокумента1С = фрмСтатусы.НайтиДокументы1СПоИдВложенияСБИС(ТипСопоставления.СоставПакета.Идентификатор, "", Кэш.Ини, Кэш.Парам.КаталогНастроек);
							Если ЗначениеЗаполнено(ДанныеДокумента1С) Тогда
								РеквизитыДляПоиска.Документы1С = ДанныеДокумента1С.Ссылки;
							КонецЕсли;
							
						Конецесли;
						ДополнительныеСтроки.Добавить(РеквизитыДляПоиска);
						
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			Для Каждого ДопСтрока Из ДополнительныеСтроки Цикл
				СписокДокументовДляСопоставления.Добавить(ДопСтрока);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	сбисСпрятатьСостояние(ГлавноеОкно);
	Возврат СписокДокументовДляСопоставления;
	
КонецФункции

// Функция возвращает тип и версию вложения	
&НаКлиенте
Функция ОпределитьТипВложения(Вложение)
	
	Если	Вложение.Свойство("Тип")	Тогда
		Возврат Вложение.Тип + "_3_01";
	Иначе//aa.uferov раскоментировал для задач. Отсутствует поле типа для вложений. 
		Если		СтрЧислоВхождений(нрег(Вложение.Название), "накладная") Тогда
			Возврат "ЭДОНакл_3_01";
		ИначеЕсли	СтрЧислоВхождений(нрег(Вложение.Название), "фактура")
				И	СтрЧислоВхождений(нрег(Вложение.Название), "счет")	Тогда
			Возврат "СчФктр_3_01";
		ИначеЕсли	СтрЧислоВхождений(нрег(Вложение.Название), "акт №") Тогда
			Возврат "АктВр_3_01";
		ИначеЕсли	СтрЧислоВхождений(нрег(Вложение.Название), "счет на")
				Или	СтрЧислоВхождений(нрег(Вложение.Название), "заказ")	Тогда
			Возврат "Заказ_3_01";	
		КонецЕсли;
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Расчет данных в колонках Дельта и Сумма
&НаКлиенте
Процедура РассчитатьДельтуИСуммуДокумента1С(СтрокаТаблицыДокументов)
	
	Если СтрокаТаблицыДокументов.СопоставлениеОпределено = Ложь
		Тогда Возврат;
	КонецЕсли;
	
	СуммаДокумента1С = 0;
	Если ЗначениеЗаполнено(СтрокаТаблицыДокументов.ДанныеДокументов) Тогда 
		
		//Берем сумму по новому         
		СуммаДокумента1С = Число(СтрокаТаблицыДокументов.ДанныеДокументов[0].Значение.СтруктураДокументаПоДанным1С.ТаблДок.ИтогТабл[0].Сумма);
		
	ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицыДокументов.Документ1С) Тогда
		
		ИмяДок = Кэш.ОбщиеФункции.ПолучитьРеквизитМетаданныхОбъекта(СтрокаТаблицыДокументов.Документ1С, "Имя");
		ИниЗагрузки = МодульОбъектаКлиент().ИниПоПараметрам(Новый Структура("Тип1С, ТипИни", ИмяДок, "Загрузка"));
		Для Каждого КлючИЗначениеИни Из ИниЗагрузки Цикл
			Если ТипЗнч(КлючИЗначениеИни.Значение) = Тип("Структура") 
				И КлючИЗначениеИни.Значение.Свойство("мДокумент") 
				И КлючИЗначениеИни.Значение.мДокумент.Свойство(ИмяДок) Тогда 
				ИниЗагрузки = КлючИЗначениеИни.Значение.мДокумент[ИмяДок];
				Прервать;	
			КонецЕсли;
		КонецЦикла;
		
		//ИниЗагрузки = Кэш.ОбщиеФункции.сбисИниЗагрузкиПоДокументу1С(Кэш, СтрокаТаблицыДокументов.Документ1С);
		Попытка
			ИмяРеквизитаСуммы	= Кэш.ОбщиеФункции.сбисИмяРеквизитаСуммыДокумента1С(ИниЗагрузки);
			СуммаДокумента1С	= Кэш.ОбщиеФункции.ПолучитьРеквизитОбъекта(СтрокаТаблицыДокументов.Документ1С, ИмяРеквизитаСуммы); 
			Если иниЗагрузки.Свойство("Документ_СуммаВключаетНДС") 
				И Кэш.ОбщиеФункции.РассчитатьЗначение("Документ_СуммаВключаетНДС", ИниЗагрузки, Кэш) Тогда
				СуммаДокумента1С = СуммаДокумента1С + Кэш.ОбщиеФункции.ПолучитьРеквизитОбъекта(СтрокаТаблицыДокументов.Документ1С, "СуммаНДСДокумента");	
			КонецЕсли;
		Исключение
			//Ошибка расчёта суммы документа
		КонецПопытки;
	КонецЕсли; 
	
	ДельтаСтроки	= Число(СтрокаТаблицыДокументов.Сумма) - СуммаДокумента1С;
	ДельтаСтроки	= ?(ДельтаСтроки < 0, - ДельтаСтроки, ДельтаСтроки);
	СтрокаТаблицыДокументов.СуммаДокумента1С = СуммаДокумента1С; 
	СтрокаТаблицыДокументов.Дельта = ДельтаСтроки;//?(НЕ СтрокаТаблицыДокументов.Документ1С.Пустая(),ДельтаСтроки,0);
	//записать в признак "Есть расхождения" , если дельта не укладывается в допустимую погрешность
	Если ДельтаСтроки > ?( Кэш.Парам.СопоставлениеПоСумме < 0, -Кэш.Парам.СопоставлениеПоСумме, Кэш.Парам.СопоставлениеПоСумме ) Тогда
		СтрокаТаблицыДокументов.ЕстьРасхождение = Истина;
	Иначе
		СтрокаТаблицыДокументов.ЕстьРасхождение = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РассчитатьСуммуДокумента1С(Документ1С, ИмяРеквизитаСуммы)
	
	Попытка
		Возврат Документ1С[ИмяРеквизитаСуммы];
	Исключение
		Возврат 0;
	КонецПопытки;	
	
КонецФункции	

//Только обычные формы
&НаКлиенте
Процедура ТаблицаСопоставленияДокументовПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
// Оформление таблицы сопоставляемых документов	
	//ОформлениеСтроки.Ячейки.Найдено.ОтображатьТекст = Ложь;
	
	ОформлениеСтроки.Ячейки.Найдено.ОтображатьКартинку = Истина;
	Если Число(ДанныеСтроки.Найдено) > 1 Тогда
		ОформлениеСтроки.Ячейки.Найдено.ИндексКартинки = 2;
	Иначе	
		ОформлениеСтроки.Ячейки.Найдено.ИндексКартинки = Число(ДанныеСтроки.НайденоКартинка);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеСтроки.Документ1С) Тогда
		ОформлениеСтроки.Ячейки.Документ1С.Текст = Кэш.ОбщиеФункции.СформироватьНазваниеВходящегоДокумента1С(ДанныеСтроки.Документ1С);
	КонецЕсли;
	Если ДанныеСтроки.Дубль Тогда
		ЦветДубля = Новый Цвет (255,110,110);
		ОформлениеСтроки.ЦветФона = ЦветДубля;
	КонецЕсли;	
	//ОформлениеСтроки.Ячейки.ДокументСБИС.Текст = ДанныеСтроки.ДокументСБИС[0].Представление;
	фрм = МодульОбъектаКлиент().ПолучитьФормуОбработки("Таблица_РеестрДокументов");
	фрм.ТаблДокПриВыводеСтроки(Кэш, Элемент, ОформлениеСтроки, ДанныеСтроки);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики управления списком, итоги

// Итоги по кнопке "Сумма
&НаКлиенте
Процедура РезультатыСопоставления(Команда)
	
	СтруктураПараметров = РасчетКонтрольныхСумм();
	СтруктураПараметров.Вставить("СохранитьРезультат",Ложь);
	ФормаРезультатыСопоставления = Кэш.ГлавноеОкно.сбисПолучитьФорму("ФормаРезультатыСопоставления"); 
	ФормаРезультатыСопоставления.Показать(Кэш, СтруктураПараметров);

КонецПроцедуры

//для формы по кнопке "Сумма" в панели управления
&НаСервере
Функция РасчетКонтрольныхСумм()
	
	Итоги = Новый Структура();
	СуммаДокументовСБИС = 0;
	СуммаДокументов1С   = 0;
	Дельта				= 0;
	ОднозначноСопоставлено = 0;
	НеоднозначноСопоставлено = 0;
	НеНайденоПодходящих = 0;
	
	МассивОтмеченных = ТаблицаСопоставленияДокументов.НайтиСтроки(Новый Структура("Отмечен", Истина));
	Если МассивОтмеченных.Количество() = 0 Тогда
		Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
			ТаблицаСопоставленияДокументовБезДублей = ТаблицаСопоставленияДокументов.Выгрузить(Новый Структура("Дубль", Ложь));  //d.ch	
		Иначе	
			ТаблицаСопоставленияДокументовБезДублей = ТаблицаСопоставленияДокументов.Скопировать(Новый Структура("Дубль", Ложь));  //d.ch
		КонецЕсли;	
		
		СуммаДокументовСБИС = ТаблицаСопоставленияДокументовБезДублей.Итог("Сумма");
		СуммаДокументов1С = ТаблицаСопоставленияДокументовБезДублей.Итог("СуммаДокумента1С");
		
		ОднозначноСопоставлено = ТаблицаСопоставленияДокументовБезДублей.НайтиСтроки(Новый Структура("СопоставлениеОпределено",Истина)).Количество();
		//по восклицательному знаку
		НеоднозначноСопоставлено = ТаблицаСопоставленияДокументовБезДублей.НайтиСтроки(Новый Структура("НайденоКартинка",2)).Количество();
		//по пустой картинке
		НеНайденоПодходящих = ТаблицаСопоставленияДокументовБезДублей.НайтиСтроки(Новый Структура("НайденоКартинка",0)).Количество();
	Иначе
		Для Каждого ДокументСтрока из ТаблицаСопоставленияДокументов Цикл
			Если ДокументСтрока.Отмечен Тогда
				СуммаДокументовСБИС = СуммаДокументовСБИС + ДокументСтрока.Сумма;
				СуммаДокументов1С   = СуммаДокументов1С   + ДокументСтрока.СуммаДокумента1С;
				ОднозначноСопоставлено = ОднозначноСопоставлено + ?(ДокументСтрока.СопоставлениеОпределено=Истина,1,0);
				//по восклицательному знаку
				НеоднозначноСопоставлено = НеоднозначноСопоставлено + ?(ДокументСтрока.НайденоКартинка=2,1,0);
				//по пустой картинке
				НеНайденоПодходящих = НеНайденоПодходящих + ?(ДокументСтрока.НайденоКартинка=0,1,0);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Дельта = СуммаДокументовСБИС - СуммаДокументов1С;
	Дельта = ?(Дельта<0,-Дельта,Дельта);
	Итоги.Вставить( "Дельта",Дельта );
	Итоги.Вставить( "СуммаДокументов1С",СуммаДокументов1С );
	Итоги.Вставить( "СуммаДокументовСБИС",СуммаДокументовСБИС );
	
	Итоги.Вставить( "ОднозначноСопоставлено", ОднозначноСопоставлено );
	Итоги.Вставить( "НеоднозначноСопоставлено", НеоднозначноСопоставлено );
	Итоги.Вставить( "НеНайденоПодходящих", НеНайденоПодходящих );

	Возврат Итоги;
	
КонецФункции

//дельта больше допустимой погрешности
&НаКлиенте
Процедура ОтметитьСРасхождениями(Команда)
	
	Для Каждого Вложение Из ТаблицаСопоставленияДокументов Цикл
		Если 	Вложение.ЕстьРасхождение 
			И	Вложение.СопоставлениеОпределено Тогда
			 
			Вложение.Отмечен = Истина;
		Иначе
			Вложение.Отмечен = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//дельта отсутствует или меньше допустимой погрешности
&НаКлиенте
Процедура ОтметитьБезРасхождений(Команда)

	Для Каждого Вложение Из ТаблицаСопоставленияДокументов Цикл
		Если 	НЕ Вложение.ЕстьРасхождение 
			И	Вложение.СопоставлениеОпределено Тогда
			 
			Вложение.Отмечен = Истина;
		Иначе
			Вложение.Отмечен = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//снять все отметки
&НаКлиенте
Процедура УдалитьОтметки(Команда)
	ОтметитьВсе = Ложь;
	Для Каждого ДокументСтрока из ТаблицаСопоставленияДокументов Цикл
		ДокументСтрока.Отмечен = Ложь;
	КонецЦикла;
КонецПроцедуры

//только для сохраненных сопоставлений (синяя иконка)
&НаКлиенте
Процедура ОтметитьСопоставленныеНажатие(Команда)
	ОтметитьВсе = Ложь;
	Для Каждого ДокументСтрока из ТаблицаСопоставленияДокументов Цикл
		//Если ДокументСтрока.СопоставлениеОпределено = Истина Тогда
		Если ДокументСтрока.СопоставлениеСохранено = Истина Тогда
			ДокументСтрока.Отмечен = Истина;
		Иначе
			ДокументСтрока.Отмечен = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеПриИзменении(Элемент)
	// Процедура отмечает/снимает отметку со списка документов	
	Для Каждого ДокументСтрока из ТаблицаСопоставленияДокументов Цикл
		ДокументСтрока.Отмечен = ?(ДокументСтрока.Дубль,ДокументСтрока.Отмечен,ОтметитьВсе);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСопоставленияДокументовДокумент1СОтметитьВсеПриИзменении(Элемент)
	ОтметитьВсе = НЕ ОтметитьВсе;
	ОтметитьВсеПриИзменении(Элемент);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Выбор сопоставленного документа

//Выбор документа для сопоставления
&НаКлиенте
Процедура ТаблицаСопоставленияДокументовДокумент1СНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УстановитьОграничениеТипа(Элемент);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьИмяДокумента(ТипДокумента)
	Возврат Метаданные.НайтиПоТипу(ТипДокумента).Имя
КонецФункции

// Процедура устанавливает ограничения типов документов 1С, которые можно выбрать для сопоставления
//
// Параметры:
//  Элемент	 - ПолеФормы - элемент, для которого устанавливаются параметры. 
//  
&НаКлиенте
Процедура УстановитьОграничениеТипа(Элемент) 
		
	Если МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставленияДокументов").ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивТипов = Новый Массив;
	
	Для Каждого Тип1С Из МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставленияДокументов").ТекущиеДанные.Типы1С Цикл
		
		Если Тип1С.Значение<>"''" Тогда 
			
			МассивТипов.Добавить(Тип("ДокументСсылка."+Тип1С.Значение)); 
			
		КонецЕсли; 
		
	КонецЦикла;   
	
	ТипыНовые = Новый ОписаниеТипов(МассивТипов);
	
	Элемент.ОграничениеТипа = ТипыНовые;  
	
	Если МассивТипов.Количество() = 1 Тогда
		
		Элемент.ВыбиратьТип = Ложь;   
		
	Иначе  
		
		Элемент.ВыбиратьТип = Истина; 
		
	КонецЕсли;
	
	ИзмененияВходящие = Новый Структура;
	ИзмененияВходящие.Вставить("УстановитьОграничениеТипа", ТипыНовые);
	ИзмененияВходящие.Вставить("ИзменятьКолонкиТЧ", Ложь); 
	
	ОписаниеИзменитьВходящее = Новый Структура;
	
	ОписаниеИзменитьВходящее.Вставить("Форма", ЭтаФорма);
	ОписаниеИзменитьВходящее.Вставить("Реквизит", "ТаблицаСопоставленияДокументов.Документ1С");
	
	МодульОбъектаКлиент().ИзменитьЭлементФормыОбработки(ОписаниеИзменитьВходящее, ИзмененияВходящие);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСопоставленияДокументовДокумент1СВыбор_Результат(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТабСопДок = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставленияДокументов").ТекущиеДанные;
	
	ТабСопДок.Документ1С = РезультатВыбора;

КонецПроцедуры

// При открытии на просмотр СФ, после закрытия формы документа значение исчезает из таблицы, т.к. при закрытии
// формы СФ вызывается ОповеститьОВыборе, при этом в ВыбранноеЗначение лежит структура, а не ссылка на документ
// Чтобы документ не исчезал, пришлось написать обработку выбора
&НаКлиенте
Процедура ТаблицаСопоставленияДокументовДокумент1СОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;	
	КонецЕсли;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Тип") Тогда
		Попытка
			СтандартнаяОбработка = Ложь;
			ИмяДокумента = ОпределитьИмяДокумента(ВыбранноеЗначение);
			
			оДокумент = сбисЭлементФормы(ЭтаФорма,"ТаблицаСопоставленияДокументов").ТекущиеДанные.СоставПакета[0].Значение;
			ОтборКонтрагент = Кэш.ОбщиеФункции.НайтиКонтрагентаИзДокументаСБИС(Кэш.Ини.Конфигурация,оДокумент.Контрагент);
			Отбор = Новый Структура("Контрагент", ОтборКонтрагент);   
			ПараметрыФормыВыбора 	= Новый Структура("Отбор, РежимВыбора", Отбор, Истина);
			ПараметрыДляФормы		= Новый Структура("ПараметрыФормы", ПараметрыФормыВыбора);
			ОбработкаВыбора			= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ТаблицаСопоставленияДокументовДокумент1СВыбор_Результат", ЭтаФорма);

			ПараметрыВыбораЗначения = Новый Структура("Обработчик, ПараметрыОтбораВыбора", ОбработкаВыбора, ПараметрыДляФормы); 
			МодульОбъектаКлиент().SABYВыбратьЗначение(ВыбранноеЗначение, ПараметрыВыбораЗначения);  
			
		Исключение
			Ошибка = ОписаниеОшибки();
			СтандартнаяОбработка = Истина;
		КонецПопытки	
	КонецЕсли;
КонецПроцедуры

// после выбора докумета 1С необходимо пересчитать сумму и дельту, проставить новую картинку, обновить копию
&НаКлиенте
Функция сбисПослеСопоставленияДокумента(Результат, ПараметрыПослеСопоставления=Неопределено) Экспорт
	
	Если	Результат = Ложь
		Или Результат = Неопределено Тогда
		
		Возврат Неопределено;
		
	КонецЕсли; 
	
	Если ТипЗнч(Результат) = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Результат; //Обычные формы
	Иначе                      
		Результат = Результат.Результат;//Управляемые формы
	КонецЕсли;
		 
	ЭлементТаблицаСопоставленияДокументов = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТаблицаСопоставленияДокументов"); 
	ОтборДляПоискаСтроки = Новый Структура("ДокументСБИСНазвание", Результат.ДокументСБИС);
	ТаблицаСопоставленияДокументов.НайтиСтроки(ОтборДляПоискаСтроки)[0].Документ1С = Результат.Результат;
	ЭлементТаблицаСопоставленияДокументов.ТекущиеДанные.СопоставлениеОпределено	= Истина;
	ЭлементТаблицаСопоставленияДокументов.ТекущиеДанные.НайденоКартинка			= 3;
	
	РассчитатьДельтуИСуммуДокумента1С(ЭлементТаблицаСопоставленияДокументов.ТекущиеДанные);
	ОбновитьЗначенияВКопииТаблицыСопоставления(ЭлементТаблицаСопоставленияДокументов.ТекущиеДанные);
	
КонецФункции

&НаКлиенте
Процедура ТаблицаСопоставленияДокументовВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	ИмяТаблицы				= "ТаблицаСопоставленияДокументов";
	ИмяКолонки				= СтрЗаменить(Колонка.Имя, ИмяТаблицы, "");
	СтандартнаяОбработка	= Ложь;
	СбисТекущиеДанные		= МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, ИмяТаблицы).ТекущиеДанные;
	
	Если		Прав(ИмяКолонки, 12) = "ДокументСБИС" Тогда
		
		Кэш.ГлавноеОкно.ОткрытьДокументОнлайнПоПакету(СбисТекущиеДанные.СоставПакета[0].Значение, Кэш);
		
	ИначеЕсли	Лев(ИмяКолонки, 22) = "СостояниеСопоставления" Тогда
		
		// 0 - Документ сопоставлен
		// 1 - Начать сопоставление
		// 2 - Посмотреть проблемы сопоставления
		Если	СбисТекущиеДанные.СостояниеСопоставления = 4
			Или	СбисТекущиеДанные.СостояниеСопоставления = 3 Тогда
			
			//Т.к. данные сравнения сохранить не можем, то перечитываем при попытке открыть детальную информацию
			Если СбисТекущиеДанные.ДанныеСравнения = Неопределено Тогда
				
				СписокОтмеченныхДокументов = Новый Массив;
				СписокОтмеченныхДокументов.Добавить(СбисТекущиеДанные);
				ВыполнитьСравнениеДокументов(СписокОтмеченныхДокументов, Новый Структура("Владелец", ЭтаФорма));
				
			КонецЕсли;

			СтруктураОшибки = СбисТекущиеДанные.ДанныеСравнения[0].Значение;
			МодульОбъектаКлиент().СообщитьСбисИсключение(СтруктураОшибки, Новый Структура("Отправлять", Ложь));
			
		ИначеЕсли	СбисТекущиеДанные.СостояниеСопоставления = 5 Тогда
			
			//Т.к. данные сравнения сохранить не можем, то перечитываем при попытке открыть детальную информацию
			Если СбисТекущиеДанные.ДанныеСравнения = Неопределено Тогда
				
				СписокОтмеченныхДокументов = Новый Массив;
				СписокОтмеченныхДокументов.Добавить(СбисТекущиеДанные);
				ВыполнитьСравнениеДокументов(СписокОтмеченныхДокументов, Новый Структура("Владелец", ЭтаФорма));
				
			КонецЕсли;
			
			фрм = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаПроблемСопоставления", Новый Структура("Владелец", ЭтаФорма));
			фрм.Показать(Кэш, СбисТекущиеДанные);
			
		КонецЕсли;
		
	ИначеЕсли Не ИмяКолонки = "Отмечен" Тогда
		
		ПараметрыДляФормыОбработки		= Новый Структура("Владелец, Новая, Кэшировать", ЭтаФорма, Истина, Ложь);
		ФормаСопоставленияДокументов	= МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаСопоставитьСДокументом1С", ПараметрыДляФормыОбработки);
		
		оДок = Новый Структура("Типы1С, Документ1С, ТипСБИС, ДокументСБИСНазвание, СписокПодходящихДокументов");
		ЗаполнитьЗначенияСвойств(оДок, СбисТекущиеДанные);
		ПараметрыФормыПоказать = Новый Структура("Документ", оДок);
		
		ОбрабочикЗакрытия = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("сбисПослеСопоставленияДокумента", ЭтаФорма);
		
		ФормаСопоставленияДокументов.ОписаниеОповещенияОЗакрытии = ОбрабочикЗакрытия;
		ФормаСопоставленияДокументов.ПоказатьПоверх(ПараметрыФормыПоказать);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСопоставленияДокументовПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Документ1С) И Элемент.ТекущиеДанные.СопоставлениеСохранено = Ложь Тогда
		
		Элемент.ТекущиеДанные.НайденоКартинка = 3;
		Элемент.ТекущиеДанные.СопоставлениеОпределено = Истина;
		РассчитатьДельтуИСуммуДокумента1С(Элемент.ТекущиеДанные);
		ОбновитьЗначенияВКопииТаблицыСопоставления(Элемент.ТекущиеДанные);
		
	КонецЕсли;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Сохранить результат сопоставления

&НаКлиенте
Процедура СохранитьНажатие(Элемент)
	Перем СбисИдАккаунта;

	// Процедура сохраняет установленные сопоставления	
	ГлавноеОкно = Кэш.ГлавноеОкно;
	МассивСтатусРегламент = Новый Массив;
	
	фрм = ГлавноеОкно.сбисНайтиФормуФункции("ЗаписатьПараметрыДокументаСБИС",Кэш.ФормаРаботыСоСтатусами,"",Кэш);
	фрмУдПар = ГлавноеОкно.сбисНайтиФормуФункции("УдалитьПараметрыДокументаСБИС",Кэш.ФормаРаботыСоСтатусами,"",Кэш);
	Если Кэш.парам.СостояниеЭД тогда
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("ИмяФункции",	"ДублироватьСостояние");
		ПараметрыПоиска.Вставить("КлючФорм",	"Статусы_СостоянияЭД");

		фрмЭД = Кэш.ОбщиеФункции.сбисНайтиФормуФункцииПодсистемы(Кэш, ПараметрыПоиска);
		
		ПараметрыПоиска.Вставить("ИмяФункции",	"УдалитьПараметрыДокументаСБИС");
		фрмУдПарЭД = Кэш.ОбщиеФункции.сбисНайтиФормуФункцииПодсистемы(Кэш, ПараметрыПоиска);
	КонецЕсли;
	Кэш.СБИС.ПараметрыИнтеграции.Свойство("ИдАккаунта", СбисИдАккаунта);
	
	фрмКлиент = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("сбисЗаписатьСопоставленныйДокумент", "РаботаСДокументами1С","",Кэш);
	
	//KES 050751151 Статусы в разрезе регламентов (СОПОСТАВЛЕНИЕ)-->  5 +
	Если Кэш.ФормаРаботыСоСтатусами = "Статусы_Регистры" 
       И (Кэш.Парам.СпособОбмена = 0 ИЛИ Кэш.Парам.СпособОбмена = 3)
	   И Кэш.Ини.Конфигурация.Свойство("СтатусРегламент") Тогда	
		   МассивСтатусРегламент = Кэш.ОбщиеФункции.РазбитьСтрокуВМассивНаКлиенте(Кэш.Ини.Конфигурация.СтатусРегламент.Значение,",");
	КонецЕсли;
	//<-- KES 050751151 Статусы в разрезе регламентов (СОПОСТАВЛЕНИЕ)

	СписокОтмеченныхДокументов = ПолучитьВыбранныеСтроки();
	
	Для Каждого ЭлементСписка из СписокОтмеченныхДокументов Цикл  
		Строка = ЭлементСписка.Значение;
		Если Строка.Документ1С<>Неопределено и Не Строка.Документ1С.Пустая() Тогда
			
			//KES 050751151 Статусы в разрезе регламентов (СОПОСТАВЛЕНИЕ)-->  6
			Префикс = "";
			СтрокаСоставПакета =  Строка.СоставПакета[0].Значение;
			Если НРЕГ(СтрокаСоставПакета.Направление) = "исходящий" 
				И СтрокаСоставПакета.Свойство("Регламент") 
				И СтрокаСоставПакета.Регламент.Свойство("Название") 
				И НЕ МассивСтатусРегламент.Найти(СтрокаСоставПакета.Регламент.Название)=Неопределено Тогда
				Префикс = СтрокаСоставПакета.Регламент.Название;	
			КонецЕсли;
			//<-- KES 050751151 Статусы в разрезе регламентов (СОПОСТАВЛЕНИЕ)
			
			//KES 1178720202 -->
			СопоставлятьДокумент = Истина;
			Если ЗначениеЗаполнено(Строка.Типы1С) Тогда
				ТипДокумента = Строка.Типы1С[0].Значение;
				фрмДопРасчеты = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ДопРасчетыПриСопоставлении","Документ_"+ТипДокумента,"Документ_Шаблон",Кэш);
				//не обсчитанный СоставПакета, при необходимости плучить полный в клиентской функции
				Если фрмДопРасчеты<>Ложь Тогда
					СопоставлятьДокумент = фрмДопРасчеты.ДопРасчетыПриСопоставлении(Строка.Документ1С, Новый Структура("СоставПакета,Кэш",Строка.СоставПакета[0].Значение,Кэш));
		        КонецЕсли;
			КонецЕсли;
			Если СопоставлятьДокумент = Ложь Тогда
				Продолжить;
			КонецЕсли;
			//KES 1178720202 <--
			
			СтруктураСвойств = Новый Структура("ДокументСБИС_Ид,ДокументСБИС_ИдВложения,ДокументСБИС_Статус", Строка.ИдСБИС,Строка.ИдВложения,Строка.Состояние);
			
			фрм.ЗаписатьПараметрыДокументаСБИС(СтруктураСвойств, Строка.Документ1С, Кэш.Ини.Конфигурация, Кэш.Парам.КаталогНастроек, Новый Структура("ИдАккаунта", СбисИдАккаунта));
			
			//синий документ
			Строка.НайденоКартинка = 1; 
			Строка.СопоставлениеСохранено = Истина; 
			Строка.СопоставлениеОпределено = Истина;
			Строка.Найдено = 1;
			
			Если Кэш.парам.СостояниеЭД тогда
				СоставПакета=новый структура("Состояние",новый структура());
				СоставПакета.Состояние.вставить("Название",Строка.Состояние);
				СоставПакета.вставить("Идентификатор", 	Строка.ИдСБИС);
				фрмЭД.ДублироватьСостояние(СоставПакета, Строка.Документ1С);
			конецесли;
			Если ЗначениеЗаполнено(Строка.РанееСопоставленныеДокументы1С) Тогда
				Для Каждого РанееСопоставленныйДокумент1С Из Строка.РанееСопоставленныеДокументы1С Цикл
					ПредыдущийДокумент1С = РанееСопоставленныйДокумент1С.Значение;
					Если ПредыдущийДокумент1С<>Строка.Документ1С Тогда // если раньше было сопоставление с другим документом, удаляем его
						СтруктураСвойств = Новый Структура("ДокументСБИС_Ид,ДокументСБИС_ИдВложения,ДокументСБИС_Статус");
						
						//KES 050751151 Статусы в разрезе регламентов (СОПОСТАВЛЕНИЕ) -->   7 +
						фрмУдПар.УдалитьПараметрыДокументаСБИСПарам(СтруктураСвойств, ПредыдущийДокумент1С, Кэш.Ини, Кэш.Парам.КаталогНастроек, Новый Структура("Регламент",Префикс));
						//<-- KES 050751151 Статусы в разрезе регламентов (СОПОСТАВЛЕНИЕ)
						
						если Кэш.парам.СостояниеЭД тогда
							фрмУдПарЭД.УдалитьПараметрыДокументаСБИС(СтруктураСвойств, ПредыдущийДокумент1С, Кэш.Ини, Кэш.Парам.КаталогНастроек);
						конецесли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			РассчитатьДельтуИСуммуДокумента1С(Строка);
			ОбновитьЗначенияВКопииТаблицыСопоставления(Строка);
			
			Если фрмКлиент <> Ложь Тогда
				фрмКлиент.сбисЗаписатьСопоставленныйДокумент(Строка, Кэш);
			КонецЕсли;
			//Строка.ДокументСБИС[0].Значение.Документ1С = Строка.Документ1С;
		Иначе
			Строка.НайденоКартинка = 0; 
			Строка.Найдено = 0;
			Строка.СопоставлениеСохранено = Ложь; 
			Строка.СопоставлениеОпределено = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	ФильтрСопоставленияОчистить();
	
	ПараметрыФормы.Вставить("Результат", Истина);
	ПараметрыФормы.Вставить("РежимЗакрытия",	"ОК");
	Кэш.ГлавноеОкно.ОбновитьКонтент();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьЗначенияВКопииТаблицыСопоставления(Строка)
	
	СтрокаКопии = ТаблицаСопоставленияДокументовКопия.НайтиСтроки(Новый Структура("ИдентификаторСтроки",Строка.ИдентификаторСтроки));
	СтрокаКопии[0].НайденоКартинка = Строка.НайденоКартинка;
	СтрокаКопии[0].Дельта = Строка.Дельта;
	СтрокаКопии[0].СуммаДокумента1С = Строка.СуммаДокумента1С;
	СтрокаКопии[0].Документ1С = Строка.Документ1С;
	СтрокаКопии[0].СопоставлениеСохранено = Строка.СопоставлениеСохранено;
	СтрокаКопии[0].СопоставлениеОпределено = Строка.СопоставлениеОпределено;
	СтрокаКопии[0].ЕстьРасхождение = Строка.ЕстьРасхождение;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Интерактивная кнопка

//Выбор действия из переходов ближайшего этапа первого из выделенных пакетов
&НаКлиенте
Процедура ВыполнитьДействиеНажатие(Команда)
	
	// получить этап с переходами с первого отмеченного документа
	ТекущийИдПакета = "";
	Для Каждого ДокументСтрока Из ТаблицаСопоставленияДокументов Цикл
		Если ДокументСтрока.Отмечен = Истина Тогда
			ТекущийИдПакета = ДокументСтрока.ИдСБИС;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// нет отмеченных документов. получить с текущего элемента (с выделения)
	Если ТекущийИдПакета = "" Тогда
		Если Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда	
			ТекущийПакет = ЭтаФорма.ТаблицаСопоставленияДокументов.НайтиПоИдентификатору(ЭтаФорма.Элементы.ТаблицаСопоставленияДокументов.ТекущаяСтрока);
		Иначе
			ТекущийПакет = ЭтаФорма.ЭлементыФормы.ТаблицаСопоставленияДокументов.ТекущаяСтрока; 
		КонецЕсли;
		Если НЕ ТекущийПакет = Неопределено Тогда
			ТекущийИдПакета = ТекущийПакет.ИдСБИС;
		КонецЕсли;
	КонецЕсли;

	Если  ТекущийИдПакета = "" Тогда
		Сообщить("Отсутствуют пакеты для обработки");	
		Возврат;
	КонецЕсли;
	
	СоставПакета = Кэш.Интеграция.ПрочитатьДокумент(Кэш,ТекущийИдПакета);	
	Список = Новый СписокЗначений;
	сч = 0;
	
	Если НЕ (СоставПакета.Свойство("Этап") И СоставПакета.Этап.Количество() > 0) Тогда
		Сообщить("Отсутствуют этапы для перехода");
		Возврат;
	КонецЕсли;
	
	Для Каждого Действие Из СоставПакета.Этап[0].Действие Цикл
		Если Найти(НРег(Действие.Название), "переназначить") Тогда
			Продолжить;
		КонецЕсли;
		Список.Добавить(Действие.Название);
		сч = сч + 1;
	КонецЦикла;
	
	//только этап "Переназначить"
	Если сч = 0 Тогда
		Сообщить("Отсутствуют этапы для перехода");
		Возврат;
	КонецЕсли;
	
	ПараметрыДляОбработкиДействия = Новый Структура;
	ПараметрыДляОбработкиДействия.Вставить("Этап", СоставПакета.Этап[0]);
	ПараметрыДляОбработкиДействия.Вставить("Переходы", СоставПакета.Этап[0].Действие);

	//через оповещение для обработки выбора из меню
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		РезультатЗакрытия = ВыбратьИзМеню(Список,ЭлементыФормы.ВыполнитьДействие); 
		ВыполнитьДействиеНажатиеЗавершение(РезультатЗакрытия, ПараметрыДляОбработкиДействия);
	#Иначе
		МодульЗавершения = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаСопоставитьСДокументами1С");
		Оповещение = Новый ОписаниеОповещения("ВыполнитьДействиеНажатиеЗавершение", МодульЗавершения, ПараметрыДляОбработкиДействия); 
		ПоказатьВыборИзМеню(Оповещение, Список, Элементы.ВыполнитьДействие); 
	#КонецЕсли
	
КонецПроцедуры

//Для всех выделенных документов применить (или попытаться) указанное действие
&НаКлиенте
Процедура ВыполнитьДействиеНажатиеЗавершение(РезультатЗакрытия, ПараметрыДляОбработкиДействия)  Экспорт
	
	//нажали мимо выпадающего списка
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	мПакеты = ПолучитьПакетыДляОбработки(Кэш.ПараметрыСистемы);
	
	//недостаточно названия перехода
	ВыбранныйПереход = Неопределено;
	Для Каждого Переход из ПараметрыДляОбработкиДействия.Переходы Цикл
		Если РезультатЗакрытия.Значение = Переход.Название Тогда 
			ВыбранныйПереход = Переход;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	//защита от невозможной ситуации, т.к. результат закрытия всегда есть в массиве доступных переходов
	Если ВыбранныйПереход = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//общая функция после выбора результата на любой интерактивной кнопке
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("сбисПослеВыбораПерехода", "РаботаСДокументами1С","",Кэш);
	СписокПакетов = Новый СписокЗначений;
	СписокИНН = Новый СписокЗначений;

	флагПервыйПакет = 1;
	Для Каждого Пакет из мПакеты Цикл
		
		//для открытия "ФормаПереходы" при необходимости
		Если флагПервыйПакет = 1 Тогда
			ПервыйПакет = Пакет;
		КонецЕсли;
		
		СписокПакетов.Добавить(Пакет);
		
		ИННОрг = ?(Пакет.НашаОрганизация.Свойство("СвФЛ"),Пакет.НашаОрганизация.СвФЛ.ИНН,Пакет.НашаОрганизация.СвЮЛ.ИНН);
		Если СписокИНН.НайтиПоЗначению("ИННОрг") = Неопределено Тогда
			СписокИНН.Добавить(ИННОрг);
		КонецЕсли;
		флагПервыйПакет = 0;
	КонецЦикла;
	
	ПараметрыПослеВыбораПерехода = Новый Структура;
	ПараметрыПослеВыбораПерехода.Вставить("СписокПакетов",СписокПакетов);
	ПараметрыПослеВыбораПерехода.Вставить("СписокИНН",СписокИНН);
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
		//Функция с этой формы, которая будет выполнена для обработки результата
		ПараметрыПослеВыбораПерехода.Вставить("ОповещениеРезультатДействия", Новый ОписаниеОповещения("ОбработатьРезультатДействия",ЭтаФорма,Новый Структура));
	#КонецЕсли	
	
	//KES 03.05.2019 переделываю работу с открытием формы на более универсальную на основе обработки 35
	//////стандартная форма для указания исполнителя/комментария на основании первого пакета. 
	////Если ВыбранныйПереход.ТребуетКомментария = "Да"
	////ИЛИ (ВыбранныйПереход.Свойство("ТребуетИсполнителя") И ВыбранныйПереход.ТребуетИсполнителя = "Да") Тогда                                             
	////	//Результат может содержать Действие, Исполнитель, Комментарий
	////	ФормаПереходы = сбисПолучитьФорму("ФормаПереходы");
	////	Результат = ФормаПереходы.Показать(Кэш, ПервыйПакет, ВыбранныйПереход);
	////	фрм.сбисПослеВыбораПерехода(Новый Структура("Действие,Комментарий",Результат.Действие, Результат.Комментарий), ПараметрыПослеВыбораПерехода);
	////Иначе
	////	фрм.сбисПослеВыбораПерехода(Новый Структура("Действие,Комментарий",ВыбранныйПереход, ""), ПараметрыПослеВыбораПерехода);
	////КонецЕсли;
	
	Если ВыбранныйПереход.ТребуетКомментария = "Да"
	ИЛИ (ВыбранныйПереход.Свойство("ТребуетИсполнителя") И ВыбранныйПереход.ТребуетИсполнителя = "Да") Тогда  
		РезультатДействия = ОткрытьФормуПереходов(ВыбранныйПереход,ПервыйПакет,фрм,ПараметрыПослеВыбораПерехода);
	Иначе
		//не требует перехода
		РезультатДействия = фрм.сбисПослеВыбораПерехода(Новый Структура("Действие,Комментарий",ВыбранныйПереход, ""), ПараметрыПослеВыбораПерехода);
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ОбработатьРезультатДействия(РезультатДействия,Неопределено);
	#КонецЕсли
		
КонецПроцедуры 

//Форма переходов
&НаКлиенте
Функция ОткрытьФормуПереходов(ВыбранноеДействие,СоставПакета,фрмПослеВыбораПерехода,ПараметрыПослеВыбораПерехода)
	
	ПараметрыПереходов = Новый Структура("СоставПакета, ВыбранноеДействие", СоставПакета, ВыбранноеДействие);
	
	ФормаПереходов = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаПереходы");
	ФормаПереходов.ОписаниеОповещенияОЗакрытии = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("сбисПослеВыбораПерехода", фрмПослеВыбораПерехода, ПараметрыПослеВыбораПерехода);
	ФормаПереходов.ПоказатьПоверх(ПараметрыПереходов);

КонецФункции

//Пакеты по выделенным документам
&НаСервере
Функция  ПолучитьПакетыДляОбработки(ПараметрыПолучения) 
	
	//чтобы в ТЗ было только одно вхождение пакета, по которому стоит хотя бы одна отметка
	ОтборОтмечен = Новый Структура("Отмечен,Дубль",Истина,Ложь);
	Если ПараметрыПолучения.Клиент.УправляемоеПриложение Тогда
		Копия = ДанныеФормыВЗначение(ТаблицаСопоставленияДокументов, Тип("ТаблицаЗначений")).Скопировать(ОтборОтмечен);
	Иначе
		Копия = ТаблицаСопоставленияДокументов.Скопировать(ОтборОтмечен);
	КонецЕсли;
	Копия.Свернуть("ИдСБИС");
	
	//Если ничего не отмечено - отработать по текущей записи
	Если Копия.Количество() = 0 Тогда
		Если ПараметрыПолучения.Клиент.УправляемоеПриложение Тогда	
			ТекущаяЗапись = ТаблицаСопоставленияДокументов.НайтиПоИдентификатору(ЭтаФорма.Элементы.ТаблицаСопоставленияДокументов.ТекущаяСтрока);
		Иначе
			ТекущаяЗапись = ЭтаФорма.ЭлементыФормы.ТаблицаСопоставленияДокументов.ТекущаяСтрока;
		КонецЕсли;
		Для Каждого ДокументСтрока из ТаблицаСопоставленияДокументов Цикл
			Если ТекущаяЗапись.ИдСБИС = ДокументСтрока.ИдСБИС Тогда
				ДокументСтрока.Отмечен = Истина;
			КонецЕсли;
		КонецЦикла;
		СоставПакета = Новый Массив;
		СоставПакета.Добавить(ТекущаяЗапись.СоставПакета[0].Значение);
		Возврат СоставПакета;	
		
	КонецЕсли;
	
	//Если отметки есть - сфорировать массив уникальных пакетов и отметить все недостающие вложения
	мСписокПакетов = Новый Массив;
	Для Каждого СтрокаКопии Из Копия Цикл
		
		мВложенияПакета = ТаблицаСопоставленияДокументов.НайтиСтроки(Новый Структура("ИдСБИС",СтрокаКопии.ИдСБИС));
		Для счВложение = 0 По мВложенияПакета.Количество() - 1 Цикл
			Если счВложение = 0 Тогда
				мСписокПакетов.Добавить(мВложенияПакета[счВложение].СоставПакета[0].Значение);
			КонецЕсли;
			мВложенияПакета[счВложение].Отмечен = Истина;
		КонецЦикла;
	
	КонецЦикла;
	
	Возврат мСписокПакетов;


КонецФункции	

//После выполнения действия
&НаКлиенте
Функция ОбработатьРезультатДействия(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ( ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("Строки") ) Тогда
		Возврат Неопределено;
	КонецЕсли;

	//вычитать актуальное состояние
	фрмКартинки = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("сбисИндексКартинкиПоСтатусуЭД", "РаботаСДокументами1С","",Кэш);
	Для Каждого Выполнено Из Результат.Строки.Выполнено Цикл
		СоставПакета = Кэш.Интеграция.ПрочитатьДокумент(Кэш,Выполнено.Ключ); 
		Отбор = Новый Структура("ИдСБИС",Выполнено.Ключ);
		мСтрокиКоллекцииНовыйСтатус = ТаблицаСопоставленияДокументов.НайтиСтроки(Отбор);
		
		Для Каждого СтрокаКоллекции Из мСтрокиКоллекцииНовыйСтатус Цикл
	 		СтрокаКоллекции.Статус =  фрмКартинки.сбисИндексКартинкиПоСтатусуЭД(СоставПакета.Состояние.Название);
			СтрокаКопии = ТаблицаСопоставленияДокументовКопия.НайтиСтроки(Новый Структура("ИдентификаторСтроки",СтрокаКоллекции.ИдентификаторСтроки));
			СтрокаКопии[0].Статус = СтрокаКоллекции.Статус;
			
			//для выполненного действия этап точно был
			СтрокаКоллекции.СоставПакета[0].Значение.Удалить("Этап");
			СтрокаКопии[0].СоставПакета[0].Значение.Удалить("Этап");
			//на случай, если подряд будем переводить по цепочке этапов
			Если СоставПакета.Свойство("Этап") Тогда
				СтрокаКоллекции.СоставПакета[0].Значение.Вставить("Этап",СоставПакета.Этап);
				СтрокаКопии[0].СоставПакета[0].Значение.Вставить("Этап",СоставПакета.Этап);
			КонецЕсли;

		КонецЦикла;
	КонецЦикла;   
	
	Кэш.ГлавноеОкно.ОбновитьКонтент();
	
КонецФункции		

////////////////////////////////////////////////////////////////////////////////
// Фильтр (без возможности заплатки)

// Закрывает панель фильтра, Только ОФ	
&НаКлиенте
Процедура ЗакрытьФормуФильтра(Команда=Неопределено)
	
	ПанельУстановитьФильтр = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ПанельУстановкиФильтра");
	
	Если Не ПанельУстановитьФильтр = Неопределено Тогда
		ПанельУстановитьФильтр.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуФильтра(Команда=Неопределено)
	
	ПараметрыПолученияФормы = Новый Структура("Владелец, ПолучитьНовую, КэшироватьФорму", ЭтаФорма, Истина, Ложь);
	ПараметрыФильтров		= Новый Структура("Фильтры", ФильтрыЗначения);
	
	ФормаФильтра = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаУстановкиФильтра", ПараметрыПолученияФормы);
	ФормаФильтра.ОписаниеОповещенияОЗакрытии = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("СбисПрименитьФильтрСопоставления", ЭтаФорма);
	ФормаФильтра.ПоказатьПоверх(ПараметрыФильтров);
	
КонецПроцедуры

&НаКлиенте
Процедура СбисПрименитьФильтрСопоставления(ПараметрыФильтраВходящие, ДопПараметры) Экспорт
	
	Если ПараметрыФильтраВходящие = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ФильтрыЗначения = ПараметрыФильтраВходящие;
		
	Отбор = Новый Структура;
	
	Если		ПараметрыФильтраВходящие.ФильтрДельта = 1 Тогда
		
		Отбор.Вставить("ЕстьРасхождение", Истина);
		
	ИначеЕсли	ПараметрыФильтраВходящие.ФильтрДельта = 2 Тогда
		
		Отбор.Вставить("ЕстьРасхождение", Ложь);
		
	Иначе
		
		// нет отбора по расхождению
		
	КонецЕсли;
	
	Если		ПараметрыФильтраВходящие.ФильтрСтатусСопоставления = 1 Тогда // сопоставление не сохранено
		
		Отбор.Вставить("СопоставлениеСохранено",	Ложь);
		
	ИначеЕсли	ПараметрыФильтраВходящие.ФильтрСтатусСопоставления = 2 Тогда // сопоставление сохранено
		
		Отбор.Вставить("СопоставлениеСохранено",	Истина);
		
	ИначеЕсли	ПараметрыФильтраВходящие.ФильтрСтатусСопоставления = 3 Тогда // сопоставление не найдено
		
		Отбор.Вставить("СопоставлениеОпределено",	Ложь);
		
	Иначе
		
		// нет отбора по статусу сопоставления
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыФильтраВходящие.ФильтрДатаНач) Тогда
		
		Отбор.Вставить("ДатаС",	НачалоДня(ПараметрыФильтраВходящие.ФильтрДатаНач));
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыФильтраВходящие.ФильтрДатаКнц) Тогда
		
		Отбор.Вставить("ДатаПо", КонецДня(ПараметрыФильтраВходящие.ФильтрДатаКнц));
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыФильтраВходящие.ФильтрНомер) Тогда
		
		Отбор.Вставить("Номер",	ПараметрыФильтраВходящие.ФильтрНомер);
		
	КонецЕсли;

	ЭлементОчистить = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "КнопкаОчиститьФильтр");
	ЭлементОчистить.Видимость = Отбор.Количество();

	УстановитьПредставлениеФильтра(ПараметрыФильтраВходящие);
	ПрименитьФильтрНаСервере(Отбор, Кэш.ПараметрыСистемы);
	ЗакрытьФормуФильтра();
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьФильтрНаСервере(ОтборВходящий, ПараметрыФильтра)
	
	//ищем всегда по первоначальной копии, вариант синтаксиса: Скопировать(<ПараметрыОтбора>) 
	ТаблицаСопоставленияДокументов.Очистить();
	ФильтрыПоКолонкам = ",СопоставлениеОпределено,СопоставлениеСохранено,ЕстьРасхождение,";
	
	ОтборПоКолонкам = Новый Структура;
	Для Каждого КлючИЗначение Из ОтборВходящий Цикл
		
		Если Найти(ФильтрыПоКолонкам, "," + КлючИЗначение.Ключ + ",") Тогда
			
			ОтборПоКолонкам.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Если ОтборПоКолонкам.Количество() Тогда
			
			ТаблицаСопоставленияДокументовОтбор = ТаблицаСопоставленияДокументовКопия.Скопировать(ОтборПоКолонкам);
			
		Иначе
			
			ТаблицаСопоставленияДокументовОтбор = ТаблицаСопоставленияДокументовКопия.Скопировать();
			
		КонецЕсли;
		
	#Иначе
		
		ТаблицаСопоставленияДокументовОтбор = ТаблицаСопоставленияДокументовКопия.Выгрузить(ОтборПоКолонкам);
		
	#КонецЕсли
	
	НаборСтрокПодходит = Новый Массив;
	Для Каждого СтрокаОтбора Из ТаблицаСопоставленияДокументовОтбор Цикл
		
		Если		ОтборВходящий.Свойство("Номер")
			И	Не	Найти(СтрокаОтбора.Номер, ОтборВходящий.Номер) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если	ОтборВходящий.Свойство("ДатаС")
			И	СтрокаОтбора.ДатаДокумента < ОтборВходящий.ДатаС Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если	ОтборВходящий.Свойство("ДатаПо")
			И	СтрокаОтбора.ДатаДокумента > ОтборВходящий.ДатаПо Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НаборСтрокПодходит.Добавить(СтрокаОтбора);
		
	КонецЦикла;

	НаборСтрокПодходит = ТаблицаСопоставленияДокументовОтбор.Скопировать(НаборСтрокПодходит);
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		ТаблицаСопоставленияДокументов = НаборСтрокПодходит;
		
	#Иначе
		
		ТаблицаСопоставленияДокументов.Загрузить(НаборСтрокПодходит)
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСопоставленияПоУмолчанию()

	ЗначенияФильтра = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаУстановкиФильтра").ЗначенияФильтровПоРазделу(НазваниеКратко());
	
	Если РежимРаботыФормы = "Сравнение" Тогда
		
		ЗначенияФильтра.ФильтрСтатусСопоставления = 2;
		
	Иначе
		
		ЗначенияФильтра.ФильтрСтатусСопоставления = 1;
		
	КонецЕсли;
	
	ФильтрыЗначения = ЗначенияФильтра;
	
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "КнопкаОчиститьФильтр").Видимость = Истина;

	УстановитьПредставлениеФильтра(ЗначенияФильтра);
	СбисПрименитьФильтрСопоставления(ЗначенияФильтра, Новый Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСопоставленияОчистить()
	
	ЭлементОчистить = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма,"КнопкаОчиститьФильтр");
	ЭлементОчистить.Видимость = Ложь;
	
	ФильтрыПоУмолчанию = МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаУстановкиФильтра").ЗначенияФильтровПоРазделу(НазваниеКратко());
	
	УстановитьПредставлениеФильтра(ФильтрыПоУмолчанию);
	СбисПрименитьФильтрСопоставления(ФильтрыПоУмолчанию, Новый Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПредставлениеФильтра(ПараметрыФильтра)

	ЭлементТекущееЗначениеФильтра = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ТекущееЗначениеФильтра");
	ЭлементТекущееЗначениеФильтра.Заголовок = СобратьПредставлениеФильтра(ПараметрыФильтра);
	
КонецПроцедуры
	
&НаКлиенте
Функция СобратьПредставлениеФильтра(ПараметрыФильтра)
	Перем ПредставлениеФильтраДобав;
	
	ПредставлениеФильтра	= "";
	ФильтрПоУмолчанию		= МодульОбъектаКлиент().ПолучитьФормуОбработки("ФормаУстановкиФильтра").ЗначенияФильтровПоРазделу(НазваниеКратко()); 
	
	Если	Не ПараметрыФильтра.ФильтрПериод = ФильтрПоУмолчанию.ФильтрПериод Тогда
		
		Если ПараметрыФильтра.ФильтрПериод = "За период" Тогда
			
			Если ЗначениеЗаполнено(ПараметрыФильтра.ФильтрДатаНач) Тогда
				
				ПредставлениеФильтра = "с " + Формат(ПараметрыФильтра.ФильтрДатаНач, "ДФ=dd.MM.yy");
				
			КонецЕсли;
			
			ПредставлениеФильтраДобав = "";
			Если ЗначениеЗаполнено(ПараметрыФильтра.ФильтрДатаКнц) Тогда
				
				ПредставлениеФильтраДобав = "по " + Формат(ПараметрыФильтра.ФильтрДатаКнц, "ДФ=dd.MM.yy");
				
			КонецЕсли;
		Иначе
			
			ПредставлениеФильтраДобав = ПараметрыФильтра.ФильтрПериод;
			
		КонецЕсли;
		
		СобратьПредставлениеФильтра_ДополнитьСтроку(ПредставлениеФильтра, ПредставлениеФильтраДобав, " ");
	КонецЕсли;
	
	ПредставлениеФильтраДобав = "";
	Если ЗначениеЗаполнено(ПараметрыФильтра.ФильтрНомер) Тогда
		
		ПредставлениеФильтраДобав = "номер " + ПараметрыФильтра.ФильтрНомер;
		
	КонецЕсли;

	СобратьПредставлениеФильтра_ДополнитьСтроку(ПредставлениеФильтра, ПредставлениеФильтраДобав);

	Если ПараметрыФильтра.ФильтрДельта = 1 Тогда
		
		ПредставлениеФильтраДобав = "с расхождениями";
		
	ИначеЕсли ПараметрыФильтра.ФильтрДельта = 2 Тогда 
		
		ПредставлениеФильтраДобав = "без расхождений";
		
	Иначе
		
		ПредставлениеФильтраДобав = "";
		
	КонецЕсли;
	
	СобратьПредставлениеФильтра_ДополнитьСтроку(ПредставлениеФильтра, ПредставлениеФильтраДобав);
	
	Если ПараметрыФильтра.ФильтрСтатусСопоставления = 1 Тогда
		
		ПредставлениеФильтраДобав = "сопоставление не сохранено";
		
	ИначеЕсли ПараметрыФильтра.ФильтрСтатусСопоставления = 2 Тогда
		
		ПредставлениеФильтраДобав = "сопоставление сохранено";
		
	ИначеЕсли ПараметрыФильтра.ФильтрСтатусСопоставления = 3 Тогда
		
		ПредставлениеФильтраДобав = "сопоставление не найдено";
		
	Иначе
		
		ПредставлениеФильтраДобав = "";
		
	КонецЕсли;
	
	СобратьПредставлениеФильтра_ДополнитьСтроку(ПредставлениеФильтра, ПредставлениеФильтраДобав);
	
	Если ПредставлениеФильтра = "" Тогда
		
		ПредставлениеФильтра = "Нужно отобрать?";
		 
	КонецЕсли;
	
	Возврат ПредставлениеФильтра;
		
КонецФункции

&НаКлиенте
Процедура СобратьПредставлениеФильтра_ДополнитьСтроку(СтрокаПредставление, СтрокаДобавить, Разделитель = ", ")
	
	Если ПустаяСтрока(СтрокаПредставление) Тогда
		
		СтрокаПредставление = СтрокаДобавить;
		
	ИначеЕсли Не ПустаяСтрока(СтрокаДобавить) Тогда 
		
		СтрокаПредставление = СтрокаПредставление + Разделитель + СтрокаДобавить;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	// Вставить содержимое обработчика.
	ТекущаяСтрока = сбисЭлементФормы(ЭтаФорма, "ТаблицаСопоставленияДокументов").ТекущиеДанные;
	ТекущийРаздел = Кэш.Разделы["р"+Кэш.Текущий.Раздел];
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПоказатьДокумент","Раздел_"+ТекущийРаздел+"_"+Кэш.Текущий.ТипДок,"Раздел_"+ТекущийРаздел+"_Шаблон", Кэш);	
	фрм.ПоказатьДокумент(Кэш, ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент1С(Команда)
	// Вставить содержимое обработчика.
	сбисДокументОткрыть = сбисЭлементФормы(ЭтаФорма, "ТаблицаСопоставленияДокументов").ТекущиеДанные.Документ1С;
	Если Не ЗначениеЗаполнено(сбисДокументОткрыть) Тогда
		Сообщить("Нет связанного документа 1С");
		Возврат;
	КонецЕсли;
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ОткрытьЗначение(сбисДокументОткрыть);
	#Иначе
		ПоказатьЗначение(,сбисДокументОткрыть);
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументОнлайн(Команда)
	// Вставить содержимое обработчика.
	ТекущаяСтрока = сбисЭлементФормы(ЭтаФорма, "ТаблицаСопоставленияДокументов").ТекущиеДанные;
	Если ТекущаяСтрока<>Неопределено Тогда
		фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ОткрытьДокументОнлайнПоПакету","ФормаГлавноеОкно","",Кэш);
		фрм.ОткрытьДокументОнлайнПоПакету(ТекущаяСтрока.СоставПакета[0].Значение, Кэш);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаДиск(Команда)
	мПакеты = ПолучитьПакетыДляОбработки(Кэш.ПараметрыСистемы);
	Кэш.ОбщиеФункции.СохранитьПакетыНаДиск(Кэш, мПакеты);
КонецПроцедуры

&НаКлиенте
Процедура СравнитьДокументы(Команда)

	ЗаписьПрикладнойСтатистики = МодульОбъектаКлиент().НовыйЗаписьПрикладнойСтатистики("Нажатие на кнопку сравнения", "Сравнение документов");
	ПрикладнаяСтатистика = МодульОбъектаКлиент().НовыйПрикладнаяСтатистика();
	МодульОбъектаКлиент().ПрикладнаяСтатистика_Добавить(ПрикладнаяСтатистика, ЗаписьПрикладнойСтатистики);
	ПараметрыОтправкиСтатистики = Новый Структура("Контекст", "Сравнение документов");
	МодульОбъектаКлиент().ПрикладнаяСтатистика_Отправить(ПрикладнаяСтатистика, ПараметрыОтправкиСтатистики);

	СписокОтмеченныхДокументов = ТаблДокПолучитьВыбранныеСтроки();
	ВыполнитьСравнениеДокументов(СписокОтмеченныхДокументов.ВыгрузитьЗначения(), Новый Структура("Владелец", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьВыбранныеСтроки() Экспорт
	// Функция формирует список отмеченных строк таблицы с документами
	СписокСтрок = Новый СписокЗначений;
	Для Каждого СтрокаТаблицы из ТаблицаСопоставленияДокументов Цикл
		Если СтрокаТаблицы.Отмечен Тогда
			СписокСтрок.Добавить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	Если СписокСтрок.Количество()=0 и сбисЭлементФормы(ЭтаФорма, "ТаблицаСопоставленияДокументов").ТекущаяСтрока<>Неопределено Тогда
		СписокСтрок.Добавить(сбисЭлементФормы(ЭтаФорма, "ТаблицаСопоставленияДокументов").ТекущиеДанные);
	КонецЕсли;
	Возврат СписокСтрок;
КонецФункции  

// Утверждение/Отклонение
&НаКлиенте
Процедура КонтекстноеМенюУтвердитьОтклонить(Команда)
	СписокОтмеченныхДокументов = ПолучитьВыбранныеСтроки();
	ГлавноеОкно = Кэш.ГлавноеОкно;
	фрм = ГлавноеОкно.сбисНайтиФормуФункции("сбисУтвердитьОтклонить","РаботаСДокументами1С","",Кэш);
	фрм.сбисУтвердитьОтклонить(Кэш, СписокОтмеченныхДокументов, Команда);
	
	Для Каждого СтрокаТаблицы из СписокОтмеченныхДокументов Цикл 
		ОтборИдСБИС = Новый Структура("ИдСБИС", СтрокаТаблицы.Значение.ИдСБИС);
		МассивНайденныхСтрок = ГлавноеОкно[Кэш.ТаблДок.Имя].НайтиСтроки(ОтборИдСБИС);
		Если МассивНайденныхСтрок.Количество() > 0 Тогда
			СтрокаТаблицы.Значение.Статус = МассивНайденныхСтрок[0].Статус;	
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УтвердитьВыделенные(Команда)
	КонтекстноеМенюУтвердитьОтклонить("Утвердить");
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьВыделенные(Команда)
	КонтекстноеМенюУтвердитьОтклонить("Отклонить");
КонецПроцедуры

&НаКлиенте
Функция ТаблДокПолучитьВыбранныеСтроки() Экспорт
	// Функция формирует список отмеченных строк таблицы с документами	
	СписокСтрок = Новый СписокЗначений;
	ТаблДок = сбисЭлементФормы(ЭтаФорма, "ТаблицаСопоставленияДокументов");
	Для Каждого СтрокаТаблицы из ТаблицаСопоставленияДокументов Цикл
		Если СтрокаТаблицы.Отмечен Тогда
			СписокСтрок.Добавить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	Если СписокСтрок.Количество()=0 и ТаблДок.ТекущаяСтрока<>Неопределено Тогда
		СписокСтрок.Добавить(ТаблДок.ТекущиеДанные);
	КонецЕсли;
	Возврат СписокСтрок;
КонецФункции

&НаКлиенте
Процедура ПередЗакрытиемОбработчик(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ПередЗакрытиемТиповойОбработчик(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);

	Если Не ПараметрыФормы.Результат = Неопределено Тогда
		Отказ = Истина;
		АргументЗакрытия = ПараметрыФормы.Результат;
		ПараметрыФормы.Вставить("Результат");
		Закрыть(АргументЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

