
&НаКлиенте
Процедура СписокОргазизацийПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если ДанныеСтроки.ИдАккаунта = ТекущийАккаунт Тогда
		
		ОформлениеСтроки.Шрифт = Новый Шрифт(ОформлениеСтроки.Шрифт,,, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#Область include_core2_vo2_Формы_ФормаСменыАккаунта_Интерфейс_События
#КонецОбласти

#Область include_core2_vo2_Формы_ФормаСменыАккаунта_Интерфейс_ОбработчикиСобытий
#КонецОбласти

#Область include_core2_vo2_Формы_ФормаСменыАккаунта_СистемныйИнтерфейс
#КонецОбласти

