
// Процедура выполняет расширенное выполнение действия над документом. Вызываются методы ExtSdk2.PrepareAction и ExtSdk2.ExecuteAction
//
// Параметры:
//  АсинхроннаяСБИСКоманда	 - 	Структура - Данные отправки документа - СоставПакета, Документ, СтатусПакета 
//  ДопПараметры			 - 	Структура - Набор полей, работа с которыми может расширить результат работы процедуры
//
&НаКлиенте
Процедура ExecuteActionEx(АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт
	
	ОшибкаВызова		= Ложь;
	Кэш					= МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	ДействиеСДокументом	= АсинхроннаяСБИСКоманда.АргументВызова;
	АргументДляВызова	= ДействиеСДокументом.ДанныеКоманд.Получить("ExecuteActionEx");
	
	КомандаПлагина	= НовыйКомандаСБИСПлагин(ДопПараметры.Кэш, АсинхроннаяСБИСКоманда, Новый Структура("Метод", "ExecuteActionEx"));
	КомандаПлагина.Параметры = Новый Структура("Document", АргументДляВызова); 
		
	РезультатВызова	= СБИС_ОтправитьКомандуБезОбработки(Кэш, КомандаПлагина, Новый Структура, ОшибкаВызова);
	
	АсинхроннаяСБИСКоманда.ВремяВызова = КомандаПлагина.ВремяВызова;
	
	Если ОшибкаВызова Тогда
		МодульОбъектаКлиент().ВызватьСбисИсключение(РезультатВызова, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_ОтправитьКоманду_Асинхронно");
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет вызов обработки служебных документов без ожидания ответа
//
// Параметры:
//  АсинхроннаяСБИСКоманда	 - 	АсинхроннаяСбисКоманда - Структура с описанием команды
//  ДопПараметры			 - 	Структура - Набор полей, работа с которыми может расширить результат работы процедуры
//
&НаКлиенте
Процедура ProcessServiceStagesEx(АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт
	
	ОшибкаВызова		= Ложь;
	Кэш					= МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	ДокументСБИС		= АсинхроннаяСБИСКоманда.АргументВызова;
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("ИдентификаторДокумента", ДокументСБИС.Идентификатор);
	
	КомандаПлагина				= НовыйКомандаСБИСПлагин(Кэш, АсинхроннаяСБИСКоманда, Новый Структура("Метод", "ProcessServiceStagesEx"));
	КомандаПлагина.Параметры	= Новый Структура("Filter", ПараметрыОбработки);
		
	РезультатВызова	= СБИС_ОтправитьКомандуБезОбработки(Кэш, КомандаПлагина, Новый Структура, ОшибкаВызова);
	
	АсинхроннаяСБИСКоманда.ВремяВызова = КомандаПлагина.ВремяВызова;
	
	Если ОшибкаВызова Тогда
		МодульОбъектаКлиент().ВызватьСбисИсключение(РезультатВызова, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".ProcessServiceStagesEx");
	КонецЕсли;
	
КонецПроцедуры

