
&НаКлиенте
Процедура ReadDocumentEx(АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт
	
	ОшибкаВызова		= Ложь;
	Кэш					= МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	АргументДляВызова	= АсинхроннаяСБИСКоманда.АргументВызова;
	
	КомандаПлагина	= НовыйКомандаСБИСПлагин(Кэш, АсинхроннаяСБИСКоманда, Новый Структура("Метод", "ReadDocument"));
	КомандаПлагина.Параметры	= Новый Структура("Document", АргументДляВызова);
	РезультатВызова				= СБИС_ОтправитьКомандуБезОбработки(Кэш, КомандаПлагина, Новый Структура, ОшибкаВызова);
	
	АсинхроннаяСБИСКоманда.ВремяВызова = КомандаПлагина.ВремяВызова;
	
	Если ОшибкаВызова Тогда
		МодульОбъектаКлиент().ВызватьСбисИсключение(РезультатВызова, Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_ОтправитьКоманду_Асинхронно");
	КонецЕсли;
	
КонецПроцедуры

