
&НаКлиенте
Процедура WriteAttachment(АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт
	
	ОшибкаВызова		= Ложь;
	ДействиеСДокументом	= АсинхроннаяСБИСКоманда.АргументВызова;
	АргументДляВызова	= ДействиеСДокументом.ДанныеКоманд.Получить("WriteAttachment");
	Кэш					= МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	
	События = Новый Структура;
	События.Вставить("Error",		Новый Структура("Функция",	"WriteDocumentEx2_Error"));
	МодульОбъектаКлиент().АсинхроннаяСбисКоманда_Установить(АсинхроннаяСБИСКоманда, "События", События);
	
	КомандаПлагина	= НовыйКомандаСБИСПлагин(Кэш, АсинхроннаяСБИСКоманда, Новый Структура("Метод", "WriteAttachment"));
	КомандаПлагина.Параметры = Новый Структура("Document", АргументДляВызова);
	РезультатВызова	= СБИС_ОтправитьКомандуБезОбработки(Кэш, КомандаПлагина, Новый Структура, ОшибкаВызова);
	
	АсинхроннаяСБИСКоманда.ВремяВызова = КомандаПлагина.ВремяВызова;
	
	Если ОшибкаВызова Тогда
		ИмяВСтек = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ИнтеграцияИмя") + ".СБИС_ОтправитьКомандуБезОбработки";
		МодульОбъектаКлиент().ВызватьСбисИсключение(РезультатВызова, ИмяВСтек);
	КонецЕсли;
	
КонецПроцедуры

//Обработка успешной отправки пакета
&НаКлиенте
Процедура WriteAttachment_Message(РезультатВызова, ПараметрыОбработки) Экспорт
	
	События = Новый Структура;
	События.Вставить("Message",		Новый Структура("Функция",	"WriteDocumentEx2_Message"));
	МодульОбъектаКлиент().АсинхроннаяСбисКоманда_Установить(ПараметрыОбработки.Команда, "События", События);
	
	ПараметрыОтправки	= Новый Структура("Кэш, РезультатОтправки", ПараметрыОбработки.Кэш, ПараметрыОбработки.РезультатОтправки);
	ОбработчикОтправки	= МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ExecuteActionEx", ПараметрыОбработки.Кэш.ТекущийСеанс.Модули.Интеграция, ПараметрыОтправки);
	Сбис3Команда		= МодульОбъектаКлиент().МассоваяОперация_НовыйАсинхроннаяСбисКоманда(ПараметрыОбработки.РезультатОтправки, ПараметрыОбработки.Команда.АргументВызова, ОбработчикОтправки);
	
	МодульОбъектаКлиент().АсинхроннаяСбисКоманда_Установить(Сбис3Команда, "События", События);
	
	МодульОбъектаКлиент().АсинхроннаяСбисКоманда_Выполнить(Сбис3Команда);
	
	МодульОбъектаКлиент().МассоваяОперация_Асинх_Ответ(РезультатВызова, ПараметрыОбработки);
	
КонецПроцедуры

