
&НаКлиенте
Процедура WriteDocumentEx(АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт
	Перем НаборДопПолей, ЗначенияДопПолей;
	
	ОшибкаВызова		= Ложь;
	МодульОбъектаКлиент	= МодульОбъектаКлиент();
	АргументДляВызова	= АсинхроннаяСБИСКоманда.АргументВызова;
	
	КомандаПлагина	= НовыйКомандаСБИСПлагин(ДопПараметры.Кэш, АсинхроннаяСБИСКоманда, Новый Структура("Метод", "WriteDocumentEx"));
	КомандаПлагина.Параметры = Новый Структура("Document", АргументДляВызова);
	
	Если АргументДляВызова.Свойство("НаборДопПолей", НаборДопПолей) Тогда
		
		АргументДляВызова.Удалить("НаборДопПолей");
		Если НаборДопПолей.Свойство("ЗаписатьДокумент") Тогда
			
			КомандаПлагина.Параметры.Document.Вставить("ДопПоля", НаборДопПолей.ЗаписатьДокумент);
			
		КонецЕсли;
		
		Если НаборДопПолей.Свойство("ПодготовитьДействие", ЗначенияДопПолей) Тогда
			
			ПодготовитьДействиеПараметры = Новый Структура("ДопПоля", ЗначенияДопПолей);
			КомандаПлагина.Параметры.Вставить("DocumentForPrepare", ПодготовитьДействиеПараметры);
			
		КонецЕсли;
		
		Если НаборДопПолей.Свойство("ВыполнитьДействие", ЗначенияДопПолей) Тогда
			
			ПодготовитьДействиеПараметры = Новый Структура("ДопПоля", ЗначенияДопПолей);
			КомандаПлагина.Параметры.Вставить("DocumentForExecute", ПодготовитьДействиеПараметры);
			
		КонецЕсли;

	КонецЕсли;
		
	РезультатВызова	= СБИС_ОтправитьКомандуБезОбработки(ДопПараметры.Кэш, КомандаПлагина, Новый Структура, ОшибкаВызова);
	
	АсинхроннаяСБИСКоманда.ВремяВызова = КомандаПлагина.ВремяВызова;
	
	Если ОшибкаВызова Тогда
		МодульОбъектаКлиент().ВызватьСбисИсключение(РезультатВызова, ДопПараметры.Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_ОтправитьКоманду_Асинхронно");
	КонецЕсли;
	
КонецПроцедуры

//Обработка успешной отправки пакета
&НаКлиенте
Процедура WriteDocumentEx2_Message(РезультатВызова, ПараметрыОбработки) Экспорт
	
	WriteDocumentEx2_ОбработатьВременныеФайлы(РезультатВызова, ПараметрыОбработки);
	МодульОбъектаКлиент().МассоваяОперация_Асинх_Ответ(РезультатВызова, ПараметрыОбработки);
	
КонецПроцедуры

//Обработка ошибки отправки
&НаКлиенте
Процедура WriteDocumentEx2_Error(РезультатВызова, ПараметрыОбработки) Экспорт
	
	WriteDocumentEx2_ОбработатьВременныеФайлы(РезультатВызова, ПараметрыОбработки);
	МодульОбъектаКлиент().МассоваяОперация_Асинх_Ошибка(РезультатВызова, ПараметрыОбработки)
	
КонецПроцедуры

//Вспомогательная функция, чисто под способ обмена.
&НаКлиенте
Процедура WriteDocumentEx2_ОбработатьВременныеФайлы(РезультатВызова, ПараметрыОбработки)
	
	Попытка
		ВложенияОбработаны = ПараметрыОбработки.Команда.АргументВызова.Вложение;
		Для Каждого ВложениеПакета Из ВложенияОбработаны Цикл
			
			КлючВременногоФайла = ВложениеПакета;
			Если	Не КлючВременногоФайла.Свойство("Файл",			КлючВременногоФайла)
				Или Не КлючВременногоФайла.Свойство("ПутьКФайлу",	КлючВременногоФайла) Тогда
				Продолжить;
			КонецЕсли;
			
			МодульОбъектаКлиент().ОсвободитьВременныйФайл(КлючВременногоФайла);
			
		КонецЦикла;
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

