
&НаКлиенте
Процедура WriteAttachment (АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт
	
	ОшибкаВызова	= Ложь;
	
	КомандаПлагина	= НовыйКомандаСБИСПлагин(ДопПараметры.Кэш, АсинхроннаяСБИСКоманда, Новый Структура("Метод", "WriteAttachment"));
	КомандаПлагина.Параметры = Новый Структура("Document", КомандаПлагина.Параметры.ДокументОтправить);
	РезультатВызова	= СБИС_ОтправитьКомандуБезОбработки(ДопПараметры.Кэш, КомандаПлагина, Новый Структура, ОшибкаВызова);
	
	АсинхроннаяСБИСКоманда.ВремяВызова = КомандаПлагина.ВремяВызова;
	
	Если ОшибкаВызова Тогда
		ТекущийМетод = ДопПараметры.Кэш.СБИС.ПараметрыИнтеграции.ИнтеграцияИмя + ".СБИСПлагин_ОтправитьКоманду_Асинхронно";
		МодульОбъектаКлиент().ВызватьСбисИсключение(РезультатВызова, ТекущийМетод);
	КонецЕсли;
	
КонецПроцедуры

// Обработка успешной записи вложений
&НаКлиенте
Процедура WriteAttachment_Message(РезультатВызова, ПараметрыОбработки) Экспорт
	
	МодульОбъектаКлиент().РезультатОтправки_Асинх_Ответ(РезультатВызова, ПараметрыОбработки);
	
КонецПроцедуры

// Обработка ошибки записи вложений
&НаКлиенте
Процедура WriteAttachment_Error(РезультатВызова, ПараметрыОбработки) Экспорт
	
	МодульОбъектаКлиент().РезультатОтправки_Асинх_Ошибка(РезультатВызова, ПараметрыОбработки);
	
КонецПроцедуры
