
&НаКлиенте
Функция XmlSerializer_DecodeNode(Node, Parent)
	ThisElement = Новый Структура("Тип,Путь", Node.Имя, Parent.Путь);
	Если		ThisElement.Тип = "array" Тогда//decode_array
		Результат = Новый Массив;
		СбисИндекс = 0;
		Пока XmlSerializer_ReadSubNode(Node, ThisElement) Цикл
			ThisElement.Путь = Parent.Путь + "[" + СбисИндекс + "]";
			Результат.Добавить(XmlSerializer_DecodeNode(Node, ThisElement));
			СбисИндекс = СбисИндекс + 1;
		КонецЦикла;
	ИначеЕсли	ThisElement.Тип = "object" Тогда//decode_object
		Результат = Новый Структура;
		Пока XmlSerializer_ReadSubNode(Node, ThisElement) Цикл
			Node_key = Node.ПолучитьАтрибут("name");
			Если Node_key = Неопределено Тогда
				ВызватьИсключение("Неверный формат ответа по пути " + Parent.Путь + ": отсутствует атрибут ""name"" с описанием ключа узла.");
			КонецЕсли;
			ThisElement.Путь = Parent.Путь + "." + Node_key;
			РезультатСериализации = XmlSerializer_DecodeNode(Node, ThisElement);
			Node_key = СтрЗаменить(Node_key, ".", "_");
			Node_key = СтрЗаменить(Node_key, "@", "_");
			Попытка
				Результат.Вставить(Node_key, РезультатСериализации);
			Исключение
				//Возможно, когда-нибудь, в следующей жизни будет нормальный овтет, который  мы сможем разобрать всегда.
				//Пропускаем некорректные ключи
				//ВызватьИсключение("Неверный формат ответа по пути " + Parent.Путь + ": некорректное значение " + Node_key + " в ключе ""name"".");
			КонецПопытки;
		КонецЦикла;
	Иначе //Простые типы (значения узлов)
		XmlSerializer_ReadSubNode(Node, ThisElement);
		
		
		Если		ThisElement.Тип = "str" Тогда//decode_str
			
			Попытка
				
				Результат = XmlSerializer_DecodeNode_Decode_Date(Node.Значение);
				
			Исключение
				
				Результат = Node.Значение;
				
			КонецПопытки; 
			
		ИначеЕсли	ThisElement.Тип = "null" Тогда//decode_null
			Результат = Неопределено;
		ИначеЕсли	ThisElement.Тип = "bool" Тогда//decode_bool
			
			Попытка
				
				Результат = XmlSerializer_DecodeNode_Decode_Bool(Node.Значение);
				
			Исключение
				
				ВызватьИсключение("Неверный формат ответа по пути " + Parent.Путь + ": ошибка преобразования к типу булево " + Node.Значение + "!");
				
			КонецПопытки;
			
		ИначеЕсли	ThisElement.Тип = "num"
				Или	ThisElement.Тип = "number" Тогда//decode_num
				
			Попытка
					
				Результат = Число(Node.Значение);
				
			Исключение
				
				ВызватьИсключение("Неверный формат ответа по пути " + Parent.Путь + ": ошибка преобразования к типу число " + Node.Значение + "!");
				
			КонецПопытки;
			
		Иначе
			ВызватьИсключение("Неверный формат ответа по пути " + Parent.Путь + ": неизвестный тип ответа " + ThisElement.Тип + "!");
		КонецЕсли;
		Если Не Node.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			//Если узел сразу закрывает значение, то не делаем ReadNext
			XmlSerializer_ReadSubNode(Node, ThisElement);
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция XmlSerializer_DecodeNode_Decode_Date(ЗначениеСтрокаДляДата)

	Если	Не	Сред(ЗначениеСтрокаДляДата, 3, 1) = "."
		Или	Не	Сред(ЗначениеСтрокаДляДата, 6, 1) = "." Тогда
		
		// Точки в определенных местах
		Возврат ЗначениеСтрокаДляДата;
		
	КонецЕсли;
		
	Результат		= ЗначениеСтрокаДляДата;
	ЗначениеДень	= Лев	(Результат,	2);
	ЗначениеМесяц	= Сред	(Результат,	4, 2);
	ЗначениеГод		= Сред	(Результат,	7, 4);
	Если	Не	Найти("0123456789", Лев(ЗначениеГод,	1))
		Или	Не	Найти("0123456789", Лев(ЗначениеМесяц,	1)) Тогда
		
		// 1 символ для года и месяца не число
		Возврат ЗначениеСтрокаДляДата;
		
	КонецЕсли;
	
	//Переопределим значение как дату, если это действительно она
	Если		СтрДлина(Результат) = 10 Тогда
		
		Возврат Дата(	ЗначениеГод,
						ЗначениеМесяц,
						ЗначениеДень);
		
	ИначеЕсли	СтрДлина(Результат) = 19 Тогда 
		
		Возврат Дата(	ЗначениеГод,
						ЗначениеМесяц,
						ЗначениеДень,
						Сред(Результат,12, 2),
						Сред(Результат,15, 2),
						Сред(Результат,18, 2));
		
	Иначе
		
		Возврат Результат;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция XmlSerializer_DecodeNode_Decode_Bool(ЗначениеСтрокаДляРасшифровки)
	
	Если		ЗначениеСтрокаДляРасшифровки = "0" Тогда
		
		Возврат Ложь;
		
	ИначеЕсли	ЗначениеСтрокаДляРасшифровки = "1" Тогда
		
		Возврат Истина;
		
	Иначе
		
		// Может быть обернутый True/False
		Попытка
			
			Возврат Булево(ЗначениеСтрокаДляРасшифровки);
			
		Исключение
			
			Возврат Булево(Число(ЗначениеСтрокаДляРасшифровки));
			
		КонецПопытки;
			
	КонецЕсли;

КонецФункции

&НаКлиенте
Функция XmlSerializer_DecodeNode3(Node, Parent)
	ThisElement = Новый Структура("Тип,Путь", Node.Имя, Parent.Путь);
	Если		ThisElement.Тип = "array" Тогда//decode_array
		Результат = Новый Массив;
		СбисИндекс = 0;
		Пока XmlSerializer_ReadSubNode(Node, ThisElement) Цикл
			ThisElement.Путь = Parent.Путь + "[" + СбисИндекс + "]";
			Результат.Добавить(XmlSerializer_DecodeNode3(Node, ThisElement));
			СбисИндекс = СбисИндекс + 1;
		КонецЦикла;
	ИначеЕсли	ThisElement.Тип = "object" Тогда//decode_object
		Результат = Новый Соответствие;
		Пока XmlSerializer_ReadSubNode(Node, ThisElement) Цикл
			Node_key = Node.ПолучитьАтрибут("name");
			Если Node_key = Неопределено Тогда
				ВызватьИсключение("Неверный формат ответа по пути " + Parent.Путь + ": отсутствует атрибут ""name"" с описанием ключа узла.");
			КонецЕсли;
			ThisElement.Путь = Parent.Путь + "." + Node_key;
			РезультатСериализации = XmlSerializer_DecodeNode3(Node, ThisElement);
			Попытка
				Результат.Вставить(Node_key, РезультатСериализации);
			Исключение
				//Возможно, когда-нибудь, в следующей жизни будет нормальный овтет, который  мы сможем разобрать всегда.
				//Пропускаем некорректные ключи
				//ВызватьИсключение("Неверный формат ответа по пути " + Parent.Путь + ": некорректное значение " + Node_key + " в ключе ""name"".");
			КонецПопытки;
		КонецЦикла;
	Иначе //Простые типы (значения узлов)
		XmlSerializer_ReadSubNode(Node, ThisElement);
		Если		ThisElement.Тип = "str" Тогда//decode_str
			
			Попытка
				
				Результат = XmlSerializer_DecodeNode_Decode_Date(Node.Значение);
				
			Исключение
				
				Результат = Node.Значение;
				
			КонецПопытки;


		ИначеЕсли	ThisElement.Тип = "null" Тогда//decode_null
			Результат = Неопределено;
		ИначеЕсли	ThisElement.Тип = "bool" Тогда//decode_bool
			
			Попытка
				
				Результат = XmlSerializer_DecodeNode_Decode_Bool(Node.Значение);
				
			Исключение
				
				ВызватьИсключение("Неверный формат ответа по пути " + Parent.Путь + ": ошибка преобразования к типу булево " + Node.Значение + "!");
				
			КонецПопытки;
		
		ИначеЕсли	ThisElement.Тип = "num"
				Или	ThisElement.Тип = "number" Тогда//decode_num
			Попытка
				Результат = Число(Node.Значение);
			Исключение
				ВызватьИсключение("Неверный формат ответа по пути " + Parent.Путь + ": ошибка преобразования к типу число " + Node.Значение + "!");
			КонецПопытки;
		Иначе
			ВызватьИсключение("Неверный формат ответа по пути " + Parent.Путь + ": неизвестный тип ответа " + ThisElement.Тип + "!");
		КонецЕсли;
		Если Не Node.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			//Если узел сразу закрывает значение, то не делаем ReadNext
			XmlSerializer_ReadSubNode(Node, ThisElement);
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция XmlSerializer_ReadSubNode(Node, Parent)
	Попытка
		Результат = Node.Прочитать();
	Исключение
		ВызватьИсключение("Ошибка чтения узла по пути " + Parent.Путь + ": " + ОписаниеОшибки());
	КонецПопытки; 
	
	Если Результат Тогда
		Если	Node.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Если Node.Имя = Parent.Тип Тогда//Закрывается родитель, закончилась выборка для родительского элемента
				Возврат Ложь;
			Иначе
				ВызватьИсключение("Неверный формат ответа по пути " + Parent.Путь + ": узел " + Node.Имя + " не закывает родительский " + Parent.Тип + "!");
			КонецЕсли;
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция НовыйКомандаСБИСПлагин(Кэш, АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт
	Перем СбисАккаунт;

	ПараметрыОбъекта = Новый ФиксированнаяСтруктура("Тип, Свойства",
		"КомандаСБИСПлагину",
		"Метод,	Параметры, Модуль, ВремяВызова, Идентификатор, Аккаунт, Контракт");
	Результат = МодульОбъектаКлиент().НовыйОбъектSABY(ПараметрыОбъекта);
	ЗаполнитьЗначенияСвойств(Результат, АсинхроннаяСБИСКоманда,,"_ид,_тип");
	ЗаполнитьЗначенияСвойств(Результат, ДопПараметры);

	Результат.Параметры		= АсинхроннаяСБИСКоманда.АргументВызова;

	Если Результат.Идентификатор = Неопределено Тогда
		
 		Результат.Идентификатор	= МодульОбъектаКлиент().ПрикладнойОбъектSABY_Получить(АсинхроннаяСБИСКоманда, "Идентификатор");
		
	КонецЕсли;
	
	Если Результат.Модуль = Неопределено Тогда
		
		Результат.Модуль	= МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ИмяВнешнегоМодуля");
		
	КонецЕсли;
	
	Если Результат.Аккаунт = Неопределено Тогда
		
		Результат.Аккаунт	= СбисИдАккаунта(Кэш);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

