
&НаКлиенте
Процедура Асинх_СБИС_ПрочитатьДокумент(АсинхроннаяСБИСКоманда, ДопПараметры) Экспорт
	
	ОшибкаВызова		= Ложь;
	МодульОбъектаКлиент	= МодульОбъектаКлиент();
	Кэш					= МодульОбъектаКлиент.ПолучитьТекущийЛокальныйКэш();
	АргументДляВызова	= АсинхроннаяСБИСКоманда.АргументВызова;
	
	КомандаПлагина	= НовыйКомандаСБИСПлагин(Кэш, АсинхроннаяСБИСКоманда, Новый Структура("Метод", "ReadDocument"));
	КомандаПлагина.Параметры = Новый Структура("Document", АргументДляВызова);
	РезультатВызова	= СБИС_ОтправитьКомандуБезОбработки(Кэш, КомандаПлагина, Новый Структура, ОшибкаВызова);
	
	АсинхроннаяСБИСКоманда.ВремяВызова = КомандаПлагина.ВремяВызова;
	
	Если ОшибкаВызова Тогда
		МодульОбъектаКлиент().ВызватьСбисИсключение(РезультатВызова, МодульОбъектаКлиент.ПолучитьЗначениеПараметраСБИС("ИнтеграцияИмя") + ".СБИСПлагин_ОтправитьКоманду_Асинхронно");
	КонецЕсли;
	
КонецПроцедуры

