
// Описать, как обработать в отправку приложенный файл не XML.
//
// Параметры:
//  Кэш					 - ЛокальныйКэш	- Струкутра
//  ДанныеФайла			 - Структура	- Вложение, Файл
//  ПараметрыПодготовки	 - Струкутра	- Данные отправки документа - СоставПакета, Документ, СтатусПакета
//
&НаКлиенте
Процедура Отправка_ОбработатьВнешнийФайл(Кэш, ДанныеФайла, ПараметрыПодготовки) Экспорт
	
	СБИСПлагин_ОбработатьВнешнийФайл(Кэш, ДанныеФайла, ПараметрыПодготовки) 

КонецПроцедуры

// Описать, как обработать в отправку приложенный файл не XML.
//
// Параметры:
//  Кэш					 - ЛокальныйКэш	- Струкутра
//  ДанныеФайла			 - Структура	- Вложение, Файл
//  ПараметрыПодготовки	 - Струкутра	- Данные отправки документа - СоставПакета, Документ, СтатусПакета
//
&НаКлиенте
Процедура Отправка_ОбработатьXMLФайл(Кэш, ДанныеФайла, ПараметрыПодготовки) Экспорт
	
	СБИСПлагин_ОбработатьXMLФайл(Кэш, ДанныеФайла, ПараметрыПодготовки);

КонецПроцедуры

&НаКлиенте
Процедура WriteDocumentEx_УстановитьПодпискиСобытий(АсинхроннаяСбис3Команда, ДопПараметры=Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Error",		Новый Структура("Функция",					"WriteDocumentEx2_Error"));
	Результат.Вставить("Message",	Новый Структура("Функция, ФункцияОшибки",	"WriteDocumentEx2_Message", "WriteDocumentEx2_Error"));

	МодульОбъектаКлиент().АсинхроннаяСбисКоманда_Установить(АсинхроннаяСбис3Команда, "События", Результат);
				
КонецПроцедуры

