
// Функция возвращает описание идентификатора СБИС по ссылке 1С
//
// Параметры:
//  ДокументСсылка	 - ДокументСсылка	- Ссылка, на документ 1С, по которому требуется извлечь сведения о пакете
//  ДопПараметры	 - Структура		- 
//		Кэш					- ЛокальныйКэш(необяз)		- для автоопределения раздела и регламента по кэшу, если имеется
//		ИмяРегламента 		- Строка(необяз)			- имя регламента, для доп. разреза хранения статусов, если есть
//		СтруктураРаздела	- СтруктураРазделаГО(необяз)- структура раздела обработки, для авто. определения регламента. Не учитывается, если есть ИмяРегламента
// Возвращаемое значение:
//  Структура - ИдДокумента, ИдАккаунта
//
&НаКлиенте
Функция сбисПрочитатьСведенияОИдСБИСПоДокументу1С(ДокументСсылка, ДопПараметры=Неопределено) Экспорт
	Перем ДопПараметрыВызова;
	
	Если		ДопПараметры = Неопределено Тогда
		//Нет ДопПараметрыВызова
	ИначеЕсли	ДопПараметры.Свойство("ИмяРегламента")
			Или	ДопПараметры.Свойство("СтруктураРаздела") Тогда
		ДопПараметрыВызова = ДопПараметры;
	ИначеЕсли	ДопПараметры.Свойство("Кэш") Тогда
		ДопПараметрыВызова = Новый Структура("СтруктураРаздела", ДопПараметры.Кэш.Текущий);
	Иначе
		//Нет ДопПараметрыВызова		
	КонецЕсли;
	
	Возврат МодульОбъектаКлиент().ПрочитатьСведенияОИдСБИСПоДокументу1С(ДокументСсылка, ДопПараметрыВызова);
	
КонецФункции

