
//Получает значения указанных свойства по документам на сервере. Возвращает соответствие, где ключ - ссылка на документ, значение - массив структур со Свойствами и значениями
&НаСервере
Функция ПрочитатьСвойстваДокументовПоСсылкамНаСервере(ФильтрВходящий)
	Перем ИдАккаунта, КодСервиса;
	
	БД = ПолучитьСоединениеDBF(ПараметрыСоединения);
	
	СписокДокументов 	= ФильтрВходящий.СписокДокументов;
	СвойстваПолучить	= ФильтрВходящий.СписокСвойств;
	
	КоличествоДок		= СписокДокументов.Количество();
	Шаг					= 2000;
	Счетчик				= 0;
	ТекущееКоличество	= 0;
	
	Результат = Новый Соответствие;
	
	СвойстваSQL			= Новый Соответствие;
	Для Каждого СвойствоПолучить Из СвойстваПолучить Цикл
		СвойстваSQL.Вставить(ИмяПоляДБФПоИмениСвойства(СвойствоПолучить), СвойствоПолучить);
	КонецЦикла;
	
	// делаем запросы статусов из ДБФ по партиям для каждых 2000 документов 1С (разбиваем по частям, т.к. при большом количестве документов ругается "слишком сложный запрос")
	Пока ТекущееКоличество < КоличествоДок Цикл
		СоответствиеИД_Ссылка = Новый Соответствие;
		RecordSet = Новый ComОбъект("ADODB.Recordset");
		Recordset.CursorLocation = 3;
		sql_str = "Select IDDOC, ";
		Для Каждого КлючИЗначениеСвойства Из СвойстваSQL Цикл
			sql_str = sql_str + КлючИЗначениеСвойства.Ключ + ", ";
			Если КлючИЗначениеСвойства.Значение = "ДокументСБИС_Ид" Тогда
				sql_str = sql_str + "IDACC, ";//Ид аккаунта в выборку
			КонецЕсли;
		КонецЦикла;
		sql_str = Лев(sql_str, СтрДлина(sql_str) - 2);
		sql_str	= sql_str + 
					" from "	+ ПараметрыСоединения.ОписаниеСоединенияДБФ.Параметры.ИмяФайла + 
					" where "	+ ПараметрыСоединения.ОписаниеСоединенияДБФ.Параметры.ИмяФайла + ".IDDOC IN(";
		ВремКоличество = Мин(ТекущееКоличество + Шаг, КоличествоДок) - 1;
		Для Счетчик = ТекущееКоличество По ВремКоличество Цикл
			СсылкаДок	= СписокДокументов[Счетчик];
			ИдентДок	= ПолучитьУИДДокументаПоСсылке(СсылкаДок);
			СоответствиеИД_Ссылка.Вставить(ИдентДок, СсылкаДок);
			
			sql_str = sql_str + "'" + ИдентДок + "', ";	
		КонецЦикла;
		sql_str = Лев(sql_str, СтрДлина(sql_str)-2);
		sql_str = sql_str+")";
		Recordset.Open(sql_str,БД,2,3);
		
		Пока Не Recordset.EOF Цикл
			СписокСвойств = Новый Массив;
			Результат.Вставить(СоответствиеИД_Ссылка.Получить(RecordSet.Fields("IDDOC").value), СписокСвойств);
			Для Каждого СвойствоSQL Из СвойстваSQL Цикл
				СписокСвойств.Добавить(Новый Структура("Свойство, Значение", СвойствоSQL.Значение, RecordSet.Fields(СвойствоSQL.Ключ).value));
			КонецЦикла;
			RecordSet.MoveNext();
		КонецЦикла;
		ТекущееКоличество = ТекущееКоличество + Шаг;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьУИДДокументаПоСсылке(ДокументСсылка1С)
	
	Возврат ДокументСсылка1С.Метаданные().Имя+":"+Строка(ДокументСсылка1С.УникальныйИдентификатор());

КонецФункции

//Добавляет свойства для документа 1С (при сопоставлении и загрузке документов)	
&НаСервере
Функция ЗаписатьПараметрыДокументовСБИСНаСервере(ДанныеПоСтатусам)
	Для Каждого Элемент Из ДанныеПоСтатусам Цикл
		ЗаписатьПараметрыДокументаСБИСНаСервере(Элемент.СтруктураСвойств,Элемент.Документ1С);
	КонецЦикла;
КонецФункции

&НаСервере
Функция ЗаписатьПараметрыДокументаСБИСНаСервере(СтруктураПараметровДокументаСБИС, ДокументСсылка)
	//ФайлСтатусов = Новый Файл(КаталогНастроек+"\State.dbf");
	//БД = Новый COMОбъект("ADODB.Connection");
	//БД.Open("Provider=Microsoft.Jet.OLEDB.4.0;" +
	//			   "Data Source=" + КаталогНастроек + ";Extended Properties=""DBASE IV;"";");

	//Если ФайлСтатусов.Существует() Тогда
	//Иначе
	//	БД.Execute("Create Table State.dbf (IDPACK char(120), IDINPACK char(120), IDDOC char(240), STATE char(240))");
	//КонецЕсли;
	БД = ПолучитьСоединениеDBF();
	ИдДок = ДокументСсылка.Метаданные().Имя+":"+строка(ДокументСсылка.УникальныйИдентификатор());
	
	ТекстЗапроса	= "Select * from {ФайлБД} where {ФайлБД}.IDDOC like'{ИдДок}%'";
	ТекстЗапроса	= СтрЗаменить(СтрЗаменить(ТекстЗапроса, 
						"{ФайлБД}",		ПараметрыСоединения.ОписаниеСоединенияДБФ.Параметры.ИмяФайла),
						"{ИдДок}",		ИдДок);
	
	RecordSet = Новый ComОбъект("ADODB.Recordset");
    Recordset.CursorLocation = 3;
    Recordset.Open(ТекстЗапроса, БД, 2, 3);

	Если Recordset.EOF=Ложь Тогда 
	Иначе
		RecordSet.AddNew();
	    RecordSet.Fields("IDDOC").value=ИдДок; 
	КонецЕсли;
    Для Каждого Свойство Из СтруктураПараметровДокументаСБИС Цикл
		ОписаниеПоля = ОписаниеПоляДБФПоИмениСвойства(Свойство.Ключ);
		Recordset.Fields(ОписаниеПоля.Имя).value = Лев(Свойство.Значение, ОписаниеПоля.Длина);
	КонецЦикла;
    RecordSet.Update();
КонецФункции

// Для массива документов СБИС ищет по идентификаторам пакетов и вложений документы 1С	
&НаСервере
Процедура ПолучитьТаблицуДокументов1СПоИдВложенияСБИСНаСервере(МассивДокументов, МассивИдентификаторов)
	БД = ПолучитьСоединениеDBF(ПараметрыСоединения);
	
	ТаблицаДокументов1С = Новый ТаблицаЗначений;
	ТаблицаДокументов1С.Колонки.Добавить("Ид", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(999)));
	ТаблицаДокументов1С.Колонки.Добавить("ИдВложения", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(999)));
	ТаблицаДокументов1С.Колонки.Добавить("Ссылка");
	//ФайлСтатусов = Новый Файл(КаталогНастроек+"\State.dbf");
	//Если ФайлСтатусов.Существует() Тогда
	//	БД = Новый COMОбъект("ADODB.Connection");
	//	БД.Open("Provider=Microsoft.Jet.OLEDB.4.0;" +
	//			   "Data Source=" + КаталогНастроек + ";Extended Properties=""DBASE IV;"";");
	ТекстЗапроса	= "Select * from {ФайлБД} where {ФайлБД}.IDPACK like'{ИдПакета}%' and {ФайлБД}.IDINPACK like'{ИдВложения}%'";
	ТекстЗапроса	= СтрЗаменить(ТекстЗапроса, "{ФайлБД}", ПараметрыСоединения.ОписаниеСоединенияДБФ.Параметры.ИмяФайла);
	Для Каждого Элемент Из МассивИдентификаторов Цикл				   
		RecordSet = Новый ComОбъект("ADODB.Recordset");
		Recordset.CursorLocation = 3;
		Recordset.Open(СтрЗаменить(СтрЗаменить(ТекстЗапроса,
			"{ИдПакета}",	Элемент.Ид),
			"{ИдВложения}",	Элемент.ИдВложения),БД,2,3);
		
		//Recordset.Open("Select * from State where State.IDPACK like'"+Элемент.Ид+"%' and State.IDINPACK like'"+Элемент.ИдВложения+"%'",БД,2,3);
		Если Recordset.EOF=Ложь Тогда 
			ТипИдДок = RecordSet.Fields("IDDOC").value;
			ТипДок = Лев(ТипИдДок, Найти(ТипИдДок, ":")-1);
			ИдДок = СокрЛП(Сред(ТипИдДок, Найти(ТипИдДок, ":")+1));
			СсылкаДок = Документы[ТипДок].ПолучитьСсылку(Новый УникальныйИдентификатор(ИдДок));
			НоваяСтрока = ТаблицаДокументов1С.Добавить();
			НоваяСтрока.Ид = Элемент.Ид;
			НоваяСтрока.ИдВложения = Элемент.ИдВложения;
			НоваяСтрока.Ссылка = СсылкаДок;
		КонецЕсли;
	КонецЦикла;
	//КонецЕсли;
	//====================================================================================
	Для каждого стр из МассивДокументов цикл 
		Если стр.СоставПакета[0].Значение.Свойство("Вложение") Тогда
			ДокументПроведен=-1;
			Для Каждого Вложение Из стр.СоставПакета[0].Значение.Вложение Цикл
				Если Не Вложение.Свойство("Служебный") или Вложение.Служебный = "Нет" Тогда
					
					массивДоков =  ТаблицаДокументов1С.найтиСтроки(Новый Структура("Ид, ИдВложения", стр.ИдСБИС, Вложение.Идентификатор) ) ;
					Если массивДоков.количество()>0 тогда 
						Документы1С = Новый СписокЗначений;
						Для Каждого Элемент Из массивДоков Цикл
							Документы1С.Добавить(Элемент.Ссылка);
							стр.Документы1С.Добавить(Элемент.Ссылка);
						КонецЦикла;
						Вложение.Вставить("Документы1С", Документы1С);
						стр.Вставить("СуммаДокумента1С", 0);
						стр.Вставить("Дельта", 0);
						ДокументПроведен = ?(ДокументПроведен=-1,сбисИндексКартинкиПоДокументу1С(массивДоков[0].Ссылка), ДокументПроведен);
						стр.Вставить("Проведен", ДокументПроведен);
					Иначе
						Вложение.Вставить("Документы1С",Новый СписокЗначений);
						стр.Вставить("СуммаДокумента1С", 0);
						Если Не стр.Свойство("Проведен") Тогда
							стр.Вставить("Проведен", -1);
						КонецЕсли;
						стр.Вставить("Дельта", 0);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

// проставляет статусы по идентификаторам пакетов при получении списка изменений	
&НаСервере
Процедура ЗаписатьИзмененияПоДокументам1СНаСервере(МассивДокументов, Ини)
	БД = ПолучитьСоединениеDBF(ПараметрыСоединения);
	
	ТекстЗапроса	= "Select * from {ФайлБД} where {ФайлБД}.IDPACK like'{ИдПакета}%'";
	ТекстЗапроса	= СтрЗаменить(ТекстЗапроса, "{ФайлБД}", ПараметрыСоединения.ОписаниеСоединенияДБФ.Параметры.ИмяФайла);
	Для Каждого СоставПакета Из МассивДокументов Цикл
		Если СоставПакета.Свойство("Идентификатор") и СоставПакета.Свойство("Состояние") Тогда
			Если СоставПакета.Свойство("Редакция") и СоставПакета.Редакция[0].Актуален = "Нет" Тогда  // на документах 1С проставляем статусы только для актуальных редакций
				Продолжить;
			КонецЕсли;
			RecordSet = Новый ComОбъект("ADODB.Recordset");
			Recordset.CursorLocation = 3;
			Recordset.Open(СтрЗаменить(ТекстЗапроса, "{ИдПакета}", СоставПакета.Идентификатор),БД,2,3);
			Пока Recordset.EOF = Ложь Цикл
				// alo <<
				СоставПакета.вставить("Документы1С",новый списокЗначений);
				
				ТипИдДок = RecordSet.Fields("IDDOC").value;
				ТипДок = Лев(ТипИдДок, Найти(ТипИдДок, ":")-1);
				ИдДок = СокрЛП(Сред(ТипИдДок, Найти(ТипИдДок, ":")+1));
				СсылкаДок = Документы[ТипДок].ПолучитьСсылку(Новый УникальныйИдентификатор(ИдДок));
				Если сбисПриоритетСтатуса(СоставПакета.Состояние.Название) > сбисПриоритетСтатуса(RecordSet.Fields("STATE").value) Тогда
					RecordSet.Fields("STATE").value = СоставПакета.Состояние.Название; 
					RecordSet.Update();
					СоставПакета.Документы1С.Добавить(СсылкаДок);
					// alo >>
				КонецЕсли;
				
				ИмяДокумента = СсылкаДок.Метаданные().Имя;
				//Если Найти(нрег(ИмяДокумента), "фактура")>0 Тогда // в фактуре проставляем дату и способ выставления
				Если Ини.Свойство(ИмяДокумента) и Ини[ИмяДокумента].Свойство("мФайл") Тогда
					Попытка
						Если СоставПакета.Свойство("Событие") и СоставПакета.Событие[0].Название = "Подтверждение даты получения" Тогда
							Событие=СоставПакета.Событие[0];
							Для Каждого Элемент Из Ини[ИмяДокумента].мФайл Цикл
								Если Элемент.Значение.Свойство("ЗаполнятьДатуСпособВыставления") и Элемент.Значение.ЗаполнятьДатуСпособВыставления.Значение ="'Истина'" Тогда
									ИмяРеквизитаДатыВыставления = Сред(Элемент.Значение.ДатаВыставления.Значение, Найти(Элемент.Значение.ДатаВыставления.Значение, ".")+1);
									ИмяРеквизитаСпособаВыставления = Сред(Элемент.Значение.СпособВыставления.Значение, Найти(Элемент.Значение.СпособВыставления.Значение, ".")+1);
									ЗначениеСпособаВыставления = Элемент.Значение.СпособВыставления.Вычислить;
									ДокОбъект = СсылкаДок.ПолучитьОбъект();
									ДокОбъект[ИмяРеквизитаДатыВыставления] = Событие.ДатаВремяДокумента;
									ДокОбъект[ИмяРеквизитаСпособаВыставления] = ЗначениеСпособаВыставления;
									ДокОбъект.Записать();
								КонецЕсли;
								Прервать;
							КонецЦикла;
						КонецЕсли;
					Исключение
					КонецПопытки;
				КонецЕсли;
				//КонецЕсли;
				RecordSet.MoveNext();
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
	//КонецЕсли;
	
КонецПроцедуры

// удаляет свойства для документа 1С (при удалении сопоставления)
&НаСервере
Функция УдалитьПараметрыДокументаСБИСНаСервере(СтруктураПараметровДокументаСБИС, ДокументСсылка)
	//ФайлСтатусов = Новый Файл(КаталогНастроек+"\State.dbf");
	//Если ФайлСтатусов.Существует() Тогда
	//	БД = Новый COMОбъект("ADODB.Connection");
	//	БД.Open("Provider=Microsoft.Jet.OLEDB.4.0;" +
	//			   "Data Source=" + КаталогНастроек + ";Extended Properties=""DBASE IV;"";");
	БД = ПолучитьСоединениеDBF(ПараметрыСоединения);
	
	ИдДок = ДокументСсылка.Метаданные().Имя+":"+строка(ДокументСсылка.УникальныйИдентификатор());
	RecordSet = Новый ComОбъект("ADODB.Recordset");
	Recordset.CursorLocation = 3;
	
	ТекстЗапроса	= "Select * from {ФайлБД} where {ФайлБД}.IDDOC like'{ИдПакета}%'";
	ТекстЗапроса	= СтрЗаменить(СтрЗаменить(ТекстЗапроса, 
						"{ФайлБД}",		ПараметрыСоединения.ОписаниеСоединенияДБФ.Параметры.ИмяФайла),
						"{ИдПакета}",	ИдДок);
	Recordset.Open(ТекстЗапроса, БД, 2, 3);
	
	Если Recordset.EOF=Ложь Тогда 
		Recordset.Delete(); 
	КонецЕсли;
	//КонецЕсли;
КонецФункции

&НаСервере
Функция УдалитьПараметрыДокументаСБИСПарамНаСервере(СтруктураПараметровДокументаСБИС,ДокументСсылка)
	УдалитьПараметрыДокументаСБИСНаСервере(СтруктураПараметровДокументаСБИС,ДокументСсылка);
КонецФункции

&НаСервере
Функция НайтиДокументы1СПоПакетуСБИСНаСервере(ПолныйСоставПакета, КэшИни, МассивСлужебных)
	БД = ПолучитьСоединениеDBF(ПараметрыСоединения);
	сч = 0;
	Для Каждого Вложение Из ПолныйСоставПакета.Вложение Цикл
		Если Не Вложение.Свойство("Служебный") или Вложение.Служебный = "Нет" Тогда
			ДанныеДокумента1С = НайтиДокументы1СПоИдВложенияСБИСНаСервере(ПолныйСоставПакета.Идентификатор, Вложение.Идентификатор);
			ПолныйСоставПакета.Вложение[сч].Вставить("Документы1С", Новый СписокЗначений);
			ПолныйСоставПакета.Вложение[сч].Вставить("Документ1СПроведен");
			Если ЗначениеЗаполнено(ДанныеДокумента1С) Тогда
				ПолныйСоставПакета.Вложение[сч].Документы1С=ДанныеДокумента1С.Ссылки;
				ПолныйСоставПакета.Вложение[сч].Документ1СПроведен=ДанныеДокумента1С.Проведен;
			КонецЕсли;
		Иначе
			МассивСлужебных.Добавить(сч);
		КонецЕсли;
		сч = сч+1;
	КонецЦикла;		
КонецФункции

&НаСервере
Функция НайтиДокументы1СПоИдВложенияСБИСНаСервере(Ид, ИдВложения)
	// Ищет документы 1С По идентификаторам пакета и вложения
	Документы1С = Новый СписокЗначений;
	ЕстьПроведенный = Ложь;
	//ФайлСтатусов = Новый Файл(КаталогНастроек+"\State.dbf");
	//Если ФайлСтатусов.Существует() Тогда
	//	БД = Новый COMОбъект("ADODB.Connection");
	//	БД.Open("Provider=Microsoft.Jet.OLEDB.4.0;" +
	//			   "Data Source=" + КаталогНастроек + ";Extended Properties=""DBASE IV;"";");
	БД = ПолучитьСоединениеDBF(ПараметрыСоединения);
	
	ТекстЗапроса	= "Select * from {ФайлБД} where {ФайлБД}.IDPACK like'{ИдПакета}%' and {ФайлБД}.IDINPACK like'{ИдВложения}%'";
	ТекстЗапроса	= СтрЗаменить(СтрЗаменить(СтрЗаменить(ТекстЗапроса, 
						"{ФайлБД}",		ПараметрыСоединения.ОписаниеСоединенияДБФ.Параметры.ИмяФайла),
						"{ИдПакета}",	Ид),
						"{ИдВложения}",	ИдВложения);
	
	RecordSet = Новый ComОбъект("ADODB.Recordset");
	Recordset.CursorLocation = 3;
	
	
	Recordset.Open(ТекстЗапроса, БД, 2, 3);
	Пока Recordset.EOF=Ложь Цикл 
		ТипИдДок = RecordSet.Fields("IDDOC").value;
		ТипДок = Лев(ТипИдДок, Найти(ТипИдДок, ":")-1);
		ИдДок = СокрЛП(Сред(ТипИдДок, Найти(ТипИдДок, ":")+1));
		СсылкаДок = Документы[ТипДок].ПолучитьСсылку(Новый УникальныйИдентификатор(ИдДок));
		Документы1С.Добавить(СсылкаДок);
		Попытка    // попытка на случай отправки справочника, а не документа
			Если СсылкаДок.Проведен Тогда
				ЕстьПроведенный = Истина;
			КонецЕсли;
		Исключение
		КонецПопытки;
		RecordSet.MoveNext();
	КонецЦикла;
	//КонецЕсли;
	
	Возврат Новый Структура("Ссылки, Проведен",Документы1С, ЕстьПроведенный);
КонецФункции

&НаСервере
Функция ПрочитатьПараметрыДокументаСБИСНаСервере(ДокументСсылка, ИмяСвойства)
	// возвращает свойство (статус, идентификатор пакета, идентификатор вложения) документа 1С 	
	ИмяПоля = ИмяПоляДБФПоИмениСвойства(ИмяСвойства);
	//ФайлСтатусов = Новый Файл(КаталогНастроек+"\State.dbf");
	//Если ФайлСтатусов.Существует() Тогда
	//	БД = Новый COMОбъект("ADODB.Connection");
	//	БД.Open("Provider=Microsoft.Jet.OLEDB.4.0;" +
	//			   "Data Source=" + КаталогНастроек + ";Extended Properties=""DBASE IV;"";");
	БД		= ПолучитьСоединениеDBF(ПараметрыСоединения);
	ИдДок	= ДокументСсылка.Метаданные().Имя+":"+строка(ДокументСсылка.УникальныйИдентификатор());
	
	ТекстЗапроса	= "Select * from {ФайлБД} where {ФайлБД}.IDDOC='{ИдДок}'";
	ТекстЗапроса	= СтрЗаменить(СтрЗаменить(ТекстЗапроса, 
						"{ФайлБД}",		ПараметрыСоединения.ОписаниеСоединенияДБФ.Параметры.ИмяФайла),
						"{ИдДок}",		ИдДок);
	
	RecordSet = Новый ComОбъект("ADODB.Recordset");
	Recordset.CursorLocation = 3;
	Recordset.Open(ТекстЗапроса, БД, 2, 3);
	Если Recordset.EOF = Ложь Тогда 
		Возврат RecordSet.Fields(ИмяПоля).value;
	КонецЕсли;	
	//КонецЕсли;
	Возврат "";
КонецФункции

&НаСервере
Процедура ПолучитьТаблицуДокументов1СПоИдПакетаСБИСНаСервере(МассивДокументов)
	// Для массива документов СБИС ищет по идентификаторам пакетов документы 1С	
	ТаблицаДокументов1С = Новый ТаблицаЗначений;
	ТаблицаДокументов1С.Колонки.Добавить("Ид", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(999)));
	ТаблицаДокументов1С.Колонки.Добавить("Ссылка");
	//ФайлСтатусов = Новый Файл(КаталогНастроек+"\State.dbf");
	//Если ФайлСтатусов.Существует() Тогда
	//	БД = Новый COMОбъект("ADODB.Connection");
	//	БД.Open("Provider=Microsoft.Jet.OLEDB.4.0;" +
	//			   "Data Source=" + КаталогНастроек + ";Extended Properties=""DBASE IV;"";");
	БД = ПолучитьСоединениеDBF(ПараметрыСоединения);
	
	ТекстЗапроса	= "Select * from {ФайлБД} where {ФайлБД}.IDPACK like'{ИдПакета}%'";
	ТекстЗапроса	= СтрЗаменить(ТекстЗапроса, "{ФайлБД}",	ПараметрыСоединения.ОписаниеСоединенияДБФ.Параметры.ИмяФайла);
	Для Каждого Элемент Из МассивДокументов Цикл				   
		RecordSet = Новый ComОбъект("ADODB.Recordset");
		Recordset.CursorLocation = 3;
		Recordset.Open(СтрЗаменить(ТекстЗапроса, "{ИдПакета}",	Элемент.ИдСБИС),БД,2,3);
		Если Recordset.EOF=Ложь Тогда 
			ТипИдДок = RecordSet.Fields("IDDOC").value;
			ТипДок = Лев(ТипИдДок, Найти(ТипИдДок, ":")-1);
			ИдДок = СокрЛП(Сред(ТипИдДок, Найти(ТипИдДок, ":")+1));
			СсылкаДок = Документы[ТипДок].ПолучитьСсылку(Новый УникальныйИдентификатор(ИдДок));
			НоваяСтрока = ТаблицаДокументов1С.Добавить();
			НоваяСтрока.Ид = Элемент.ИдСБИС;
			НоваяСтрока.Ссылка = СсылкаДок;
		КонецЕсли;
	КонецЦикла;
	
	//КонецЕсли;
	//====================================================================================
	Для каждого стр из МассивДокументов цикл 
		массивДоков =  ТаблицаДокументов1С.найтиСтроки(Новый Структура("Ид", стр.ИдСБИС) ) ;
		Если массивДоков.количество()>0 тогда 
			Документы1С = Новый СписокЗначений;
			Для Каждого Элемент Из массивДоков Цикл
				Документы1С.Добавить(Элемент.Ссылка);
			КонецЦикла;
			стр.Вставить("Документы1С", Документы1С);
			Попытка
				стр.Вставить("СуммаДокумента1С", массивДоков[0].Ссылка.СуммаДокумента);
				Дельта = Число(стр.Сумма) - стр.СуммаДокумента1С;
				Дельта = ?(Дельта<0,-Дельта,Дельта);
				стр.Вставить("Дельта", Дельта);
			Исключение
				стр.Вставить("СуммаДокумента1С", 0);
				стр.Вставить("Дельта", 0);
			КонецПопытки;
			стр.Вставить("Проведен", сбисИндексКартинкиПоДокументу1С(массивДоков[0].Ссылка));
		Иначе
			стр.Вставить("Документы1С",Новый СписокЗначений);
			стр.Вставить("СуммаДокумента1С", 0);
			стр.Вставить("Проведен", -1);
			стр.Вставить("Дельта", 0);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСтатусыВТаблицеДокументов1СНаСервере(МассивДокументов1С, ПараметрыФильтра)
	// Используется при построении реестров 1С. Проставляет статусы документов и накладывает фильтр по состоянию документов.
	// Используется только в случае хранения статусов в ДБФ, т.к. при хранении в 1С статусы получаем сразу в запросе.
	ОтфильтрованныйМассивДокументов1С = Новый Массив;
	
	БД = ПолучитьСоединениеDBF();
	
	КоличествоДок = МассивДокументов1С.Количество();
	Шаг = 2000;
	Счетчик = 0;
	ТекущееКоличество = 0;
	
	ТаблицаСтатусов = Новый ТаблицаЗначений;
	ТаблицаСтатусов.Колонки.Добавить("Документ1С");
	ТаблицаСтатусов.Колонки.Добавить("Статус");
	ТаблицаСтатусов.Колонки.Добавить("ИдСБИС");
	
	ТекстЗапроса	= "Select * from {ФайлБД} where {ФайлБД}.IDDOC IN(";
	ТекстЗапроса	= СтрЗаменить(ТекстЗапроса, "{ФайлБД}", ПараметрыСоединения.ОписаниеСоединенияДБФ.Параметры.ИмяФайла);
	
	// делаем запросы статусов из ДБФ по партиям для каждых 2000 документов 1С (разбиваем по частям, т.к. при большом количестве документов ругается "слишком сложный запрос")
	Пока ТекущееКоличество< КоличествоДок Цикл
		RecordSet = Новый ComОбъект("ADODB.Recordset");
		Recordset.CursorLocation = 3;
		sql_str = ТекстЗапроса;
		ВремКоличество = Мин(ТекущееКоличество+Шаг, КоличествоДок)-1;
		Для Счетчик=ТекущееКоличество По ВремКоличество Цикл
			ИдДок=МассивДокументов1С[Счетчик].СоставПакета[0].Значение.Метаданные().Имя+":"+строка(МассивДокументов1С[Счетчик].СоставПакета[0].Значение.УникальныйИдентификатор());
			
			sql_str = sql_str+"'"+ИдДок + "', ";	
		КонецЦикла;
		sql_str = Лев(sql_str, СтрДлина(sql_str)-2);
		sql_str = sql_str+")";
		Recordset.Open(sql_str,БД,2,3);
		
		Пока Recordset.EOF=Ложь Цикл 
			НоваяСтр	= ТаблицаСтатусов.Добавить();
			ТипИдДок	= RecordSet.Fields("IDDOC").value;
			ТипДок		= Лев(ТипИдДок, Найти(ТипИдДок, ":")-1);
			ИдДок		= СокрЛП(Сред(ТипИдДок, Найти(ТипИдДок, ":")+1));
			СсылкаДок	= Документы[ТипДок].ПолучитьСсылку(Новый УникальныйИдентификатор(ИдДок));
			
			НоваяСтр.Документ1С = СсылкаДок;
			НоваяСтр.Статус		= RecordSet.Fields("STATE").value;
			НоваяСтр.ИдСБИС		= RecordSet.Fields("IDPACK").value;
			RecordSet.MoveNext();
		КонецЦикла;
		ТекущееКоличество = ТекущееКоличество + Шаг;
	КонецЦикла;
	// проставляем статусы в таблице документов 1С, накладываем фильтр по состоянию документа
	Для Каждого Стр из МассивДокументов1С цикл 
		МассивДоков =  ТаблицаСтатусов.НайтиСтроки(Новый Структура("Документ1С", стр.Документ1С) ) ;
		Если МассивДоков.количество() тогда 
			ИндексКартинки	= СбисИндексКартинкиПоСтатусуЭД(массивДоков[0].Статус);
			ИдПакетаСбис	= МассивДоков[0].ИдСБИС;
		Иначе
			ИндексКартинки	= -1;
			ИдПакетаСбис	= "";
		КонецЕсли;
		Если ПараметрыФильтра.ФильтрСостояние = "Все документы" или
			(ПараметрыФильтра.ФильтрСостояние = "Недоставленные" и (ИндексКартинки=1 или ИндексКартинки=2 или ИндексКартинки=9)) или
			((ПараметрыФильтра.ФильтрСостояние = "Требующие ответа" или ПараметрыФильтра.ФильтрСостояние = "Не получен ответ") и ИндексКартинки=4) или 
			(ПараметрыФильтра.ФильтрСостояние = "Утвержденные" и ИндексКартинки=6) или 
			(ПараметрыФильтра.ФильтрСостояние = "Отклоненные" и ИндексКартинки=5) или
			(ПараметрыФильтра.ФильтрСостояние = "С ошибками" и ИндексКартинки=3) или
			(ПараметрыФильтра.ФильтрСостояние = "Удаленные" и (ИндексКартинки=7 или ИндексКартинки=8)) или // alo
			(ПараметрыФильтра.ФильтрСостояние = "Удаленные контрагентом" и ИндексКартинки=7) или // alo
			(ПараметрыФильтра.ФильтрСостояние = "Удаленные мной" и ИндексКартинки=8) или // alo
			(ПараметрыФильтра.ФильтрСостояние = "Не отправленные" и ИндексКартинки=-1) Тогда
			Стр.Вставить("Статус", ИндексКартинки);
			Стр.Вставить("ИдСБИС", ИдПакетаСбис);
			ОтфильтрованныйМассивДокументов1С.Добавить(Стр);
		КонецЕсли;
	КонецЦикла;
	
	
	//Для Каждого Стр Из МассивДокументов1С Цикл
	//	Статус =  ПрочитатьПараметрыДокументаСБИС(Стр.СоставПакета[0].Значение, КаталогНастроек, "ДокументСБИС_Статус");
	//	ИндексКартинки = сбисИндексКартинкиПоСтатусуЭД(Статус);
	//	Если ПараметрыФильтра.ФильтрСостояние = "Все документы" или
	//		(ПараметрыФильтра.ФильтрСостояние = "Недоставленные" и (ИндексКартинки=1 или ИндексКартинки=2)) или
	//		((ПараметрыФильтра.ФильтрСостояние = "Требующие ответа" или ПараметрыФильтра.ФильтрСостояние = "Не получен ответ") и ИндексКартинки=4) или 
	//		(ПараметрыФильтра.ФильтрСостояние = "Утвержденные" и ИндексКартинки=6) или 
	//		(ПараметрыФильтра.ФильтрСостояние = "Отклоненные" и ИндексКартинки=5) или
	//		(ПараметрыФильтра.ФильтрСостояние = "С ошибками" и ИндексКартинки=3) или
	//		(ПараметрыФильтра.ФильтрСостояние = "Удалено контрагентом" и ИндексКартинки=7) или
	//		(ПараметрыФильтра.ФильтрСостояние = "Удаленные" и ИндексКартинки=8) или
	//		(ПараметрыФильтра.ФильтрСостояние = "Несопоставленные" и ИндексКартинки=-1) Тогда
	//		Стр.Вставить("Статус", ИндексКартинки);
	//		ОтфильтрованныйМассивДокументов1С.Добавить(Стр);
	//	КонецЕсли;
	//КонецЦикла;
	Возврат ОтфильтрованныйМассивДокументов1С;
КонецФункции

