&НаКлиенте
Функция ПереносСопоставленийНоменклатуры_СправочникиРегистры() Экспорт
	Перем ИмяРеквизитаХарактеристики, ИмяРеквизитаGTIN; 
	
	Кэш = ВладелецФормы.Кэш;
	МодульТекущий = МодульОбъектаКлиент();
	
	ПараметрыЗапросаСопоставление = Новый Структура;
	ИниКонфигурация				= Кэш.ини.Конфигурация;
	ИмяРегистраИсточник			= ИниКонфигурация.НоменклатураПоставщиков.Значение;
	ИмяРеквизитаНаименование	= ИниКонфигурация.НоменклатураПоставщиков_Наименование.Значение;
	ИмяРеквизитаИдентификатор	= ИниКонфигурация.НоменклатураПоставщиков_Идентификатор.Значение;
	ИмяРеквизитаНоменклатура	= ИниКонфигурация.НоменклатураПоставщиков_Номенклатура.Значение;
	ИмяРеквизитаКонтрагент		= ИниКонфигурация.НоменклатураПоставщиков_Контрагент.Значение;
	ВладелецПартнер				= Найти(ИниКонфигурация.НоменклатураПоставщиков_Контрагент.Данные, "Партнер") > 0;
	ИмяСправочникаКонтрагенты	= ИниКонфигурация.Контрагенты.Значение;
	
	ПараметрыПолученияУзла	= Новый ФиксированнаяСтруктура("ИмяРеквизита", Истина);

	ИмяРеквизитаНаименование	= МодульТекущий.СтроковоеЗначениеУзлаИни(ИмяРеквизитаНаименование, ПараметрыПолученияУзла);
	ИмяРеквизитаИдентификатор	= МодульТекущий.СтроковоеЗначениеУзлаИни(ИмяРеквизитаИдентификатор, ПараметрыПолученияУзла);
	ИмяРеквизитаНоменклатура	= МодульТекущий.СтроковоеЗначениеУзлаИни(ИмяРеквизитаНоменклатура, ПараметрыПолученияУзла);
	ИмяРеквизитаКонтрагент		= МодульТекущий.СтроковоеЗначениеУзлаИни(ИмяРеквизитаКонтрагент, ПараметрыПолученияУзла);
	
	ИмяИсточника = СтрЗаменить(МодульТекущий.СсылочныйТипСтрокой(ИмяРегистраИсточник), "Ссылка.", ".");
	
	ПараметрыЗапросаСопоставление.Вставить("ИмяИсточника",				ИмяИсточника);
	ПараметрыЗапросаСопоставление.Вставить("ИмяРеквизитаНаименование",	ИмяРеквизитаНаименование);
	ПараметрыЗапросаСопоставление.Вставить("ИмяРеквизитаИдентификатор",	ИмяРеквизитаИдентификатор);
	ПараметрыЗапросаСопоставление.Вставить("ИмяРеквизитаНоменклатура",	ИмяРеквизитаНоменклатура);
	ПараметрыЗапросаСопоставление.Вставить("ИмяРеквизитаКонтрагент",	ИмяРеквизитаКонтрагент);
	ПараметрыЗапросаСопоставление.Вставить("ВладелецПартнер",			ВладелецПартнер);
	ПараметрыЗапросаСопоставление.Вставить("ИмяСправочникаКонтрагенты",	ИмяСправочникаКонтрагенты);
	
	
	Если ИниКонфигурация.Свойство("НоменклатураПоставщиков_Характеристика") Тогда
		
		ИмяРеквизитаХарактеристики = ИниКонфигурация.НоменклатураПоставщиков_Характеристика.Значение;
		ИмяРеквизитаХарактеристики = МодульТекущий.СтроковоеЗначениеУзлаИни(ИмяРеквизитаХарактеристики, ПараметрыПолученияУзла);		
		ПараметрыЗапросаСопоставление.Вставить("ИмяРеквизитаХарактеристики",	ИмяРеквизитаХарактеристики);
		
	КонецЕсли;
	
	Если ИниКонфигурация.Свойство("НоменклатураПоставщиков_GTIN") Тогда
		
		НоменклатураПоставщиков_GTIN = ИниКонфигурация.НоменклатураПоставщиков_GTIN.Значение;
		НоменклатураПоставщиков_GTIN = МодульТекущий.СтроковоеЗначениеУзлаИни(НоменклатураПоставщиков_GTIN, ПараметрыПолученияУзла);		
		ПараметрыЗапросаСопоставление.Вставить("ИмяРеквизитаGTIN",	НоменклатураПоставщиков_GTIN);
		
	КонецЕсли;

	ДанныеСопоставлений = ДанныеДляПереносаСправочниковРегистров(ПараметрыЗапросаСопоставление);
	РазмерПакета		= 200;

	ПараметрыПереносаСопоставлений = ПараметрыПереносаСопоставлений_Получить();
	
	Если ЗначениеЗаполнено(ПараметрыПереносаСопоставлений.Контрагент) Тогда
		КлючиУдалить = Новый Массив;
		Для Каждого КлючЗначение Из ДанныеСопоставлений Цикл
			
			Если КлючЗначение.Ключ = ПараметрыПереносаСопоставлений.Контрагент Тогда
				Прервать;
			Иначе
				КлючиУдалить.Добавить(КлючЗначение.Ключ); //Удаляем всех контрагентов до того, на котором оборовался перенос
			КонецЕсли;
			
		КонецЦикла;		
		
		Если КлючиУдалить.Количество() Тогда
			Для Каждого КлючУдалить Из КлючиУдалить Цикл
				ДанныеСопоставлений.Удалить(КлючУдалить);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого КонтрагентНоменклатура Из ДанныеСопоставлений Цикл // Контрагент ключ, значение массив структур

		стрКонтрагент			= Новый Структура("СвФЛ", Новый Структура("ИНН", КонтрагентНоменклатура.Ключ));
		ПакетСопоставлений		= Новый Массив;	
		СчетчикСтраниц			= 1;
		
		Если НЕ КонтрагентНоменклатура.Ключ = ПараметрыПереносаСопоставлений.Контрагент Тогда // Если по контрагенту продолжается перенос, счетчик обнулять не нужно
			
			ПараметрыПереносаСопоставлений.Страница	= 1;
			ПараметрыПереносаСопоставлений.Контрагент		= КонтрагентНоменклатура.Ключ;
			ПараметрыПереносаСопоставлений.Начат			= Истина;			
			ПараметрыПереносаСопоставлений_Записать(ПараметрыПереносаСопоставлений);
			
		КонецЕсли;
			
		Для Каждого Сопоставление Из КонтрагентНоменклатура.Значение Цикл
			
			Если ПакетСопоставлений.Количество() = РазмерПакета Тогда

				Если СчетчикСтраниц = ПараметрыПереносаСопоставлений.Страница Тогда
					
					НоменклатураПоставщика_МассовоеОбновление(Новый Структура("Номенклатура, Контрагент", ПакетСопоставлений, стрКонтрагент), 
															Новый Структура("Кэш",Кэш)); // Отправим пакет
															
				  	ПараметрыПереносаСопоставлений.Страница	= ПараметрыПереносаСопоставлений.Страница + 1;		
					ПараметрыПереносаСопоставлений_Записать(ПараметрыПереносаСопоставлений);
					
				КонецЕсли;

				СчетчикСтраниц = СчетчикСтраниц + 1;
               		
			КонецЕсли;
			
			ДанныеЗаполнения = Новый Структура("АртикулСБИС, ИдентификаторСБИС, БазоваяЕдиницаОКЕИ, ЕдИзмСБИС");
			ДанныеЗаполнения.Вставить("НазваниеСБИС",				Сопоставление.НаименованиеСБИС);
			ДанныеЗаполнения.Вставить("ИдентификаторСБИС",			Сопоставление.ИдентификаторСБИС);
			ДанныеЗаполнения.Вставить("ТипКодаСБИС",				"Идентификатор");
			ДанныеЗаполнения.Вставить("GTIN_СБИС",					Сопоставление.GTIN);
			ДанныеЗаполнения.Вставить("НеобходимоСопоставление",	Истина);
			ДанныеЗаполнения.Вставить("Номенклатура",				Новый Массив);
			
			НоменклатураДобавить = Новый Структура();
			НоменклатураДобавить.Вставить("Номенклатура",	Сопоставление.Номенклатура);
			НоменклатураДобавить.Вставить("Идентификатор",	Сопоставление.Идентификатор1С);
			НоменклатураДобавить.Вставить("Характеристика",	Сопоставление.Характеристика);
			НоменклатураДобавить.Вставить("Основное",		Истина);
			
			// Заполняем единицу 1С
			ЕдиницаСтруктура = МодульТекущий.НовыйСопоставлениеДляЕдиницыКлиент();
			
			БазоваяЕдиница1С = МодульТекущий.ПолучитьБазовуюЕдиницуДляНоменклатуры1СКлиент(Сопоставление.Номенклатура);
			
			ОКЕИ = МодульТекущий.ОКЕИБазовойЕдиницыНоменклатуры1С(БазоваяЕдиница1С);
			
			МодульТекущий.СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСтруктура, "Ссылка", БазоваяЕдиница1С);
			МодульТекущий.СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСтруктура, "Владелец", Сопоставление.Номенклатура);
			МодульТекущий.СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСтруктура, "ОКЕИ", ОКЕИ);             
			
			НазваниеЕдиницы = Строка(БазоваяЕдиница1С);
			МодульТекущий.СопоставлениеДляЕдиницыКлиент_Вставить(ЕдиницаСтруктура, "Название", НазваниеЕдиницы);
			
			ЕдиницаСоответствие = Новый Соответствие;
			ЕдиницаСоответствие.Вставить(БазоваяЕдиница1С, ЕдиницаСтруктура);
			
			НоменклатураДобавить.Вставить("ЕдИзм1С", ЕдиницаСоответствие);
			
			ДанныеЗаполнения.Номенклатура.Добавить(НоменклатураДобавить);
			
			ДопПараметрыЗаписиСопоставления = Новый Структура;
			ДопПараметрыЗаписиСопоставления.Вставить("ЗаполнениеНоменклатуры1С", Истина);
			ДопПараметрыЗаписиСопоставления.Вставить("НеобходимоСопоставление", Истина);
			
			СтрокаСопоставленияСБИС = МодульОбъектаКлиент().НовыйСтрокаСопоставленияСБИСКлиент(ДанныеЗаполнения, ДопПараметрыЗаписиСопоставления);
			ПакетСопоставлений.Добавить(СтрокаСопоставленияСБИС);
           					
		КонецЦикла;
		
		Если ПакетСопоставлений.Количество() И СчетчикСтраниц = ПараметрыПереносаСопоставлений.Страница Тогда  // Отправим остаток
					
			НоменклатураПоставщика_МассовоеОбновление(Новый Структура("Номенклатура, Контрагент", ПакетСопоставлений, стрКонтрагент), Новый Структура("Кэш",Кэш));
			ПараметрыПереносаСопоставлений.Страница	= ПараметрыПереносаСопоставлений.Страница + 1;		
			ПараметрыПереносаСопоставлений_Записать(ПараметрыПереносаСопоставлений);
          			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

// Функция - Получает данные для переноса сопоставлений из справочников и регистров
//
// Параметры:
//  ИниКонфигурация	 - 	 Ини конфигурации из кэша 
// 
// Возвращаемое значение:
//   Соответствие. ИНН Контрагента ключ, значение массив структур 
//
Функция ДанныеДляПереносаСправочниковРегистров(ПараметрыЗапросаСопоставление)

	Запрос = Новый Запрос;
	
	Если ПараметрыЗапросаСопоставление.ВладелецПартнер Тогда
		ИмяРеквизитаКонтрагент = "Контрагенты";
	Иначе
		ИмяРеквизитаКонтрагент = "Сопоставления." + ПараметрыЗапросаСопоставление.ИмяРеквизитаКонтрагент;
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	" + ИмяРеквизитаКонтрагент + ".ИНН												КАК ИНН,
		|	Сопоставления." + ПараметрыЗапросаСопоставление.ИмяРеквизитаИдентификатор	+ " КАК ИдентификаторСБИС,
		|	Сопоставления." + ПараметрыЗапросаСопоставление.ИмяРеквизитаНоменклатура	+ " КАК Номенклатура,
		|	Сопоставления." + ПараметрыЗапросаСопоставление.ИмяРеквизитаНаименование	+ " КАК НаименованиеСБИС";
		
	Если ПараметрыЗапросаСопоставление.Свойство("ИмяРеквизитаХарактеристики") Тогда
		Запрос.Текст = Запрос.Текст+",
		|	Сопоставления." + ПараметрыЗапросаСопоставление.ИмяРеквизитаХарактеристики	+ " КАК Характеристика";	
	КонецЕсли;
	
	Если ПараметрыЗапросаСопоставление.Свойство("ИмяРеквизитаGTIN") Тогда
		Запрос.Текст = Запрос.Текст+",
		|	Сопоставления." + ПараметрыЗапросаСопоставление.ИмяРеквизитаGTIN	+ " КАК GTIN";	
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "	
		|ИЗ
		|	" + ПараметрыЗапросаСопоставление.ИмяИсточника + " КАК Сопоставления";
	
	Если ПараметрыЗапросаСопоставление.ВладелецПартнер Тогда
		Запрос.Текст = Запрос.Текст + "
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ПараметрыЗапросаСопоставление.ИмяСправочникаКонтрагенты + " КАК Контрагенты
		|		ПО Сопоставления.Владелец = Контрагенты.Партнер";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
			|		ГДЕ Сопоставления." + ПараметрыЗапросаСопоставление.ИмяРеквизитаИдентификатор	+ " <> """"
			|		И ВЫРАЗИТЬ(Сопоставления." + ПараметрыЗапросаСопоставление.ИмяРеквизитаНаименование	+ " КАК СТРОКА(99)) <> """"";
	
	Если Лев(ПараметрыЗапросаСопоставление.ИмяИсточника, 10) = "Справочник" Тогда
		
		Запрос.Текст = Запрос.Текст + " И НЕ Сопоставления.ПометкаУдаления";	
		
	КонецЕсли;
	
	РезультатЗапроса			= Запрос.Выполнить();
	ВыборкаДетальныеЗаписи		= РезультатЗапроса.Выбрать();
	ДанныеДляПереноса			= Новый Соответствие;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ИНН = СокрЛП(ВыборкаДетальныеЗаписи.ИНН);
		Если НЕ ЗначениеЗаполнено(ИНН)
				ИЛИ Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураСопоставления		= Новый Структура("Идентификатор1С, Номенклатура, ИдентификаторСБИС, ТипКодаСБИС, НаименованиеСБИС, Характеристика, GTIN");
		СопоставленияКонтрагента	= ДанныеДляПереноса.Получить(ИНН);
		
		ЗаполнитьЗначенияСвойств(СтруктураСопоставления, ВыборкаДетальныеЗаписи);
		СтруктураСопоставления.Идентификатор1С	= Строка(ВыборкаДетальныеЗаписи.Номенклатура.УникальныйИдентификатор());
		СтруктураСопоставления.ТипКодаСБИС		= "Идентификатор";
		
		Если СопоставленияКонтрагента  = Неопределено Тогда
			
			НаборСопоставлений = Новый Массив;
			НаборСопоставлений.Добавить(СтруктураСопоставления);
			ДанныеДляПереноса.Вставить(ИНН, НаборСопоставлений);
			
		Иначе
			
			СопоставленияКонтрагента.Добавить(СтруктураСопоставления);			
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеДляПереноса;
	
КонецФункции

// Процедура - Перенос сопоставлений номенклатуры ДБФ
//
// Параметры:
//  ПараметрыПереносаСопоставлений	 - Структура 
//
&НаКлиенте
Процедура ПереносСопоставленийНоменклатуры_ДБФ(ПараметрыПереносаСопоставлений)
	
	Кэш			= ВладелецФормы.Кэш;	
	ФормаДБФ	= МодульОбъектаКлиент().ПолучитьФормуОбработки("СопоставлениеНоменклатуры_ДБФ");
	
	Если Не ЗначениеЗаполнено(ФормаДБФ.ПараметрыСоединения) Тогда
		КаталогСопоставлениеНаСервере = Кэш.ОбщиеФункции.РассчитатьЗначение("ФормаРаботыСНоменклатуройПоставщика_КаталогНаСервере", Кэш.Ини.Конфигурация);
		ФормаДБФ.УстановитьПараметрыМодуля(Новый Структура("Каталог", КаталогСопоставлениеНаСервере), Кэш);
	КонецЕсли;
	
	Если ПараметрыПереносаСопоставлений.Начат Тогда
		
		КлючиКонтрагентов	= Новый Массив;

		Для Каждого КлючКонтрагента Из ФормаДБФ.СписокКаталоговСопоставлений() Цикл
			
			Если НЕ КлючКонтрагента = ПараметрыПереносаСопоставлений.Контрагент И КлючиКонтрагентов.Найти(КлючКонтрагента) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			КлючиКонтрагентов.Добавить(КлючКонтрагента);
			
		КонецЦикла;
		
	Иначе
		КлючиКонтрагентов = ФормаДБФ.СписокКаталоговСопоставлений();
	КонецЕсли;

	Для Каждого Ключ Из КлючиКонтрагентов Цикл
		
		стрКонтрагент		= Новый Структура("СвФЛ", Новый Структура("ИНН",Ключ));
		ПараметрыПереносаСопоставлений.Страница = 1;
		ПродолжитьПеренос	= Истина;
		
		Пока ПродолжитьПеренос Цикл
			
			ПараметрыСписка	= Новый Структура();
			ПараметрыСписка.Вставить("Контрагент", Новый Структура("СвФЛ", Новый Структура("ИНН", Ключ)));
			ПараметрыСписка.Вставить("Навигация", Новый Структура("РазмерСтраницы, Страница", 200, ПараметрыПереносаСопоставлений.Страница));
			
			Попытка
				
				ДопПараметрыПереноса = Новый Структура("НеобходимоСопоставление", Истина);
				ПорцияСопоставлений = ФормаДБФ.НоменклатураПоставщика_Список(ПараметрыСписка, ДопПараметрыПереноса);
				
				ПродолжитьПеренос	= Булево(ПорцияСопоставлений.Список.Количество());
				
				Если ПродолжитьПеренос Тогда
					НоменклатураПоставщика_МассовоеОбновление(Новый Структура("Номенклатура, Контрагент", ПорцияСопоставлений.Список, стрКонтрагент),
															  Новый Структура("Кэш", Кэш));
				КонецЕсли;
				
				ПродолжитьПеренос = ПорцияСопоставлений.Навигация.ЕстьЕще;

				ПараметрыПереносаСопоставлений.Страница		= ПараметрыПереносаСопоставлений.Страница + 1;
				ПараметрыПереносаСопоставлений.Начат		= Истина;
				ПараметрыПереносаСопоставлений.Контрагент	= Ключ;
				
				
			Исключение                                                                                                        
		
				ВызватьИсключение МодульОбъектаКлиент().СбисИсключение_Представление(ИнформацияОбОшибке());
				
			КонецПопытки;
					
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Перенос сопоставлений c ДБФ/Справочников/Регистров.
//
// Параметры:
//  ПараметрыПереноса	 - 	Структура(ФормаСопоставленияНоменклатуры) - источник сопоставлений 
//
&НаКлиенте
Процедура ПереносСопоставлений(ПараметрыПереноса) Экспорт 
	
	ПараметрыПереносаСопоставлений	= ПараметрыПереносаСопоставлений_Получить(); 
	
	Если НЕ ПараметрыПереносаСопоставлений.Начат Тогда
		
		ПараметрыПереносаСопоставлений.Форма	= ПараметрыПереноса.ФормаСопоставленияНоменклатуры;
       	ПараметрыПереносаСопоставлений_Записать(ПараметрыПереносаСопоставлений)
		
	КонецЕсли;
	
	Если ПараметрыПереносаСопоставлений.Форма = "СопоставлениеНоменклатуры_ДБФ" Тогда
		ПереносСопоставленийНоменклатуры_ДБФ(ПараметрыПереносаСопоставлений);
	Иначе
		ПереносСопоставленийНоменклатуры_СправочникиРегистры() 
	КонецЕсли;
	
	ПараметрыПереносаСопоставлений.Завершен = Истина;
	ПараметрыПереносаСопоставлений_Записать(ПараметрыПереносаСопоставлений);
	МодульОбъектаКлиент().СбисСообщить("Перенос номенклатуры завершен");
	
КонецПроцедуры	

&НаКлиенте
Функция ПараметрыПереносаСопоставлений_Получить()
	
	ПараметрыПереносаСопоставлений	= Новый Структура;
	ПараметрыПереносаСопоставлений.Вставить("Страница",		МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПараметрыПереносаСопоставлений_Страница"));
	ПараметрыПереносаСопоставлений.Вставить("Контрагент", 	МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПараметрыПереносаСопоставлений_Контрагент"));
	ПараметрыПереносаСопоставлений.Вставить("Начат", 		МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПараметрыПереносаСопоставлений_Начат"));
	ПараметрыПереносаСопоставлений.Вставить("Завершен", 	МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПараметрыПереносаСопоставлений_Завершен"));
	ПараметрыПереносаСопоставлений.Вставить("Форма",		МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПараметрыПереносаСопоставлений_Форма"));
	
    Возврат ПараметрыПереносаСопоставлений;

КонецФункции

&НаКлиенте
Функция ПараметрыПереносаСопоставлений_Записать(ПараметрыПереносаСопоставлений)
	
	Для Каждого Параметр Из ПараметрыПереносаСопоставлений Цикл
		МодульОбъектаКлиент().ИзменитьПараметрСбис("ПараметрыПереносаСопоставлений_"+Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция ПараметрыПереносаСопоставлений_Очистить() Экспорт
	
	ПараметрыПереносаСопоставлений	= Новый Структура;
	ПараметрыПереносаСопоставлений.Вставить("Страница",		1);
	ПараметрыПереносаСопоставлений.Вставить("Контрагент",	"");
	ПараметрыПереносаСопоставлений.Вставить("Начат",		Ложь);
	ПараметрыПереносаСопоставлений.Вставить("Завершен",		Ложь);
	ПараметрыПереносаСопоставлений.Вставить("Форма",		"");
	
	
	ПараметрыПереносаСопоставлений_Записать(ПараметрыПереносаСопоставлений);
	
КонецФункции

// ContractorNomenclatureCollation.MassUpdate/2
//  - метод для записи / обновления сопоставлений. Во внешней обработке вызывается при загрузке документа после ручного или автоматического указания сопоставлений на форме входящего документа и форме редактирования сопоставлений.
//
// Параметры:
//  ПараметрыОбновитьВходящие	 - Структура
//		Контрагент	- Структура с полями СвФл, либо СвЮл
//		Номенклатура - Массив структур с классами сопоставления
//
//  ДопПараметры							 - Структура
//
&НаКлиенте
Процедура НоменклатураПоставщика_МассовоеОбновление(ПараметрыОбновитьВходящие, ДопПараметры) Экспорт

	Попытка
		ПараметрыЗаписиСервер = Новый Структура;
		ПараметрыЗаписиСервер.Вставить("Номенклатура",	ПараметрыОбновитьВходящие.Номенклатура);
		ПараметрыЗаписиСервер.Вставить("Ключ",			КлючКонтрагентаСопоставления(ПараметрыОбновитьВходящие.Контрагент));
		НоменклатураПоставщика_МассовоеОбновлениеВызовМетода(ПараметрыЗаписиСервер, ДопПараметры);
		ПараметрыОбновитьВходящие.Номенклатура = ПараметрыЗаписиСервер.Номенклатура;
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнфоОбОшибке, "СопоставлениеНоменклатуры_СБИС.НоменклатураПоставщика_МассовоеОбновление");
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Функция НоменклатураПоставщика_МассовоеОбновлениеВызовМетода(ПараметрыОбновитьВходящие, ДопПараметры)	
	Перем ИсходноеСопоставление;
	
	ДопПараметры.Свойство("ИсходноеСопоставление", ИсходноеСопоставление);
	
	ЗаписиСопоставлений	= Новый Массив;
	ИдХарактеристик		= ИдХарактеристикСопоставлений(ПараметрыОбновитьВходящие.Номенклатура);
	
	Для Каждого КлассСопоставления Из ПараметрыОбновитьВходящие.Номенклатура Цикл
		
		Если КлассСопоставления.Свойство("НеобходимоСопоставление")
			И Не КлассСопоставления.НеобходимоСопоставление Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Номенклатура Из КлассСопоставления.Номенклатура1С Цикл
			
			БазовыеЗаписи = Новый Массив;
			
			СтруктураЗаписи = Новый Структура("DocumentId, Main, Id, CatalogType, Name, BaseMeasureUnitCode, MeasureUnitId, MeasureUnitName,
			|MeasureUnitCode, MeasureUnitQty, ContrName, ContrCode, CodeType, ContrGTIN, ContrChar, ContrMeasureUnitCode, 
			|ContrMeasureUnitName, ContrMeasureUnitQty");
			
			Если КлассСопоставления.Свойство("ИдентификаторДокумента") Тогда		
				СтруктураЗаписи.DocumentId			= КлассСопоставления.ИдентификаторДокумента;
			КонецЕсли;
			
			СтруктураЗаписи.Main					= Номенклатура.Значение.Основное;
			Если НЕ ЗначениеЗаполнено(Номенклатура.Значение.Идентификатор) Тогда
				СтруктураЗаписи.Id						= Номенклатура.Ключ.УникальныйИдентификатор();
			Иначе
				СтруктураЗаписи.Id						= Номенклатура.Значение.Идентификатор;
			КонецЕсли;
			СтруктураЗаписи.CatalogType				= Строка(ТипЗнч(Номенклатура.Ключ));
			СтруктураЗаписи.Name					= Строка(Номенклатура.Ключ);
			СтруктураЗаписи.BaseMeasureUnitCode		= СокрЛП(Номенклатура.Значение.БазоваяЕдиницаОКЕИ);					
			СтруктураЗаписи.ContrName				= КлассСопоставления.НоменклатураСБИС.Наименование;
			СтруктураЗаписи.ContrCode				= КлассСопоставления.НоменклатураСБИС.Код;
			СтруктураЗаписи.CodeType				= КлассСопоставления.НоменклатураСБИС.ТипКода;
			СтруктураЗаписи.ContrGTIN				= КлассСопоставления.НоменклатураСБИС.GTIN;
			СтруктураЗаписи.ContrChar		= КлассСопоставления.НоменклатураСБИС.Характеристика.Наименование;
			
			Если ЗначениеЗаполнено(Номенклатура.Значение.Характеристики) Тогда
				
				Для Каждого Характеристика Из Номенклатура.Значение.Характеристики Цикл
					
					ЗаписьСопоставления = Новый Структура(Новый ФиксированнаяСтруктура(СтруктураЗаписи)); // Для каждой Номенклатура+Характеристика свои записи
					ЗаписьСопоставления.Вставить("IdChar", ИдХарактеристик.Получить(Характеристика));
					
					БазовыеЗаписи.Добавить(ЗаписьСопоставления);
					
				КонецЦикла;
				
			Иначе
				БазовыеЗаписи.Добавить(СтруктураЗаписи);
			КонецЕсли;
			
			Для Каждого ЗаписьСопоставления Из БазовыеЗаписи Цикл // Для каждой единицы пишем отдельную строку сопоставления
				
				Если КлассСопоставления.НоменклатураСБИС.Единицы.Количество() Тогда
					
					Для Каждого ЕдиницаПоставщика Из КлассСопоставления.НоменклатураСБИС.Единицы Цикл // Единица одна, но ключ неизвестен, поэтому цикл 
						
						Если Номенклатура.Значение.Единицы.Количество() Тогда
							
							Для Каждого Единица Из Номенклатура.Значение.Единицы Цикл 
								
								Если НЕ СопоставлениеИзменено(ИсходноеСопоставление, Единица) Тогда // ИсходноеСопоставление заполненяется только для единичного обновления, в массиве 1 элем
									Продолжить;
								КонецЕсли;
								
								НоваяЗаписьСопоставления = Новый Структура();
								Для каждого СтрЗаписи Из ЗаписьСопоставления Цикл
									НоваяЗаписьСопоставления.Вставить(СтрЗаписи.Ключ, СтрЗаписи.Значение);
								КонецЦикла; 
								
								НоваяЗаписьСопоставления.MeasureUnitName		= СокрЛП(Единица.Значение.Название);		
								НоваяЗаписьСопоставления.MeasureUnitCode		= СокрЛП(Единица.Значение.ОКЕИ);
								НоваяЗаписьСопоставления.MeasureUnitQty			= ЕдиницаПоставщика.Значение.Коэффициент;

								// Базовая единица сейчас та же, что и единица в строке сопоставления 1С
								НоваяЗаписьСопоставления.BaseMeasureUnitCode	= СокрЛП(Единица.Значение.ОКЕИ);
								
								НоваяЗаписьСопоставления.ContrMeasureUnitCode	= СокрЛП(ЕдиницаПоставщика.Значение.ОКЕИ);
								НоваяЗаписьСопоставления.ContrMeasureUnitName	= СокрЛП(ЕдиницаПоставщика.Значение.Название);
								НоваяЗаписьСопоставления.ContrMeasureUnitQty	= Единица.Значение.Коэффициент;
								
								ЗаписиСопоставлений.Добавить(НоваяЗаписьСопоставления);
								
							КонецЦикла; 
							
						Иначе
							НоваяЗаписьСопоставления = Новый Структура(Новый ФиксированнаяСтруктура(ЗаписьСопоставления));
							
							НоваяЗаписьСопоставления.ContrMeasureUnitCode	= СокрЛП(ЕдиницаПоставщика.Значение.ОКЕИ);
							НоваяЗаписьСопоставления.ContrMeasureUnitName	= СокрЛП(ЕдиницаПоставщика.Значение.Название);
							НоваяЗаписьСопоставления.ContrMeasureUnitQty	= ЕдиницаПоставщика.Значение.Коэффициент;
							
							ЗаписиСопоставлений.Добавить(НоваяЗаписьСопоставления);
						КонецЕсли;
						
					КонецЦикла;
					
				ИначеЕсли Номенклатура.Значение.Единицы.Количество() Тогда
					
					Для Каждого Единица Из Номенклатура.Значение.Единицы Цикл 
						
						Если НЕ СопоставлениеИзменено(ИсходноеСопоставление, Единица) Тогда // ИсходноеСопоставление заполненяется только для единичного обновления, в массиве 1 элем
							Продолжить;
						КонецЕсли;
						
						НоваяЗаписьСопоставления = Новый Структура(Новый ФиксированнаяСтруктура(ЗаписьСопоставления)); 
						
						НоваяЗаписьСопоставления.MeasureUnitName			= СокрЛП(Единица.Значение.Название);		
						НоваяЗаписьСопоставления.MeasureUnitCode			= СокрЛП(Единица.Значение.ОКЕИ);
						НоваяЗаписьСопоставления.MeasureUnitQty				= Единица.Значение.Коэффициент;
						
						// Базовая единица сейчас та же, что и единица в строке сопоставления 1С
						НоваяЗаписьСопоставления.BaseMeasureUnitCode		= СокрЛП(Единица.Значение.ОКЕИ);
						
						ЗаписиСопоставлений.Добавить(НоваяЗаписьСопоставления);
						
					КонецЦикла; 
					
				Иначе
					ЗаписиСопоставлений.Добавить(Новый Структура(Новый ФиксированнаяСтруктура(ЗаписьСопоставления)));				
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
	Если Не ЗаписиСопоставлений.Количество() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для Каждого СтруктураЗаписи Из ЗаписиСопоставлений Цикл
		
		Для Каждого ЭлемСтруктуры Из СтруктураЗаписи Цикл
			
			Если ЭлемСтруктуры.Значение = Неопределено Тогда
				СтруктураЗаписи.Удалить(ЭлемСтруктуры.Ключ); // По требованиям онлайна значения должны быть заполнены
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ПараметрыМетода = Новый Структура;	
	ПараметрыМетода.Вставить("Contractor", Новый Структура("Inn",ПараметрыОбновитьВходящие.Ключ));
	ПараметрыМетода.Вставить("Data", ЗаписиСопоставлений);
	
	Отказ				= Ложь;
	РезультатЗаписи = ДопПараметры.Кэш.Интеграция.ContractorNomenclatureCollation_MassUpdate(ДопПараметры.Кэш, ПараметрыМетода, Новый Структура("СообщатьПриОшибке",Истина),Отказ);
	                                                
	Если Отказ Тогда
		
		СбисИсключение = МодульОбъектаКлиент().НовыйСбисИсключение("Ошибка при записи сопоставлений: " + РезультатЗаписи,
													ДопПараметры.Кэш.ФормаРаботыСНоменклатурой + ".НоменклатураПоставщика_МассовоеОбновлениеВызовМетода");
		МодульОбъектаКлиент().СообщитьСбисИсключение(СбисИсключение);	
		
	ИначеЕсли РезультатЗаписи.Свойство("contragent_found") И НЕ РезультатЗаписи.contragent_found Тогда
													
		СбисИсключение = МодульОбъектаКлиент().НовыйСбисИсключение("Ошибка при записи сопоставлений: не найден контрагент с ИНН" + ПараметрыОбновитьВходящие.Ключ,
													ДопПараметры.Кэш.ФормаРаботыСНоменклатурой + ".НоменклатураПоставщика_МассовоеОбновлениеВызовМетода");
		МодульОбъектаКлиент().СообщитьСбисИсключение(СбисИсключение);
		
	ИначеЕсли РезультатЗаписи.Свойство("errors") И РезультатЗаписи.errors.Количество() Тогда
		
		ТекстОшибки = "";
		БазоваяОшибка = "Ошибка при записи сопоставлений:";
		Для Каждого Ошибка Из РезультатЗаписи.errors Цикл			
			ТекстОшибки = ТекстОшибки + Ошибка.Error + Символы.ПС;
		КонецЦикла;	
		
		СбисИсключение = МодульОбъектаКлиент().НовыйСбисИсключение(БазоваяОшибка, ДопПараметры.Кэш.ФормаРаботыСНоменклатурой + ".НоменклатураПоставщика_МассовоеОбновлениеВызовМетода", , ТекстОшибки);
		МодульОбъектаКлиент().СообщитьСбисИсключение(СбисИсключение);
	Иначе
		// Сообщим пользователю, что всё прошло успешно
		МодульОбъектаКлиент().СбисСообщить("Сопоставление номенклатуры успешно завершено");
	КонецЕсли;	
	
	// Если всё успешно записали, то признак нужно обнулить (с)Сычев
	Для Каждого КлассСопоставления Из ПараметрыОбновитьВходящие.Номенклатура Цикл
		
		Если КлассСопоставления.Свойство("НеобходимоСопоставление")
			И КлассСопоставления.НеобходимоСопоставление Тогда
			
			МодульОбъектаКлиент().СтрокаСопоставленияСБИСКлиент_Вставить(КлассСопоставления, "НеобходимоСопоставление", Ложь);
			
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

// ContractorNomenclatureCollation.MassDelete/2
//  - метод для удаления сопоставлений.
//
// Параметры:
//  ПараметрыОбновитьВходящие	 - Структура
//		Контрагент	- Структура с полями СвФл, либо СвЮл
//		Удалить - Массив структур с полями для удаления по фильтру
//  ДопПараметры							 - Структура
//
&НаКлиенте
Процедура НоменклатураПоставщика_МассовоеУдаление(ПараметрыОбновитьВходящие, ДопПараметры) Экспорт 
	
	Попытка
		ПараметрыЗаписиСервер = Новый Структура;
		ПараметрыЗаписиСервер.Вставить("Номенклатура",		ПараметрыОбновитьВходящие.Номенклатура); 
		ПараметрыЗаписиСервер.Вставить("Ключ",			КлючКонтрагентаСопоставления(ПараметрыОбновитьВходящие.Контрагент));		
		НоменклатураПоставщика_МассовоеУдалениеВызовМетода(ПараметрыЗаписиСервер, ДопПараметры);
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнфоОбОшибке, "СопоставлениеНоменклатуры_СБИС.НоменклатураПоставщика_МассовоеОбновление");
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Функция НоменклатураПоставщика_МассовоеУдалениеВызовМетода(ПараметрыОбновитьВходящие, ДопПараметры)
	
	МассивНоменклатуры	= Новый Массив; 
	ИдХарактеристик		= ИдХарактеристикСопоставлений(ПараметрыОбновитьВходящие.Номенклатура);
	
	Для Каждого КлассСопоставления Из ПараметрыОбновитьВходящие.Номенклатура Цикл 
		
		Для Каждого Номенклатура Из КлассСопоставления.Номенклатура1С Цикл
			
			Если Номенклатура.Значение.Характеристики.Количество() Тогда
				
				Для Каждого Характеристика Из Номенклатура.Значение.Характеристики Цикл
					
					СтруктураЗаписи						= Новый Структура("Id, IdChar, ContrCode, CodeType");		
					
					// Обязательные поля
					СтруктураЗаписи.Id					= Номенклатура.Значение.Идентификатор;
					СтруктураЗаписи.ContrCode			= КлассСопоставления.НоменклатураСБИС.Код;
					СтруктураЗаписи.CodeType			= КлассСопоставления.НоменклатураСБИС.ТипКода;
					СтруктураЗаписи.IdChar				= ИдХарактеристик.Получить(Характеристика);
					
					// Необязательные поля
					Если ЗначениеЗаполнено(КлассСопоставления.НоменклатураСБИС.GTIN) Тогда
						СтруктураЗаписи.Вставить("ContrGTIN",			КлассСопоставления.НоменклатураСБИС.GTIN);	
					КонецЕсли;
					Если ЗначениеЗаполнено(КлассСопоставления.НоменклатураСБИС.Характеристика.Наименование) Тогда
						СтруктураЗаписи.Вставить("ContrChar",	КлассСопоставления.НоменклатураСБИС.Характеристика.Наименование);
					КонецЕсли;
					
					МассивНоменклатуры.Добавить(СтруктураЗаписи);

				КонецЦикла;
				
			Иначе
				
				СтруктураЗаписи						= Новый Структура("Id, ContrCode, CodeType");
				
				// Обязательные поля
				СтруктураЗаписи.Id					= Номенклатура.Значение.Идентификатор;
				СтруктураЗаписи.ContrCode			= КлассСопоставления.НоменклатураСБИС.Код;
				СтруктураЗаписи.CodeType			= КлассСопоставления.НоменклатураСБИС.ТипКода;
				
				// Необязательные поля
				Если ЗначениеЗаполнено(КлассСопоставления.НоменклатураСБИС.GTIN) Тогда
					СтруктураЗаписи.Вставить("ContrGTIN",			КлассСопоставления.НоменклатураСБИС.GTIN);	
				КонецЕсли;
				Если ЗначениеЗаполнено(КлассСопоставления.НоменклатураСБИС.Характеристика.Наименование) Тогда
					СтруктураЗаписи.Вставить("ContrChar",	КлассСопоставления.НоменклатураСБИС.Характеристика.Наименование);
				КонецЕсли;
				
				МассивНоменклатуры.Добавить(СтруктураЗаписи);
			
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЦикла;	
	
	ПараметрыМетода = Новый Структура;	
	ПараметрыМетода.Вставить("Contractor",Новый Структура("Inn",ПараметрыОбновитьВходящие.Ключ));
	ПараметрыМетода.Вставить("Data",МассивНоменклатуры);
	
	Отказ = Ложь;
	РезультатУдаления = ДопПараметры.Кэш.Интеграция.ContractorNomenclatureCollation_MassDelete(ДопПараметры.Кэш, ПараметрыМетода, Новый Структура("СообщатьПриОшибке",Истина),Отказ);
	
	Если Отказ Тогда
		МодульОбъектаКлиент().ВызватьСбисИсключение("Ошибка при удалении сопоставлений со СБИС: " + РезультатУдаления,
													ДопПараметры.Кэш.ФормаРаботыСНоменклатурой + ".НоменклатураПоставщика_МассовоеУдалениеВызовМетода");		
	КонецЕсли;
												
	
КонецФункции

// ContractorNomenclatureCollation.MassFind/2
//  - метод для записи / обновления сопоставлений. Во внешней обработке вызывается при загрузке документа после ручного или автоматического указания сопоставлений на форме входящего документа и форме редактирования сопоставлений.
//
// Параметры:
//  ПараметрыОбновитьВходящие	 - Структура
//		Контрагент						- Структура с полями СвФл, либо СвЮл. Для входящих документов это Контрагент, для исходящих это Отправитель
//		Номенклатура 					- Массив классов
//  ДопПараметры						- Структура
//
&НаКлиенте
Функция НоменклатураПоставщика_МассовыйПоиск(ПараметрыОбновитьВходящие, ДопПараметры) Экспорт

	НоменклатураКлючи1С = Новый Массив;
	НоменклатураКлючиСБИС = Новый Массив;
	// Через ДопПараметры прокинуть метод запроса сопоставлений с Онлайна (Контрагент/Организация)	
	Для Каждого КлассСопоставления Из ПараметрыОбновитьВходящие.Номенклатура Цикл
		Если КлассСопоставления.Номенклатура1С.Количество() Тогда
			НоменклатураКлючи1С.Добавить(КлассСопоставления);	
		ИначеЕсли ЗначениеЗаполнено(КлассСопоставления.НоменклатураСБИС.Код) ИЛИ ЗначениеЗаполнено(КлассСопоставления.НоменклатураСБИС.GTIN) Тогда   // Почему принудительно ищем по ключам СБИС если есть код?
			НоменклатураКлючиСБИС.Добавить(КлассСопоставления);
		Иначе
			НоменклатураКлючи1С.Добавить(КлассСопоставления);
		КонецЕсли;
	КонецЦикла;
	
	Если НоменклатураКлючиСБИС.Количество() Тогда
		Попытка
			ПараметрыЗаписи = Новый Структура;
			ПараметрыЗаписи.Вставить("Номенклатура",	НоменклатураКлючиСБИС);
			ПараметрыЗаписи.Вставить("Ключ",			КлючКонтрагентаСопоставления(ПараметрыОбновитьВходящие.Контрагент));
			НоменклатураКлючиСБИС = НоменклатураПоставщика_ОбогатитьПоКлючамСБИС(ПараметрыЗаписи, ДопПараметры);
		Исключение
			ИнфоОбОшибке = ИнформацияОбОшибке();
			МодульОбъектаКлиент().ВызватьСбисИсключение(ИнфоОбОшибке, "СопоставлениеНоменклатуры_СБИС.НоменклатураПоставщика_МассовыйПоиск");
		КонецПопытки;
	КонецЕсли;
	
	Если НоменклатураКлючи1С.Количество() Тогда
		Попытка
			ПараметрыЗаписи = Новый Структура;
			ПараметрыЗаписи.Вставить("Номенклатура",	НоменклатураКлючи1С);
			ПараметрыЗаписи.Вставить("Ключ",			КлючКонтрагентаСопоставления(ПараметрыОбновитьВходящие.Контрагент));
			НоменклатураКлючи1С = НоменклатураПоставщика_ОбогатитьПоКлючам1С(ПараметрыЗаписи, ДопПараметры);
		Исключение
			ИнфоОбОшибке = ИнформацияОбОшибке();
			МодульОбъектаКлиент().ВызватьСбисИсключение(ИнфоОбОшибке, "СопоставлениеНоменклатуры_СБИС.НоменклатураПоставщика_МассовыйПоиск");
		КонецПопытки;
	КонецЕсли;
	
		
	//Склеить ответы
	Для Каждого Номенклатура Из НоменклатураКлючи1С Цикл
		НоменклатураКлючиСБИС.Добавить(Номенклатура);	
	КонецЦикла;
	
	Возврат НоменклатураКлючиСБИС;
	
КонецФункции

&НаКлиенте
Функция	НоменклатураПоставщика_ОбогатитьПоКлючамСБИС(ПараметрыОбновитьВходящие, ДопПараметры) 
	
	МассивНоменклатуры = Новый Массив; 
		
	Для Каждого КлассСопоставления Из ПараметрыОбновитьВходящие.Номенклатура Цикл
		
		Для Каждого ЕдиницаПоставщика Из КлассСопоставления.НоменклатураСБИС.Единицы Цикл
			
			СтруктураЗаписи = Новый Структура("DocumentId, DocumentType, DocumentDate, DocumentNumber, ContrCode, CodeType, ContrChar, ContrGTIN, ContrMeasureUnitCode, ContrMeasureUnitName");		
			СтруктураЗаписи.ContrCode				= КлассСопоставления.НоменклатураСБИС.Код;
			СтруктураЗаписи.CodeType				= КлассСопоставления.НоменклатураСБИС.ТипКода;
			СтруктураЗаписи.ContrChar		= КлассСопоставления.НоменклатураСБИС.Характеристика.Наименование;
			СтруктураЗаписи.ContrGTIN				= КлассСопоставления.НоменклатураСБИС.GTIN; 
						
			Если КлассСопоставления.Свойство("ИдентификаторДокумента") И ЗначениеЗаполнено(КлассСопоставления.ИдентификаторДокумента) Тогда		
				СтруктураЗаписи.DocumentId					= КлассСопоставления.ИдентификаторДокумента;
			ИначеЕсли ДопПараметры.Свойство("ДокументДляСопоставления") И НЕ ДопПараметры.ДокументДляСопоставления = Неопределено Тогда
				СтруктураЗаписи.DocumentType = ДопПараметры.ДокументДляСопоставления.Тип;
				СтруктураЗаписи.DocumentDate = ДопПараметры.ДокументДляСопоставления.Дата;
				СтруктураЗаписи.DocumentNumber = ДопПараметры.ДокументДляСопоставления.Номер;       
			КонецЕсли;
	 
			СтруктураЗаписи.ContrMeasureUnitCode	= ЕдиницаПоставщика.Значение.ОКЕИ;
			СтруктураЗаписи.ContrMeasureUnitName	= ЕдиницаПоставщика.Значение.Название; 
		
			МассивНоменклатуры.Добавить(СтруктураЗаписи);
			
		КонецЦикла;
			
	КонецЦикла;	
	
	ПараметрыМетода = Новый Структура;	
	ПараметрыМетода.Вставить("Contractor",Новый Структура("Inn",ПараметрыОбновитьВходящие.Ключ));
	ПараметрыМетода.Вставить("Data",МассивНоменклатуры);	

	Отказ = Ложь;
	ДанныеСопоставлений = ДопПараметры.Кэш.Интеграция.ContractorNomenclatureCollation_SearchByContractorData(ДопПараметры.Кэш, ПараметрыМетода, Новый Структура("СообщатьПриОшибке",Истина),Отказ);
	
	Если Отказ Тогда
		МодульОбъектаКлиент().ВызватьСбисИсключение("Ошибка при запросе сопоставлений со СБИС: " + ДанныеСопоставлений, ДопПараметры.Кэш.ФормаРаботыСНоменклатурой + ".НоменклатураПоставщика_ОбогатитьПоКлючамСБИС");	
	КонецЕсли;
	
	ОбогатитьОтветСсылками(ДанныеСопоставлений, ДопПараметрыСервер());
	
	НоменклатураПоставщика_ОбогатитьДаннымиПоКлючамСБИС(ПараметрыОбновитьВходящие.Номенклатура, ДанныеСопоставлений, ДопПараметры);
	
	Счетчик = 0;
	Для Каждого Сопоставление Из ДанныеСопоставлений Цикл
		
		Если НЕ Сопоставление.Main Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ Сопоставление.DocumentParameters.Количество() Тогда
			
			ПараметрыОбновитьВходящие.Номенклатура[Счетчик].НоменклатураСБИС.Вставить("Идентификатор", "");
			ПараметрыОбновитьВходящие.Номенклатура[Счетчик].НоменклатураСБИС.Вставить("КодПокупателя", "");
			ПараметрыОбновитьВходящие.Номенклатура[Счетчик].НоменклатураСБИС.Вставить("КодПоставщика", "");
			ПараметрыОбновитьВходящие.Номенклатура[Счетчик].НоменклатураСБИС.Вставить("GTIN", "");
		
			Счетчик = Счетчик + 1;
			Продолжить;
		КонецЕсли;	
		
		Для Каждого ПараметрСтроки Из Сопоставление.DocumentParameters Цикл
			Если ПараметрыОбновитьВходящие.Номенклатура[Счетчик].НоменклатураСБИС.Свойство(ПараметрСтроки.Ключ) Тогда
				ПараметрыОбновитьВходящие.Номенклатура[Счетчик].НоменклатураСБИС.Вставить(ПараметрСтроки.Ключ, ПараметрСтроки.Значение);
			КонецЕсли;
		КонецЦикла;		
		
		Счетчик = Счетчик + 1;
	КонецЦикла;
	Возврат ПараметрыОбновитьВходящие.Номенклатура;
	
КонецФункции

&НаКлиенте
Процедура НоменклатураПоставщика_ОбогатитьДаннымиПоКлючамСБИС(КлассыСопоставлений, ДанныеСопоставлений, ДопПараметры)

	Для Каждого СопоставлениеОнлайн Из ДанныеСопоставлений Цикл
		
		Для Каждого КлассСопоставления Из КлассыСопоставлений Цикл
			
			Если ЗначениеЗаполнено(СопоставлениеОнлайн.Id) И (КлассСопоставления.НоменклатураСБИС.Код = СопоставлениеОнлайн.ContrCode
					ИЛИ (СопоставлениеОнлайн.Свойство("ContrGTIN")
					И КлассСопоставления.НоменклатураСБИС.GTIN = СопоставлениеОнлайн.ContrGTIN))
					И СопоставлениеОнлайн.Main Тогда // Добавить условие по характеристике, когда она будет
				
				 // Заполним класс данными
				ДанныеЗаполнения = Новый Структура("Номенклатура, GTIN, Идентификатор, Характеристика1С, ЕдИзм1С, Основное");
				// ДанныеЗаполнения.GTIN		=  //Его нет в ответе
				ДанныеЗаполнения.Номенклатура			= СопоставлениеОнлайн.Ссылка;
                ДанныеЗаполнения.Идентификатор			= СопоставлениеОнлайн.Id;
				ДанныеЗаполнения.ЕдИзм1С				= ДанныеЗаполненияMeasureUnit(СопоставлениеОнлайн);
				ДанныеЗаполнения.Основное 				= СопоставлениеОнлайн.Main;
				
				Если 	СопоставлениеОнлайн.Свойство("Характеристика")
						И ЗначениеЗаполнено(СопоставлениеОнлайн.Характеристика) Тогда
					ДанныеЗаполнения.Характеристика1С	= СопоставлениеОнлайн.Характеристика;
				КонецЕсли;
				
				СтрНоменклатура1С = КлассСопоставления.Номенклатура1С.Получить(СопоставлениеОнлайн.Ссылка);
				Если СтрНоменклатура1С = Неопределено Тогда
					СтрНоменклатура1С = МодульОбъектаКлиент().НовыйОписаниеНоменклатуры1СКлиент();
				КонецЕсли;
				
				МодульОбъектаКлиент().ОписаниеНоменклатуры1СКлиент_Заполнить(СтрНоменклатура1С, ДанныеЗаполнения);
				
				НоменклатураПоставщика_ДозаполнитьОпциональнымиДанными1С(СтрНоменклатура1С, СопоставлениеОнлайн);
				
				КлассСопоставления.Номенклатура1С.Вставить(СтрНоменклатура1С.Ссылка, СтрНоменклатура1С); 
				
				Если СопоставлениеОнлайн.Свойство("DocumentParameters") Тогда
					КлассСопоставления.Параметры.Вставить("ПараметрыСтрокиСОнлайна", СопоставлениеОнлайн.DocumentParameters);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НоменклатураПоставщика_ДозаполнитьОпциональнымиДанными1С(Номенклатура1С, СопоставлениеОнлайн)
	
	Если СопоставлениеОнлайн.Свойство("ContrMeasureUnitQty") Тогда
		Номенклатура1С.Коэффициент = СопоставлениеОнлайн.ContrMeasureUnitQTY;
	КонецЕсли;  
	
	Если НЕ СопоставлениеОнлайн.Свойство("DocumentParameters") Тогда
		Возврат;
	КонецЕсли;
	
	Если СопоставлениеОнлайн.DocumentParameters.Свойство("gtin") Тогда
		Номенклатура1С.GTIN	= СопоставлениеОнлайн.DocumentParameters.gtin;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДанныеЗаполненияMeasureUnit(Сопоставление, ДопПараметры = Неопределено)
	
	ДанныеЗаполнения = Новый Массив;
	
	Если ЗначениеЗаполнено(Сопоставление.MeasureUnit) Тогда
		Для Каждого ЕдиницаИзмерения Из Сопоставление.MeasureUnit Цикл
			
			ДанныеЗаполненияЕдиницы = Новый Структура("ЕдИзм1С, ОКЕИ_1С, Коэффициент1С, ЕдИзмНаименование1С, Номенклатура");	
			ДанныеЗаполненияЕдиницы.ЕдИзм1С				= ЕдиницаИзмерения.Ссылка;
			ДанныеЗаполненияЕдиницы.ОКЕИ_1С				= ЕдиницаИзмерения.MeasureUnitCode;      
			
			Если Сопоставление.Свойство("ContrMeasureUnitQty") Тогда
				ДанныеЗаполненияЕдиницы.Коэффициент1С		= Сопоставление.ContrMeasureUnitQty;
            КонецЕсли;

			ДанныеЗаполненияЕдиницы.ЕдИзмНаименование1С	= ЕдиницаИзмерения.MeasureUnitName;
			ДанныеЗаполненияЕдиницы.Номенклатура		= Сопоставление.Ссылка;
			
			ДанныеЗаполнения.Добавить(ДанныеЗаполненияЕдиницы);
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ДанныеЗаполнения
	
КонецФункции

&НаКлиенте
Функция СопоставлениеИзменено(Сопоставление, Элемент)

	Если Сопоставление = Неопределено Тогда
		Возврат Истина; //Новое сопоставление созданное вручную
	КонецЕсли;
	
	Если Элемент.Значение._класс = "СопоставлениеДляЕдиницы" Тогда
		
		ОписаниеНоменклатуры1С = Сопоставление.Номенклатура1С.Получить(Элемент.Значение.Владелец);
		
		Если ОписаниеНоменклатуры1С = Неопределено Тогда
			Возврат Истина; //Единица новой номенклатуры 
		КонецЕсли;
		
		ОписаниеЕдиницы = ОписаниеНоменклатуры1С.Единицы.Получить(Элемент.Значение);
		
		Если ОписаниеЕдиницы = Неопределено Тогда
			Возврат Истина; //Новая Единица 			
		КонецЕсли;
		
		//Изменена единица. Что с этим делать непонятно, на онлайне нельзя изменить/удалить единицу. 
		//Если НЕ ОписаниеЕдиницы.Коэффициент = Элемент.Значение.Коэффициент ИЛИ
		//	 НЕ ОписаниеЕдиницы.ОКЕИ = Элемент.Значение.ОКЕИ				 ИЛИ 
		//   НЕ ОписаниеЕдиницы.Название = Элемент.Значение.Название		 Тогда
		//	Возврат Истина;  
		//КонецЕсли;
		
	ИначеЕсли Элемент.Значение._класс = "ОписаниеНоменклатуры1С" Тогда 
		ОписаниеНоменклатуры1С = Сопоставление.Номенклатура1С.Получить(Элемент.Ключ);
		
		Если ОписаниеНоменклатуры1С = Неопределено Тогда
			Возврат Истина; //Новая номенклатура
		КонецЕсли;
		
		Если НЕ ОписаниеНоменклатуры1С.GTIN = Элемент.Значение.GTIN ИЛИ НЕ ОписаниеНоменклатуры1С.Идентификатор = Элемент.Значение.Идентификатор Тогда  
			Возврат Истина;
		КонецЕсли;
		
	Иначе
		МодульОбъектаКлиент().ВызватьСбисИсключение("Недопустимое значение параметра функции Элемент", "СопоставлениеНоменклатуры_СБИС.СопоставлениеИзменено");
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

&НаКлиенте
Функция	НоменклатураПоставщика_ОбогатитьПоКлючам1С(ПараметрыОбновитьВходящие, ДопПараметры)
	
	ДопПараметрыСервер	= ДопПараметрыСервер();	
	МассивНоменклатуры	= Новый Массив; 
	ИдХарактеристик		= ИдХарактеристикСопоставлений(ПараметрыОбновитьВходящие.Номенклатура);
	
	ИскатьПоДокументу = Не ДопПараметры.Свойство("НеИскатьПоДокументу") 
							ИЛИ ДопПараметры.Свойство("НеИскатьПоДокументу") И Не ДопПараметры.НеИскатьПоДокументу;
	
	Для Каждого КлассСопоставления Из ПараметрыОбновитьВходящие.Номенклатура Цикл
		
		ИскатьПоДокументуДляТекущего =	ИскатьПоДокументу
										И КлассСопоставления.Свойство("ИдентификаторДокумента")
										И ЗначениеЗаполнено(КлассСопоставления.ИдентификаторДокумента);
		
		Для Каждого Номенклатура1С Из КлассСопоставления.Номенклатура1С Цикл
			
			Если Номенклатура1С.Значение.Единицы.Количество() Тогда
				
				Для Каждого Единица Из Номенклатура1С.Значение.Единицы Цикл 
					
					Если Номенклатура1С.Значение.Характеристики.Количество() Тогда 
						
						Для Каждого Характеристика Из Номенклатура1С.Значение.Характеристики Цикл
							
							СтруктураЗаписи = Новый Структура("DocumentId, Id, IdChar, MeasureUnitName, MeasureUnitCode");
							
							Если ИскатьПоДокументуДляТекущего Тогда		
								СтруктураЗаписи.DocumentId	= КлассСопоставления.ИдентификаторДокумента;
							КонецЕсли;
							
							СтруктураЗаписи.Id				= Номенклатура1С.Значение.Идентификатор;
							СтруктураЗаписи.IdChar			= ИдХарактеристик.Получить(Характеристика);
							СтруктураЗаписи.MeasureUnitCode	= Единица.Значение.ОКЕИ; 
							СтруктураЗаписи.MeasureUnitName	= Единица.Значение.Название; 
							МассивНоменклатуры.Добавить(СтруктураЗаписи);
							
						КонецЦикла;
						
					Иначе
						
						СтруктураЗаписи = Новый Структура("DocumentId, Id, MeasureUnitName, MeasureUnitCode");
						
						Если ИскатьПоДокументуДляТекущего Тогда
							СтруктураЗаписи.DocumentId		= КлассСопоставления.ИдентификаторДокумента;
						ИначеЕсли НЕ ДопПараметры.Свойство("НеИскатьПоДокументу")
							И ДопПараметры.Свойство("ДокументДляСопоставления") Тогда
							СтруктураЗаписи.DocumentType	= ДопПараметры.ДокументДляСопоставления.Тип;
							СтруктураЗаписи.DocumentDate	= ДопПараметры.ДокументДляСопоставления.ДатаДокумента;
							СтруктураЗаписи.DocumentNumber	= ДопПараметры.ДокументДляСопоставления.НомерДокумента;
						КонецЕсли;
						
						СтруктураЗаписи.Id				= Номенклатура1С.Значение.Идентификатор;
						СтруктураЗаписи.MeasureUnitCode	= Единица.Значение.ОКЕИ;
						СтруктураЗаписи.MeasureUnitName	= Единица.Значение.Название;
						МассивНоменклатуры.Добавить(СтруктураЗаписи);
						
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				
				Если Номенклатура1С.Значение.Характеристики.Количество() Тогда 
					
					Для Каждого Характеристика Из Номенклатура1С.Значение.Характеристики Цикл
						
						СтруктураЗаписи = Новый Структура("DocumentId, Id, IdChar, MeasureUnitName, MeasureUnitCode");
						
						Если ИскатьПоДокументуДляТекущего	Тогда	
							СтруктураЗаписи.DocumentId	= КлассСопоставления.ИдентификаторДокумента;
						КонецЕсли;
						
						СтруктураЗаписи.Id				= Номенклатура1С.Значение.Идентификатор;
						СтруктураЗаписи.IdChar			= ИдХарактеристик.Получить(Характеристика);
						МассивНоменклатуры.Добавить(СтруктураЗаписи);
						
					КонецЦикла;
					
				Иначе
					
					
					СтруктураЗаписи = Новый Структура("DocumentId, Id, MeasureUnitName, MeasureUnitCode");
					
					Если ИскатьПоДокументуДляТекущего Тогда		
						СтруктураЗаписи.DocumentId		= КлассСопоставления.ИдентификаторДокумента;
					ИначеЕсли НЕ ДопПараметры.Свойство("НеИскатьПоДокументу")
						И ДопПараметры.Свойство("ДокументДляСопоставления") Тогда
						СтруктураЗаписи.DocumentType	= ДопПараметры.ДокументДляСопоставления.Тип;
						СтруктураЗаписи.DocumentDate	= ДопПараметры.ДокументДляСопоставления.ДатаДокумента;
						СтруктураЗаписи.DocumentNumber	= ДопПараметры.ДокументДляСопоставления.НомерДокумента;
					КонецЕсли;
					
					СтруктураЗаписи.Id				= Номенклатура1С.Значение.Идентификатор;
					МассивНоменклатуры.Добавить(СтруктураЗаписи);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;	
	
	ПараметрыМетода = Новый Структура;	
	ПараметрыМетода.Вставить("Contractor",Новый Структура("Inn",ПараметрыОбновитьВходящие.Ключ));
	ПараметрыМетода.Вставить("Data",МассивНоменклатуры);
	
	Отказ				= Ложь;
	ДанныеСопоставлений = ДопПараметры.Кэш.Интеграция.ContractorNomenclatureCollation_SearchByOwnerData(ДопПараметры.Кэш, ПараметрыМетода, Новый Структура("СообщатьПриОшибке",Истина),Отказ);
	
	Если Отказ Тогда
		МодульОбъектаКлиент().ВызватьСбисИсключение("Ошибка при чтении сопоставлений со СБИС: " + ДанныеСопоставлений,
						ДопПараметры.Кэш.ФормаРаботыСНоменклатурой + ".НоменклатураПоставщика_ОбогатитьПоКлючам1С");	
	КонецЕсли;
	
	ОбогатитьОтветСсылками(ДанныеСопоставлений, ДопПараметрыСервер());
	
	Для Каждого КлассСопоставления Из ПараметрыОбновитьВходящие.Номенклатура Цикл
		Для Каждого СопоставлениеОнлайн Из ДанныеСопоставлений Цикл   
			
			Номенклатура1С = КлассСопоставления.Номенклатура1С.Получить(СопоставлениеОнлайн.Ссылка);
			
			Если НЕ Номенклатура1С = Неопределено Тогда
				
				КлассСопоставления.НоменклатураСБИС.Наименование					= СопоставлениеОнлайн.ContrName;
				Если СопоставлениеОнлайн.Свойство("ContrChar") Тогда
					КлассСопоставления.НоменклатураСБИС.Характеристика.Наименование	= СопоставлениеОнлайн.ContrChar;
				КонецЕсли;
				КлассСопоставления.НоменклатураСБИС.Код								= СопоставлениеОнлайн.ContrCode;
				КлассСопоставления.НоменклатураСБИС.ТипКода							= СопоставлениеОнлайн.CodeType;
				
				Если ЗначениеЗаполнено(СопоставлениеОнлайн.DocumentParameters) Тогда
					Если СопоставлениеОнлайн.DocumentParameters.Свойство("Идентификатор") Тогда
						КлассСопоставления.НоменклатураСБИС.Вставить("Идентификатор",	СопоставлениеОнлайн.DocumentParameters.Идентификатор);
					КонецЕсли;
					Если СопоставлениеОнлайн.DocumentParameters.Свойство("КодПокупателя") Тогда
						КлассСопоставления.НоменклатураСБИС.Вставить("КодПокупателя",	СопоставлениеОнлайн.DocumentParameters.КодПокупателя);
					КонецЕсли;
					Если СопоставлениеОнлайн.DocumentParameters.Свойство("КодПоставщика") Тогда
						КлассСопоставления.НоменклатураСБИС.Вставить("КодПоставщика",	СопоставлениеОнлайн.DocumentParameters.КодПоставщика);
					КонецЕсли;
					Если СопоставлениеОнлайн.DocumentParameters.Свойство("gtin") Тогда
						КлассСопоставления.НоменклатураСБИС.Вставить("GTIN",			СопоставлениеОнлайн.DocumentParameters.gtin);
					КонецЕсли;
				КонецЕсли;
				
				Если СопоставлениеОнлайн.Свойство("ContrGTIN") И ЗначениеЗаполнено(СопоставлениеОнлайн.ContrGTIN) Тогда
					КлассСопоставления.НоменклатураСБИС.GTIN		= СопоставлениеОнлайн.ContrGTIN;					
				КонецЕсли;
				
				Если СопоставлениеОнлайн.Свойство("ContrMeasureUnitCode") Тогда
					ДанныеЗаполненияЕдиницы				= Новый Структура("ОКЕИ_СБИС, ЕдИзмНаименованиеСБИС, КоэффициентСБИС");
					ДанныеЗаполненияЕдиницы.ОКЕИ_СБИС				= СопоставлениеОнлайн.ContrMeasureUnitCode;
					ДанныеЗаполненияЕдиницы.ЕдИзмНаименованиеСБИС	= СопоставлениеОнлайн.ContrMeasureUnitName;
					Номенклатура1С.Коэффициент			            = СопоставлениеОнлайн.ContrMeasureUnitQty;     
					
					Если СопоставлениеОнлайн.Свойство("MeasureUnit") и СопоставлениеОнлайн.MeasureUnit.Количество() Тогда
						ДанныеЗаполненияЕдиницы.КоэффициентСБИС = СопоставлениеОнлайн.MeasureUnit[0].MeasureUnitQty;
					Иначе
						ДанныеЗаполненияЕдиницы.КоэффициентСБИС = 1;
					КонецЕсли;

					МодульОбъектаКлиент().СопоставлениеДляЕдиницыКлиент_ЗаполнитьСБИС(КлассСопоставления,ДанныеЗаполненияЕдиницы);	
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ПараметрыОбновитьВходящие.Номенклатура;
	
КонецФункции

// ContractorNomenclatureCollation.List/3
// метод для массовой вычитки сопоставлений номенклатурных позиций контрагентов со своей номенклатурой и данных внешней системы.
// Метод возвращает список с данными о сопоставленных позициях, отсортированных в порядке возрастания по ContrName
// Параметры списка структура с полями Контрагент, Навигация, Фильтр
&НаКлиенте
Функция НоменклатураПоставщика_Список(ПараметрыСписка, ДопПараметры) Экспорт
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Contractor",Новый Структура("Inn",КлючКонтрагентаСопоставления(ПараметрыСписка.Контрагент)));
	ПараметрыМетода.Вставить("Navigation",Новый Структура("PageSize, PageNumber", ПараметрыСписка.Навигация.РазмерСтраницы, Число(ПараметрыСписка.Навигация.Страница)-1));
	
	ДопПараметрыСервер =  ДопПараметрыСервер();

	стрФильтр = Новый Структура;
	Если ПараметрыСписка.Свойство("Фильтр") Тогда
		
		Если ПараметрыСписка.Фильтр.Свойство("Номенклатура") И ЗначениеЗаполнено(ПараметрыСписка.Фильтр.Номенклатура) Тогда
			стрФильтр.Вставить("Id",КлючНоменклатурыСопоставления(ПараметрыСписка.Фильтр.Номенклатура, ДопПараметрыСервер));
		КонецЕсли;
		
		Если ПараметрыСписка.Фильтр.Свойство("НаименованиеСБИС") И ЗначениеЗаполнено(ПараметрыСписка.Фильтр.НаименованиеСБИС) Тогда
			стрФильтр.Вставить("ContrName",ПараметрыСписка.Фильтр.НаименованиеСБИС);
		КонецЕсли;
		
		Если ПараметрыСписка.Фильтр.Свойство("GTIN") И ЗначениеЗаполнено(ПараметрыСписка.Фильтр.GTIN) И НЕ ПараметрыСписка.Фильтр.GTIN = "Нет" Тогда
			стрФильтр.Вставить("ContrGTIN",ПараметрыСписка.Фильтр.GTIN);
		КонецЕсли;
		
		Если ПараметрыСписка.Фильтр.Свойство("ИдСБИС") И ЗначениеЗаполнено(ПараметрыСписка.Фильтр.ИдСБИС) Тогда
			стрФильтр.Вставить("ContrCode",ПараметрыСписка.Фильтр.ИдСБИС);
		КонецЕсли;
		
	КонецЕсли;

	ПараметрыМетода.Вставить("Filter",стрФильтр);
	Отказ				= Ложь;
	ДанныеСопоставлений = ДопПараметры.Кэш.Интеграция.ContractorNomenclatureCollation_List(	ДопПараметры.Кэш,
																							ПараметрыМетода, 
																							Новый Структура("СообщатьПриОшибке",Истина),
																							Отказ);
	
	Если Отказ Тогда
		МодульОбъектаКлиент().ВызватьСбисИсключение("Ошибка при чтении сопоставлений со СБИС: " + ДанныеСопоставлений,
													ДопПараметры.Кэш.ФормаРаботыСНоменклатурой + ".НоменклатураПоставщика_Список");												
	КонецЕсли;

	Результат = ПреобразоватьОтветОнлайна(ДанныеСопоставлений);	
	
	Возврат Результат;
	
КонецФункции

