&НаКлиенте
Процедура БыстроеВнедрениеEDI_ПровестиПоискСопоставленийВКонтуре(ПараметрыДляОбогащения, ДопПараметры)
	
	Если НЕ МодульОбъектаКлиент().СведенияОбУстановленныхРасширениях("КонтурEDI") Тогда
		Возврат;
	КонецЕсли;
	
	Сторона = ПараметрыДляОбогащения.Контрагент.Контрагент1С;
	ПартнерИзКонтура = МодульОбъектаКлиент().БыстроеВнедрениеEDI_ПоискПартнераВКонтуре(Сторона);
	ДанныеПоиска = Новый Структура("Партнер, GTIN");
    ДанныеПоиска.Вставить("Партнер", ПартнерИзКонтура);
	
	ОбогащенныеДанныеНоменклатурыДляСопоставления = ПараметрыДляОбогащения.Номенклатура;
	
	СписокGTIN = Новый Массив;
	
	Для Каждого КлассНоменклатуры ИЗ ОбогащенныеДанныеНоменклатурыДляСопоставления Цикл

		Если ЗначениеЗаполнено(КлассНоменклатуры.НоменклатураСБИС.GTIN) Тогда
			СписокGTIN.Добавить(КлассНоменклатуры.НоменклатураСБИС.GTIN);
		КонецЕсли;
		
	КонецЦикла;
		
	
	ДанныеПоиска.Вставить("СписокGTIN", СписокGTIN); 
	БыстроеВнедрениеEDI_ОбогатитьСопоставленияДаннымиКонтура(ДанныеПоиска, ОбогащенныеДанныеНоменклатурыДляСопоставления);
	
КонецПроцедуры

&НаСервере
Процедура БыстроеВнедрениеEDI_ОбогатитьСопоставленияДаннымиКонтура(ДанныеПоиска, ОбогащенныеДанныеНоменклатурыДляСопоставления)
	
	МодульОбъектаСервер = МодульОбъектаСервер();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтурEDI_СоответствияТоваров.Номенклатура КАК Номенклатура,
	               |	КонтурEDI_СоответствияТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	КонтурEDI_СоответствияТоваров.Единица КАК Единица,
	               |	КонтурEDI_СоответствияТоваров.ЕдиницаEDI КАК ЕдиницаEDI,
	               |	КонтурEDI_СоответствияТоваров.GTIN КАК GTIN,
	               |	КонтурEDI_СоответствияТоваров.КодТовараПартнера КАК КодТовараПартнера,
	               |	КонтурEDI_СоответствияТоваров.КоэффициентEDIВ1С КАК КоэффициентEDIВ1С
	               |ИЗ
	               |	РегистрСведений.КонтурEDI_СоответствияТоваров КАК КонтурEDI_СоответствияТоваров
	               |ГДЕ
	               |	КонтурEDI_СоответствияТоваров.Партнер = &Партнер
	               |	И КонтурEDI_СоответствияТоваров.GTIN В (&GTIN)"; 
	Запрос.УстановитьПараметр("Партнер", ДанныеПоиска.Партнер);
	Запрос.УстановитьПараметр("GTIN", ДанныеПоиска.GTIN);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если НЕ Результат.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура();
	Для Каждого КлассНоменклатуры ИЗ ОбогащенныеДанныеНоменклатурыДляСопоставления Цикл
		
		Отбор.Вставить("GTIN", КлассНоменклатуры.НоменклатураСБИС.GTIN);	
		НайденноеСоответствие = Результат.НайтиСтроки(Отбор);
		
		Если НЕ НайденноеСоответствие.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаНоменклатуры1С = МодульОбъектаСервер.НовыйОписаниеНоменклатуры1ССервер();
		СтрокаНоменклатуры1С.Ссылка = НайденноеСоответствие[0].Номенклатура;
		СтрокаНоменклатуры1С.Характеристика = НайденноеСоответствие[0].Характеристика;  
		
		Если ЗначениеЗаполнено(НайденноеСоответствие[0].КодТовараПартнера) Тогда
			КлассНоменклатуры.НоменклатураСБИС.КодПокупателя = НайденноеСоответствие[0].КодТовараПартнера;
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(НайденноеСоответствие[0].КоэффициентEDIВ1С) Тогда
			КлассНоменклатуры.НоменклатураСБИС.Коэффициент = НайденноеСоответствие[0].КоэффициентEDIВ1С;
		КонецЕсли;
		
		ВходящиеДанные = Новый Структура("Источник", НайденноеСоответствие[0].Единица);      
		ДопПараметры = Новый Структура("ТипИсточника", "Ссылка");
		СтруктураЕдиницы = МодульОбъектаСервер.НовыйСопоставлениеДляЕдиницыСервер(ВходящиеДанные, ДопПараметры);
		МодульОбъектаСервер.СопоставлениеДляЕдиницыСервер_Вставить(СтруктураЕдиницы, "Владелец", СтрокаНоменклатуры1С.Ссылка);
		
		СтрокаНоменклатуры1С.Вставить("ЕдИзм1С", Новый Соответствие);
		СтрокаНоменклатуры1С.ЕдИзм1С.Вставить(НайденноеСоответствие[0].Единица, СтруктураЕдиницы);
		
		КлассНоменклатуры.Номенклатура1С.Вставить(СтрокаНоменклатуры1С.Ссылка, СтрокаНоменклатуры1С);
		
	КонецЦикла;
	
КонецПроцедуры

