
////////////////////////////////////////////////////
///////////////API функции загрузки/////////////////
////////////////////////////////////////////////////

////////////////////////////////////////////////////
//////////////////////Шапка/////////////////////////

//Функция заполняет валюту в загружаемых документах	
&НаКлиенте
Функция ЗаполнитьВалютуУНФ(Контекст) Экспорт
	сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "Справочники.Валюты", Контекст.Документ.ВалютаДокумента); 
	сбисОписаниеОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	Если сбисОписаниеОбъекта.Значение = Неопределено Тогда
		сбисОписаниеОбъекта.Значение = сбисПолучитьВалюту_Сервер(сбисОписаниеОбъекта.Ключ);
		сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	КонецЕсли;
	Возврат сбисОписаниеОбъекта.Значение;
КонецФункции

// Функция заполняет договор в загружаемых документах	
&НаКлиенте
Функция ЗаполнитьДоговор(Контекст) Экспорт
	
	ВложениеСБИС = Контекст.Вложение;
	// После разбора и заполнения вложения функция возвращает заполненное автоматически/измененное вручную значение договора
	Если МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "Статус") = "Разобран" Тогда
		ПараметрыПолей	= Новый ФиксированнаяСтруктура("СоставПакета", Контекст.СоставПакета);
		Поля1С			= МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "Поля1С", ПараметрыПолей);
		Возврат Поля1С.Договор.Значение;
	КонецЕсли;
	
	Если	Контекст.Вложение.Свойство("РучноеИзменение")
		И	Контекст.Вложение.РучноеИзменение = Истина
		И	Контекст.Вложение.Свойство("Договор1С")
		И	ЗначениеЗаполнено(Контекст.Вложение.Договор1С) Тогда
		// Старая логика, на случай совместимости со старыми функциями
		
		Результат = Контекст.Вложение.Договор1С;
		
	ИначеЕсли	Не Контекст.Документ.Свойство("Контрагент")
			Или Не ЗначениеЗаполнено(Контекст.Документ.Контрагент) Тогда
			
		//Нет контрагента, пустая ссылка договора. Чтоб лишний раз не дергать сервер, храним в кэше.
		СбисОписаниеПустойСсылкиОбъекта = Новый Структура("Тип, Ключ, Значение", "Справочник.ДоговорыКонтрагентов", "ПустаяСсылка"); 
		СбисОписаниеПустойСсылкиОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, СбисОписаниеПустойСсылкиОбъекта);
		Если СбисОписаниеПустойСсылкиОбъекта.Значение = Неопределено Тогда
			СбисОписаниеПустойСсылкиОбъекта.Значение = Объект1СПоОписанию(СбисОписаниеПустойСсылкиОбъекта, СбисОписаниеПустойСсылкиОбъекта.Ключ);
			СбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, СбисОписаниеПустойСсылкиОбъекта);
		КонецЕсли;
		Результат = СбисОписаниеПустойСсылкиОбъекта.Значение;
		
	Иначе
		
		КонтекстРассчета = Новый Структура("Документ, СтруктураФайла, Ини");
		ЗаполнитьЗначенияСвойств(КонтекстРассчета, Контекст);
		Результат = СбисНайтиДоговорНаСервере(КонтекстРассчета);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции   

//Функция заполняет договор в загружаемых документах для конфигурации БГУ2
&НаКлиенте
Функция ЗаполнитьДоговорБГУ(Контекст) Экспорт
     Если	Контекст.Свойство("Вложение")
		И	Контекст.Вложение.Свойство("РучноеИзменение")
		И	Контекст.Вложение.РучноеИзменение = Истина
		И	Контекст.Вложение.Свойство("Договор1С")
		И	ЗначениеЗаполнено(Контекст.Вложение.Договор1С) Тогда
		// Если договор выбран вручную в форме просмотра, то возвращаем его
		Результат = Контекст.Вложение.Договор1С;
	ИначеЕсли	Не Контекст.Документ.Свойство("Контрагент")
		Или Не ЗначениеЗаполнено(Контекст.Документ.Контрагент) Тогда
		//Нет контрагента, пустая ссылка договора. Чтоб лишний раз не дергать сервер, храним в кэше.
		СбисОписаниеПустойСсылкиОбъекта = Новый Структура("Тип, Ключ, Значение", "Справочник.Договоры", "ПустаяСсылка"); 
		СбисОписаниеПустойСсылкиОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, СбисОписаниеПустойСсылкиОбъекта);
		Если СбисОписаниеПустойСсылкиОбъекта.Значение = Неопределено Тогда
			СбисОписаниеПустойСсылкиОбъекта.Значение = Объект1СПоОписанию(СбисОписаниеПустойСсылкиОбъекта, СбисОписаниеПустойСсылкиОбъекта.Ключ);
			СбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, СбисОписаниеПустойСсылкиОбъекта);
		КонецЕсли;
		Результат = СбисОписаниеПустойСсылкиОбъекта.Значение;
	Иначе
		Результат = СбисНайтиДоговорБГУНаСервере(Контекст);
	КонецЕсли;
	Возврат Результат;
КонецФункции

//Функция заполняет договор в загружаемых документах для конфигурации УТ11	
&НаКлиенте
Функция ЗаполнитьДоговорУТ11(Контекст) Экспорт
	// Если договор выбран вручную в форме просмотра, то возвращаем его
	Договор1С = Контекст;
	Если	Договор1С.Свойство("Вложение",	Договор1С)
		И	Договор1С.Свойство("РучноеИзменение")
		И	Договор1С.РучноеИзменение = Истина
		И	Договор1С.Свойство("Договор1С",	Договор1С)
		И	ЗначениеЗаполнено(Договор1С) Тогда
		Возврат Договор1С;
	КонецЕсли;
	
	сбисКонтекстСервера	= Новый Структура("Документ", Контекст.Документ);
	Если Контекст.АргументыВходящие.Свойство("Параметр1") Тогда
		сбисКонтекстСервера.Вставить("ХозяйственнаяОперация", Контекст.АргументыВходящие.Параметр1);
	КонецЕсли;
	Если Контекст.АргументыВходящие.Свойство("Параметр2") Тогда
		сбисКонтекстСервера.Вставить("ВалютаВзаиморасчетов", Контекст.АргументыВходящие.Параметр2);
	КонецЕсли;
	Возврат сбисПолучитьДоговорУТ11_Сервер(сбисКонтекстСервера);
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьДоговорАА(Контекст) Экспорт
	// Функция заполняет договор в загружаемых документах
	НовыйДоговор = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	Контрагент = Контекст.Документ.Контрагент;
	Попытка  // Сначала пытаемся найти договор по дате, номеру
		ДатаДоговора = Дата(Контекст.СтруктураФайла.Файл.Документ.Параметр.ДоговорДата+" 00:00:00");
		НомерДоговора = Контекст.СтруктураФайла.Файл.Документ.Параметр.ДоговорНомер;       
		
		
		//Поиск договора по номеру дате
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		| ДоговорыВзаиморасчетов.Ссылка
		|ИЗ
		| Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
		|ГДЕ
		| ДоговорыВзаиморасчетов.Владелец = &Владелец И
		| ДоговорыВзаиморасчетов.ДатаНачала = &Дата
		| И ДоговорыВзаиморасчетов.НомерДоговора = &Номер";
		Запрос.УстановитьПараметр("Дата", ДатаДоговора);
		Запрос.УстановитьПараметр("Номер", НомерДоговора);
		Запрос.УстановитьПараметр("Владелец", Контрагент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НовыйДоговор = Выборка.Ссылка;
			Возврат НовыйДоговор; 
		КонецЕсли;
	Исключение
		Ошибка = ОписаниеОшибки();
	КонецПопытки;
	
	
	//++ Описание из Альфа-авто
	// В первую очередь необходимо получить договор, удовлетворяющий
	// всем условиям, в т.ч. у которого совпадают реквизиты "Подразделение компании" и "Организация".
	// Если такого договора нет, то необходимо попытаться получить договор, у которого хотя бы организация совпадет.
	// Если и такого договора нет, то пытаемся получить договор, у которого подразделение совпадает.
	// Если и такого нет, то получаем любой договор (в пределах подчинения, разумеется).
	Попытка
		Организация = Контекст.Документ.Организация;
		ПодразделениеКомпании = Неопределено;
		ДатаДоговора = ТекущаяДата();
		ПустаяДата = Дата("00010101");
		ВидДоговора = Перечисления.ВидыДоговоров.Покупка;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		| ДоговорыВзаиморасчетов.Ссылка КАК Договор,
		| ВЫБОР
		|  КОГДА ДоговорыВзаиморасчетов.Организация = &Организация
		|   И ДоговорыВзаиморасчетов.Подразделение = &Подразделение ТОГДА
		|   0
		|  КОГДА ДоговорыВзаиморасчетов.Организация = &Организация ТОГДА
		|   1
		|  КОГДА ДоговорыВзаиморасчетов.Подразделение = &Подразделение ТОГДА
		|   2
		|  ИНАЧЕ
		|   3
		| КОНЕЦ КАК ПорядокПоПринадлежности,
		| ДоговорыВзаиморасчетов.Основной КАК Основной,
		| ДоговорыВзаиморасчетов.ДатаКонца КАК ДатаКонца,
		| ДоговорыВзаиморасчетов.ДатаНачала КАК ДатаНачала
		|ИЗ
		| Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
		|ГДЕ
		| ДоговорыВзаиморасчетов.Владелец = &Владелец И
		| ДоговорыВзаиморасчетов.ЭтоГруппа = ЛОЖЬ И
		| ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора
		| И (ДоговорыВзаиморасчетов.ДляАвтосалона = ИСТИНА
		| ИЛИ ДоговорыВзаиморасчетов.ДляАвтосервиса = ИСТИНА
		| ИЛИ ДоговорыВзаиморасчетов.Внутренний = ИСТИНА)
		| И (ДоговорыВзаиморасчетов.ДатаКонца = &ПустаяДата
		|    И ДоговорыВзаиморасчетов.ДатаНачала <= &ДатаДоговора
		|   ИЛИ &ДатаДоговора МЕЖДУ ДоговорыВзаиморасчетов.ДатаНачала И ДоговорыВзаиморасчетов.ДатаКонца)
		| И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ
		|УПОРЯДОЧИТЬ ПО
		| ПорядокПоПринадлежности ВОЗР,
		| Основной УБЫВ,
		| ДатаКонца ВОЗР,
		| ДатаНачала УБЫВ";
		
		
		Запрос.УстановитьПараметр("ВидДоговора",          ВидДоговора);
		Запрос.УстановитьПараметр("Владелец",             Контрагент);
		Запрос.УстановитьПараметр("Организация",          ?(ЗначениеЗаполнено(Организация), Организация, ПараметрыСеанса.Организация));
		Запрос.УстановитьПараметр("Подразделение",        ПараметрыСеанса.ПодразделениеКомпании);
		Запрос.УстановитьПараметр("ДатаДоговора",         ДатаДоговора);
		Запрос.УстановитьПараметр("ПустаяДата",           ПустаяДата);
		Результат = Запрос.Выполнить();
		
		
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Возврат Выборка.Договор;
		КонецЕсли; 
	Исключение
		Ошибка = ОписаниеОшибки();
	КонецПопытки;
	
	
	Возврат НовыйДоговор;
КонецФункции

&НаКлиенте
Функция ЗаполнитьДоговорАА66(Контекст) Экспорт
	
	Контрагент = Контекст.Документ.Контрагент;
	Попытка
		ДатаДоговора = Дата(Контекст.СтруктураФайла.Файл.Документ.Параметр.ДоговорДата+" 00:00:00");
		НомерДоговора = Контекст.СтруктураФайла.Файл.Документ.Параметр.ДоговорНомер;
		НовыйДоговор = ПолучитьДоговорАльфы6ПростымПутем(ДатаДоговора, НомерДоговора, Контрагент);	
		Если ЗначениеЗаполнено(НовыйДоговор) Тогда
			Возврат НовыйДоговор;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Попытка
		Организация = Контекст.Документ.Организация;
		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("Организация", Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Контрагент);
		
		НовыйДоговор = ПолучитьДоговорАльфы6СложнымПутем(ПараметрыЗапроса);
		Возврат НовыйДоговор;
	Исключение
		Сообщить(ОписаниеОшибки());	
	КонецПопытки; 
	
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьДоговорАльфы6ПростымПутем(ДатаДоговора, НомерДоговора, Контрагент)
	НовыйДоговор = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	//Поиск договора по номеру дате
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	| ДоговорыВзаиморасчетов.Ссылка
	|ИЗ
	| Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|ГДЕ
	| ДоговорыВзаиморасчетов.Владелец = &Владелец И
	| ДоговорыВзаиморасчетов.ДатаНачала = &Дата
	| И ДоговорыВзаиморасчетов.НомерДоговора = &Номер";
	Запрос.УстановитьПараметр("Дата", ДатаДоговора);
	Запрос.УстановитьПараметр("Номер", НомерДоговора);
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НовыйДоговор = Выборка.Ссылка;
		Возврат НовыйДоговор; 
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДоговорАльфы6СложнымПутем(ПараметрыЗапроса)
	// смотри описание сценария поиска договора в функции ЗаполнитьДоговорАА (функция справедлива для альфы 5 версии)
	// Здесь же следующие отличия:
	// Разные имена реквизитов Подразделения, другая логика заполнения в случае неудачи найти договор по всем заданным параметрам
	ПодразделениеКомпании = Неопределено;
	ДатаДоговора = ТекущаяДата();
	ПустаяДата = Дата("00010101");
	ВидДоговора = Перечисления.ВидыДоговоров.Покупка;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	| ДоговорыВзаиморасчетов.Ссылка КАК Договор,
	| ВЫБОР
	|   КОГДА ДоговорыВзаиморасчетов.Организация = &Организация
	|   И ДоговорыВзаиморасчетов.ПодразделениеКомпании = &Подразделение 
	|   И ДоговорыВзаиморасчетов.Основной = ИСТИНА ТОГДА
	|   1
	|  КОГДА ДоговорыВзаиморасчетов.Организация = &Организация
	|   И ДоговорыВзаиморасчетов.ПодразделениеКомпании = &Подразделение ТОГДА
	|   2
	|  КОГДА ДоговорыВзаиморасчетов.Организация = &Организация ТОГДА
	|   3
	|  КОГДА ДоговорыВзаиморасчетов.ПодразделениеКомпании = &Подразделение ТОГДА
	|   4
	|  ИНАЧЕ
	|   5
	| КОНЕЦ КАК ПорядокПоПринадлежности,
	| ДоговорыВзаиморасчетов.Основной КАК Основной,
	| ДоговорыВзаиморасчетов.ДатаКонца КАК ДатаКонца,
	| ДоговорыВзаиморасчетов.ДатаНачала КАК ДатаНачала
	|ИЗ
	| Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|ГДЕ
	| ДоговорыВзаиморасчетов.Владелец = &Владелец И
	| ДоговорыВзаиморасчетов.ЭтоГруппа = ЛОЖЬ И
	| ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора
	| И (ДоговорыВзаиморасчетов.ДляАвтосалона = ИСТИНА
	| ИЛИ ДоговорыВзаиморасчетов.ДляАвтосервиса = ИСТИНА
	| ИЛИ ДоговорыВзаиморасчетов.Внутренний = ИСТИНА)
	| И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ
	|УПОРЯДОЧИТЬ ПО
	| ПорядокПоПринадлежности ВОЗР,
	| Основной УБЫВ,
	| ДатаКонца ВОЗР,
	| ДатаНачала УБЫВ";
	
	Запрос.УстановитьПараметр("ВидДоговора",          ВидДоговора);
	Запрос.УстановитьПараметр("Владелец",             ПараметрыЗапроса.Контрагент);
	Запрос.УстановитьПараметр("Организация",          ?(ЗначениеЗаполнено(ПараметрыЗапроса.Организация), ПараметрыЗапроса.Организация, ПараметрыСеанса.Организация));
	Запрос.УстановитьПараметр("Подразделение",        ПараметрыСеанса.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ДатаДоговора",         ДатаДоговора);
	Запрос.УстановитьПараметр("ПустаяДата",           ПустаяДата);
	
	Результат = Запрос.Выполнить();	
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Договор;
	КонецЕсли; 
	
	Сообщить("Не найден договор по контрагенту. Могут возникнуть ошибки при загрузке документа!");
КонецФункции

// функция ищет по коду единицу измерения, кэширует её. Если по классификатору, не должно быть много значений.	
&НаКлиенте
Функция ЗаполнитьЕдиницуИзмеренияНовойНоменклатуры(Контекст) Экспорт
	СправочникЕдИзм = РассчитатьЗначение("ЕдиницаИзмерения", Контекст.Ини);  //Определяем объект справочника единиц измерения
	Если СправочникЕдИзм = Неопределено Тогда
		Сообщить("В настройках не указан справочник для загрузки/создания единиц измерения");
		Возврат Неопределено;
	КонецЕсли;
	ЗначениеОКЕИ = Контекст.Ини.Номенклатура_ОКЕИ;
	Если Не ЗначениеОКЕИ.Свойство("РассчитанноеЗначение", ЗначениеОКЕИ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", СправочникЕдИзм, ЗначениеОКЕИ); 
	СбисОписаниеОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, СбисОписаниеОбъекта);
	Если СбисОписаниеОбъекта.Значение = Неопределено Тогда
		СбисОписаниеОбъекта.Значение = Объект1СПоОписанию(СбисОписаниеОбъекта,,Истина);
		СбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, СбисОписаниеОбъекта);
	КонецЕсли;
	Возврат СбисОписаниеОбъекта.Значение;
КонецФункции

// функция заполняет приложения в приходных/расходных ордерах	
&НаКлиенте
Функция ЗаполнитьПриложениеКО(Контекст) Экспорт 
	Приложения = "";
	Попытка
		Для Каждого Элемент Из Контекст.Приложения Цикл
			Приложения = Приложения + Элемент.Название + ", ";
		КонецЦикла;
		Приложения = Лев(Приложения, СтрДлина(Приложения)-2);
	Исключение
	КонецПопытки;
	Возврат Приложения;
КонецФункции

// Функция определяет название табличной части акта сверки, в которую нужно загружать данные (для УТ11)	
&НаКлиенте
Функция ИмяТЧВзаиморасчетов(Контекст) Экспорт
	Если Контекст.Свойство("СтрТабл") и Контекст.СтрТабл.Раздел = "Отправитель" Тогда
		Возврат "ДанныеКонтрагента";
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

// Функция определяет название табличной части акта сверки, в которую нужно загружать данные	
&НаКлиенте
Функция ИмяТЧАктаСверки(Контекст) Экспорт
	Если Контекст.Свойство("СтрТабл") и Контекст.СтрТабл.Раздел = "Отправитель" Тогда
		Возврат "ПоДаннымКонтрагента";
	КонецЕсли;
	Возврат "ПоДаннымОрганизации";
КонецФункции

// Функция - получает таблицу товаров на документ корректировки по найденному основанию для внесения изменений.
//
// Параметры:
//  Контекст - Структура	 - Контекст расчёта документа
// 
// Возвращаемое значение:
//  Произвольное - результат рассчёта на текущем узле. 
//
&НаКлиенте
Функция КорректировкаРеализации_ЗаполнитьТоварыПоИсходнымДанным_УТ11(Контекст) Экспорт 
    Перем ДокументОснованиеКорректировки;
	
	Если	Не	Контекст.АргументыВходящие.Свойство("Параметр1", ДокументОснованиеКорректировки)
		Или	 	ДокументОснованиеКорректировки = Неопределено Тогда
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
	КонтекстДляСервера	= Новый ФиксированнаяСтруктура("Основание", ДокументОснованиеКорректировки);
	
	Попытка
		
		Возврат КорректировкаРеализации_ЗаполнитьТоварыПоИсходнымДанным_УТ11_Сервер(КонтекстДляСервера);
		
	Исключение
		
		ИмяВСтэк = "РаботаСДокументами1С.КорректировкаРеализации_ЗаполнитьТоварыПоИсходнымДанным_УТ11";
		МодульОбъектаКлиент().СбисСообщить(ИнформацияОбОшибке(), ИмяВСтэк);
		
	КонецПопытки;
	
	Возврат Новый Массив;
	
КонецФункции

// Функция - получает таблицу товаров на документ корректировки по найденному основанию для внесения изменений.
//
// Параметры:
//  Контекст - Структура	 - Контекст расчёта документа
// 
// Возвращаемое значение:
//  Произвольное - результат рассчёта на текущем узле. 
//
&НаКлиенте
Функция КорректировкаРеализации_ТаблицыПоИсходнымДанным_БУХ3(Контекст) Экспорт 
    Перем ДокументОснованиеКорректировки;
	
	Если	Не	Контекст.АргументыВходящие.Свойство("Параметр1", ДокументОснованиеКорректировки)
		Или	 	ДокументОснованиеКорректировки = Неопределено Тогда
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
	КонтекстДляСервера	= Новый ФиксированнаяСтруктура("Основание", ДокументОснованиеКорректировки);
	
	Попытка
		
		Возврат КорректировкаРеализации_ТаблицыПоИсходнымДанным_БУХ3_Сервер(КонтекстДляСервера);
		
	Исключение
		
		ИмяВСтэк = "РаботаСДокументами1С.КорректировкаРеализации_ЗаполнитьТоварыПоИсходнымДанным_БУХ3_Сервер";
		МодульОбъектаКлиент().СбисСообщить(ИнформацияОбОшибке(), ИмяВСтэк);
		
	КонецПопытки;
	
	Возврат Новый Массив;
	
КонецФункции

//TODO42 удалить Не использовать эту функцию. Оставлено для совместимости!
&НаКлиенте
функция ПолучитьСклад(Контекст) Экспорт
	сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "ПользовательскиеЗначения.ЗначенияПоУмолчанию", "ОсновнойСклад"); 
	сбисОписаниеОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	Если сбисОписаниеОбъекта.Значение = Неопределено Тогда
		Попытка
			сбисОписаниеОбъекта.Значение = Вычислить("ОбщегоНазначенияБПВызовСервера.ПолучитьЗначениеПоУмолчанию(""ОсновнойСклад"")");
		Исключение
			Ошибка = ОписаниеОшибки();
		КонецПопытки;
		сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	КонецЕсли;
	Возврат сбисОписаниеОбъекта.Значение;
КонецФункции

&НаКлиенте
функция ПолучитьСкладТекущегоПользователя(Контекст) Экспорт
	сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "ПользовательскиеЗначения.ЗначенияПоУмолчанию", "ОсновнойСклад"); 
	сбисОписаниеОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	Если сбисОписаниеОбъекта.Значение = Неопределено Тогда
		Попытка
			сбисОписаниеОбъекта.Значение = Вычислить("УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной(""глТекущийПользователь""),""ОсновнойСклад"")");
		Исключение
			Ошибка = ОписаниеОшибки();
		КонецПопытки;
		сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	КонецЕсли;
	Возврат сбисОписаниеОбъекта.Значение;
КонецФункции       

&НаКлиенте
функция ПолучитьСкладБГУ(Контекст) Экспорт
	Перем СкладКод, СкладНаименование;
	Если Контекст.Ини.Свойство("СкладКод", СкладКод) И ЗначениеЗаполнено(СкладКод.РассчитанноеЗначение) Тогда
		сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "Справочник.ЦМО", СкладКод.РассчитанноеЗначение); 
		сбисОписаниеОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
		Если сбисОписаниеОбъекта.Значение = Неопределено Тогда
			сбисОписаниеОбъекта.Значение = Объект1СПоОписанию(сбисОписаниеОбъекта, "ПоКоду");
			сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
		КонецЕсли;
		Результат = сбисОписаниеОбъекта.Значение;
	ИначеЕсли Контекст.Ини.Свойство("СкладНаименование", СкладНаименование) И ЗначениеЗаполнено(СкладНаименование.РассчитанноеЗначение) Тогда
		сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "Справочник.ЦМО", СкладНаименование.РассчитанноеЗначение); 
		сбисОписаниеОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
		Если сбисОписаниеОбъекта.Значение = Неопределено Тогда
			сбисОписаниеОбъекта.Значение = Объект1СПоОписанию(сбисОписаниеОбъекта, "ПоНаименованию");
			сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
		КонецЕсли;
		Результат = сбисОписаниеОбъекта.Значение;
	Иначе 
		Результат = ПолучитьСкладБГУНаСервере();
	КонецЕсли;	
	
	Возврат Результат;  
КонецФункции

//Переделана функция с кэшированием кассы
&НаКлиенте
Функция ПолучитьКассу(Контекст) Экспорт
	Перем КассаНазвание;
	Если	Не	Контекст.Ини.Свойство("КассаНазвание")
		Или	Не	Контекст.Ини.КассаНазвание.Свойство("РассчитанноеЗначение", КассаНазвание) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если КассаНазвание = Неопределено Тогда
		КассаНазвание = "";
	КонецЕсли;
	сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "Справочники.Кассы", КассаНазвание); 
	сбисОписаниеОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	Если сбисОписаниеОбъекта.Значение = Неопределено Тогда
		сбисОписаниеОбъекта.Значение = Объект1СПоОписанию(сбисОписаниеОбъекта, "ПоНаименованию");
		сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	КонецЕсли;
	
	Возврат сбисОписаниеОбъекта.Значение;
КонецФункции

&НаКлиенте
Функция ПолучитьХозрасчетныйСчетПоКоду(Контекст) Экспорт
	ХозрасчетныйСчет = Неопределено;
	//AU Берем счет из ини из расчитанного значения, по аналогии с плагином. Делаем соответствие счетов.
	Если	Не Контекст.Ини.Свойство("ХозрасчетныйСчет", ХозрасчетныйСчет)
		Или	Не ХозрасчетныйСчет.Свойство("РассчитанноеЗначение", ХозрасчетныйСчет)
		Или Не ЗначениеЗаполнено(ХозрасчетныйСчет) Тогда
		Возврат Неопределено;
	ИначеЕсли	ХозрасчетныйСчет = "58-03-01" Тогда
		ХозрасчетныйСчет = "58.03";
	ИначеЕсли   ХозрасчетныйСчет = "71" Тогда
		ХозрасчетныйСчет = "71.01";
	ИначеЕсли   ХозрасчетныйСчет = "76-ПРОЧ" Тогда
		ХозрасчетныйСчет = "76.05";
	ИначеЕсли   ХозрасчетныйСчет = "90-01" Тогда
		ХозрасчетныйСчет = "90.01.1";
	Иначе
		ХозрасчетныйСчет = СтрЗаменить(ХозрасчетныйСчет,"-",".")
	КонецЕсли;
	сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "ПланыСчетов.Хозрасчетный", ХозрасчетныйСчет); 
	сбисОписаниеОбъекта.Значение= сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	Если сбисОписаниеОбъекта.Значение = Неопределено Тогда
		сбисОписаниеОбъекта.Значение = Объект1СПоОписанию(сбисОписаниеОбъекта);
		сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	КонецЕсли;
	Возврат сбисОписаниеОбъекта.Значение;
КонецФункции

//Функция определяет параметры учета НДС по данным электронного документа
&НаКлиенте
Функция СбисПараметрыНДСДокумента(Контекст) Экспорт
	Перем ТаблЧасть;
	
	СбисРезультат = Новый Структура("СуммаВключаетНДС, УчитыватьНДС", Ложь, Ложь);
	
	Для Каждого ИмяТаблЧасть из Контекст.Ини.мТаблДок Цикл
		//выбираем табличные части по ини
		Если Не Контекст.Документ.Свойство(ИмяТаблЧасть.Ключ, ТаблЧасть) Тогда
			Продолжить;
		КонецЕсли;
		//выбираем строки из табличной части
		Для Каждого Стр Из ТаблЧасть Цикл
			Если Стр.Свойство("СтавкаНДС") И НРег(Стр.СтавкаНДС) <> "без ндс" Тогда
				СбисРезультат.УчитыватьНДС = Истина;
			КонецЕсли;
			Если	Стр.Свойство("Сумма")
				И	Стр.Свойство("СуммаНДС")
				И	Стр.Сумма = Стр.СуммаСНДС Тогда
				СбисРезультат.СуммаВключаетНДС = Истина;
			КонецЕсли;
			Если СбисРезультат.УчитыватьНДС Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;	
		Если СбисРезультат.УчитыватьНДС Тогда
			//если уже нашли строки в которых ставка <> "без ндс", то остальные табличные части не проверяем
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	Возврат СбисРезультат;
	
КонецФункции

// Функция определяет параметры учета НДС по данным электронного документа в формате 3.01
// Перенести в Файл_шаблон
&НаКлиенте
Функция сбисПараметрыНДС_3_01(Контекст) Экспорт
	Перем ЗначениеСтавкиНДС, ТаблДок;
	
	СбисРезультат	= Новый Структура("СуммаВключаетНДС, УчитыватьНДС", Ложь, Ложь);
	ЕстьТаблДок		=	Контекст.Свойство("СтруктураФайла", ТаблДок)
	               И	ТаблДок.Свойство("Файл",		ТаблДок)
	               И	ТаблДок.Свойство("Документ",	ТаблДок)
	               И	ТаблДок.Свойство("ТаблДок",		ТаблДок)
	               И	ТаблДок.Свойство("СтрТабл",		ТаблДок);
				   
	Если ЕстьТаблДок Тогда
		
		Для Каждого СтрТабл Из ТаблДок Цикл
			
			Если	Не	СтрТабл.Свойство("НДС", ЗначениеСтавкиНДС)
				Или	Не	ЗначениеСтавкиНДС.Свойство("Ставка", ЗначениеСтавкиНДС)
				Или		НРег(ЗначениеСтавкиНДС) = "без ндс" Тогда
				
				Продолжить;
				
			КонецЕсли;
			СбисРезультат.УчитыватьНДС		= Истина;
			// По данным СБИС Сумма всегда включает НДС.
			// Если не так, расширить условие
			СбисРезультат.СуммаВключаетНДС	= Истина;
			
			Прервать;
			
		КонецЦикла;
						   					   
	КонецЕсли;
	
	Возврат СбисРезультат;
	
КонецФункции

//Функция возвращает вид операции
&НаКлиенте
Функция сбисЗаполнитьВидОперации(Контекст) Экспорт
	Перем ДокументВидОперации;
	Если	Не	Контекст.СтруктураФайла.Файл.Документ.Свойство("Параметр", ДокументВидОперации)
		Или	Не	ДокументВидОперации.Свойство("ДокументВидОперации", ДокументВидОперации) Тогда
		Возврат Неопределено;
	ИначеЕсли ДокументВидОперации = "Исправление" Тогда
		ДокументВидОперации = "ИсправлениеОшибки";
	ИначеЕсли ДокументВидОперации = "Корректировка" Тогда
		ДокументВидОперации = "СогласованноеИзменение";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "Перечисления.ВидыОперацийИсправленияПоступленияРеализации", ДокументВидОперации); 
	сбисОписаниеОбъекта.Значение= сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	Если сбисОписаниеОбъекта.Значение = Неопределено Тогда
		сбисОписаниеОбъекта.Значение = Объект1СПоОписанию(сбисОписаниеОбъекта);
		сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	КонецЕсли;
	Возврат сбисОписаниеОбъекта.Значение;
КонецФункции

&НаКлиенте
Функция сбисЗаполнитьДанныеНоменклатуры(Контекст) Экспорт
	Попытка
		НашаНоменклатура = РассчитатьЗначение("НашаНоменклатура", Контекст.Ини);
		Идентификатор = РассчитатьЗначениеИзСтруктуры(НашаНоменклатура, Контекст.СтрокаФайла);
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			Возврат сбисЗаполнитьДанныеНоменклатурыНаСервере(Идентификатор);
		КонецЕсли;
	Исключение
	КонецПопытки
КонецФункции   

&НаКлиенте
Функция ЗаполнитьДокументОснованиеКСчФБГУ2(Контекст) Экспорт
	Перем ДокументПоступленияНомер, ДокументПоступленияДата;
	
	Отказ = Ложь;
	КонтекстСервера = Новый Структура;
	Если Контекст.Документ.Контрагент = Неопределено ИЛИ Контекст.Документ.Контрагент = Ложь Тогда 
		Сообщить("Не найден исходный документ"); 
		Отказ = Истина;
	ИначеЕсли Контекст.СтруктураФайла.Файл.Формат = "счФактКор" Тогда
		Если	Контекст.СтруктураФайла.Файл.Документ.Свойство("Основание") И ТипЗнч(Контекст.СтруктураФайла.Файл.Документ.Основание)=Тип("Массив")
			И 	Контекст.СтруктураФайла.Файл.Документ.Основание[0].Свойство("Номер", ДокументПоступленияНомер)
			И	Контекст.СтруктураФайла.Файл.Документ.Основание[0].Свойство("Дата", ДокументПоступленияДата) Тогда
		Иначе
			Сообщить("Не указаны номер или дата исходного документа"); 
			Отказ = Истина
		КонецЕсли;
	КонецЕсли;	
	КонтекстСервера.Вставить("Контрагент",				Контекст.Документ.Контрагент);
	КонтекстСервера.Вставить("Файл_Формат",				Контекст.СтруктураФайла.Файл.Формат);
	КонтекстСервера.Вставить("ДокументПоступленияНомер",ДокументПоступленияНомер);
	КонтекстСервера.Вставить("ДокументПоступленияДата",	ДокументПоступленияДата); 
	
	РезультатЗаполнения = ЗаполнитьДокументОснованиеКСчФБГУ2НаСервере(КонтекстСервера, Отказ);
	Если Отказ Тогда
		Сообщить(РезультатЗаполнения.details);
		сбисОписаниеПустойСсылкиОбъекта = Новый Структура("Тип, Ключ, Значение", "Документ.СчетФактураПолученный", "ПустаяСсылка"); 
		сбисОписаниеПустойСсылкиОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеПустойСсылкиОбъекта);
		Если сбисОписаниеПустойСсылкиОбъекта.Значение = Неопределено Тогда
			сбисОписаниеПустойСсылкиОбъекта.Значение = Объект1СПоОписанию(сбисОписаниеПустойСсылкиОбъекта, сбисОписаниеПустойСсылкиОбъекта.Ключ);
			сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеПустойСсылкиОбъекта);
		КонецЕсли;
		Возврат сбисОписаниеПустойСсылкиОбъекта.Значение;
	КонецЕсли;
	Возврат РезультатЗаполнения;
КонецФункции
	
&НаКлиенте
Функция СбисНайтиПодходяшийДокументДляВложения(Контекст) Экспорт
	
	ВложениеСБИС = Контекст.Вложение;
	
	 // Поиск можно проводить только по разобранному вложению, т.к. иначе будет рекурсивное зацикливание
	Если МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "Статус") = "Разобран" Тогда
		ПараметрыПоискаОснований = Новый ФиксированнаяСтруктура("СоставПакета, Режим, ТекущийУзелИни", Контекст.СоставПакета, "Документ", Контекст.ТекущееПолеИни);
		Возврат МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "ПодходящийДокумент", ПараметрыПОискаОснований);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция СбисНайтиПодходящееОснованиеДляВложения(Контекст) Экспорт
	Перем ПараметрыОснованияПоиск;
	
	ВложениеСБИС = Контекст.Вложение;
	
	РассчитываемыеПараметрыВложения = Новый Структура("Тип, Ключ, Значение", "РассчитанныеЗначения.ВложениеSABY", ВложениеСБИС); 
	РассчитываемыеПараметрыВложения.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, РассчитываемыеПараметрыВложения);
	Если РассчитываемыеПараметрыВложения.Значение = Неопределено Тогда
		
		РассчитываемыеПараметрыВложения.Значение = Новый Структура("ЗапущенПоискОснования, Основание", Ложь);
		СбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, РассчитываемыеПараметрыВложения); 
		
	КонецЕсли;
	
	Если Не РассчитываемыеПараметрыВложения.Значение.ЗапущенПоискОснования Тогда
		ПараметрыПоискаОснований = Новый Структура("СоставПакета, Режим", Контекст.СоставПакета, "Основание");
		ТипОбъектаПоиск = Контекст.ТекущееПолеИни.Тип;
				
		// Текущая реализация: поиск по той же ини, но с типом основания. Найти нужный раздел, пробросить в поиск
		ФайлИни				= МодульОбъектаКлиент().ИниПоПараметрам(ВложениеСБИС);
		ТипОбъектаПроверить = НРег(МодульОбъектаКлиент().ПолучитьПредставлениеТипа(ТипОбъектаПоиск, "Кратко"));
		Для Каждого мДокументИни Из ФайлИни.мДокумент Цикл
			
			ДокументТип = РассчитатьЗначение("Документ", мДокументИни.Значение);
			ДокументТип = НРег(СтрПолучитьСтроку(СтрЗаменить(ДокументТип, ".", Символы.ПС), 2));
			Если Не НРег(ДокументТип) = НРег(ТипОбъектаПроверить) Тогда
				Продолжить;
			КонецЕсли;
			УзелИниПоиска = мДокументИни.Значение;
			Прервать;
			
		КонецЦикла;
		
		ПараметрыПоискаОснований.Вставить("Тип",		ТипОбъектаПоиск);
		ПараметрыПоискаОснований.Вставить("УзелИни",	УзелИниПоиска);
					
	    // Настройка функции поиска
		ПоляДляПоиска = Новый Структура;
		Если	Контекст.АргументыВходящие.Свойство("Параметр1", ПараметрыОснованияПоиск)
			И	ЗначениеЗаполнено(ПараметрыОснованияПоиск) Тогда
			
			ПараметрыПоиск = Новый Структура("Основной, Значение", Истина, Новый Структура);
			ПараметрыПоиск.Значение.Вставить("Основание", ПараметрыОснованияПоиск);
			ПоляДляПоиска.Вставить("Номер", ПараметрыПоиск);
			
		КонецЕсли;
		
		Если	Контекст.АргументыВходящие.Свойство("Параметр2", ПараметрыОснованияПоиск)
			И	ЗначениеЗаполнено(ПараметрыОснованияПоиск) Тогда
			
			ПараметрыПоиск = Новый Структура("Основной, Значение", Истина, Новый Структура);
			ПараметрыПоиск.Значение.Вставить("Основание", ПараметрыОснованияПоиск);
			ПоляДляПоиска.Вставить("Дата", ПараметрыПоиск);
			
		КонецЕсли;
		
		ПараметрыПоискаОснований.Вставить("ПоляПоиска", ПоляДляПоиска);
		ОбработчикОчистить = МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ОчиститьЗначениеКэшированногоОбъекта", ЭтаФорма, МестныйКэш);
		МодульОбъектаКлиент().ПодключитьОтложенноеДействие(ОбработчикОчистить, РассчитываемыеПараметрыВложения);
		
		Попытка
			
			// Поиск запускается один раз, если ещё не было подбора основания
			РассчитываемыеПараметрыВложения.Значение.ЗапущенПоискОснования = Истина;
			СбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, РассчитываемыеПараметрыВложения); 

			РассчитываемыеПараметрыВложения.Значение.Основание = МодульОбъектаКлиент().ВложениеСБИС_Получить(ВложениеСБИС, "ПодходящийДокумент", ПараметрыПОискаОснований);
			РассчитываемыеПараметрыВложения.Значение.ЗапущенПоискОснования = Ложь;
			
		Исключение
			
			МодульОбъектаКлиент().СбисСообщить(ИнформацияОбОшибке(), "РаботаСДокументами1С.СбисНайтиПодходящееОснованиеДляВложения");
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат РассчитываемыеПараметрыВложения.Значение.Основание;
	
КонецФункции

&НаКлиенте
Функция сбисЗаполнитьДанныеИсходногоДокумента(Контекст) Экспорт
	
	ДопПараметрыФормированияКОнтекста = Новый Структура("Отказ", Ложь);
    КонтекстДляСервера = СформироватьКонтекстЗаполненияДанныхИсходногоДокумента(Контекст, ДопПараметрыФормированияКОнтекста);

	Если ДопПараметрыФормированияКОнтекста.Отказ Тогда
		Сообщить(КонтекстДляСервера.details);
		ДокументПоступленияТип = Неопределено;
		Если Не Контекст.Переменные.Свойство("ТипДокументаОснования", ДокументПоступленияТип) Тогда
			ДокументПоступленияТип = "ПоступлениеТоваровУслуг";
		КонецЕсли;

		сбисОписаниеПустойСсылкиОбъекта = Новый Структура("Тип, Ключ, Значение", "Документ." + ДокументПоступленияТип, "ПустаяСсылка"); 
		сбисОписаниеПустойСсылкиОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеПустойСсылкиОбъекта);
		Если сбисОписаниеПустойСсылкиОбъекта.Значение = Неопределено Тогда
			сбисОписаниеПустойСсылкиОбъекта.Значение = Объект1СПоОписанию(сбисОписаниеПустойСсылкиОбъекта, сбисОписаниеПустойСсылкиОбъекта.Ключ);;
			сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеПустойСсылкиОбъекта);
		КонецЕсли;
		Возврат сбисОписаниеПустойСсылкиОбъекта.Значение;
	КонецЕсли;
	
	РезультатЗаполнения = сбисЗаполнитьДанныеИсходногоДокументаНаСервере(КонтекстДляСервера, ДопПараметрыФормированияКОнтекста.Отказ);
	Если ДопПараметрыФормированияКОнтекста.Отказ Тогда
		Сообщить(РезультатЗаполнения.details);
		сбисОписаниеПустойСсылкиОбъекта = Новый Структура("Тип, Ключ, Значение", "Документ." + КонтекстДляСервера.ТипОснования, "ПустаяСсылка"); 
		сбисОписаниеПустойСсылкиОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеПустойСсылкиОбъекта);
		Если сбисОписаниеПустойСсылкиОбъекта.Значение = Неопределено Тогда
			сбисОписаниеПустойСсылкиОбъекта.Значение = Объект1СПоОписанию(сбисОписаниеПустойСсылкиОбъекта, сбисОписаниеПустойСсылкиОбъекта.Ключ);
			сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеПустойСсылкиОбъекта);
		КонецЕсли;
		Возврат сбисОписаниеПустойСсылкиОбъекта.Значение;
	КонецЕсли;
	Для Каждого ТабЧастьЗаполнена Из РезультатЗаполнения.ТЧ Цикл
		Контекст.Документ[ТабЧастьЗаполнена.Ключ] = ТабЧастьЗаполнена.Значение;
	КонецЦикла;
	Возврат РезультатЗаполнения.ОснованиеСсылка;
КонецФункции  

&НаКлиенте
Функция СформироватьКонтекстЗаполненияДанныхИсходногоДокумента(Контекст, ДопПараметры)
	Перем ДокументПоступленияНомер, ДокументПоступленияДата, ДокументПоступленияТип, ТЧРеквизитОснований;
	
	КонтекстСервера = Новый Структура;
	Если Контекст.Документ.Контрагент = Неопределено ИЛИ Контекст.Документ.Контрагент = Ложь Тогда
		ДопПараметры.Отказ = Истина;
		Возврат МодульОбъектаКлиент().НовыйСбисИсключение(, "ОбщиеФункции.СформироватьКонтекстЗаполненияДанныхИсходногоДокумента",,,"Не найден исходный документ");
	ИначеЕсли Контекст.СтруктураФайла.Файл.Формат = "счФактКор" Или Контекст.СтруктураФайла.Файл.Формат = "УкдКсчфДис" Тогда
		//KES первое основание. Теперь основания - это массив
		Если	(	Контекст.СтруктураФайла.Файл.Документ.Свойство("НомерСчФ",	ДокументПоступленияНомер)
				И	Контекст.СтруктураФайла.Файл.Документ.Свойство("ДатаСчФ",	ДокументПоступленияДата))
			Или	(	Контекст.СтруктураФайла.Файл.Документ.Свойство("Основание") И ТипЗнч(Контекст.СтруктураФайла.Файл.Документ.Основание)=Тип("Массив")
				И 	Контекст.СтруктураФайла.Файл.Документ.Основание[0].Свойство("Номер",	ДокументПоступленияНомер)
				И	Контекст.СтруктураФайла.Файл.Документ.Основание[0].Свойство("Дата",		ДокументПоступленияДата)) Тогда
		Иначе
			ДопПараметры.Отказ = Истина;
			Возврат МодульОбъектаКлиент().НовыйСбисИсключение(, "ОбщиеФункции.СформироватьКонтекстЗаполненияДанныхИсходногоДокумента",,,"Не указаны номер или дата исходного документа");
		КонецЕсли;
	ИначеЕсли	Контекст.СтруктураФайла.Файл.Формат = "ЭДОНакл"
			Или Контекст.СтруктураФайла.Файл.Формат = "АктВР" 
			Или Контекст.СтруктураФайла.Файл.Формат = "УкдДис" Тогда 
		Попытка
			ДокументПоступленияНомер = Контекст.СтруктураФайла.Файл.Документ.Параметр.ИсходныйДокументНомер;
			ДокументПоступленияДата = Контекст.СтруктураФайла.Файл.Документ.Параметр.ИсходныйДокументДата;
		Исключение
			Если Контекст.СтруктураФайла.Файл.Формат = "УкдДис" И Контекст.СтруктураФайла.Файл.Документ.Свойство("Основание")  // в УкдДис в первом основании дата и номер исходного поступления
				И ТипЗнч(Контекст.СтруктураФайла.Файл.Документ.Основание)=Тип("Массив")
				И Контекст.СтруктураФайла.Файл.Документ.Основание[0].Свойство("Номер", ДокументПоступленияНомер)
				И Контекст.СтруктураФайла.Файл.Документ.Основание[0].Свойство("Дата", ДокументПоступленияДата) Тогда 
			Иначе
				ДопПараметры.Отказ = Истина;
				Возврат МодульОбъектаКлиент().НовыйСбисИсключение(, "ОбщиеФункции.СформироватьКонтекстЗаполненияДанныхИсходногоДокумента",,,"Не указаны номер или дата исходного документа");
			КонецЕсли;
		КонецПопытки;
	ИначеЕсли Контекст.СтруктураФайла.Файл.Формат = "УпдСчфДоп" Тогда
		 ДокументПоступленияНомер =  Контекст.СтруктураФайла.Файл.Документ.Номер;
		 ДокументПоступленияДата =  Контекст.СтруктураФайла.Файл.Документ.Дата;
	Иначе
		ДопПараметры.Отказ = Истина;
		Возврат МодульОбъектаКлиент().НовыйСбисИсключение(, "ОбщиеФункции.СформироватьКонтекстЗаполненияДанныхИсходногоДокумента",,,"Неизвестный формат файла для поиска исходного документа");
	КонецЕсли;
	
	//Запрос для подбора основания

	Если	Не ДопПараметры.Отказ
		И	(	Не ЗначениеЗаполнено(ДокументПоступленияНомер)
		Или Не ЗначениеЗаполнено(ДокументПоступленияДата)) Тогда 
		ДопПараметры.Отказ = Истина;
		Возврат МодульОбъектаКлиент().НовыйСбисИсключение(, "ОбщиеФункции.СформироватьКонтекстЗаполненияДанныхИсходногоДокумента",,,"Не заполнены номер или дата исходного документа");
	КонецЕсли;
	
	КонтекстСервера.Вставить("Контрагент",				Контекст.Документ.Контрагент);
	КонтекстСервера.Вставить("Файл_Формат",				Контекст.СтруктураФайла.Файл.Формат);
	КонтекстСервера.Вставить("ТЧ",						Новый Структура);
	КонтекстСервера.Вставить("ДокументПоступленияНомер",ДокументПоступленияНомер);
	КонтекстСервера.Вставить("ДокументПоступленияДата",	ДокументПоступленияДата);
	Если Контекст.Документ.Свойство("Товары") Тогда
		КонтекстСервера.ТЧ.Вставить("Товары", Контекст.Документ.Товары);
	КонецЕсли;
	Если Контекст.Документ.Свойство("Услуги") Тогда
		КонтекстСервера.ТЧ.Вставить("Услуги", Контекст.Документ.Услуги);
	КонецЕсли;
	Если Не Контекст.Переменные.Свойство("ТипДокументаОснования", ДокументПоступленияТип) Тогда
		ДокументПоступленияТип = "ПоступлениеТоваровУслуг";
	КонецЕсли;
	КонтекстСервера.Вставить("ТипОснования", ДокументПоступленияТип);
	
	Если Контекст.Переменные.Свойство("ЗапросДокументаОснования") Тогда
		КонтекстСервера.Вставить("ТекстЗапросаШаблон", Контекст.Переменные.ЗапросДокументаОснования);
	КонецЕсли;
	
	Возврат КонтекстСервера;
КонецФункции

//Функция формирует табличную часть акта сверки для конфигураций УТ11-KА2	
&НаКлиенте
функция сбисПолучитьДанныеВзаиморасчетов(Контекст) Экспорт
	сбисОписаниеНастроек = Новый Структура("Тип, Ключ, Значение", "РассчитанныеЗначения.НастройкиСверки", "ПечатьСверкиВзаиморасчетов"); 
	сбисОписаниеНастроек.Значение= сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеНастроек);
	Если сбисОписаниеНастроек.Значение = Неопределено Тогда
		фрм = МестныйКэш.ГлавноеОкно.сбисНайтиФормуФункции("сбисПолучитьНастройкиАктаСверки", "Файл_АктСвер_3_01", "РаботаСДокументами1С");
		сбисОписаниеНастроек = фрм.сбисПолучитьНастройкиАктаСверки(Контекст, сбисОписаниеНастроек);
		сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеНастроек);
	КонецЕсли;
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Контекст.Документ);
	сбисКонтекстСервер = Новый Структура("Настройки, Объекты", сбисОписаниеНастроек.Значение, МассивОбъектов);
	
	Возврат сбисПолучитьДанныеВыборки(сбисКонтекстСервер);
КонецФункции

&НаКлиенте
Функция сбисПолучитьНачСальдоПоДоговорам(Контекст) Экспорт
	ИспользоватьНовыйФорматАктаСверки = ?(Контекст.Свойство("ИспользоватьНовыйФорматАктаСверки"), Контекст.ИспользоватьНовыйФорматАктаСверки, Ложь);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИспользоватьНовыйФорматАктаСверки", ИспользоватьНовыйФорматАктаСверки);
	
	Возврат сбисПолучитьНачСальдоПоДоговорамНаСервере(Контекст.Документ, ДопПараметры);		
КонецФункции

//Функция формирует начальное сальдо по договорам акта сверки для конфигурации БУХ3 
&НаСервереБезКонтекста              
Функция сбисПолучитьНачСальдоПоДоговорамНаСервере(ДанныеДокумента, ДопПараметры = Неопределено)

	ЗапросОстаткиДоговоров = Новый Запрос;
	Результат = Новый Массив;
	Если Не ЗначениеЗаполнено(ДопПараметры) Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;

	Если	Не ДанныеДокумента.РазбитьПоДоговорам
		И	Не (ДопПараметры.Свойство("ИспользоватьНовыйФорматАктаСверки") И ДопПараметры.ИспользоватьНовыйФорматАктаСверки) Тогда 
		ТекСтрока = Новый Структура("Договор, НачОстатокПоДоговоруДт, НачОстатокПоДоговоруКт");
		ТекСтрока.Договор = ДанныеДокумента.ДоговорКонтрагента; 
		Если ДанныеДокумента.ОстатокНаНачало > 0 Тогда
			ТекСтрока.НачОстатокПоДоговоруДт = ДанныеДокумента.ОстатокНаНачало;
			ТекСтрока.НачОстатокПоДоговоруКт = 0;
		Иначе
			ТекСтрока.НачОстатокПоДоговоруДт = 0;
			ТекСтрока.НачОстатокПоДоговоруКт = -ДанныеДокумента.ОстатокНаНачало;
        КонецЕсли;
		Результат.Добавить(ТекСтрока);
		Возврат Результат;		
	КонецЕсли;
	
	ФильтрСписокСчетов = Новый Массив();
	Для Каждого СтрокаСчета Из ДанныеДокумента.СписокСчетов Цикл
		Если ЗначениеЗаполнено(СтрокаСчета.Счет) И СтрокаСчета.УчаствуетВРасчетах Тогда
			ФильтрСписокСчетов.Добавить(СтрокаСчета.Счет);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаДоговоров = ДанныеДокумента.ПоДаннымОрганизации.Выгрузить(,"Договор");
	ТаблицаДоговоров.Свернуть("Договор");
	МассивДоговоров = ТаблицаДоговоров.ВыгрузитьКолонку("Договор");
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	// Дополним массив договорами из табличной части контрагента.
	ТаблицаДоговоровКонтрагента = ДанныеДокумента.ПоДаннымКонтрагента.Выгрузить(,"Договор");
	ТаблицаДоговоровКонтрагента.Свернуть("Договор");
	МассивДоговоровКонтрагента = ТаблицаДоговоровКонтрагента.ВыгрузитьКолонку("Договор");  
	
	УникальныеЗначения = Новый Соответствие;	
	Для Каждого Значение Из МассивДоговоров Цикл
		УникальныеЗначения.Вставить(Значение, Истина);
	КонецЦикла;
	
	Для Каждого Значение Из МассивДоговоровКонтрагента Цикл
		Если УникальныеЗначения[Значение] = Неопределено Тогда
			МассивДоговоров.Добавить(Значение);
			УникальныеЗначения.Вставить(Значение, Истина);
		КонецЕсли;
	КонецЦикла;
	
	ЗапросОстаткиДоговоров.УстановитьПараметр("Организация",   ДанныеДокумента.Организация);
	ЗапросОстаткиДоговоров.УстановитьПараметр("НачалоПериода", ДанныеДокумента.ДатаНачала);
	ЗапросОстаткиДоговоров.УстановитьПараметр("СчетаРасчета",  ФильтрСписокСчетов);
	ЗапросОстаткиДоговоров.УстановитьПараметр("Контрагент",    ДанныеДокумента.Контрагент);
	ЗапросОстаткиДоговоров.УстановитьПараметр("Договоры",      МассивДоговоров);
	ЗапросОстаткиДоговоров.УстановитьПараметр("Валюта",
		?(ДанныеДокумента.ВалютаДокумента = ВалютаРегламентированногоУчета, Неопределено, ДанныеДокумента.ВалютаДокумента));
	ЗапросОстаткиДоговоров.УстановитьПараметр("Договоры",      МассивДоговоров);
	ЗапросОстаткиДоговоров.УстановитьПараметр("ГоловнаяОрганизация",
		?(ЗначениеЗаполнено(ДанныеДокумента.Организация.ГоловнаяОрганизация), ДанныеДокумента.Организация.ГоловнаяОрганизация, ДанныеДокумента.Организация));
		
	АналитикаРасчетов = Новый Массив;
	АналитикаРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	ЗапросОстаткиДоговоров.УстановитьПараметр("АналитикаРасчетов", АналитикаРасчетов);
	ЗапросОстаткиДоговоров.УстановитьПараметр("АктСверкиВВалюте",
		ДанныеДокумента.ВалютаДокумента <> ВалютаРегламентированногоУчета);   
		
	СчетаИсключения = ПланыСчетов.Хозрасчетный.СчетаНДСПоАренднымОбязательствам();   
	СчетаИсключенияДоп = ПланыСчетов.Хозрасчетный.СчетаПроцентовПоОбязательствам();
	Для Каждого Значение Из СчетаИсключенияДоп Цикл
		СчетаИсключения.Добавить(Значение);
	КонецЦикла;
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РасчетыНДСНалоговогоАгента);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.КорректировкаРасчетовПрошлогоПериода);

	ЗапросОстаткиДоговоров.УстановитьПараметр("СчетаИсключения", СчетаИсключения);
		
	ЗапросОстаткиДоговоров.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СчетаРасчета
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&СчетаРасчета)
	|	И НЕ Хозрасчетный.Ссылка В (&СчетаИсключения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ОстальныеДоговоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И НЕ ДоговорыКонтрагентов.Ссылка В (&Договоры)
	|	И ДоговорыКонтрагентов.ЭтоГруппа = ЛОЖЬ
	|	И ДоговорыКонтрагентов.Организация = &ГоловнаяОрганизация
	|	И (&Валюта = НЕОПРЕДЕЛЕНО
	|			ИЛИ ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &Валюта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК Договор,
	|	ВЫБОР
	|		КОГДА &АктСверкиВВалюте
	|			ТОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстатокДт
	|		ИНАЧЕ ХозрасчетныйОстатки.СуммаОстатокДт
	|	КОНЕЦ КАК НачОстатокПоДоговоруДт,
	|	ВЫБОР
	|		КОГДА &АктСверкиВВалюте
	|			ТОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстатокКт
	|		ИНАЧЕ ХозрасчетныйОстатки.СуммаОстатокКт
	|	КОНЕЦ КАК НачОстатокПоДоговоруКт
	|ПОМЕСТИТЬ ОстаткиПоДоговорамАкта
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&НачалоПериода,
	|			Счет В
	|				(ВЫБРАТЬ
	|					СчетаРасчета.Ссылка
	|				ИЗ
	|					СчетаРасчета КАК СчетаРасчета),
	|			&АналитикаРасчетов,
	|			Организация = &Организация
	|				И Субконто1 В (&Договоры)) КАК ХозрасчетныйОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК Договор,
	|	ВЫБОР
	|		КОГДА &АктСверкиВВалюте
	|			ТОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстатокДт
	|		ИНАЧЕ ХозрасчетныйОстатки.СуммаОстатокДт
	|	КОНЕЦ КАК НачОстатокПоДоговоруДт,
	|	ВЫБОР
	|		КОГДА &АктСверкиВВалюте
	|			ТОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстатокКт
	|		ИНАЧЕ ХозрасчетныйОстатки.СуммаОстатокКт
	|	КОНЕЦ КАК НачОстатокПоДоговоруКт
	|ПОМЕСТИТЬ ОстаткиПоОстальнымДоговорам
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&НачалоПериода,
	|			Счет В
	|				(ВЫБРАТЬ
	|					СчетаРасчета.Ссылка
	|				ИЗ
	|					СчетаРасчета КАК СчетаРасчета),
	|			&АналитикаРасчетов,
	|			Организация = &Организация
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						ОстальныеДоговоры.Ссылка
	|					ИЗ
	|						ОстальныеДоговоры КАК ОстальныеДоговоры)) КАК ХозрасчетныйОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоДоговорамАкта.Договор КАК Договор,
	|	СУММА(ОстаткиПоДоговорамАкта.НачОстатокПоДоговоруДт) КАК НачОстатокПоДоговоруДт,
	|	СУММА(ОстаткиПоДоговорамАкта.НачОстатокПоДоговоруКт) КАК НачОстатокПоДоговоруКт
	|ИЗ
	|	ОстаткиПоДоговорамАкта КАК ОстаткиПоДоговорамАкта
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПоДоговорамАкта.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоОстальнымДоговорам.Договор КАК Договор,
	|	СУММА(ОстаткиПоОстальнымДоговорам.НачОстатокПоДоговоруДт) КАК НачОстатокПоДоговоруДт,
	|	СУММА(ОстаткиПоОстальнымДоговорам.НачОстатокПоДоговоруКт) КАК НачОстатокПоДоговоруКт
	|ИЗ
	|	ОстаткиПоОстальнымДоговорам КАК ОстаткиПоОстальнымДоговорам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ОстаткиПоОстальнымДоговорам.Договор = ДоговорыКонтрагентов.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПоОстальнымДоговорам.Договор,
	|	ДоговорыКонтрагентов.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоговорыКонтрагентов.Наименование";
	РезультатЗапроса = ЗапросОстаткиДоговоров.ВыполнитьПакет();
	РезультатЗапросаа = ЗапросОстаткиДоговоров.Выполнить();
	ВыборкаЗапроса4 = РезультатЗапроса[4].Выбрать();
	ВыборкаЗапроса5 = РезультатЗапроса[5].Выбрать();
		
	Пока ВыборкаЗапроса4.Следующий() Цикл
		
		ТекСтрока = Новый Структура("Договор, НачОстатокПоДоговоруДт, НачОстатокПоДоговоруКт");
		ТекСтрока.Договор = ВыборкаЗапроса4.Договор;
		ТекСтрока.НачОстатокПоДоговоруДт = ВыборкаЗапроса4.НачОстатокПоДоговоруДт;
		ТекСтрока.НачОстатокПоДоговоруКт = ВыборкаЗапроса4.НачОстатокПоДоговоруКт;
		Результат.Добавить(ТекСтрока);
		
	КонецЦикла; 
	
	Пока ВыборкаЗапроса5.Следующий() Цикл
		
		ТекСтрока = Новый Структура("Договор, НачОстатокПоДоговоруДт, НачОстатокПоДоговоруКт");
		ТекСтрока.Договор = ВыборкаЗапроса5.Договор;
		ТекСтрока.НачОстатокПоДоговоруДт = ВыборкаЗапроса5.НачОстатокПоДоговоруДт;
		ТекСтрока.НачОстатокПоДоговоруКт = ВыборкаЗапроса5.НачОстатокПоДоговоруКт;
		Результат.Добавить(ТекСтрока);
		
	КонецЦикла; 
	
	Возврат Результат;	
	
КонецФункции
	
&НаСервереБезКонтекста              
Функция сбисПолучитьНастройкиАктаСверки(Знач Контекст, Знач сбисОписаниеНастроек) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	сбисОписаниеНастроек.Значение = Документы.СверкаВзаиморасчетов.НастройкиПечатиПоУмолчанию();	
	сбисОписаниеНастроек.Значение.Вставить("ВалютаРегл", Константы.ВалютаРегламентированногоУчета.Получить());
	Если Контекст.Свойство("Детализация") и Контекст.Детализация = "Договор" Тогда
		сбисОписаниеНастроек.Значение.ДетализацияВзаиморасчетов = 1;
		Если сбисОписаниеНастроек.Значение.Свойство("ДетализацияФинансовыхИнструментов") Тогда
			сбисОписаниеНастроек.Значение.ДетализацияФинансовыхИнструментов = 1;	
		КонецЕсли;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат сбисОписаниеНастроек;
КонецФункции

&НаСервереБезКонтекста
Функция сбисПолучитьДанныеВыборки(Знач Контекст)
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		ДанныеЗапроса = Документы.СверкаВзаиморасчетов.ВыборкаДанныхДокумента(Контекст.Объекты, Контекст.Настройки);
	Исключение
		ЗапросДанныеНаПечать = Документы.СверкаВзаиморасчетов.ЗапросДанныеНаПечать(Контекст.Объекты, Контекст.Настройки);
		ДанныеЗапроса = ЗапросДанныеНаПечать.Выполнить();
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
	ТабЧастьДокумента	= Новый Массив;    
	ДанныеПоОстакам		= Новый Структура("НачальныйОстатокДебет, НачальныйОстатокКредит, НачальныйОстатокДебетКонтрагент, НачальныйОстатокКредитКонтрагент", 0,0,0,0);	
	ДанныеПоОстакамТекущее = Новый Структура("НачальныйОстатокДебет, НачальныйОстатокКредит, НачальныйОстатокДебетКонтрагент, НачальныйОстатокКредитКонтрагент", 0,0,0,0);	
	Если НЕ ДанныеЗапроса.Пустой() Тогда
		ДанныеДокумента = ДанныеЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Иначе
		Возврат Новый Структура("ТабЧастьДокумента, Остатки",ТабЧастьДокумента, Неопределено);
	КонецЕсли;
	Если Не ДанныеДокумента.Следующий() Тогда
		Возврат Новый Структура("ТабЧастьДокумента, Остатки",ТабЧастьДокумента, Неопределено);
	КонецЕсли;
	
	ДанныеПоТипуРасчетов = ДанныеДокумента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ДанныеПоТипуРасчетов.Следующий() Цикл		
		ВыборкаПоДетальнымРасчетам = ДанныеПоТипуРасчетов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоДетальнымРасчетам.Следующий() Цикл
			Если	ВыборкаПоДетальнымРасчетам.НачальноеСальдоДт <> 0
				Или ВыборкаПоДетальнымРасчетам.НачальноеСальдоКт <> 0
				Или ВыборкаПоДетальнымРасчетам.ЕстьОбороты Тогда
				сбисЗаполнитьДанныеПоНачальнымОстаткам(ВыборкаПоДетальнымРасчетам, ДанныеПоОстакамТекущее, Контекст.Настройки);
				
				Для Каждого КлючЗнач Из ДанныеПоОстакамТекущее Цикл
					
					ДанныеПоОстакам[КлючЗнач.Ключ] = ДанныеПоОстакам[КлючЗнач.Ключ] + КлючЗнач.Значение;
					
				КонецЦикла;
				
				сбисСформироватьДетальнуюЗаписьВзаиморасчетов(ТабЧастьДокумента, ВыборкаПоДетальнымРасчетам, ДанныеДокумента, ДанныеПоОстакам, Контекст.Настройки);
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла;
	Возврат Новый Структура("ТабЧастьДокумента, Остатки", ТабЧастьДокумента, ДанныеПоОстакам);	
КонецФункции

&НаСервереБезКонтекста
Процедура сбисЗаполнитьДанныеПоНачальнымОстаткам(ВыборкаДетальныхЗаписей, ДанныеПоОстакам, НастройкиПечати)
	
	ДанныеПоОстакам.НачальныйОстатокДебет = ВыборкаДетальныхЗаписей.НачальноеСальдоДт;
	ДанныеПоОстакам.НачальныйОстатокКредит = Мин(-ВыборкаДетальныхЗаписей.НачальноеСальдоКт, ВыборкаДетальныхЗаписей.НачальноеСальдоКт);//Для совместимости со старыми функциями, должно быть отрицательное значение
	
	ДанныеПоОстакам.НачальныйОстатокДебетКонтрагент = ВыборкаДетальныхЗаписей.НачальноеСальдоКт;
	ДанныеПоОстакам.НачальныйОстатокКредитКонтрагент = Мин(-ВыборкаДетальныхЗаписей.НачальноеСальдоДт, ВыборкаДетальныхЗаписей.НачальноеСальдоДт);//Для совместимости со старыми функциями, должно быть отрицательное значение
	
	Если НЕ ВыборкаДетальныхЗаписей.ФинансовыеИнструменты И НЕ НастройкиПечати.ДолгКакДебет Тогда
		Если ВыборкаДетальныхЗаписей.НачальноеСальдо > 0 Тогда
			ДанныеПоОстакам.НачальныйОстатокДебет = ВыборкаДетальныхЗаписей.НачальноеСальдо;
			ДанныеПоОстакам.НачальныйОстатокДебетКонтрагент = ВыборкаДетальныхЗаписей.НачальноеСальдо;
		Иначе
			ДанныеПоОстакам.НачальныйОстатокКредит = -ВыборкаДетальныхЗаписей.НачальноеСальдо;
			//ДанныеПоОстакам.НачальныйОстатокКредитКонтрагент = -ВыборкаДетальныхЗаписей.НачальноеСальдо;
			ДанныеПоОстакам.НачальныйОстатокКредитКонтрагент = ВыборкаДетальныхЗаписей.НачальноеСальдо;
		КонецЕсли;
	КонецЕсли;
	Если НастройкиПечати.НеЗаполнятьДанныеКонтрагента Тогда
		ДанныеПоОстакам.НачальныйОстатокДебетКонтрагент = 0;
		ДанныеПоОстакам.НачальныйОстатокКредитКонтрагент = 0;
	КонецЕсли;
КонецПроцедуры

// Функция заполняет данные по строкам акта сверки для конфигурации УТ11.4.8 и выше	
&НаСервереБезКонтекста
Функция сбисСформироватьДетальнуюЗаписьВзаиморасчетов(ТабЧастьДокумента, ВыборкаДетальныхЗаписей, ДанныеДокумента, ДанныеПоОстакам, НастройкиПечати)
	Перем ДетальныеЗаписи;
	Если ВыборкаДетальныхЗаписей.ЕстьОбороты Тогда
		ДетальныеЗаписи = ВыборкаДетальныхЗаписей.Выбрать();
		Пока ДетальныеЗаписи.Следующий() Цикл
			Если ДетальныеЗаписи.ОписаниеДокумента = NULL Тогда
				Продолжить;
			КонецЕсли;
			ДатаДокумента		= Формат(ДетальныеЗаписи.ДатаДокумента, "ДФ='дд.ММ.гггг'");
			НомерДокумента		= ДетальныеЗаписи.НомерДокумента;			
			НазваниеДокумента	= ?(ДетальныеЗаписи.ОписаниеДокумента = NULL, "", ДетальныеЗаписи.ОписаниеДокумента);
			мПараметр		= Новый Структура("Дата, Номер", Новый Структура("Параметр_Имя, Параметр_Значение", "Дата", ДатаДокумента), Новый Структура("Параметр_Имя, Параметр_Значение", "Номер", ДетальныеЗаписи.НомерДокумента));
			
			НоваяСтрока = Новый Структура;
			НоваяСтрока.Вставить("ТаблДок_Дата",		ДатаДокумента); 
			НоваяСтрока.Вставить("ТаблДок_Номер",		НомерДокумента);
			НоваяСтрока.Вставить("ТаблДок_Примечание",	НазваниеДокумента); 
			НоваяСтрока.Вставить("ДокументТабл",		ДетальныеЗаписи.РасчетныйДокумент);
			НоваяСтрока.Вставить("ТаблДок_Дебет",		ДетальныеЗаписи.СуммаДебет);
			НоваяСтрока.Вставить("ТаблДок_Кредит",		ДетальныеЗаписи.СуммаКредит);
			НоваяСтрока.Вставить("ТаблДок_Раздел",		"Отправитель");
			НоваяСтрока.Вставить("мОснование",			Новый Структура);
			НоваяСтрока.Вставить("мПараметр",			мПараметр);
			Основание = Неопределено;
			
			НоваяСтрокаПоДаннымКонтрагента = Новый Структура;
			НоваяСтрокаПоДаннымКонтрагента.Вставить("ТаблДок_Дата",			ДатаДокумента); 
			НоваяСтрокаПоДаннымКонтрагента.Вставить("ТаблДок_Номер",		НомерДокумента); 
			НоваяСтрокаПоДаннымКонтрагента.Вставить("ТаблДок_Примечание",	НазваниеДокумента); 
			НоваяСтрокаПоДаннымКонтрагента.Вставить("ДокументТабл",			ДетальныеЗаписи.РасчетныйДокумент); 
			НоваяСтрокаПоДаннымКонтрагента.Вставить("ТаблДок_Дебет",		ДетальныеЗаписи.СуммаДебетКонтрагент);
			НоваяСтрокаПоДаннымКонтрагента.Вставить("ТаблДок_Кредит",		ДетальныеЗаписи.СуммаКредитКонтрагент);
			НоваяСтрокаПоДаннымКонтрагента.Вставить("ТаблДок_Раздел",		"Получатель");
			НоваяСтрокаПоДаннымКонтрагента.Вставить("мОснование",			Новый Структура);
			НоваяСтрокаПоДаннымКонтрагента.Вставить("мПараметр",			мПараметр); 
			
			КлючДетализации = "Договор";
			Если НастройкиПечати.ДетализацияВзаиморасчетов = "Договор" Тогда 
				мОснование = ДетальныеЗаписи.ОбъектГруппировки;
				Если мОснование = Неопределено Тогда
					мОснование = ДетальныеЗаписи.Договор;
				КонецЕсли;
			Иначе
				мОснование = ДетальныеЗаписи.ДокументСсылка;
				КлючДетализации = "Документ";
			КонецЕсли;
			сбисОснование = Новый Структура;
			сбисОснование.Вставить("Основание",			мОснование);
			сбисОснование.Вставить("Основание_Название",Строка(мОснование));
			сбисОснование.Вставить("Основание_Номер",	мОснование.Номер);
			сбисОснование.Вставить("Основание_Дата",	Формат(мОснование.Дата,"ДФ=dd.MM.yyyy"));
			сбисОснование.Вставить("НачальноеСальдоДт",	ДетальныеЗаписи.НачальноеСальдоДт);
			сбисОснование.Вставить("НачальноеСальдоКт", ДетальныеЗаписи.НачальноеСальдоКт);
			сбисОснование.Вставить("КонечноеСальдоДт",	ДетальныеЗаписи.КонечноеСальдоДт);
			сбисОснование.Вставить("КонечноеСальдоКт",	ДетальныеЗаписи.КонечноеСальдоКт);

			НоваяСтрока.мОснование.Вставить(КлючДетализации, сбисОснование);
			НоваяСтрокаПоДаннымКонтрагента.мОснование.Вставить(КлючДетализации, сбисОснование);
			ТабЧастьДокумента.Добавить(НоваяСтрока);
			ТабЧастьДокумента.Добавить(НоваяСтрокаПоДаннымКонтрагента);		
		КонецЦикла; 
	КонецЕсли;
	
	Возврат ТабЧастьДокумента;
	
КонецФункции

//Функция заполняет договор в загружаемых документах	
&НаКлиенте
Функция ЗаполнитьДоговорУНФ(Контекст) Экспорт
	
	ОшибкаПоиска = Ложь;
	сбисРезультат = сбисПолучитьДоговорУНФ_Сервер(Контекст.Документ, Контекст.СтруктураФайла, ОшибкаПоиска);
	Если ОшибкаПоиска Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат сбисРезультат;
	
КонецФункции

&НаКлиенте
функция ПолучитьСкладУНФ(Контекст) Экспорт
	сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "ПользовательскиеЗначения.ЗначенияПоУмолчанию", "ОсновнойСклад"); 
	сбисОписаниеОбъекта.Значение= сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	Если сбисОписаниеОбъекта.Значение = Неопределено Тогда	
		сбисОписаниеОбъекта.Значение = сбисПолучитьЗначениеПользователяПоУмолчанию_УНФ_Сервер(сбисОписаниеОбъекта);
		сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	КонецЕсли;
	Возврат сбисОписаниеОбъекта.Значение;
КонецФункции	

&НаСервереБезКонтекста
Функция СуммаВключаетНДС_УНФ(Знач Контекст) Экспорт
	Если Не Контекст.Документ.Свойство("НалогообложениеНДС") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Контекст.Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
КонецФункции

&НаКлиенте
Функция УчитыватьНДС(Контекст) Экспорт
	//Функция определяет необходимость учитывать НДС в загружаемых документах	
	УчитыватьНДС = Ложь;
	Если Не Контекст.Ини.Свойство("мТаблДок") Тогда
		Возврат УчитыватьНДС;
	КонецЕсли;
	Для каждого КлючЗначТаблЧасть из Контекст.Ини.мТаблДок.РассчитанноеЗначение Цикл
		ТаблЧасть = КлючЗначТаблЧасть.Значение;
		Для каждого Стр из ТаблЧасть Цикл
			Если Стр.Свойство("СтавкаНДС") и нрег(Стр.СтавкаНДС) <> "без ндс" Тогда
				УчитыватьНДС = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если УчитыватьНДС Тогда
			//если уже нашли строки в которых ставка <> "без ндс", то остальные табличные части не проверяем
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	Возврат УчитыватьНДС;
КонецФункции

//Функция определяет необходимость учитывать НДС в загружаемых документах	
&НаСервереБезКонтекста
Функция УчитыватьНДС_УНФ(Знач Контекст) Экспорт
	Для Каждого ИмяТаблЧасть Из Контекст.Ини.мТаблДок Цикл
		//выбираем табличные части по ини
		ТаблЧасть = Неопределено;
		Если Не Контекст.Документ.Свойство(ИмяТаблЧасть.Ключ, ТаблЧасть) Тогда
			Продолжить;
		КонецЕсли;
		//выбираем строки из табличной части
		Для Каждого Стр Из ТаблЧасть Цикл
			Если Стр.Свойство("СтавкаНДС") И НРег(Стр.СтавкаНДС) <> "без ндс" Тогда
				Возврат Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;	
	Возврат Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
КонецФункции

&НаКлиенте
Функция ПолучитьИННКППСтороны(Контекст) Экспорт
	Перем Сторона;
	МассивПолей = РазбитьСтрокуВМассивНаКлиенте("ИНН,КПП", ",");
	Если Не Контекст.ТекущееПолеИни.Свойство("РассчитанноеЗначение", Сторона) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	ФЮЛ = ?(Сторона.Свойство("СвЮЛ") И ЗначениеЗаполнено(Сторона.СвЮЛ), "СвЮЛ", 
		?(Сторона.Свойство("СвФЛ") И ЗначениеЗаполнено(Сторона.СвФЛ), "СвФЛ", ""));
	Для Каждого Поле Из МассивПолей Цикл
		Результат.Вставить(Поле);
		Если ЗначениеЗаполнено(ФЮЛ) Тогда
			Сторона[ФЮЛ].Свойство(Поле, Результат[Поле]);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции
	
////////////////////////////////////////////////////
/////////////////Табличная часть////////////////////

&НаКлиенте
Функция ЗаполнитьЕдиницуИзмеренияУНФ(Контекст) Экспорт
	Если Контекст.СтрТабл.ЕдиницаИзмерения = Неопределено Тогда
		сбисКонтекстСервер = Новый Структура("Ссылка, ИмяРеквизита", Контекст.СтрТабл.Номенклатура, "ЕдиницаИзмерения");
		Возврат СбисПолучитьРеквизит(сбисКонтекстСервер);
	КонецЕсли;
	Возврат ЗаполнитьЕдиницуИзмерения(Контекст);
КонецФункции

//Функция заполняет ставку НДС в загружаемых документах	
&НаКлиенте
Функция ЗаполнитьСтавкуНДС(Контекст) Экспорт
	сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "Перечисления.СтавкиНДС"); 
	Если	Не Контекст.СтрТабл.Свойство("СтавкаНДС", сбисОписаниеОбъекта.Ключ)
		Или	Не ЗначениеЗаполнено(сбисОписаниеОбъекта.Ключ) Тогда
		Если	Не Контекст.Переменные.Свойство("СтавкаНДС", сбисОписаниеОбъекта.Ключ)
		Или	Не ЗначениеЗаполнено(сбисОписаниеОбъекта.Ключ) Тогда
			Если Контекст.Свойство("СтрокаФайла") тогда
				сбисОписаниеОбъекта.Ключ = сбисРассчитатьСтавкуНДС(Контекст.СтрокаФайла);
			Иначе
				сбисОписаниеОбъекта.Ключ = сбисРассчитатьСтавкуНДС(Контекст.СтрТабл);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если сбисОписаниеОбъекта.Ключ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	сбисОписаниеОбъекта.Значение= сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	Если сбисОписаниеОбъекта.Значение = Неопределено Тогда	
		сбисОписаниеОбъекта.Значение = сбисПолучитьСтавкуНДС_Перечисление_НаСервере(сбисОписаниеОбъекта.Ключ);
		сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	КонецЕсли;
	Возврат сбисОписаниеОбъекта.Значение;
КонецФункции

//Функция заполняет ставку НДС в загружаемых документах если это справочник со значениями ставок	
&НаКлиенте
Функция ЗаполнитьСтавкуНДСИзСправочника(Контекст) Экспорт
	сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "Справочники.СтавкиНДС"); 
	Если	Не Контекст.СтрТабл.Свойство("СтавкаНДС", сбисОписаниеОбъекта.Ключ)
		Или	Не ЗначениеЗаполнено(сбисОписаниеОбъекта.Ключ) Тогда
		Если	Не Контекст.Переменные.Свойство("СтавкаНДС", сбисОписаниеОбъекта.Ключ)
		Или	Не ЗначениеЗаполнено(сбисОписаниеОбъекта.Ключ) Тогда
			сбисОписаниеОбъекта.Ключ = сбисРассчитатьСтавкуНДС(Контекст.СтрокаФайла);
		КонецЕсли;
	КонецЕсли;
	сбисОписаниеОбъекта.Значение= сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	Если сбисОписаниеОбъекта.Значение = Неопределено Тогда	
		сбисОписаниеОбъекта.Значение = сбисПолучитьСтавкуНДС_Справочник_НаСервере(сбисОписаниеОбъекта.Ключ);
		сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	КонецЕсли;
	Возврат сбисОписаниеОбъекта.Значение;
КонецФункции

// Функция возвращает значение и тип ставки НДС
//
// Параметры:
//  Ставка	 - Перечисление - Ставка НДС из документа 1С
// 
// Возвращаемое значение:
//   - Структура:
//		- Ставка	- Строка - Значение ставки строкой
//		- ТипСтавки	- Строка - "дробь" / "процент" / "текст"
//
&НаКлиенте
Функция ЗначениеИТипСтавки(Ставка) Экспорт
	
	СинонимПолученИзМетаданных = Ложь;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Попытка
			ИмяПеречисления = Ставка.Метаданные().Имя;
			Индекс = Перечисления[ИмяПеречисления].Индекс(Ставка);
			СтавкаСиноним = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления.Получить(Индекс).Синоним;
			СинонимПолученИзМетаданных = Истина;
		Исключение
		КонецПопытки;
	#КонецЕсли
	
	Если Не СинонимПолученИзМетаданных Тогда
		Попытка
			СтавкаСиноним = Строка(Ставка);
		Исключение
			СтавкаСиноним = "";
		КонецПопытки;
	КонецЕсли;
	
	СтавкаСиноним = СтрЗаменить(СтавкаСиноним, "%", "");
	СтавкаСиноним = НРег(СокрЛП(СтрЗаменить(СтавкаСиноним, " ", "")));
	
	СоответствиеПроверкаСтавки = Новый Соответствие;
	СоответствиеПроверкаСтавки.Вставить("22/122",	Новый Структура("Ставка, ТипСтавки", "22/122",	"дробь"));
	СоответствиеПроверкаСтавки.Вставить("22",		Новый Структура("Ставка, ТипСтавки", "22",		"процент"));
	СоответствиеПроверкаСтавки.Вставить("20/120",	Новый Структура("Ставка, ТипСтавки", "20/120",	"дробь"));
	СоответствиеПроверкаСтавки.Вставить("20",		Новый Структура("Ставка, ТипСтавки", "20",		"процент"));
	СоответствиеПроверкаСтавки.Вставить("18/118",	Новый Структура("Ставка, ТипСтавки", "18/118",	"дробь"));
	СоответствиеПроверкаСтавки.Вставить("18",		Новый Структура("Ставка, ТипСтавки", "18",		"процент"));
	СоответствиеПроверкаСтавки.Вставить("10/110",	Новый Структура("Ставка, ТипСтавки", "10/110",	"дробь"));
	СоответствиеПроверкаСтавки.Вставить("10",		Новый Структура("Ставка, ТипСтавки", "10",		"процент"));
	СоответствиеПроверкаСтавки.Вставить("5/105",	Новый Структура("Ставка, ТипСтавки", "5/105",	"дробь"));
	СоответствиеПроверкаСтавки.Вставить("5",		Новый Структура("Ставка, ТипСтавки", "5",		"процент"));
	СоответствиеПроверкаСтавки.Вставить("7/107",	Новый Структура("Ставка, ТипСтавки", "7/107",	"дробь"));
	СоответствиеПроверкаСтавки.Вставить("7",		Новый Структура("Ставка, ТипСтавки", "7",		"процент"));
	СоответствиеПроверкаСтавки.Вставить("0",		Новый Структура("Ставка, ТипСтавки", "0",		"процент"));
	СоответствиеПроверкаСтавки.Вставить("ндсисчисляетсяналоговымагентом", Новый Структура("Ставка, ТипСтавки", "НДС исчисляется налоговым агентом", "текст"));
	
	СтруктураСтавка = СоответствиеПроверкаСтавки.Получить(СтавкаСиноним);
	
	Если СтруктураСтавка = Неопределено Тогда
		СтруктураСтавка = Новый Структура("Ставка, ТипСтавки", "без НДС", "текст");
	КонецЕсли;
	
	Возврат СтруктураСтавка;
	
КонецФункции

//Функция определяет название табличной части документа поступления, в которую нужно загружать данные	
&НаКлиенте
Функция сбисИмяТЧ(Контекст) Экспорт
	
	сбисСтрТабл	= Неопределено;
	сбисИмяТЧ	= "Товары";
	
	Если Контекст.Свойство("СтрТабл", сбисСтрТабл) И сбисСтрТабл.Свойство("Номенклатура") Тогда
		Если сбисНоменклатураУслуга(Контекст)
			ИЛИ сбисНоменклатура1СУслуга_Сервер(Новый Структура("Номенклатура", сбисСтрТабл.Номенклатура)) Тогда
			сбисИмяТЧ = "Услуги";	
		КонецЕсли;
	КонецЕсли;
		
	Возврат сбисИмяТЧ;
	
КонецФункции

//Функция определяет название табличной части документа поступления, в которую нужно загружать данные	
&НаКлиенте
Функция сбисИмяТЧ_УНФ(Контекст) Экспорт
	
	ЭтоТЧЗапасы = 	Контекст.Свойство("СтрТабл")
				И	Контекст.СтрТабл.Свойство("Номенклатура")
				И	(ЗначениеЗаполнено(Контекст.СтрТабл.Номенклатура)
						И сбисНоменклатура1СЗапас_УНФ_Сервер(Новый Структура("Номенклатура", Контекст.СтрТабл.Номенклатура))
					Или Не ЗначениеЗаполнено(Контекст.СтрТабл.Номенклатура)); // загрузка по-умолчанию, если номенклатура не сопоставлена
	
	Если ЭтоТЧЗапасы Тогда
		Возврат "Запасы";
	Иначе
		Возврат "Расходы";
	КонецЕсли;
	
КонецФункции

//Функция возвращает вид номенклатуры по признаку услуги позиции
&НаКлиенте
Функция сбисНоменклатураВид(Контекст) Экспорт
	сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "Справочники.ВидыНоменклатуры", "Товары"); 
	Если сбисНоменклатураУслуга(Контекст) Тогда
		сбисОписаниеОбъекта.Ключ = "Услуги";
	КонецЕсли;
	сбисОписаниеОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	Если сбисОписаниеОбъекта.Значение = Неопределено Тогда	
		сбисОписаниеОбъекта.Значение = Объект1СПоОписанию(сбисОписаниеОбъекта, "ПоНаименованию");
		сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	КонецЕсли;
	Возврат сбисОписаниеОбъекта.Значение;
КонецФункции

//Функция возвращает признак номенклатуры услуга по данным файла
&НаКлиенте
Функция сбисНоменклатураУслуга(Контекст) Экспорт
	Перем ВидОперации;
	Если Контекст.СтруктураФайла.Свойство("Файл") Тогда
		Возврат	(	Контекст.СтруктураФайла.Файл.Формат = "АктВР"
		И	Не	(	Контекст.СтруктураФайла.Файл.Документ.Свойство("Параметр", ВидОперации)
		И	ВидОперации.Свойство("ДокументВидОперации", ВидОперации)
		И	ВидОперации = "АктПП"))
		Или (	Контекст.Свойство("СтрТабл")
		И	Контекст.СтрТабл.Свойство("Тип")
		И	(	Контекст.СтрТабл.Тип = "2" 
		Или	Контекст.СтрТабл.Тип = "3")); 
	ИначеЕсли Контекст.СтруктураФайла.Свойство("Услуги") Тогда
		Возврат Контекст.СтруктураФайла.Услуги;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

//Функция возвращает тип номенклатуры по признаку услуги позиции для БГУ2
&НаКлиенте
Функция сбисТипНоменклатурыБГУ(Контекст) Экспорт
	сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "Перечисления.ТипыНоменклатуры", "ПрочиеМЗ"); 
	Если сбисНоменклатураУслуга(Контекст) Тогда
		сбисОписаниеОбъекта.Ключ = "Услуга";
	КонецЕсли;
	сбисОписаниеОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	Если сбисОписаниеОбъекта.Значение = Неопределено Тогда	
		сбисОписаниеОбъекта.Значение = Объект1СПоОписанию(сбисОписаниеОбъекта, "ПоНаименованию");
		сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	КонецЕсли;
	Возврат сбисОписаниеОбъекта.Значение;
КонецФункции 

// Функция возвращает тип номенклатуры по признаку услуги позиции для Штрих-М
//
// Параметры:
//  Контекст - Структура - Контекст расчета
// 
// Возвращаемое значение:
//  Перечисление - Расчитанное значение перечисления
//
&НаКлиенте
Функция сбисТипНоменклатурыШТП(Контекст) Экспорт 
	
	сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "Перечисления.ТипыНоменклатуры", "Товар");  
	
	Если сбисНоменклатураУслуга(Контекст) Тогда
		
		сбисОписаниеОбъекта.Ключ = "Услуга"; 
		
	КонецЕсли;  
	
	сбисОписаниеОбъекта.Значение = сбисПолучитьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта);
	
	Если сбисОписаниеОбъекта.Значение = Неопределено Тогда
		
		сбисОписаниеОбъекта.Значение = Объект1СПоОписанию(сбисОписаниеОбъекта, "ПоНаименованию");
		сбисЗакэшироватьЗначениеРассчитанногоОбъекта(МестныйКэш, сбисОписаниеОбъекта); 
		
	КонецЕсли; 
	
	Возврат сбисОписаниеОбъекта.Значение;  
	
КонецФункции

&НаКлиенте
Функция сбисПроверитьЗаполнитьШтрихкод(Контекст) Экспорт
	
	сбисКонтекстСервер = Новый Структура("Ини, Документ, СтрТабл, СтрокаФайла");
	ЗаполнитьЗначенияСвойств(сбисКонтекстСервер, Контекст); 
	Попытка
		сбисПроверитьЗаполнитьШтрихкод_Сервер(сбисКонтекстСервер); 
	Исключение 
		СбисИсключение = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "РаботаСДокументами1С.сбисПроверитьЗаполнитьШтрихкод");  
		МодульОбъектаКлиент().СообщитьСбисИсключение(СбисИсключение, Новый Структура("СтатусСообщения", "platform_warning"));
	КонецПопытки;
	
КонецФункции

// Функция рассчитывает цену С НДС из суммы и количества
//
// Параметры:
//  Контекст	 - Структура контекст 
// 
// Возвращаемое значение:
//   - Запрашиваемая цена - Число / Неопределен
//
&НаКлиенте
Функция сбисРассчитатьЦену(Контекст) Экспорт
	Перем СуммаСНДС, СуммаНДС, СуммаБезНДС, Количество;
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	СтрТабл		= Контекст.СтрТабл;
	СтрокаФайла	= Контекст.СтрокаФайла;
	
	ПараметрыРасчета = Новый Структура;
	
	Если	Не ((СтрТабл.Свойство("СуммаНДС", СуммаНДС)
				ИЛИ СтрокаФайла.Свойство("СуммаНДС", СуммаНДС))
			И ЗначениеЗаполнено(СуммаНДС)) Тогда
			
		СуммаНДС = 0;
	КонецЕсли;
	ПараметрыРасчета.Вставить("СуммаНДС", ТипЧисло.ПривестиЗначение(СуммаНДС));
	
	Если	СтрТабл.Свойство("СуммаСНДС", СуммаСНДС)
			ИЛИ СтрокаФайла.Свойство("СуммаСНДС", СуммаСНДС)
			ИЛИ СтрТабл.Свойство("Сумма", СуммаСНДС)
			ИЛИ СтрокаФайла.Свойство("Сумма", СуммаСНДС) Тогда
			
		ПараметрыРасчета.Вставить("СуммаСНДС",		ТипЧисло.ПривестиЗначение(СуммаСНДС));
		ПараметрыРасчета.Вставить("СуммаБезНДС",	ТипЧисло.ПривестиЗначение(СуммаСНДС) - ПараметрыРасчета.СуммаНДС);
		
	ИначеЕсли	СтрТабл.Свойство("СуммаБезНал", СуммаБезНДС)
				ИЛИ СтрокаФайла.Свойство("СуммаБезНал", СуммаБезНДС) Тогда
				
		ПараметрыРасчета.Вставить("СуммаСНДС",		ТипЧисло.ПривестиЗначение(СуммаБезНДС));
		ПараметрыРасчета.Вставить("СуммаБезНДС",	ТипЧисло.ПривестиЗначение(СуммаБезНДС));
	Иначе
		ПараметрыРасчета.Вставить("СуммаСНДС",		0);
		ПараметрыРасчета.Вставить("СуммаБезНДС",	0);
	КонецЕсли;
	
	Если	(СтрТабл.Свойство("Количество", Количество)
				ИЛИ СтрокаФайла.Свойство("Кол_во", Количество))
			И Количество <> Неопределено
			И ТипЧисло.ПривестиЗначение(Количество) <> 0 Тогда
			
		ПараметрыРасчета.Вставить("Количество", ТипЧисло.ПривестиЗначение(Количество));
	Иначе
		ПараметрыРасчета.Вставить("Количество", 1);	
	КонецЕсли;
	
	// Пока что передаем "Истина" всегда. В будущем можем прокидывать из ИНИ.
	ПараметрыРасчета.Вставить("ЦенаВключаетНДС", Истина);
	
	Если	(МестныйКэш.Парам.ПересчитыватьЦеныПоДанным1С = 0 И СуммаСНДС = 0	// При незаполненных цене и сумме 
				ИЛИ МестныйКэш.Парам.ПересчитыватьЦеныПоДанным1С = 1)			// Пересчитывать всегда
			И Контекст.Переменные.Свойство("ФункцияРасчетаЦенПоДанным1С") Тогда
		
		ПараметрыРасчета.Вставить("ФункцияРасчетаЦенПоДанным1С", Контекст.Переменные.ФункцияРасчетаЦенПоДанным1С);
	КонецЕсли;
	
	Возврат сбисРассчитатьЦену_Общая(Контекст, ПараметрыРасчета);
	
КонецФункции

// Функция рассчитывает пред цену С НДС из суммы и количества
//
// Параметры:
//  Контекст	 - Структура контекст 
// 
// Возвращаемое значение:
//   - Запрашиваемая цена из первоначальной строки документа - Число / Неопределен
//
&НаКлиенте
Функция сбисРассчитатьПредЦену(Контекст) Экспорт
	Перем СуммаСНДС, СуммаНДС, СуммаБезНДС, Количество;
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	СтрТабл		= Контекст.СтрТабл;
	СтрокаФайла	= Контекст.СтрокаФайла.ПредСтрТабл;
	
	ПараметрыРасчета = Новый Структура;
	
	Если	Не ((СтрТабл.Свойство("СуммаНДСДоИзменения", СуммаНДС)
				ИЛИ СтрокаФайла.Свойство("СуммаНДС", СуммаНДС))
			И ЗначениеЗаполнено(СуммаНДС)) Тогда
			
		СуммаНДС = 0;
	КонецЕсли;
	ПараметрыРасчета.Вставить("СуммаНДС", ТипЧисло.ПривестиЗначение(СуммаНДС));
	
	Если	(СтрТабл.Свойство("СуммаСНДСДоИзменения", СуммаСНДС)
				ИЛИ СтрокаФайла.Свойство("СуммаСНДС", СуммаСНДС)
				ИЛИ СтрТабл.Свойство("СуммаДоИзменения", СуммаСНДС)
				ИЛИ СтрокаФайла.Свойство("Сумма", СуммаСНДС))
			И ЗначениеЗаполнено(СуммаСНДС) Тогда
			
		ПараметрыРасчета.Вставить("СуммаСНДС",		ТипЧисло.ПривестиЗначение(СуммаСНДС));
		ПараметрыРасчета.Вставить("СуммаБезНДС",	ТипЧисло.ПривестиЗначение(СуммаСНДС) - ПараметрыРасчета.СуммаНДС);
		
	ИначеЕсли	(СтрТабл.Свойство("СуммаБезНалДоИзменения", СуммаБезНДС)
					ИЛИ СтрокаФайла.Свойство("СуммаБезНал", СуммаБезНДС))
				И ЗначениеЗаполнено(СуммаБезНДС) Тогда
				
		ПараметрыРасчета.Вставить("СуммаСНДС",		ТипЧисло.ПривестиЗначение(СуммаБезНДС));
		ПараметрыРасчета.Вставить("СуммаБезНДС",	ТипЧисло.ПривестиЗначение(СуммаБезНДС));
	Иначе
		ПараметрыРасчета.Вставить("СуммаСНДС",		0);
		ПараметрыРасчета.Вставить("СуммаБезНДС",	0);
	КонецЕсли;

	Если	(СтрТабл.Свойство("КоличествоДоИзменения", Количество)
				ИЛИ СтрокаФайла.Свойство("Кол_во", Количество))
			И Количество <> Неопределено
			И ТипЧисло.ПривестиЗначение(Количество) <> 0 Тогда
			
		ПараметрыРасчета.Вставить("Количество", ТипЧисло.ПривестиЗначение(Количество));
	Иначе
		ПараметрыРасчета.Вставить("Количество", 1);
	КонецЕсли;
	
	// Пока что передаем "Истина" всегда. В будущем можем прокидывать из ИНИ.
	ПараметрыРасчета.Вставить("ЦенаВключаетНДС", Истина);
	
	Возврат сбисРассчитатьЦену_Общая(Контекст, ПараметрыРасчета);
	
КонецФункции

// Функция - Рассчитать цену
//
// Параметры:
//  Контекст	 - Структура контекст 
//  ДопПараметры - Структура - Структура со значениями (при наличии), тип число: СуммаСНДС, СуммаНДС, СуммаБезНДС, Количество
//						+ доп параметры (см. пример в сбисРассчитатьЦену и сбисРассчитатьПредЦену)
//								
// 
// Возвращаемое значение:
//   - Запрашиваемая цена - Число / Неопределен
//
&НаКлиенте
Функция сбисРассчитатьЦену_Общая(Контекст, ПараметрыРасчета)
	
	Попытка
		
		Если ПараметрыРасчета.Свойство("СуммаНДС") Тогда
			СуммаНДС = ПараметрыРасчета.СуммаНДС;
		Иначе
			СуммаНДС = 0;
		КонецЕсли;
		
		Если ПараметрыРасчета.Свойство("СуммаБезНДС") Тогда
			СуммаБезНДС = ПараметрыРасчета.СуммаБезНДС;
		Иначе
			СуммаБезНДС = 0;
		КонецЕсли;
		
		Если ПараметрыРасчета.Свойство("СуммаСНДС") Тогда
			СуммаСНДС = ПараметрыРасчета.СуммаСНДС;
		Иначе
			СуммаСНДС = СуммаБезНДС + СуммаНДС;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СуммаБезНДС) Тогда
			// На случай если наоборот, СуммаСНДС заполнена, а СуммаБезНДС нет
			СуммаБезНДС = СуммаСНДС - СуммаНДС;
		КонецЕсли;
		
		Если ПараметрыРасчета.Свойство("Количество") Тогда
			Количество = ПараметрыРасчета.Количество;
		Иначе
			Количество = 1;
		КонецЕсли;
		
		Если ПараметрыРасчета.Свойство("ФункцияРасчетаЦенПоДанным1С") Тогда
			Цена = ПолучитьЗначениеПоФункцииНаКлиентеНаСервереБезКонтекста(Контекст, ПараметрыРасчета.ФункцияРасчетаЦенПоДанным1С);
		ИначеЕсли	Не ПараметрыРасчета.Свойство("ЦенаВключаетНДС")
						Или ПараметрыРасчета.ЦенаВключаетНДС Тогда
			Цена = Окр(СуммаСНДС / Количество, 2);
		Иначе
			Цена = Окр(СуммаБезНДС / Количество, 2);
		КонецЕсли;
		
		Возврат Цена;
		
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

// Рассчитывает функцию на сервере без контекста, вычленяя параметры, которые формируются из контекста
// Учитывайте, что параметрами функции должен быть возможен обмен с сервером
&НаКлиенте
Функция ПолучитьЗначениеПоФункцииНаКлиентеНаСервереБезКонтекста(Контекст, ФункцияСПараметрамиСтрокой) Экспорт
	Попытка
		ФункцияСтрокой = "";
		ИмяФункцииЗаполнено = Ложь;
		МассивПараметровКонтекста = Новый Массив;
		ПараметрСтрокой = "";
		СчетчикПараметров = 0;
		ЭтоСтрокаПараметр = Ложь;
		
		Для i = 1 По СтрДлина(ФункцияСПараметрамиСтрокой) Цикл
			Символ = Сред(ФункцияСПараметрамиСтрокой, i, 1);
			Если НЕ ИмяФункцииЗаполнено Тогда
				ФункцияСтрокой = ФункцияСтрокой + Символ;
				Если Символ = "(" Тогда
					ИмяФункцииЗаполнено = Истина;
				КонецЕсли;
				Продолжить;
			КонецЕсли;
			Если Символ = """" ИЛИ ЭтоСтрокаПараметр Тогда
				Если НЕ ЭтоСтрокаПараметр Тогда
					ФункцияСтрокой = ФункцияСтрокой + ПараметрСтрокой;
					ПараметрСтрокой = "";
				КонецЕсли;
				Если НЕ ЭтоСтрокаПараметр ИЛИ Символ = """" Тогда
					ЭтоСтрокаПараметр = НЕ ЭтоСтрокаПараметр;
				КонецЕсли;
				ФункцияСтрокой = ФункцияСтрокой + Символ;
			ИначеЕсли Символ <> "," И Символ <> ")" Тогда
				ПараметрСтрокой = ПараметрСтрокой + Символ;
				Если Символ = "(" Тогда
					ФункцияСтрокой = ФункцияСтрокой + ПараметрСтрокой;
					ПараметрСтрокой = "";
				КонецЕсли;
			ИначеЕсли ПустаяСтрока(ПараметрСтрокой) Тогда 
				ФункцияСтрокой = ФункцияСтрокой + Символ;
			Иначе
				ФункцияСтрокой = ФункцияСтрокой + "МассивПараметровКонтекста[" + СчетчикПараметров + "]" + Символ;
				Попытка
					Параметр = Вычислить(СокрЛП(ПараметрСтрокой));
				Исключение
					МассивПараметр = РазбитьСтрокуВМассивНаКлиенте(СокрЛП(ПараметрСтрокой), ".");
					Для k = 0 По МассивПараметр.ВГраница() Цикл
						Если k = 0 Тогда
							Параметр = Контекст[МассивПараметр[k]];
						Иначе
							Параметр = Параметр[МассивПараметр[k]];
						КонецЕсли;
					КонецЦикла;	
				КонецПопытки;
				МассивПараметровКонтекста.Добавить(Параметр);
				СчетчикПараметров = СчетчикПараметров + 1;
				ПараметрСтрокой = "";
			КонецЕсли;
		КонецЦикла;
		
		Возврат ПолучитьЗначениеПоФункцииНаСервереБезКонтекста(ФункцияСтрокой, МассивПараметровКонтекста);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

// Возвращает рассчитанное значение функции по параметрам на сервере без контекста
// см. ПолучитьЗначениеПоФункцииНаКлиентеНаСервереБезКонтекста
&НаСервереБезКонтекста
Функция ПолучитьЗначениеПоФункцииНаСервереБезКонтекста(ФункцияСтрокой, МассивПараметровКонтекста)
	Попытка
		Возврат Вычислить(ФункцияСтрокой);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

// Функция рассчитывает сумму из цены и количества
&НаКлиенте
Функция сбисРассчитатьСумму(Контекст) Экспорт
	Попытка
		Строкафайла = Контекст.СтрокаФайла;
		СуммаСНДС = Число(?(СтрокаФайла.Свойство("СуммаСНДС"), СтрокаФайла.СуммаСНДС, 
							?(СтрокаФайла.Свойство("Сумма") И Число(СтрокаФайла.Сумма) <> 0, СтрокаФайла.Сумма, 
								?(СтрокаФайла.Свойство("СуммаБезНал") И Число(СтрокаФайла.СуммаБезНал) <> 0, СтрокаФайла.СуммаБезНал,
									0))));
		Если (МестныйКэш.Парам.ПересчитыватьЦеныПоДанным1С = 0 И СуммаСНДС = 0	// При незаполненных цене и сумме 
				ИЛИ МестныйКэш.Парам.ПересчитыватьЦеныПоДанным1С = 1)			// Пересчитывать всегда
				И Контекст.Переменные.Свойство("ФункцияРасчетаЦенПоДанным1С") Тогда
			СуммаСНДС = ?(НЕ Контекст.СтрТабл.Свойство("Количество") ИЛИ Контекст.СтрТабл.Количество = Неопределено ИЛИ Число(Контекст.СтрТабл.Количество) = 0, Окр(Число(Контекст.СтрТабл.Цена), 2),
							Окр(Число(Контекст.СтрТабл.Цена) * Число(Контекст.СтрТабл.Количество), 2));
		КонецЕсли;
		
		Возврат СуммаСНДС;
	Исключение
	КонецПопытки;
КонецФункции

// Функция - считает сумму с учетом НДС и признака СуммаВкючаетНДС на документе
//
// Параметры:
//  Контекст - Структура	 - контекст расчёта
//	Аргументы: 1 СуммаСНДС, 2 СуммаБезНДС, 3 СуммаНДС, 4 СуммаВключаетНДС
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Функция СбисРассчитатьСуммуСУчетомНДС(Контекст) Экспорт
	Перем Результат, СуммаВключаетНДС;
	
	МодульРассчитать		= МодульОбъектаКлиент().ПолучитьФормуОбработки("Документ_Шаблон");
	АргументыРассчёта		= Контекст.АргументыВходящие;
		
	СуммаСНДС			= Контекст.АргументыВходящие.Параметр1;
	СуммаБезНДС			= Контекст.АргументыВходящие.Параметр2;
	СуммаНДС			= Контекст.АргументыВходящие.Параметр3;
	
	Если Не Контекст.АргументыВходящие.Свойство("Параметр4", СуммаВключаетНДС) Тогда
		
		СуммаВключаетНДСПоДок	= МодульРассчитать.РассчитатьЗначение("Документ_СуммаВключаетНДС",	Контекст);
		
		Если Не СуммаВключаетНДСПоДок = Неопределено Тогда
			
			СуммаВключаетНДС = СуммаВключаетНДСПоДок = Истина;
			
		ИначеЕсли Контекст.Переменные.Свойство("СуммаВключаетНДС") Тогда
			
			// Считаем, что в переменных обязательно есть параметры НДС
			СуммаВключаетНДС = Контекст.Переменные.СуммаВключаетНДС;
			
		Иначе
			
			СуммаВключаетНДС = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОписаниеЧисло		= Новый ОписаниеТипов("Число");
	СуммаСНДСЧисло		= ОписаниеЧисло.ПривестиЗначение(СуммаСНДС);
	СуммаБезНДСЧисло	= ОписаниеЧисло.ПривестиЗначение(СуммаБезНДС);
	СуммаНДСЧисло		= ОписаниеЧисло.ПривестиЗначение(СуммаНДС);
	 
	Если СуммаВключаетНДС Тогда
		
		Если СуммаСНДС = Неопределено Тогда
			
			Результат = СуммаБезНДСЧисло + СуммаНДСЧисло;
			
		Иначе
			
			Результат = СуммаСНДСЧисло;
			
		КонецЕсли;
		
	Иначе
		
		Если СуммаБезНДС = Неопределено Тогда
			
			Результат = СуммаСНДСЧисло - СуммаНДСЧисло;
			
		Иначе
			
			Результат = СуммаБезНДСЧисло;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция рассчитывает сумму без НДС из цены и количества
&НаКлиенте
Функция сбисРассчитатьСуммуБезНДС(Контекст) Экспорт
	Попытка
		Строкафайла = Контекст.СтрокаФайла;
		СуммаБезНДС = Число(?(СтрокаФайла.Свойство("СуммаБезНал") И ЗначениеЗаполнено(СтрокаФайла.СуммаБезНал) И Число(СтрокаФайла.СуммаБезНал) <> 0, СтрокаФайла.СуммаБезНал, 
								?(СтрокаФайла.Свойство("Сумма") И ЗначениеЗаполнено(СтрокаФайла.Сумма) И Число(СтрокаФайла.Сумма) <> 0, СтрокаФайла.Сумма, 
									СтрокаФайла.СуммаСНДС)));
		Если (МестныйКэш.Парам.ПересчитыватьЦеныПоДанным1С = 0 И СуммаБезНДС = 0	// При незаполненных цене и сумме 
				ИЛИ МестныйКэш.Парам.ПересчитыватьЦеныПоДанным1С = 1)			// Пересчитывать всегда
				И Контекст.Переменные.Свойство("ФункцияРасчетаЦенПоДанным1С") Тогда
			СуммаБезНДС = ?(НЕ Контекст.СтрТабл.Свойство("Количество") ИЛИ Контекст.СтрТабл.Количество = Неопределено ИЛИ Число(Контекст.СтрТабл.Количество) = 0, Окр(Число(Контекст.СтрТабл.Цена), 2), Окр(Число(Контекст.СтрТабл.Цена) * Число(Контекст.СтрТабл.Количество), 2));
		КонецЕсли;
		
		Возврат СуммаБезНДС;
	Исключение
	КонецПопытки;
КонецФункции

&НаКлиенте
Функция сбисПересчитыватьЦеныПоДанным1С(Контекст) Экспорт
	Попытка
		Возврат ?(МестныйКэш.Парам.Свойство("ПересчитыватьЦеныПоДанным1С"),МестныйКэш.Парам.ПересчитыватьЦеныПоДанным1С,0);
	Исключение
	КонецПопытки;
КонецФункции

&НаКлиенте
Функция сбисПересчитыватьНДСПоДанным1С(Контекст) Экспорт
	Попытка
		Возврат ?(МестныйКэш.Парам.Свойство("ПересчитыватьНДСПоДанным1С"),МестныйКэш.Парам.ПересчитыватьНДСПоДанным1С,0);
	Исключение
	КонецПопытки;
КонецФункции

&НаКлиенте
Функция сбисРассчитатьКоличество(Контекст) Экспорт
	Попытка
		Количество = Число(Контекст.СтрокаФайла.Кол_во); 
		Если Контекст.СтрокаФайла.Свойство("Коэффициент") и ЗначениеЗаполнено(Контекст.СтрокаФайла.Коэффициент) и Контекст.СтрокаФайла.Коэффициент <> "0" Тогда
			Если Найти(Контекст.СтрокаФайла.Коэффициент, "-") Тогда
				Коэф = Число(Сред(Контекст.СтрокаФайла.Коэффициент, 2, СтрДлина(Контекст.СтрокаФайла.Коэффициент)));
				Если не Коэф = 0 Тогда 
					Количество = Количество/Коэф;   
				КонецЕсли;	
			Иначе
				Коэф = Число(Контекст.СтрокаФайла.Коэффициент);
				Количество = Количество*Коэф;
			КонецЕсли					
		КонецЕсли;
		Возврат Формат(Количество, "ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.000");
	Исключение
	КонецПопытки;
КонецФункции

&НаКлиенте
Функция сбисРассчитатьЦенуИзАктаПриемки(Контекст) Экспорт
	Цена = 0;
	Попытка
		Если Контекст.СтрокаФайла.ПоФакту.Свойство("Цена") Тогда
			Если ЗначениеЗаполнено(Контекст.СтрокаФайла.ПоФакту.Цена) и Число(Контекст.СтрокаФайла.ПоФакту.Цена) <> 0 Тогда
				Цена = Число(Контекст.СтрокаФайла.ПоФакту.Цена);
			КонецЕсли;
		ИначеЕсли Контекст.СтрокаФайла.ПоФакту.Свойство("Сумма") Тогда
			Если ЗначениеЗаполнено(Контекст.СтрокаФайла.ПоФакту.Сумма) и Число(Контекст.СтрокаФайла.ПоФакту.Сумма) <> 0 Тогда
				Цена = Число(Контекст.СтрокаФайла.ПоФакту.Сумма) / ?(Контекст.СтрокаФайла.ПоФакту.Кол_во = Неопределено ИЛИ Число(Контекст.СтрокаФайла.ПоФакту.Кол_во) = 0, 1, Число(Контекст.СтрокаФайла.ПоФакту.Кол_во));
			КонецЕсли;
		КонецЕсли;
		Если (МестныйКэш.Парам.ПересчитыватьЦеныПоДанным1С = 0 И Число(Контекст.СтрокаФайла.ПоФакту.Сумма) = 0	// При незаполненных цене и сумме 
				ИЛИ МестныйКэш.Парам.ПересчитыватьЦеныПоДанным1С = 1)			// Пересчитывать всегда
				И Контекст.Переменные.Свойство("ФункцияРасчетаЦенПоДанным1С") Тогда
			Цена = ПолучитьЗначениеПоФункцииНаКлиентеНаСервереБезКонтекста(Контекст, Контекст.Переменные.ФункцияРасчетаЦенПоДанным1С);
		КонецЕсли;
	Исключение
	КонецПопытки;
	Возврат Цена;
КонецФункции

&НаКлиенте
Функция сбисРассчитатьСуммуИзАктаПриемки(Контекст) Экспорт
	Сумма = 0;
	Попытка
		Сумма = Контекст.СтрокаФайла.ПоФакту.Сумма;
		
		Если (МестныйКэш.Парам.ПересчитыватьЦеныПоДанным1С = 0 И Число(Контекст.СтрокаФайла.ПоФакту.Сумма) = 0	// При незаполненных цене и сумме 
				ИЛИ МестныйКэш.Парам.ПересчитыватьЦеныПоДанным1С = 1)			// Пересчитывать всегда
				И Контекст.Переменные.Свойство("ФункцияРасчетаЦенПоДанным1С") Тогда
			Сумма = ?(НЕ Контекст.СтрТабл.Свойство("Количество") ИЛИ Контекст.СтрТабл.Количество = Неопределено ИЛИ Число(Контекст.СтрТабл.Количество) = 0, Окр(Число(Контекст.СтрТабл.Цена), 2), Окр(Число(Контекст.СтрТабл.Цена) * Число(Контекст.СтрТабл.Количество), 2));
		КонецЕсли;
	Исключение
	КонецПопытки;
	Возврат Сумма;
КонецФункции

&НаКлиенте
Функция сбисРассчитатьЦенуБезНДСИзАктаПриемки(Контекст) Экспорт
	ЦенаБезНДС = 0;
	Попытка
		Если Контекст.СтрокаФайла.ПоФакту.Свойство("ЦенаБезНДС") Тогда
			Если ЗначениеЗаполнено(Контекст.СтрокаФайла.ПоФакту.ЦенаБезНДС) и Число(Контекст.СтрокаФайла.ПоФакту.ЦенаБезНДС) <> 0 Тогда
				ЦенаБезНДС = Число(Контекст.СтрокаФайла.ПоФакту.ЦенаБезНДС);
			КонецЕсли;
		ИначеЕсли Контекст.СтрокаФайла.ПоФакту.Свойство("СуммаБезНал") Тогда
			Если ЗначениеЗаполнено(Контекст.СтрокаФайла.ПоФакту.СуммаБезНал) и Число(Контекст.СтрокаФайла.ПоФакту.СуммаБезНал) <> 0 Тогда
				ЦенаБезНДС = Число(Контекст.СтрокаФайла.ПоФакту.СуммаБезНал) / ?(Контекст.СтрокаФайла.ПоФакту.Кол_во = Неопределено ИЛИ Число(Контекст.СтрокаФайла.ПоФакту.Кол_во) = 0, 1, Число(Контекст.СтрокаФайла.ПоФакту.Кол_во));
			КонецЕсли;
		КонецЕсли;
		Если (МестныйКэш.Парам.ПересчитыватьЦеныПоДанным1С = 0 И Число(Контекст.СтрокаФайла.ПоФакту.СуммаБезНал) = 0	// При незаполненных цене и сумме 
				ИЛИ МестныйКэш.Парам.ПересчитыватьЦеныПоДанным1С = 1)			// Пересчитывать всегда
				И Контекст.Переменные.Свойство("ФункцияРасчетаЦенПоДанным1С") Тогда
			ЦенаБезНДС = ПолучитьЗначениеПоФункцииНаКлиентеНаСервереБезКонтекста(Контекст, Контекст.Переменные.ФункцияРасчетаЦенПоДанным1С);
		КонецЕсли;
	Исключение
	КонецПопытки;
	Возврат ЦенаБезНДС;
КонецФункции

&НаКлиенте
Функция сбисРассчитатьСуммуБезНДСИзАктаПриемки(Контекст) Экспорт
	СуммаБезНал = 0;
	Попытка
		СуммаБезНал = Контекст.СтрокаФайла.ПоФакту.СуммаБезНал;
		
		Если (МестныйКэш.Парам.ПересчитыватьЦеныПоДанным1С = 0 И Число(Контекст.СтрокаФайла.ПоФакту.СуммаБезНал) = 0	// При незаполненных цене и сумме 
				ИЛИ МестныйКэш.Парам.ПересчитыватьЦеныПоДанным1С = 1)			// Пересчитывать всегда
				И Контекст.Переменные.Свойство("ФункцияРасчетаЦенПоДанным1С") Тогда
			СуммаБезНал = ?(НЕ Контекст.СтрТабл.Свойство("Количество") ИЛИ Контекст.СтрТабл.Количество = Неопределено ИЛИ Число(Контекст.СтрТабл.Количество) = 0, Окр(Число(Контекст.СтрТабл.ЦенаБезНДС), 2), Окр(Число(Контекст.СтрТабл.ЦенаБезНДС) * Число(Контекст.СтрТабл.Количество), 2));
		КонецЕсли;
	Исключение
	КонецПопытки;
	Возврат СуммаБезНал;
КонецФункции

// Функция получает данные Платежно-расчетных документов для УТ подобных конфигураций
// в виде готового массива структур (Основание_Название, Основание_Номер, Основание_Дата) 
&НаКлиенте
Функция сбисДанныеПРД_УТ11(Контекст) Экспорт
	
	Результат = Новый Массив;
	
	ДатыНомераПРД = ПолучитьНомераИДатыПРДИзТЧСчФ(Контекст.Документ);
	
	Если Не ЗначениеЗаполнено(ДатыНомераПРД) Тогда

		мТиповДокументовОплаты = Новый Массив;
		мТиповДокументовОплаты.Добавить(Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств"));
		мТиповДокументовОплаты.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
		мТиповДокументовОплаты.Добавить(Тип("ДокументСсылка.ПервичныйДокумент"));
		мТиповДокументовОплаты.Добавить(Тип("ДокументСсылка.ОперацияПоПлатежнойКарте"));
		мТиповДокументовОплаты.Добавить(Тип("ДокументСсылка.ВзаимозачетЗадолженности"));
		
		ПараметрыПолученияПРД = Новый Структура;
		ПараметрыПолученияПРД.Вставить("ТолькоАвансы",						Истина);
		ПараметрыПолученияПРД.Вставить("мТиповДокументовОплаты",			мТиповДокументовОплаты);
		ПараметрыПолученияПРД.Вставить("ДокументОснование",					Контекст.ДокОснование);
		
		ПлатежныеДокументы = ПолучитьПлатежноРасчетныеДокументыУТ11(ПараметрыПолученияПРД);
		
		Если Не ЗначениеЗаполнено(ПлатежныеДокументы) Тогда
			Возврат Результат;
		КонецЕсли;
		
		ПараметрыПолученияПРД = Новый Структура;
		ПараметрыПолученияПРД.Вставить("ПлатежныеДокументы",	ПлатежныеДокументы);
		ПараметрыПолученияПРД.Вставить("ДокументОснование",		Контекст.ДокОснование);
		
		ДатыНомераПРД = ПолучитьНомераИДатыПлатежноРасчетныхДокументов(ПараметрыПолученияПРД);
		
	КонецЕсли;
	
	Для Каждого ДатаНомерПРД Из ДатыНомераПРД Цикл
		стрОснование = Новый Структура("Основание_Название, Основание_Номер, Основание_Дата", "ПРД");
		стрОснование.Основание_Номер	= ДатаНомерПРД.Номер;
		стрОснование.Основание_Дата		= Формат(ДатаНомерПРД.Дата, "ДФ=dd.MM.yyyy");
		Результат.Добавить(стрОснование);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает массив структур (Номер, Дата) номеров и дат платежно-расчетных документов непосредственно из ТЧ ПлатежноРасчетныеДокументы Счета-фактуры
&НаСервереБезКонтекста
Функция ПолучитьНомераИДатыПРДИзТЧСчФ(СчетФактураСсылка)
	
	Результат = Новый Массив;
	
	РеквизитыТЧПлатежныхДокументов = Метаданные.Документы.СчетФактураВыданный.ТабличныеЧасти.ПлатежноРасчетныеДокументы.Реквизиты;
	
	Если РеквизитыТЧПлатежныхДокументов.Найти("ДатаДокумента") <> Неопределено Тогда
		РеквизитДата	= "ДатаДокумента";
		РеквизитНомер	= "НомерДокумента";
	Иначе
		РеквизитДата	= "ДатаПлатежноРасчетногоДокумента";
		РеквизитНомер	= "НомерПлатежноРасчетногоДокумента";
	КонецЕсли;
	
	Для Каждого ДатаНомерПРД Из СчетФактураСсылка.ПлатежноРасчетныеДокументы Цикл
		Результат.Добавить(Новый Структура("Дата, Номер", ДатаНомерПРД[РеквизитДата], ДатаНомерПРД[РеквизитНомер]));
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

// Функция возвращает упорядоченный массив номеров и дат платежно-расчетных документов по параметрам
//
// Параметры:
//  ПараметрыЗапроса - Структура - 
//			- ПлатежныеДокументы - Массив структур: ДокументОплаты - ссылка платежный документ, ОснованиеОплаты - док, который оплачиваем
//			- ДокументОснование - Ссылка на док. основания оплаты - обычно, реализация
// 
// Возвращаемое значение:
//   - Массив структур: Дата, Номер
//
&НаСервереБезКонтекста
Функция ПолучитьНомераИДатыПлатежноРасчетныхДокументов(ПараметрыЗапроса)
	
	Результат = Новый Массив;
	
	мТипыДокументовОплаты	= Новый Массив;
	мТипыОснованийОплаты	= Новый Массив;
	Для Каждого ПлатежныйДокумент Из ПараметрыЗапроса.ПлатежныеДокументы Цикл
		Если мТипыДокументовОплаты.Найти(ТипЗнч(ПлатежныйДокумент.ДокументОплаты)) = Неопределено Тогда
			мТипыДокументовОплаты.Добавить(ТипЗнч(ПлатежныйДокумент.ДокументОплаты));
		КонецЕсли;
		Если мТипыОснованийОплаты.Найти(ТипЗнч(ПлатежныйДокумент.ОснованиеОплаты)) = Неопределено Тогда
			мТипыОснованийОплаты.Добавить(ТипЗнч(ПлатежныйДокумент.ОснованиеОплаты));
		КонецЕсли;
	КонецЦикла;
	
	ПлатежныеДокументы = Новый ТаблицаЗначений;
	ПлатежныеДокументы.Колонки.Добавить("ДокументОплаты",				Новый ОписаниеТипов(мТипыДокументовОплаты));
	ПлатежныеДокументы.Колонки.Добавить("ОснованиеОплаты",				Новый ОписаниеТипов(мТипыОснованийОплаты));
	Для Каждого ПлатежныйДокумент Из ПараметрыЗапроса.ПлатежныеДокументы Цикл
		НСтрПлатежныхДокументов = ПлатежныеДокументы.Добавить();
		НСтрПлатежныхДокументов.ДокументОплаты	= ПлатежныйДокумент.ДокументОплаты;
		НСтрПлатежныхДокументов.ОснованиеОплаты	= ПлатежныйДокумент.ОснованиеОплаты;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлатежныеДокументы.ДокументОплаты КАК ДокументОплаты,
		|	ПлатежныеДокументы.ОснованиеОплаты КАК ОснованиеОплаты
		|ПОМЕСТИТЬ ВТ_ПлатежныеДокументы
		|ИЗ
		|	&ПлатежныеДокументы КАК ПлатежныеДокументы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеПервичныхДокументов.Дата КАК ДатаПРД,
		|	ДанныеПервичныхДокументов.Номер КАК НомерПРД
		|ПОМЕСТИТЬ НомераДатыПРД
		|ИЗ
		|	ВТ_ПлатежныеДокументы КАК ПлатежныеДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
		|		ПО ПлатежныеДокументы.ДокументОплаты = ДанныеПервичныхДокументов.Документ
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ПлатежныеДокументы.ДокументОплаты) <> ТИП(Документ.ВзаимозачетЗадолженности)
		|	И ПлатежныеДокументы.ОснованиеОплаты = &ДокументОснование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеПервичныхДокументов.Дата,
		|	ДанныеПервичныхДокументов.Номер
		|ИЗ
		|	ВТ_ПлатежныеДокументы КАК ПлатежныеДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
		|		ПО ПлатежныеДокументы.ДокументОплаты = ДанныеПервичныхДокументов.Документ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВзаимозачетЗадолженности КАК ВзаимозачетЗадолженности
		|		ПО ПлатежныеДокументы.ДокументОплаты = ВзаимозачетЗадолженности.Ссылка
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ПлатежныеДокументы.ДокументОплаты) = ТИП(Документ.ВзаимозачетЗадолженности)
		|	И ПлатежныеДокументы.ОснованиеОплаты = &ДокументОснование
		|	И ВзаимозачетЗадолженности.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ОтражениеОплатыЧерезКомиссионера)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НомераДатыПРД.ДатаПРД КАК Дата,
		|	НомераДатыПРД.НомерПРД КАК Номер
		|ИЗ
		|	НомераДатыПРД КАК НомераДатыПРД
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	Номер";
	
	Запрос.УстановитьПараметр("ПлатежныеДокументы",	ПлатежныеДокументы);
	Запрос.УстановитьПараметр("ДокументОснование",	ПараметрыЗапроса.ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Новый Структура("Дата, Номер", Выборка.Дата, Выборка.Номер));
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

// Функция получает массив платежно расчетных документов для УТ подобных конфигугаций
//
// Параметры:
//  ПараметрыЗапроса - Структура - все параметры необязательные. Стандартные значения см. в начале функции.
//						- ДатаОкончания - Дата - дата, до которой искать док. оплаты
//						- ТолькоАвансы - Булево - признак поиска только авансовых платежей
//						- мОрганизаций - Массив - ограничение по организациям
//						- мТиповДокументовОплаты - Массив - органичения по типам входящих документов оплаты
// 
// Возвращаемое значение:
//   - Массив структур - ДокументОплаты, ОснованиеОплаты
//
&НаСервереБезКонтекста
Функция ПолучитьПлатежноРасчетныеДокументыУТ11(ПараметрыЗапроса) Экспорт
	
	Результат = Новый Массив;
	
	ДатаОкончания					= Дата(3000, 1, 1);
	НоваяАрхитектураВзаиморасчетов	= ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов");
	ТолькоАвансы					= Ложь;
	мОрганизаций					= Новый Массив;
	мТиповДокументовОплаты			= Новый Массив;
	
	Если ПараметрыЗапроса.Свойство("ДатаОкончания") Тогда
		ДатаОкончания = ПараметрыЗапроса.ДатаОкончания;
	КонецЕсли;
	Если ПараметрыЗапроса.Свойство("ТолькоАвансы") Тогда
		ТолькоАвансы = ПараметрыЗапроса.ТолькоАвансы;
	КонецЕсли;
	Если ПараметрыЗапроса.Свойство("мОрганизаций") Тогда
		мОрганизаций = ПараметрыЗапроса.мОрганизаций;
	КонецЕсли;
	Если ПараметрыЗапроса.Свойство("мТиповДокументовОплаты") Тогда
		мТиповДокументовОплаты = ПараметрыЗапроса.мТиповДокументовОплаты;
	КонецЕсли;
	
	мТипыОснований = Новый Массив;
	мТипыОснований.Добавить(ТипЗнч(ПараметрыЗапроса.ДокументОснование));
	
	ТаблицаДокументов = Новый ТаблицаЗначений;
	ТаблицаДокументов.Колонки.Добавить("ДокументОснование", Новый ОписаниеТипов(мТипыОснований));
	НСтрокаДокумента = ТаблицаДокументов.Добавить();
	НСтрокаДокумента.ДокументОснование = ПараметрыЗапроса.ДокументОснование;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДокументов.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ТаблицаДокументов
		|ИЗ
		|	&ТаблицаДокументов КАК ТаблицаДокументов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаДокументов.ДокументОснование КАК ДокументОтбора,
		|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов
		|ПОМЕСТИТЬ ТаблицаОтбораОснованийИДокументовОплаты
		|ИЗ
		|	ТаблицаДокументов КАК ТаблицаДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
		|		ПО ТаблицаДокументов.ДокументОснование = ОбъектыРасчетов.Объект
		|			И (НЕ ОбъектыРасчетов.ПометкаУдаления)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументОтбора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Расчеты.ДокументОплаты КАК ДокументОплаты,
		|	Расчеты.ОснованиеОплаты КАК ОснованиеОплаты
		|ПОМЕСТИТЬ ОснованияИДокументыОплаты
		|ИЗ
		|	(ВЫБРАТЬ
		|		Расчеты.РасчетныйДокумент КАК ДокументОплаты,
		|		Расчеты.ДокументРегистратор КАК ОснованиеОплаты
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОтбораОснованийИДокументовОплаты КАК ТаблицаОтбораОснованийИДокументовОплаты
		|			ПО Расчеты.ДокументРегистратор = ТаблицаОтбораОснованийИДокументовОплаты.ДокументОтбора
		|	ГДЕ
		|		Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И Расчеты.Период <= &ДатаОкончания
		|		И Расчеты.Предоплата <> 0
		|		И &НоваяАрхитектураВзаиморасчетов
		|		И Расчеты.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РезервированиеАвансаКлиента))
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Расчеты.ДокументРегистратор,
		|		ТаблицаОтбораОснованийИДокументовОплаты.ДокументОтбора
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОтбораОснованийИДокументовОплаты КАК ТаблицаОтбораОснованийИДокументовОплаты
		|			ПО Расчеты.ОбъектРасчетов = ТаблицаОтбораОснованийИДокументовОплаты.ОбъектРасчетов
		|	ГДЕ
		|		Расчеты.РасчетныйДокумент <> Расчеты.ДокументРегистратор
		|		И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И Расчеты.Период <= &ДатаОкончания
		|		И Расчеты.Долг <> 0
		|		И &НоваяАрхитектураВзаиморасчетов
		|		И НЕ &ТолькоАвансы
		|		И Расчеты.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Расчеты.ДокументРегистратор,
		|		Расчеты.РасчетныйДокумент
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОтбораОснованийИДокументовОплаты КАК ТаблицаОтбораОснованийИДокументовОплаты
		|			ПО Расчеты.РасчетныйДокумент = ТаблицаОтбораОснованийИДокументовОплаты.ДокументОтбора
		|	ГДЕ
		|		Расчеты.РасчетныйДокумент <> Расчеты.ОбъектРасчетов.Объект
		|		И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И Расчеты.Период <= &ДатаОкончания
		|		И Расчеты.Долг <> 0
		|		И &НоваяАрхитектураВзаиморасчетов
		|		И НЕ &ТолькоАвансы
		|		И Расчеты.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Расчеты.РасчетныйДокумент,
		|		Расчеты.Регистратор
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК Расчеты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОтбораОснованийИДокументовОплаты КАК ТаблицаОтбораОснованийИДокументовОплаты
		|			ПО Расчеты.Регистратор = ТаблицаОтбораОснованийИДокументовОплаты.ДокументОтбора
		|	ГДЕ
		|		Расчеты.Регистратор <> Расчеты.ЗаказКлиента.Объект
		|		И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		И Расчеты.Период <= &ДатаОкончания
		|		И Расчеты.Предоплата <> 0
		|		И НЕ &НоваяАрхитектураВзаиморасчетов
		|		И Расчеты.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Расчеты.Регистратор,
		|		ТаблицаОтбораОснованийИДокументовОплаты.ДокументОтбора
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК Расчеты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОтбораОснованийИДокументовОплаты КАК ТаблицаОтбораОснованийИДокументовОплаты
		|			ПО Расчеты.ЗаказКлиента = ТаблицаОтбораОснованийИДокументовОплаты.ОбъектРасчетов
		|	ГДЕ
		|		Расчеты.Регистратор = Расчеты.РасчетныйДокумент
		|		И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И Расчеты.Период <= &ДатаОкончания
		|		И Расчеты.Предоплата <> 0
		|		И НЕ &НоваяАрхитектураВзаиморасчетов
		|		И Расчеты.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Расчеты.Регистратор,
		|		ТаблицаОтбораОснованийИДокументовОплаты.ДокументОтбора
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК Расчеты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОтбораОснованийИДокументовОплаты КАК ТаблицаОтбораОснованийИДокументовОплаты
		|			ПО Расчеты.ЗаказКлиента = ТаблицаОтбораОснованийИДокументовОплаты.ОбъектРасчетов
		|	ГДЕ
		|		Расчеты.РасчетныйДокумент <> Расчеты.Регистратор
		|		И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		И Расчеты.Период <= &ДатаОкончания
		|		И Расчеты.Долг <> 0
		|		И НЕ &НоваяАрхитектураВзаиморасчетов
		|		И НЕ &ТолькоАвансы
		|		И Расчеты.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Расчеты.Регистратор,
		|		Расчеты.РасчетныйДокумент
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК Расчеты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОтбораОснованийИДокументовОплаты КАК ТаблицаОтбораОснованийИДокументовОплаты
		|			ПО Расчеты.РасчетныйДокумент = ТаблицаОтбораОснованийИДокументовОплаты.ДокументОтбора
		|	ГДЕ
		|		Расчеты.РасчетныйДокумент <> Расчеты.ЗаказКлиента.Объект
		|		И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И Расчеты.Период <= &ДатаОкончания
		|		И Расчеты.Долг <> 0
		|		И НЕ &НоваяАрхитектураВзаиморасчетов
		|		И НЕ &ТолькоАвансы
		|		И Расчеты.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности)) КАК Расчеты
		|ГДЕ
		|	(НЕ &ОграничитьТипыДокументовОплаты
		|			ИЛИ ТИПЗНАЧЕНИЯ(Расчеты.ДокументОплаты) В (&мТиповДокументовОплаты))
		|
		|СГРУППИРОВАТЬ ПО
		|	Расчеты.ДокументОплаты,
		|	Расчеты.ОснованиеОплаты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументОплаты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОснованияИДокументыОплаты.ДокументОплаты КАК ДокументОплаты,
		|	ОснованияИДокументыОплаты.ОснованиеОплаты КАК ОснованиеОплаты
		|ИЗ
		|	ОснованияИДокументыОплаты КАК ОснованияИДокументыОплаты";
	
	Запрос.УстановитьПараметр("ВключитьОтборПоОрганизациям", ЗначениеЗаполнено(мОрганизаций));
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("мТиповДокументовОплаты", мТиповДокументовОплаты);
	Запрос.УстановитьПараметр("НоваяАрхитектураВзаиморасчетов", НоваяАрхитектураВзаиморасчетов);
	Запрос.УстановитьПараметр("ОграничитьТипыДокументовОплаты", ЗначениеЗаполнено(мТиповДокументовОплаты));
	Запрос.УстановитьПараметр("Организации", мОрганизаций);
	Запрос.УстановитьПараметр("ТолькоАвансы", ТолькоАвансы);
	Запрос.УстановитьПараметр("ТаблицаДокументов", ТаблицаДокументов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Новый Структура("ДокументОплаты, ОснованиеОплаты", Выборка.ДокументОплаты, Выборка.ОснованиеОплаты));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

