
////////////////////////////////////////////////////
///////////////Загрузка номенклатуры////////////////
////////////////////////////////////////////////////

//Функция вынесена из СоздатьПерезаполнитьДокументы. Сопоставляет, либо загружает не сопоставленную номенклатуру в зависимости от выбранного режима:
//	Режим 0 Документ не загружается, если нет сопоставления.
//	Режим 1 Для несопоставленных позиций создавать карточки номенклатуры и контрагента.
//	Режим 2 В табличную часть загружать только сопоставленную номенклатуру.
//	режим 3 Для несопоставленной номенклатуры в табличной части не заполнять поле Номенклатура.
//Как результат идёт структура с описанием выполненного действия с номенклатурой. 
&НаКлиенте
Функция ЗаполнитьСопоставитьНоменклатуру(Кэш, СтрТабл, ПараметрыЗаполнения, Отказ) Экспорт
	Перем СоздаватьНоменклатуру;
	
	СтрТаблНазвание = ?(СтрТабл.Свойство("Название"), СтрТабл.Название, "");
	Результат = Новый Структура("Название, Номенклатура, Новый, НеЗагружать", СтрТаблНазвание, Неопределено, Ложь, Ложь);
	
	НашаНоменклатура	= ПараметрыЗаполнения.НашаНоменклатура;
	СтруктураИниФайла	= ПараметрыЗаполнения.Вложение.СтруктураИниФайла;
	СтруктураФайла		= ПараметрыЗаполнения.Вложение.СтруктураФайла;
	
	ПараметрыВложения = МодульОбъектаКлиент().ВложениеСБИС_Получить(ПараметрыЗаполнения.Вложение, "Параметры");
	ПараметрыНоменклатуры = МодульОбъектаКлиент().ВложениеСБИС_Получить(ПараметрыЗаполнения.Вложение, "ПараметрыНоменклатуры");
	Если ПараметрыВложения = Неопределено Тогда 
		СоздаватьНоменклатуру = Истина;
	Иначе
		ПараметрыВложения.Свойство("СоздаватьНоменклатуру", СоздаватьНоменклатуру);
	КонецЕсли;
	
	//1189546150
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("СтруктураИниФайла",СтруктураИниФайла);
	
	Если Не ЗначениеЗаполнено(СтрТаблНазвание) И ПараметрыЗаполнения.РежимНоменклатуры <> 0 Тогда // Если отсутствует атрибут Название, 
		КодРежимаНоменклатуры = 3;                                                                 // то номенклатуру не добавляем, а в табличной части оставляем номенклатуру пустой
	Иначе
		КодРежимаНоменклатуры = ПараметрыЗаполнения.РежимНоменклатуры;
	КонецЕсли;
	
	Если НЕ СоздаватьНоменклатуру И КодРежимаНоменклатуры = 1 Тогда
		КодРежимаНоменклатуры = 0;
	КонецЕсли;
	
	СтрКонтрагента		= ПараметрыЗаполнения.СтрКонтрагента;
	ПараметрыРезультат	= ПараметрыЗаполнения.ПараметрыРезультат;
	
	Если	Не СтрТабл.Свойство("Номенклатура", Результат.Номенклатура)
		Или	Не ЗначениеЗаполнено(Результат.Номенклатура) Тогда
		ДанныеНоменклатуры = Неопределено;
		Если ЗначениеЗаполнено(НашаНоменклатура) И СтрТабл.Свойство(НашаНоменклатура) Тогда
			ДанныеНоменклатуры = Кэш.ГлавноеОкно.сбисПолучитьФорму("Документ_Шаблон").РассчитатьЗначение(СтруктураИниФайла.НашаНоменклатура.Вычислить,Новый Структура("Ини, Документ, СтрТабл, Переменные, СтруктураФайла, СтрокаФайла", СтруктураИниФайла, , , , СтруктураФайла, СтрТабл),Кэш);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ДанныеНоменклатуры) Тогда
			Если ПараметрыЗаполнения.ДанныеНоменклатуры = Неопределено Тогда
				Попытка
					НоменклатураКонтрагентаИнфо = Новый Структура;
					Для Каждого Узел Из СтрТабл Цикл
						НоменклатураКонтрагентаИнфо.Вставить(Узел.Ключ, Узел.Значение);
					КонецЦикла;
					ДанныеНоменклатуры = ПараметрыЗаполнения.фрмНоменклатуры.НайтиНоменклатуруПоставщика(СтрКонтрагента, НоменклатураКонтрагентаИнфо, Кэш.Парам.КаталогНастроек, Кэш.Ини);
				Исключение
				КонецПопытки;
			Иначе//Берем предварительно найденное значение, если не удалось рассчитать. 
				ДанныеНоменклатуры = ПараметрыЗаполнения.ДанныеНоменклатуры;
			КонецЕсли;	
		КонецЕсли;	
		Если ЗначениеЗаполнено(ДанныеНоменклатуры) Тогда
			Результат.Номенклатура = ДанныеНоменклатуры.Номенклатура;
			ПараметрыРасшифровки = Новый Структура("Название, Ссылка, Тип, Состояние, Сообщение", СтрТаблНазвание, Результат.Номенклатура, Кэш.Ини.Конфигурация.НоменклатураПоставщиков.Значение, "Найден.", "Для позиции " + СтрТаблНазвание + " найдена подходящая номенклатура.");
			РезультатДействия_ДобавитьВРасшифровку(Кэш, "ЗагрузкаСправочника", ПараметрыЗаполнения.СтрокаДетализации, ПараметрыРасшифровки);
		Иначе
			Результат.Номенклатура = Неопределено;
		КонецЕсли;
		Если КодРежимаНоменклатуры = 2 И Результат.Номенклатура=Неопределено Тогда 
			Результат.Вставить("НеЗагружать", Истина);
		Иначе                                         
			Если ЗначениеЗаполнено(ДанныеНоменклатуры) и ЗначениеЗаполнено(ДанныеНоменклатуры.Характеристика) Тогда
				Результат.Вставить("ХарактеристикаНоменклатуры", ДанныеНоменклатуры.Характеристика);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Если Результат.Номенклатура = Неопределено Тогда
		Если КодРежимаНоменклатуры = 1 Тогда
			НоменклатураНов = ПараметрыЗаполнения.фрмСозданияНоменклатуры.СоздатьНоменклатуруПоДаннымПоставщика(Кэш,СтрТабл,СтруктураФайла, ДопПараметры);
			Если Не НоменклатураНов = Неопределено Тогда
				НазваниеНоменклатуры = Неопределено;
				Идентификатор = Неопределено;
				КодПокупателя = Неопределено;
				Если Не СтрТабл.Свойство("Название", НазваниеНоменклатуры) Тогда
					НазваниеНоменклатуры = "";
				КонецЕсли;
				Если Не СтрТабл.Свойство("Идентификатор", Идентификатор) Тогда
					Идентификатор = "";
				КонецЕсли;
				Если Не СтрТабл.Свойство("КодПокупателя", КодПокупателя) Тогда
					КодПокупателя = "";
				КонецЕсли;
				ДанныеНоменклатуры = Новый Структура("Название,Идентификатор,КодПокупателя,Номенклатура,Характеристика",НазваниеНоменклатуры,Идентификатор,КодПокупателя,НоменклатураНов,"");
				//Записываем соответствие
				фрм = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("МодульСопоставлениеНоменклатуры");
				фрм.УстановитьСоответствиеНоменклатуры(СтрКонтрагента, ДанныеНоменклатуры, Кэш.Парам.КаталогНастроек, Кэш.Ини);
				
				Результат.Номенклатура = НоменклатураНов;
				Результат.Новый = Истина;			
			Иначе
				//ПараметрыЗаполнения.РежимНоменклатуры = 1;
				Результат.Вставить("ТекстОшибки", ПараметрыЗаполнения.СтрокаДетализации.Состояние);
				Отказ = Истина;//Не переключаем режим номенклатуры, а даём понять, что с номенклатурой что-то не так. Тогда вложение мы не обрабатываем и добавляем ошибку.
			КонецЕсли;
		ИначеЕсли КодРежимаНоменклатуры = 0 И ПараметрыНоменклатуры.НадоСопоставлять Тогда
			
			Если Не ПараметрыРезультат.ФормаВызова = "ФормаПросмотрДокумента" И СоздаватьНоменклатуру Тогда
				ДопСообщение = " Для сопоставления откройте карточку документа.";
			ИначеЕсли Не СоздаватьНоменклатуру Тогда
				ДопСообщение = Символы.ПС + "Для данного типа загружаемого документа отключено создание номенклатуры."
								+ " Создайте карточки в 1С самостоятельно или сопоставьте с имеющимися.";
			Иначе
				ДопСообщение = "";				
			КонецЕсли;
			
			Результат.Вставить("ТекстОшибки", "Не вся номенклатура сопоставлена." + ДопСообщение);
			Отказ = Истина;
			
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;	
	
КонецФункции

&НаКлиенте
Функция СоздатьНоменклатуруПоДаннымПоставщика(Кэш, СтрТабл, СтруктураФайла, ДопПараметры = Неопределено) Экспорт  	// сбисНикифоров  Функция создает Карточку номенклатуры по данным из файла
	//Проверяем вызов: если есть необходимость заполнения детализции, то формируем структуру ответа с детальным описанием обработчки карточки.
	Результат = Новый Структура("Название, Ссылка, Тип, Состояние, Сообщение, Ошибки", ?(СтрТабл.Свойство("Название"), СтрТабл.Название, ""), Неопределено, Неопределено,"", "", Ложь);
	ОшибкаСостояние = "Ошибка автоматического сопоставления/создания номенклатуры.";
	ОшибкаСообщение = "";
	//ОшибкаСообщение = "Автоматическое создание номенклатуры при загрузке не поддерживается для Вашей конфигурации.";
	ДанныеДетализации = РезультатДействия_ИзвлечьВременныеДанные(Кэш);
	//1189546150
	Если НЕ ДопПараметры = Неопределено
		И ДопПараметры.Свойство("СтруктураИниФайла") Тогда
		СтруктураИниФайла = ДопПараметры.СтруктураИниФайла;
	Иначе
		СтруктураИниФайла = Новый Структура;
	КонецЕсли;
	
	ИниКонфигурация = МодульОбъектаКлиент().ИниПоПараметрам("Конфигурация");
	Если ИниКонфигурация.Свойство("Номенклатура") Тогда  
		
		//Опция автоматического создания номенклатуры. Либо не указано, либо явно запрещено.
		СоставОграниченийТипов	= ТипыСправочниковНоменклатуры(СтруктураИниФайла);
		Результат.Тип			= ОпределитьИмяТипаОбъекта(СоставОграниченийТипов[0]); 	
		СправочникНоменклатура	= Результат.Тип;
		
	Иначе
		Если ДанныеДетализации.ЗаполнитьДетализацию Тогда
			ДанныеДетализации.Отказ = Истина;
			ДанныеДетализации.СтрокаДетализации.Состояние = ОшибкаСостояние;
			ДанныеДетализации.СтрокаДетализации.Сообщение = ОшибкаСообщение;
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	
	Результат.Ссылка = сбисНайтиНоменклатуруПоНаименованию(СправочникНоменклатура, ?(СтрТабл.Свойство("Название"), СтрТабл.Название, ""));	//Пытаемся найти уже имеющуюся в базе по наименованию
	Если ЗначениеЗаполнено(Результат.Ссылка) Тогда
		Если ДанныеДетализации.ЗаполнитьДетализацию Тогда
			Результат.Состояние = "Найден.";
			Результат.Сообщение = "Для позиции " + Результат.Название + " найдена карточка номенклатуры с таким же названием.";
			РезультатДействия_ДобавитьВРасшифровку(Кэш, "ЗагрузкаСправочника", ДанныеДетализации.СтрокаДетализации, Результат);
		КонецЕсли;
		Возврат Результат.Ссылка;             										//Если находим то возвращаем уже существующую карточку
	КонецЕсли;
	
	ДополнительныеПараметрыСоздания = Новый Структура(	"ТипОбъекта,	ПодТипОбъекта,			Ини",
														"Справочник",	СправочникНоменклатура,	СтруктураИниФайла);
	//Иначе создаем новый элемент справочника
	СтруктураСправочника = Новый Структура();
	//Создаем структуру, где ключ - название реквизита справочника, а значение - значение из файла
	ЗаполнитьСтруктуруЭлементаСправочника(Кэш,СтрТабл,СтруктураФайла,СтруктураСправочника); //Заполняем ее
	
	РезультатСоздания = МодульОбъектаКлиент().СоздатьОбъектИзСтруктуры(СтруктураСправочника, ДополнительныеПараметрыСоздания, ДанныеДетализации.Отказ);
	Если ДанныеДетализации.Отказ Тогда
		Если ДанныеДетализации.ЗаполнитьДетализацию Тогда
			//Если не удаётся создать карточку номенклатуры, то не поддерживаем (как было раньше)
			ДанныеДетализации.СтрокаДетализации.Состояние = ОшибкаСостояние;
			ДанныеДетализации.СтрокаДетализации.Сообщение = ОшибкаСообщение;
			Результат.Состояние = РезультатСоздания.Состояние;
			Результат.Сообщение = РезультатСоздания.Сообщение;
			Результат.Ошибки	= Истина;
			РезультатДействия_ДобавитьВРасшифровку(Кэш, "ЗагрузкаСправочника", ДанныеДетализации.СтрокаДетализации, Результат);
		Иначе
			Сообщить(РезультатСоздания.Сообщение);
		КонецЕсли;
		Возврат Неопределено;
	Иначе
		Если ДанныеДетализации.ЗаполнитьДетализацию Тогда
			Результат = РезультатСоздания;
			РезультатДействия_ДобавитьВРасшифровку(Кэш, "ЗагрузкаСправочника", ДанныеДетализации.СтрокаДетализации, РезультатСоздания);
		КонецЕсли;
		Возврат РезультатСоздания.Ссылка;                                  	//Возвращаем ее
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция сбисНайтиНоменклатуруПоНаименованию(СправочникНоменклатура, Название) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка Из Справочник."+СправочникНоменклатура+" ГДЕ Наименование = &Наим и Не ЭтоГруппа");
	Запрос.УстановитьПараметр("Наим", Название);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;		
	КонецЕсли;
КонецФункции

&НаСервере
Функция сбисНайтиНоменклатуруПоСпискуНаименований(СправочникНоменклатура, СписокНоменклатур) Экспорт

	ТекстЗапросаВх = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ссылка,
	               |	Номенклатура.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник." + СправочникНоменклатура + " КАК Номенклатура
	               |ГДЕ   
				   | 	НЕ Номенклатура.ПометкаУдаления
	               |	И Номенклатура.Наименование В(&СписокНоменклатур)
	               |	И НЕ ЭтоГруппа";
	
	ПараметрыЗапросаВХ = Новый Структура("СписокНоменклатур", СписокНоменклатур);
	
	ДопПараметры = Новый Структура("Размер", 100);
	
	Результат = МодульОбъектаСервер().ВыполнитьЗапросСПараметрами(ТекстЗапросаВх, ПараметрыЗапросаВх);
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает список типов справочников для сопоставления номенклатуры
//
// Параметры:
//  СтруктураИниФайла - Структура - ини файл, разложенный в структуру значений  
// 
// Возвращаемое значение:
//  Массив - список типов справочников
//
&НаКлиенте
Функция ТипыСправочниковНоменклатуры(СтруктураИниФайла) Экспорт

	ВидыСправочниковНоменклатуры = МестныйКэш.ОбщиеФункции.РассчитатьЗначение("ВидыСправочниковНоменклатуры",СтруктураИниФайла, МестныйКэш); 
	СоставОграниченийТипов = Новый Массив;
	Если ВидыСправочниковНоменклатуры = Неопределено Тогда
		Если МестныйКэш.Ини.Конфигурация.Свойство("Номенклатура") Тогда
			ИмяСправочникаНоменклатуры = МестныйКэш.ОбщиеФункции.сбисСообщитьИмяРеквизита(МестныйКэш.Ини.Конфигурация.Номенклатура.Значение);
			ТипСправочникаНоменклатуры = "СправочникСсылка."+ИмяСправочникаНоменклатуры;
		Иначе
			ТипСправочникаНоменклатуры = "СправочникСсылка.Номенклатура";
		КонецЕсли;   
		СоставОграниченийТипов.Добавить(Тип(ТипСправочникаНоменклатуры));
	Иначе
		СписокИменСправочниковНоменклатуры = МестныйКэш.ОбщиеФункции.РазбитьСтрокуВМассивНаКлиенте(ВидыСправочниковНоменклатуры, ",");
		Для Каждого ТипСправочникаНоменклатуры Из СписокИменСправочниковНоменклатуры Цикл
			СоставОграниченийТипов.Добавить(Тип(ТипСправочникаНоменклатуры));
		КонецЦикла; 
	КонецЕсли;
	
	Возврат СоставОграниченийТипов;  
	
КонецФункции

// Функция возвращает тип справочника единиц для сопоставления номенклатуры по метаданным конфигурации
//
// 
// Возвращаемое значение:
//  Строка - тип справочника единиц
//
&НаСервереБезКонтекста
Функция ТипСправочникаЕдиницПоМетаданным() Экспорт

	Если НЕ Метаданные.Справочники.Найти("УпаковкиЕдиницыИзмерения") = Неопределено Тогда  // ЕРП, КА2, УТ11
		
		ТипСправочникаЕдиниц	= "УпаковкиЕдиницыИзмерения";
		
	ИначеЕсли НЕ Метаданные.Справочники.Найти("ЕдиницыИзмерения") = Неопределено Тогда // УПП, УТ10, УНФ, ШТРИХ
		
		ТипСправочникаЕдиниц	= "ЕдиницыИзмерения"; 

	Иначе	
		
		ТипСправочникаЕдиниц	= "КлассификаторЕдиницИзмерения"; // БП
		
	КонецЕсли;		

	
	Возврат ТипСправочникаЕдиниц;  
	
КонецФункции

&НаКлиенте
Функция ОбогащенныеЗначенияПоиска(НесопоставленнаяНоменклатура)
	
	ПорядокАвтоматическогоСопоставленияСтрока = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ПорядокАвтоматическогоСопоставления"); 
	Если ПорядокАвтоматическогоСопоставленияСтрока = Неопределено Тогда
		
		ПорядокАвтоматическогоСопоставления = Новый Массив;
		ПорядокАвтоматическогоСопоставления.Добавить("Артикул");
		ПорядокАвтоматическогоСопоставления.Добавить("КодПоставщика");
		ПорядокАвтоматическогоСопоставления.Добавить("КодПокупателя");
		ПорядокАвтоматическогоСопоставления.Добавить("GTIN");
		ПорядокАвтоматическогоСопоставления.Добавить("Идентификатор");
		
	Иначе 
		Разделитель = ",";
		ПорядокАвтоматическогоСопоставления = МодульОбъектаКлиент().СбисРазложитьСтрокуВМассивПодстрок(ПорядокАвтоматическогоСопоставленияСтрока, Разделитель); 
	КонецЕсли;
	
	ОбогащенныеЗначенияПоиска = Новый Структура;  
	Значения = Новый Массив;
	
	Для Каждого РеквизитСопоставления Из ПорядокАвтоматическогоСопоставления Цикл
		
		Значения.Очистить();
		
		Для Каждого ДанныеНоменклатуры Из НесопоставленнаяНоменклатура Цикл
			
			Если ДанныеНоменклатуры.Значение.НоменклатураСБИС.Свойство("ТипКода") 
				И ДанныеНоменклатуры.Значение.НоменклатураСБИС.ТипКода = РеквизитСопоставления Тогда
				
				Значения.Добавить(ДанныеНоменклатуры.Значение.НоменклатураСБИС.Код);
            	Продолжить;
				
			КонецЕсли;
			
			Если НЕ ДанныеНоменклатуры.Значение.НоменклатураСБИС.Свойство(РеквизитСопоставления) Тогда
				Продолжить;
			ИначеЕсли ЗначениеЗаполнено(ДанныеНоменклатуры.Значение.НоменклатураСБИС[РеквизитСопоставления]) Тогда
				Значения.Добавить(ДанныеНоменклатуры.Значение.НоменклатураСБИС[РеквизитСопоставления]);
			Иначе
				Продолжить;
			КонецЕсли;	
			
		КонецЦикла;
		
		Если Значения.Количество() Тогда  
			ЗначенияПослеСвертки = СвернутьМассивВызовСервера(Значения);
			ОбогащенныеЗначенияПоиска.Вставить(РеквизитСопоставления, ЗначенияПослеСвертки);
		КонецЕсли;
		
	КонецЦикла;                       
	
	Возврат ОбогащенныеЗначенияПоиска; 
КонецФункции

&НаСервере
Функция СвернутьМассивВызовСервера(МассивДляСворачивания)

	СвернутыйМассив = МодульОбъектаСервер().СбисСвернутьМассив(МассивДляСворачивания);
	Возврат СвернутыйМассив;
	
КонецФункции

&НаКлиенте
Процедура РасширенныйФункционалСопоставления_ОбработкаСопоставленияПоТаблДоку(ПараметрыОбработки)
	
	ТаблДок = МестныйКэш.ОбщиеФункции.РассчитатьЗначениеИзСтруктуры(ПараметрыОбработки.ПутьТаблДок, ПараметрыОбработки.Вложение.СтруктураФайла);
	ДопПараметры = Новый Структура("Кэш, Идентификатор", 
						МестныйКэш, МодульОбъектаКлиент().СоставПакета_Получить(ПараметрыОбработки.СоставПакета, "Идентификатор"));
	ФормаСопоставления = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("МодульСопоставлениеНоменклатуры");
	ПараметрыДляОбновления = Новый Структура("Контрагент, Номенклатура");
	
	КонтрагентДляСопоставления = МодульОбъектаКлиент().СоставПакета_Получить(ПараметрыОбработки.СоставПакета, "Контрагент");
	
	СписокНоменклатурДляОбогащения = Новый Массив;
	ПараметрыОбработки.Вставить("СписокНоменклатурДляОбогащения", СписокНоменклатурДляОбогащения);
	ПараметрыОбработки.Вставить("ТаблДок", ТаблДок);
	ПараметрыОбработки.Вставить("КонтрагентДляСопоставления", КонтрагентДляСопоставления);
	
	ОбогащенныеДанныеНоменклатурыДляСопоставления = РасширенныйФункционалСопоставления_СФормироватьПредварительныйЛистСопоставлений(ПараметрыОбработки);
	
	ВключенСтарыйПоиск = МодульОбъектаКлиент().ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры");
	
	Если ВключенСтарыйПоиск Тогда 
		ПараметрыОбработки.Вставить("ОбогащенныеДанныеНоменклатурыДляСопоставления", ОбогащенныеДанныеНоменклатурыДляСопоставления);
		РасширенныйФункционалСопоставления_ПоискПереносСтарогоСопоставления(ПараметрыОбработки);
		
		ОбогащенныеДанныеНоменклатурыДляСопоставления = ПараметрыОбработки.ОбогащенныеДанныеНоменклатурыДляСопоставления;
		
		ПараметрыДляОбновления.Вставить("Контрагент", КонтрагентДляСопоставления);
		ПараметрыДляОбновления.Вставить("Номенклатура", ОбогащенныеДанныеНоменклатурыДляСопоставления);
		
		ФормаСопоставления.НоменклатураПоставщика_МассовоеОбновление(ПараметрыДляОбновления, ДопПараметры);
	КонецЕсли;
	
	ИспользоватьАвтСоп = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ИспользоватьАвтоматическоеСопоставлениеНоменклатуры");
	
	Если ИспользоватьАвтСоп Тогда
		
		ПорядокАвтСопСтрока = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ПорядокАвтоматическогоСопоставления");
		Если ПорядокАвтСопСтрока = Неопределено Тогда
			ПорядокАвтоматическогоСопоставления = МодульОбъектаКлиент().ПорядокАвтоматическогоСопоставленияПоУмолчанию();
		Иначе
			Разделитель = ",";
			ПорядокАвтоматическогоСопоставления = МодульОбъектаКлиент().СбисРазложитьСтрокуВМассивПодстрок(ПорядокАвтСопСтрока, Разделитель);
		КонецЕсли;
		
		ТипыПолей1С = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолей1С");
		ИмяСправочникаНоменклатуры = ТипыПолей1С.Номенклатура.ТипыМассивСтрок[0];
		ИмяСправочникаНоменклатуры = Сред(ИмяСправочникаНоменклатуры, Найти(ИмяСправочникаНоменклатуры, ".") + 1);
		
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("ПорядокАвтоматическогоСопоставления", ПорядокАвтоматическогоСопоставления);
		ПараметрыПоиска.Вставить("ИмяСправочникаНоменклатуры", ИмяСправочникаНоменклатуры);
		ИмяРегистраДополнительныхСведений = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ИмяРегистраДополнительныхСведений");
		ПараметрыПоиска.Вставить("ИмяРегистраДополнительныхСведений", ИмяРегистраДополнительныхСведений);
		ИмяРеквизитаЕдиницыИзмерения = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ИмяРеквизитаЕдиницыИзмерения");
		ПараметрыПоиска.Вставить("ИмяРеквизитаЕдиницыИзмерения", ИмяРеквизитаЕдиницыИзмерения);         
		
		МетаданныеШтрихкодов = Новый Структура;  
		МетаданныеШтрихкодов.Вставить("ОписаниеМетаданныхШтрихкодов", МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ОписаниеМетаданныхШтрихкодов"));
		
		РасширенныйФункционалСопоставления_Вызов_АвтоматическоеСопоставлениеНоменклатур(ОбогащенныеДанныеНоменклатурыДляСопоставления, ПараметрыПоиска, МетаданныеШтрихкодов);	
				
		ПараметрыДляОбновления.Вставить("Контрагент", КонтрагентДляСопоставления);
		ПараметрыДляОбновления.Вставить("Номенклатура", ОбогащенныеДанныеНоменклатурыДляСопоставления);
		
		ФормаСопоставления.НоменклатураПоставщика_МассовоеОбновление(ПараметрыДляОбновления, ДопПараметры);
		
	КонецЕсли;
	
	ПересчетПоКоэффициентамЕдиницИзмерения(ОбогащенныеДанныеНоменклатурыДляСопоставления, "Загрузка");
	ПересчетНДСПоДаннымСтрокиСопоставления(ОбогащенныеДанныеНоменклатурыДляСопоставления);
	
	ПараметрыОбработки.ПараметрыНоменклатуры.Сопоставлено = Истина;
	
	СопоставлениеНеУдалось = Ложь;
	
	Для Каждого СтрокаДанныхНоменклатуры Из ОбогащенныеДанныеНоменклатурыДляСопоставления Цикл
		
		Если СтрокаДанныхНоменклатуры.Свойство("АвтоматическоеСопоставлениеПровалено") Тогда
			СопоставлениеНеУдалось = Истина;
			ПараметрыОбработки.ПараметрыНоменклатуры.Сопоставлено = Ложь;
			Прервать;
		КонецЕсли;
		
		Если НЕ СтрокаДанныхНоменклатуры.Номенклатура1С.Количество() Тогда
			СопоставлениеНеУдалось = Истина;
			ПараметрыОбработки.ПараметрыНоменклатуры.Сопоставлено = Ложь;
			Прервать;
		КонецЕсли;
		
		Для Каждого Номенклатура Из СтрокаДанныхНоменклатуры.Номенклатура1С Цикл
			
			Если НЕ ЗначениеЗаполнено(Номенклатура.Ключ) Тогда
				СопоставлениеНеУдалось = Истина;
				ПараметрыОбработки.ПараметрыНоменклатуры.Сопоставлено = Ложь;
				КонецЕсли;
			
			Прервать; // Дальше первой проверять нет смысла, ибо если у первой нет ключа, то у остальных быть не может (и не должно) (с) Сыч
			
		КонецЦикла;
		
		Если ПараметрыОбработки.ПараметрыНоменклатуры.Сопоставлено = Ложь Тогда // Если хотя бы одна номенклатура не сопоставлена - рубим целиком
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	//Если СопоставлениеНеУдалось Тогда
	//	ПараметрыОбработки.Результат.Статус = "Не вся номенклатура сопоставлена.";
	//	ПараметрыОбработки.Результат.СтатусКартинка = 1;
	//КонецЕсли;
	
	ПараметрыОбработки.Вложение.Вставить("КлассыСопоставленияНоменклатур", ОбогащенныеДанныеНоменклатурыДляСопоставления);
	ПараметрыОбработки.Вложение.Вставить("ТаблДок", ТаблДок);
	ПараметрыОбработки.Результат.Вставить("ТаблДок", ТаблДок);
	
КонецПроцедуры

&НаСервере
Процедура РасширенныйФункционалСопоставления_Вызов_АвтоматическоеСопоставлениеНоменклатур(ОбогащенныеДанныеНоменклатурыДляСопоставления, ПараметрыПоиска, МетаданныеШтрихкодов)
	МодульОбъектаСервер().РасширенныйФункционалСопоставления_АвтоматическоеСопоставлениеНоменклатур(ОбогащенныеДанныеНоменклатурыДляСопоставления, ПараметрыПоиска, МетаданныеШтрихкодов);
КонецПроцедуры

&НаКлиенте 
Функция РасширенныйФункционалСопоставления_СформироватьПредварительныйЛистСопоставлений(ПараметрыОбработки)
	
	ТаблДок = ПараметрыОбработки.ТаблДок;
	ВключенСтарыйПоиск = МодульОбъектаКлиент().ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры");
	
	Для Каждого СтрокаНоменклатуры Из ТаблДок Цикл
		// Заполнение данных для обогащения из файла
		Если СтрокаНоменклатуры.Свойство("НеЗагружать") Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеЗаполнения = Новый Структура();
		ДанныеЗаполнения.Вставить("КодПокупателя");
		ДанныеЗаполнения.Вставить("Код");
		ДанныеЗаполнения.Вставить("Артикул");
		ДанныеЗаполнения.Вставить("Название");
		ДанныеЗаполнения.Вставить("Идентификатор");
		ДанныеЗаполнения.Вставить("Номенклатура");
		ДанныеЗаполнения.Вставить("Характеристика");
		ДанныеЗаполнения.Вставить("GTIN");
		ДанныеЗаполнения.Вставить("КодПоставщика");
		ДанныеЗаполнения.Вставить("ЕдИзм");
		ДанныеЗаполнения.Вставить("ОКЕИ");
		ДанныеЗаполнения.Вставить("Цена");
		ДанныеЗаполнения.Вставить("Кол_Во");
		ДанныеЗаполнения.Вставить("Сумма");
		ДанныеЗаполнения.Вставить("СуммаБезНал");
		ДанныеЗаполнения.Вставить("ИдентификаторДокумента", ПараметрыОбработки.СоставПакета.Идентификатор);
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, СтрокаНоменклатуры);
		
		ГолыйКлассНоменклатурыДляСопоставления = МодульОбъектаКлиент().НовыйСтрокаСопоставленияСБИСКлиент(ДанныеЗаполнения);
		
		ПараметрыОбработки.СписокНоменклатурДляОбогащения.Добавить(ГолыйКлассНоменклатурыДляСопоставления);
		
	КонецЦикла;
	
	ПараметрыДляОбогащения = Новый Структура("Контрагент, Номенклатура");
	
	ПараметрыДляОбогащения.Вставить("Контрагент", ПараметрыОбработки.КонтрагентДляСопоставления);
	ПараметрыДляОбогащения.Вставить("Номенклатура", ПараметрыОбработки.СписокНоменклатурДляОбогащения);
	 
	ФормаРаботыСНоменклатурой = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("МодульСопоставлениеНоменклатуры");
	ДопПараметры = Новый Структура("Кэш", МестныйКэш);
	
	Попытка
		ОбогащенныеДанныеНоменклатурыДляСопоставления = ФормаРаботыСНоменклатурой.НоменклатураПоставщика_МассовыйПоиск(ПараметрыДляОбогащения, ДопПараметры);
	Исключение
		ОбогащенныеДанныеНоменклатурыДляСопоставления = ПараметрыОбработки.СписокНоменклатурДляОбогащения;
		МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "ФормаРаботыСНоменклатурой.НоменклатураПоставщика_МассовыйПоиск");
	КонецПопытки;
	
	Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("РежимОтладки") Тогда
		
		ДанныеЛогирования = Новый Структура;
		ДанныеЛогирования.Вставить("Тип", "СопоставлениеНоменклатуры");
		ДанныеЛогирования.Вставить("Идентификатор", МодульОбъектаКлиент().ВложениеСБИС_Получить(ПараметрыОбработки.Вложение, "Название"));
		ДанныеЛогирования.Вставить("Вызов", ОбогащенныеДанныеНоменклатурыДляСопоставления);
		ДанныеЛогирования.Вставить("Модуль", "Файл_Шаблон");
		
		МодульОбъектаКлиент().СохранитьОтладочныеДанныеСБИС(ДанныеЛогирования);
	КонецЕсли;
	
	Для Каждого КлассНоменклатуры Из ОбогащенныеДанныеНоменклатурыДляСопоставления Цикл
		Если НЕ КлассНоменклатуры.Номенклатура1С.Количество() Тогда
			МодульОбъектаКлиент().СтрокаСопоставленияСБИСКлиент_Вставить(КлассНоменклатуры, "НеобходимоАвтоматическоеСопоставление", Истина);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбогащенныеДанныеНоменклатурыДляСопоставления; 
	
КонецФункции

// Процедура - Пересчет по коэффициентам единиц измерения
//
// Параметры:
//  ПодготовленныеДанныеНоменклатур	 - Массив - Набор классов сопоставления номенклатуры
//  НаправлениеПересчета			 - Строка - Загрузка/Выгрузка. Для загрузки умножаем количество и делим цену, для выгрузки наоборот
//
&НаКлиенте
Процедура ПересчетПоКоэффициентамЕдиницИзмерения(ПодготовленныеДанныеНоменклатур, НаправлениеПересчета = "Загрузка") Экспорт
	
	Для Каждого КлассСопоставления Из ПодготовленныеДанныеНоменклатур Цикл
		
		Для Каждого Номенклатура1С Из КлассСопоставления.Номенклатура1С Цикл
			
			// Если нет ссылки на номенклатуру - пересчёт не нужен, будет сделан на форме ручного сопоставления
			Если НЕ Номенклатура1С.Значение.Основное
				ИЛИ НЕ ЗначениеЗаполнено(Номенклатура1С.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			// Получим коэффициент единицы СБИС, он же - коэффициент поставщика.
			КоэффициентСБИС = 1;
			Для Каждого ЕдиницаПоставщика Из КлассСопоставления.НоменклатураСБИС.Единицы Цикл
				КоэффициентСБИС = Число(ЕдиницаПоставщика.Значение.Коэффициент);
				Прервать;
			КонецЦикла;
			
			// Получим коэффициент единицы.
			Если Номенклатура1С.Значение.Единицы.Количество() Тогда
				Для Каждого Единица Из Номенклатура1С.Значение.Единицы Цикл
					БазоваяЕдиницаОкеи = Единица.Значение.ОКЕИ;
					Коэффициент1С = Номенклатура1С.Значение.Коэффициент;
					Прервать;
				КонецЦикла;
			Иначе
				Коэффициент1С = КоэффициентСБИС;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Номенклатура1С.Значение.Кол_Во) И  НаправлениеПересчета = "Загрузка" Тогда
				МодульОбъектаКлиент().СтрокаСопоставленияСБИСКлиент_Вставить(КлассСопоставления, "БазоваяЕдиницаОкеи", БазоваяЕдиницаОкеи);
			ИначеЕсли ЗначениеЗаполнено(Номенклатура1С.Значение.Кол_Во) Тогда
				МодульОбъектаКлиент().СтрокаСопоставленияСБИСКлиент_Вставить(КлассСопоставления, "БазоваяЕдиницаОкеи", БазоваяЕдиницаОкеи);
			КонецЕсли;
			
			// Заполним данные для табличной части документа 1С
			ТабличныеДанные1С = Новый Структура("Номенклатура, Цена, Сумма, СуммаБезНал, СуммаНДС, СтавкаНДС, Кол_Во");
			ТабличныеДанные1С.Вставить("Номенклатура", Номенклатура1С.Ключ);
			ТабличныеДанные1С.Вставить("БазоваяЕдиницаОкеи", БазоваяЕдиницаОкеи);
			
			Если НаправлениеПересчета = "Выгрузка" И НЕ Коэффициент1С = 1 Тогда
				СписокСвойств1С = "Цена, Кол_во, Сумма, СуммаБезНал, СуммаНДС, СтавкаНДС, БазоваяЕдиницаОКЕИ"; 
				СписокСвойствСБИС = "Цена, Кол_во, Сумма, СуммаБезНал, СуммаНДС, СтавкаНДС";
				ЗаполнитьЗначенияСвойств(ТабличныеДанные1С, Номенклатура1С.Значение, СписокСвойств1С);  
				ТабличныеДанные1С.Цена = Номенклатура1С.Значение.Цена * Коэффициент1С; 
				ТабличныеДанные1С.Кол_во = Номенклатура1С.Значение.Кол_во / Коэффициент1С;
				ЗаполнитьЗначенияСвойств(КлассСопоставления.НоменклатураСБИС, ТабличныеДанные1С, СписокСвойствСБИС);
			ИначеЕсли НаправлениеПересчета = "Загрузка" И НЕ Коэффициент1С = КоэффициентСБИС Тогда
				ТабличныеДанные1С.Вставить("Цена", КлассСопоставления.НоменклатураСБИС.Цена / Коэффициент1С);
				ТабличныеДанные1С.Вставить("Кол_во", КлассСопоставления.НоменклатураСБИС.Кол_во * Коэффициент1С);
				СписокСвойств = "Сумма, СуммаНДС, СтавкаНДС, СуммаБезнал";
				ЗаполнитьЗначенияСвойств(ТабличныеДанные1С, КлассСопоставления.НоменклатураСБИС, СписокСвойств); 
			ИначеЕсли НЕ Коэффициент1С = КоэффициентСБИС Тогда
				ТабличныеДанные1С.Вставить("Цена", КлассСопоставления.НоменклатураСБИС.Цена / Коэффициент1С);
				ТабличныеДанные1С.Вставить("Кол_во", КлассСопоставления.НоменклатураСБИС.Кол_во * Коэффициент1С);
				СписокСвойств = "Сумма, СуммаНДС, СтавкаНДС, СуммаБезнал";
				ЗаполнитьЗначенияСвойств(ТабличныеДанные1С, КлассСопоставления.НоменклатураСБИС, СписокСвойств);
			Иначе
				СписокСвойств = "Цена, Кол_во, Сумма, СуммаБезНал, СуммаНДС, СтавкаНДС";
				ЗаполнитьЗначенияСвойств(ТабличныеДанные1С, КлассСопоставления.НоменклатураСБИС, СписокСвойств);
			КонецЕсли;
			
			// Запихнём данные в класс номенклатуры 1С 
			МодульОбъектаКлиент().ОписаниеНоменклатуры1СКлиент_Заполнить(Номенклатура1С.Значение, ТабличныеДанные1С);
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПересчетНДСПоДаннымСтрокиСопоставления(ПодготовленныеДанныеНоменклатур) Экспорт
	
	Для Каждого КлассСопоставления Из ПодготовленныеДанныеНоменклатур Цикл
		
		НоменклатураСБИС = КлассСопоставления.НоменклатураСБИС;
		Номенклатуры1С = КлассСопоставления.Номенклатура1С;
		
		Если ТипЗнч(НоменклатураСБИС.СуммаНДС) = Тип("Строка")
			И ТипЗнч(НоменклатураСБИС.Сумма) = Тип("Строка") Тогда
			СуммаНДС = МодульОбъектаКлиент().СбисСтрокаВЧисло(НоменклатураСБИС.СуммаНДС, 0, 0);
			СтавкаНДС = МодульОбъектаКлиент().СбисСтрокаВЧисло(НоменклатураСБИС.СтавкаНДС, 0, 0);
			Сумма = МодульОбъектаКлиент().СбисСтрокаВЧисло(НоменклатураСБИС.Сумма, 0, 0);
			СуммаБезНал = МодульОбъектаКлиент().СбисСтрокаВЧисло(НоменклатураСБИС.СуммаБезнал, 0, 0);
		ИначеЕсли ТипЗнч(НоменклатураСБИС.СуммаБезНал) = Тип("Строка") Тогда
			СуммаБезНал = МодульОбъектаКлиент().СбисСтрокаВЧисло(НоменклатураСБИС.СуммаБезнал, 0, 0);
		Иначе
			СуммаНДС = Число(НоменклатураСБИС.СуммаНДС);
			СтавкаНДС = НоменклатураСБИС.СтавкаНДС;
			Сумма = Число(НоменклатураСБИС.Сумма);
			СуммаБезНал = Число(НоменклатураСБИС.СуммаБезнал);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СуммаНДС)
			И ЗначениеЗаполнено(СтавкаНДС)
			И ЗначениеЗаполнено(Сумма) Тогда
			КоэффициентНДСДляРасчета = СуммаНДС / Сумма;
			СтавкаНДС = СтавкаНДС;
		ИначеЕсли СуммаБезНал = Сумма
			И ЗначениеЗаполнено(Сумма)
			И ЗначениеЗаполнено(СуммаБезНал) Тогда
			СтавкаНДС = "";
			СуммаНДС = Сумма - СуммаБезНал;
			КоэффициентНДСДляРасчета = Окр(СуммаНДС / СуммаБезНал, 2, 1);
			СтавкаНДСВПроцентах = КоэффициентНДСДляРасчета * 100;
		ИначеЕсли ЗначениеЗаполнено(СуммаБезНал)
			И ЗначениеЗаполнено(Сумма) Тогда
			
			СуммаНДС = Сумма - СуммаБезНал;
			КоэффициентНДСДляРасчета = Окр(СуммаНДС / СуммаБезНал, 2, 1);
			СтавкаНДСВПроцентах = КоэффициентНДСДляРасчета * 100;
			СтавкаНДС = Строка(СтавкаНДСВПроцентах);
		Иначе
			Продолжить;
		КонецЕсли;
		
		Для Каждого Номенклатура1С Из Номенклатуры1С Цикл
			
			Номенклатура1С.Значение.СуммаБезНал = ОКР(Номенклатура1С.Значение.Сумма / (КоэффициентНДСДляРасчета + 1), 2, 1);
			Номенклатура1С.Значение.СуммаНДС = ОКР(Номенклатура1С.Значение.Сумма - Номенклатура1С.Значение.СуммаБезНал, 2, 1);
			Номенклатура1С.Значение.СтавкаНДС = СтавкаНДС;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенныйФункционалСопоставления_ЕслиЕстьНесопоставленнаяНоменклатура(ВходящиеПараметры)
	
	ВходящиеПараметры.ПараметрыНоменклатуры.Сопоставлено = Истина;
	ВходящиеПараметры.Результат.Статус = "Номенклатура сопоставлена. ";
	//ВходящиеПараметры.Результат.СтатусКартинка = 3;
	
	ОбнаруженаНесопоставленнаяНоменклатура = Ложь;
	Для Каждого КлассНоменклатуры Из ВходящиеПараметры.Вложение.КлассыСопоставленияНоменклатур Цикл
		
		Если НЕ КлассНоменклатуры.Номенклатура1С.Количество() Тогда
			ОбнаруженаНесопоставленнаяНоменклатура = Истина;
			Прервать;
		КонецЕсли;
		
		Для Каждого Номенклатура1С Из КлассНоменклатуры.Номенклатура1С Цикл
			Если НЕ ЗначениеЗаполнено(Номенклатура1С.Ключ) Тогда
				ОбнаруженаНесопоставленнаяНоменклатура = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ОбнаруженаНесопоставленнаяНоменклатура Тогда
		ВходящиеПараметры.ПараметрыНоменклатуры.Сопоставлено = Ложь;
		ВходящиеПараметры.Результат.Статус = "Не вся номенклатура сопоставлена";
		//ВходящиеПараметры.Результат.СтатусКартинка = 2;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенныйФункционалСопоставления_ПоискПереносСтарогоСопоставления(ПараметрыОбработки)
	
	СоставПакета 								  = ПараметрыОбработки.СоставПакета;
	КонтрагентДляСопоставления 					  = ПараметрыОбработки.КонтрагентДляСопоставления;
	ОбогащенныеДанныеНоменклатурыДляСопоставления = ПараметрыОбработки.ОбогащенныеДанныеНоменклатурыДляСопоставления;
	ТаблДок 									  = ПараметрыОбработки.ТаблДок;
	
	ИмяРеквизитаЕдиницыИзмерения = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ИмяРеквизитаЕдиницыИзмерения");
	ДопПараметрыНоменклатуры = Новый Структура("ВыгружатьЕдиницу, ИмяРеквизитаЕдиницы", Истина, ИмяРеквизитаЕдиницыИзмерения);
	ДопПараметрыЕдиницы = Новый Структура("ТипИсточника", "Структура");
	
	фрм = МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("МодульРаботыСНоменклатуройOLD");
	
	Если Фрм = Неопределено Или фрм = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПоиска = Новый Массив;
	
	НомерСтроки = 0; // Используется для связи с ТаблДоком
	Для Каждого КлассСопоставления Из ОбогащенныеДанныеНоменклатурыДляСопоставления Цикл
		
		ОсновнаяНоменклатураНайдена = Ложь;
		ДанныеНоменклатуры = Неопределено;
		
		Если НЕ КлассСопоставления.Номенклатура1С.Количество() Тогда
			СтрТабл = ТаблДок[НомерСтроки]; 
			ДанныеПоиска.Добавить(СтрТабл); 
			ДанныеНоменклатуры	= фрм.НайтиНоменклатуруПоставщика(КонтрагентДляСопоставления, СтрТабл, МестныйКэш.Парам.КаталогНастроек, МестныйКэш.Ини, ДопПараметрыНоменклатуры);
			
			Если НЕ ДанныеНоменклатуры = Неопределено Тогда
				
				ОписаниеНоменклатуры1С = МодульОбъектаКлиент().НовыйОписаниеНоменклатуры1СКлиент();
				
				РасширенныйФункционалСопоставления_ПроверкаЕдиницВСтаромСопоставлении(ДанныеНоменклатуры, ИмяРеквизитаЕдиницыИзмерения);
				ВходящиеДанные = Новый Структура("Источник", ДанныеНоменклатуры.Единица);
				
				СтруктураЕдиницы = МодульОбъектаКлиент().НовыйСопоставлениеДляЕдиницыКлиент(ВходящиеДанные, ДопПараметрыЕдиницы);
				МодульОбъектаКлиент().СопоставлениеДляЕдиницыКлиент_Вставить(СтруктураЕдиницы, "Владелец", ДанныеНоменклатуры.Номенклатура);
				МодульОбъектаКлиент().ОписаниеНоменклатуры1СКлиент_Вставить(ОписаниеНоменклатуры1С, "Единица", СтруктураЕдиницы);
				
				Если ДанныеНоменклатуры.Свойство("Характеристика") И ЗначениеЗаполнено(ДанныеНоменклатуры.Характеристика) Тогда
					Характеристики = Новый Массив; 
					Характеристики.Добавить(ДанныеНоменклатуры.Характеристика);
					МодульОбъектаКлиент().ОписаниеНоменклатуры1СКлиент_Вставить(ОписаниеНоменклатуры1С, "Характеристики", Характеристики);	
				КонецЕсли;	
					
				Если НЕ ОсновнаяНоменклатураНайдена Тогда
					МодульОбъектаКлиент().ОписаниеНоменклатуры1СКлиент_Вставить(ОписаниеНоменклатуры1С, "Основное", Истина);
					ОсновнаяНоменклатураНайдена = Истина;
				КонецЕсли;
				
				КлассСопоставления.Номенклатура1С.Вставить(ДанныеНоменклатуры.Номенклатура, ОписаниеНоменклатуры1С);	
				МодульОбъектаКлиент().СтрокаСопоставленияСБИСКлиент_Вставить(КлассСопоставления, "НеобходимоАвтоматическоеСопоставление", Ложь);
				МодульОбъектаКлиент().СтрокаСопоставленияСБИСКлиент_Вставить(КлассСопоставления, "НеобходимоСопоставление", Истина);
				
			КонецЕсли;
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РасширенныйФункционалСопоставления_ПроверкаЕдиницВСтаромСопоставлении(ДанныеНоменклатуры, ИмяРеквизитаЕдиницыИзмерения)
	
	Если ДанныеНоменклатуры.Свойство("ЕдИзмОрг")
			И ЗначениеЗаполнено(ДанныеНоменклатуры.ЕдИзмОрг) Тогда
			ДанныеНоменклатуры.Вставить("Единица", ДанныеНоменклатуры.ЕдИзмОрг);  
	ИначеЕсли ДанныеНоменклатуры.Свойство("ЕдиницаИзмерения")
		И НЕ ЗначениеЗаполнено(ДанныеНоменклатуры.ЕдиницаИзмерения) Тогда
		ДанныеНоменклатуры.Вставить("Единица", ДанныеНоменклатуры.Номенклатура[ИмяРеквизитаЕдиницыИзмерения]);
	КонецЕсли;
	
КонецПроцедуры

