
////////////////////////////////////////////////////
////////////////Загрузка документов/////////////////
////////////////////////////////////////////////////

&НаКлиенте
Функция ПолучитьОрганизациюВложения(Кэш, Вложение, СтрОрганизации)	
	Возврат ?(ЗначениеЗаполнено(СтрОрганизации), НайтиОрганизациюИзДокументаСБИС(Кэш.Ини.Конфигурация, СтрОрганизации), Неопределено);
КонецФункции

&НаКлиенте
Функция ПолучитьКонтрагентаВложения(Кэш, Вложение, СтрКонтрагента)
	
	Если ЗначениеЗаполнено(СтрКонтрагента) Тогда
		Возврат НайтиКонтрагентаИзДокументаСБИС(Кэш.Ини.Конфигурация, СтрКонтрагента, Вложение.СтруктураИниФайла);    
	Иначе
		Возврат Ложь; 
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСторонуВложения(Кэш, Вложение, СтрСтороны, ТипСБИС)
	
	Если ТипСБИС = "НашаОрганизация" Тогда
		Возврат ПолучитьОрганизациюВложения(Кэш, Вложение, СтрСтороны);
	ИначеЕсли ТипСБИС = "Контрагент" Тогда
		Возврат ПолучитьКонтрагентаВложения(Кэш, Вложение, СтрСтороны);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

//Вынесено в отдельную функцию, общую для просмотра и массовой загрузки.
&НаКлиенте
Функция ЗаполнитьДанныеДляЗагрузкиПоУмолчанию(Кэш, СоставПакета, Вложение, ДополнительныеПараметры=Неопределено) Экспорт     	
	Перем СтруктураИниФайла, СтруктураФайла;
	
	Результат = Новый Структура("МожемЗагрузитьВ1С, Статус", 0,"");
	ГлавноеОкно = Кэш.ГлавноеОкно;
	
	//Определяем первоначальные данные вложения
	СтруктураИниФайла = Неопределено;
	СтруктураФайла = Неопределено;
	Если	Не Вложение.Свойство("Направление")
		Или	Не Вложение.Свойство("СтруктураИниФайла",СтруктураИниФайла)
		Или Не Вложение.Свойство("СтруктураФайла",СтруктураФайла) Тогда
		Возврат Результат;
	ИначеЕсли Не ЗначениеЗаполнено(СтруктураИниФайла) Тогда
		Возврат Результат;
	КонецЕсли;
	
	СтатусВложения = МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "Статус");
	Если СтатусВложения = "Ошибка" Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	ВходящиеПараметры = Новый Структура("ПараметрыЗаполнить, СоставПакета", Результат, СоставПакета);
	
	Попытка
		
		МодульОбъектаКлиент().ВложениеСБИС_Заполнить(Вложение, ВходящиеПараметры, "СопоставлениеНоменклатуры");
		
	Исключение
		
		СбисИсключение = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "ОбщиеФункции.ЗаполнитьДанныеДляЗагрузкиПоУмолчанию");
		МодульОбъектаКлиент().СбисСообщить(СбисИсключение, Новый Структура("СтатусСообщения, Отложенно", "warning", Истина));
		Возврат Результат;
		
	КонецПопытки;

	ПараметрыПоВложению = МодульОбъектаКлиент().ВложениеСБИС_МожемЗагрузитьВ1С(Вложение);
	
	Результат.МожемЗагрузитьВ1С	= ПараметрыПоВложению.МожноЗагрузить;
	Результат.Статус			= ПараметрыПоВложению.Статус;
	
	Если Результат.МожемЗагрузитьВ1С Тогда
		
		// Проблемы по номенклатуре определяются опцией
		ПараметрыПоВложению.Проблемы.Удалить("Номенклатура");
		Результат.МожемЗагрузитьВ1С = Не ПараметрыПоВложению.Проблемы.Количество();
		
	КонецЕсли;
	
	ДанныеСтруктурыФайла	= МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "ДанныеСтруктурыФайла");
    Поля1С					= МодульОбъектаКлиент().ВложениеСбис_Получить(Вложение, "Поля1С");

	Результат.Вставить("ПутьОрганизации",				ДанныеСтруктурыФайла.Синонимы.Получить("Организация_ПутьКДанным"));
	Результат.Вставить("ПутьКонтрагента",				ДанныеСтруктурыФайла.Синонимы.Получить("Контрагент_ПутьКДанным"));
	Результат.Вставить("ОрганизацияВложения",			Поля1С.Организация.Значение);
	Результат.Вставить("КонтрагентВложения",			Поля1С.Контрагент.Значение);
	Результат.Вставить("ЕстьВходящиеВложения",			Истина);
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЗаполнитьДанныеДляЗагрузкиПоУмолчанию_ТаблДок(Вложение, ДопПараметры) Экспорт     	
	
	МодульТекущий = МодульОбъектаКлиент();
	
	Попытка
		КонтрагентДляСопоставления	= МодульТекущий.ВложениеСбис_Получить(Вложение, "СторонаПоРоли", "СопоставлениеНоменклатуры");
	Исключение
		СбисИсключение = МодульТекущий.НовыйСбисИсключение(ИнформацияОбОшибке(), "ОбщиеФункции.ЗаполнитьДанныеДляЗагрузкиПоУмолчанию");
		ВызватьИсключение МодульТекущий.СбисИсключение_ВСтроку(СбисИсключение);
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(КонтрагентДляСопоставления) Тогда
		
		СбисИсключение = МодульТекущий.НовыйСбисИсключение(779, "ОбщиеФункции.ЗаполнитьДанныеДляЗагрузкиПоУмолчанию",,,"Не найден контрагент для сопоставления.");
		ВызватьИсключение МодульТекущий.СбисИсключение_ВСтроку(СбисИсключение);
		
	КонецЕсли;
		
	Кэш				= МодульТекущий.ПолучитьТекущийЛокальныйКэш();
	СоставПакета	= ДопПараметры.СоставПакета;

	СтруктураФайла			= МодульТекущий.ВложениеСБИС_Получить(Вложение, "СтруктураФайла");
	ДанныеСтруктурыФайла	= МодульТекущий.ВложениеСБИС_Получить(Вложение, "ДанныеСтруктурыФайла");
	ПараметрыНоменклатуры	= МодульТекущий.ВложениеСбис_Получить(Вложение, "ПараметрыНоменклатуры");
	ПутьТаблДок				= ДанныеСтруктурыФайла.Синонимы.Получить("ТабличнаяЧасть_ПутьКДанным");
	ТаблДок					= ДанныеСтруктурыФайла.Поля.Получить("ТабличнаяЧасть");
	
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("НайтиНоменклатуруПоставщика",Кэш.ФормаРаботыСНоменклатурой,"", Кэш);
	Попытка
		фрм.МестныйКэш	= Кэш;
	Исключение
		//Это старая пользовательская функция. По-хорошему, надо добавить туда переменную МестныйКэш
	КонецПопытки;
	
	НашаНоменклатура = РассчитатьЗначение("НашаНоменклатура", Вложение.СтруктураИниФайла, Кэш);
	
	//ТаблДок = РассчитатьЗначениеИзСтруктуры(ПутьТаблДок, СтруктураФайла);
	Если ЗначениеЗаполнено(ТаблДок) Тогда
		Попытка
			
			Если НЕ ((МодульТекущий.ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры")
						ИЛИ МодульТекущий.ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры4100"))
					И МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ИспользоватьНовоеСопоставлениеНоменклатуры")) Тогда
				
				стрТаблДок = фрм.НайтиНоменклатуруПоставщикаПоТабличнойЧасти(КонтрагентДляСопоставления, ТаблДок, Кэш.Парам.КаталогНастроек, Кэш.Ини);     
				
			Иначе
				
				СтрТаблДок = Новый Структура;
				
			КонецЕсли;
		Исключение
			
			СбисИсключение	= МодульТекущий.НовыйСбисИсключение(ИнформацияОбОшибке(), "ОбщиеФункции.ЗаполнитьДанныеДляЗагрузкиПоУмолчанию_ТаблДок");
			ВызватьИсключение МодульТекущий.СбисИсключение_ВСтроку(СбисИсключение);
			
		КонецПопытки;
		
		счСтр			= -1;
		ВсёСопоставлено	= Истина;
		ОшибокПодряд	= 0;
		ОшибкаБыла		= Неопределено;
		Для Каждого СтрТабл Из ТаблДок Цикл
			счСтр				= счСтр + 1;
			ДанныеНоменклатуры	= Неопределено;
			
			Если ТаблДок[счСтр].Свойство("НеЗагружать") Тогда
				Продолжить;
			КонецЕсли;
			
			Если стрТаблДок.Количество() Тогда
				
				ДанныеНоменклатуры = стрТаблДок["СтрТабл_" + Формат(счСтр, "ЧН=0; ЧГ=0")].НоменклатураПоставщика;
				
			Иначе
				Попытка   
					Если НЕ ((МодульТекущий.ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры")
								ИЛИ МодульТекущий.ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры4100"))
							И МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ИспользоватьНовоеСопоставлениеНоменклатуры")) Тогда
						ДанныеНоменклатуры	= фрм.НайтиНоменклатуруПоставщика(КонтрагентДляСопоставления, СтрТабл, Кэш.Парам.КаталогНастроек, Кэш.Ини);
						ОшибкаБыла			= Неопределено;   
					КонецЕсли;
				Исключение
					СообщениеИсключение = "Ошибка обработки сопоставления в строке " + (счСтр + 1);
					СбисИсключение = МодульТекущий.НовыйСбисИсключение(ИнформацияОбОшибке(), "ОбщиеФункции.ЗаполнитьДанныеДляЗагрузкиПоУмолчанию",, СообщениеИсключение);
					МодульТекущий.СообщитьСбисИсключение(СбисИсключение, Новый Структура("СтатусСообщения", "message"));
					
					Если ОшибкаБыла = Неопределено Тогда
						
						ОшибкаБыла		= СбисИсключение;
						ОшибокПодряд	= 1;
						
					ИначеЕсли СбисИсключение.details = ОшибкаБыла.details Тогда
						
						ОшибокПодряд = ОшибокПодряд + 1;
						
					КонецЕсли;
				КонецПопытки;
				
				Если ОшибокПодряд > 5 Тогда
					
					ТекстПрервать = "Получен ряд однотипных ошибок подряд. Поиск сопоставления прерван.";
					СбисИсключение = МодульТекущий.НовыйСбисИсключение(776, "ОбщиеФункции.ЗаполнитьДанныеДляЗагрузкиПоУмолчанию",, ТекстПрервать, ОшибкаБыла.details);
					ВызватьИсключение МодульТекущий.СбисИсключение_ВСтроку(СбисИсключение);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ДанныеНоменклатуры) И ЗначениеЗаполнено(НашаНоменклатура) Тогда//UAA убрано условие на наличие свойства НашаНоменклатура по ошибке 1177970522.
				ДанныеНоменклатуры = сбисПолучитьФорму("Документ_Шаблон").РассчитатьЗначение(Вложение.СтруктураИниФайла.НашаНоменклатура.Вычислить,Новый Структура("Ини, Документ, СтрТабл, Переменные, СтруктураФайла, СтрокаФайла", Вложение.СтруктураИниФайла, , , , СтруктураФайла, СтрТабл),Кэш);
			КонецЕсли;
			
			СтрокаНоменклатуры = ТаблДок[счСтр];
			Если ЗначениеЗаполнено(ДанныеНоменклатуры) Тогда
				Если Не ЗначениеЗаполнено(ДанныеНоменклатуры.Номенклатура) Тогда
					ВсёСопоставлено = Ложь;
				КонецЕсли;
				СтрокаНоменклатуры.Вставить("Номенклатура", ДанныеНоменклатуры.Номенклатура);
				Если ЗначениеЗаполнено(ДанныеНоменклатуры.Характеристика) Тогда
					СтрокаНоменклатуры.Вставить("ХарактеристикаНоменклатуры", ДанныеНоменклатуры.Характеристика);
				КонецЕсли;
				Если    ДанныеНоменклатуры.Свойство("ЕдИзмОрг")
					И	ЗначениеЗаполнено(ДанныеНоменклатуры.ЕдИзмОрг) Тогда
					СтрокаНоменклатуры.Вставить("ЕдИзмОрг", ДанныеНоменклатуры.ЕдИзмОрг);
				КонецЕсли;
				Если	ДанныеНоменклатуры.Свойство("Коэффициент")
					И	ЗначениеЗаполнено(ДанныеНоменклатуры.Коэффициент) Тогда
					СтрокаНоменклатуры.Вставить("Коэффициент", ДанныеНоменклатуры.Коэффициент);
				КонецЕсли;
			Иначе
				
				СтрокаНоменклатуры.Вставить("Номенклатура", Неопределено);
				Если СтрокаНоменклатуры.Свойство("ХарактеристикаНоменклатуры") Тогда
					СтрокаНоменклатуры.ХарактеристикаНоменклатуры = Неопределено;
				КонецЕсли;
				ВсёСопоставлено = Ложь;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ПараметрыНоменклатуры.Сопоставлено = ВсёСопоставлено;
			
	КонецЕсли;
	
	Возврат ТаблДок;

КонецФункции

//Функции с формы просмотра документов. Вынесены для использования в алгоритмах массовой загрузки.
&НаКлиенте
Функция СоздатьПерезаполнитьДокументы(Кэш, СоставПакета, СписокВложений, ПараметрыВходящие, ДополнительныеПараметры) Экспорт
	
	//Режим -1	Документ не указан/не найден, режим не выбран
	//Режим 0	Перезаполнить
	//Режим 1	Создать новые
	//Режим 2	Отменить
	//Режим 3	Загружать ещё не загруженные
	КодРежимДокумента = ПараметрыВходящие.РежимДокументов;
	Если КодРежимДокумента = 2 Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;	
	
	Если КодРежимДокумента = -1 Тогда
		
		ПараметрыВходящие.РежимДокументов = 1;
		КодРежимДокумента = 1;
		
	КонецЕсли;
	
	//Режим -1	Номенклатура сопоставлена, режим не выбран
	//Режим 0	Документ не загружается, если нет сопоставления
	//Режим 1	Для несопоставленных позиций создавать карточки номенклатуры и контрагента
	//Режим 2	В табличную часть загружать только сопоставленную номенклатуру
	//режим 3	Для несопоставленной номенклатуры в табличной части не заполнять поле Номенклатура
	КодРежимаНоменклатуры	= ПараметрыВходящие.РежимНоменклатуры;
	Если КодРежимаНоменклатуры = -1 Тогда
		
		ПараметрыВходящие.РежимНоменклатуры = 0;
		КодРежимаНоменклатуры = 0;
		
	КонецЕсли;	
	//Берем как результат созданный объект РезультатДействия и возвращаем его везде, где можно. 
	//Его можно взять в любом другом месте из Кэш.РезультатДействия, но для нормальной проброски результата выше, сделаю ещё возвратом.
	Результат				= Кэш.РезультатДействия;
	ГлавноеОкно				= Кэш.ГлавноеОкно;
	ФормаВызова				= Результат.Параметры.ФормаВызова;
	СоздаемНовый			= КодРежимДокумента = 1;
	
	СписокВесов				= Новый СписокЗначений;
	НоменклатураСопоставлена= Истина;
	СтатусНеПоддерживается	= "Загрузка документа не поддерживается.";
	
	РезультатДетализация					= Новый Структура("Отказ, Строки, ГлобальнаяОшибка", Ложь);
	РезультатДетализация.Строки				= Новый Структура("Выполнено, НеВыполнено, Ошибки", Новый Соответствие, Новый Соответствие, Новый Соответствие);
	РезультатДетализация.ГлобальнаяОшибка	= Новый Структура("Вложение, Текст"); 	
	
	Для каждого СтрокаТаблДок из СписокВложений Цикл
		ОшибкаЗаполненияНоменклатуры = Ложь;
		Вложение = СтрокаТаблДок.Вложение[0].Значение;
		

		СтрокаРезультат = РезультатДействия_СформироватьСтрокуДетализации(Кэш, "Загрузка");
		СтрокаРезультат.ИдентификаторПакета		= СоставПакета.Идентификатор;
		СтрокаРезультат.ИдентификаторВложения	= Вложение.Идентификатор;
		СтрокаРезультат.Название				= Вложение.Название;
		//СтрокаРезультат = Новый Структура(	"ИдентификаторПакета, 		ИдентификаторВложения,	Номенклатура,Документы1С,Название,ОбработанДокумент1С,СостояниеДокумента,Сообщение", 
		//СоставПакета.Идентификатор,	Вложение.Идентификатор,	Новый Массив);
		
		//Возможные состояния документа в результате:
		//Выполнено:	"Обработан." - вложение было обработано и по нему созданы/перезаполнены, либо были найдены существующие документы/справочники. 
		//				Так, как по одному вложению может быть создано более одного документа, то подробнее смотреть в расшифровке обработанных объектов 1С:
		//					"Создан." - успешно создан новый документ 1С
		//					"Перезаполнен." - выбран режим 0, документ уже был создан и успешно перезаполнен
		//					"Найден." - такой документ есть
		//НеВыполнено:	"Загрузка документа не поддерживается." - отсутствует ини для загрузки
		//				"Документ уже загружен." - установлен режим 3, документ существует и не обрабатывается
		//				"Ошибки в связанном документе." при загрузке пакета в одном из документов были ошибки. Пакет не загружаем, а все документы, кроме того что с ошибкой попадают в этот раздел.
		//Ошибки:		"Не вся номенклатура сопоставлена."
		//				"Не найден контрагент."
		//				"Ошибка поиска номенклатуры."
		//				"Ошибка автоматического сопоставления/создания номенклатуры." - режим номенклатуры 0, при попытке создать новую карточку возникли проблемы.
		//				"Ошибка записи документа." - в процессе записи нового документа, либо заполнения возникли проблемы.
		//				Так же тут идет составной статус документа после заполнения данных по-умолчанию, например "Не вся номенклатура сопоставлена. Не найдена организация. Не найден контрагент."
		
		Пропускаем = Ложь;
		Если РезультатДетализация.Отказ Тогда
			//При ошибке в одном из докумтов, чтобы не тратить лишних действий на проверку оставшихся, сразу объявляем их пропущенными, так как пакет всё равно не грузим.
			СтрокаРезультат.Состояние = "Ошибки в связанном документе.";
			Пропускаем = Истина;
		ИначеЕсли СтрокаТаблДок.МожемЗагрузитьВ1С <=0 Тогда 
			//Если не можем загрузить в 1С, то по ключевому слову проверим, что это не ошибка отсутствия организации, либо контрагента.
			Если Найти(СтрокаТаблДок.Статус," Не найден") Тогда
				СтрокаРезультат.Состояние = СтрокаТаблДок.Статус;
				СтрокаРезультат.Сообщение = СтрокаТаблДок.Статус + ?(Не ФормаВызова="ФормаПросмотрДокумента", " Откройте карточку документа для исправления.", "");
				РезультатДетализация.ГлобальнаяОшибка.Текст = СтрокаТаблДок.Статус;
				РезультатДетализация.ГлобальнаяОшибка.Вложение = Вложение;
				РезультатДетализация.Отказ = Истина;
				РезультатДетализация.Строки.Ошибки.Вставить(Вложение.Идентификатор, СтрокаРезультат);
				Продолжить;
				//На вложение нет ИНИшки для загрузки то ничего не делаем
			ИначеЕсли ЗначениеЗаполнено(СтрокаТаблДок.Статус) Тогда 
				СтрокаРезультат.Состояние = СтрокаТаблДок.Статус;
			Иначе
				СтрокаРезультат.Состояние = СтатусНеПоддерживается;
			КонецЕсли;
			Пропускаем = Истина;
		ИначеЕсли 	КодРежимДокумента = 3
			И	ЗначениеЗаполнено(Вложение.Документы1С) Тогда
			СтрокаРезультат.Состояние = "Документ уже загружен.";
			СтрокаРезультат.Сообщение = "Документ " + СтрокаРезультат.Название + " уже загружен.";
			Пропускаем = Истина;
		ИначеЕсли	КодРежимаНоменклатуры = 0//Прерываем формирование пакета, если у какого-нибудь вложения уже не сопоставлена номенклатура, и выбран соответствующий режим.
			И	Найти(СтрокаТаблДок.Статус, "Не вся номенклатура сопоставлена.") Тогда
			СтрокаРезультат.Состояние = "Не вся номенклатура сопоставлена.";
			СтрокаРезультат.Сообщение = СтрокаТаблДок.Статус + ?(Не ФормаВызова="ФормаПросмотрДокумента", " Для сопоставления откройте карточку документа.", "");
			РезультатДетализация.ГлобальнаяОшибка.Текст = "Не вся номенклатура сопоставлена.";
			РезультатДетализация.ГлобальнаяОшибка.Вложение = Вложение;
			РезультатДетализация.Отказ = Истина;
			РезультатДетализация.Строки.Ошибки.Вставить(Вложение.Идентификатор, СтрокаРезультат);
			Продолжить;
		КонецЕсли;
		Если Пропускаем Тогда
			РезультатДетализация.Строки.НеВыполнено.Вставить(Вложение.Идентификатор, СтрокаРезультат);
			Продолжить;
		КонецЕсли;
		
		//Если нет контрагента и работаем в режиме автоматического создания карточек номенклатуры
		Если	КодРежимаНоменклатуры = 1
			И	Найти(СтрокаТаблДок.Статус," Не найден контрагент.") Тогда 
			Если Кэш.ТихийРежим Тогда
				СтрокаТаблДок.МожемЗагрузитьВ1С		= Ложь;
				СтрокаРезультат.Состояние = "Не заполнен контрагент.";
				СтрокаРезультат.Сообщение = "Отсутствует контрагент для автоматического сопоставления и загрузки номенклатуры.";
				РезультатДетализация.ГлобальнаяОшибка.Текст = СтрокаРезультат.Сообщение;
				РезультатДетализация.ГлобальнаяОшибка.Вложение = Вложение;
				РезультатДетализация.Отказ = Истина;
				РезультатДетализация.Строки.Ошибки.Вставить(Вложение.Идентификатор, СтрокаРезультат);
				Продолжить;
			КонецЕсли;
			СтрокаПоУмолчанию = ?(ДополнительныеПараметры.Свойство("СтрокаПоУмолчанию"), ДополнительныеПараметры.СтрокаПоУмолчанию, СтрокаТаблДок); 
			фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ЗаполнитьИзФайла","ФормаСозданияКонтрагента",,Кэш); 
			фрм.ЗаполнитьИзФайла(СтрокаПоУмолчанию, СоставПакета, Кэш); // alo загрузка из 3,03
		КонецЕсли;	
		
		// UPD 13.05.2024 Если заходим в первое условие, значит у нас работает новый функционал сопоставления номенклатуры и мы подменяем ТаблДок по данным КлассаСопоставления (см. МодульОбъектаСервер_Классы_СопоставлениеНоменклатуры) (с)Сычев
		//
		// Если заходим в условие, то значит с номенклатурой не всё в порядке и необходимо выполнить ряд действий для загрузки документа в зависимости от выбранного способа.
		// Тогда в строке результата будут записи с описанием того, что было проделано с номенклатурой.
		// Если не заходим, то в номенклатуре будет пусто и это значит, что ориентироваться надо на детализацию ошибок, если с номенклатурой что-то пошло не так.
		
		ПараметрыНоменклатуры	= МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "ПараметрыНоменклатуры");
		Если (МодульОбъектаКлиент().ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры")
				ИЛИ  МодульОбъектаКлиент().ПолучитьЗначениеФичи("РасширенныйФункционалСопоставленияНоменклатуры4100"))
			И МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ИспользоватьНовоеСопоставлениеНоменклатуры")
			И НЕ Найти(СтрокаТаблДок.Статус,"Сопоставление не требуется.") Тогда // TO DO Ду-ду (с)Сыч
			
			ПараметрыПодготовкиНоменклатуры = Новый Структура;
			ПараметрыПодготовкиНоменклатуры.Вставить("ВложениеСБИС", Вложение);
			ПараметрыПодготовкиНоменклатуры.Вставить("РежимЗагрузкиНоменклатуры", КодРежимаНоменклатуры);
			ПараметрыПодготовкиНоменклатуры.Вставить("СоставПакета", СоставПакета);
			ПараметрыПодготовкиНоменклатуры.Вставить("НоменклатураСБИС", Неопределено); 
			ПараметрыПодготовкиНоменклатуры.Вставить("МассоваяЗагрузка", Истина);
			
			РезультатСопоставления = МодульОбъектаКлиент().РасширенноеСопоставление_ПодготовитьНоменклатурыКЗагрузкеВ1С(ПараметрыПодготовкиНоменклатуры);
			
			ДопПараметры = Новый Структура("ПересчетПоДокументуОснованию", Ложь);
			ВыгруженныеСопоставления = МодульОбъектаКлиент().ВложениеСБИС_Выгрузить(Вложение, "ТабличнаяЧасть", ДопПараметры);	
			Если НЕ ВыгруженныеСопоставления = Неопределено И НЕ Вложение.Свойство("ТаблДокОригинал") Тогда 	
				Вложение.Вставить("ТаблДокОригинал", Вложение.ТаблДок);
            	Вложение.Вставить("ТаблДок", ВыгруженныеСопоставления);                              
			ИначеЕсли НЕ ВыгруженныеСопоставления = Неопределено Тогда
				Вложение.Вставить("ТаблДок", ВыгруженныеСопоставления);
			Иначе
				Вложение.Вставить("ТаблДок", Вложение.ТаблДокОригинал);
			КонецЕсли;			
			
		ИначеЕсли		ПараметрыНоменклатуры.НадоСопоставлять
				И	Не	ПараметрыНоменклатуры.Сопоставлено Тогда
			
			ПараметрыЗаполнения = Новый Структура;
			ПараметрыЗаполнения.Вставить("фрмСозданияНоменклатуры",	ГлавноеОкно.сбисНайтиФормуФункции("СоздатьНоменклатуруПоДаннымПоставщика","РаботаСДокументами1С","", Кэш));
			ПараметрыЗаполнения.Вставить("фрмНоменклатуры",			ГлавноеОкно.сбисНайтиФормуФункции("НайтиНоменклатуруПоставщика",Кэш.ФормаРаботыСНоменклатурой,"", Кэш));
			ПараметрыЗаполнения.Вставить("ПараметрыРезультат",		Результат.Параметры);
			ПараметрыЗаполнения.Вставить("СтрКонтрагента",			Вложение.ДанныеСтруктурыФайла.Поля.Получить("Сопоставление"));
			ПараметрыЗаполнения.Вставить("Вложение",				Вложение);
			ПараметрыЗаполнения.Вставить("РежимНоменклатуры",		КодРежимаНоменклатуры);
			ПараметрыЗаполнения.Вставить("НашаНоменклатура",		РассчитатьЗначение("НашаНоменклатура", Вложение.СтруктураИниФайла, Кэш));
			ПараметрыЗаполнения.Вставить("ДанныеНоменклатуры",		Неопределено);
			ПараметрыЗаполнения.Вставить("СтрокаДетализации",		СтрокаРезультат);
			
			// Берем ТаблДок от вложения
			ДанныеФайла	= МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "ДанныеСтруктурыФайла");
			ТаблДок		= ДанныеФайла.Поля.Получить("ТабличнаяЧасть");

			Если НЕ ЗначениеЗаполнено(ТаблДок) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Попытка
				стрТаблДок = ПараметрыЗаполнения.фрмНоменклатуры.НайтиНоменклатуруПоставщикаПоТабличнойЧасти(ПараметрыЗаполнения.СтрКонтрагента, ТаблДок, Кэш.Парам.КаталогНастроек, Кэш.Ини);
			Исключение
				//Тут пробрасываем ошибку, не формируя документ, так как упало в исключение.
				ОшибкаСопоставления = МодульОбъектаКлиент().НовыйСбисИсключение(ИнформацияОбОшибке(), "РаботаСДокументами1С.НайтиНоменклатуруПоставщикаПоТабличнойЧасти");
				СтрокаРезультат.Состояние = "Ошибка поиска номенклатуры.";
				СтрокаРезультат.Сообщение = ОшибкаСопоставления.details;
				РезультатДетализация.ГлобальнаяОшибка.Текст		= СтрокаРезультат.Сообщение;
				РезультатДетализация.ГлобальнаяОшибка.Вложение	= Вложение;
				РезультатДетализация.Отказ = Истина;
				РезультатДетализация.Строки.Ошибки.Вставить(Вложение.Идентификатор, СтрокаРезультат);
				Продолжить;
			КонецПопытки;
			
			//Так передаем данные детализации и информации об ошибке в функцию создания номенклатуры. Ниже что не заполнилось, заполняем тем, что есть.
			ДанныеДозаполнить = Новый Структура("СтрокаДетализации, ЗаполнитьДетализацию, Отказ", СтрокаРезультат, Истина, Ложь);
			Результат.Вставить("ВременныеДанные", ДанныеДозаполнить);
			Для СчСтр = 0 По ТаблДок.Количество()-1 Цикл
				СтрТабл = ТаблДок[СчСтр];
				Если стрТаблДок.Свойство("СтрТабл_"+Формат(СчСтр, "ЧН=0; ЧГ=0"),ПараметрыЗаполнения.ДанныеНоменклатуры) Тогда//AU берём предварительно найденные данные					
					ПараметрыЗаполнения.ДанныеНоменклатуры = ПараметрыЗаполнения.ДанныеНоменклатуры.НоменклатураПоставщика;			
				КонецЕсли;
				СтрокаНоменклатуры = ЗаполнитьСопоставитьНоменклатуру(Кэш, СтрТабл, ПараметрыЗаполнения, ОшибкаЗаполненияНоменклатуры);
				
				//Здесь считаем это ошибкой, так как номенклатура должна была создаться
				Если	ОшибкаЗаполненияНоменклатуры Тогда 
					СтрокаРезультат.Состояние = "Ошибка автоматического сопоставления/создания номенклатуры.";
					Если ДанныеДозаполнить.Отказ Тогда
						//СтрокаРезультат.Сообщение = "Автоматическое создание номенклатуры не поддерживается для текущей конфигурации.";
					Иначе //Если в переданных данных не проставился отказ, значит в стандартный метод создания не заходили, а значит надо проставить сообщение из того, что вернулось.
						СтрокаРезультат.Сообщение = СтрокаНоменклатуры.ТекстОшибки;
					КонецЕсли;
					РезультатДетализация.ГлобальнаяОшибка.Текст		= " при автоматическом сопоставление и создании номенклатуры возникла ошибка: " + СтрокаРезультат.Сообщение;
					РезультатДетализация.ГлобальнаяОшибка.Вложение	= Вложение;
					РезультатДетализация.Отказ = Истина;
					РезультатДетализация.Строки.Ошибки.Вставить(Вложение.Идентификатор, СтрокаРезультат);
					Прервать;
				КонецЕсли;
				СтрТабл.Вставить("Номенклатура", СтрокаНоменклатуры.Номенклатура);
				Если СтрокаНоменклатуры.НеЗагружать Тогда
					СтрТабл.Вставить("НеЗагружать", СтрокаНоменклатуры.НеЗагружать);
				КонецЕсли;
				Если СтрокаНоменклатуры.Свойство("ХарактеристикаНоменклатуры") Тогда
					СтрТабл.Вставить("ХарактеристикаНоменклатуры", СтрокаНоменклатуры.ХарактеристикаНоменклатуры);
				КонецЕсли;
				ТаблДок[СчСтр] = СтрТабл;
			КонецЦикла;
			Результат.Удалить("ВременныеДанные");
			
			Если ОшибкаЗаполненияНоменклатуры Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Вес = Кэш.ГлавноеОкно.сбисПолучитьФорму("Документ_Шаблон").РассчитатьЗначение("Вес",Новый Структура("Ини", Вложение.СтруктураИниФайла), Кэш);
		Попытка
			Вес = Число(Вес);
		Исключение
			Вес = 0;
		КонецПопытки;
		Если СписокВесов.НайтиПоЗначению(Вес)=Неопределено Тогда
			СписокВесов.Добавить(Вес);
		КонецЕсли;
		Вложение.Вставить("Вес", Вес);
		Вложение.Вставить("ТипДокумента", сбисСообщитьИмяРеквизита(РассчитатьЗначение("Документ", Вложение.СтруктураИниФайла, Кэш)));	
		РезультатДетализация.Строки.Выполнено.Вставить(Вложение.Идентификатор, СтрокаРезультат);
	КонецЦикла;
	
	сбисПараметрыСчетчика	= Новый Структура;
	СообщениеВоВложения		= "";
	Если РезультатДетализация.Отказ Тогда
		//Если были ошибки, не дающие загрузить пакет целиком, то все вложения, которые могли бы загрузить добавляем в детализацию как не выполненные.
		СообщениеВоВложения = "В " + РезультатДетализация.ГлобальнаяОшибка.Вложение.Название + " " + РезультатДетализация.ГлобальнаяОшибка.Текст;
		Для Каждого КлючИЗначение Из РезультатДетализация.Строки.Ошибки Цикл
			СтрокаРезультат = КлючИЗначение.Значение;
			ОшибкаИтог = МодульОбъектаКлиент().НовыйСбисИсключение(773, "ОбщиеФункции.СоздатьПерезаполнитьДокументы",,СтрокаРезультат.Состояние, СтрокаРезультат.Сообщение);
			РезультатДействия_ДобавитьОшибку(Кэш, Результат, СтрокаРезультат, ОшибкаИтог, Новый Структура("ТипОшибки", "Подготовка"));
		КонецЦикла;
		Для Каждого КлючИЗначение Из РезультатДетализация.Строки.Выполнено Цикл
			СтрокаРезультат = КлючИЗначение.Значение;
			СтрокаРезультат.Сообщение = СообщениеВоВложения;
			СтрокаРезультат.Состояние = "Ошибки в связанном документе.";
			ПараметрыВыполнения = Новый Структура("Выполнено, КлючГруппировки, ПараметрыСчетчика", Ложь, СтрокаРезультат.Состояние, сбисПараметрыСчетчика);
			РезультатДействия_ДобавитьРезультат(Кэш, Результат, СтрокаРезультат, ПараметрыВыполнения);
		КонецЦикла;
		СписокВесов.Очистить();
	КонецЕсли;
	//Получим список документов к загрузке
	СписокВесов.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	УпорядоченныйСоставПакета = Новый Массив;
	Для Каждого Элемент Из СписокВесов Цикл
		Для каждого СтрокаТаблДок из СписокВложений Цикл
			Если СтрокаТаблДок.МожемЗагрузитьВ1С <=0 или СтрокаТаблДок.Отмечен = Ложь Тогда   
				Продолжить;
			КонецЕсли;
			Вложение = СтрокаТаблДок.Вложение[0].Значение;
			Если Вложение.Свойство("Вес") И Элемент.Значение = Вложение.Вес Тогда
				УпорядоченныйСоставПакета.Добавить(Вложение);	
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	//Не выполненые добавляем в детализацию. Считаем не выполненным весь пакет только если все вложения не загружаются.
	Для Каждого КлючИЗначение Из РезультатДетализация.Строки.НеВыполнено Цикл
		СтрокаРезультат = КлючИЗначение.Значение;
		Если	ПустаяСтрока(СтрокаРезультат.Сообщение)
			И	СтрокаРезультат.Состояние = "Ошибки в связанном документе." Тогда
			СтрокаРезультат.Сообщение = СообщениеВоВложения;
		КонецЕсли;
		ПараметрыВыполнения = Новый Структура("Выполнено, КлючГруппировки, ПараметрыСчетчика", Ложь, СтрокаРезультат.Состояние, сбисПараметрыСчетчика);
		//Если загрузка не поддерживается, не считаем это как не выполнено.
		//НО только если есть другие вложения к загрузке, оценка успешности/не удачи будет тогда проходить по ним.
		Если СтрокаРезультат.Состояние = СтатусНеПоддерживается Тогда
			ПараметрыВыполнения.Вставить("Считать", (Не УпорядоченныйСоставПакета.Количество()));
		КонецЕсли;
		РезультатДействия_ДобавитьРезультат(Кэш, Результат, СтрокаРезультат, ПараметрыВыполнения);
	КонецЦикла;
	
	Если Не РезультатДетализация.Количество() Тогда
		РезультатДетализация = Неопределено;
	КонецЕсли;
	
	ПараметрыЗагрузки = Новый Структура();
	ПараметрыЗагрузки.Вставить("Кэш",						Кэш);
	ПараметрыЗагрузки.Вставить("ДополнительныеПараметры",	ДополнительныеПараметры);
	ПараметрыЗагрузки.Вставить("СоздаемНовый",				СоздаемНовый);
	ПараметрыЗагрузки.Вставить("ПараметрыСчетчика",			сбисПараметрыСчетчика);
	ПараметрыЗагрузки.Вставить("УпорядоченныйСоставПакета",	УпорядоченныйСоставПакета);
	ПараметрыЗагрузки.Вставить("СоставПакета",				СоставПакета);
	ПараметрыЗагрузки.Вставить("ПараметрыДиалога",			ПараметрыВходящие);
	
	Возврат ЗагрузитьУпорядоченныйСоставПакета(РезультатДетализация, ПараметрыЗагрузки);
	
КонецФункции

&НаКлиенте
Функция ЗагрузитьУпорядоченныйСоставПакета(Результат, ПараметрыЗагрузки) 
	Перем Ответ, ДокументВнесенияИзменения;
	
	ДополнительныеПараметры = Неопределено;
	//Если в дополнительных параметрах указан обработчик результата(описание оповещения, куда надо попасть после не модального диалога), то передаём его дальше 
	Если	ПараметрыЗагрузки.Свойство("ДополнительныеПараметры", ДополнительныеПараметры) Тогда 
		
		Если ДополнительныеПараметры.Свойство("ОбработчикРезультата") Тогда
			
			ПараметрыЗагрузки.Вставить("ОбработчикРезультата", ДополнительныеПараметры.ОбработчикРезультата);
			
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("ВыполнитьОбработчик") Тогда
			
			ПараметрыЗагрузки.Вставить("ВыполнитьОбработчик", ДополнительныеПараметры.ВыполнитьОбработчик);
			
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("СохранитьСопоставление") Тогда
			
			ПараметрыЗагрузки.Вставить("СохранитьСопоставление", ДополнительныеПараметры.СохранитьСопоставление);
			
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("ИскатьДокумент1С") Тогда
			
			ПараметрыЗагрузки.Вставить("ИскатьДокумент1С", ДополнительныеПараметры.ИскатьДокумент1С);
			
		КонецЕсли;

		ПараметрыЗагрузки.Удалить("ДополнительныеПараметры");
		
	Иначе
		
		ДополнительныеПараметры = Новый Структура;
		
	КонецЕсли;
	
	//Дальше результат передаётся как параметр
	ПараметрыЗагрузки.Вставить("Результат", Результат);
																							
	Возврат ЗагрузитьУпорядоченныйСоставПакета_Обработать(ПараметрыЗагрузки);	
	
КонецФункции

// НЕ ИСПОЛЬЗОВАТЬ. Оставлено на случай ВФК.
// Функция - Загрузить упорядоченный состав пакета выбранным способом
//
// Параметры:
//  РезультатВопроса	 - Произвольный	 - Результат выбора способа загрузки пакета
//  ПараметрыЗагрузки	 - Структура	 - Парамтры для загрузки документа
// 
// Возвращаемое значение:
//  Структура - Итоги загрузки документа
//
&НаКлиенте
Функция ЗагрузитьУпорядоченныйСоставПакетаВыбраннымСпособом(РезультатВопроса, ПараметрыЗагрузки) Экспорт
	
	Если		РезультатВопроса = КодВозвратаДиалога.Нет
		Или		РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат Неопределено;
	КонецЕсли;         
	
	ПараметрыЗагрузки.ПараметрыДиалога.Вставить("ИзменениеВДокумента", РезультатВопроса);
	
	Возврат ЗагрузитьУпорядоченныйСоставПакета_Обработать(ПараметрыЗагрузки);
	
КонецФункции

// Функция - Загрузить упорядоченный состав пакета выбранным способом
//
// Параметры:
//  РезультатВопроса	 - Произвольный	 - Результат выбора способа загрузки пакета
//  ПараметрыЗагрузки	 - Структура	 - Парамтры для загрузки документа
// 
// Возвращаемое значение:
//  Структура - Итоги загрузки документа
//
&НаКлиенте
Функция ЗагрузитьУпорядоченныйСоставПакета_Обработать(ПараметрыЗагрузки)
	Перем ТекущийДокумент1С, СоздаемНовый;
	
	Кэш							= ПараметрыЗагрузки.Кэш;
	РезультатСоответствие		= ПараметрыЗагрузки.Результат;
	УпорядоченныйСоставПакета	= ПараметрыЗагрузки.УпорядоченныйСоставПакета;
	СоставПакета				= ПараметрыЗагрузки.СоставПакета;
	ПараметрыДиалога			= ПараметрыЗагрузки.ПараметрыДиалога;
	
	Результат					= Кэш.РезультатДействия;//Как результат идёт структура из Кэша. В его детализацию добрасываем либо выполненный результат, либо ошибку.

	ОшибкиЗагрузки = Ложь;
	МассивОснований = Новый Массив;
	сбисПараметрыСчетчика = ПараметрыЗагрузки.ПараметрыСчетчика;//Если уже упало на стадии подготовки, то весь результат был обработан и посчитан. Сюда приходим только для вызова ОбработчикРезультата
	
	Для Каждого Вложение Из УпорядоченныйСоставПакета Цикл 
		
		СтрокаРезультат		= РезультатСоответствие.Строки.Выполнено.Получить(Вложение.Идентификатор);
		ПараметрыВложения	= МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "Параметры");
		Поля1С				= МодульОбъектаКлиент().ВложениеСБИС_Получить(Вложение, "Поля1С");
		
		Если ПараметрыВложения.РедактироватьДокумент Тогда
			
			ТекущийДокумент1С	= Поля1С.Документ.Значение;
			СоздаемНовый		= Ложь;
			
		ИначеЕсли ПараметрыВложения.РедактироватьТабЧасть Тогда
			
			ТекущийДокумент1С	= Поля1С.Документ.Значение;
			СоздаемНовый		= Ложь;
			
			// Для актов расхождений не доступно массовое обновление, должен быть явно дан ответ на изменение с формы просмотра.
			// Документ при этом не создаем, а только меняем
			Если ЗначениеЗаполнено(ТекущийДокумент1С) Тогда
				
				Если	Не	(	ПараметрыДиалога.Свойство("ИзменениеВДокумент")
							И	(	ПараметрыДиалога.ИзменениеВДокумент	= КодВозвратаДиалога.Да
								Или ПараметрыДиалога.ИзменениеВДокумент	= КодВозвратаДиалога.ОК)
							) Тогда
					
					СтрокаРезультат.Состояние = "Пропущен";
					СтрокаРезультат.Сообщение = "Внесения изменения в документ " + ТекущийДокумент1С + " доступно только из карточки просмотра.";
					ПараметрыРезультата = Новый Структура("Выполнено, КлючГруппировки", Ложь, СтрокаРезультат.Состояние);
					РезультатДействия_ДобавитьРезультат(Кэш, Результат, СтрокаРезультат, ПараметрыРезультата); 
					Продолжить;
					
				КонецЕсли;
				
			Иначе
					
				// Не загружаем документ, если нет подходящего.
				СтрокаРезультат.Состояние = "Пропущен";
				СтрокаРезультат.Сообщение = "Внесения изменения " + Вложение.Название + " доступно только если подобран подходящий документ 1С.";
				ПараметрыРезультата = Новый Структура("Выполнено, КлючГруппировки", Ложь, СтрокаРезультат.Состояние);
				РезультатДействия_ДобавитьРезультат(Кэш, Результат, СтрокаРезультат, ПараметрыРезультата); 
				Продолжить;
				
			КонецЕсли;
			
		ИначеЕсли	ПараметрыЗагрузки.Свойство("СоздаемНовый", СоздаемНовый)
				И	СоздаемНовый Тогда
			
			// Занулить текущий документ под ручные правки, если было выбрано загружать, не смотря на наличие изменяего документа
			ТекущийДокумент1С			= Неопределено;
			Поля1С.Документ.Значение	= ТекущийДокумент1С;
				
		Иначе
			
			ТекущийДокумент1С	= Поля1С.Документ.Значение;
			СоздаемНовый		= Не ЗначениеЗаполнено(ТекущийДокумент1С);
				
		КонецЕсли;

		НаборМодулейСоздать = Новый Массив;
		НаборМодулейСоздать.Добавить(	"Документ_Шаблон");
		НаборМодулейСоздать.Вставить(0, "Документ_" + Вложение.ТипДокумента);
		
		Если Вложение.Свойство("ФорматДляЗагрузки") Тогда
			НаборМодулейСоздать.Вставить(0, "Файл_" + Вложение.ФорматДляЗагрузки + "_" + Вложение.ВерсияФорматаДляЗагрузки);
		КонецЕсли;        
		ФормаСозданияДокумента = МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("СоздатьДокумент", НаборМодулейСоздать);
						
		//Так передаем данные детализации и информации об ошибке в функцию создания документа. Ниже что не заполнилось, заполняем тем, что есть.
		ДанныеДозаполнить = Новый Структура("СтрокаДетализации, ЗаполнитьДетализацию, Отказ", СтрокаРезультат, Истина, Ложь);
		Если ПараметрыЗагрузки.Свойство("СохранитьСопоставление") Тогда
			ДанныеДозаполнить.Вставить("СохранитьСопоставление", ПараметрыЗагрузки.СохранитьСопоставление);
		КонецЕсли;
		Если ПараметрыЗагрузки.Свойство("ИскатьДокумент1С") Тогда
			ДанныеДозаполнить.Вставить("ИскатьДокумент1С", ПараметрыЗагрузки.ИскатьДокумент1С);
		КонецЕсли;
		Результат.Вставить("ВременныеДанные", ДанныеДозаполнить);           
		ТекущийДокумент1С = ?(Не СоздаемНовый, ТекущийДокумент1С, Неопределено);
		Документ1С = ФормаСозданияДокумента.СоздатьДокумент(Кэш, Вложение, Вложение.СтруктураИниФайла, СоставПакета, МассивОснований, ТекущийДокумент1С);
		Если ДанныеДозаполнить.Отказ
			Или	Документ1С = Неопределено Тогда
			
			//Были ошибки формирования документа(ов), дозаполнить состяние и сообщение, если в функциях что-то упущено
			Если ПустаяСтрока(СтрокаРезультат.Состояние) Тогда
				СтрокаРезультат.Состояние = "Ошибка формирования документа.";
			КонецЕсли;
			
			Если ПустаяСтрока(СтрокаРезультат.Сообщение) Тогда
				
				ДействиеСтрокой = ?(СоздаемНовый, "создать новый документ " + СтрокаРезультат.Название, "перезаполнить " + ТекущийДокумент1С);
				СтрокаРезультат.Сообщение = "Не удалось " + ДействиеСтрокой;  
				
			КонецЕсли;
			
			ПараметрыОшибки = Новый Структура("message,details", СтрокаРезультат.Состояние, СтрокаРезультат.Сообщение);
			ДопПараметрыДобавленияОшибки = Новый Структура("ПараметрыСчетчика", сбисПараметрыСчетчика);
			РезультатДействия_ДобавитьОшибку(Кэш, Результат, СтрокаРезультат, ПараметрыОшибки, ДопПараметрыДобавленияОшибки, ОшибкиЗагрузки);
			
		Иначе
			
			СтрокаРезультат.Состояние = "Обработан";            
			ПараметрыРезультата = Новый Структура("КлючГруппировки, ПараметрыСчетчика", СтрокаРезультат.Состояние, сбисПараметрыСчетчика);
			РезультатДействия_ДобавитьРезультат(Кэш, Результат, СтрокаРезультат, ПараметрыРезультата);
			
			ДобавитьОснование = Истина;
			
			Для каждого ОснованиеСтруктура Из МассивОснований Цикл
				
				Если ТипЗнч(ОснованиеСтруктура) = Тип("Структура") Тогда
					
					Если ОснованиеСтруктура.ДокОснование = Документ1С Тогда
						
						Если Вложение.СтруктураИниФайла.Свойство("мТаблДок") Тогда
							
							Для каждого мТаблДок Из Вложение.СтруктураИниФайла.мТаблДок Цикл
								
								Если ОснованиеСтруктура.МассивТабЧастей.Найти(мТаблДок.Ключ) = Неопределено
									И Вложение.Свойство("СтруктураДокумента1С")
									И Вложение.СтруктураДокумента1С.Свойство(мТаблДок.Ключ) Тогда
									ОснованиеСтруктура.МассивТабЧастей.Добавить(мТаблДок.Ключ);
								КонецЕсли; 
								
							КонецЦикла;
							
						КонецЕсли;
						
						ДобавитьОснование = Ложь;
						Прервать;
					КонецЕсли;
					
				ИначеЕсли ОснованиеСтруктура = Документ1С Тогда
					
					ДобавитьОснование = Ложь;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ДобавитьОснование Тогда
				
				МассивТабЧастей = Новый Массив;
				Если Вложение.СтруктураИниФайла.Свойство("мТаблДок") Тогда
					
					Для каждого мТаблДок Из Вложение.СтруктураИниФайла.мТаблДок Цикл
						
						Если Вложение.Свойство("СтруктураДокумента1С")
							И Вложение.СтруктураДокумента1С.Свойство(мТаблДок.Ключ) Тогда
							МассивТабЧастей.Добавить(мТаблДок.Ключ);	
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				МассивОснований.Добавить(Новый Структура("ДокОснование, МассивТабЧастей", Документ1С, МассивТабЧастей));
			КонецЕсли;
			
		КонецЕсли;
		
		Результат.Удалить("ВременныеДанные");
		
	КонецЦикла;
	
	Если Не ОшибкиЗагрузки Тогда
		Выполнено = Булево(УпорядоченныйСоставПакета.Количество());
		ПараметрыРезультата = Новый Структура("Выполнено, ПараметрыСчетчика", Выполнено, сбисПараметрыСчетчика);
		РезультатДействия_ДобавитьРезультат(Кэш, Результат, Неопределено, ПараметрыРезультата); 
		
		//AU tda//Если все документы были загружены успешно, то удаляем файл
		Если Выполнено И Кэш.ИнтеграцияИмя = "ИнтеграцияКаталог"  Тогда
			Кэш.Интеграция.УдалитьФайлПакетаДокументов(УпорядоченныйСоставПакета[0].Файл.СсылкаНаФайл);
		КонецЕсли;
		
	КонецЕсли;
	
	ОписаниеСтатистики = Новый Структура("Действие, Результат", "Загрузка", Кэш.РезультатДействия);
	
	МодульОбъектаКлиент().ПрикладнаяСтатистика_ДобавитьПараметр(ОписаниеСтатистики.Результат.ПрикладнаяСтатистика, "ТипДокумента", СоставПакета.Тип);
	сбисСтатистика_СформироватьИЗаписатьСтатистикуНаСервис(Кэш, ОписаниеСтатистики, Ложь);
	
	ОписаниеОповещенияРезультат = Неопределено;
	
	Если	ПараметрыЗагрузки.Свойство("ОбработчикРезультата",ОписаниеОповещенияРезультат)
		И	ПараметрыЗагрузки.ВыполнитьОбработчик Тогда
		
		МодульОбъектаКлиент().ВыполнитьСбисОписаниеОповещения(Результат, ОписаниеОповещенияРезультат);
		
		Возврат Неопределено; 
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

