
//////////////////Разбор документов/////////////////

// функция формирует структуру данных по пакету электронных документов, необходимую для его загрузки в 1С
&НаКлиенте
Функция РазобратьСтруктуруДокументаСбис(ПолныйСоставПакета, Кэш, ИмяРеквизитаВложений = "Вложение") Экспорт

	ПараметрыРазбора = Новый Структура;
	ПараметрыРазбора.Вставить("ИмяРеквизитаВложений", ИмяРеквизитаВложений);
	
	Попытка
		
		МодульОбъектаКлиент().СоставПакета_РазобратьДляЗагрузки(ПолныйСоставПакета, ПараметрыРазбора);
		
	Исключение
		
		МодульОбъектаКлиент().СбисСообщить(ИнформацияОбОшибке(), "РаботаСДокументами1С.РазобратьСтруктуруДокументаСбис");
		
	КонецПопытки;
	
	Возврат ПолныйСоставПакета;
	
КонецФункции

//Функция возвращает разобрынные данные вложения XMLДокумента, СтруктураФайла, ФорматДляЗагрузки, ВерсияФорматаДляЗагрузки
&НаКлиенте
Функция ПолучитьРазобранныеДанныеВложенияСбис(Кэш, ПолныйСоставПакета, Вложение, ДополнительныеПараметры, Отказ) Экспорт
	
	ПараметрыРазбора = Новый Структура;
	ПараметрыРазбора.Вставить("СоставПакета", ПолныйСоставПакета);
	МодульОбъектаКлиент().ВложениеСБИС_РазобратьДляЗагрузки(Вложение, ПараметрыРазбора);
	
	Возврат Вложение;
	
КонецФункции

