
// функции для совместимости кода 
&НаКлиенте
Функция сбисПолучитьФорму(ИмяФормы)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Попытка
			ЭтотОбъект="";
		Исключение
		КонецПопытки;
		Возврат ПолучитьФорму("ВнешняяОбработка.СБИС.Форма."+ИмяФормы);
	КонецЕсли;
	Возврат ЭтотОбъект.ПолучитьФорму(ИмяФормы);
КонецФункции

&НаКлиенте
Функция сбисЭлементФормы(Форма,ИмяЭлемента)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Форма.Элементы.Найти(ИмяЭлемента);
	КонецЕсли;
	Возврат Форма.ЭлементыФормы.Найти(ИмяЭлемента);
КонецФункции

&НаКлиенте
Функция сбисПолучитьСтраницу(Элемент, ИмяСтраницы)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Элемент.ПодчиненныеЭлементы[ИмяСтраницы];
	КонецЕсли;
	Возврат Элемент.Страницы[ИмяСтраницы];
КонецФункции

//------------------------------------------------------

// Функция заполняет данные о прохождении документа	
&НаКлиенте
Функция ЗаполнитьПрохождение(СоставПакета) Экспорт
	Если	МестныйКэш = Неопределено 
		И 	НЕ ЭтаФорма.ВладелецФормы = Неопределено Тогда
		
		Попытка
			МестныйКэш = ЭтаФорма.ВладелецФормы.Кэш;
		Исключение
			МестныйКэш = ЭтаФорма.ВладелецФормы.МестныйКэш;
		КонецПопытки;
	КонецЕсли;
	Возврат МестныйКэш.ОбщиеФункции.ЗаполнитьПрохождение(МестныйКэш, СоставПакета, Новый Структура);
КонецФункции

//Процедура открывает окно просмотра документа		
&НаКлиенте
Процедура ПоказатьДокумент(Кэш, СтрТабл) Экспорт
	Перем Вложения, СсылкаНаПервоеВложение;
	МестныйКэш = Кэш;   
	ГлавноеОкно = Кэш.ГлавноеОкно;
	Кэш.СписокНоменклатуры.Очистить();
	МассивПакетов = ПодготовитьСтруктуруДокумента(СтрТабл, Кэш);
	Если МассивПакетов.Количество() = 1 Тогда
		ПолныйСоставПакета = МассивПакетов[0];
		Если ПолныйСоставПакета.Свойство("Ошибка") Тогда
			МодульОбъектаКлиент().СообщитьСбисИсключение(ПолныйСоставПакета.Ошибка);
			Возврат;
		ИначеЕсли Не ПолныйСоставПакета.Свойство("Вложение", Вложения) Тогда
			Возврат;
		КонецЕсли;
		
		//UAA НоваяЛента
		Если НЕ ЗначениеЗаполнено(Вложения) Тогда
			
			Возврат;
			
		КонецЕсли;
		
		//1189641556
		ТекущийРаздел = Кэш.Текущий.ОписаниеРаздела.Имя;   
		
		ДопПараметры = Новый Структура;  
		ДопПараметры.Вставить("ТекущийРаздел",	ТекущийРаздел); 
		ДопПараметры.Вставить("Вложения",		Вложения); 
		
		ПодготовитьДокументКПросмотру(ПолныйСоставПакета, ДопПараметры);
		
		Если МодульОбъектаКлиент().ИспользоватьНовоеСопоставлениеНоменклатуры() Тогда 
			фрм = ГлавноеОкно.сбисНайтиФормуФункции("ПоказатьДокумент","ФормаПросмотрДокументаРасширенноеСопоставление","", Кэш);
			фрм.ПоказатьДокумент(Кэш,ПолныйСоставПакета); 	
		Иначе
			фрм = ГлавноеОкно.сбисНайтиФормуФункции("ПоказатьДокумент", "ФормаПросмотрДокумента","", Кэш);
			фрм.ПоказатьДокумент(Кэш,ПолныйСоставПакета);
		КонецЕсли;
		
	ИначеЕсли МассивПакетов.Количество() > 1 Тогда
		
		фрм = ГлавноеОкно.сбисНайтиФормуФункции("ПоказатьДокументы","ФормаПросмотрДокументов","", Кэш);
		фрм.ПоказатьДокументы(Кэш, МассивПакетов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьДокументКПросмотру(МассивПакетов, ДопПараметры) Экспорт

	Перем СсылкаНаПервоеВложение, Вложения;
	
	Кэш = МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш(); 

	Если ДопПараметры.Свойство("Вложения", Вложения)		
		И Вложения[0].Свойство("Документы1С", СсылкаНаПервоеВложение)
		И	СсылкаНаПервоеВложение.Количество() Тогда
		
		СсылкаНаПервоеВложение = СсылкаНаПервоеВложение[0].Значение;
		Отказ = Ложь;
		ДопПараметрыПолученияИдСБИС = Новый Структура("СоставПакета", МассивПакетов);
		ПараметрыПакетаСБИС	= Кэш.ОбщиеФункции.ИдентификаторСБИСПоДокументу(Кэш, СсылкаНаПервоеВложение, ДопПараметрыПолученияИдСБИС);
		ИдДок				= ПараметрыПакетаСБИС.ИдДокумента;
		Если	ЗначениеЗаполнено(ИдДок)
			И	МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("ИдАккаунта") = ПараметрыПакетаСБИС.ИдАккаунта Тогда
			ДопПоля = МодульОбъектаКлиент().СоставПакета_Получить(МассивПакетов, "ДопПоля");
			РеализацияЕИС = ?(ТипЗнч(ДопПоля) = Тип("Массив"), ДопПоля.Найти("ЕИС") <> Неопределено, Ложь);
			ДопПараметры = Новый Структура("СообщатьПриОшибке, ВернутьОшибку, РеализацияЕИС", Ложь, Истина, РеализацияЕИС);
			РезультатЧтенияПоИд = Кэш.Интеграция.ПрочитатьДокумент(Кэш, ИдДок, ДопПараметры, Отказ);
			Если Не Отказ Тогда
				ПодготовитьДокументКПросмотру_ДополнитьДаннымиОнлайна(МассивПакетов, РезультатЧтенияПоИд);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// 4Sych
	Для Каждого Элемент Из Вложения Цикл
		МодульОбъектаКлиент().ВложениеСБИС_Получить(Элемент, "ВизуализацияДокумента", Новый ФиксированнаяСтруктура("СоставПакета", МассивПакетов));
		Прервать;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьДокументКПросмотру_ДополнитьДаннымиОнлайна(ПолныйСоставПакета, РезультатЧтенияПоИд)
	
	Если ТипЗнч(РезультатЧтенияПоИд) <> Тип("Структура")
		// Патчим данными онлайна, только если совпадает тип, иначе сопоставлено что-то другое
		ИЛИ ПолныйСоставПакета.Свойство("Тип")
		И НЕ ПолныйСоставПакета.Тип = РезультатЧтенияПоИд.Тип Тогда
		Возврат;
	КонецЕсли;
	
	ДопПоля = "Расширение,
		|РеализацияЕИС,
		|Идентификатор,
		|Состояние,
		|Этап";
	
		Если МодульОбъектаКлиент().ПолучитьЗначениеПараметраСбис("ПоддержкаОбменаЕИС")
			И РезультатЧтенияПоИд.Свойство("ДокументОснование") Тогда
		ДопПоля = ДопПоля + ",
			|ДокументОснование";
	КонецЕсли;
	
	Если РезультатЧтенияПоИд.Свойство("Событие") Тогда
		ДопПоля = ДопПоля + ",
			|Событие";
	КонецЕсли;
	
	Изменения = Новый Структура(ДопПоля);
	ЗаполнитьЗначенияСвойств(Изменения, РезультатЧтенияПоИд);
	
	МодульОбъектаКлиент().СоставПакета_Обновить(ПолныйСоставПакета, Новый Структура("ДопПоля", Изменения));
	
	ДопПоляВложений = Новый Массив;
	ДопПоляВложений.Добавить("Идентификатор");
	
	Для каждого СБИСВложение Из РезультатЧтенияПоИд.Вложение Цикл
		
		ПараметрыПоиска = Новый Структура("Тип, Номер, ПодТип, ВерсияФормата");
		ЗаполнитьЗначенияСвойств(ПараметрыПоиска, СБИСВложение);
		ПараметрыПоиска.Вставить("Дата", Формат(СБИСВложение.Дата, "ДФ=dd.MM.yyyy"));
		ВложениеИз1С = МодульОбъектаКлиент().СоставПакета_Получить(ПолныйСоставПакета, "Вложение", ПараметрыПоиска);
		
		Если ВложениеИз1С = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого Поле Из ДопПоляВложений Цикл
			ВложениеИз1С.Вставить(Поле, СБИСВложение[Поле]);
		КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры

//Процедура обновляет панель массовых операций, панель фильтра, контекстное меню при смене раздела		
&НаКлиенте
Процедура НаСменуРаздела(Кэш) Экспорт
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("НаСменуРаздела","Раздел_Продажа_Продажа","", Кэш);
	фрм.НаСменуРаздела(Кэш);
КонецПроцедуры

// Функция готовит структуру пакета электронных документов по комплекту документов 1С для просмотра и отправки контрагентам.
&НаКлиенте
Функция ПодготовитьСтруктуруДокумента(СтрокаСпискаДокументов, Кэш) Экспорт
	// Т.к. по одной строке документов 1С может быть сформировано несколько комплектов (оказание услуги), то структуры пакетов добавляются в массив.	
	Возврат Кэш.ОбщиеФункции.ПодготовитьСтруктуруДокумента1С(СтрокаСпискаДокументов, Кэш);	
КонецФункции

&НаКлиенте
Функция ПодготовитьСтруктуруДокументаДляРасхождений(СтрокаСпискаДокументов, Кэш) Экспорт
	
	Попытка
		Возврат МодульОбъектаКлиент().ПодготовитьСтруктуруДокументаДляРасхожденийДляРеестра1С(СтрокаСпискаДокументов);
	Исключение
		МодульОбъектаКлиент().ВызватьСбисИсключение(ИнформацияОбОшибке(), "Раздел_Продажа_Шаблон.ПодготовитьСтруктуруДокументаДляРасхождений");
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Функция сбисСписокДополнительныхОпераций(Кэш, ФормаПросмотра) Экспорт
	СписокДопОпераций = Новый СписокЗначений;
	СписокДопОпераций.Добавить("СохранитьНаДиск", "Сохранить на диск");
	СписокДопОпераций.Добавить("ОткрытьКонтрагентаОнлайнПоПакету", "Открыть контрагента на saby.ru");
	ФормаПросмотра.СервисДопОперацияПросмотра(СписокДопОпераций);	// alo доп операции из инишки Сервис
	Ини = Кэш.ФормаНастроек.Ини(Кэш, Кэш.Текущий.ТипДок);
	Если Ини.Свойство("ДопОперацияПросмотра")  Тогда
		Для Каждого ДопОперация Из Ини.ДопОперацияПросмотра Цикл
			СписокДопОпераций.Добавить(ДопОперация.Значение.Операция.Функция1С, Кэш.ОбщиеФункции.РассчитатьЗначение("Операция", ДопОперация.Значение, Кэш));
		КонецЦикла;
	КонецЕсли;
	Возврат СписокДопОпераций;
КонецФункции

&НаКлиенте
Функция СохранитьНаДиск(Кэш, ФормаПросмотра) Экспорт
	ФормаПросмотра.СохранитьНаДискНажатие("");
КонецФункции

&НаКлиенте
Функция сбисПараметрыСписокИзменений(Кэш) Экспорт
	ДопПараметры = Новый Структура;
	Ини = Кэш.ФормаНастроек.Ини(Кэш, Кэш.Текущий.ТипДок);
	Если Ини.Свойство("СписокИзменений_Тип")  Тогда
		ДопПараметры.Вставить("Тип", Кэш.ОбщиеФункции.РассчитатьЗначение("СписокИзменений_Тип", Ини, Кэш));
	КонецЕсли;  
	Возврат ДопПараметры; 
КонецФункции

&НаКлиенте
Функция ОбновитьКонтентПодговитьРаздел(ПараметрыОбновления, ДопПараметры) Экспорт
	
	Кэш = ДопПараметры.Кэш; 
	
	Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно,"ПанельФильтра").Видимость = Истина;
	Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно,"ПоказатьПанельФильтра").Видимость = Истина;
	
	МодульОбъектаКлиент().СкрытьДополнительныйАккордеон();

	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура НастроитьКолонки(Кэш) Экспорт
	ИмяРеестра="";	Ини="";
	Если Кэш.Разделы.Продажа.Свойство(Кэш.Текущий.Имя,ИмяРеестра)=Ложь Тогда
		Сообщить("Отсутствует настройка для перехода в раздел. Доступные настройки можно подключить на вкладке ""Настройки/Файлы настроек""");
		Возврат;
	КонецЕсли;
	Если Кэш.ини.Свойство(ИмяРеестра,Ини)=Ложь Тогда
		Возврат;
	ИначеЕсли Ини = Неопределено Тогда
		Ини = Кэш.ФормаНастроек.Ини(Кэш, ИмяРеестра);
	КонецЕсли;
	Кэш.ОбщиеФункции.НастроитьКолонки(Ини, Кэш);	// alo СтатусГос

	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Ответственный").Видимость = Ложь;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.ТекущийЭтап").Видимость = Ложь;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.СтатусВГосСистеме").Видимость = Кэш.Парам.СтатусыВГосСистеме;
	Если Не Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно,"Таблица_РеестрДокументов.Склад").Ширина = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов").Ширина / 30;
	КонецЕсли;
	
	КолонкиИзменить	= Новый	Массив;
	Если  Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		ДобавитьКИмениКолонки = "Таблица_РеестрДокументов";
		ПараметрИзменить = "Заголовок";
		ПутьККолонкам	= "Элементы.Таблица_РеестрДокументов.ПодчиненныеЭлементы";
	Иначе
		ДобавитьКИмениКолонки = "";
		ПараметрИзменить = "ТекстШапки";
		ПутьККолонкам	= "ЭлементыФормы.Таблица_РеестрДокументов.Колонки";
	КонецЕсли;
	КолонкиИзменить.Добавить(Новый Структура("ПолноеИмяКолонки, ИмяКолонки, ПараметрыИзменить", ДобавитьКИмениКолонки + "Лицо2", "Лицо2", Новый Структура(ПараметрИзменить, "Грузополучатель")));
	КолонкиИзменить.Добавить(Новый Структура("ПолноеИмяКолонки, ИмяКолонки, ПараметрыИзменить", ДобавитьКИмениКолонки + "Склад", "Склад", Новый Структура(ПараметрИзменить, "Склад")));
	
	СтруктураОбновления	= Новый	Структура();
	СтруктураОбновления.Вставить("ИмяТаблицы",		"Таблица_РеестрДокументов");
	СтруктураОбновления.Вставить("СтруктураПолей",	Новый	Структура("КолонкиИзменить", КолонкиИзменить));
	СтруктураОбновления.Вставить("ПутьККолонкам",	ПутьККолонкам);
	
	Кэш.ГлавноеОкно.НастроитьКолонкиФормы(СтруктураОбновления);

КонецПроцедуры

// Функция делает подготовку к переходу	
&НаКлиенте
Функция ОбновитьКонтент_ПередВызовом(СтруктураРаздела, Кэш) Экспорт
	
	фрм = Кэш.ГлавноеОкно.СбисПолучитьФорму("Раздел_Продажа_Продажа");
	фрм.ОбновитьКонтент_ПередВызовом(СтруктураРаздела, Кэш);
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементовВформеПросмотра(ФормаПросмотра, СоставПакета, КэшПарам) Экспорт
	
	ФормаПросмотра.ДокументРазобран = Истина;
	
	ПараметрыПакетаОбновить = Новый Структура;
	ПараметрыПакетаОбновить.Вставить("ЗагрузкаПоддерживается",	Ложь);
	ПараметрыПакетаОбновить.Вставить("ВыборочноеШифрование",	Истина);
	ПараметрыПакетаОбновить.Вставить("Разобран",				Истина);
	ПараметрыПакетаОбновить.Вставить("УдалятьВложения",			Истина);
	ПараметрыПакетаОбновить.Вставить("АбонентскийЯщик",			Истина);
	ПараметрыПакетаОбновить.Вставить("УказыватьКомментарий",	Истина);
	ПараметрыПакетаОбновить.Вставить("ОтмечатьВложения",		Истина);
	МодульОбъектаКлиент().СоставПакета_Обновить(СоставПакета, Новый ФиксированнаяСтруктура("Параметры", ПараметрыПакетаОбновить));
	
	ПанельТулБара = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ФормаПросмотра, "ТулБар");
	ПанельТулБара.ТекущаяСтраница = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ПанельТулБара, "Продажа"); 
	
КонецПроцедуры

&НаКлиенте
Функция СписокСостоянийДокумента() Экспорт

	СписокСостояний = Новый СписокЗначений();
	СписокСостояний.Добавить("Все документы");
	СписокСостояний.Добавить("Недоставленные");
	СписокСостояний.Добавить("Не получен ответ");
	СписокСостояний.Добавить("Утвержденные");
	СписокСостояний.Добавить("Отклоненные");
	СписокСостояний.Добавить("С ошибками");
	СписокСостояний.Добавить("Удаленные контрагентом");
	СписокСостояний.Добавить("Удаленные мной");
	СписокСостояний.Добавить("Не отправленные");
	
	Возврат СписокСостояний;
	
КонецФункции


