
&НаКлиенте
Функция  old_СтрКОнтрагент(КонтрагентВходящий)
	Перем ИННСтороныНайден;
	
	Если	Не ЗначениеЗаполнено(КонтрагентВходящий)
		Или	Не ТипЗнч(КонтрагентВходящий) = Тип("Структура") Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Если	КонтрагентВходящий.Свойство("СвЮЛ", ИННСтороныНайден) Тогда
		
		// Уже есть поля СвФл/СвЮЛ для стороны
		Возврат Новый Структура("СвЮЛ", ИННСтороныНайден);
		
	ИначеЕсли	КонтрагентВходящий.Свойство("СвФЛ", ИННСтороныНайден) Тогда
		
		Возврат Новый Структура("СвФЛ", ИННСтороныНайден);
		
	ИначеЕсли	(	КонтрагентВходящий.Свойство("СвИн")
				И	КонтрагентВходящий.СвИн.Свойство("Идентификатор", ИННСтороныНайден))
			Или	(	КонтрагентВходящий.Свойство("ИдентификаторЛица", ИННСтороныНайден)
				И	ЗначениеЗаполнено(ИННСтороныНайден)) Тогда
		
		СвЮЛ = Новый Структура("ИНН", ИННСтороныНайден);
		
		Возврат Новый Структура("СвЮЛ", СвЮЛ);
		
	ИначеЕсли	КонтрагентВходящий.Свойство("Контрагент1С", ИННСтороныНайден) Тогда
		
		// Рассчитать контрагента по ссылке
		Кэш = МодульОбъектаКлиент().ПолучитьтекущийЛокальныйКэш();
		сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "СтороныПоСсылкам", ИННСтороныНайден); 
		сбисОписаниеОбъекта.Значение = Кэш.ОбщиеФункции.сбисПолучитьЗначениеРассчитанногоОбъекта(Кэш, сбисОписаниеОбъекта);
		
		Если сбисОписаниеОбъекта.Значение = Неопределено Тогда
			
			СписокСторонПолучить = Новый Массив;
			СписокСторонПолучить.Добавить(ИННСтороныНайден);
			ДанныеСторон = МодульОбъектаКлиент().ПрочитатьСтороныПоДанным1С(СписокСторонПолучить);
			
			сбисОписаниеОбъекта.Значение = ДанныеСторон.Получить(ИННСтороныНайден).Результат;
			Кэш.ОбщиеФункции.сбисЗакэшироватьЗначениеРассчитанногоОбъекта(Кэш, сбисОписаниеОбъекта);
		КонецЕсли;
		
		Возврат сбисОписаниеОбъекта.Значение;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Получает номенклатуру 1С по структуре контрагента и номенклатуры СБИС. Вызывает функцию поиска номенклатуры на сервере 
&НаКлиенте
Функция old_НайтиНоменклатуруПоставщикаПоТабличнойЧасти(КонтрагентСопоставленияВходящий, мТаблДок, КаталогНастроек, Ини) Экспорт

	СчетчикСтрок = 0;
	СтрокиПоиска = Новый Структура;
	
	стрКонтрагент = old_СтрКОнтрагент(КонтрагентСопоставленияВходящий);
	Для Каждого СтрТабл Из мТаблДок Цикл
		СтрокаПоиска = Новый Структура;
		Если СтрТабл.Свойство("Название") Тогда
			СтрокаПоиска.Вставить("Название",		СтрТабл.Название);
		КонецЕсли;
		Если СтрТабл.Свойство("КодПокупателя") Тогда
			СтрокаПоиска.Вставить("КодПокупателя",	СтрТабл.КодПокупателя);
		КонецЕсли;
		Если СтрТабл.Свойство("Идентификатор") Тогда
			СтрокаПоиска.Вставить("Идентификатор",	СтрТабл.Идентификатор);
		КонецЕсли;
		Если СтрТабл.Свойство("ЕдИзмОрг") Тогда
			СтрокаПоиска.Вставить("ЕдИзмОрг",	СтрТабл.ЕдИзмОрг);
		КонецЕсли;
		Если СтрТабл.Свойство("Коэффициент") Тогда
			СтрокаПоиска.Вставить("Коэффициент",	СтрТабл.Коэффициент);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаПоиска) Тогда
			ВызватьИсключение("НайтиНоменклатуруПоставщикаПоТабличнойЧасти() Отсутствует название и идентификатор номенклатуры для поиска в строке №" + (СчетчикСтрок+1));
		КонецЕсли;
		СтрокиПоиска.Вставить("СтрТабл_"+Формат(СчетчикСтрок, "ЧН=0; ЧГ=0"),СтрокаПоиска);
		СчетчикСтрок = СчетчикСтрок + 1;
	КонецЦикла;
	Отказ = Ложь;
	Рез = НайтиНоменклатуруПоставщикаПоТабличнойЧастиНаСервере(стрКонтрагент, СтрокиПоиска, КаталогНастроек, Ини.Конфигурация, Отказ);
	Если Отказ Тогда
		ПараметрыСообщения = Новый Структура;
		ПараметрыСообщения.Вставить("ТекстСсылка",	"Решение проблемы");
		ПараметрыСообщения.Вставить("Текст",		"Возникла проблема при работе с com-объектом ""ADODB.Connection"""+Символы.ПС+Рез);
		ПараметрыСообщения.Вставить("АдресСсылка",	"https://saby.ru/help/integration/catalog/driver_not_found");

		ФормаПредупреждение = ЛокальныйКэш.ГлавноеОкно.сбисПолучитьФорму("ФормаПредупреждения");
		ФормаПредупреждение.ПоказатьПоверх(ПараметрыСообщения);
		ВызватьИсключение("Проблема с драйвером ODBC");
	КонецЕсли;
	Возврат Рез; 
	
КонецФункции

// Функция ищет номенклатуру поставщика по идентификатору.
// Если сопоставление заполнено, возвращает структуру с номенклатурой и характеристикой номенклатуры
&НаКлиенте
Функция old_НайтиНоменклатуруПоставщика(КонтрагентСопоставленияВходящий, стрНоменклатураПоставщика, КаталогНастроек, Ини, ДопПараметры = Неопределено) Экспорт 
	
	Отказ			= Ложь;
	стрКонтрагент	= old_СтрКОнтрагент(КонтрагентСопоставленияВходящий);
	Рез = НайтиНоменклатуруПоставщикаНаСервере(стрКонтрагент, стрНоменклатураПоставщика, КаталогНастроек, Ини.Конфигурация, Отказ, ДопПараметры);
	Если Отказ Тогда
		ПараметрыСообщения = Новый Структура;
		ПараметрыСообщения.Вставить("ТекстСсылка",	"Решение проблемы");
		ПараметрыСообщения.Вставить("Текст",		"Возникла проблема при работе с com-объектом ""ADODB.Connection"""+Символы.ПС+Рез);
		ПараметрыСообщения.Вставить("АдресСсылка",	"https://saby.ru/help/integration/catalog/driver_not_found");

		ФормаПредупреждение = ЛокальныйКэш.ГлавноеОкно.сбисПолучитьФорму("ФормаПредупреждения");
		ФормаПредупреждение.ПоказатьПоверх(ПараметрыСообщения);
		ВызватьИсключение("Проблема с драйвером ODBC");
	КонецЕсли;
	Возврат Рез;
	
КонецФункции

// Процедура устанавливает/удаляет соответствие номенклатуры	
&НаКлиенте
Процедура old_УстановитьСоответствиеНоменклатуры(КонтрагентСопоставленияВходящий, стрНоменклатураПоставщика, КаталогНастроек, Ини) Экспорт
	
	стрКонтрагент	= old_СтрКОнтрагент(КонтрагентСопоставленияВходящий);
	УстановитьСоответствиеНоменклатурыНаСервере(стрКонтрагент, стрНоменклатураПоставщика, КаталогНастроек, Ини.Конфигурация);
	
КонецПроцедуры

// Процедура ищет идентификатор номенклатуры контрагента	
&НаКлиенте
Функция old_ПолучитьИдентификаторНоменклатурыПоставщика(КонтрагентСопоставленияВходящий, стрНоменклатура, КаталогНастроек, Ини) Экспорт
	
	стрКонтрагент = old_СтрКОнтрагент(КонтрагентСопоставленияВходящий);
	Возврат сбисПолучитьРеквизитНоменклатурыПоставщикаНаСервере(стрКонтрагент, стрНоменклатура, "ID", КаталогНастроек, Ини.Конфигурация);
	
КонецФункции

