
//Получает html по xml	
&НаКлиенте
функция ПолучитьHTMLПоXML(Кэш, Вложение) Экспорт 
	Отказ				= Ложь;
	ДопПараметрыЗапроса	= Новый Структура("ЕстьРезультат", Истина);
	
	Если ТипЗнч(Вложение) = Тип("Структура") Тогда
		Вложение.XMLДокумента = СтрЗаменить(Вложение.XMLДокумента, "UTF-8", "windows-1251");	
		document = Новый Структура("XML", Вложение.XMLДокумента);
	Иначе   // для совместимости с внешними функциями (СформироватьРасхождение)
		document = Новый Структура("XML", Вложение);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(document) Тогда
		Возврат "";
	КонецЕсли;
	
	РезультатЗапроса = СБИС_СформироватьHTMLИзXML(Кэш, document,, Отказ);
	Если Отказ Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат РезультатЗапроса;
КонецФункции

